             PGM
             /*_____________________*/
             /* DEKLARERE VARIABLER */
             /*"""""""""""""""""""""*/
             DCL        VAR(&STRTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&ENDTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UIBDLY) TYPE(*CHAR) LEN(5)
             /*__________________________________________________*/
             /* DENNE JOBBEN KAN BLI STARTET *IMMED ELLER        */
             /* VENTER TIL ET KLOKKESLETT SOM FINNES I FIRMANS   */
             /* DATAAREA.                                        */
             /*""""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(EDIDTA (154 6)) RTNVAR(&STRTIME)
             IF         COND(&STRTIME *EQ *IMMED) THEN(GOTO +
                          CMDLBL(START))

             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&STRTIME *LE &QTIME) THEN(GOTO +
                          CMDLBL(START))

 /*__________________________*/
 /* SKAL POLLING AVSLUTTES ? */
 /*""""""""""""""""""""""""""*/
 START:      RTVDTAARA  DTAARA(EDIDTA (160 6)) RTNVAR(&ENDTIME)
             IF         COND(&ENDTIME *NE *NONE) THEN(DO)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&ENDTIME *LT &QTIME) THEN(GOTO +
                          CMDLBL(END))
             ENDDO
             /*________________*/
             /* SJEKK TRACKL06 */
             /*""""""""""""""""*/
             CALL       PGM(ESTSTT)
             RTVDTAARA  DTAARA(EDIDTA (166 5)) RTNVAR(&UIBDLY)
             DLYJOB     DLY(&UIBDLY)
             DLYJOB     DLY(&UIBDLY)
             DLYJOB     DLY(&UIBDLY)
             DLYJOB     DLY(&UIBDLY)
             GOTO       CMDLBL(START)
 END:        ENDPGM
