             PGM        PARM(&FRA)
             DCL        VAR(&FRA) TYPE(*CHAR) LEN(70)
/* SLETTER        */
             DEL        OBJLNK(&FRA)
             MONMSG     MSGID(CPF0000)
             ENDPGM
