/* N01  CVP1 RETTET TIL 80 TEGN   DERFOR ENDRING I UDS OGSÅ */
/* PTF 2109-2005 ØKT FRA 30 TIL 50 POSISJONER */
/* PTF 2911-2010 ØKT FRA 70 TIL 140 BANE */
/* PTF 1209-2012 TAR HØYDE FOR DISTRIBUSJONSLISTE            */
/* N02  CVP1 KUTTET TIL 70 FØR KALL PÅ EMLSTMF               */
/* N03  VARIABEL BANE TIL MERGET DOKUMENT                   */
             PGM        PARM(&PARM)
/*N03*/      DCL        VAR(&NAVNF) TYPE(*CHAR) LEN(30)
/*N03*/      DCL        VAR(&ARBAN0) TYPE(*CHAR) LEN(30)
/*N02*/      DCL        VAR(&AV) TYPE(*CHAR) LEN(4)
/*N02*/      DCL        VAR(&OP) TYPE(*CHAR) LEN(7)
/*N02*/      DCL        VAR(&TU) TYPE(*CHAR) LEN(8)
/*N02*/      DCL        VAR(&KU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FLER) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&FLERM) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&MANAUT) TYPE(*CHAR) LEN(1) VALUE('A')
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)
/*N03*/      DCL        VAR(&ARKK) TYPE(*CHAR) LEN(8) +
                          VALUE('ARKIVMRG') /*N03*/
/*N03*/      DCL        VAR(&ARKN) TYPE(*DEC) LEN(7 0)
/*N03*/      DCL        VAR(&ARKA) TYPE(*CHAR) LEN(7)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
/*N03*/      DCL        VAR(&DOKMER) TYPE(*CHAR) LEN(40)
/*S03        DCL        VAR(&PARM) TYPE(*CHAR) LEN(458)  */
/*N03*/      DCL        VAR(&PARM) TYPE(*CHAR) LEN(1059)
             DCL        VAR(&RPLNA) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&RPLAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DISTL) TYPE(*CHAR) LEN(6) /* DISTLISTE */
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO30) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO50) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
/*E01*/      DCL        VAR(&CVP1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP10) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP11) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP12) TYPE(*CHAR) LEN(80)
             DCL        VAR(&IE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BANE1) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE2) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE3) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE4) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE5) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE6) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE7) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE8) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BANE9) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN10) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN11) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN12) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN13) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN14) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN15) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN16) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN17) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN18) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN19) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN20) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN21) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN22) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN23) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN24) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN25) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN26) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN27) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN28) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN29) TYPE(*CHAR) LEN(140)
             DCL        VAR(&BAN30) TYPE(*CHAR) LEN(140)
             DCL        VAR(&DISTL) TYPE(*CHAR) LEN(6) /* DISTLISTE */
             DCL        VAR(&DIST) TYPE(*CHAR) LEN(1) /* DISTLISTE */
             DCL        VAR(&EPO01) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO02) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO03) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO04) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO05) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO06) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO07) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO08) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO09) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO10) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO11) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO12) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO13) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO14) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO15) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO16) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO17) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO18) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO19) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO20) TYPE(*CHAR) LEN(70)
             DCL        VAR(&MRG) TYPE(*CHAR) LEN(1)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRMARC) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES)
             MONMSG     MSGID(CPF0000)
             RTVJOBA    USER(&QUSER) NBR(&NBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &NBR)
/*                      */
             CHGVAR     VAR(&EPOST) VALUE(%SST(&PARM 1 70))
             CHGVAR     VAR(&CVP1) VALUE(%SST(&PARM 71 80))
             CHGVAR     VAR(&CVP2) VALUE(%SST(&PARM 151 80))
             CHGVAR     VAR(&CVP3) VALUE(%SST(&PARM 231 80))
             CHGVAR     VAR(&CVP4) VALUE(%SST(&PARM 311 80))
             CHGVAR     VAR(&CVP5) VALUE(%SST(&PARM 391 80))
             CHGVAR     VAR(&CVP6) VALUE(%SST(&PARM 471 80))
             CHGVAR     VAR(&CVP7) VALUE(%SST(&PARM 551 80))
             CHGVAR     VAR(&CVP8) VALUE(%SST(&PARM 631 80))
             CHGVAR     VAR(&CVP9) VALUE(%SST(&PARM 711 80))
             CHGVAR     VAR(&CVP10) VALUE(%SST(&PARM 791 80))
             CHGVAR     VAR(&CVP11) VALUE(%SST(&PARM 871 80))
             CHGVAR     VAR(&CVP12) VALUE(%SST(&PARM 951 80))
             CHGVAR     VAR(&IE) VALUE(%SST(&PARM 1031 1))
             CHGVAR     VAR(&AV) VALUE(%SST(&PARM 1032 4))
             CHGVAR     VAR(&OP) VALUE(%SST(&PARM 1036 7))
             CHGVAR     VAR(&TU) VALUE(%SST(&PARM 1043 8))
             CHGVAR     VAR(&KU) VALUE(%SST(&PARM 1051 8))
             CHGVAR     VAR(&MRG) VALUE(%SST(&PARM 1059 1))
/*                      */
             CHGVAR     VAR(&EPO30) VALUE(&EPOST)
             CHGVAR     VAR(&EPO50) VALUE(&EPOST)
             CHGVAR     VAR(&RPLNA) VALUE(&QUSER)
             RTVNETA    SYSNAME(&RPLAD)
/*                      */
/* HENT REPLYADRESSE    */
/*                      */
/*                      */
             CALL       PGM(EPOS04N) PARM(&QUSER &RPLNA &RPLAD &EPOSTF &NAVNF)
/*                      */
/*                      */
/* LEGGER UT COVERPAGE  */
/* I SOURCE             */
/*                      */
TAGF:        RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             ADDPFM     FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(ARKSRC) MBR(&UNIK)
             OVRDBF     FILE(ARKSRC) TOFILE(&LIB/ARKSRC) +
                          MBR(&UNIK)
/*                                     */
/* EVT SLÅ SAMMEN PDF                  */
/*                                     */
             IF         COND(&MRG *EQ 'J') THEN(DO)
FLEREMRG:    CALL       PGM(SYGE49) PARM(&ARKK &ARKN)
             CHGVAR     VAR(&ARKA) VALUE(&ARKN)
             CHGVAR     VAR(&ARBAN0) VALUE(&ARCANE *TCAT '/mrg')
             MD         DIR(&ARBAN0) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&DOKMER) VALUE(&ARCANE *TCAT '/mrg/' *CAT +
                          &ARKA *CAT '.pdf')
             DEL        OBJLNK(&DOKMER)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(ARC006M) PARM(&DOKMER &FLERM)
             IF         COND(&FLERM *EQ 'J') THEN(GOTO CMDLBL(TAGF))
             ENDDO
/*                                     */
             CALL       PGM(ARC006) PARM(&CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &CVP9 &CVP10 &CVP11 +
                          &CVP12 &IE &CVP1 &EPOST &MANAUT &BANE1 +
                          &BANE2 &BANE3 &BANE4 &BANE5 &BANE6 &BANE7 +
                          &BANE8 &BANE9 &BAN10 &BAN11 &BAN12 &BAN13 +
                          &BAN14 &BAN15 &BAN16 &BAN17 &BAN18 &BAN19 +
                          &BAN20 &BAN21 &BAN22 &BAN23 &BAN24 &BAN25 +
                          &BAN26 &BAN27 &BAN28 &BAN29 &BAN30 &FLER +
                          &AV &OP &TU &KU)
/*           CALL       PGM(ARC011) PARM(&QUSER)        */
/*                                       */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/***************************************/
/* UTEN DISTRIBUSJONSLISTE             */
/***************************************/
             CHGVAR     VAR(&DIST) VALUE(%SST(&EPOST 1 1))
             CHGVAR     VAR(&DISTL) VALUE(%SST(&EPO50 2 6))
/*                                     */
             IF         COND(&DIST *NE '*') THEN(DO)
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
/*N02*/      CHGVAR     VAR(&CVP1) VALUE(%SUBSTRING(&CVP1 1 70))
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO30/&EPO50/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             IF         COND(&FLER *EQ 'J') THEN(GOTO CMDLBL(TAGF))
             RETURN
             ENDDO
/*                      */
/*N02*/      CHGVAR     VAR(&CVP1) VALUE(%SUBSTRING(&CVP1 1 70))
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO30/&EPO50/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*                      */
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
/*                      */
             RETURN
             ENDDO
/*                      */
/*                      */
/*                                       */
/***************************************/
/*  SENDING VED DISTRIBUSJONSLISTE     */
/***************************************/
/*                                     */
             CALL       PGM(EPODIS) PARM(&DISTL &EPO01 &EPO02 &EPO03 +
                          &EPO04 &EPO05 &EPO06 &EPO07 &EPO08 &EPO09 +
                          &EPO10 &EPO11 &EPO12 &EPO13 &EPO14 &EPO15 +
                          &EPO16 &EPO17 &EPO18 &EPO19 &EPO20)
/***************************************/
/*  SENDING TIL 20 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO20 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO +
                          &EPO20/&EPO20/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO +
                          &EPO20/&EPO20/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 19 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO19 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 18 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO18 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 &BANE6 &BANE7 &BANE8 +
                          &BANE9) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 17 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO17 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 16 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO16 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 15 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO15 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 14 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO14 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 13 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO13 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 12 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO12 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 11 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO11 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 10 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO10 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 9  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO09 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 08 MOTTAGERE           */
/***************************************/
             IF         COND(&EPO08 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 7  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO07 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 6  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO06 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 5  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO05 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 4  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO04 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO) +
                          TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 3  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO03 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO) +
                          STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 2  MOTTAGERE           */
/***************************************/
             IF         COND(&EPO02 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO) STMF(&BANE1 &BANE2 +
                          &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/***************************************/
/*  SENDING TIL 1  MOTTAGER            */
/***************************************/
             IF         COND(&EPO01 *NE '*NONE                    ') +
                          THEN(DO)
/*                                     */
/* SEND SOM VEDLEGG                    */
/*                                     */
             IF         COND(&BANE1 *NE '            ') THEN(DO)
             EMLSTMF    SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO) +
                          STMF(&BANE1 &BANE2 &BANE3 &BANE4 &BANE5 +
                          &BANE6 &BANE7 &BANE8 &BANE9 &BAN10 &BAN11 +
                          &BAN12 &BAN13 &BAN14 &BAN15 &BAN16 &BAN17 +
                          &BAN18 &BAN19 &BAN20 &BAN21 &BAN22 &BAN23 +
                          &BAN24 &BAN25 &BAN26 &BAN27 &BAN28 &BAN29 +
                          &BAN30) MSGM(&LIB/ARKSRC/&UNIK)
             GOTO       CMDLBL(UT)
             ENDDO
/*                                     */
             EMLMSG     SUBJECT(&CVP1) FROMNAME(&NAVNF) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(&UNIK) EDTMBR(*NO)
             GOTO       CMDLBL(UT)
                          ENDDO
/*                                                       */
/*                                                       */
/*                                                       */
UT:          RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             IF         COND(&FLER *EQ 'J') THEN(GOTO CMDLBL(TAGF))
                          ENDPGM
