             PGM
             DCL        VAR(&ARCANE) TYPE(*CHAR) LEN(30) +
                          VALUE('nas/arc')
             DCL        VAR(&ARCMRG) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ARCDEL) TYPE(*CHAR) LEN(30)
             DCL        VAR(&DGR) TYPE(*CHAR) LEN(5) VALUE('00300')
             CHGVAR     VAR(&ARCMRG) VALUE(&ARCANE *TCAT '/mrg')
             CHGVAR     VAR(&ARCDEL) VALUE(&ARCANE *TCAT '/mrgdel')
             MD         DIR(&ARCDEL) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(ARC054R) PARM(&ARCMRG &ARCDEL &DGR)
SLUTT:       ENDPGM
