             PGM        PARM(&ATYPE &AUSER &PARM)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ATYPE) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(1024)

             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE(&PARM)
             SBMJOB     CMD(CALL PGM(ARC002) PARM(&ATYPE &AUSER +
                          &FINS)) JOB(ARKIV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQARK)

             ENDPGM
