/* FINNES DOKUMENT ARKIVERT       */
             PGM        PARM(&BANE &JANEI)
             DCL        VAR(&JANEI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&JANEI) VALUE('J')
             OVRPRTF    FILE(QSYSPRT) OUTQ(OUTMAIL)
             DSPLNK     OBJ(&BANE) OUTPUT(*PRINT) OBJTYPE(*STMF) +
                          DETAIL(*NAME) DSPOPT(*USER)
             MONMSG     MSGID(CPFA0A9) EXEC(GOTO CMDLBL(VIDERE))
             DLTSPLF    FILE(QSYSPRT) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             RETURN
    /* SKRIVER UT FRAKTBREVKOPI           */
    /*                                    */

 VIDERE:     CHGVAR     VAR(&JANEI) VALUE('N')

    /* */
 SLUTT:      ENDPGM
