/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/*       * GENERELL FOR PDF GENERERING                                     */
/* ********************************************************************    */
             PGM        PARM(&STMF &BANE &PRTNA)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(70)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                                       */
/*           GENERER PDF                   */
/*                                         */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CVTSPLFPDF SPLF(&PRTNA) TOPDF(&BANE) +
                          JOB(&QNBR/&QUSER/&QJOB)
             RMVLIBLE   LIB(MMAIL)
    /* */
             ENDPGM
