             PGM
             DCL        VAR(&AVBRYT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ARCANE) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ARBAN0) TYPE(*CHAR) LEN(30)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             CALL       PGM(ARC053A) PARM(&ARCANE &AVBRYT)
             IF         COND(&AVBRYT = 'J') THEN(GOTO CMDLBL(SLUTT))
/*                                     */
/* BYGG MAPPE HVIS IKKE FINNES FRA FØR */
/*                                     */
             CHGVAR     VAR(&ARBAN0) VALUE(&ARCANE *TCAT '/del')
             MD         DIR(&ARBAN0) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
/*                                     */
/* tømmer workfiler                    */
/*                                     */
/*                                     */
/* WRKIVP innholder alle filer i IFS   */
/*                                     */
             CLRPFM     FILE(WRKIVP)
             MONMSG     MSGID(CPF0000)
/*                                     */
/* WRKIVP2 innholder flyttede til /del */
/*         ikke tømm                   */
/*           CLRPFM     FILE(WRKIVP2)  */
             CALL       PGM(ARC051R)
             CALL       PGM(ARC053R) PARM(&ARCANE)
SLUTT:       ENDPGM
