             PGM        PARM(&FRA &TIL)
             DCL        VAR(&FRA) TYPE(*CHAR) LEN(80)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(80)
/* KOPIERER       */
             CPY        OBJ(&FRA) TOOBJ(&TIL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
