/* ********************************************************************    */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/sysca/TUR')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('ARCA006R')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
             ENDPGM
