/* ********************************************************************    */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/sysca/KBILAG')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('ARCA004R')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
             ENDPGM
