/* EGENTLIG REN TOLLPOST-SPESIAL MEN LEAGT I STANDARD SOM EN MAL FOR LIGNENDE */
/* MATCHER FRA KUNDESPESIFIK MAPPE VIA FRI SØKEVEI MOT OPPDRAG                */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/sysca/TOLLPOSTHF')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('ARCA011R')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
             ENDPGM
