             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&START) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(120) +
                          VALUE('/pdf/sca/ZB200900000053fulF4x563.pdf')
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE(QPSYCDAU)
             DCL        VAR(&XIFSAUT) TYPE(*CHAR) LEN(132)
             DCLF       FILE(QTEMP/XIFSAUT) RCDFMT(XIFSAUT)


             CRTPF      FILE(QTEMP/XIFSAUT) RCDLEN(132) AUT(*ALL)
             MONMSG     MSGID(CPF0000)

/*N01*/      CHGAUT     OBJ(&TIL) USER(*PUBLIC) DTAAUT(*RWX) +
                          OBJAUT(*ALL)
             OVRPRTF    FILE(&SPLF) HOLD(*YES)
             DSPAUT     OBJ(&TIL) OUTPUT(*PRINT)
             CPYSPLF    FILE(&SPLF) TOFILE(QTEMP/XIFSAUT) SPLNBR(*LAST)

        /*_________*/
        /* Les fil */
        /*"""""""""*/
 /* Start leting etter reelle users først etter at 'Bruker'/'User' lest */
             CHGVAR     VAR(&START) VALUE('N')
 READ:       RCVF       RCDFMT(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(EXIT))

             CHGVAR     VAR(&USER) VALUE(%SST(&XIFSAUT 2 11))

             IF         COND(&START *EQ 'Y' *AND +
                             &USER  *NE '*PUBLIC' *AND +
                             &USER  *NE '          ') +
                        THEN(DO)
             CHGAUT     OBJ(&TIL) USER(&USER) DTAAUT(*NONE) +
                          OBJAUT(*NONE)
             MONMSG     MSGID(CPF0000)
                        ENDDO
             IF         COND(&USER *EQ 'Bruker    ') +
                        THEN(CHGVAR VAR(&START) VALUE('Y'))
             IF         COND(&USER *EQ 'User      ') +
                        THEN(CHGVAR VAR(&START) VALUE('Y'))

             GOTO       CMDLBL(READ)
        /*______________________*/
        /* Delete av spoolfiler */
        /*""""""""""""""""""""""*/
 EXIT:       DLTSPLF    FILE(&SPLF) SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)

 SLUTT:      ENDPGM
