/* ********************************************************************    */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/eyeshare/tilsysped/bilder')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('ARCA002R')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
             ENDPGM
