             PGM   PARM(&FRA &TIL &OK)
             DCL        VAR(&FRA) TYPE(*CHAR) LEN(512)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(512)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FRTIOK) TYPE(*CHAR) LEN(1025)

             CHGOWN     OBJ(&FRA) NEWOWN(QTMHHTP1)
             CHGAUT     OBJ(&FRA) USER(QTMHHTP1) DTAAUT(*RWX) +
                          OBJAUT(*ALL)
             CHGVAR     VAR(&FRTIOK) VALUE(&FRA *CAT &TIL *CAT &OK)
 /* SEND I JOBBKØ FOR Å KUNNE STYRE USER */
             SBMJOB     CMD(CALL PGM(ARCAMOVCT2) PARM(&FRTIOK)) +
                          JOB(UPLOADTC) JOBQ(SYJOBQNMAX) USER(SY400USR)

             ENDPGM
