             PGM
             DCL        VAR(&PAR1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PAR2) TYPE(*CHAR) LEN(20)
             CALL       PGM(ARCA000CL) PARM(&PAR1 &PAR2)
             ENDPGM
