             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STRTID) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SAVDEV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1)
             DCLF       FILE(SYSPED/BACKUPTD) RCDFMT(START)
             MONMSG CPF0000
             RTVJOBA    JOB(&WS)
             CALL       PGM(SYSPED/INLIBL)
             RTVDTAARA  DTAARA(*LIBL/BACK (1 6)) RTNVAR(&STRTID)
             RTVDTAARA  DTAARA(*LIBL/BACK (10 10)) RTNVAR(&SAVDEV)
             SNDRCVF    DEV(&WS) RCDFMT(START)
             IF         COND(&IN03 = '1') THEN(GOTO CMDLBL(EXIT))
             CHGDTAARA  DTAARA(*LIBL/BACK (1 6)) VALUE(&STRTID)
             CHGDTAARA  DTAARA(*LIBL/BACK (10 10)) VALUE(&SAVDEV)

EXIT:         ENDPGM
