             PGM
             DCL        VAR(&STRTID) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EXPDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&REFDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&REFTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SAVDEV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1)
             DCL        VAR(&MSG1) TYPE(*CHAR) LEN(7) VALUE(BAC0001)
             DCL        VAR(&MSGTXT) TYPE(*CHAR)
             DCL        VAR(&XLOOP) TYPE(*LGL) LEN(1)
             MONMSG CPF0000
             CALL       PGM(INLIBL)
             RTVJOBA    JOB(&WS)
             RTVMSG     MSGID(&MSG1) MSGF(SYMSGF) MSG(&MSGTXT)
             RTVDTAARA  DTAARA(BACK (1 6)) RTNVAR(&STRTID)
             RTVDTAARA  DTAARA(BACK (10 10)) RTNVAR(&SAVDEV)
             IF         COND(&STRTID = '      ') THEN(CHGVAR +
                          VAR(&STRTID) VALUE('030000'))
             IF         COND(&SAVDEV = '          ') THEN(CHGVAR +
                          VAR(&SAVDEV) VALUE('TAP01     '))
             CHGDTAARA  DTAARA(BACK (1 6)) VALUE(&STRTID)
             CHGDTAARA  DTAARA(BACK (10 10)) VALUE(&SAVDEV)
             SBMJOB     CMD(CALL PGM(*LIBL/NATTBACK) PARM(&STRTID +
                          &EXPDATE &WS &REFDATE &REFTIME &SAVDEV +
                          &XLOOP)) JOB(BACKUP) JOBD(QCTL) +
                          JOBQ(QSYS/QCTL) JOBPTY(9) LOG(4 0) +
                          LOGCLPGM(*YES) HOLD(*NO) DATE(*SYSVAL)
             SNDPGMMSG  MSG(&MSGTXT *CAT QCTL *BCAT I *BCAT QSYS)
                          GOTO END

 EXIT:       SNDPGMMSG  MSG('F3 ble trykket, backup ble ikke +
                          igangsatt.')
                          GOTO END
 END:         ENDPGM
