/* ********************************************************************    */
             PGM   PARM(&TY &ST)
             DCL        VAR(&TY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&ST) TYPE(*CHAR) LEN(20)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UDOKN) TYPE(*DEC) LEN(3 0) VALUE(112)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */

             CALL       PGM(SYGE18) PARM(&UDOKN &PRT &LAS &STR &PTY +
                          &HOLD &SAVE &KOPI &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */

             CHGVAR     VAR(&KOPIA) VALUE(&KOPI)
             OVRPRTF    FILE(ARCA000P) PAGESIZE(70 80) OVRFLW(66) +
                          OUTQ(&PRT) COPIES(&KOPIA) HOLD(&HOLD) +
                          SAVE(&SAVE)

             CALL       PGM(ARCA000R) PARM(&TY &ST &STR)
 SLUTT:      ENDPGM
