             PGM        PARM(&LINK &OK)
             DCL        VAR(&LINK) TYPE(*CHAR) LEN(50)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(QSYSPRT) OUTQ(OUTMAIL)

             DSPLNK     OBJ(&LINK) OUTPUT(*PRINT)
             MONMSG     MSGID(CPFA0A9) EXEC(CHGVAR VAR(&OK) VALUE('N'))

             DLTSPLF    FILE(QSYSPRT) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)

             ENDPGM
