             PGM
             DCL        VAR(&FILZ) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FILIBF) TYPE(*CHAR) LEN(10) /* File +
                          Library */
           /*______________*/
           /* Declare File */
           /*""""""""""""""*/
             DCLF       FILE(CHGOBJOWNA) RCDFMT(QLIDOBJD)
           /*____________*/
           /*____________*/
           /* Clear File */
           /*""""""""""""*/
             CLRPFM     FILE(CHGOBJOWNA) MBR(CHGOBJOWNA)
             MONMSG     MSGID(CPF0000)
           /*____________________________*/
           /* Display Object Description */
           /*""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&FILIBF)
             DSPFD      FILE(&FILIBF/*ALL) TYPE(*MBRLIST) +
                          OUTPUT(*OUTFILE) FILEATR(*PF) +
                          OUTFILE(QTEMP/FILZ)
