             PGM
             DCLF       FILE(E500F)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) VALUE(SYSPEDF)
             DCL        VAR(&FRALIB2) TYPE(*CHAR) LEN(10) +
                          VALUE(SYSPEDO)
             DCL        VAR(&TOLIB)  TYPE(*CHAR) LEN(10) VALUE(SYEDIF.G)
             DCL        VAR(&TOLIBH) TYPE(*CHAR) LEN(10) +
                          VALUE(SYEDIH)
             DCL        VAR(&TOLIB2) TYPE(*CHAR) LEN(10) VALUE(SYEDIF)
             DCL        VAR(&ODOBNM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ODOBTP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ODOBAT) TYPE(*CHAR) LEN(10)
             /*____________________*/
             /* LAG NYTT BIBLIOTEK */
             /*""""""""""""""""""""*/
             CRTLIB     LIB(&TOLIB) TEXT('SYEDI  EDIfiler fra +
                          sysped') AUT(*ALL)
             /*________________________________*/
             /* NOEN TVIN* FILER HAR BYTT NAVN */
             /*""""""""""""""""""""""""""""""""*/
             DLTF       FILE(&FRALIB/TVINI1)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(MOV))
             DLTF       FILE(&FRALIB/TVINI2)
             DLTF       FILE(&FRALIB/TVINJ1)
             DLTF       FILE(&FRALIB/TVINJ2)
             DLTF       FILE(&FRALIB/TVINMA)
             DLTF       FILE(&FRALIB/TVINMB)
             DLTF       FILE(&FRALIB/TVINMC)
             DLTF       FILE(&FRALIB/TVINMD)
             DLTF       FILE(&FRALIB/TVINMG)
             DLTF       FILE(&FRALIB/TVINM1)
             DLTF       FILE(&FRALIB/TVINM2)
             DLTF       FILE(&FRALIB/TVINM3)
             DLTF       FILE(&FRALIB/TVINM4)
             DLTF       FILE(&FRALIB/TVINM5)
             DLTF       FILE(&FRALIB/TVINM6)
             DLTF       FILE(&FRALIB/TVINM7)
             DLTF       FILE(&FRALIB/TVINM8)
             DLTF       FILE(&FRALIB/TVINM9)
             DLTF       FILE(&FRALIB/TVINS1)
             DLTF       FILE(&FRALIB/TVINS2)
             DLTF       FILE(&FRALIB/TVINS3)
             DLTF       FILE(&FRALIB/TVINS4)
             DLTF       FILE(&FRALIB/TVINS5)
             RNMOBJ     OBJ(&FRALIB/TVINC) OBJTYPE(*FILE) NEWOBJ(EDIC)
             RNMOBJ     OBJ(&FRALIB/TVINI) OBJTYPE(*FILE) NEWOBJ(EDII)
             RNMOBJ     OBJ(&FRALIB/TVINJ) OBJTYPE(*FILE) NEWOBJ(EDIJ)
             RNMOBJ     OBJ(&FRALIB/TVINM) OBJTYPE(*FILE) NEWOBJ(EDIM)
             RNMOBJ     OBJ(&FRALIB/TVINRE) OBJTYPE(*FILE) NEWOBJ(EDIRE)
             RNMOBJ     OBJ(&FRALIB/TVINS) OBJTYPE(*FILE) NEWOBJ(EDIS)
             RNMOBJ     OBJ(&FRALIB/TVINSE) OBJTYPE(*FILE) NEWOBJ(EDISE)
             RNMM       FILE(&FRALIB/EDIC) MBR(TVINC) NEWMBR(EDIC)
             RNMM       FILE(&FRALIB/EDII) MBR(TVINI) NEWMBR(EDII)
             RNMM       FILE(&FRALIB/EDIJ) MBR(TVINJ) NEWMBR(EDIJ)
             RNMM       FILE(&FRALIB/EDIM) MBR(TVINM) NEWMBR(EDIM)
             RNMM       FILE(&FRALIB/EDIS) MBR(TVINS) NEWMBR(EDIS)
/*___________________________________________________*/
/* FLYTTER FØRST EDIS, EDIM, EDIRE, EDISE DIREKTE    */
/*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
 MOV:        DLTF       FILE(SYEDIF/EDIM1)
             DLTF       FILE(SYEDIF/EDIM2)
             DLTF       FILE(SYEDIF/EDIM3)
             DLTF       FILE(SYEDIF/EDIM4)
             DLTF       FILE(SYEDIF/EDIM5)
             DLTF       FILE(SYEDIF/EDIM6)
             DLTF       FILE(SYEDIF/EDIM7)
             DLTF       FILE(SYEDIF/EDIM8)
             DLTF       FILE(SYEDIF/EDIM9)
             DLTF       FILE(SYEDIF/EDIMA)
             DLTF       FILE(SYEDIF/EDIMB)
             DLTF       FILE(SYEDIF/EDIMC)
             DLTF       FILE(SYEDIF/EDIMD)
             DLTF       FILE(SYEDIF/EDIMG)

             DLTF       FILE(SYEDIF/EDIS1)
             DLTF       FILE(SYEDIF/EDIS2)
             DLTF       FILE(SYEDIF/EDIS3)
             DLTF       FILE(SYEDIF/EDIS4)
             DLTF       FILE(SYEDIF/EDIS5)

             DLTF       FILE(SYEDIF/EUNH1)

             DLTF       FILE(SYEDIF/EUNHJ1)

             DLTF       FILE(SYEDIF/EDIM)
             DLTF       FILE(SYEDIF/EDIS)
             DLTF       FILE(SYEDIF/EUNH)

             DLTF       FILE(SYEDIF/EDIRE)
             DLTF       FILE(SYEDIF/EDISE)

             MOVOBJ     OBJ(SYSPEDF/EDIM1) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM2) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM3) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM4) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM5) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM6) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM7) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM8) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIM9) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIMA) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIMB) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIMC) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIMD) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIMG) OBJTYPE(*FILE) TOLIB(SYEDIF)

             MOVOBJ     OBJ(SYSPEDF/EDIS1) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIS2) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIS3) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIS4) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIS5) OBJTYPE(*FILE) TOLIB(SYEDIF)

             MOVOBJ     OBJ(SYSPEDF/EUNH1) OBJTYPE(*FILE) TOLIB(SYEDIF)

             MOVOBJ     OBJ(SYSPEDF/EUNHJ1) OBJTYPE(*FILE) TOLIB(SYEDIF)

             MOVOBJ     OBJ(SYSPEDF/EDIM) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDIS) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EUNH) OBJTYPE(*FILE) TOLIB(SYEDIF)

             MOVOBJ     OBJ(SYSPEDF/EDIRE) OBJTYPE(*FILE) TOLIB(SYEDIF)
             MOVOBJ     OBJ(SYSPEDF/EDISE) OBJTYPE(*FILE) TOLIB(SYEDIF)

/*___________________________________________________*/
/* FLYTTE ALLE FILER SOM STARTER MED E, UNTATT ELOGO */
/*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
          /*___________________________________________________*/
          /* Retreive Physical files in *libl who start with E*/
          /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             DSPOBJD    OBJ(&FRALIB/E*) OBJTYPE(*FILE) +
                          OUTPUT(*OUTFILE) OUTFILE(E500F)
          /*_______________*/
          /* Read workfile */
          /*"""""""""""""""*/
 READ:       RCVF       RCDFMT(QLIDOBJD)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(EXIT))
          /*___________*/
          /* MOVE FILE */
          /*"""""""""""*/
             IF         COND(&ODOBTP *NE '*FILE   ') THEN(GOTO +
                          CMDLBL(READ))
             IF         COND(&ODOBAT *EQ 'LF        ') THEN(DLTF +
                          FILE(&FRALIB/&ODOBNM))
             IF         COND(&ODOBAT *NE 'PF        ') THEN(GOTO +
                          CMDLBL(READ))
             IF         COND(&ODOBNM *EQ 'ELOGO     ') THEN(GOTO +
                          CMDLBL(READ))
             IF         COND(&ODOBNM *EQ 'E500F     ') THEN(GOTO +
                          CMDLBL(READ))
             MOVOBJ     OBJ(&FRALIB/&ODOBNM) OBJTYPE(*FILE) +
                          TOLIB(&TOLIB)
             GOTO READ
 EXIT:       RNMOBJ     OBJ(&FRALIB/TVIDTA) OBJTYPE(*DTAARA) +
                          NEWOBJ(EDIDTA)
             MONMSG     MSGID(CPF0000)
             DLTDTAARA  DTAARA(&FRALIB/TVIDTA)
             MONMSG     MSGID(CPF0000)
             DLTDTAARA  DTAARA(&TOLIB2/EDIDTA)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/EDIDTA) OBJTYPE(*DTAARA) +
                          TOLIB(&TOLIB2)
             MOVOBJ     OBJ(&FRALIB/E081Q) OBJTYPE(*DTAQ) +
                          TOLIB(&TOLIB2)
             MONMSG     MSGID(CPF0000)
/*___________________________________________________*/
/* FLYTTE ALLE FILER I SYSPEDO SOM STARTER MED E     */
/* FLYTTER DIREKTE TIL SYEDIH                        */
/* TØMMER SYEDIH FØRST                               */
/*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             CLRLIB     LIB(SYEDIH)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB2/EDIM) OBJTYPE(*FILE) +
                          TOLIB(&TOLIBH)
             MOVOBJ     OBJ(&FRALIB2/EDIRE) OBJTYPE(*FILE) +
                          TOLIB(&TOLIBH)
             MOVOBJ     OBJ(&FRALIB2/EDIS) OBJTYPE(*FILE) +
                          TOLIB(&TOLIBH)
             MOVOBJ     OBJ(&FRALIB2/EDISE) OBJTYPE(*FILE) +
                          TOLIB(&TOLIBH)
             ENDPGM
