             PGM        PARM(&FIL &FRLIB &TOLIB)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&FIL)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRLIB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOLIB)  TYPE(*CHAR) LEN(10)
        /* IKKE I TOLIB - (LAG NY I TOLIB) */
             CHKOBJ     OBJ(&TOLIB/&FIL) OBJTYPE(*FILE) MBR(*NONE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CPYF       FROMFILE(&FRLIB/&FIL) TOFILE(&TOLIB/&FIL) +
                          MBROPT(*ADD) CRTFILE(*YES)
             GOTO CMDLBL(END)
             ENDDO
        /* FINNES I FRLIB/TOLIB AUTOSISASJON OK - KOPIER */
             CPYF       FROMFILE(&FRLIB/&FIL) TOFILE(&TOLIB/&FIL) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
     /* FRA TOM???  */
             MONMSG     MSGID(CPF2817) EXEC(GOTO CMDLBL(FE2869))
 /*ALT OK - AVSLUTT */
             GOTO       CMDLBL(END)
 /* "COPYCOMAND ENDED BECAUSE OF ERROR.... (NORMALT: FRAFIL TOM) */
 FE2869:     CLRPFM     FILE(&TOLIB/&FIL)
             SNDPGMMSG  MSG(' ' *BCAT &FIL *BCAT ' KUNNE IKKE +
                          KOPIERES (TOM/AUTORISAJ.-sjekk +
                          joblogg)-TILfil er TØMT.')
             GOTO       CMDLBL(END)
 /*SLUTT*/
 END:        ENDPGM
