             PGM        PARM(&PGM)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)
             DLTPGM     PGM(&PGM)
             MONMSG     MSGID(CPF2105)
             CRTRPGPGM  PGM(SYSPED/&PGM) SRCFILE(SYSPEDS/QRPGSRC)
             ENDPGM
