             PGM        PARM(&LIBSOUR &LIBLOAD &MENU &MENUQQ)
             DCL        VAR(&LIBSOUR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBLOAD) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MENU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MENUQQ) TYPE(*CHAR) LEN(10)
             DLTMSGF    MSGF(&LIBLOAD/&MENU)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(&LIBLOAD/INNMSGF)
             MONMSG     MSGID(CPF0000)
             CRTDSPF    FILE(&LIBLOAD/&MENU) SRCFILE(&LIBSOUR/QMENUSRC)
             CRTMSGF    MSGF(&LIBLOAD/&MENU)
             CPYF       FROMFILE(&LIBSOUR/QMENUSRC) +
                          TOFILE(&LIBLOAD/INNMSGF) FROMMBR(&MENUQQ) +
                          TOMBR(INNMSGF) MBROPT(*REPLACE) CRTFILE(*YES)
             CALL       PGM(CRTMSGF) PARM(&LIBLOAD &MENU)
             CRTMNU     MENU(&LIBLOAD/&MENU) TYPE(*DSPF) +
                          DSPF(&LIBLOAD/*MENU) MSGF(&LIBLOAD/*MENU) +
                          DSPKEY(*YES) CURLIB(*NOCHG) PRDLIB(*NONE) +
                          AUT(*ALL)
             DLTF       FILE(&LIBLOAD/INNMSGF)
             MONMSG     MSGID(CPF0000)
             ENDPGM
