             PGM        PARM(&LIB &PRENAVN)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRENAVN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PGMNAVN) TYPE(*CHAR) LEN(10)

             CHKOBJ     OBJ(&LIB) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             SNDPGMMSG  MSG('BIBLIOTEK FINNES IKKE.')
             GOTO       CMDLBL(SLUTT)
             ENDDO

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'SY400AU')
             ADDAJE     SBSD(SYSPED/SY400SBS) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400AUTJD)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'PRTTRA')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/SAD041CLQ) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'PRTEXP')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/SAD052CLQ) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'PRTIMP')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/SAD061CLQ) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'INVCALC')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/SYFI10XQ) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'TETEXP')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/TR014CQ) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'TVISND')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/TVI02C) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'TETSND')
             ADDPJE     SBSD(SYSPED/SY400SBS) PGM(&LIB/TR101C) +
                          USER(SY400USR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400JOBD) CLS(SYSPED/SY400CLS)

             CHGVAR     VAR(&PGMNAVN) VALUE(&PRENAVN *CAT 'SY400AU')
             ADDAJE     SBSD(SYSPED/SY400SBS) JOB(&PGMNAVN) +
                          JOBD(&LIB/SY400AUTJD)

 SLUTT:      ENDPGM
