             PGM        PARM(&LIBFR &LIBTO)
             DCL        VAR(&LIBFR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBTO) TYPE(*CHAR) LEN(10)

             CHGJOB     RUNPTY(21) LOG(4 00 *SECLVL) LOGCLPGM(*YES)

             CHKOBJ     OBJ(&LIBFR) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             SNDPGMMSG  MSG('FRA BIBLIOTEK FINNES IKKE.')
             GOTO       CMDLBL(SLUTT)
             ENDDO

             CHKOBJ     OBJ(&LIBTO) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CRTLIB     LIB(&LIBTO) TEXT('SYEDI - HISTORIKK      FOR +
                          XXX')
             CRTDUPOBJ  OBJ(EDIM) FROMLIB(&LIBFR) OBJTYPE(*FILE) +
                          TOLIB(&LIBTO)
             CRTDUPOBJ  OBJ(EDIS) FROMLIB(&LIBFR) OBJTYPE(*FILE) +
                          TOLIB(&LIBTO)
             CPYF       FROMFILE(&LIBFR/EDIRE) TOFILE(&LIBTO/EDIRE) +
                          MBROPT(*ADD) CRTFILE(*YES)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(&LIBTO/EDIRE) MBR(*ALL)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&LIBFR/EDIRE1K) +
                          TOFILE(&LIBTO/EDIRE1K) MBROPT(*ADD) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(&LIBTO/EDIRE1K) MBR(*ALL)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&LIBFR/EDISE) TOFILE(&LIBTO/EDISE) +
                          MBROPT(*ADD) CRTFILE(*YES)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(&LIBTO/EDISE) MBR(*ALL)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&LIBFR/EDISE1K) +
                          TOFILE(&LIBTO/EDISE1K) MBROPT(*ADD) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(&LIBTO/EDISE1K) MBR(*ALL)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(SLUTT)
             ENDDO

             SNDPGMMSG  MSG('TIL BIBLIOTEK FINNES ALLEREDE. SLETTS! +
                          PROGRAMMET SKAL AUTOMATISK LAGE DENNE.')

 SLUTT:      CHGJOB     RUNPTY(21) LOG(4 00 *SECLVL) LOGCLPGM(*YES)

             ENDPGM
