/*                     INFOPRINT KONFIGURASJON                           */
             PGM        PARM(&PDFDEV &PRTDEV) /* Opprette +
                          nødvendige PDF-DEV og psf for infoprint +
                          pdf 1.4 printing */
             DCL        VAR(&PDFDEV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRTDEV) TYPE(*CHAR) LEN(10)
             MONMSG CPF0000
/*                                    */
/* PSF CONFIG                         */
/*                                    */
             CRTPSFCFG  PSFCFG(QUSRSYS/&PDFDEV) PDFGEN(*SPLF) +
                          PDFDEVTYPE(*IP40300) PDFPPRDWR1(*A4) +
                          PDFPPRDWR2(*A4) PDFOUTQ(QUSRSYS/&PRTDEV) +
                          TEXT('Psfcfg for infoprint server')
             CRTDEVPRT  DEVD(&PDFDEV) DEVCLS(*LAN) TYPE(*IPDS) +
                          MODEL(0) LANATTACH(*IP) AFP(*YES) +
                          PORT(9001) ONLINE(*YES) FONT(011 *NONE) +
                          FORMFEED(*CONT) SEPDRAWER(*FILE) +
                          PRTERRMSG(*INQ) MSGQ(SYSPED/PRINTERAUT) +
                          ACTTMR(170) IMGCFG(*NONE) MAXPNDRQS(6) +
                          PRTCVT(*YES) PRTRQSTMR(*NOMAX) +
                          FORMDF(*LIBL/F1C10110) CHRID(*SYSVAL) +
                          RMTLOCNAME('127.0.0.1') +
                          USRDFNOBJ(QUSRSYS/&PDFDEV *PSFCFG) +
                          PUBLISHINF(*UNKNOWN *UNKNOWN *UNKNOWN +
                          *UNKNOWN *BLANK (*PDF *PCL)) +
                          TEXT('Infoprint skriver for PDF') +
                          DEPLOCNAME(*NONE)
             VRYCFG     CFGOBJ(&PDFDEV) CFGTYPE(*DEV) STATUS(*ON)
             STRPRTWTR  DEV(&PDFDEV)
             ENDPGM
