/* ***************************************************************** */
/* *   SLETTER ALE MEMBERS UNNTATT "BASISMEMBER" I FIL             * */
/* *   LAGD AV SYSTEMA A/S                                         * */
/* ***************************************************************** */
/********************************************************************/
             PGM        PARM(&LIB &FILE)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DCLF       FILE(QTEMP/DELMBR) RCDFMT(QWHFDML)

        /*___________________*/
        /* Hent liste MEMBERS*/
        /*"""""""""""""""""""*/
             DSPFD      FILE(&LIB/&FILE) TYPE(*MBRLIST) +
                          OUTPUT(*OUTFILE) FILEATR(*PF) OUTFILE(QTEMP/DELMBR)
             MONMSG     MSGID(CPF0000)
        /*_____*/
        /* Les */
        /*"""""*/
 READ:       RCVF       RCDFMT(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))
       /*"Basismember"(mbrnavn lik filnavn) skal ikke fjernes */
             IF         COND(&MLNAME *EQ &FILE) THEN(GOTO +
                          CMDLBL(READ))
             RMVM       FILE(&LIB/&FILE) MBR(&MLNAME)
             MONMSG     MSGID(CPF0000)
        /*__________________*/
        /* Les neste record */
        /*""""""""""""""""""*/
             GOTO       CMDLBL(READ)
 SLUTT:      ENDPGM
