             PGM        PARM(&PNR)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)

             CALL       PGM(DKE503R) PARM(&PNR)

             ENDPGM
