             PGM        PARM(&FILE &LIBRARY &MEMBER)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBRARY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NUMR) TYPE(*DEC) LEN(10 0)
             CALL       PGM(DKG100R) PARM(&LIBRARY &FILE &MEMBER &NUMR)
             ENDPGM
