             PGM        PARM(&PRT &CALLTYP)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CALLTYP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4) VALUE('*NO ')
             IF         COND(&CALLTYP *EQ 'C') THEN(CHGVAR +
                          VAR(&HOLD) VALUE('*YES'))
             OVRPRTF    FILE(DKI047P) DEVTYPE(*AFPDS) PAGESIZE(105 +
                          120) LPI(9) CPI(15) OVRFLW(103) +
                          FRONTOVL(DKIV 0.15 0.22) OUTQ(&PRT) +
                          HOLD(&HOLD) OVRSCOPE(*JOB)
             ENDPGM
