             PGM        PARM(&LIBF)

             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000)

             DLTF       FILE(&LIBF/DKEH1*)
             DLTF       FILE(&LIBF/DKEH)
             DLTF       FILE(&LIBF/DKIH1*)
             DLTF       FILE(&LIBF/DKIH)

CRTDUPOBJ  OBJ(DKEH)   FROMLIB(A25SYSPEDF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKEH1*) FROMLIB(A25SYSPEDF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKIH)   FROMLIB(A25SYSPEDF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKIH1*) FROMLIB(A25SYSPEDF) OBJTYPE(*FILE) TOLIB(&LIBF)

             ENDPGM
