             PGM        PARM(&AVD &TDN &MN)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TDN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MN) TYPE(*CHAR) LEN(9)
             CALL       PGM(DKX106RK) PARM(&AVD &TDN &MN)
             ENDPGM
