             PGM        PARM(&LIBF)

             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000)

             DLTF       FILE(&LIBF/DKXH0*)
             DLTF       FILE(&LIBF/DKXH1*)
             DLTF       FILE(&LIBF/DKXH)
             DLTF       FILE(&LIBF/DKXV0*)
             DLTF       FILE(&LIBF/DKXV)
             DLTF       FILE(&LIBF/DKXSTD)

CRTDUPOBJ  OBJ(DKXH)   FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKXH0*) FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKXH1*) FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKXV)   FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKXV0*) FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)
CRTDUPOBJ  OBJ(DKXSTD) FROMLIB(SYENDPTF) OBJTYPE(*FILE) TOLIB(&LIBF)

             ENDPGM
