             PGM        PARM(&USERID)
             DCL        VAR(&USERID) TYPE(*CHAR) LEN(8)
             DLTUSRPRF  USRPRF(&USERID)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             SNDPGMMSG  MSGID(TBR0081) MSGF(SYMSGF)
             GOTO       CMDLBL(END)
             ENDDO
             CALL       PGM(DLTREC) PARM(&USERID)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             GOTO       CMDLBL(END)
             ENDDO
             SNDPGMMSG  MSGID(TBR0082) MSGF(SYMSGF)
 END:        RETURN
