/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SEND EPOST                                         */
/* ********************************************************************    */
             PGM        PARM(&FILE &LIB &COLHDG)
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&COLHDG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CRT) TYPE(*CHAR) LEN(13)
             DCL        VAR(&CHG) TYPE(*CHAR) LEN(13)
             RTVOBJD    OBJ(&LIB/&FILE) OBJTYPE(*FILE) TEXT(&TXT) +
                          CRTDATE(&CRT) CHGDATE(&CHG)
 /*___________________*/
 /* Slette gammel fil */
 /*"""""""""""""""""""*/
             DLTF       FILE(DSPFFDF)
             MONMSG     MSGID(CPF0000)
 /*______________________*/
 /* Hente filbeskrivelse */
 /*""""""""""""""""""""""*/
             DSPFFD     FILE(&LIB/&FILE) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/DSPFFDF)
 /*______________________*/
 /* Skriv ut beskrivelse */
 /*""""""""""""""""""""""*/
             OVRPRTF    FILE(DSPFFDP) PAGESIZE(72 80) LPI(6) +
                          CPI(10) OVRFLW(62) HOLD(*YES)
/*N01*/      CLRPFM     FILE(QTEMP/DSPFFDF2)
/*N01*/      MONMSG     MSGID(CPF0000) EXEC(CRTDUPOBJ OBJ(DSPFFDF2) +
                          FROMLIB(*LIBL) OBJTYPE(*FILE) TOLIB(QTEMP))
             CALL       PGM(DSPFFDR) PARM(&TXT &CRT &CHG &COLHDG)
/*N01*/      CALL       PGM(EPOS07CL) PARM('DSPFFDF2')
             ENDPGM
