             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&MSGTXT) TYPE(*CHAR) LEN(50)

             CHGVAR     VAR(&MSGTXT) VALUE('Data fra VCK er +
                          ankommet.')

             SNDMSG     MSG(' ' *BCAT &MSGTXT *BCAT ' ') TOUSR(TS)
             MONMSG     MSGID(CPF0000)

             SNDMSG     MSG(' ' *BCAT &MSGTXT *BCAT ' ') TOUSR(LINDA)
             MONMSG     MSGID(CPF0000)

             SNDMSG     MSG(' ' *BCAT &MSGTXT *BCAT ' ') TOUSR(OLE)
             MONMSG     MSGID(CPF0000)

   /*TØM WORKFILE FOR BRUDD-HÅNDTERING M.M */
             CALL       PGM(EDIWSDEL) PARM(&SN)

             ENDPGM
