             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
/* HER LEGGES INNN MELDING TIL UTVALGTE PERSONER HVIS ØNSKELIG */
/*                                                             */
/*           SNDMSG     MSG('Sist mottatte GEMSYS data var +
                          direktekjøring.') TOUSR(MBG) */
             CALL       PGM(E113R_A6) PARM(&WMN1)
             ENDPGM
