             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
/* HER LEGGES INNN MELDING TIL UTVALGTE PERSONER HVIS ØNSKELIG */
/*                                                             */
             CALL       PGM(E113R_93A7) PARM(&WMN1)
             ENDPGM
