             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
             CALL       PGM(E113R_93A8) PARM(&WMN1)
             ENDPGM
