             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
 ALKOBJ:     ALCOBJ     OBJ((&L1DATN/OTRAF *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             DLYJOB     DLY(30)
             GOTO       CMDLBL(ALKOBJ)
             ENDDO
             ADDLIBLE   LIB(&L1STDN) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(&L1DATN) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(E116R_96A2) PARM(&WMN1)
             DLCOBJ     OBJ((&L1DATN/OTRAF *FILE *EXCL))
             ENDPGM
