             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             ADDLIBLE   LIB(&L1STDN) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(&L1DATN) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(E116R_96A3) PARM(&WMN1)
             ENDPGM
