             PGM        PARM(&RECNUM)
             DCL        VAR(&RECNUM) TYPE(*CHAR) LEN(9)
             CALL       PGM(SYENDBHR/INLIBL)
             CALL       PGM(E133R_93A8) PARM(&RECNUM)
             ENDPGM
