             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
             DLYJOB     DLY(10)
             CALL       PGM(E133R_93A5) PARM(&WMN1)
             ENDPGM
