             PGM        PARM(&RECNUM)
             DCL        VAR(&RECNUM) TYPE(*CHAR) LEN(9)
             CALL       PGM(E143R_97A) PARM(&RECNUM)
             ENDPGM
