             PGM        PARM(&RECNUM)
             DCL        VAR(&RECNUM) TYPE(*CHAR) LEN(9)
             CALL       PGM(E144R_93A) PARM(&RECNUM)
             ENDPGM
