             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('E151R_911 ')
             DCLF       FILE(*LIBL/FIRM) RCDFMT(*ALL)

             RCVF       DEV(*FILE) RCDFMT(*FILE)
             RTVJOBA    JOB(&WS)
             RTVUSRPRF  OUTQ(&PRT)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(E153F) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(DO)
             ADDPFM     FILE(E153F) MBR(&WS)
             ADDLFM     FILE(E153FL01) MBR(&WS) +
                          DTAMBRS((&FILIBF/E153F (&WS)))
             ENDDO

             CALL       PGM(&PGM) PARM(&WS &PRT)
             RCLRSC
             ENDPGM
