             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (325 10)) RTNVAR(&WS)
             RTVDTAARA  DTAARA(*LDA (335 10)) RTNVAR(&PGM)

             OVRDBF     FILE(E153F) TOFILE(E153F) MBR(&WS)
             CALL       PGM(&PGM)

             ENDPGM
