             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (303 10)) RTNVAR(&PRT)
             RTVDTAARA  DTAARA(*LDA (325 10)) RTNVAR(&WS)
             RTVDTAARA  DTAARA(*LDA (335 10)) RTNVAR(&PGM)

             OVRPRTF    FILE(E154P) OUTQ(&PRT) PAGESIZE(72 80) +
                          OVRFLW(66) PAGRTT(0) SECURE(*YES)
             OVRDBF     FILE(E153F) TOFILE(E153F) MBR(&WS)
             OVRDBF     FILE(E153FL01) TOFILE(E153FL01) MBR(&WS)

             CALL       PGM(&PGM)

             CLRPFM     FILE(E153F) MBR(&WS)

             ENDPGM
