             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&ZTRAN) TYPE(*CHAR) LEN(8) VALUE('00000000')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             CLRPFM     FILE(E307F)
             CALL       PGM(E307R) PARM(&ZTRAN)
             CALL       PGM(E308CL) PARM(&ZTRAN)
 SLUTT:      ENDPGM
