             PGM        PARM(&FIRMA &KUNDE &AAR &PAKKSN)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&KUNDE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PAKKSN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&SYENDRE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SYSPEDF) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SYSPED) TYPE(*CHAR) LEN(1)
             ADDLIBLE   LIB(SYENDRE) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&SYENDRE) +
                          VALUE('J'))
             ADDLIBLE   LIB(SYSPEDF) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&SYSPEDF) +
                          VALUE('J'))
             ADDLIBLE   LIB(SYSPED) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&SYSPED) +
                          VALUE('J'))
             CALL       PGM(E331R_93A) PARM(&FIRMA &KUNDE &AAR &PAKKSN)
             IF         COND(&SYENDRE *NE 'J') THEN(RMVLIBLE +
                          LIB(SYENDRE))
             IF         COND(&SYSPEDF *NE 'J') THEN(RMVLIBLE +
                          LIB(SYSPEDF))
             IF         COND(&SYSPED *NE 'J') THEN(RMVLIBLE LIB(SYSPED))
             ENDPGM
