             PGM
             DCL        VAR(&RGZ) TYPE(*CHAR) LEN(1)

             CALL       PGM(E504R) PARM(&RGZ)
             IF         COND(&RGZ *EQ 'J') THEN(DO)
             RGZPFM     FILE(XMLRCVF)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(XMLRCAF)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(XMLRCLF)
             MONMSG     MSGID(CPF0000)
             ENDDO

             ENDPGM
