PGM
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBH) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(30) VALUE('  ')
             MONMSG     MSGID(CFP0000)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBH)
/* 4. LAG KATALOGSTUKTUR FOR BINÆROVERFØRSEL, BRUK SAMME NAVN SOM FILBIBLIOTEK*/
             CRTDIR     DIR(&LIBF) DTAAUT(*RWX) OBJAUT(*ALL)
             CRTDIR     DIR(&LIBH) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDIRE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDIRE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDISE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDISE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDIRE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDIRE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDISE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDISE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

ENDPGM
