             PGM
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&SYFLIBE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SYSBS) TYPE(*CHAR) LEN(10)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRM) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
/*________________________________*/
/* HENT INSTALLASJONSOPPLYSNINGER */
/*""""""""""""""""""""""""""""""""*/
             CALL       PGM(GETFIRMF1) PARM(&FIFIRM &SYFLIBE &SYSBS)
             /*___________________________________________________*/
             /* Stoppe Program for å lage EDIfact filer           */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             ENDPJ      SBS(&SYSBS) PGM(EDI02C)
             MONMSG     MSGID(CPF0000)
             /*___________________________________________________*/
             /* Stoppe Program for å lese EDIfact filer           */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             ENDPJ      SBS(&SYSBS) PGM(EDI10C)
             MONMSG     MSGID(CPF0000)
             /*___________________________________________________*/
             /* Stoppe Program for å konvertere EDIfact filer     */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             ENDPJ      SBS(&SYSBS) PGM(E081C)
             MONMSG     MSGID(CPF0000)
             /*____________________________*/
             /* Stoppe Program for SND/RCV */
             /*""""""""""""""""""""""""""""*/
/*TCP/IP*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07C3)
             MONMSG     MSGID(CPF0000)

/*X.UTV*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07C6)
             MONMSG     MSGID(CPF0000)

/*TDVIS*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07C7)
             MONMSG     MSGID(CPF0000)
/*OFTP*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07C8)
             MONMSG     MSGID(CPF0000)
/*PRIVAT*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07C9)
             MONMSG     MSGID(CPF0000)
/*EDB FTP*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07CA)
             MONMSG     MSGID(CPF0000)
/*IBM FTP INTERNET*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07CB)
             MONMSG     MSGID(CPF0000)
/*ERGO FTP*/
             ENDPJ      SBS(&SYSBS) PGM(EDI07CE)
             MONMSG     MSGID(CPF0000)

             DLYJOB     DLY(60)

             ENDPGM
