             PGM
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&IN51) TYPE(*LGL) LEN(1)
             DCL        VAR(&SYFLIBE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SYSBS) TYPE(*CHAR) LEN(10)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRM) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
/*________________________________*/
/* HENT INSTALLASJONSOPPLYSNINGER */
/*""""""""""""""""""""""""""""""""*/
             CALL       PGM(GETFIRMF1) PARM(&FIFIRM &SYFLIBE &SYSBS)
             /*___________________________________________________*/
             /* Starte Program for å lage EDIfact filer           */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
 START:      STRPJ      SBS(&SYSBS) PGM(EDI02C)
             MONMSG     MSGID(CPF0000)
             /*___________________________________________________*/
             /* Starte Program for å lese EDIfact filer           */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             STRPJ      SBS(&SYSBS) PGM(EDI10C)
             MONMSG     MSGID(CPF0000)
             /*___________________________________________________*/
             /* Starte Program for å konvertere EDIfact filer     */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
             STRPJ      SBS(&SYSBS) PGM(E081C)
             MONMSG     MSGID(CPF0000)
             /*___________________________________________________*/
             /* Starte Program for å svare på status via mail     */
             /*"""""""""""""""""""""""""""""""""""""""""""""""""""*/
/*           STRPJ      SBS(&SYSBS) PGM(EDI20C)                 */
/*           MONMSG     MSGID(CPF0000)                            */
             /*____________________________*/
             /* Starte Program for SND/RCV */
             /*""""""""""""""""""""""""""""*/
/*TCP/IP*/
             CALL       PGM(EDI01R) PARM('E' '3' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07C3)
             MONMSG     MSGID(CPF0000)
             ENDDO

/*X.UTV*/
             CALL       PGM(EDI01R) PARM('E' '6' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07C6)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*TDVIS*/
             CALL       PGM(EDI01R) PARM('E' '7' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07C7)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*OFTP*/
             CALL       PGM(EDI01R) PARM('E' '8' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07C8)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*PRIVAT*/
             CALL       PGM(EDI01R) PARM('E' '9' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07C9)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*EDB FTP*/
             CALL       PGM(EDI01R) PARM('E' 'A' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07CA)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*IBM FTP INTERNET*/
             CALL       PGM(EDI01R) PARM('E' 'B' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07CB)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*ERGO FTP*/
             CALL       PGM(EDI01R) PARM('E' 'E' &IN51)
             IF         COND(&IN51 *EQ '0') THEN(DO)
             STRPJ      SBS(&SYSBS) PGM(EDI07CE)
             MONMSG     MSGID(CPF0000)
             ENDDO

             ENDPGM
