             PGM
        /*___________________*/
        /* Declare variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PHFILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PHFILE2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JUL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&W0065) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATA) TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEN) TYPE(*DEC) LEN(5 0) VALUE(30)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PREFIX) TYPE(*CHAR) LEN(1)
             DCLF       FILE(EDI07C9) RCDFMT(QWHFDPHY)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIB)
        /*______________*/
        /* Get filelist */
        /*""""""""""""""*/
             DSPFD      FILE(EDIBMIN/A*) TYPE(*ATR) OUTPUT(*OUTFILE) +
                          FILEATR(*PF) OUTFILE(EDI07C9)
             MONMSG     MSGID(CPF0000)
        /*_______________*/
        /* Read filelist */
        /*"""""""""""""""*/
 READ:       RCVF       RCDFMT(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(EXIT))
        /*___________*/
        /* COPY File */
        /*"""""""""""*/
             CPYF       FROMFILE(EDIBMIN/&PHFILE) TOFILE(EDI79F) +
                          FROMMBR(*FIRST) TOMBR(&PHFILE) +
                          MBROPT(*ADD) FMTOPT(*NOCHK)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&PHFILE2) VALUE(%SST(&PHFILE 2 9))
             CHGVAR     VAR(&PHFILE2) VALUE('X' *CAT &PHFILE2)
             RNMOBJ     OBJ(EDIBMIN/&PHFILE) OBJTYPE(*FILE) +
                          NEWOBJ(&PHFILE2)
             MONMSG     MSGID(CPF0000)
        /*__________________________________*/
        /* Read next record from memberlist */
        /*""""""""""""""""""""""""""""""""""*/
             GOTO       CMDLBL(READ)
        /*______*/
        /* Exit */
        /*""""""*/
 EXIT:       RCLRSC
             ENDPGM
