PGM
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBH) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(30) VALUE('  ')
             MONMSG     MSGID(CFP0000)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBH)
/* 1. KUNDEN MÅ HA AVTALE MED IBM (DRASCO) VEDR. IBM FTP OVER INTERNETT */

/* 2. AS/400 MÅ HA TILGANG TIL INTERNETT, ÅPNE EV. FIREWALL FOR 32.247.63.17 */

/* 3. TILFØY IP NAVN: IBMFTPF I LOKAL HOST TABELL MED ADRESSE 32.247.63.17  */
             ADDTCPHTE  INTNETADR('32.247.63.17') HOSTNAME((IBMFTPF))

/* 4. LAG KATALOGSTUKTUR FOR BINÆROVERFØRSEL, BRUK SAMME NAVN SOM FILBIBLIOTEK*/
             CRTDIR     DIR(&LIBF) DTAAUT(*RWX) OBJAUT(*ALL)
             CRTDIR     DIR(&LIBH) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDIRE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDIRE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDISE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBF *TCAT '/' *TCAT 'EDISE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDIRE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDIRE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDISE')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBH *TCAT '/' *TCAT 'EDISE1K')
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)

/* 5. LES IN SYEDI OBJEKTER HOS KUNDEN SOM STARTER MED:                       */
/*    EDI07CB* EDI10C* EDI01CS EDIMNU5*  */

/* 6. TILFØY AUTOSTARTJOBB I DELSYSTEMET SYEDISBS                             */
/*           ADDPJE     SBSD(SYEDI/SYEDISBS) PGM(SYEDI/EDI07CB) +
                          USER(SYEDIUSR) STRJOBS(*NO) INLJOBS(1) +
                          THRESHOLD(1) ADLJOBS(1) JOB(EDISNDIBMF) +
                          JOBD(SYEDI/SYEDIJOBD) CLS(SYEDI/SYEDICLS)           */

/* 7. TEST PÅLOGGING TIL IBMFTPF MANUELLT FØR START                           */

/* 8. ENDRE UTVEKSLINGSIDENTER TIL TYPE='B' + LEGG IN VERTSNAVN, BRUKERID OG  */
/*    PASSORD                                                                 */

/* 9. SNA 3270 KAN ERSTATTES MED "WEBCONNECT" 3270 VIA BROWSER                */
/*    HTTP://32.254.5.19                                                      */
ENDPGM
