             PGM PARM(&QTYPE &VALUE &MAILA &MBR &TCP &MAILI)
/*____________________*/
/* Definier variabler */
/* MIDLERTIDIG HEADF I SYENDPTF */
/*""""""""""""""""""""*/
             DCL        VAR(&LIB1) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDF   ')
             DCL        VAR(&LIB2) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDF   ')
             DCL        VAR(&LIB3) TYPE(*CHAR) LEN(10) +
                          VALUE('SYEDIF    ')
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&VALUE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&MAILA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MAILI) TYPE(*CHAR) LEN(50)
             DCL        VAR(&TCP) TYPE(*CHAR) LEN(1)
             OVRDBF     FILE(ZRISOK) TOFILE(&LIB1/ZRISOK)
             OVRDBF     FILE(ZTELL) TOFILE(&LIB1/ZTELL)
             OVRDBF     FILE(ZREETXT) TOFILE(&LIB2/ZREETXT)
             OVRDBF     FILE(FREETXT) TOFILE(&LIB2/FREETXT)
             OVRDBF     FILE(HEURFIL) TOFILE(&LIB3/HEURFIL)
             OVRDBF     FILE(FRISOK) TOFILE(&LIB2/FRISOK)
             OVRDBF     FILE(CUNDL01) TOFILE(&LIB1/CUNDL01)
             OVRDBF     FILE(FIRM) TOFILE(&LIB2/FIRM)
             OVRDBF     FILE(KODTW) TOFILE(&LIB2/KODTW)
             OVRDBF     FILE(KODTV) TOFILE(&LIB2/KODTV)
             OVRDBF     FILE(TELL) TOFILE(&LIB2/TELL)
             OVRDBF     FILE(HEADF) TOFILE(&LIB2/HEADF)
             OVRDBF     FILE(ZEADF) TOFILE(&LIB2/ZEADF)
             OVRDBF     FILE(GSSCNF) TOFILE(&LIB2/GSSCNF)
             OVRDBF     FILE(GSSORF) TOFILE(&LIB2/GSSORF)
             OVRDBF     FILE(GSSPOF) TOFILE(&LIB2/GSSPOF)
             OVRDBF     FILE(CDBOAT) TOFILE(&LIB2/CDBOAT)
             CALL       PGM(EDI21R7) PARM(&QTYPE &VALUE &MAILA +
                   &TCP &MAILI)
             ENDPGM
