             PGM PARM(&QTYPE &MBR)
/*____________________*/
/* Definier variabler */
/* MIDLERTIDIG HEADF I SYENDPTF */
/*""""""""""""""""""""*/
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB2) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDF   ')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) +
                          VALUE('SYNETTL   ')
             OVRDBF     FILE(STED2) TOFILE(&LIB2/STED2)
             OVRDBF     FILE(CDBOAT) TOFILE(&LIB2/CDBOAT)
             OVRDBF     FILE(GSSGDF) TOFILE(&LIB2/GSSGDF)
             OVRDBF     FILE(GSSCGF) TOFILE(&LIB2/GSSCGF)
             OVRDBF     FILE(GSSCCF) TOFILE(&LIB2/GSSCCF)
             OVRDBF     FILE(GSSBIF) TOFILE(&LIB2/GSSBIF)
             OVRDBF     FILE(GSSPOF) TOFILE(&LIB2/GSSPOF)
             OVRDBF     FILE(GSSORL12) TOFILE(&LIB2/GSSORL12)
             OVRDBF     FILE(GSSORL23) TOFILE(&LIB2/GSSORL23)
             OVRDBF     FILE(GSSCGL02) TOFILE(&LIB2/GSSCGL02)
             OVRDBF     FILE(HEADF) TOFILE(&LIB2/HEADF)
             OVRDBF     FILE(FIRM) TOFILE(&LIB2/FIRM)
             OVRDBF     FILE(CUNDL01) TOFILE(&LIB2/CUNDL01)
/*                 */
/*   ANDRE FILER   */
/*                 */
/*_____________*/
/* Lag et svar */
/*"""""""""""""*/
             OVRPRTF    FILE(EDI21R9P) OUTQ(QPRINT)
             OVRDBF     FILE(EDIUT) TOFILE(&LIB/EDIUT) MBR(&MBR)
             CALL       PGM(EDI21R9) PARM(&QTYPE)
             CPYSPLF    FILE(EDI21R9P) TOFILE(&LIB/EDIUT) +
                          JOB(SYNETT/QPRTJOB) SPLNBR(*LAST) TOMBR(&MBR)
             DLTSPLF    FILE(EDI21R9P) JOB(SYNETT/QPRTJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDPGM
