             PGM        PARM(&QTYPE &VALUE &PWD &TCP &FIRMA &VARENR)
             DCL        VAR(&LIB5) TYPE(*CHAR) LEN(10) +
                          VALUE('IBMDAT2.4 ')
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&VALUE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&PWD) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TCP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&VARENR) TYPE(*CHAR) LEN(15)

             OVRDBF     FILE(LAGEL01) TOFILE(&LIB5/LAGEL01)
             OVRDBF     FILE(KODLL01) TOFILE(&LIB5/KODLL01)
             CALL       PGM(EDI21R11) PARM(&QTYPE &VALUE &PWD &TCP +
                          &FIRMA &VARENR)
             ENDPGM
