             PGM        PARM(&BRUKER &TEXT)
/*___________________*/
/* Definier varabler */
/*"""""""""""""""""""*/
             DCL        VAR(&BRUKER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TEXT) TYPE(*CHAR) LEN(80)
             DCL        VAR(&SYSNAM) TYPE(*CHAR) LEN(8)
             RTVNETA    SYSNAME(&SYSNAM)
             IF         COND(&BRUKER = 'JOVMOB    ') THEN(DO)
             SNDDST     TYPE(*MSG) TOUSRID((&BRUKER X400GATE)) +
                          DSTD('mottatt booking elektroonisk') +
                          MSG(&TEXT)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             SNDMSG     MSG(&TEXT) TOUSR(&BRUKER)
             MONMSG     MSGID(CPF0000)
             ENDDO
             GOTO       CMDLBL(EXIT)
             ENDDO
             SNDDST     TYPE(*MSG) TOUSRID((&BRUKER &SYSNAM)) +
                          DSTD('mottatt booking elektroonisk') +
                          MSG(&TEXT)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             SNDMSG     MSG(&TEXT) TOUSR(&BRUKER)
             MONMSG     MSGID(CPF0000)
             ENDDO
/*_________________*/
/* Endre variabler */
/*"""""""""""""""""*/
EXIT:        ENDPGM
