             PGM PARM(&QTYPE &VALUE &PWD &TCP &FRAD &TILD)
/*____________________*/
/* Definier variabler */
/* MIDLERTIDIG HEADF I SYENDPTF */
/*""""""""""""""""""""*/
             DCL        VAR(&LIB5) TYPE(*CHAR) LEN(10) +
                          VALUE('IBMDAT    ')
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&VALUE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&PWD) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TCP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FRAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TILD) TYPE(*CHAR) LEN(8)
             OVRDBF     FILE(KREHL02) TOFILE(&LIB5/KREHL02)
             OVRDBF     FILE(KRESL01) TOFILE(&LIB5/KRESL01)
             OVRDBF     FILE(KUNDL01) TOFILE(&LIB5/KUNDL01)
             OVRDBF     FILE(LRESL01) TOFILE(&LIB5/LRESL01)
             OVRDBF     FILE(LREHL02) TOFILE(&LIB5/LREHL02)
             OVRDBF     FILE(LEVEL01) TOFILE(&LIB5/LEVEL01)
             CALL       PGM(EDI20R8) PARM(&QTYPE &VALUE &PWD &TCP +
                          &FRAD &TILD)
             ENDPGM
