             PGM PARM(&QTYPE &MAILA &TCP)
/*____________________*/
/* Definier variabler */
/*""""""""""""""""""""*/
             DCL        VAR(&LIB2) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDF   ')
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&MAILA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TCP) TYPE(*CHAR) LEN(1)
             OVRDBF     FILE(GSSCNF) TOFILE(&LIB2/GSSCNF)
             OVRDBF     FILE(GSSORF) TOFILE(&LIB2/GSSORF)
             OVRDBF     FILE(GSSPOF) TOFILE(&LIB2/GSSPOF)
             OVRDBF     FILE(GSSOLF) TOFILE(&LIB2/GSSOLF)
             OVRDBF     FILE(CDBOAT) TOFILE(&LIB2/CDBOAT)
             CALL       PGM(EDI21R6) PARM(&QTYPE &MAILA &TCP)
             ENDPGM
