             PGM        PARM(&AUT)
/*____________________*/
/* Definier variabler */
/*""""""""""""""""""""*/
             DCL        VAR(&AUT) TYPE(*CHAR) LEN(29)
             DCL        VAR(&WWUSER) TYPE(*CHAR) LEN(17) VALUE(SYNETT)
             CALL       PGM(EDI20R4) PARM(&AUT &WWUSER)
             DLYJOB     DLY(15)
             ENDPGM
