             PGM PARM(&QTYPE &VALUE &TCP &TYPE &KUNDNR &DATO)
/*____________________*/
/* Definier variabler */
/* MIDLERTIDIG HEADF I SYENDPTF */
/*""""""""""""""""""""*/
             DCL        VAR(&LIB2) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDF   ')
             DCL        VAR(&QTYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&VALUE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(2)
             DCL        VAR(&KUNDNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TCP) TYPE(*CHAR) LEN(1)
             OVRDBF     FILE(DOKUF) TOFILE(&LIB2/DOKUF)
             OVRDBF     FILE(TRAN) TOFILE(&LIB2/TRAN)
             OVRDBF     FILE(FIRM) TOFILE(&LIB2/FIRM)
             OVRDBF     FILE(HEAD4RMT) TOFILE(&LIB2/HEAD4RMT)
             OVRDBF     FILE(HEAD5RMT) TOFILE(&LIB2/HEAD5RMT)
             OVRDBF     FILE(HEAD6RMT) TOFILE(&LIB2/HEAD6RMT)
             OVRDBF     FILE(HEAD7RMT) TOFILE(&LIB2/HEAD7RMT)
             OVRDBF     FILE(HEAD8RMT) TOFILE(&LIB2/HEAD8RMT)
             OVRDBF     FILE(FRISOK) TOFILE(&LIB2/FRISOK)
             CALL       PGM(EDI20R3B) PARM(&QTYPE &VALUE &TCP &TYPE +
                          &KUNDNR &DATO)
             ENDPGM
