             PGM        PARM(&IFSFIL)
             DCL        VAR(&IFSFIL) TYPE(*CHAR) LEN(74)

             RMVLNK     OBJLNK(&IFSFIL)
             MONMSG     MSGID(CPF0000)

             ENDPGM
