             PGM        PARM(&IFSFIL)
             DCL        VAR(&IFSFIL) TYPE(*CHAR) LEN(74)

             RMVLNK     OBJLNK(&IFSFIL)
             MONMSG     MSGID(CPF0000)
             CPYTOSTMF  +
                          FROMMBR('QSYS.LIB/QTEMP.LIB/EDI41PXM.FILE/E+
                          DI41PXM.MBR') TOSTMF(&IFSFIL) +
                          STMFOPT(*ADD) ENDLINFMT(*FIXED)
             CHGAUT     OBJ(&IFSFIL) USER(*PUBLIC) DTAAUT(*RWX) +
                          OBJAUT(*ALL)

             ENDPGM
