             PGM        PARM(&INID)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
/*NXX        DCL        VAR(&LIBFX) TYPE(*CHAR) LEN(11) */
             DCL        VAR(&LIBFX) TYPE(*CHAR) LEN(12)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(128) VALUE('  ')
             DCL        VAR(&TIL2) TYPE(*CHAR) LEN(128) VALUE('  ')
             DCL        VAR(&TIL3) TYPE(*CHAR) LEN(128) VALUE('  ')
             DCL        VAR(&INID) TYPE(*CHAR) LEN(35)
             /*___________________________*/
             /* Monitor av alle meldinger */
             /*"""""""""""""""""""""""""""*/
             MONMSG     MSGID(CPF0000)
             /*___________________*/
             /* Hent filbibliotek */
             /*"""""""""""""""""""*/
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
             /*_____________________*/
             /* Lag katalogstruktur */
             /*"""""""""""""""""""""*/
             CHGVAR     VAR(&LIBFX) VALUE('/' *TCAT &LIBF *TCAT 'X')
             CRTDIR     DIR(&LIBFX) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBFX *TCAT '/' *TCAT &INID)
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL2) VALUE(&TIL *TCAT '/' *TCAT 'EDIRE')
             CRTDIR     DIR(&TIL2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'BACKUP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'TEMP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBFX *TCAT '/' *TCAT &INID)
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL2) VALUE(&TIL *TCAT '/' *TCAT 'EDIRE1K')
             CRTDIR     DIR(&TIL2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'BACKUP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'TEMP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBFX *TCAT '/' *TCAT &INID)
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL2) VALUE(&TIL *TCAT '/' *TCAT 'EDISE')
             CRTDIR     DIR(&TIL2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'BACKUP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'TEMP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)

             CHGVAR     VAR(&TIL) VALUE(&LIBFX *TCAT '/' *TCAT &INID)
             CRTDIR     DIR(&TIL) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL2) VALUE(&TIL *TCAT '/' *TCAT 'EDISE1K')
             CRTDIR     DIR(&TIL2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'BACKUP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&TIL3) VALUE(&TIL2 *TCAT '/' *TCAT 'TEMP')
             CRTDIR     DIR(&TIL3) DTAAUT(*RWX) OBJAUT(*ALL)

ENDPGM
