             PGM        PARM(&Æ002 &Æ003 &Æ004)
             DCL        VAR(&OK) TYPE(*LGL) LEN(1)
             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JUL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&Æ002) TYPE(*CHAR) LEN(8) /* ACCOUNT SRC */
             DCL        VAR(&Æ003) TYPE(*CHAR) LEN(8) /* USERID SRC */
             DCL        VAR(&Æ004) TYPE(*CHAR) LEN(8) /* PASSWORD SRC */
             DCL        VAR(&WAJCOD) TYPE(*CHAR) LEN(2) /* MAJCOD */
 /*_______________*/
 /* Hente EDIfact */
 /*"""""""""""""""*/
             CLRPFM     FILE(EDI73C2)
             CALL       PGM(EDI79R) PARM(&OK &Æ002 &Æ003 &Æ004 &WAJCOD)
             IF         COND(&OK *EQ '0') THEN(GOTO CMDLBL(END))

             CHGJOB     DATFMT(*JUL)
             RTVJOBA    DATE(&DATE)
             CHGJOB     DATFMT(*SYSVAL)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TIME)
             CHGVAR     VAR(&JUL) VALUE(%SST(&DATE 3 3))
             CHGVAR     VAR(&MEMBER) VALUE('E' *CAT &JUL *CAT &TIME)
             CPYF       FROMFILE(EDI73C2) TOFILE(EDI79F) +
                          TOMBR(&MEMBER) MBROPT(*ADD) +
                          FMTOPT(*NOCHK)

END:         ENDPGM
