             PGM        PARM(&Æ002 &Æ003 &Æ004)
             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JUL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&Æ002) TYPE(*CHAR) LEN(8) /* ACCOUNT SRC */
             DCL        VAR(&Æ003) TYPE(*CHAR) LEN(8) /* USERID SRC */
             DCL        VAR(&Æ004) TYPE(*CHAR) LEN(8) /* PASSWORD SRC */
             DCL        VAR(&Æ007) TYPE(*CHAR) LEN(1) /* STATUS +
                          '0'=OK   '1'=OK passw exp soon   '2'=NOK +
                          passw exp     '3'=NOK */
             DCL        VAR(&FILIBF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NBRCURRCD) TYPE(*DEC) LEN(10 0)
 /*_______________*/
 /* Hente EDIfact */
 /*"""""""""""""""*/
             CLRPFM     FILE(EDI73C5)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&FILIBF)
             CALL       PGM(E071C) PARM('R' &Æ002 &Æ003 &Æ004 +
                          '*ALL    ' '*ALL    ' &Æ007 &FILIBF +
                          'EDI73C5   ' '*FIRST')
             RTVMBRD    FILE(EDI73C5) NBRCURRCD(&NBRCURRCD)
             IF         COND(&NBRCURRCD *EQ 0) THEN(GOTO CMDLBL(END))

             CHGJOB     DATFMT(*JUL)
             RTVJOBA    DATE(&DATE)
             CHGJOB     DATFMT(*SYSVAL)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TIME)
             CHGVAR     VAR(&JUL) VALUE(%SST(&DATE 3 3))
             CHGVAR     VAR(&MEMBER) VALUE('E' *CAT &JUL *CAT &TIME)
             CPYF       FROMFILE(EDI73C5) TOFILE(EDI79F) +
                          TOMBR(&MEMBER) MBROPT(*ADD) +
                          FMTOPT(*NOCHK)


 END:        ENDPGM
