             PGM
             DCL        VAR(&CTLD) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(EDIDTA (72 10)) RTNVAR(&CTLD)
             WRKCFGSTS  CFGTYPE(*CTL) CFGD(&CTLD)
             ENDPGM
