             PGM        PARM(&MBR &LIB)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             CPYF       FROMFILE(&LIB/EDIRE) TOFILE(TELIF) +
                          FROMMBR(*FIRST) TOMBR(*FIRST) +
                          MBROPT(*REPLACE) FROMKEY(1 (&MBR)) +
                          TOKEY(1 (&MBR)) FMTOPT(*NOCHK) /*N01*/
             /*_______________________*/
 END:        ENDPGM
