             PGM        PARM(&MSG)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(256)
             DCL        VAR(&EP) TYPE(*CHAR) LEN(70) +
                          VALUE('BING@SYSTEMA.NO')

             SNDDST     TYPE(*LMSG) TOINTNET((&EP)) DSTD('FEIL I +
                          KONVERTERING AV INNGÅENDE FIL') +
                          LONGMSG(&MSG) USRID(*CURRENT) SNDFMT(*NOCHG)
             MONMSG     MSGID(CPF0000)

             ENDPGM
