             PGM        PARM(&MBR &LIB)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             CPYF       FROMFILE(&LIB/EDIRE) TOFILE(BBSAF) +
                          FROMMBR(*FIRST) TOMBR(BBSOCR) +
                          MBROPT(*REPLACE) FROMKEY(1 (&MBR)) +
                          TOKEY(1 (&MBR)) FMTOPT(*NOCHK)
             OVRDBF     FILE(BBSAF) TOFILE(BBSAF) MBR(BBSOCR)
             CALL   PGM(EDIKID8)
             /*_______________________*/
 END:        ENDPGM
