             PGM PARM(&WAIT)
             DCL        VAR(&WAIT) TYPE(*CHAR) LEN(1)
             CALL       PGM(EDIRELW) PARM(&WAIT)
             ENDPGM
