             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
             ADDLIBLE   FOP24_DAT *LAST
             MONMSG CPF0000
             CLRPFM     FILE(FOP24_DAT/TOUTF)
             MONMSG CPF0000
             CALL       PGM(EFQR_LG93A) PARM(&WMN1)
             RMVLIBLE   LIB(FOP24_DAT)
             MONMSG CPF0000
             CALL       PGM(FOP24_PGM/FPC502SY) PARM('01')
             ENDPGM
