             PGM
 /*______________________________________________*/
 /* OBS! TO-IDENTEN MÅ LIGGE I "UTVEKSLINGSIDER" */
 /*  (MENY EDIMNU3 PKT 2) DER HENTES NET-ID M.M. */
 /*""""""""""""""""""""""""""""""""""""""""""""""*/
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IFS) TYPE(*CHAR) LEN(256) +
                          VALUE('/A43SYSPEDFX/EDISE1K/a431.CSV')
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(35) VALUE('A43GC')
             DCL        VAR(&TO) TYPE(*CHAR) LEN(35) VALUE('AS400EX')
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IFS) TYPE(*CHAR) LEN(256)
             CALL       PGM(EGF06R) PARM(&LIB &IFS &MBR &FROM &TO)

 END:        ENDPGM
