/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NYTT PARAMETER FOR POSTTYPE                        */
/* 10035 * 02 YBC PTF10 EKSTRA TEKST PÅ MELDING                            */
/* ********************************************************************    */
/*S01        PGM        PARM(&FIRM &SAKN &AVS &MOT)     */
/*S02        PGM        PARM(&FIRM &SAKN &POSTTYPE &AVS &MOT) */
/*N02*/      PGM        PARM(&FIRM &SAKN &POSTTYPE &AVS &MOT &KP &EM +
                          &MTXT)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(2)
             DCL        VAR(&SAKN) TYPE(*CHAR) LEN(7)
/*N01*/      DCL        VAR(&POSTTYPE) TYPE(*CHAR) LEN(5)
             DCL        VAR(&AVS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MOT) TYPE(*CHAR) LEN(10)
/*N02*/      DCL        VAR(&KP) TYPE(*CHAR) LEN(30)
/*N02*/      DCL        VAR(&EM) TYPE(*CHAR) LEN(50)
/*N02*/      DCL        VAR(&MTXT) TYPE(*CHAR) LEN(70)
/*N02*/      DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)

/*S01        CALL       PGM(EISO17R) PARM(&FIRM &SAKN &AVS &MOT)   */
/*S02        CALL       PGM(EISO17R) PARM(&FIRM &SAKN &POSTTYPE &AVS &MOT) */
/*N02*/      CHGVAR     VAR(&MBR) VALUE('ISO' *CAT &SAKN)
/*N02*/      OVRDBF     FILE(ISOVARSL) TOFILE(ISOVARSL) MBR(&MBR)
/*N02*/      MONMSG     MSGID(CPF0000)
/*N02*/      ADDLIBLE   LIB(MMAIL)
/*N02*/      MONMSG     MSGID(CPF0000)
/*N02*/      CALL       PGM(EISO17R) PARM(&FIRM &SAKN &POSTTYPE &AVS +
                          &MOT &KP &EM &MTXT)
/*N02*/      DLTOVR     FILE(ISOVARSL)
/*N02*/      MONMSG     MSGID(CPF0000)
/*N02*/      RMVLIBLE   LIB(MMAIL)
/*N02*/      MONMSG     MSGID(CPF0000)

             ENDPGM
