             PGM        PARM(&SAKNR)
             DCL        VAR(&SAKNR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&MBR) VALUE('ISO' *CAT &SAKNR)
             RMVM       FILE(ISOVARSL) MBR(&MBR)
             MONMSG     MSGID(CPF0000)
             ADDPFM     FILE(ISOVARSL) MBR(&MBR)
             MONMSG     MSGID(CPF0000)

             ENDPGM
