             PGM        PARM(&POREF &UNIK)
             DCL        VAR(&SPL) TYPE(*CHAR) LEN(10) VALUE('CC026P')
             DCL        VAR(&POREF) TYPE(*CHAR) LEN(18)
             DCL        VAR(&KN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&BES) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TMP196) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TMP196M) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             DCL        VAR(&CNAME) TYPE(*CHAR) LEN(30)
             DCL        VAR(&CMAIL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&SNAME) TYPE(*CHAR) LEN(30)
             DCL        VAR(&SMAIL1) TYPE(*CHAR) LEN(70)
             DCL        VAR(&SMAIL2) TYPE(*CHAR) LEN(70)
             DCL        VAR(&SMAIL3) TYPE(*CHAR) LEN(70)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&TMP196) VALUE('TMP' *CAT &UNIK)
             CHGVAR     VAR(&TMP196M) VALUE('/QSYS.LIB/QTEMP.LIB/' +
                          *CAT &TMP196 *CAT '.FILE/' *CAT &TMP196 +
                          *CAT '.MBR')

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             CHGVAR     VAR(&KN) VALUE(%SUBSTRING(&POREF 1 8))
             CHGVAR     VAR(&BES) VALUE(%SUBSTRING(&POREF 9 10))

             CLRPFM     FILE(QTEMP/&TMP196)
             MONMSG     MSGID(CPF3142) EXEC(CRTPF +
                          FILE(QTEMP/&TMP196) RCDLEN(196) +
                          SIZE(1000000 10000))
             OVRDBF     FILE(TMP196) TOFILE(QTEMP/&TMP196)


 /*LEGG INN START-HTML*/
             CHGVAR     VAR(&STMF) VALUE('/syspeddev/temp/HUBLIST' +
                          *TCAT &POREF *TCAT '.pdf')
             OVRPRTF    FILE(CC026P) PAGESIZE(72 132) LPI(6) +
                          CPI(15) OVRFLW(64) OUTQ(SYCGIOUTQ) +
                          DEVTYPE(*AFPDS) +
                          FORMTYPE(*STD) SPLFOWN(*JOB)
             CALL       PGM(CC026R) PARM(&KN &BES &CNAME &CMAIL +
                          &SNAME &SMAIL1 &SMAIL2 &SMAIL3 &OK)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
 /* gidder ikke hensynta INFOPRINT-metode  */
             DSPJOBLOG  OUTPUT(*PRINT)
             CALL       PGM(INF001CL) PARM(&SPL &QNBR &QUSER &QJOB +
                          &STMF)
             DSPJOBLOG  OUTPUT(*PRINT)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(CC026P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

 /*              */
             CHGAUT     OBJ(&STMF) USER(QTMHHTTP) DTAAUT(*RWX) +
                          OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)

             DLTOVR     FILE(TMP196)
             CLRPFM     FILE(QTEMP/&TMP196)
             MONMSG     MSGID(CPF0000)

             ENDPGM
