             PGM
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             CALL       PGM(SYSPED/INLIBL)

           /* BASERT PÅ LINJE STATUS 0,1,15 / KOMBINRET MED STATUS 2 = S */
           /*           MERK  HEADER STAT2 = S                          */
 START:      CALL       PGM(EPOMS51R)
           /* LES HEAD PÅ STAT2 = S - LEGGE UT ORDRSP                    */
             CALL       PGM(EPOMS52R)

   /* VENT XX SEK FØR NESTE SYKLUS */
             DLYJOB     DLY(60)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TIME)
             IF         COND(&TIME *GT '230000') THEN(GOTO CMDLBL(END))
             GOTO       CMDLBL(START)

 END:        ENDPGM
