             PGM
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1) VALUE('2')
             DCL        VAR(&LIST) TYPE(*CHAR) LEN(7)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(EPOS02) PARM(&MODE &LIST)
             ENDPGM
