             PGM        PARM(&KOBL &NEWOBJ)
             DCL        VAR(&KOBL) TYPE(*CHAR) LEN(100)
             DCL        VAR(&NEWOBJ) TYPE(*CHAR) LEN(200)

             MOV        OBJ(&KOBL) TOOBJ(&NEWOBJ) TOCCSID(277)
             MONMSG     MSGID(CPF0000)
             ENDPGM
