/* SENDE FRAKTBREV PÅ EMAIL  BASERT PÅ ZEADF    */
/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 TOLLPASSFRAKTBREV                                  */
/* 10XXX * 02 JOV PTF11 LPI(12) + SIDESTØRRELSE/OVERFLOW DOBLET SYBRINGTMS */
/*                              + SIDEBREDDE- 90->100                      */
/* ********************************************************************    */
/*S01        PGM        PARM(&UUUNIK &STMF)   */
/*N01*/      PGM        PARM(&UUUNIK &STMF &TOLLP)
/*N01*/      DCL        VAR(&TOLLP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UUUNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

    /* OVERRIDE PRINTERFILE/SKRIV-FR.BEV  */
 VIDERE:     OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          100) LPI(12) CPI(10) OVRFLW(140) +
                          FRONTMGN(0 0) +
                          FRONTOVL(FRAKTBRE 0.1) +
                          OUTQ(SYCGIOUTQ) FORMTYPE(*STD) SPLFOWN(*JOB)

/*S01        CALL       PGM(SYFA12B) PARM(&UUUNIK &STMF)  */
/*N01*/      CALL       PGM(SYFA12B) PARM(&UUUNIK &STMF &TOLLP)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYGE40) PARM(&INFOP)
             IF         COND(&INFOP = 'N') THEN(DO)
             CHGVAR     VAR(&STMF2) VALUE('/syspeddev/temp/' *CAT &STMF)
             CHGVAR     VAR(&STMF) VALUE(&STMF2)
             CVTSPLFPDF SPLF(SYFA12P) TOPDF(&STMF) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST)
                          ENDDO
             IF         COND(&INFOP = 'J') THEN(DO)
             CHGVAR     VAR(&FILEN) VALUE('SYFA12P')
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &STMF)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             DLTSPLF    FILE(SYFA12P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
