/* SENDE CMR FRAKTBREV PÅ EMAIL  BASERT PÅ ZEADF    */
/* se fax026cle */
             PGM        PARM(&UUUNIK &FIRMA &AVD &STMF)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&UUUNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             CHGDTAARA  DTAARA(*LDA *ALL) VALUE(' ')
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&FIRMA)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             CHGDTAARA  DTAARA(*LDA (100 1)) VALUE('W')
             CHGDTAARA  DTAARA(*LDA (101 9)) VALUE(&UUUNIK)
    /* OVERRIDE PRINTERFILE/SKRIV-FR.BEV  */
/*           OVRPRTF    FILE(SYEX43P) DEV(FAX3812) DEVTYPE(*AFPDS) +
                          PAGESIZE(70 85) LPI(6) CPI(10) OVRFLW(70) +
                          FRONTOVL(FCMR1 0.31 0.05) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) SPLFOWN(*JOB) */
             OVRPRTF    FILE(SYEX43P) DEV(FAX3812) DEVTYPE(*AFPDS) +
                          PAGESIZE(70 85) LPI(6) CPI(10) OVRFLW(70) +
                          FRONTOVL(CM1 0 0) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) SPLFOWN(*JOB)
             CALL       PGM(SYEX43)
             RTVDTAARA  DTAARA(*LDA (301 50)) RTNVAR(&STMF)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYGE40) PARM(&INFOP)
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(SYEX43P) TOPDF(&STMF) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST)
                          ENDDO
             IF         COND(&INFOP = 'J') THEN(DO)
             CHGVAR     VAR(&FILEN) VALUE('SYEX43P')
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &STMF)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             DLTSPLF    FILE(SYEX43P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
