/* SENDE CMR FRAKTBREV PÅ EMAIL  BASERT PÅ ZEADF    */
/* se fax026cle */
             PGM
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2) VALUE('TT')
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('1010')
             DCL        VAR(&UUUNIK) TYPE(*CHAR) LEN(9) +
                          VALUE('010000040')
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&STMF) VALUE('/syspeddev/temp/CMRBRZ' +
                          *CAT &UUUNIK *CAT '.pdf')

             CHGDTAARA  DTAARA(*LDA *ALL) VALUE(' ')
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&FIRMA)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             CHGDTAARA  DTAARA(*LDA (100 1)) VALUE('W')
             CHGDTAARA  DTAARA(*LDA (101 9)) VALUE(&UUUNIK)
    /* OVERRIDE PRINTERFILE/SKRIV-FR.BEV  */
             OVRPRTF    FILE(SYEX43P) DEV(FAX3812) DEVTYPE(*AFPDS) +
                          PAGESIZE(70 85) LPI(6) CPI(10) OVRFLW(70) +
                          FRONTOVL(FCMR1 0.31 0.05) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) HOLD(*YES) SPLFOWN(*JOB)
             CALL       PGM(SYEX43)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CVTSPLFPDF SPLF(SYEX43P) TOPDF(&STMF) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             DLTSPLF    FILE(SYEX43P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
