/* KJØRER BLUEFAX */
/*N01 * FRERE PARAM */
/*S01        PGM        PARM(&AVD &OPD &ACT &DATE &TIME &DATL &TIML +
                          &TEXT &USR &CONT &FAX)  */
/*N01 */     PGM        PARM(&AVD &OPD &ACT &DATE &TIME &DATL &TIML +
                          &EDEV &TEXL &TEXT &USR &CONT &FAX)
             DCL        VAR(&AVD)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD)  TYPE(*CHAR) LEN(7)
             DCL        VAR(&ACT)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATL) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TIML) TYPE(*CHAR) LEN(6)
/*N01 */     DCL        VAR(&EDEV) TYPE(*CHAR) LEN(3)
/*N01 */     DCL        VAR(&TEXL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&TEXT) TYPE(*CHAR) LEN(70)
             DCL        VAR(&USR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&CONT) TYPE(*CHAR) LEN(30)
             DCL        VAR(&FAX)  TYPE(*CHAR) LEN(21)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) VALUE('ADVIS')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             OVRPRTF    FILE(ESTSTTFP) PAGESIZE(72 90) LPI(6) +
                          CPI(12) OVRFLW(72) OUTQ(QFAX/QFAXOUTQ)
    /*LAG SPOOLFILE */
/*E01*/      CALL       PGM(ESTSTTF) PARM(&AVD &OPD &ACT &DATE &TIME +
                          &DATL &TIML &EDEV &TEXL &TEXT &USR &CONT &FAX)
    /*FIXER FAXNR */
             CALL       PGM(FAX017) PARM(&FAX)

    /*SEND VIA BLUEFAX */
             FAX/SNDFAXSPLF FILE(ESTSTTFP) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAX *N &KNAVN))
   /* FAXLOGG ??? */
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
    /* */
 SLUTT:      ENDPGM
