             PGM        PARM(&AVD &OPD &FUNKSJON)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FUNKSJON) TYPE(*CHAR) LEN(2)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)

             CALL       PGM(EUR04SR) PARM(&AVD &OPD &FUNKSJON)

             ENDPGM
