PGM (&FROMPDF &TOPDF &SELECTION &JDEBUG)

  COPYRIGHT  ('Giuseppe Costagliola 2005 - beppecosta@yahoo.it')

  DCL &FROMPDF    *CHAR  60
  DCL &TOPDF      *CHAR  60
  DCL &SELECTION  *CHAR  20
  DCL &JDEBUG     *CHAR  4

  DCL &CLASSPATH  *CHAR  300
  DCL &OUTPUT     *CHAR  20

  DCL &ERRORSW    *LGL
  MONMSG CPF0000 EXEC(GOTO ERROR)

  CHGVAR &CLASSPATH ('/pdfm/itext-1.3.6.jar:/pdfm/:.')

  IF (&JDEBUG = *NO) CHGVAR &OUTPUT *NONE
  ELSE CHGVAR &OUTPUT '*'

  RUNJVA CLASS('EXTRACTPDF') +
         PARM(&FROMPDF &TOPDF &SELECTION &JDEBUG) +
         CLASSPATH(&CLASSPATH) CHKPATH(*IGNORE) OUTPUT(&OUTPUT)

  RETURN

/********************************************************************/
/********************************************************************/
/* Errors                                                           */
/********************************************************************/

ERROR:
  IF &ERRORSW SNDPGMMSG MSGID(CPF9899) +
     MSGF(QCPFMSG) MSGTYPE(*ESCAPE)    /* FUNCTION CHECK           */
  CHGVAR &ERRORSW '1'                  /* SET SWITCH TO ERROR      */
  CALL QMHRSNEM ('    ' X'0000000F0000000040404040404040' +
                 X'000000015CD5D6D5C540404040405CD5D6D5C54040404040+
                   000000095CD7C7D4C2C4E840404040404040404040404040' +
                 X'00000030' RSNM0100 * X'00000000')

ENDPGM
