             PGM        PARM(&DOKNA &MAPPE &FAX &PTIME &PDATE &NAVN +
                             &AVD &OPD &TUR &KODE)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNA) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WRKSTN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(30)
             DCLF       FILE(FAXSEN)
             RCVF       RCDFMT(*FILE)

             CALL       PGM(FAX017) PARM(&FAX)
             CHGVAR     VAR(&TXT) VALUE('.FAX ' *CAT &FAX)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(QSYSPRT) DRAWER(3) PRTTXT(&TXT)
             PRTDOC     DOC(&DOKNA) FLR(&MAPPE) OPTIONS(*NO) +
                          OUTPUT(*PRINT) OUTQ(&FAXLIB/&FAXUTK) +
                          JOBQ(*NO)
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DOKNA &MAPPE &PTIME &PDATE &NAVN +
                          &AVD &OPD &TUR &KODE)
             ENDPGM
