/* FAXE FERJEBOOKING BLUEFAX */
             PGM        PARM(&BPARM)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('T')
             DCL        VAR(&BPARM)    TYPE(*CHAR) LEN(500)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) +
                          VALUE('Ferjebook')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&RUND) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MONT) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YEAR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&LENG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(4)
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(5)
             DCL        VAR(&TO) TYPE(*CHAR) LEN(5)
             DCL        VAR(&NAME) TYPE(*CHAR) LEN(30)
             DCL        VAR(&BILN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&C1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10) +
                          VALUE('FERJBOOK  ')
    /* FERJEBOOKING                       */
    /*                                    */
             CHGVAR     VAR(&FIRM) VALUE(%SST(&BPARM 1 8))
             CHGVAR     VAR(&AVD) VALUE(%SST(&BPARM  9 4))
             CHGVAR     VAR(&TUR) VALUE(%SST(&BPARM 13 8))
             CHGVAR     VAR(&RUND) VALUE(%SST(&BPARM 21 8))
             CHGVAR     VAR(&DAY) VALUE(%SST(&BPARM 29 2))
             CHGVAR     VAR(&MONT) VALUE(%SST(&BPARM 31 2))
             CHGVAR     VAR(&YEAR) VALUE(%SST(&BPARM 33 2))
             CHGVAR     VAR(&TIME) VALUE(%SST(&BPARM 35 4))
             CHGVAR     VAR(&FROM) VALUE(%SST(&BPARM 39 5))
             CHGVAR     VAR(&TO) VALUE(%SST(&BPARM 44 5))
             CHGVAR     VAR(&LENG) VALUE(%SST(&BPARM 49 3))
             CHGVAR     VAR(&NAME) VALUE(%SST(&BPARM 52 30))
             CHGVAR     VAR(&BILN) VALUE(%SST(&BPARM 82 10))
             CHGVAR     VAR(&FAX) VALUE(%SST(&BPARM 92 21))
             CHGVAR     VAR(&C1) VALUE(%SST(&BPARM 113 40))
             CHGVAR     VAR(&C2) VALUE(%SST(&BPARM 153 40))
             CHGVAR     VAR(&C3) VALUE(%SST(&BPARM 193 40))
             CHGVAR     VAR(&C4) VALUE(%SST(&BPARM 233 40))
             CHGVAR     VAR(&C5) VALUE(%SST(&BPARM 273 40))
             CHGVAR     VAR(&C6) VALUE(%SST(&BPARM 313 40))
             CHGVAR     VAR(&C7) VALUE(%SST(&BPARM 353 40))
             CHGVAR     VAR(&C8) VALUE(%SST(&BPARM 393 40))
             CHGVAR     VAR(&CVP) VALUE(%SST(&BPARM 433 1))
    /* */
    /* */
    /* FIX SEPARATE GIRO */
    /* */
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* */
    /*                                    */
    /*                                    */
             CALL       PGM(FAX017) PARM(&FAX)
             OVRPRTF    FILE(FERJBOOK) TOFILE(LISTE) DEVTYPE(*SCS) +
                          PAGESIZE(66 80) OVRFLW(66)
             CALL       PGM(FAX035R) PARM(&FIRM &AVD &TUR &RUND +
                          &DAY &MONT &YEAR &TIME &FROM &TO &LENG +
                          &NAME &BILN &FAX)
             IF         COND(&CVP = 'J') THEN(FAX/SNDFAXSPLF +
                          FILE(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAX *N &NAME)) +
                          CPGPAG(*DFT) CPGTXT(&C1 &C2 &C3 +
                          &C4 &C5 &C6 &C7 &C8))

             ELSE       CMD(FAX/SNDFAXSPLF FILE(&FILEN) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAX *N &NAME)))

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &NAME +
                          &AVD &OPD &TUR &KODE)
    /* */
 SLUTT:      ENDPGM
