             PGM        PARM(&BPARM)
             DCL        VAR(&BPARM)    TYPE(*CHAR) LEN(35)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DOKNA) TYPE(*CHAR) LEN(12)
             DCL        VAR(&BRUKER)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&UNIK)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&FUSERI)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&NAVN)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&FNAVN)    TYPE(*CHAR) LEN(30)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&FFAXNB) TYPE(*CHAR) LEN(32)
             DCL        VAR(&FFAXN2) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FTO) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FTO1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FTO2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FTO3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FTITLE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FCOMME) TYPE(*CHAR) LEN(40)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('0000')
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('D')
             DCL        VAR(&BR10) TYPE(*CHAR) LEN(10)
/* */
             CHGVAR     VAR(&UNIK) VALUE(%SST(&BPARM 1 8))
             CHGVAR     VAR(&BRUKER) VALUE(%SST(&BPARM 9 8))
             CHGVAR     VAR(&NAVN) VALUE(%SST(&BPARM 17 10))
             CHGVAR     VAR(&FUSERI) VALUE(%SST(&BPARM 27 8))
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/* */
             OVRPRTF    FILE(QSYSPRT) DRAWER(3)
             PRTDOC     DOC(&UNIK) FLR(&BRUKER) OPTIONS(*NO) +
                          OUTPUT(*PRINT) DEV(FAX3812) FORMTYPE(*STD)
/* */
             RTVUSRPRF  USRPRF(&BRUKER) RTNUSRPRF(&NAVN)
/* */
             CALL       PGM(FAXGR2) PARM(&FUSERI &FFAXNB &FTO &FTO1 +
                          &FTO2 &FTO3 &FTITLE &FCOMME)
/* */
             CHGVAR     VAR(&DOKNA) VALUE(&UNIK)
             CHGVAR     VAR(&MAPPE) VALUE(&BRUKER)
             CHGVAR     VAR(&BR10) VALUE(&BRUKER)
             CHGVAR     VAR(&FNAVN) VALUE(&FTO)
             CHGVAR     VAR(&FFAXN2) VALUE(&FFAXNB)
/* */

             CALL       PGM(FAX017) PARM(&FFAXNB)
             SNDFAX    TO((&FFAXNB &FTO &FTO1 &FTO3)) FILE(&UNIK) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          CRTCVRP(*YES) TITLE(&FTITLE) FROM(&NAVN +
                          *BLANK) COMMENT(&FCOMME)
/* */
             CALL       PGM(FAX013) PARM(&BR10 &QNBR &QJOB &FFAXN2 +
                          &DOKNA &MAPPE &PTIME &PDATE &FNAVN &AVD +
                          &OPD &TUR &KODE)
/* */
             ENDPGM
