             PGM        PARM(&FAX &FILEN &PTIME &PDATE &KNAVN &AVD +
                          &OPD &FBN &KODE &DONAV &ATTN)
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) VALUE('OUTMAIL')
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) VALUE('QPRINT')
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10) VALUE('QPRINT')
             DCL        VAR(&FAXTYP) TYPE(*CHAR) LEN(1) VALUE('F')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PO) TYPE(*CHAR) LEN(1) VALUE('F') /* +
                          HVIS &PO = 'J',SORT   F=FAX             */
             DCL        VAR(&COVP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&COVL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) VALUE('00') +
                          /* ANTALL UTSKRIFTER. */
             DCL        VAR(&BPARM)    TYPE(*CHAR) LEN(423)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&NULL5) TYPE(*CHAR) LEN(5) VALUE('00000')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FBN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12)
             DCL        VAR(&ATTN) TYPE(*CHAR) LEN(30)
    /* SKRIVER UT TOLLDEK  KOPI           */
    /*                                    */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(&FILEN)  DEVTYPE(*AFPDS) +
                          PAGESIZE(72 83) LPI(6) CPI(10) +
                          FRONTMGN(0.14 0) OVRFLW(72) +
                          FRONTOVL(FSAD38) +
                          OUTQ(QFAX/QFAXOUTQ) FORMTYPE(*STD)
             OVRPRTF    FILE(TOLLDEK2) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 83) LPI(6) CPI(10) +
                          OVRFLW(72) +
                          OUTQ(QPRINT) FORMTYPE(*STD)
             OVRPRTF    FILE(DATALIST) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 83) LPI(6) CPI(10) +
                          OVRFLW(72) +
                          OUTQ(QFAX/QFAXOUTQ) FORMTYPE(*STD)
             OVRDBF     FILE(WFILEIMP) MBR(SADPRT)
             OVRDBF     FILE(WFILEEXP) MBR(SADPRT)
             IF         COND(&KODE = 'I') THEN(DO)
             CALL       PGM(SAD61P) PARM(&FAXTYP &AVD &OPD &PRT1 +
                          &PRT2 &PRT3)
             ENDDO
             IF         COND(&KODE = 'E') THEN(DO)
             CALL       PGM(SAD52P) PARM(&FAXTYP &AVD &OPD &PRT1 +
                          &PRT2 &PRT3)
             ENDDO

             CALL       PGM(FAX017) PARM(&FAX)
             CALL       PGM(FAX023) PARM(&AVD &OPD &FBN &KODE &KNAVN +
                          &ATTN)
             SNDFSPL    SPF(&FILEN &QJOB &QUSER &QNBR *LAST) +
                          DESC('FAX AV SAD') DIAL(*N &FAX)

             CHGVAR     VAR(&KODE) VALUE('O')
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
    /* */
 SLUTT:      ENDPGM
