             PGM        PARM(&AVD &OPD)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
    /* */
    /* */
             CALL       PGM(FAX025A) PARM(&AVD &OPD)
    /* */
 SLUTT:      ENDPGM
