             PGM        PARM(&DFAVD &DFOPD)
             DCL        VAR(&DFAVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&DFOPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* */
             CALL       PGM(FAX026A) PARM(&DFAVD &DFOPD)
    /* */
 SLUTT:      ENDPGM
