             PGM        PARM(&MAPPE)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             WRKDOC     FLR(&MAPPE)
             MONMSG     MSGID(CPF0000)
             ENDPGM
