             PGM        PARM(&FAXNR)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             ALCOBJ     OBJ((QSYS/TLX400B *LIB *SHRUPD))
             MONMSG     MSGID(CPF1085) EXEC(GOTO CMDLBL(SLUTT))
             CALL       PGM(FAX017) PARM(&FAXNR)
             DLCOBJ     OBJ((QSYS/TLX400B *LIB *SHRUPD))
SLUTT:       ENDPGM
