             PGM        PARM(&PDATE)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(6)
             SBMJOB     CMD(CALL PGM(*LIBL/FAX018CL2) PARM(&PDATE)) +
                          JOB(FAXREORG) JOBQ(SYJOBQNMAX) LOG(0 +
                          99 *NOLIST) LOGCLPGM(*NO)
             ENDPGM
