             PGM
             DCL        VAR(&KUNR) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P3) TYPE(*CHAR) LEN(1)
             RTVJOBA    JOB(&JOB)
             ADDPFM     FILE(FHEADF) MBR(&JOB)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(FHEADF) MBR(&JOB)
             OVRDBF     FILE(FHEADF) TOFILE(FHEADF) MBR(&JOB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(FAX010) PARM(&KUNR &AVD &OPD &P1 &P2 &P3)
             ENDPGM
