             PGM
             DCL        VAR(&DFFRI) TYPE(*CHAR) LEN(1) VALUE('F')
             DCL        VAR(&DFAVD) TYPE(*DEC) LEN(4 0) VALUE(0)
             DCL        VAR(&DFOPD) TYPE(*DEC) LEN(7 0) VALUE(0)
             DCL        VAR(&DFFBNR) TYPE(*DEC) LEN(3 0) VALUE(0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('0000')
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* */
    /* */
             CALL       PGM(FAX023A) PARM(&DFFRI &DFAVD &DFOPD &DFFBNR)
    /* */
    /* */
 SLUTT:      ENDPGM
