 /*           SENDE FAKTURA PÅ FAX    */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, avbryt program */
             DCL        VAR(&P1) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P2) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&P3) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P4) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P5) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P6) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P7) TYPE(*CHAR) LEN(1) VALUE('J')
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
    /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             CALL       PGM(SYFABF) PARM(&IN01 &P3)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(FAX001) PARM(&P1 &P2 &P3 &P4 &P5 &P6 &P7)
    /* */
 SLUTT:      ENDPGM
