/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SYFA55PF OG SYFA55CP                               */
/* ********************************************************************    */
             PGM        PARM(&FAXNR &DOKNA12 +
                             &MAPPE &PTIME &PDATE &NAVN &AVD &OPD +
                              &TUR &KODE &KUNR &BELJN)
             DCL        VAR(&UDSFAX) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&BELJN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DADRJN) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&TX) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PRTNAV) TYPE(*CHAR) LEN(10) +
                          VALUE('GODSLIST')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KUNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNAVN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNA12) TYPE(*CHAR) LEN(12)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in07 på, betyr uten oppdatering. */
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &in08 på, betyr prøve manifest. */
             DCL        VAR(&FAKT) TYPE(*CHAR) LEN(1) /* Hvis &FAKT +
                          på, betyr at det skal kjøre faktura */
             DCL        VAR(&JBK) TYPE(*CHAR) LEN(1) /* Jobbkø. */
                                                          /**/
    /* ----------------------------------------------------------- */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&DOKNA12) VALUE(&DOKNAVN)
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)
             CHGVAR     VAR(&DOKNA12) VALUE(&PRTNAV)
    /* SKRIVER UT GODSLISTE  */
             CALL       PGM(FAX017) PARM(&FAXNR)
/*S01        OVRPRTF    FILE(GODSLIST) PAGESIZE(72 120) CPI(16,7) +
                          FRONTMGN(0 0,3) OVRFLW(70) DRAWER(2) +
                          OUTQ(QEZJOBLOG)                           */
/*N01*/      OVRPRTF    FILE(SYFA55CP) PAGESIZE(72 120) CPI(16,7) +
                          FRONTMGN(0 0,3) OVRFLW(70) DRAWER(2) +
                          OUTQ(QEZJOBLOG)
/*N01*/      OVRPRTF    FILE(SYFA55CP) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(72) PAGRTT(0) +
                          OUTQ(QEZJOBLOG)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA55) PARM(&AVD &TUR &KUNR &BELJN +
                          &UDSFAX &DADRJN) /*E01*/
             SNDFSPL    SPF(GODSLIST &QJOB &QUSER &QNBR *LAST) +
                          DESC('Fax av godsliste') DIAL(*N &FAXNR)
    /* ----------------------------------------------------------- */
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &DOKNA12 &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
    /* */
                                                          /**/
SLUTT:       ENDPGM
