             PGM        PARM(&NAVN &FAXNR &MNV &MAD1 &MAD2 &MAD3 +
                          &MATT &DOK &MAPPE &TID &DATO &TXT &CVP)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&MNV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAD1) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAD2) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAD3) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MATT) TYPE(*CHAR) LEN(30)
             DCL        VAR(&TID) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOK) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(900)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)

             DCLF       FILE(FAXSEN)
             RCVF       RCDFMT(*FILE)

             CALL       PGM(FAX017) PARM(&FAXNR)

             IF         COND((&CVP *EQ 'J') *AND (&FAXCPN *NE '  ')) +
                          THEN(DO)
             DLTDTAARA  DTAARA(QTEMP/CVROVR)
             MONMSG     MSGID(CPF0000)
             CRTDTAARA  DTAARA(QTEMP/CVROVR) TYPE(*CHAR) LEN(384) +
                          VALUE(*BLANKS)
             CHGDTAARA  DTAARA(CVROVR (1 30)) VALUE(&MNV)
             CHGDTAARA  DTAARA(CVROVR (31 30)) VALUE(&MAD1)
             CHGDTAARA  DTAARA(CVROVR (61 30)) VALUE(&MAD2)
             CHGDTAARA  DTAARA(CVROVR (91 30)) VALUE(&MAD3)
             CHGDTAARA  DTAARA(CVROVR (216 30)) VALUE(&MATT)
             CHGDTAARA  DTAARA(CVROVR (256 2)) VALUE(&FAXCPN)
             DLTDTAARA  DTAARA(QTEMP/CVRTXT)
             MONMSG     MSGID(CPF0000)
             CRTDTAARA  DTAARA(QTEMP/CVRTXT) TYPE(*CHAR) LEN(1875) +
                          VALUE(*BLANKS)
             CHGDTAARA  DTAARA(CVRTXT (1 900)) VALUE(&TXT)
             SNDFDOC    DOC(&DOK &MAPPE) DIAL(*N &FAXNR) CVRID(&FAXCPN)
             ENDDO
             ELSE       CMD(DO)
             SNDFDOC    DOC(&DOK &MAPPE) DIAL(*N &FAXNR)
             ENDDO

             ENDPGM
