             PGM        PARM(&DOKNA &FAX &NAVN &PTIME &PDATE &STD +
                          &MAPPE)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(15)
             DCL        VAR(&STD) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(12)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             IF         COND(&STD = '            ') THEN(CRTDOC +
                          DOC(&DOKNA) FLR(FAXTEMP) TXTPRF(*SYSTEM) +
                          TEXT(&NAVN) DETAILS(*NO) EXITPNL(*NO))
             ELSE       CMD(CPYDOC FROMDOC(&STD) FROMFLR(&MAPPE) +
                          TODOC(&DOKNA) TOFLR(FAXTEMP) REPLACE(*NO))
   /* */
   /* EDITER DOKUMENT */
   /* */
             EDTDOC     DOC(&DOKNA) FLR(FAXTEMP) EXITPNL(*NO)
             ENDPGM
