             PGM        PARM(&BPARM)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(77)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('0000')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('M')
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) +
                          VALUE('manuell')
             DCL        VAR(&PRTCO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(9)

    /* HENTE UTKØ OG DEMS BIBLIOTEK       */
             DCLF       FILE(FAXSEN)
             RCVF       RCDFMT(*FILE)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&FAX) VALUE(%SST(&BPARM 10 21))
             CALL       PGM(FAX017) PARM(&FAX)
             OVRPRTF    FILE(FAX022P) PAGESIZE(72 90) FRONTMGN(0 +
                          0,5) OVRFLW(72) DRAWER(3) OUTQ(QEZJOBLOG)
    /* */
             CHGVAR     VAR(&UNIK) VALUE(%SST(&BPARM 1 9))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&BPARM 31 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&BPARM 39 8))
             CHGVAR     VAR(&KNAVN) VALUE(%SST(&BPARM 47 30))
             CALL       PGM(FAX022) PARM(&UNIK &QNBR &PRTCO)
             SNDFSPL    SPF(FAX022P &QJOB &QUSER &QNBR *LAST) +
                          DESC('MANUELL FAX') DIAL(*N &FAX)
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
    /* */
             ENDPGM
