/* EMAIL SENDING AV 1.SIDES  */
             PGM        PARM(&BPARM)
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10) +
                          VALUE('FAX022P')
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(187)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('0000')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('M')
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) +
                          VALUE('manuell')
             DCL        VAR(&PRTCO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10) +
                          VALUE('FAX022P')
             DCLF       FILE(FAXSEN)
             RCVF       RCDFMT(*FILE)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             OVRPRTF    FILE(FAX022P) DEVTYPE(*SCS) PAGESIZE(66 80) +
                          LPI(6) CPI(10) OVRFLW(60) +
                          OUTQ(QFAX/QFAXOUTQ) FORMTYPE(*STD)

             CHGVAR     VAR(&UNIK) VALUE(%SST(&BPARM 1 9))
             CHGVAR     VAR(&FAX) VALUE(MAIL)
             CHGVAR     VAR(&PTIME) VALUE(%SST(&BPARM 31 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&BPARM 39 8))
             CHGVAR     VAR(&KNAVN) VALUE(%SST(&BPARM 47 30))
             CHGVAR     VAR(&EPOST) VALUE(%SST(&BPARM 77 70))
             CHGVAR     VAR(&EMNE) VALUE(%SST(&BPARM 147 40))
             DLYJOB     DLY(10)
             CALL       PGM(FAX022) PARM(&UNIK &QNBR &PRTCO)
             CALL       PGM(FAX017) PARM(&FAX)

/*                                       */
/* KALLER PROGRAMMET SOM SENDER EPOSTEN  */
/*                                       */
             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &CVP9 &PDF)

/*           CALL       PGM(FAXEPOST) PARM(&QUSER &QNBR &QJOB &PRTNA +
                          &EPOST &EMNE +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &CVP)           */

             CHGVAR     VAR(&FAX) VALUE(MAIL)
             CHGVAR     VAR(&KNAVN) VALUE(&EPOST)

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
    /* */
 SLUTT:      ENDPGM
