             PGM        PARM(&FIRM &AVD &TUR &RUND &DAY &MONT    +
                          &YEAR &TIME &FROM &TO &LENG &NAME +
                          &BILN &FAX &C1 &C2 &C3 &C4 &C5 &C6 +
                          &C7 &C8 &CVP)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(500)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&RUND) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DAY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&MONT) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YEAR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(4)
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(5)
             DCL        VAR(&TO) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LENG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NAME) TYPE(*CHAR) LEN(30)
             DCL        VAR(&BILN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&C1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&C8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
    /* */
             DCLF       FILE(FAXSEN)

             RCVF       RCDFMT(*FILE)
/*                         */
/*  FACSIMILE SUPPORT 400  */
/*                         */
             IF         COND(&FAXSYS = 'F') THEN(DO)
    /* */
             CHGVAR     VAR(&BPARM) VALUE(&FIRM *CAT &AVD *CAT +
                          &TUR *CAT &RUND *CAT &DAY *CAT +
                          &MONT *CAT &YEAR *CAT &TIME *CAT &FROM +
                          *CAT &TO *CAT &LENG *CAT &NAME +
                          *CAT &BILN *CAT &FAX *CAT &C1 *CAT &C2 +
                          *CAT &C3 *CAT &C4 *CAT &C5 +
                          *CAT &C6 *CAT &C7 *CAT &C8 *CAT &CVP)
             SBMJOB     CMD(CALL PGM(FAX035CLJ) PARM(&BPARM)) +
                          JOB(SNDFERJE) JOBD(*USRPRF) +
                          JOBQ(QFAX/QFAXJOBQ)
             ENDDO
/*                         */
/*  BLUEFAX                */
/*                         */
             IF         COND(&FAXSYS = 'B') THEN(DO)
             CHGVAR     VAR(&BPARM) VALUE(&FIRM *CAT &AVD *CAT +
                          &TUR *CAT &RUND *CAT &DAY *CAT +
                          &MONT *CAT &YEAR *CAT &TIME *CAT &FROM +
                          *CAT &TO *CAT &LENG *CAT &NAME +
                          *CAT &BILN *CAT &FAX *CAT &C1 *CAT &C2 +
                          *CAT &C3 *CAT &C4 *CAT &C5 +
                          *CAT &C6 *CAT &C7 *CAT &C8 *CAT &CVP)
             SBMJOB     CMD(CALL PGM(FAX035CLB) PARM(&BPARM)) +
                          JOB(SNDFERJE) JOBD(*USRPRF) +
                          JOBQ(SYJOBQNMAX)
             ENDDO
    /* */
 SLUTT:      ENDPGM
