             PGM        PARM(&FAX &FILEN &PTIME &PDATE &KNAVN &AVD +
                          &OPD &KODE &DONAV)
             DCL        VAR(&UFAX) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) VALUE('00') +
                          /* Antall utskrifter. */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode +
                          til register SORT. */
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12)
    /*                                    */
    /* HENTE UTKØ OG DEMS BIBLIOTEK       */
    /*       DCLF       FILE(FAXSEN)      */
    /*       RCVF       RCDFMT(*FILE)     */
    /*                                    */
    /* SKRIVER UT FAKTURAKOPI             */
             CALL       PGM(FAX017) PARM(&FAX)
             OVRPRTF    FILE(SYFK40PF) PAGESIZE(72 90) CPI(10) +
                          FRONTMGN(0 0,5) OVRFLW(70) DRAWER(2) +
                          OUTQ(QEZJOBLOG)
             OVRPRTF    FILE(SYFA40P2) PAGESIZE(72 90) CPI(10) +
                          FRONTMGN(0 0,5) OVRFLW(57) DRAWER(2) +
                          OUTQ(QEZJOBLOG)
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* */
             CALL       PGM(SYFK40) PARM(&PRANT &UFAX)
    /* */
             SNDFSPL    SPF(SYFK40PF &QJOB &QUSER &QNBR *LAST) +
                          DESC('Fax av kjørekvittering') DIAL(*N &FAX)
    /* */
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
    /* */
 SLUTT:      ENDPGM
