/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SYFA55PF OG SYFA55CP                               */
/* ********************************************************************    */
/* SENDER GODSLISTE VIA BLUFAX */
             PGM        PARM(&BPARM)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(450)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UDSFAX) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&TX) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&BELJN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DADRJN) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PRTNAV) TYPE(*CHAR) LEN(10) +
                          VALUE('GODSLIST')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KUNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNAVN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOKNA12) TYPE(*CHAR) LEN(12)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in07 på, betyr uten oppdatering. */
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &in08 på, betyr prøve manifest. */
             DCL        VAR(&FAKT) TYPE(*CHAR) LEN(1) /* Hvis &FAKT +
                          på, betyr at det skal kjøre faktura */
             DCL        VAR(&JBK) TYPE(*CHAR) LEN(1) /* Jobbkø. */
                                                          /**/
    /* ----------------------------------------------------------- */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&FAXNR) VALUE(%SST(&BPARM 1 21))
             CHGVAR     VAR(&DOKNA12) VALUE(%SST(&BPARM 22 12))
             CHGVAR     VAR(&MAPPE) VALUE(%SST(&BPARM 34 20))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&BPARM 54 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&BPARM 62 8))
             CHGVAR     VAR(&NAVN) VALUE(%SST(&BPARM 70 30))
             CHGVAR     VAR(&AVD) VALUE(%SST(&BPARM 100 4))
             CHGVAR     VAR(&OPD) VALUE(%SST(&BPARM 104 7))
             CHGVAR     VAR(&TUR) VALUE(%SST(&BPARM 111 8))
             CHGVAR     VAR(&KODE) VALUE(%SST(&BPARM 119 1))
             CHGVAR     VAR(&KUNR) VALUE(%SST(&BPARM 120 8))
             CHGVAR     VAR(&CVP1) VALUE(%SST(&BPARM 128 40))
             CHGVAR     VAR(&CVP2) VALUE(%SST(&BPARM 168 40))
             CHGVAR     VAR(&CVP3) VALUE(%SST(&BPARM 208 40))
             CHGVAR     VAR(&CVP4) VALUE(%SST(&BPARM 248 40))
             CHGVAR     VAR(&CVP5) VALUE(%SST(&BPARM 288 40))
             CHGVAR     VAR(&CVP6) VALUE(%SST(&BPARM 328 40))
             CHGVAR     VAR(&CVP7) VALUE(%SST(&BPARM 368 40))
             CHGVAR     VAR(&CVP8) VALUE(%SST(&BPARM 408 40))
             CHGVAR     VAR(&CVP) VALUE(%SST(&BPARM 448 1))
             CHGVAR     VAR(&BELJN) VALUE(%SST(&BPARM 449 1))
             CHGVAR     VAR(&DOKNA12) VALUE(&DOKNAVN)
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)
             CHGVAR     VAR(&DOKNA12) VALUE(&PRTNAV)

    /* SKRIVER UT GODSLISTE  */
/*S01        OVRPRTF    FILE(GODSLIST) DEVTYPE(*SCS) PAGESIZE(72 +
                          117) LPI(6) CPI(15) +
                          OVRFLW(72) OUTQ(FAX/FAXOUT) FORMTYPE(*STD)   */
/*N01*/      OVRPRTF    FILE(SYFA55PF) DEVTYPE(*SCS) PAGESIZE(72 +
                          117) LPI(6) CPI(15) OVRFLW(72) +
                          OUTQ(FAX/FAXOUT) FORMTYPE(*STD)
/*N01*/      OVRPRTF    FILE(SYFA55CP) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(72) PAGRTT(0) +
                          OUTQ(FAX/FAXOUT) FORMTYPE(*STD)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA55) PARM(&AVD &TUR &KUNR &BELJN +
                          &UDSFAX &DADRJN) /*E01*/
    /* ----------------------------------------------------------- */
             CALL       PGM(FAX017) PARM(&FAXNR)


             IF         COND(&CVP = 'J') THEN(FAX/SNDFAXSPLF +
                          FILE(&DOKNA12) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAXNR *N &NAVN)) +
                          CPGPAG(*DFT) CPGTXT(&CVP1 &CVP2 &CVP3 +
                          &CVP4 &CVP5 &CVP6 &CVP7 &CVP8) +
                          OVERLAY(*NONE))
             ELSE       CMD(FAX/SNDFAXSPLF FILE(&DOKNA12) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAXNR *N &NAVN)))

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &DOKNA12 &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
    /* */
                                                          /**/
SLUTT:       ENDPGM
