             PGM        PARM(&OBJ &MAPPE)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DLTDLO     DLO(&OBJ) FLR(&MAPPE)
             MONMSG     MSGID(CPF0000 OFC0000)
             ENDPGM
