             PGM        PARM(&QUSER &QNBR &QJOB &PRTNA &EPOST &EMNE +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 &CVP6 &CVP7 +
                          &CVP8 &CVP)
             DCL        VAR(&RPLNA) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&RPLAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MELD1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&DIST) TYPE(*CHAR) LEN(1) /* DISTLISTE */
             DCL        VAR(&MELD1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD2) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD3) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD4) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD5) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD6) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD) TYPE(*CHAR) LEN(1536)
             DCL        VAR(&DISTL) TYPE(*CHAR) LEN(6) /* DISTLISTE */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(11) /* Unikkode */
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(30)
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO01) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO02) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO03) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO04) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO05) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO06) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO07) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO08) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO09) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO10) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO11) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO12) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO13) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO14) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO15) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO16) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO17) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO18) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO19) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO20) TYPE(*CHAR) LEN(70)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVPX) TYPE(*CHAR) LEN(280)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
 RTVTIME:    RTVJOBA    NBR(&JOBN)
/*                      */
/* HENT REPLYADRESSE    */
/*                      */
/*                      */
             CALL       PGM(EPOS04) PARM(&QUSER &RPLNA &RPLAD &EPOSTF)
/*                      */
/*                      */
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &JOBN *CAT +
                          '.HTM.MBR')
              IF         COND(&CVP2 = ' ') THEN(DO)
              CHGVAR     VAR(&CVP2) VALUE('.')
                         ENDDO
             IF         COND(&CVP3 = '.') THEN(DO)
             CHGVAR     VAR(&CVP3) VALUE(' ')
                        ENDDO
             IF         COND(&CVP4 = '.') THEN(DO)
             CHGVAR     VAR(&CVP4) VALUE(' ')
                        ENDDO
             IF         COND(&CVP5 = '.') THEN(DO)
             CHGVAR     VAR(&CVP5) VALUE(' ')
                        ENDDO
             IF         COND(&CVP6 = '.') THEN(DO)
             CHGVAR     VAR(&CVP6) VALUE(' ')
                        ENDDO
             IF         COND(&CVP7 = '.') THEN(DO)
             CHGVAR     VAR(&CVP7) VALUE(' ')
                        ENDDO
             CHGVAR     VAR(&CVPX) VALUE(&CVP2 *CAT &CVP3 *CAT &CVP4 +
                          *CAT &CVP5 *CAT &CVP6 *CAT &CVP7)
             CHGVAR     VAR(&DIST) VALUE(%SST(&EPOST 1 1))
             CHGVAR     VAR(&DISTL) VALUE(%SST(&EPOST 2 6))
/*                      */
/* EMNE KAN IKKE V∆RE   */
/* BLANK                */
/*                      */
             IF         COND(&CVP = 'J') THEN(DO)
                        CHGVAR VAR(&EMNE) VALUE(&CVP1)
                        ENDDO

             IF         COND(&EMNE = +
                          '                                        +
                          ') THEN(CHGVAR VAR(&EMNE) VALUE('EMAIL from +
                          &user'))
/*                      */
/* SPESIAL VED MANUELL  */
/*                      */
             IF         COND(&QJOB = 'FAXMANUELL') THEN(DO)
             CALL       PGM(FAXMAN) PARM(&QNBR &MELD1 &MELD2 &MELD3 +
                          &MELD4 &MELD5 &MELD6)
             CHGVAR     VAR(&MELD) VALUE(&MELD1 *CAT &MELD2 *CAT +
                          &MELD3 *CAT &MELD4 *CAT &MELD5 *CAT &MELD6)
/*                                     */
/*  SENDING VED DISTRIBUSJONSLISTE     */
/*                                     */
             IF         COND(&DIST = '*') THEN(DO)
             CALL       PGM(EPODIS) PARM(&DISTL &EPO01 &EPO02 &EPO03 +
                          &EPO04 &EPO05 &EPO06 &EPO07 &EPO08 &EPO09 +
                          &EPO10 &EPO11 &EPO12 &EPO13 &EPO14 &EPO15 +
                          &EPO16 &EPO17 &EPO18 &EPO19 &EPO20)
/*                                     */
/*  IKKE REPLYTO ANDRE                 */
/*                                     */
             IF         COND(&RPLNA = '*CURRENT') THEN(DO)
             SNDDST     TYPE(*LMSG) TOINTNET((&EPO01) (&EPO02) +
                          (&EPO03) (&EPO04) (&EPO05) (&EPO06) +
                          (&EPO07) (&EPO08) (&EPO09) (&EPO10) +
                          (&EPO11) (&EPO12) (&EPO13) (&EPO14) +
                          (&EPO15) (&EPO16) (&EPO17) (&EPO18) +
                          (&EPO19) (&EPO20)) DSTD(&EMNE) +
                          LONGMSG(&MELD) +
                          SNDFMT(*NOCHG)
             GOTO       CMDLBL(VIDERE)
             ENDDO
/*                                     */
/*  VED REPLYTO                        */
/*                                     */
             SNDDST     TYPE(*LMSG) TOINTNET((&EPO01) (&EPO02) +
                          (&EPO03) (&EPO04) (&EPO05) (&EPO06) +
                          (&EPO07) (&EPO08) (&EPO09) (&EPO10) +
                          (&EPO11) (&EPO12) (&EPO13) (&EPO14) +
                          (&EPO15) (&EPO16) (&EPO17) (&EPO18) +
                          (&EPO19) (&EPO20)) DSTD(&EMNE) +
                          LONGMSG(&MELD) USRID(&RPLNA &RPLAD) +
                          SNDFMT(*NOCHG)
             GOTO       CMDLBL(VIDERE)
             ENDDO
/*                                     */
/*  IKKE REPLYTO ANDRE                 */
/*                                     */
             IF         COND(&RPLNA = '*CURRENT') THEN(DO)
             SNDDST     TYPE(*LMSG) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          LONGMSG(&MELD) +
                          SNDFMT(*NOCHG)
             GOTO       CMDLBL(VIDERE)
             ENDDO
             SNDDST     TYPE(*LMSG) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          LONGMSG(&MELD) USRID(&RPLNA &RPLAD) +
                          SNDFMT(*NOCHG)
             GOTO       CMDLBL(VIDERE)
             ENDDO
/* LAG SNDDST I QTEMP   */
/*                      */
             DLTF       FILE(QTEMP/SNDDST)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(EPOST80) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SNDDST)
             DLTF       FILE(QTEMP/SNDDST2)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(QTEMP/SNDDST2) RCDLEN(80)
/*                      */
/* LEGGER P≈ HTML START */
/*                      */
             CALL       PGM(FAXEHTM)
/*                      */
/*                      */
/* KOPIERER PRINT       */
/*                      */
             CPYSPLF    FILE(&PRTNA) TOFILE(QTEMP/SNDDST) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*ADD) CTLCHAR(*NONE)
             IF         COND(&PRTNA = 'SYFA27PF') THEN(DO)
             CPYSPLF    FILE(SYFA27PS) TOFILE(QTEMP/SNDDST) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*ADD) CTLCHAR(*NONE)
                          ENDDO
/*                      */
/* LEGGER P≈ HTML SLUTT */
/*                      */
             CALL       PGM(FAXEHTME)
/* - CPYTOSTMF I STEDET FOR CPYTOPCD (PGA BEDRE MHT.CVT AV ∆ÿ≈ M.M)*/
/* - MEN LEGGER IKKE UTDATA I IFS, MEN I MAPPE I QDLS              */
/* - DETTE FOR ≈ F≈ LOV ≈ BENYTTE KOMMANDO SNDDST TYPE(*DOC)....   */
             CHGVAR     VAR(&TIL) VALUE('/QDLS/SYMAIL/' *CAT &UNIK)
             CPYF       FROMFILE(SNDDST) TOFILE(QTEMP/SNDDST2) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             CPYTOSTMF  +
                          FROMMBR('/QSYS.LIB/QTEMP.LIB/SNDDST2.FILE/S+
                          NDDST2.MBR') TOSTMF(&TIL) +
                          STMFOPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          /*N01*/

             CHGDOCD    DOC(&UNIK) FLR(SYMAIL) DOCD(&EMNE) +
                          USRAUT((*PUBLIC *ALL))
/*                                     */
/*  SENDING VED DISTRIBUSJONSLISTE     */
/*                                     */
             IF         COND(&DIST = '*') THEN(DO)
             CALL       PGM(EPODIS) PARM(&DISTL &EPO01 &EPO02 &EPO03 +
                          &EPO04 &EPO05 &EPO06 &EPO07 &EPO08 &EPO09 +
                          &EPO10 &EPO11 &EPO12 &EPO13 &EPO14 &EPO15 +
                          &EPO16 &EPO17 &EPO18 &EPO19 &EPO20)
/*                                     */
/*  IKKE REPLYTO ANDRE                 */
/*                                     */
             IF         COND(&RPLNA = '*CURRENT') THEN(DO)
             SNDDST     TYPE(*DOC) TOINTNET((&EPO01) (&EPO02) +
                          (&EPO03) (&EPO04) (&EPO05) (&EPO06) +
                          (&EPO07) (&EPO08) (&EPO09) (&EPO10) +
                          (&EPO11) (&EPO12) (&EPO13) (&EPO14) +
                          (&EPO15) (&EPO16) (&EPO17) (&EPO18) +
                          (&EPO19) (&EPO20) (&EPO03)) DSTD(&EMNE) +
                          MSG(&CVPX) +
                          SNDFMT(*NOCHG) DOC(&UNIK) FLR(SYMAIL) +
                          DOCD(&EMNE)
             GOTO       CMDLBL(VIDERE)
             ENDDO
             SNDDST     TYPE(*DOC) TOINTNET((&EPO01) (&EPO02) +
                          (&EPO03) (&EPO04) (&EPO05) (&EPO06) +
                          (&EPO07) (&EPO08) (&EPO09) (&EPO10) +
                          (&EPO11) (&EPO12) (&EPO13) (&EPO14) +
                          (&EPO15) (&EPO16) (&EPO17) (&EPO18) +
                          (&EPO19) (&EPO20) (&EPO03)) DSTD(&EMNE) +
                          MSG(&CVPX) USRID(&RPLNA &RPLAD) +
                          SNDFMT(*NOCHG) DOC(&UNIK) FLR(SYMAIL) +
                          DOCD(&EMNE)
             GOTO       CMDLBL(VIDERE)
             ENDDO
/*                                     */
/*  IKKE REPLYTO ANDRE                 */
/*                                     */
             IF         COND(&RPLNA = '*CURRENT') THEN(DO)
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          MSG(&CVPX) +
                          SNDFMT(*NOCHG) DOC(&UNIK) FLR(SYMAIL) +
                          DOCD(&EMNE)
             GOTO       CMDLBL(VIDERE)
             ENDDO
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          MSG(&CVPX) USRID(&RPLNA &RPLAD) +
                          SNDFMT(*NOCHG) DOC(&UNIK) FLR(SYMAIL) +
                          DOCD(&EMNE)
/*                      */
/* SLETTER SPOOLFILE    */
/*                      */
VIDERE:      DLTSPLF    FILE(&PRTNA) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDPGM
