             PGM        PARM(&USERID &ADDRESS &USRPRF)
             DCL        VAR(&USERID) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ADDRESS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&USRPRF) TYPE(*CHAR) LEN(10)
             DCLF       FILE(QAOSDIRO)
/* THIS PROGRAM WILL GET THE USER PROFILE THAT IS ASSOCIATED WITH A           */
/* USER ID AND ADRESS.  THIS IS CALLED BY THE BACKGROUND JOB.  A              */
/* DISTRIBUTION WILL ARRIVE FOR AN INDIRECT USER AND WE ARE GIVEN             */
/* THE USER ID AND ADRESS.  WE HAVE TO DETERMINE THE USER PROFILE             */
/* NAME BECAUSE OUR FILE OF FAX USERS IS KEYED BY PROFILE AND WE              */
/* WILL NEED THE USER PROFILE NAME TO GET THE PRINTER NAME IF THE             */
/* USER IS NOT A FAX USER.                                                    */
             OVRDBF FILE(QAOSDIRO) TOFILE(QTEMP/TEMP)
             DLTF   FILE(QTEMP/TEMP)
             MONMSG MSGID(CPF2105) EXEC(RCVMSG MSGTYPE(*LAST))
             DSPDIRE USRID(&USERID &ADDRESS) OUTPUT(*OUTFILE) +
                      OUTFILE(QTEMP/TEMP)
             RCVF
             CHGVAR VAR(&USRPRF) VALUE(&WOSDUSRP)
             RETURN
