/*   FAKTURAKOPI TIL BATCH   */
             PGM        PARM(&AVD &FANR)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&FANR) TYPE(*CHAR) LEN(7)
             CALL PGM(FAX007CL) PARM(&AVD &FANR)
             ENDPGM
