             PGM        PARM(&OBJ &MAPPE &FINS)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(&FINS) VALUE('J')
             RGZDLO     DLO(&OBJ) FLR(&MAPPE)
             MONMSG     MSGID(CPF8AB2) EXEC(CHGVAR +
                          VAR(&FINS) VALUE('N'))
             MONMSG     MSGID(CPF8AB1)
             ENDPGM
