             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             CALL       PGM(INLIBL)
             RTVJOBA    USER(&USER)
             IF         COND(&USER *EQ QSECOFR) THEN(GOTO OK)
             IF         COND(&USER *EQ FAXSEC) THEN(GOTO OK)
             GOTO       CMDLBL(FEIL)

 OK:         SBMJOB     CMD(CALL PGM(FAXOVMO2)) JOB(MONITOROV) +
                          JOBQ(SYJOBQNMAX) LOG(4 00 *SECLVL) +
                          LOGCLPGM(*YES)
                          RETURN
 FEIL:       SNDPGMMSG  MSG('Du må være Qsecofr for å starte denne +
                          funksjon')
                          ENDPGM
