/* INNFØRT BLUFAX */
             PGM        PARM(&BPARM)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(85)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('0000')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('M')
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) +
                          VALUE('manuell')
             DCL        VAR(&PRTCO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSERS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(9)
             DCLF       FILE(FAXSEN)
             RCVF       RCDFMT(*FILE)

             RTVJOBA    JOB(&QJOB) USER(&QUSERS) NBR(&QNBR)


             OVRPRTF    FILE(FAX022P) DEVTYPE(*SCS) PAGESIZE(66 90) +
                          LPI(6) CPI(10) OUTQ(QFAX/QFAXOUTQ) +
                          FORMTYPE(*STD)

             CHGVAR     VAR(&UNIK) VALUE(%SST(&BPARM 1 9))
             CHGVAR     VAR(&FAX) VALUE(%SST(&BPARM 10 21))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&BPARM 39 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&BPARM 31 8))
             CHGVAR     VAR(&KNAVN) VALUE(%SST(&BPARM 47 30))
             CHGVAR     VAR(&QUSER) VALUE(%SST(&BPARM 77 8))
             DLYJOB     DLY(10)
             CALL       PGM(FAX022) PARM(&UNIK &QNBR &PRTCO)
             CALL       PGM(FAX017) PARM(&FAX)


             /* IF FAXSYS = B BLUFAX */
             FAX/SNDFAXSPLF FILE(FAX022P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAX *N &KNAVN))

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)

 SLUTT:      ENDPGM
