             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             RTVJOBA    USER(&USER)
             IF         COND(&USER *EQ QSECOFR) THEN(GOTO OK)
             GOTO       CMDLBL(FEIL)
 OK:         CALL       PGM(FAX018)
             SNDPGMMSG  MSG('Jobben er sendt til jobbkø.')
             GOTO       CMDLBL(SLUTT)
 FEIL:       SNDPGMMSG  MSG('Du må være QSECOFR for å starte denne +
                          rutinen.')
 SLUTT:      ENDPGM
