             PGM
             DCL        VAR(&L4) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&L5) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCLF       FILE(FAXSEN)

             RCVF       RCDFMT(*FILE)
             IF         COND(&FAXSYS = 'B') THEN(DO)

             RETURN
             ENDDO
             RTVJOBA    USER(&USER)
             ADDLIBLE   LIB(SALG400)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&L4) VALUE('N'))
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */

             CALL       PGM(FAXSOK) PARM(&USER)
             IF         COND(&L4 = 'J') THEN(RMVLIBLE LIB(SALG400))
SLUTT:       ENDPGM
