             PGM        PARM(&TUR)
             DCL        VAR(&TUR) TYPE(*DEC) LEN(8 0)

             CALL       PGM(SYTR17C) PARM(&TUR)

             ENDPGM
