             PGM        PARM(&UPDAT &DELNY &PRINTER)
             DCL        VAR(&UPDAT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DELNY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRINTER) TYPE(*CHAR) LEN(10)

             DLTF       FILE(QTEMP/LRESLALL)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(QTEMP/LRESLALL) SRCFILE(SYSPEDS/QDDSSRC)
             OVRPRTF LISTE OUTQ(&PRINTER)

             CALL FIXLEV0 PARM(&UPDAT &DELNY)

             ENDPGM
