             PGM        PARM(&LIBFRA &LIBTIL &AVDFRA &AVDTIL &OPDFRA +
                          &OPDTIL &SIGN)
             DCL        VAR(&LIBFRA) TYPE(*CHAR) LEN(10) /* 'Fra +
                          filbibliotek' */
             DCL        VAR(&LIBTIL) TYPE(*CHAR) LEN(10) /* 'Til +
                          filbibliotek' */
             DCL        VAR(&AVDFRA) TYPE(*CHAR) LEN(4)  /* 'Fra +
                          avdeling')    */
             DCL        VAR(&AVDTIL) TYPE(*CHAR) LEN(4)  /* 'Til +
                          avdeling')    */
             DCL        VAR(&OPDFRA) TYPE(*CHAR) LEN(7)  /* 'Fra +
                          oppdrag')     */
             DCL        VAR(&OPDTIL) TYPE(*CHAR) LEN(7)  /* 'Til +
                          oppdrag')     */
             DCL        VAR(&SIGN) TYPE(*CHAR) LEN(3) /* Signatur */

             MONMSG     MSGID(CPF0000)

             OVRDBF     FILE(DKEH) TOFILE(&LIBFRA/DKEH)
             OVRDBF     FILE(DKEV) TOFILE(&LIBFRA/DKEV)
             OVRDBF     FILE(SADH) TOFILE(&LIBTIL/SADH)
             OVRDBF     FILE(SADV) TOFILE(&LIBTIL/SADV)
             OVRDBF     FILE(STANDI) TOFILE(&LIBTIL/STANDI)

             CALL       PGM(FORT01R) PARM(&AVDFRA &AVDTIL &OPDFRA +
                          &OPDTIL &SIGN)

             DLTOVR     FILE(DKEH)
             DLTOVR     FILE(DKEV)
             DLTOVR     FILE(SADH)
             DLTOVR     FILE(SADV)
             DLTOVR     FILE(STANDI)

ENDPGM
