             PGM        PARM(&FIFIRM &FILIBF)
            /*_______________*/
            /* DEKLARERE FIL */
            /*"""""""""""""""*/
             DCLF       FILE(FIRM)
            /*_________________________________*/
            /* HENT RIKTIG RECORD I FIRMAFILEN */
            /*"""""""""""""""""""""""""""""""""*/
             RCVF       RCDFMT(FIRMR)
             MONMSG     MSGID(CPF0000)
             ENDPGM
