             PGM   PARM(&SRV &USR &FAK &FALNK &FSLNK &FXLNK)
             DCL        VAR(&SRV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FAK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FALNK) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FSLNK) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FXLNK) TYPE(*CHAR) LEN(40)

             ADDLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(GETFALNK) PARM(&SRV &USR &FAK &FALNK &FSLNK &FXLNK)

             RMVLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)
             ENDPGM
