             PGM
/*HTTP://10.13.3.22/SYCGIP/WSFALNK.PGM?USER=SVEIN&FAKT=0284191*/
             DCL        VAR(&SRV) TYPE(*CHAR) LEN(30) +
                          VALUE('gw.systema.no')
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10) VALUE('SVEIN')
             DCL        VAR(&FAK) TYPE(*CHAR) LEN(7) VALUE('0284191')
             DCL        VAR(&FALNK) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FSLNK) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FXLNK) TYPE(*CHAR) LEN(40)

             ADDLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(GETFALNK) PARM(&SRV &USR &FAK &FALNK &FSLNK &FXLNK)

             RMVLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)
             ENDPGM
