             PGM        PARM(&BPARM)
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(398)
             DCL        VAR(&ORNR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12) +
                          VALUE('GSS043P')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
/*                                                              */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                                                              */
             CHGVAR     VAR(&ORNR) VALUE(%SST(&BPARM 1 7))
             CHGVAR     VAR(&EPOST) VALUE(%SST(&BPARM 8 70))
             CHGVAR     VAR(&EMNE) VALUE(%SST(&BPARM  78 40))
             CHGVAR     VAR(&CVP2) VALUE(%SST(&BPARM 118 40))
             CHGVAR     VAR(&CVP3) VALUE(%SST(&BPARM 158 40))
             CHGVAR     VAR(&CVP4) VALUE(%SST(&BPARM 198 40))
             CHGVAR     VAR(&CVP5) VALUE(%SST(&BPARM 238 40))
             CHGVAR     VAR(&CVP6) VALUE(%SST(&BPARM 278 40))
             CHGVAR     VAR(&CVP7) VALUE(%SST(&BPARM 318 40))
             CHGVAR     VAR(&CVP8) VALUE(%SST(&BPARM 358 40))
             OVRPRTF    FILE(GSS043P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(15) OVRFLW(70) OUTQ(OUTMAIL)
             CALL       PGM(GSS043R) PARM(&ORNR)
/*                                       */
/* KALLER PROGRAMMET SOM SENDER EPOSTEN  */
/*                                       */
             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB &DONAV +
                          &EPOST &EMNE &CVP1 &CVP2 &CVP3 &CVP4 +
                          &CVP5 &CVP6 &CVP7 &CVP8 &PDF)
             CHGVAR     VAR(&FAX) VALUE(MAIL)
             CHGVAR     VAR(&KNAVN) VALUE(&EPOST)
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)
             DSPJOBLOG  OUTPUT(*PRINT)
             ENDPGM
