             PGM        PARM(&TNO &TYPE)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TNO) TYPE(*CHAR) LEN(11)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             RMVM       FILE(GSS022W) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ADDPFM     FILE(GSS022W) MBR(&UNIK)
             OVRDBF     FILE(GSS022W) TOFILE(GSS022W) MBR(&UNIK)
             CHGVAR     VAR(&UTFAX) VALUE('J')
             CALL       PGM(GSS022R) PARM(&TNO &TYPE &PRT &CPY +
                          &UTFAX &QJOB &QUSER &QNBR)
             RMVM       FILE(GSS022W) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ENDPGM
