             PGM
             DCL        VAR(&USRCLS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(0)
             DCL        VAR(&CG) TYPE(*CHAR) LEN(2)
             RTVUSRPRF  USRCLS(&USRCLS)
             CALL       PGM(GSS002R) PARM(&FLAGG &CG)
             ENDPGM
