             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             CLRPFM     FILE(QTEMP/GSS026WF)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(GSS026WF) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             ENDPGM
