             PGM
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             RTVJOBA    USER(&USR)
             CALL       PGM(GSS072R) PARM(&USR)
             ENDPGM
