/* INNFØRT BLUFAX */
             PGM        PARM(&KNAVN &FAX &UNIK &PTIME &PDATE &PRTFIL +
                          &DONAV &COVP &COVP1 &COVP2 &COVP3 &COVP4 +
                          &COVP5 &COVP6 &COVP7 &COVP8)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(77)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) VALUE('0000')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('M')
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DONAV) TYPE(*CHAR) LEN(12)
             DCL        VAR(&PRTCO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(21)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&PRTFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&COVP) TYPE(*CHAR) LEN(1)
              DCL        VAR(&COVP1) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP2) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP3) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP4) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP5) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP6) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP7) TYPE(*CHAR) LEN(40)
              DCL        VAR(&COVP8) TYPE(*CHAR) LEN(40)

              RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

              /* IF FAXSYS = B BLUFAX */
              IF         COND(&COVP = 'J') THEN(FAX/SNDFAXSPLF +
                           FILE(&PRTFIL) JOB(&QNBR/&QUSER/&QJOB) +
                           SPLNBR(*LAST) RCP((&FAX *N &KNAVN)) +
                           CPGPAG(*DFT) CPGTXT(&COVP1 &COVP2 &COVP3 +
                          &COVP4 &COVP5 &COVP6 &COVP7 &COVP8))
             ELSE       CMD(FAX/SNDFAXSPLF FILE(&PRTFIL) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAX *N &KNAVN)))

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAX &DONAV &MAPPE &PTIME &PDATE &KNAVN +
                          &AVD &OPD &TUR &KODE)

 SLUTT:      ENDPGM
