             PGM
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&USRPRF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&USLUTT) TYPE(*CHAR) LEN(1) VALUE('N')
             RTVUSRPRF  RTNUSRPRF(&USRPRF)
             CHGDTAARA  DTAARA(*LDA (101 10)) VALUE(&USRPRF)
             CHGDTAARA  DTAARA(*LDA (501 500)) VALUE(*BLANKS)
START:       CALL       PGM(GSS015R) PARM(&QJOB &QUSER &QNBR &UTFAX +
                          &USLUTT)
             IF         COND(&UTFAX = 'J') THEN(SBMJOB CMD(CALL +
                          PGM(GSS015C1)) JOB(FAXSTOCKR) +
                          JOBQ(SYJOBQNMAX))
             IF         COND(&USLUTT = 'N') THEN(DO)
             CHGVAR     VAR(&UTFAX) VALUE('N')
             GOTO       CMDLBL(START)
             ENDDO
             RCLRSC
             ENDPGM
