             PGM
             DCL        VAR(&USRCLS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             RTVUSRPRF  USRCLS(&USRCLS) PRTDEV(&PRT)
             CALL       PGM(GSS001R) PARM(&PRT)
             ENDPGM
