/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 OVERSTYRE HEADFP, DOKEFP OG DOKOTHP                */
/* ********************************************************************    */
             PGM        PARM(&UONO &UTNO)
             DCL        VAR(&UONO) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&UTNO) TYPE(*DEC) LEN(9 0)
    /* */
          /*________________________*/
          /* Overstyr til WRK-filer */
          /*""""""""""""""""""""""""*/
             OVRDBF     FILE(HEADF) TOFILE(SIDUPA)
/*N01*/      OVRDBF     FILE(HEADFP) TOFILE(HEADF)
             OVRDBF     FILE(FAKT) TOFILE(SIDUPB)
             OVRDBF     FILE(FAK2) TOFILE(SIDUPB2)
             OVRDBF     FILE(FAK4) TOFILE(SIDUPB4)
             OVRDBF     FILE(TELL) TOFILE(SIDUPC)
/*N01*/      OVRDBF     FILE(DOKEFP) TOFILE(DOKEF)
/*N01*/      OVRDBF     FILE(DOKOTHP) TOFILE(DOKOTH)
/*                         */
/*  KALLE INVOCE           */
/*                         */
             CALL       PGM(GSS049R) PARM(&UONO &UTNO)

          /*____________________*/
          /* Slette overstyring */
          /*""""""""""""""""""""*/
             DLTOVR     FILE(HEADF)
/*N01*/      DLTOVR     FILE(HEADFP)
             DLTOVR     FILE(FAKT)
             DLTOVR     FILE(FAK2)
             DLTOVR     FILE(FAK4)
             DLTOVR     FILE(TELL)
/*N33*/      DLTOVR     FILE(DOKEFP)
/*N33*/      DLTOVR     FILE(DOKOTHP)
    /* */
             ENDPGM
