             PGM        PARM(&TNO)
             DCL        VAR(&TNO) TYPE(*CHAR) LEN(11)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&MOD) TYPE(*CHAR) LEN(1) VALUE('5')
             DCL        VAR(&SORT) TYPE(*CHAR) LEN(1) VALUE('F')

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&UTFAX) VALUE('J')
             CALL       PGM(GSS026R) PARM(&TNO &PRT &PRT2 &SORT +
                          &UTFAX &MOD &QJOB &QUSER &QNBR &QUSER)
             ENDPGM
