             PGM
             DCL        VAR(&USRPRF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)

             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             RTVUSRPRF  RTNUSRPRF(&USRPRF)
             CHGDTAARA  DTAARA(*LDA (101 10)) VALUE(&USRPRF)
             CALL       PGM(GSS020R)
             RCLRSC
             ENDDO

             ENDPGM
