/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10027 * 01 YBC PTF10 ORDRETYPE                                          */
/* ********************************************************************    */
/*S01        PGM        PARM(&TNO &TYPE)      */
/*N01*/      PGM        PARM(&TNO &TYPE &ORDTYP)
             DCL        VAR(&TNO) TYPE(*CHAR) LEN(11)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
/*N01*/      DCL        VAR(&ORDTYP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)


             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             RMVM       FILE(GSS031W) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ADDPFM     FILE(GSS031W) MBR(&UNIK)
             OVRDBF     FILE(GSS031W) TOFILE(GSS031W) MBR(&QJOB)
             CHGVAR     VAR(&UTFAX) VALUE('J')
/*S01        CALL       PGM(GSS033R) PARM(&TNO &TYPE &PRT &CPY +   */
/*S01                     &UTFAX &QJOB &QUSER &QNBR)               */
/*N01*/      CALL       PGM(GSS033R) PARM(&TNO &TYPE &PRT &ORDTYP +
                          &CPY &UTFAX &QJOB &QUSER &QNBR)
             RMVM       FILE(GSS031W) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ENDPGM
