             PGM
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CALL       PGM(GSS016R) PARM(&QJOB &QUSER &QNBR)
             ENDPGM
