             PGM
             DCL        VAR(&UTUR) TYPE(*DEC) LEN(9 0) VALUE(292990)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) VALUE(QPRINT)
    /* */
             CALL       PGM(GSS076A) PARM(&PRT)
             OVRPRTF    FILE(GSS076P) PAGESIZE(48 192) CPI(15) +
                          OVRFLW(42) PAGRTT(90) OUTQ(&PRT)
/*                         */
/*  KALLE PRINT            */
/*                         */
             CALL       PGM(GSS076R) PARM(&UTUR)

    /* */
             ENDPGM
