             PGM
             DCL        VAR(&PLUKK) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&DATA) TYPE(*CHAR) LEN(218)
             CALL       PGM(SYHU10) PARM(&PLUKK &DATA)
             ENDPGM
