             PGM        PARM(&LIB &FLAGG)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FLAGG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&TILLIB)
             IF         COND(&LIB *EQ &TILLIB) THEN(DO)
/* INNTASTET BIBLIOTEK KAN IKKE VÆRE EGET DRIFTSBIBLIOTEK */
/*S01        CHGVAR     VAR(&FLAGG) VALUE('1') */
/*N01*/      CHGVAR     VAR(&FLAGG) VALUE('2')
             GOTO       CMDLBL(SLUTT)
             ENDDO

             RTVDTAARA  DTAARA(&LIB/FIRMDT (141 10)) RTNVAR(&TILLIB)
             MONMSG     MSGID(CPF0001 CPF1021) EXEC(DO)
/* INNTASTET BIBLIOTEK FINNES IKKE */
             CHGVAR     VAR(&FLAGG) VALUE('1')
             GOTO       CMDLBL(SLUTT)
             ENDDO

 SLUTT:      ENDPGM
