             PGM        PARM(&AVD &PRO &KNA &LIB &PGM &BRUDD)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KNA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BRUDD) TYPE(*CHAR) LEN(1)

             OVRDBF     FILE(ZEADL02) TOFILE(&LIB/ZEADL02)
             OVRDBF     FILE(ZREETXT1) TOFILE(&LIB/ZREETXT1)
             OVRDBF     FILE(ZTELL) TOFILE(&LIB/ZTELL)
             OVRDBF     FILE(FIRM) TOFILE(&LIB/FIRM)
             OVRDBF     FILE(KUNKO2) TOFILE(&LIB/KUNKO2)
             CALL       PGM(IE010R) PARM(&AVD &PRO &KNA &PGM &BRUDD)

             ENDPGM
