/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 TELLERREGISTER SKAL OGSÅ OVERSTYRES                */
/* ********************************************************************    */
             PGM        PARM(&AVD &OPD)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARMX) TYPE(*CHAR) LEN(256)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
 /* VALGBILDE */
             CALL       PGM(IE011R) PARM(&AVD &OPD &LIB &PARMX &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))

/*N01*/      OVRDBF     FILE(ZTELL) TOFILE(&LIB/ZTELL)
             OVRDBF     FILE(ZEADL02) TOFILE(&LIB/ZEADL02)
             OVRDBF     FILE(ZREETXT1) TOFILE(&LIB/ZREETXT1)
             OVRDBF     FILE(KUNKO2) TOFILE(&LIB/KUNKO2)
             CALL       PGM(IE012R) PARM(&AVD &OPD &PARMX)
             DLTOVR     FILE(ZEADL02)
             DLTOVR     FILE(ZREETXT1)
             DLTOVR     FILE(KUNKO2)


 SLUTT:      ENDPGM
