             PGM        PARM(&OBJ)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE(QPSYCDAU)
/*  TØMMER WORKFIL    */
             CLRPFM     FILE(QTEMP/XIFSAUT)
/*  PRINTER AUTOR    */
             DSPAUT     OBJ(&OBJ) OUTPUT(*PRINT)
/*  KOPIERER TIL FIL */
             CPYSPLF    FILE(&SPLF) TOFILE(QTEMP/XIFSAUT) SPLNBR(*LAST)
             DLTSPLF    FILE(&SPLF) SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDPGM
