             PGM
 /*****************************************************************************/
 /* GÅR GJENNOM IFSMAPPE OG SETTER EIER TIL SY400USR OG PUBLIC KAN            */
 /* GJØRE ALT MED DOKUMENTET ALLE ANDRE SLETTES                               */
 /*****************************************************************************/

             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100)
             DCLF       FILE(ARKEXT) RCDFMT(*ALL)

             CRTPF      FILE(QTEMP/XIFSAUT) RCDLEN(132) SIZE(50000000)
             MONMSG     MSGID(CPF0000)
 READ:       RCVF       RCDFMT(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(EXIT))

             CHGVAR     VAR(&DIR) VALUE(&ARCANE)

             CALL       PGM(IFSAUTR) PARM(&DIR)
             GOTO       CMDLBL(READ)
EXIT:        ENDPGM
