             PGM

             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             ENDSBS SY400SBS *IMMED
             DLYJOB     DLY(180)

             DLTF       FILE(TARIL02.G)
             MONMSG CPF0000
             DLTF       FILE(TARI.G)
             MONMSG CPF0000

             DLTF       FILE(TARIL02)
             RNMOBJ     OBJ(TARI) OBJTYPE(*FILE) NEWOBJ(TARI.G)

             RNMOBJ     OBJ(TARI.N) OBJTYPE(*FILE) NEWOBJ(TARI)
             RTVOBJD    OBJ(TARI) OBJTYPE(*FILE) RTNLIB(&LIB)
             CRTLF      FILE(&LIB/TARIL02) SRCFILE(QDDS96) +
                          LVLCHK(*NO) AUT(*ALL)

             ENDPGM
