             PGM
             DCL        VAR(&IN01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCLF       FILE(QGPL/INZ)
             RTVJOBA    JOB(&JOB)
 START:      INZTAP     DEV(TAP02) NEWVOL(SYSTEM) NEWOWNID(SYSTEM) +
                          CHECK(*NO) CLEAR(*YES)
             SNDRCVF    DEV(&JOB)
             IF         COND(&IN01 = Y) THEN(GOTO CMDLBL(START))
             ENDPGM
