/* UDSPOS FOR MEMBERNAVN RETTET I L1 V2.4 FRA 342 TIL 441 */
/*SYSTEMA   START*/
/* TOTALT FORANDRET FRA KC087B */
/* FLYTT TIL IBMEND E.L. ENDRE/AKTIVERE   FROM/TO - KOMPILER */
/* VED NIT-LU0(SNUF) SKAL DET IKKE!!! LEGGES FMS-RECORD!!!!  */
/* PÅ EDIPARTEN SKAL DET DERIMOT LEGGES INN F.EKS NODNB101 I ACCOUNT*/
/*SYSTEMA  SLUTT*/
             PGM
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10) VALUE('TELNF')
             DCL        VAR(&MBRTXT) TYPE(*CHAR) LEN(50) VALUE('DNB +
                          Telebank utbetaling')
/*SYSTEMA    DCL        VAR(&FROM) TYPE(*CHAR) LEN(35) +
                          VALUE('NO005405')         OBS!!!!!!!! */
/*SYSTEMA    DCL        VAR(&TO) TYPE(*CHAR) LEN(35) +
                          VALUE('NODNB101')         OBS!!!!!!!! */
             DCL        VAR(&FMS1) TYPE(*CHAR) LEN(80)
/*HVIS IBM IN LU0 - SKAL &TO VÆRE DEFINERT I INTERCH.FIL MED......   */
/*NIT'S ACCOUNT/USERID... ACC: NO411618   USERID: NIT003             */
/*VED IBM IN LU0 OG VED NIT RJE... SKAL NIT HA INFO VIA &FMS1        */
/*FMS NIT:   1-5=FMS01 6-13=NODI FRA  18-25=NODI TIL */
/*FMS NIT:   DCL        VAR(&FMS1) TYPE(*CHAR) LEN(80) +
                          VALUE('FMS01NO005405    NODNB101')         */
             DCL        VAR(&FMS2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&WMEMBN) TYPE(*CHAR) LEN(8)
             CHGVAR     VAR(&WMEMBN) VALUE(%SST(*LDA 441 8))
             OVRDBF     FILE(TELNF) TOFILE(TELNF) MBR(&WMEMBN)
             /*________________________*/
             /* Tilføy Biblioteksliste */
             /*""""""""""""""""""""""""*/
             ADDLIBLE   LIB(SYSPED)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(SYSPEDF)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(SYENDPTF)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(SYENDRE)
             MONMSG     MSGID(CPF0000)
             /*_______________________________________________*/
             /* Overfør flatfil (legg ut logg i EDIS+         */
             /* Legg ut loggpost(EDIS) + Member (EDISE)       */
             /* "EDI-systemet" finner nettverk/type utfra part*/
             /*"""""""""""""""""""""""""""""""""""""""""""""""*/
             CALL       PGM(EGF03C) PARM(&FILE &MBRTXT &FROM &TO +
                          &FMS1 &FMS2)
             /*________________________*/
             /* Fjerne Biblioteksliste */
             /*""""""""""""""""""""""""*/
             RMVLIBLE   LIB(SYSPED)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(SYSPEDF)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(SYENDPTF)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(SYENDRE)
             MONMSG     MSGID(CPF0000)

             ENDPGM
