             PGM        PARM(&FRALIB) /* &tillib */
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             CPYF       FROMFILE(&FRALIB/BACKKSA) +
                          TOFILE(&TILLIB/BACKKSA) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/BACKKSB) +
                          TOFILE(&TILLIB/BACKKSB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/BACKUPA) +
                          TOFILE(&TILLIB/BACKUPA) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             CPYF       FROMFILE(&FRALIB/BACKUPB) +
                          TOFILE(&TILLIB/BACKUPB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/DOKUI) +
                          TOFILE(&TILLIB/DOKUI) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/FHEADF) +
                          TOFILE(&TILLIB/FHEADF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/FORDEL) +
                          TOFILE(&TILLIB/FORDEL) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/FRTAB) +
                          TOFILE(&TILLIB/FRTAB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/GSSGDF) +
                          TOFILE(&TILLIB/GSSGDF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/GSSTRF) +
                          TOFILE(&TILLIB/GSSTRF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/KOSAF) +
                          TOFILE(&TILLIB/KOSAF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/KOSBF) +
                          TOFILE(&TILLIB/KOSBF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/KUNKO) +
                          TOFILE(&TILLIB/KUNKO) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/POSTA0) +
                          TOFILE(&TILLIB/POSTA0) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/POSTB0) +
                          TOFILE(&TILLIB/POSTB0) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/UNITFX) +
                          TOFILE(&TILLIB/UNITFX) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/VADR) TOFILE(&TILLIB/VADR) +
                          FROMMBR(*ALL) TOMBR(*FROMMBR) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/VAIAF) +
                          TOFILE(&TILLIB/VAIAF) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             ENDPGM
