             PGM
      /* */
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRC) TYPE(*CHAR) LEN(10)
             DCL        VAR(&END) TYPE(*CHAR) LEN(1) VALUE('N')
 START:      CALL       PGM(KONINI) PARM(&SRC &MBR &BIB &END)
             IF         COND(&END = 'J') THEN(GOTO CMDLBL(SLUTT))
      /*     KONVERTERER FRA MSGID TIL MESSAGE-CONSTANT           */
             CPYF       FROMFILE(&BIB/&SRC) TOFILE(*LIBL/KONFIL) +
                          FROMMBR(&MBR) TOMBR(*FIRST) +
                          MBROPT(*REPLACE) FMTOPT(*CVTSRC)
             CALL       PGM(KONCON)
             CPYF       FROMFILE(KONFIL) TOFILE(&BIB/&SRC) +
                          TOMBR(&MBR) MBROPT(*REPLACE) FMTOPT(*CVTSRC)
             CHGVAR     VAR(&MBR) VALUE('          ')
             GOTO       CMDLBL(START)
 SLUTT:      ENDPGM
