
             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             RTVJOBA    USER(&USER)


/* DETALJER FOR EN /FLERE  */
             RUNQRY     QRY(KRESAL06)  RCDSLT(*YES)

             SNDPGMMSG  MSG('Fil XKRESD er skapt. Kan overføres via +
                          punkt 40.')
 SLUTT:      ENDPGM
