             PGM
             DCL        VAR(&FLY) TYPE(*CHAR) LEN(3) VALUE('020')
             DCL        VAR(&EKIM) TYPE(*CHAR) LEN(1) VALUE('E')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SAS021SL) PARM(&FLY &EKIM)
             CALL       PGM(LH0001)
             ENDPGM
