             PGM        PARM(&TYPE)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(8)
             CALL       PGM(LL003R) PARM(&TYPE)
             ENDPGM
