             PGM
             DCL        VAR(&KNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(LL009R) PARM(&KNR)
             ENDPGM
