             PGM
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(8) VALUE('SØKKUNDE')
             CALL       PGM(LL003R) PARM(&TYPE)
             ENDPGM
