             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('LAGER-SYS ')
             CALL       PGM(LOGUSR) PARM(&PGM)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

             CLRPFM     FILE(QTEMP/LLW013)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(LLW013*) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             OVRDBF     FILE(HEDUMMY) TOFILE(HEDUMMY) MBR(URA)

             CALL       PGM(LL010R) PARM(&UPDATE)
 SLUTT:      ENDPGM
