             PGM        PARM(&FIRM &ALN &KOPI &PRT &NR &TOT &LAS &STR &EPOST)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(2)
             DCL        VAR(&ALN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TOT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)

             SBMJOB     CMD(CALL PGM(LL014C21) PARM(&FIRM &ALN &KOPI +
                          &PRT &NR &TOT &LAS &STR &EPOST)) +
                          JOBQ(SYJOBQNMAX)

             ENDPGM
