/********************************************************************/
/*    ARB. MED MOTATTE VARNER FORDELINGSLISTER                      */
/********************************************************************/
             PGM        PARM(&UPDATE)
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

             CLRPFM     FILE(QTEMP/LLW013)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(LLW013*) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             OVRDBF     FILE(HEDUMMY) TOFILE(HEDUMMY) MBR(URA)

             CALL       PGM(LL010R) PARM(&UPDATE)
             ENDPGM
