             PGM
             DCL        VAR(&FFAK) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&IN01) TYPE(*CHAR) LEN(1) VALUE('9')
             DCL        VAR(&IN04) TYPE(*LGL) LEN(1)
             DCL        VAR(&IN05) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&IN06) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1) VALUE('0')

             CALL       PGM(SYFAFP) PARM(&JOBK &IN01)
             CALL       PGM(SYFA20CLJ) PARM(&FFAK &IN05 &IN06 &IN07 +
                          &IN08 &KOPI)

             ENDPGM
