             PGM        PARM(&FIRM &ALN &KOPI &PRT &NR &TOT &LAS &STR &EPOST)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(2)
             DCL        VAR(&ALN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TOT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             OVRPRTF    FILE(LL014P) DEV(FAX3812) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 120) LPI(6) CPI(16.7) +
                          FRONTMGN(0 0.5) OVRFLW(62) PAGRTT(0) +
                          OUTQ(QFAX/QFAXOUTQ)

             CALL       PGM(LL014R) PARM(&FIRM &ALN &KOPI &NR &TOT +
                        &LAS &STR &EPOST &QUSER &QJOB &QNBR)

             ENDPGM
