/*******************************************/
/*    ARB. MED LAGER-POSTER                */
/*******************************************/
 /*N01  CALL  PGM(SYFA00) FOR Å FÅ SAKSB.SIGN INN I UDS */
             PGM
             DCL        VAR(&GRP) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&MRNR) TYPE(*CHAR) LEN(5) VALUE('00000')
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ALN) TYPE(*CHAR) LEN(5)
 /*N01 */    DCL        VAR(&IN01) TYPE(*LGL) LEN(1)

 /*N01 */    CALL       PGM(SYFA00) PARM(&IN01)
 /*N01 */    IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))

             CLRPFM     FILE(QTEMP/LLBL1F)
             MONMSG     MSGID(CPF3142) EXEC(DO)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CRTDUPOBJ  OBJ(LLBL1F) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             ENDDO
             CLRPFM     FILE(QTEMP/LL072F)
             MONMSG     MSGID(CPF3142) EXEC(DO)
             CRTDUPOBJ  OBJ(LL072F) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             ENDDO
 START:
             CALL       PGM(LL020R) PARM(&GRP &PNR &MRNR &UPDATE)
             IF         COND(&UPDATE = 'B') THEN(DO)
             CALL       PGM(LL072R) PARM(&GRP &PNR &MRNR &ALN &UPDATE)
             IF         COND(&UPDATE = 'B') THEN(GOTO CMDLBL(START))
             ENDDO
 SLUTT:      ENDPGM
