             PGM
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&GRP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(QTEMP/LLW032)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(LLW032*) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))

             CALL       PGM(LL030R) PARM(&MODE &GRP &PNR)
             ENDPGM
