             PGM        PARM(&MN &PRT &PRTTYP)
             DCL        VAR(&MN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRTTYP) TYPE(*CHAR) LEN(10)

             IF         COND(&PRTTYP = 'ELTRON') THEN(DO)
             OVRPRTF    FILE(SYLA03P) OUTQ(&PRT)
             CALL       PGM(LL041RE) PARM(&MN)
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(ZBARC) OUTQ(&PRT)
             CALL       PGM(LL041R) PARM(&MN)
             ENDDO

             ENDPGM
