             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             CLRPFM     FILE(QTEMP/LLW043)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(LLW043*) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))

             CALL       PGM(LL043R)

             ENDPGM
