             PGM        PARM(&AVD &OPD &FLAGG)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             CHKOBJ     OBJ(QTEMP/LLGSFW) OBJTYPE(*FILE)
             MONMSG     MSGID(CPD0030 CPF9801) EXEC(DO)
             CRTDUPOBJ  OBJ(LLGSF*) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(*OBJ)
             RNMOBJ     OBJ(QTEMP/LLGSF) OBJTYPE(*FILE) NEWOBJ(LLGSFW)
             RNMOBJ     OBJ(QTEMP/LLGSFL01) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW01)
             RNMOBJ     OBJ(QTEMP/LLGSFL02) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW02)
             RNMOBJ     OBJ(QTEMP/LLGSFL03) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW03)
             RNMOBJ     OBJ(QTEMP/LLGSFL04) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW04)
             RNMOBJ     OBJ(QTEMP/LLGSFL05) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW05)
             RNMOBJ     OBJ(QTEMP/LLGSFL06) OBJTYPE(*FILE) +
                          NEWOBJ(LLGSFW06)
             ENDDO
             CLRPFM     FILE(QTEMP/LLGSFW)
             IF         COND(&FLAGG = 0) THEN(DO)
             CPYF       FROMFILE(&LIB/LLGSF) TOFILE(QTEMP/LLGSFW) +
                          MBROPT(*ADD) INCREL((*IF GSAVD *EQ &AVD) +
                          (*AND GSOPD *EQ &OPD) (*AND GSMMUU *EQ ' +
                          ') (*AND GSST *EQ ' ')) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             CPYF       FROMFILE(&LIB/LLGSF) TOFILE(QTEMP/LLGSFW) +
                          MBROPT(*ADD) INCREL((*IF GSAVD *EQ &AVD) +
                          (*AND GSOPD *EQ &OPD) (*AND GSST *EQ +
                          'F')) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(LL052R) PARM(&AVD &OPD &FLAGG)

             ENDPGM
