             PGM        PARM(&AVD &OPD &DTF &DTT &≈≈UM)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&≈≈UM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             CHKOBJ     OBJ(QTEMP/LLFGF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPD0030 CPF9801) EXEC(DO)
             CRTDUPOBJ  OBJ(LLFGF*) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(*OBJ)
             ENDDO
             CLRPFM     FILE(QTEMP/LLFGF)
             OVRDBF     FILE(LLFGFL01) TOFILE(QTEMP/LLFGFL01)
             OVRDBF     FILE(LLFGFL02) TOFILE(QTEMP/LLFGFL02)

             CALL       PGM(LL053R) PARM(&AVD &OPD &DTF &DTT &≈≈UM)

             ENDPGM
