             PGM        PARM(&PRT &GRUP &PNR &DTF &DTT +
                        &PTY &UKOPI &HOLD &SAVE &LAS &STR &KOPI)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UDOKN) TYPE(*DEC) LEN(3 0) VALUE(201)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&GRUP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTT) TYPE(*CHAR) LEN(8)

             OVRPRTF    FILE(LL062P) PAGESIZE(50 115) CPI(10) +
                          OVRFLW(44) PAGRTT(90) +
                          OUTQ(&PRT) FORMTYPE(&PTY) +
                          COPIES(&UKOPI) HOLD(&HOLD) SAVE(&SAVE)
/*                                                  */
             CALL       PGM(LL062R) PARM(&GRUP &PNR &DTF &DTT &LAS +
                          &STR &KOPI)

             ENDPGM
