             PGM        PARM(&PRT &GRUP &PNR &TN &DTF &DTT +
                        &PTY &UKOPI &HOLD &SAVE &LAS &STR &KOPI)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&GRUP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTT) TYPE(*CHAR) LEN(8)

/*                         */
/*    LASER                */
/*                         */
             IF         COND(&LAS = 'A') THEN(DO)
             OVRPRTF    FILE(LL064P) PAGESIZE(50 115) CPI(10) +
                          OVRFLW(44) +
                          OUTQ(&PRT) FORMTYPE(&PTY) +
                          COPIES(&UKOPI) HOLD(&HOLD) SAVE(&SAVE)
             ENDDO
             IF         COND(&LAS = 'J') THEN(DO)
             OVRPRTF    FILE(LL064P) PAGESIZE(50 115) CPI(10) +
                          OVRFLW(43) PAGRTT(90) +
                          OUTQ(&PRT) FORMTYPE(&PTY) +
                          COPIES(&UKOPI) HOLD(&HOLD) SAVE(&SAVE)
             ENDDO
/*                         */
/*    IKKE LASER           */
/*                         */
             IF         COND(&LAS = ' ') THEN(DO)
             OVRPRTF    FILE(LL064P) PAGESIZE(48 115) CPI(15) +
                          OVRFLW(43) PRTQLTY(*DRAFT) OUTQ(&PRT) +
                          FORMTYPE(&PTY) COPIES(&UKOPI) HOLD(&HOLD) +
                          SAVE(&SAVE)
             ENDDO

/*                                                  */
             CALL       PGM(LL064R) PARM(&GRUP &PNR &TN &DTF &DTT +
                        &LAS &STR &KOPI)
             ENDPGM
