             PGM        PARM(&PRT &GRUP &PNR &LT)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&GRUP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LT) TYPE(*CHAR) LEN(50)

             OVRPRTF    FILE(LL066P) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(66) PAGRTT(90) OUTQ(&PRT)
             CALL       PGM(LL066R) PARM(&GRUP &PNR &LT)

             ENDPGM
