             PGM        PARM(&FIRMA &AAR &PSD)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PSD) TYPE(*CHAR) LEN(7)

             CHGCURLIB  CURLIB(IBMDAT)
             ADDLIBLE   LIB(IBMPGM) POSITION(*LAST)

             CALL       PGM(LL075RA) PARM(&FIRMA &AAR &PSD)
             CHGCURLIB  CURLIB(*CRTDFT)
             RMVLIBLE   LIB(IBMPGM)

             ENDPGM
