             PGM        PARM(&GRP &PNR &FIRMA &AAR &PSD)
             DCL        VAR(&GRP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PSD) TYPE(*CHAR) LEN(7)

             IF         COND(&FIRMA = '70') THEN(CHGCURLIB +
                          CURLIB(ABDAT))
             IF         COND(&FIRMA = '01') THEN(CHGCURLIB +
                          CURLIB(IBMDAT))
             ADDLIBLE   LIB(IBMPGM) POSITION(*LAST)

             CALL       PGM(LL076R) PARM(&GRP &PNR &FIRMA &AAR &PSD)
             CHGCURLIB  CURLIB(*CRTDFT)
             RMVLIBLE   LIB(IBMPGM)

             ENDPGM
