             PGM        PARM(&GRP &PNR &FIRMA &JA &EB &ALN &TLAGER)
             DCL        VAR(&GRP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&JA) TYPE(*CHAR) LEN(400)
             DCL        VAR(&EB) TYPE(*CHAR) LEN(1400)
             DCL        VAR(&ALN) TYPE(*CHAR) LEN(5)
             DCL        VAR(&TLAGER) TYPE(*CHAR) LEN(1)

             IF         COND(&FIRMA = '70') THEN(CHGCURLIB +
                          CURLIB(ABDAT))
             IF         COND(&FIRMA = '01') THEN(CHGCURLIB +
                          CURLIB(IBMDAT))
             ADDLIBLE   LIB(IBMPGM) POSITION(*LAST)
             CHGLF      FILE(LLAGJL03) FRCRATIO(1)

             CALL       PGM(LL073R) PARM(&GRP &PNR &FIRMA &JA &EB +
                          &ALN &TLAGER)
             CHGCURLIB  CURLIB(*CRTDFT)
             RMVLIBLE   LIB(IBMPGM)

             ENDPGM
