             PGM        PARM(&GRP &KN &ART &TØM)
             DCL        VAR(&GRP) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ART) TYPE(*CHAR) LEN(15)
             DCL        VAR(&TØM) TYPE(*CHAR) LEN(1)
             CALL       PGM(LLWW01) PARM(&GRP &KN &ART &TØM)

             ENDPGM
