/* TEST BANE                      */
             PGM
             DCL        VAR(&LENKE) TYPE(*CHAR) LEN(140) +
                          VALUE('explorer +
                          http://10.13.1.22/sycgip/esmail.pgm?user:DE+
                          MO&UsrSpcName:GPXYUZ70F9&dager:90&MaxSn:600+
                          &MaxRc:3000')
STRPCO
             STRPCCMD   PCCMD(&LENKE)
             ENDPGM
