/* N01  BRUKER CPYTOSTMF I STEDET FOR CPYTOPCD                             */
/* N02  *LAST VED DLTSPLF (IKKE *ONLY)                                     */
             PGM        PARM(&EPOST &UNIK2)
             DCL        VAR(&UNIK2) TYPE(*CHAR) LEN(7)
             DCL        VAR(&CVPX) TYPE(*CHAR) LEN(280)
             DCL        VAR(&DIST) TYPE(*CHAR) LEN(1) /* DISTLISTE */
             DCL        VAR(&DISTL) TYPE(*CHAR) LEN(6) /* DISTLISTE */
             DCL        VAR(&EPO01) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO02) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO03) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO04) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO05) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO06) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO07) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO08) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO09) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO10) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO11) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO12) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO13) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO14) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO15) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO16) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO17) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO18) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO19) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO20) TYPE(*CHAR) LEN(70)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(30)
             DCL        VAR(&FONT) TYPE(*CHAR) LEN(1) VALUE('2') /* +
                          Unikkode */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(11) /* Unikkode */
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES)
 RTVTIME:    RTVJOBA    NBR(&JOBN)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &JOBN *CAT '.HTM')
             CHGVAR     VAR(&CVP1) VALUE('TEST')
             CHGVAR     VAR(&CVP) VALUE('J')
/* SETTER SAMMEN COVERPAGE DATA  */
/*                               */
             IF         COND(&CVP2 = ' ') THEN(DO)
             CHGVAR     VAR(&CVP2) VALUE('.')
                        ENDDO
             IF         COND(&CVP3 = '.') THEN(DO)
             CHGVAR     VAR(&CVP3) VALUE(' ')
                        ENDDO
             IF         COND(&CVP4 = '.') THEN(DO)
             CHGVAR     VAR(&CVP4) VALUE(' ')
                        ENDDO
             IF         COND(&CVP5 = '.') THEN(DO)
             CHGVAR     VAR(&CVP5) VALUE(' ')
                        ENDDO
             IF         COND(&CVP6 = '.') THEN(DO)
             CHGVAR     VAR(&CVP6) VALUE(' ')
                        ENDDO
             IF         COND(&CVP7 = '.') THEN(DO)
             CHGVAR     VAR(&CVP7) VALUE(' ')
                        ENDDO
             CHGVAR     VAR(&CVPX) VALUE(&CVP2 *CAT &CVP3 *CAT &CVP4 +
                          *CAT &CVP5 *CAT &CVP6 *CAT &CVP7)
/*                      */
/* EMNE KAN IKKE V∆RE   */
/* BLANK                */
/*                      */
             IF         COND(&CVP = 'J') THEN(DO)
                        CHGVAR VAR(&EMNE) VALUE(&CVP1)
                        ENDDO
             IF         COND(&EMNE = +
                          '                                        +
                          ') THEN(CHGVAR VAR(&EMNE) VALUE('EMAIL from +
                          &user'))
/*                               */
/*                      */
/* LAG SNDDST I QTEMP   */
/*                      */
             DLTF       FILE(QTEMP/SNDDSTC)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(EPOST198) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SNDDSTC)
/*N01*/      DLTF       FILE(QTEMP/SNDDST2C)
/*N01*/      MONMSG     MSGID(CPF0000)
/*N01*/      CRTPF      FILE(QTEMP/SNDDST2C) RCDLEN(198)
/*                      */
/* LEGGER P≈ HTML START */
/*                      */
/*           CALL       PGM(FAXEHTM3) PARM(&FONT)    */
/*                               */
/* SETTER SAMMEN COVERPAGE DATA  */
/*                               */
             CHGVAR     VAR(&CVPX) VALUE(&CVP2 *CAT &CVP3 *CAT &CVP4 +
                          *CAT &CVP5 *CAT &CVP6 *CAT &CVP7)
/*                               */
/* SKJEKKER DISTRIBUSJONSLISTE   */
/*                               */
             CHGVAR     VAR(&DIST) VALUE(%SST(&EPOST 1 1))
             CHGVAR     VAR(&DISTL) VALUE(%SST(&EPOST 2 6))
/*                      */
/*                               */
/*                      */
/* KOPIERER PRINT       */
/*                      */
             CPYF       FROMFILE(HTMLMAIL) TOFILE(QTEMP/SNDDSTC) +
                          FROMMBR(&UNIK2) MBROPT(*ADD) FMTOPT(*NOCHK)

/*                      */
/* LEGGER P≈ HTML SLUTT */
/*                      */
/*           CALL       PGM(FAXEHTME3)        */
/*N01 - CPYTOSTMF I STEDET FOR CPYTOPCD (PGA BEDRE MHT.CVT AV ∆ÿ≈ M.M)*/
/*N01 - MEN LEGGER IKKE UTDATA I IFS, MEN I MAPPE I QDLS              */
/*N01 - DETTE FOR ≈ F≈ LOV ≈ BENYTTE KOMMANDO SNDDST TYPE(*DOC)....   */
/*N01*/      CHGVAR     VAR(&TIL) VALUE('/QDLS/SYMAIL/' *CAT &UNIK)
/*N01*/      CPYF       FROMFILE(SNDDSTC) TOFILE(QTEMP/SNDDST2C) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             CPYTOSTMF  +
                          FROMMBR('/QSYS.LIB/QTEMP.LIB/SNDDST2C.FILE/+
                          SNDDST2C.MBR') TOSTMF(&TIL) +
                          STMFOPT(*REPLACE) CVTDTA(*AUTO) +
                          STMFCODPAG(*PCASCII) /*N01*/

             CHGDOCD    DOC(&UNIK) FLR(SYMAIL) DOCD(&EMNE) +
                          DOCCHRID(*SYSVAL)
/*                                     */
/*  SENDING VED DISTRIBUSJONSLISTE     */
/*                                     */
             IF         COND(&DIST = '*') THEN(DO)
             CALL       PGM(EPODIS) PARM(&DISTL &EPO01 &EPO02 &EPO03 +
                          &EPO04 &EPO05 &EPO06 &EPO07 &EPO08 &EPO09 +
                          &EPO10 &EPO11 &EPO12 &EPO13 &EPO14 &EPO15 +
                          &EPO16 &EPO17 &EPO18 &EPO19 &EPO20)
             SNDDST     TYPE(*DOC) TOINTNET((&EPO01) (&EPO02) +
                          (&EPO03) (&EPO04) (&EPO05) (&EPO06) +
                          (&EPO07) (&EPO08) (&EPO09) (&EPO10) +
                          (&EPO11) (&EPO12) (&EPO13) (&EPO14) +
                          (&EPO15) (&EPO16) (&EPO17) (&EPO18) +
                          (&EPO19) (&EPO20) (&EPO03)) DSTD(&EMNE) +
                          MSG(&CVPX) SNDFMT(*NOCHG) DOC(&UNIK) +
                          FLR(SYMAIL) DOCD(&EMNE)
             GOTO       CMDLBL(VIDERE)
             ENDDO
/*                      */
/* SENDER SOM EMAIL     */
/*                      */
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          MSG(&CVPX) SNDFMT(*NOCHG) DOC(&UNIK) +
                          FLR(SYMAIL) DOCD(&EMNE)
/*                      */
/*                      */
/*                      */
/*                      */
/*                      */
VIDERE:      ENDPGM
