             PGM        PARM(&QUSER &EPOSTF)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
             DCL        VAR(&SNDNA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SNDAD) TYPE(*CHAR) LEN(8)
/*                      */
/*                      */
/* HENT REPLYADRESSE    */
/*                      */
/*                      */
             CALL       PGM(EPOS04E) PARM(&QUSER &SNDNA &SNDAD &EPOSTF)
             ENDPGM
/*                      */
