/* *********************************************************************   */
/*       L1 DOKEMENTER             ***********************************   */
/* ********************************************************************    */
             PGM        PARM(&DOK &PLUKK)
             DCL        VAR(&DOK) TYPE(*CHAR) LEN(30)
             DCL        VAR(&PLUKK) TYPE(*CHAR) LEN(1)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(MAIL04R) PARM(&DOK &PLUKK)
             ENDPGM
