/* TEST BANE                      */
             PGM
             DCL        VAR(&LENKE) TYPE(*CHAR) LEN(512) +
                          VALUE('http://10.13.1.22/sycgip/esmail.pgm?+
                          user=DEMO&UsrSpcName=GPXYUZ70F9&dager=90&Ma+
                          xSn=600&MaxRc=3000')
             CALL       PGM(SYGE39CL) PARM(&LENKE)
             ENDPGM
