             PGM
             DCL        VAR(&AAA) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&BBB) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&CCC) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&DDD) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&EEE) TYPE(*CHAR) LEN(1) VALUE('0')
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             ADDLIBLE   LIB(SYSPEDF)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&AAA) +
                          VALUE('1'))
             ADDLIBLE   LIB(SYSPED)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&BBB) +
                          VALUE('1'))
             ADDLIBLE   LIB(SYENDPTF)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&CCC) +
                          VALUE('1'))
             ADDLIBLE   LIB(SYENDRE)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&DDD) +
                          VALUE('1'))
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             ADDLIBLE   LIB(&L1DATN)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&EEE) +
                          VALUE('1'))
             CALL       PGM(MAIL02R)
             IF         COND(&AAA = '0') THEN(RMVLIBLE LIB(SYSPEDF))
             IF         COND(&BBB = '0') THEN(RMVLIBLE LIB(SYSPED))
             IF         COND(&CCC = '0') THEN(RMVLIBLE LIB(SYENDPTF))
             IF         COND(&DDD = '0') THEN(RMVLIBLE LIB(SYENDRE))
             IF         COND(&EEE = '0') THEN(RMVLIBLE LIB(&L1DATN))
             ENDPGM
