             PGM        PARM(&QNBR &QUSER &QJOB &SPLF &NBR)
             DCL        VAR(&NBR) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10)
/*                      */
/* TØMMER FIL           */
/*                      */
             CLRPFM     FILE(MAILWORK)
/*                                     */
/* KOPIERER SPOOLFIL                   */
/*                                     */
             CPYSPLF    FILE(&SPLF) TOFILE(MAILWORK) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(&NBR) +
                          MBROPT(*ADD) CTLCHAR(*PRTCTL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
