             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCLF       FILE(*LIBL/FILOVER) RCDFMT(QLIDOBJD)

             OVRDBF     FILE(FILOVER) TOFILE(QTEMP/FILOVER)

             CHGJOB     JOB(*) LOG(4 00 *SECLVL) LOGCLPGM(*YES)

             DSPOBJD    OBJ(&LIB/*ALL) OBJTYPE(*PGM) +
                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/FILOVER) +
                          OUTMBR(*FIRST *REPLACE)
             SNDPGMMSG  MSGID(CPF9801) MSGF(QCPFMSG) TOPGMQ(*EXT) +
                          MSGTYPE(*STATUS) /* Blanker ut melding på +
                          skjerm med "tom" melding */
LOOP1:
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(SLUTT))

             CHGPGM     PGM(&LIB/&ODOBNM) OPTIMIZE(*YES)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(LOOP1)
SLUTT:
             ENDPGM
