             PGM        PARM(&RECNUM)
             DCL        VAR(&RECNUM) TYPE(*CHAR) LEN(9)
             CALL       PGM(SYSPED/INLIBL)
             CLRPFM PARTTC
             MONMSG CPF0000
             CALL       PGM(PARTTCR) PARM(&RECNUM)
             ENDPGM
