/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10264 * 01 YBC PTF10 NYE PRINTEFILER SAD52PFT, SAD61PFT                 */
/* *********************************************************************   */
/*       * ÅPNE SAD I PDF-FORMAT                                           */

/*S01        PGM        PARM(&BANET &BANED &FINST &FINSD &INFOP)        */
/*S01        DCL        VAR(&DL) TYPE(*CHAR) LEN(10) VALUE('DATALIST')  */
/*N01*/      PGM        PARM(&BANET &BANED &FINST &FINSD &INFOP &DL)
/*N01*/      DCL        VAR(&DL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TD2) TYPE(*CHAR) LEN(10) VALUE('TOLLDEK2')
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FINST) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FINSD) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&BANET) TYPE(*CHAR) LEN(50)
             DCL        VAR(&BANED) TYPE(*CHAR) LEN(50)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/* TILLEGGSARK */
             IF         COND(&FINST = 'J') THEN(DO)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&TD2) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANET) ORIENTAT(*V)
                          ENDDO
             IF         COND(&INFOP = 'J') THEN(DO)
             CHGVAR     VAR(&FILEN) VALUE('TOLLDEK2')
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &BANET)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
             DLTSPLF    FILE(&TD2) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDDO
/* DATALISTE K */
             IF         COND(&FINSD = 'J') THEN(DO)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&DL) TOPDF(&BANED) +
                          JOB(&QNBR/&QUSER/&QJOB)
                          ENDDO
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&DL &QNBR &QUSER &QJOB +
                          &BANED)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
             DLTSPLF    FILE(&DL) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDPGM
