             PGM        PARM(&AVD &OPD &NR &BANE &INFOP)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&FAKT) TYPE(*DEC) LEN(3 0) VALUE(029)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSJ69P   ')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&FAXN) TYPE(*CHAR) LEN(21)
             DCL        VAR(&ATTN) TYPE(*CHAR) LEN(40)
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /* SKRIVER UT FRAKTBREVKOPI           */
    /*                                    */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* ORDNER PRINTER FOR FRAKTBREV */
             OVRPRTF    FILE(&SPLF) DEVTYPE(*AFPDS) PAGESIZE(70 80) +
                          LPI(6) CPI(12) OVRFLW(70) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD)
             CALL       PGM(SYSJ69A) PARM(&AVD &OPD &NAVN &FAXN &ATTN)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
             DLTSPLF    FILE(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                          ENDDO
/*                                       */
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&SPLF &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
/*                                       */
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
    /* */

/*                                       */
    /* */
 SLUTT:      ENDPGM
