/* DOKUMENTHØYDE FRA 66 TIL 70  */
             PGM        PARM(&AVD &TUR &STMF &BANE &VISE &INFOP)
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &in03 på, skal losseliste  være +
                          stående. */
             DCL        VAR(&OF) TYPE(*DEC) LEN(3 0) VALUE(64)
             DCL        VAR(&STAA) TYPE(*DEC) LEN(3 0) VALUE(020)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(152)
             DCL        VAR(&VISE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til stående losseliste. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til merkelapp-2. */
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1) VALUE('B') /* +
                          KOPI-  utskrifter. */
             DCL        VAR(&LPP) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
    /* */
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* */
VIDERE:      CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             CHGDTAARA  DTAARA(*LDA (22 8)) VALUE(&TUR)
             CHGDTAARA  DTAARA(*LDA (231 3)) VALUE('000')
             CHGDTAARA  DTAARA(*LDA (961 1)) VALUE('N')

    /* */
             CALL       PGM(GETPRN) PARM(&AVD &STAA &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
             CHGVAR     VAR(&LPP) VALUE('070')
             CHGVAR     VAR(&OF) VALUE('060')

             CHGVAR     VAR(&LASER) VALUE('A')
    /*                                    */
    /*                                    */
    /* START FOR PDF DOKUMENTER           */
    /*                                    */
    /* */
    /* */
             CHGVAR     VAR(&FILEN) VALUE('SYFA54PF')
    /* */
    /* SKRIVER UT LASTELISTE */
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR FRAKTBREV */
    /* ----------------------------------------------------------- */
    /**************************************/
    /* START FOR      PDF DOKUMENTER      */
    /**************************************/
    /* ----------------------------------------------------------- */
             IF         COND(&INFOP = 'D') THEN(DO)
             OVRPRTF    FILE(SYFA54PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          120) CPI(15) OVRFLW(&OF) DRAWER(&DRAWER) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(&PT1) +
                          TOSTMF(&BANE) WSCST(*PDF)
             ENDDO
             IF         COND(&INFOP *NE 'D') THEN(DO)
             OVRPRTF    FILE(SYFA54PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          120) CPI(15) OVRFLW(&OF) DRAWER(&DRAWER) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(&PT1)
             ENDDO
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* SKRIVER UT LASTELISTE */
             CALL       PGM(SYFA54) PARM(&LASER)
             IF         COND(&INFOP = 'D') THEN(RETURN)
    /* ----------------------------------------------------------- */
    /* */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
                          ENDDO
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
    /* */

 SLUTT:      ENDPGM
