             PGM        PARM(&AVD &OPD &KODE)
             DCL        VAR(&FAXTYP) TYPE(*CHAR) LEN(1) VALUE('X')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&HOVED) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*           SKJEKK OM PDF FINNES FRA FØR  */
             OVRPRTF    FILE(QSYSPRT) OUTQ(OUTMAIL)
 VIDERE:     OVRPRTF    FILE(SAD52PF) DEVTYPE(*AFPDS) PAGESIZE(108 +
                          120) LPI(9) CPI(15) FRONTMGN(.24 0) +
                          OVRFLW(106) FRONTOVL(FSAD38 0 0.2) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) /*E03*/
             OVRPRTF    FILE(SAD61PF) DEVTYPE(*AFPDS) PAGESIZE(108 +
                          120) LPI(9) CPI(15) FRONTMGN(.24 0) +
                          OVRFLW(106) FRONTOVL(FSAD38 0 0.2) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) /*N01*/
             OVRPRTF    FILE(TOLLDEK2) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          83) LPI(6) CPI(10) OVRFLW(72) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SAD52PFT) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          120) LPI(6) CPI(15) OVRFLW(72) PAGRTT(0) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SAD61PFT) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          120) LPI(6) CPI(15) OVRFLW(72) PAGRTT(0) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(REGKORT) DEVTYPE(*SCS) PAGESIZE(48 132) +
                          LPI(6) CPI(10) OVRFLW(48) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD)
             OVRDBF     FILE(WFILEIMP) MBR(ARKIV)
             OVRDBF     FILE(WFILEEXP) MBR(ARKIV)

             IF         COND(&KODE = 'I') THEN(DO)
             CHGVAR     VAR(&HOVED) VALUE('SAD61PF')
             CALL       PGM(SAD61P) PARM(&FAXTYP &AVD &OPD &PRT1 +
                          &PRT2 &PRT3)
             ENDDO
             IF         COND(&KODE = 'E') THEN(DO)
             CHGVAR     VAR(&HOVED) VALUE('SAD52PF')
             CALL       PGM(SAD52P) PARM(&FAXTYP &AVD &OPD &PRT1 +
                          &PRT2 &PRT3)
             ENDDO

             DLTSPLF    FILE(&HOVED) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(TOLLDEK2) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(SAD61PFT) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(SAD52PFT) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)

 SLUTT:      ENDPGM
