             PGM        PARM(&PARM &BANE &INFOP)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(1024)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&SD) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DT) TYPE(*CHAR) LEN(6)
             DCL        VAR(&MN) TYPE(*CHAR) LEN(17)
             DCL        VAR(&DTS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSJ58P   ')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
    /* SKRIVER UT FRAKTBREVKOPI           */
    /*                                    */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* ORDNER PRINTER FOR FRAKTBREV */
             OVRPRTF    FILE(&SPLF) DEVTYPE(*AFPDS) PAGESIZE(70 80) +
                          LPI(6) CPI(10) FRONTMGN(0 0.2) OVRFLW(70) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD)
             CALL       PGM(SYSJ58) PARM(&SG &SD &DT &MN &DTS &PARM)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
             DLTSPLF    FILE(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                          ENDDO
/*                                       */
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&SPLF &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
/*                                       */
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
    /* */

/*                                       */
    /* */
 SLUTT:      ENDPGM
