             PGM        PARM(&AVD &SVIOPD &KODE &STMF &BANE &VISE +
                          &INFOP)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CALLTY) TYPE(*CHAR) LEN(1) VALUE('A')
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(152)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SVIOPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&VISE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*           SKJEKK OM PDF FINNES FRA FØR  */
             OVRPRTF    FILE(QSYSPRT) OUTQ(OUTMAIL)
             DSPLNK     OBJ(&BANE) OUTPUT(*PRINT) OBJTYPE(*STMF) +
                          DETAIL(*NAME) DSPOPT(*USER)
             MONMSG     MSGID(CPFA0A9) EXEC(GOTO CMDLBL(VIDERE))
             DLTSPLF    FILE(QSYSPRT) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             IF         COND(&VISE = 'J') THEN(DO)
             CALL       PGM(PDF001) PARM(&STMF)
             ENDDO
             RETURN
    /*                     */
    /*                     */
VIDERE:      IF         COND(&KODE = 'I') THEN(DO)
             CALL       PGM(SVI006R) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVI006P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = 'E') THEN(DO)
             CALL       PGM(SVE006R) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVE006P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = '1') THEN(DO)
             CALL       PGM(SVI007RT) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVI007PT')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = '2') THEN(DO)
             CALL       PGM(SVI008R) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVI008P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = '3') THEN(DO)
             CALL       PGM(SVE007R) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVE007P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = '4') THEN(DO)
             CALL       PGM(SVE008R) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVE008P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = 'Z') THEN(DO)
             CALL       PGM(SVZ002RA) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVZ002P')
             ENDDO
    /*                     */
    /*                     */
             IF         COND(&KODE = '5') THEN(DO)
             CALL       PGM(SVZ004RA) PARM(&AVD &SVIOPD &CALLTY)
             CHGVAR     VAR(&PRTNA) VALUE('SVZ004P')
             ENDDO
    /*                     */
    /*                     */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CVTSPLFPDF SPLF(&PRTNA) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
             RMVLIBLE   LIB(MMAIL)
             ENDDO
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&PRTNA &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
/*                                       */
             IF         COND(&VISE = 'J') THEN(DO)
             CALL       PGM(PDF001) PARM(&STMF)
             ENDDO
             DLTSPLF    FILE(&PRTNA) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */

             ENDPGM
