             PGM        PARM(&AVD &OPD &NR &BANE &INFOP)
             DCL        VAR(&ALAS) TYPE(*DEC) LEN(3 0) VALUE(031)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&ALAS) TYPE(*DEC) LEN(3 0) VALUE(031)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSJ16P   ')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
    /* */
    /* LOGO VERDI       */
    /* */
             CALL       PGM(GETPRN) PARM(&AVD &ALAS &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /*                                                           */
    /* SKRIVER UT FRAKTBREVKOPI |         */
    /*                                    */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* ORDNER PRINTER FOR FRAKTBREV */
             OVRPRTF    FILE(&SPLF) DEVTYPE(*AFPDS) PAGESIZE(70 80) +
                          LPI(6) CPI(10) FRONTMGN(0 0.2) OVRFLW(64) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD)
             CALL       PGM(SYSJ16A) PARM(&AVD &OPD &NR)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
             DLTSPLF    FILE(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                          ENDDO
/*                                       */
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&SPLF &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
/*                                       */
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
    /* */

/*                                       */
    /* */
 SLUTT:      ENDPGM
