             PGM        PARM(&UFI &UAVD &UPRO)
  /* OBS!! HARDKODET PRINTERSTYRING */
             DCL        VAR(&UFI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&UAVD) TYPE(*CHAR) LEN(4)
  /* OBS!! HARDKODET PRINTERSTYRING */
             DCL        VAR(&USG) TYPE(*CHAR) LEN(3)  VALUE('XXX')
             DCL        VAR(&UPRO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&UDT) TYPE(*CHAR) LEN(6) VALUE('000000')
             DCL        VAR(&UOPD) TYPE(*CHAR) LEN(7) VALUE('0000000')
             DCL        VAR(&UFB) TYPE(*CHAR) LEN(3) VALUE('000')
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('F')
             DCL        VAR(&VB) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&PO) TYPE(*CHAR) LEN(1) VALUE('T')
   /*LABEL*/
             DCL        VAR(&LAB) TYPE(*DEC) LEN(3 0) VALUE(067)
             DCL        VAR(&PRT67) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til ZEBRA/ELTRON-strekkodemerkelapper */
             DCL        VAR(&PT67) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til ZEBRA/ELTRON strekkodemerkelapper */
   /*FBR/GETPRN*/
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til vanlig fraktbrev. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til vanlig fraktbrev. */
             DCL        VAR(&PDFDIR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STFB) TYPE(*DEC) LEN(3 0) VALUE(006)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
   /*ARKIV*/
             DCL        VAR(&ATYPE) TYPE(*CHAR) LEN(2) VALUE('sb')
             DCL        VAR(&SPES) TYPE(*CHAR) LEN(2) VALUE('N')
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)

             RTVJOBA    USER(&AUSER)

             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&UFI)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&UAVD)
             CHGDTAARA  DTAARA(*LDA (19 3)) VALUE(&USG)
             CHGDTAARA  DTAARA(*LDA (22 8)) VALUE(&UPRO)
             CHGDTAARA  DTAARA(*LDA (64 6)) VALUE(&UDT)
             CHGDTAARA  DTAARA(*LDA (82 7)) VALUE(&UOPD)
             CHGDTAARA  DTAARA(*LDA (89 3)) VALUE(&UFB)

    /**************************************/
    /* LABELS                             */
    /**************************************/
             CALL       PGM(GETPRT) PARM(&UAVD &LAB &PRT67 &PT67)
             OVRPRTF    FILE(ZBARC)   OUTQ(&PRT67) FORMTYPE(&PT67)
             OVRPRTF    FILE(SYLA03P) OUTQ(&PRT67) FORMTYPE(&PT67)

             CALL       PGM(GETPRN) PARM(&UAVD &STFB &PRT2 &PT2 +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /**************************************/
    /* START FOR IKKE PDF DOKUMENTER      */
    /**************************************/
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) PAGESIZE(144 100) CPI(10) +
                          OVRFLW(144) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             ENDDO
    /**************************************/
    /* START FOR PDF DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          100) CPI(10) LPI(12) OVRFLW(140) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
             ENDDO
    /**************************************/
    /* START FOR AFP DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'F') THEN(DO)
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          100) CPI(10) LPI(12) FRONTMGN(0.10 0.23) +
                          OVRFLW(70) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
             ENDDO

             CALL       PGM(SYFA12) PARM(&PRANT &KODE &VB &PO &PDFDIR)

             SBMJOB     CMD(CALL PGM(ARC002CL) PARM(&ATYPE &AUSER +
                          &SPES)) JOB(ARKIVSB) JOBD(*USRPRF) +
                          JOBQ(SYJOBQARK)
             ENDPGM
