 /* NEDSTRIPPET SYFA55ICL */
             PGM        PARM(&AVD &TUR)
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&AJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&ANBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AGNULL) TYPE(*CHAR) LEN(8) +
                          VALUE('00000000')
             DCL        VAR(&DADRJN) TYPE(*CHAR) LEN(1) VALUE('G')
             DCL        VAR(&BELJN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UDSFAX) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til stående GODSliste. */
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til stående GODSeliste. */
             DCL        VAR(&UTSNR) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&ATYPE) TYPE(*CHAR) LEN(2) VALUE('go')
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1) VALUE('N')
    /* */

 RTVUNIK:    RTVJOBA    JOB(&AJOB) USER(&AUSER) NBR(&ANBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &ANBR)
             RMVM       FILE(WRKAGL01) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             RMVM       FILE(WRKAG) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(WRKAG) MBR(&UNIK)
             MONMSG     MSGID(CPF7306) EXEC(GOTO CMDLBL(RTVUNIK))
             ADDLFM     FILE(WRKAGL01) MBR(&UNIK) DTAMBRS((WRKAG +
                          (&UNIK)))
             MONMSG     MSGID(CPF7306) EXEC(GOTO CMDLBL(RTVUNIK))
             OVRDBF     FILE(WRKAG) TOFILE(WRKAG) MBR(&UNIK)
             OVRDBF     FILE(WRKAGL01) TOFILE(WRKAGL01) MBR(&UNIK)

             CHGVAR     VAR(&UTSNR) VALUE(022)
             CALL       PGM(GETPRN) PARM(&AVD &UTSNR &PRT1 &PT1 +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
  /* PLAIN .*/
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) PAGESIZE(70 120) CPI(15) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO
  /* P=PDF..*/
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO
  /* F=AFP..*/
             IF         COND(&LASER *EQ 'F') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO


             CALL       PGM(SYFA55) PARM(&AVD &TUR &AGNULL &BELJN +
                          &UDSFAX &DADRJN)

             RMVM       FILE(WRKAGL01) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             RMVM       FILE(WRKAG) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
    /* ARKIVJOBB            */
             SBMJOB     CMD(CALL PGM(ARC002CL) PARM(&ATYPE &AUSER +
                          &FINS)) JOB(ARKIV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQARK)
 SLUTT:      ENDPGM
