             PGM
             DCL        VAR(&AVBRU) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)

/*______________*/
/* HENT ÅRSTALL */
/*""""""""""""""*/
             CALL       PGM(REOBUD0) PARM(&AVBRU &AAR)
             IF         COND(&AVBRU = 'J') THEN(GOTO CMDLBL(SLUTT)) +
                          /* Hvis &AVBRU på, avslutter program. */
                                                          /**/
/*______________*/
/* REOBUD       */
/*""""""""""""""*/
             CALL REOBUD  PARM(&AAR)
SLUTT:       ENDPGM
