/* ********************************************************************    */
             PGM   PARM(&DOK)
             DCL        VAR(&DOK) TYPE(*CHAR) LEN(256)
             DEL        OBJLNK(&DOK)
             MONMSG     MSGID(CPF0000)
             ENDPGM
