/*N02* FJERN LENKER FOR TOMCAT-LOGGER */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) /* +
                          Directory/mappe som leses inn */
             CRTPF      FILE(QTEMP/Q) RCDLEN(256)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(QTEMP/Q)
             MONMSG     MSGID(CPF0000)
/* 1 finn alle mappe - leg i fil q */
  CHGVAR     VAR(&DIR) VALUE('/syspeddev/tksmart')
             CALL       PGM(REOIFSUT) PARM(&DIR)

             ENDPGM
