/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 SH  PTF10 ARKIVP                                             */
/* 10XXX * 02 YBC PTF10 FLERE NYE FILER                                    */
/* ********************************************************************    */
             PGM
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FROMLIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOLIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRLIBEDI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRLIBEDIO) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DELETE) TYPE(*CHAR) LEN(1) VALUE('N')
        /*  */
             CHGDSPF    FILE(REOPDAFM) WAITRCD(*IMMED)
             RTVDTAARA  DTAARA(FIRMDT (1 2)) RTNVAR(&FIRMA)
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&FIRMA)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&FROMLIBR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&TOLIBR)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&FRLIBEDI)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&FRLIBEDIO)
        /*  */
             OVRDBF     FILE(AMDE)       TOFILE(&FROMLIBR/AMDE)
             OVRDBF     FILE(AMHE)       TOFILE(&FROMLIBR/AMHE)
             OVRDBF     FILE(AMGE)       TOFILE(&FROMLIBR/AMGE)
             OVRDBF     FILE(AMSAML1)    TOFILE(&FROMLIBR/AMSAML1)
/*N01*/      OVRDBF     FILE(ARKIVL02)   TOFILE(&FROMLIBR/ARKIVL02)
             OVRDBF     FILE(AVSLUTF)    TOFILE(&FROMLIBR/AVSLUTF)
             OVRDBF     FILE(AVSLUTGF)   TOFILE(&FROMLIBR/AVSLUTGF)
             OVRDBF     FILE(BILLOF)     TOFILE(&FROMLIBR/BILLOF)
             OVRDBF     FILE(BLADRT)     TOFILE(&FROMLIBR/BLADRT)
             OVRDBF     FILE(BLLOK)      TOFILE(&FROMLIBR/BLLOK)
             OVRDBF     FILE(BLVSD2)     TOFILE(&FROMLIBR/BLVSD2)
             OVRDBF     FILE(BLV1)       TOFILE(&FROMLIBR/BLV1)
             OVRDBF     FILE(BLV2)       TOFILE(&FROMLIBR/BLV2)
             OVRDBF     FILE(BOOKING)    TOFILE(&FROMLIBR/BOOKING)
             OVRDBF     FILE(BOOKIN2)    TOFILE(&FROMLIBR/BOOKIN2)
             OVRDBF     FILE(DIMM)       TOFILE(&FROMLIBR/DIMM)
             OVRDBF     FILE(DISP)       TOFILE(&FROMLIBR/DISP)
             OVRDBF     FILE(DOKEB)      TOFILE(&FROMLIBR/DOKEB)
             OVRDBF     FILE(DOKEC)      TOFILE(&FROMLIBR/DOKEC)
             OVRDBF     FILE(DOKECE)     TOFILE(&FROMLIBR/DOKECE)
             OVRDBF     FILE(DOKECEL)    TOFILE(&FROMLIBR/DOKECEL)
             OVRDBF     FILE(DOKECET)    TOFILE(&FROMLIBR/DOKECET)
             OVRDBF     FILE(DOKEF)      TOFILE(&FROMLIBR/DOKEF)
             OVRDBF     FILE(DOKEFIM)    TOFILE(&FROMLIBR/DOKEFIM)
             OVRDBF     FILE(DOKEM)      TOFILE(&FROMLIBR/DOKEM)
             OVRDBF     FILE(DOKEQ)      TOFILE(&FROMLIBR/DOKEQ)
             OVRDBF     FILE(DOKEQM)     TOFILE(&FROMLIBR/DOKEQM)
             OVRDBF     FILE(DOKOTH)     TOFILE(&FROMLIBR/DOKOTH)
             OVRDBF     FILE(DOKOTHM1)   TOFILE(&FROMLIBR/DOKOTHM1)
             OVRDBF     FILE(DOKUF)      TOFILE(&FROMLIBR/DOKUF)
             OVRDBF     FILE(DOKUFM)     TOFILE(&FROMLIBR/DOKUFM)
             OVRDBF     FILE(DOKUFV)     TOFILE(&FROMLIBR/DOKUFV)
             OVRDBF     FILE(DOKUI)      TOFILE(&FROMLIBR/DOKUI)
             OVRDBF     FILE(DOKUM)      TOFILE(&FROMLIBR/DOKUM)
             OVRDBF     FILE(DOKUT)      TOFILE(&FROMLIBR/DOKUT)
             OVRDBF     FILE(DOK29)      TOFILE(&FROMLIBR/DOK29)
             OVRDBF     FILE(DOK36)      TOFILE(&FROMLIBR/DOK36)
             OVRDBF     FILE(EDIM2)      TOFILE(&FRLIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)       TOFILE(&FRLIBEDI/EDIS)
             OVRDBF     FILE(FAI4)       TOFILE(&FROMLIBR/FAI4)
             OVRDBF     FILE(FAK2)       TOFILE(&FROMLIBR/FAK2)
             OVRDBF     FILE(FORDEL)     TOFILE(&FROMLIBR/FORDEL)
             OVRDBF     FILE(FREETXT)    TOFILE(&FROMLIBR/FREETXT)
             OVRDBF     FILE(FRISOK)     TOFILE(&FROMLIBR/FRISOK)
             OVRDBF     FILE(FRMDOC)     TOFILE(&FROMLIBR/FRMDOC)
             OVRDBF     FILE(FRMDOC1)    TOFILE(&FROMLIBR/FRMDOC1)
             OVRDBF     FILE(FRMDOC2)    TOFILE(&FROMLIBR/FRMDOC2)
             OVRDBF     FILE(FRMDOC3)    TOFILE(&FROMLIBR/FRMDOC3)
             OVRDBF     FILE(GSSAKF)     TOFILE(&FROMLIBR/GSSAKF)
             OVRDBF     FILE(GSSFGF)     TOFILE(&FROMLIBR/GSSFGF)
             OVRDBF     FILE(GSSGDF)     TOFILE(&FROMLIBR/GSSGDF)
             OVRDBF     FILE(GSSKAF)     TOFILE(&FROMLIBR/GSSKAF)
             OVRDBF     FILE(GSSLGL01)   TOFILE(&FROMLIBR/GSSLGL01)
             OVRDBF     FILE(GSSOLL01)   TOFILE(&FROMLIBR/GSSOLL01)
             OVRDBF     FILE(GSSORL21)   TOFILE(&FROMLIBR/GSSORL21)
             OVRDBF     FILE(GSSOVF)     TOFILE(&FROMLIBR/GSSOVF)
             OVRDBF     FILE(GSSOWL01)   TOFILE(&FROMLIBR/GSSOWL01)
             OVRDBF     FILE(GSSPAF)     TOFILE(&FROMLIBR/GSSPAF)
             OVRDBF     FILE(GSSPOF)     TOFILE(&FROMLIBR/GSSPOF)
             OVRDBF     FILE(GSSRFF)     TOFILE(&FROMLIBR/GSSRFF)
             OVRDBF     FILE(GSSTRF)     TOFILE(&FROMLIBR/GSSTRF)
             OVRDBF     FILE(HEADD)      TOFILE(&FROMLIBR/HEADD)
             OVRDBF     FILE(HESTED)     TOFILE(&FROMLIBR/HESTED)
             OVRDBF     FILE(HETRIU)     TOFILE(&FROMLIBR/HETRIU)
             OVRDBF     FILE(HUBOL02)    TOFILE(&FROMLIBR/HUBOL02)
             OVRDBF     FILE(ISOFL1)     TOFILE(&FROMLIBR/ISOFL1)
             OVRDBF     FILE(ISOLFL1)    TOFILE(&FROMLIBR/ISOLFL1)
             OVRDBF     FILE(ISOSAKF)    TOFILE(&FROMLIBR/ISOSAKF)
             OVRDBF     FILE(KOSBU12)    TOFILE(&FROMLIBR/KOSBU12)
             OVRDBF     FILE(MCAWF)      TOFILE(&FROMLIBR/MCAWF)
             OVRDBF     FILE(PALLDL99)   TOFILE(&FROMLIBR/PALLDL99)
             OVRDBF     FILE(SAML1)      TOFILE(&FROMLIBR/SAML1)
             OVRDBF     FILE(STSCLI)     TOFILE(&FROMLIBR/STSCLI)
             OVRDBF     FILE(STSFBR)     TOFILE(&FROMLIBR/STSFBR)
             OVRDBF     FILE(STSOPD1)    TOFILE(&FROMLIBR/STSOPD1)
             OVRDBF     FILE(TRACKF)     TOFILE(&FROMLIBR/TRACKF)
             OVRDBF     FILE(TRACKT)     TOFILE(&FROMLIBR/TRACKT)
             OVRDBF     FILE(UTLLOGF)    TOFILE(&FROMLIBR/UTLLOGF)
             OVRDBF     FILE(DOKUDGS) TOFILE(&FROMLIBR/DOKUDGS)
        /*  */
             OVRDBF     FILE(AMDEOLD)    TOFILE(&TOLIBR/AMDE)
             OVRDBF     FILE(AMHEOLD)    TOFILE(&TOLIBR/AMHE)
             OVRDBF     FILE(AMGEOLD)    TOFILE(&TOLIBR/AMGE)
             OVRDBF     FILE(AMSAMLOLD)  TOFILE(&TOLIBR/AMSAML)
/*N01*/      OVRDBF     FILE(ARKIVOLD)   TOFILE(&TOLIBR/ARKIVL02)
             OVRDBF     FILE(AVSLUTOLD)  TOFILE(&TOLIBR/AVSLUTF)
             OVRDBF     FILE(AVSLUGOLD)  TOFILE(&TOLIBR/AVSLUTGF)
             OVRDBF     FILE(BILLOFOLD)  TOFILE(&TOLIBR/BILLOF)
             OVRDBF     FILE(BLADRTOLD)  TOFILE(&TOLIBR/BLADRT)
             OVRDBF     FILE(BLLOKOLD)   TOFILE(&TOLIBR/BLLOK)
             OVRDBF     FILE(BLVSD2OLD)  TOFILE(&TOLIBR/BLVSD2)
             OVRDBF     FILE(BLV1OLD)    TOFILE(&TOLIBR/BLV1)
             OVRDBF     FILE(BLV2OLD)    TOFILE(&TOLIBR/BLV2)
             OVRDBF     FILE(BOOKINGOLD) TOFILE(&TOLIBR/BOOKING)
             OVRDBF     FILE(BOOKIN2OLD) TOFILE(&TOLIBR/BOOKIN2)
             OVRDBF     FILE(DIMMOLD)    TOFILE(&TOLIBR/DIMM)
             OVRDBF     FILE(DISPOLD)    TOFILE(&TOLIBR/DISP)
             OVRDBF     FILE(DOKEBOLD)   TOFILE(&TOLIBR/DOKEB)
             OVRDBF     FILE(DOKECOLD)   TOFILE(&TOLIBR/DOKEC)
             OVRDBF     FILE(DOKECEOLD)  TOFILE(&TOLIBR/DOKECE)
             OVRDBF     FILE(DOKECELOLD) TOFILE(&TOLIBR/DOKECEL)
             OVRDBF     FILE(DOKECETOLD) TOFILE(&TOLIBR/DOKECET)
             OVRDBF     FILE(DOKEFOLD)   TOFILE(&TOLIBR/DOKEF)
             OVRDBF     FILE(DOKEFIMOLD) TOFILE(&TOLIBR/DOKEFIM)
             OVRDBF     FILE(DOKEMOLD)   TOFILE(&TOLIBR/DOKEM)
             OVRDBF     FILE(DOKEQOLD)   TOFILE(&TOLIBR/DOKEQ)
             OVRDBF     FILE(DOKEQMOLD)  TOFILE(&TOLIBR/DOKEQM)
             OVRDBF     FILE(DOKOTHOLD)  TOFILE(&TOLIBR/DOKOTH)
             OVRDBF     FILE(DOKOTHMOLD) TOFILE(&TOLIBR/DOKOTHM1)
             OVRDBF     FILE(DOKUFOLD)   TOFILE(&TOLIBR/DOKUF)
             OVRDBF     FILE(DOKUFMOLD)  TOFILE(&TOLIBR/DOKUFM)
             OVRDBF     FILE(DOKUFVOLD)  TOFILE(&TOLIBR/DOKUFV)
             OVRDBF     FILE(DOKUIOLD)   TOFILE(&TOLIBR/DOKUI)
             OVRDBF     FILE(DOKUMOLD)   TOFILE(&TOLIBR/DOKUM)
             OVRDBF     FILE(DOKUTOLD)   TOFILE(&TOLIBR/DOKUT)
             OVRDBF     FILE(DOK29OLD)   TOFILE(&TOLIBR/DOK29)
             OVRDBF     FILE(DOK36OLD)   TOFILE(&TOLIBR/DOK36)
             OVRDBF     FILE(EDIMOLD)    TOFILE(&FRLIBEDIO/EDIM)
             OVRDBF     FILE(EDISOLD)    TOFILE(&FRLIBEDIO/EDIS)
             OVRDBF     FILE(FAINOLD)    TOFILE(&TOLIBR/FAIN)
             OVRDBF     FILE(FAKTOLD)    TOFILE(&TOLIBR/FAKT)
             OVRDBF     FILE(FORDELOLD)  TOFILE(&TOLIBR/FORDEL)
             OVRDBF     FILE(FREETXTOLD) TOFILE(&TOLIBR/FREETXT)
             OVRDBF     FILE(FRISOKOLD)  TOFILE(&TOLIBR/FRISOK)
             OVRDBF     FILE(FRMDOCOLD)  TOFILE(&TOLIBR/FRMDOC)
             OVRDBF     FILE(FRMDOC1OLD) TOFILE(&TOLIBR/FRMDOC1)
             OVRDBF     FILE(FRMDOC2OLD) TOFILE(&TOLIBR/FRMDOC2)
             OVRDBF     FILE(FRMDOC3OLD) TOFILE(&TOLIBR/FRMDOC3)
             OVRDBF     FILE(GSSAKFOLD)  TOFILE(&TOLIBR/GSSAKF)
             OVRDBF     FILE(GSSFGFOLD)  TOFILE(&TOLIBR/GSSFGF)
             OVRDBF     FILE(GSSGDFOLD)  TOFILE(&TOLIBR/GSSGDF)
             OVRDBF     FILE(GSSKAFOLD)  TOFILE(&TOLIBR/GSSKAF)
             OVRDBF     FILE(GSSLGFOLD)  TOFILE(&TOLIBR/GSSLGF)
             OVRDBF     FILE(GSSOLFOLD)  TOFILE(&TOLIBR/GSSOLF)
             OVRDBF     FILE(GSSORFOLD)  TOFILE(&TOLIBR/GSSORF)
             OVRDBF     FILE(GSSOVFOLD)  TOFILE(&TOLIBR/GSSOVF)
             OVRDBF     FILE(GSSOWFOLD)  TOFILE(&TOLIBR/GSSOWF)
             OVRDBF     FILE(GSSPAFOLD)  TOFILE(&TOLIBR/GSSPAF)
             OVRDBF     FILE(GSSPOFOLD)  TOFILE(&TOLIBR/GSSPOF)
             OVRDBF     FILE(GSSRFFOLD)  TOFILE(&TOLIBR/GSSRFF)
             OVRDBF     FILE(GSSTRFOLD)  TOFILE(&TOLIBR/GSSTRF)
             OVRDBF     FILE(HEADFOLD)   TOFILE(&TOLIBR/HEADF)
             OVRDBF     FILE(HESTEDOLD)  TOFILE(&TOLIBR/HESTED)
             OVRDBF     FILE(HETRIUOLD)  TOFILE(&TOLIBR/HETRIU)
             OVRDBF     FILE(HUBOFOLD)   TOFILE(&TOLIBR/HUBOF)
             OVRDBF     FILE(ISOFOLD)    TOFILE(&TOLIBR/ISOF)
             OVRDBF     FILE(ISOLFOLD)   TOFILE(&TOLIBR/ISOLF)
             OVRDBF     FILE(ISOSAKFOLD) TOFILE(&TOLIBR/ISOSAKF)
             OVRDBF     FILE(KOSBUOLD)   TOFILE(&TOLIBR/KOSBU)
             OVRDBF     FILE(MCAWFOLD)   TOFILE(&TOLIBR/MCAWF)
             OVRDBF     FILE(PALLDOLD)   TOFILE(&TOLIBR/PALLD)
             OVRDBF     FILE(SAMLOLD)    TOFILE(&TOLIBR/SAML)
             OVRDBF     FILE(STSCLIOLD)  TOFILE(&TOLIBR/STSCLI)
             OVRDBF     FILE(STSFBROLD)  TOFILE(&TOLIBR/STSFBR)
             OVRDBF     FILE(STSOPDOLD)  TOFILE(&TOLIBR/STSOPD)
             OVRDBF     FILE(TRACKFOLD)  TOFILE(&TOLIBR/TRACKF)
             OVRDBF     FILE(TRACKTOLD)  TOFILE(&TOLIBR/TRACKT)
             OVRDBF     FILE(UTLLOGFOLD) TOFILE(&TOLIBR/UTLLOGF)
             OVRDBF     FILE(DOKUDOLD) TOFILE(&TOLIBR/DOKUDGS)
/*N02*/      OVRDBF     FILE(ARKLOHOLD) TOFILE(&TOLIBR/ARKLOGH)
/*N02*/      OVRDBF     FILE(ARKLODOLD) TOFILE(&TOLIBR/ARKLOGD)
/*N02*/      OVRDBF     FILE(BILLOSOLD) TOFILE(&TOLIBR/BILLOFOS)
/*N02*/      OVRDBF     FILE(BLV1GTOLD) TOFILE(&TOLIBR/BLV1GATE)
/*N02*/      OVRDBF     FILE(CCBLV1OLD) TOFILE(&TOLIBR/CCBLV1)
/*N02*/      OVRDBF     FILE(CCBLV2OLD) TOFILE(&TOLIBR/CCBLV2)
/*N02*/      OVRDBF     FILE(CARGOFOLD) TOFILE(&TOLIBR/CARGOF)
/*N02*/      OVRDBF     FILE(CARGOOOLD) TOFILE(&TOLIBR/CARGOO)
/*N02*/      OVRDBF     FILE(DOKULGOLD) TOFILE(&TOLIBR/DOKULG)
/*N02*/      OVRDBF     FILE(DOLAFOLD) TOFILE(&TOLIBR/DOLAF)
/*N02*/      OVRDBF     FILE(EDICSOLD) TOFILE(&TOLIBR/EDICS)
/*N02*/      OVRDBF     FILE(ENADSFOLD) TOFILE(&TOLIBR/ENADSF)
/*N02*/      OVRDBF     FILE(EPOHOLD) TOFILE(&TOLIBR/EPOH)
/*N02*/      OVRDBF     FILE(EPOLOLD) TOFILE(&TOLIBR/EPOL)
/*N02*/      OVRDBF     FILE(EPOPOSOLD) TOFILE(&TOLIBR/EPOPOS)
/*N02*/      OVRDBF     FILE(ESOSF1OLD) TOFILE(&TOLIBR/ESOSF1)
/*N02*/      OVRDBF     FILE(ESOSF2OLD) TOFILE(&TOLIBR/ESOSF2)
/*N02*/      OVRDBF     FILE(ESOSF3OLD) TOFILE(&TOLIBR/ESOSF3)
/*N02*/      OVRDBF     FILE(E171FOLD) TOFILE(&TOLIBR/E171F)
/*N02*/      OVRDBF     FILE(E307FOLD) TOFILE(&TOLIBR/E307F)
/*N02*/      OVRDBF     FILE(FAKTXTOLD) TOFILE(&TOLIBR/FAKTXT)
/*N02*/      OVRDBF     FILE(FAXLOGOLD) TOFILE(&TOLIBR/FAXLOG)
/*N02*/      OVRDBF     FILE(FPXREFOLD) TOFILE(&TOLIBR/FPXREF)
/*N02*/      OVRDBF     FILE(GSSTUROLD) TOFILE(&TOLIBR/GSSTUR)
/*N02*/      OVRDBF     FILE(HEBRELEOLD) TOFILE(&TOLIBR/HEBRELE)
/*N02*/      OVRDBF     FILE(OMDIOLD) TOFILE(&TOLIBR/OMDI)
/*N02*/      OVRDBF     FILE(RUCKPOLD) TOFILE(&TOLIBR/RUCKP)
/*N02*/      OVRDBF     FILE(RUCKPUOLD) TOFILE(&TOLIBR/RUCKPU)
/*N02*/      OVRDBF     FILE(SKPOSOLD) TOFILE(&TOLIBR/SKPOS)
/*N02*/      OVRDBF     FILE(TKSGMOLD) TOFILE(&TOLIBR/TKSGM)
/*N02*/      OVRDBF     FILE(TRACKKOLD)  TOFILE(&TOLIBR/TRACKK)
/*N02*/      OVRDBF     FILE(VARELIOLD) TOFILE(&TOLIBR/VARELI)
/*N02*/      OVRDBF     FILE(XMLINH1OLD) TOFILE(&TOLIBR/XMLINHL1)
        /*  */
             CALL       PGM(REOPDA)
        /*  */
             OVRDBF     FILE(FREETUR)    TOFILE(&FROMLIBR/FREETUR)
             OVRDBF     FILE(HEAD11)     TOFILE(&FROMLIBR/HEAD11)
             OVRDBF     FILE(ISOFL7)     TOFILE(&FROMLIBR/ISOFL7)
             OVRDBF     FILE(ISOLFL1)    TOFILE(&FROMLIBR/ISOLFL1)
             OVRDBF     FILE(KOSBU13)    TOFILE(&FROMLIBR/KOSBU13)
             OVRDBF     FILE(REISL01)    TOFILE(&FROMLIBR/REISL01)
             OVRDBF     FILE(STSTUR1)    TOFILE(&FROMLIBR/STSTUR1)
             OVRDBF     FILE(TILLL02)    TOFILE(&FROMLIBR/TILLL02)
             OVRDBF     FILE(TRAVH4)     TOFILE(&FROMLIBR/TRAVH4)
             OVRDBF     FILE(TRAVV4)     TOFILE(&FROMLIBR/TRAVV4)
             OVRDBF     FILE(TUFE5)      TOFILE(&FROMLIBR/TUFE5)
             OVRDBF     FILE(TUFET)      TOFILE(&FROMLIBR/TUFET)
             OVRDBF     FILE(TURER)      TOFILE(&FROMLIBR/TURER)
        /*  */
             OVRDBF     FILE(FREETUROLD) TOFILE(&TOLIBR/FREETUR)
             OVRDBF     FILE(ISOFOLD)    TOFILE(&TOLIBR/ISOF)
             OVRDBF     FILE(ISOLFOLD)   TOFILE(&TOLIBR/ISOLF)
             OVRDBF     FILE(KOSBUOLD)   TOFILE(&TOLIBR/KOSBU)
             OVRDBF     FILE(REISOLD)    TOFILE(&TOLIBR/REIS)
             OVRDBF     FILE(STSTUROLD)  TOFILE(&TOLIBR/STSTUR)
             OVRDBF     FILE(TILLOLD)    TOFILE(&TOLIBR/TILL)
             OVRDBF     FILE(TRAVHOLD)   TOFILE(&TOLIBR/TRAVH)
             OVRDBF     FILE(TRAVVOLD)   TOFILE(&TOLIBR/TRAVV)
             OVRDBF     FILE(TUFEOLD)    TOFILE(&TOLIBR/TUFE)
             OVRDBF     FILE(TUFETOLD)   TOFILE(&TOLIBR/TUFET)
             OVRDBF     FILE(TUREROLD)   TOFILE(&TOLIBR/TURER)
        /*  */
             CALL       PGM(REOPDATU) PARM(&DELETE)
        /*  */
             OVRDBF     FILE(SAMLAOLD) TOFILE(&TOLIBR/SAMLA)
             OVRDBF     FILE(DOKEQMOLD) TOFILE(&TOLIBR/DOKEQM)
             CALL       PGM(REOPDASL) PARM(&DELETE)
        /*  */
             ENDPGM
