/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NYFIL ARKCMP                                       */
/* 10XXX * 02 YBC PTF10 SAMLAOG DOKEQM                                     */
/* ********************************************************************    */
             PGM
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&TOLIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DELETE) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&DLTEDI) TYPE(*CHAR) LEN(1) VALUE('J')

             CHGDSPF    FILE(REOPDAFM) WAITRCD(*IMMED)
             RTVDTAARA  DTAARA(FIRMDT (1 2)) RTNVAR(&FIRMA)
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&FIRMA)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&TOLIBR)
        /*  */
             OVRDBF     FILE(FAINCMP)    TOFILE(&TOLIBR/FAINCMP)
             OVRDBF     FILE(FAKTCMP)    TOFILE(&TOLIBR/FAKTCMP)
             OVRDBF     FILE(HEADFCMP)   TOFILE(&TOLIBR/HEADFCMP)
/*N01*/      OVRDBF     FILE(ARKCMP)   TOFILE(&TOLIBR/ARKCMP)
        /* KOMPRIMERE OPPDRAG */
             CALL       PGM(REOPDA2) PARM(&DELETE &DLTEDI)
        /* SLETTE TURER */
             CHGVAR     VAR(&DELETE) VALUE('J')
             CALL       PGM(REOPDATU) PARM(&DELETE)
        /* SLETTE SAMLAST */
/*N02*/      OVRDBF     FILE(SAMLAOLD) TOFILE(&TOLIBR/SAMLA)
/*N02*/      OVRDBF     FILE(DOKEQMOLD) TOFILE(&TOLIBR/DOKEQM)
             CALL       PGM(REOPDASL) PARM(&DELETE)
        /*  */
             ENDPGM
