             PGM
             DCL        VAR(&LIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MSG) TYPE(*LGL) LEN(1) VALUE('0')
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBR)
             /* HEADFCMP */
             ALCOBJ     OBJ((&LIBR/HEADFCMP *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(CHGVAR VAR(&MSG) +
                          VALUE('1'))
             IF         COND(&MSG = '1') THEN(GOTO CMDLBL(SL1))
             /* FAKTCMP */
             ALCOBJ     OBJ((&LIBR/FAKTCMP *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(CHGVAR VAR(&MSG) +
                          VALUE('1'))
             IF         COND(&MSG = '1') THEN(GOTO CMDLBL(SL2))
             /* FAINCMP */
             ALCOBJ     OBJ((&LIBR/FAINCMP *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(CHGVAR VAR(&MSG) +
                          VALUE('1'))
             IF         COND(&MSG = '1') THEN(GOTO CMDLBL(SL3))
             /* */
             RGZPFM     FILE(&LIBR/HEADFCMP)
             MONMSG     MSGID(CPF2981)
             RGZPFM     FILE(&LIBR/FAKTCMP)
             MONMSG     MSGID(CPF2981)
             RGZPFM     FILE(&LIBR/FAINCMP)
             MONMSG     MSGID(CPF2981)
             /* */
             DLCOBJ     OBJ((&LIBR/FAINCMP *FILE *EXCL))
 SL3:        DLCOBJ     OBJ((&LIBR/FAKTCMP *FILE *EXCL))
 SL2:        DLCOBJ     OBJ((&LIBR/HEADFCMP *FILE *EXCL))
             IF         COND(&MSG = '0') THEN(GOTO CMDLBL(SLUTT))
 SL1:        SNDPGMMSG  MSGID(DIV2118) MSGF(SYMSGF) MSGTYPE(*INFO)
             /* */
 SLUTT:      ENDPGM
