/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SAMLAOG DOKEQM                                     */
/* ********************************************************************    */
             PGM
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&TOLIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRLIBEDI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DELETE) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&DLTEDI) TYPE(*CHAR) LEN(1) VALUE('N')

             CHGDSPF    FILE(REOPDAFM) WAITRCD(*IMMED)
             RTVDTAARA  DTAARA(FIRMDT (1 2)) RTNVAR(&FIRMA)
             CHGDTAARA  DTAARA(*LDA (1 2)) VALUE(&FIRMA)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&TOLIBR)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&FRLIBEDI)
        /*  */
             OVRDBF     FILE(AMDE)       TOFILE(&TOLIBR/AMDE)
             OVRDBF     FILE(AMHE)       TOFILE(&TOLIBR/AMHE)
             OVRDBF     FILE(AMGE)       TOFILE(&TOLIBR/AMGE)
             OVRDBF     FILE(AMSAML1)    TOFILE(&TOLIBR/AMSAML1)
             OVRDBF     FILE(AVSLUTOLD)  TOFILE(&TOLIBR/AVSLUTF)
             OVRDBF     FILE(AVSLUGOLD)  TOFILE(&TOLIBR/AVSLUTGF)
             OVRDBF     FILE(BILLOF)     TOFILE(&TOLIBR/BILLOF)
             OVRDBF     FILE(BLADRT)     TOFILE(&TOLIBR/BLADRT)
             OVRDBF     FILE(BLLOK)      TOFILE(&TOLIBR/BLLOK)
             OVRDBF     FILE(BLVSD2)     TOFILE(&TOLIBR/BLVSD2)
             OVRDBF     FILE(BLV1)       TOFILE(&TOLIBR/BLV1)
             OVRDBF     FILE(BLV2)       TOFILE(&TOLIBR/BLV2)
             OVRDBF     FILE(BOOKING)    TOFILE(&TOLIBR/BOOKING)
             OVRDBF     FILE(BOOKIN2)    TOFILE(&TOLIBR/BOOKIN2)
             OVRDBF     FILE(DIMM)       TOFILE(&TOLIBR/DIMM)
             OVRDBF     FILE(DISP)       TOFILE(&TOLIBR/DISP)
             OVRDBF     FILE(DOKEB)      TOFILE(&TOLIBR/DOKEB)
             OVRDBF     FILE(DOKEC)      TOFILE(&TOLIBR/DOKEC)
             OVRDBF     FILE(DOKECE)     TOFILE(&TOLIBR/DOKECE)
             OVRDBF     FILE(DOKECEL)    TOFILE(&TOLIBR/DOKECEL)
             OVRDBF     FILE(DOKECET)    TOFILE(&TOLIBR/DOKECET)
             OVRDBF     FILE(DOKEF)      TOFILE(&TOLIBR/DOKEF)
             OVRDBF     FILE(DOKEFIM)    TOFILE(&TOLIBR/DOKEFIM)
             OVRDBF     FILE(DOKEM)      TOFILE(&TOLIBR/DOKEM)
             OVRDBF     FILE(DOKEQ)      TOFILE(&TOLIBR/DOKEQ)
             OVRDBF     FILE(DOKEQM)     TOFILE(&TOLIBR/DOKEQM)
             OVRDBF     FILE(DOKOTH)     TOFILE(&TOLIBR/DOKOTH)
             OVRDBF     FILE(DOKOTHM1)   TOFILE(&TOLIBR/DOKOTHM1)
             OVRDBF     FILE(DOKUF)      TOFILE(&TOLIBR/DOKUF)
             OVRDBF     FILE(DOKUFM)     TOFILE(&TOLIBR/DOKUFM)
             OVRDBF     FILE(DOKUFM)     TOFILE(&TOLIBR/DOKUFM)
             OVRDBF     FILE(DOKUFV)     TOFILE(&TOLIBR/DOKUFV)
             OVRDBF     FILE(DOKUI)      TOFILE(&TOLIBR/DOKUI)
             OVRDBF     FILE(DOKUM)      TOFILE(&TOLIBR/DOKUM)
             OVRDBF     FILE(DOKUT)      TOFILE(&TOLIBR/DOKUT)
             OVRDBF     FILE(DOK29)      TOFILE(&TOLIBR/DOK29)
             OVRDBF     FILE(DOK36)      TOFILE(&TOLIBR/DOK36)
             OVRDBF     FILE(EDIM2)      TOFILE(&FRLIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)       TOFILE(&FRLIBEDI/EDIS)
             OVRDBF     FILE(FAI4)       TOFILE(&TOLIBR/FAI4)
             OVRDBF     FILE(FAKTOLD)    TOFILE(&TOLIBR/FAKTOLD)
             OVRDBF     FILE(FORDEL)     TOFILE(&TOLIBR/FORDEL)
             OVRDBF     FILE(FREETXT)    TOFILE(&TOLIBR/FREETXT)
             OVRDBF     FILE(FRISOK)     TOFILE(&TOLIBR/FRISOK)
             OVRDBF     FILE(FRMDOC)     TOFILE(&TOLIBR/FRMDOC)
             OVRDBF     FILE(FRMDOC1)    TOFILE(&TOLIBR/FRMDOC1)
             OVRDBF     FILE(FRMDOC2)    TOFILE(&TOLIBR/FRMDOC2)
             OVRDBF     FILE(FRMDOC3)    TOFILE(&TOLIBR/FRMDOC3)
             OVRDBF     FILE(GSSAKF)     TOFILE(&TOLIBR/GSSAKF)
             OVRDBF     FILE(GSSFGF)     TOFILE(&TOLIBR/GSSFGF)
             OVRDBF     FILE(GSSGDF)     TOFILE(&TOLIBR/GSSGDF)
             OVRDBF     FILE(GSSKAF)     TOFILE(&TOLIBR/GSSKAF)
             OVRDBF     FILE(GSSLGL01)   TOFILE(&TOLIBR/GSSLGL01)
             OVRDBF     FILE(GSSOLL01)   TOFILE(&TOLIBR/GSSOLL01)
             OVRDBF     FILE(GSSORL21)   TOFILE(&TOLIBR/GSSORL21)
             OVRDBF     FILE(GSSOVF)     TOFILE(&TOLIBR/GSSOVF)
             OVRDBF     FILE(GSSOWL01)   TOFILE(&TOLIBR/GSSOWL01)
             OVRDBF     FILE(GSSPAF)     TOFILE(&TOLIBR/GSSPAF)
             OVRDBF     FILE(GSSPOF)     TOFILE(&TOLIBR/GSSPOF)
             OVRDBF     FILE(GSSRFF)     TOFILE(&TOLIBR/GSSRFF)
             OVRDBF     FILE(GSSTRF)     TOFILE(&TOLIBR/GSSTRF)
             OVRDBF     FILE(HEADD)      TOFILE(&TOLIBR/HEADD)
             OVRDBF     FILE(HESTED)     TOFILE(&TOLIBR/HESTED)
             OVRDBF     FILE(HETRIUOLD)  TOFILE(&TOLIBR/HETRIU)
             OVRDBF     FILE(HUBOL02)    TOFILE(&TOLIBR/HUBOL02)
             OVRDBF     FILE(ISOFL1)     TOFILE(&TOLIBR/ISOFL1)
             OVRDBF     FILE(ISOLFL1)    TOFILE(&TOLIBR/ISOLFL1)
             OVRDBF     FILE(ISOSAKF)    TOFILE(&TOLIBR/ISOSAKF)
             OVRDBF     FILE(KOSBU12)    TOFILE(&TOLIBR/KOSBU12)
             OVRDBF     FILE(MCAWF)      TOFILE(&TOLIBR/MCAWF)
             OVRDBF     FILE(PALLDL99)   TOFILE(&TOLIBR/PALLDL99)
             OVRDBF     FILE(SAML1)      TOFILE(&TOLIBR/SAML1)
             OVRDBF     FILE(STSCLI)     TOFILE(&TOLIBR/STSCLI)
             OVRDBF     FILE(STSFBR)     TOFILE(&TOLIBR/STSFBR)
             OVRDBF     FILE(STSOPD1)    TOFILE(&TOLIBR/STSOPD1)
             OVRDBF     FILE(TRACKF)     TOFILE(&TOLIBR/TRACKF)
             OVRDBF     FILE(TRACKT)     TOFILE(&TOLIBR/TRACKT)
             OVRDBF     FILE(UTLLOGF)    TOFILE(&TOLIBR/UTLLOGF)
             OVRDBF     FILE(DOKUDGS)    TOFILE(&TOLIBR/DOKUDGS)
        /*  */
             OVRDBF     FILE(ARKCMP)    TOFILE(&TOLIBR/ARKCMP)
             OVRDBF     FILE(FAINCMP)    TOFILE(&TOLIBR/FAINCMP)
             OVRDBF     FILE(FAKTCMP)    TOFILE(&TOLIBR/FAKTCMP)
             OVRDBF     FILE(HEADFCMP)   TOFILE(&TOLIBR/HEADFCMP)
        /*  */
        /* KOMPRIMERE OPPDRAG */
             CALL       PGM(REOPDA2) PARM(&DELETE &DLTEDI)
        /*  */
             OVRDBF     FILE(FREETUR)    TOFILE(&TOLIBR/FREETUR)
             OVRDBF     FILE(HEAD11)     TOFILE(&TOLIBR/HEAD11)
             OVRDBF     FILE(ISOFOLD)    TOFILE(&TOLIBR/ISOF)
             OVRDBF     FILE(ISOLFOLD)   TOFILE(&TOLIBR/ISOLF)
             OVRDBF     FILE(KOSBU13)    TOFILE(&TOLIBR/KOSBU13)
             OVRDBF     FILE(REISL01)    TOFILE(&TOLIBR/REISL01)
             OVRDBF     FILE(STSTUR1)    TOFILE(&TOLIBR/STSTUR1)
             OVRDBF     FILE(TILLL02)    TOFILE(&TOLIBR/TILLL02)
             OVRDBF     FILE(TRAVH4)     TOFILE(&TOLIBR/TRAVH4)
             OVRDBF     FILE(TRAVV4)     TOFILE(&TOLIBR/TRAVV4)
             OVRDBF     FILE(TUFE5)      TOFILE(&TOLIBR/TUFE5)
             OVRDBF     FILE(TUFET)      TOFILE(&TOLIBR/TUFET)
             OVRDBF     FILE(TURER)      TOFILE(&TOLIBR/TURER)
        /*  */
        /* SLETTE TURER */
             CHGVAR     VAR(&DELETE) VALUE('J')
             CALL       PGM(REOPDATU) PARM(&DELETE)
        /* SLETTE SAMLAST */
/*N01*/      OVRDBF     FILE(SAMLAOLD) TOFILE(&TOLIBR/SAMLA)
/*N01*/      OVRDBF     FILE(DOKEQMOLD) TOFILE(&TOLIBR/DOKEQM)
             CALL       PGM(REOPDASL) PARM(&DELETE)
        /*  */
             ENDPGM
