             PGM        PARM(&FILE &LIB)
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RUNQRY     QRY(*NONE) QRYFILE((&LIB/&FILE)) RCDSLT(*YES)
             ENDPGM
