             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) /* FILE +
                          LIBRARY */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             RUNQRY     QRY(OPDTURLIS) QRYFILE((&LIB/HEADF) +
                          (&LIB/OPDINT) (&LIB/OPDKOS)) +
                          OUTTYPE(*PRINTER) OUTFORM(*DETAIL) +
                          RCDSLT(*YES)
             ENDPGM
