             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) /* FILE +
                          LIBRARY */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             RUNQRY     QRY(PERRAP01) QRYFILE((&LIB/FAKGB2) +
                          (&LIB/HEADF)) OUTTYPE(*PRINTER) +
                          OUTFORM(*DETAIL) RCDSLT(*YES)
             ENDPGM
