             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) /* FILE +
                          LIBRARY */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             RUNQRY     QRY(OPDRUTFIL) QRYFILE((&LIB/HEADF) +
                          (&LIB/OPDINT) (&LIB/OPDKOS)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          RCDSLT(*YES) OUTFILE(&LIB/OPDRUT)
             ENDPGM
