             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) /* FILE +
                          LIBRARY */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             RUNQRY     QRY(QRESRAP01) QRYFILE((&LIB/HEADF) +
                          (&LIB/FAKT)) OUTTYPE(*PRINTER) +
                          OUTFORM(*DETAIL) RCDSLT(*YES)
             ENDPGM
