             PGM
             DCL        VAR(&STRTID) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EXPDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&REFDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&REFTIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SAVDEV) TYPE(*CHAR) LEN(10) VALUE(TAP01)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JNR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EXPDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&XLOOP) TYPE(*LGL) LEN(1)
             DCL        VAR(&MSGTXT) TYPE(*CHAR)
             MONMSG CPF0000
             CALL       PGM(NATTBACKR) PARM(&STRTID &EXPDATE &XLOOP +
                          &WS &REFDATE &REFTIME &SAVDEV)
             ENDPGM
