             PGM        PARM(&AVD &TDN &SG &KODE &TYPE)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) VALUE('HIST')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
                                                          /**/
             CALL       PGM(SAD052) PARM(&AVD &TDN &SG &TYPE &WS)
             ENDPGM
