/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 11016 * 01 YBC PTF11 OMBERERING                                         */
/* ********************************************************************    */
             PGM
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&LIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DRIFTLIB) TYPE(*CHAR) LEN(10)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&DRIFTLIB)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBR)
             ADDLIBLE   LIB(&LIBR) POSITION(*BEFORE &DRIFTLIB)
             MONMSG     MSGID(CPF2103)
             OVRDBF     FILE(SADHOPD) TOFILE(SADH)
/*N01*/      OVRDBF     FILE(SADHO2) TOFILE(SADH)
             CHGVAR     VAR(&IN01) VALUE('1')
             CALL       PGM(SAD005) PARM(&IN01 &MODE)
             RMVLIBLE   LIB(&LIBR)
             MONMSG     MSGID(CPF2104)
             ENDDO

             ENDPGM
