             PGM        PARM(&AVD &TDN &SG &KODE &TYPE)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN05) TYPE(*LGL) LEN(1) VALUE('1')
             /* 8 DUMMYPARAMETRE SOM KUN BENYTTES VED KALL FRA LASTELISTE */
             DCL        VAR(&TRL1) TYPE(*CHAR) LEN(3)            /*SIG*/
             DCL        VAR(&TRL2) TYPE(*DEC) LEN(4 0) VALUE(0) /*AVD  */
             DCL        VAR(&TRL3) TYPE(*DEC) LEN(7 0) VALUE(0) /*OPD  */
             DCL        VAR(&TRL4) TYPE(*DEC) LEN(8 0) VALUE(0) /*TUR  */
             DCL        VAR(&TRL5) TYPE(*DEC) LEN(7 0) VALUE(0) /*V.POS*/
             DCL        VAR(&TRL6) TYPE(*DEC) LEN(7 0) VALUE(0) /*ANT. */
             DCL        VAR(&TRL7) TYPE(*DEC) LEN(9 0) VALUE(0) /*VEKT */
             DCL        VAR(&TRL8) TYPE(*DEC) LEN(8 0) VALUE(0) /*F.AGE*/
                                                          /**/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
                                                          /**/
             CALL       PGM(SAD041) PARM(&AVD &TDN &SG &TYPE &WS +
                          &IN05 &TRL1 &TRL2 &TRL3 &TRL4 &TRL5 &TRL6 +
                          &TRL7 &TRL8)
             ENDPGM
