             PGM
             DCL        VAR(&PLUKK) TYPE(*CHAR) LEN(1) VALUE('N') /* +
                          'J'=Plukking,  'N'=Vedlikehold. */
             DCL        VAR(&VNT) TYPE(*CHAR) LEN(8) /* +
                          Tolltariffnr. */
             CALL       PGM(SAD010) PARM(&PLUKK &VNT)
             ENDPGM
