             PGM        PARM(&AVD &TDN &SG &TYPE &MODE)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
                                                          /**/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
                                                          /**/
             CALL       PGM(SAD064) PARM(&AVD &TDN &SG &TYPE)

             CALL       PGM(SAD061) PARM(&AVD &TDN &SG &TYPE &WS &MODE)
             ENDPGM
