             PGM        PARM(&IN01 &AVD &TUR &ANT)
             /* SAD025 VARIABLE */
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr avslutt program */
             DCL        VAR(&IN02) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &in02 på, betyr det at det skal +
                          bruke forhåndstrykkeformular */
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) /* Avdeling. */
             DCL        VAR(&TUR) TYPE(*DEC) LEN(8 0) /* TUR       */
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(1) /* +
                          Antall lasteliste som er utskrevet */
             DCL        VAR(&LSTP) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til lasteliste på SAD.(TRANSITT)*/
             /* SAD052 VARIABLE */
             DCL        VAR(&IN39) TYPE(*CHAR) LEN(1)
             DCL        VAR(&HOVP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DLP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UTLP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MRKP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DEVIT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LENGTH) TYPE(*DEC) LEN(5 0) VALUE(128)
             DCL        VAR(&DTA) TYPE(*CHAR) LEN(128)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
                                                          /**/
             /* HENTE PRINTER    */
             CALL       PGM(SAD025S) PARM(&AVD &HOVP &TILP +
                          &LSTP &UTLP &MRKP &DLP)
             /* LASTELISTE       */
             OVRPRTF    FILE(TRANLIST) OUTQ(&LSTP) PAGESIZE(72 130) +
                          CPI(15) OVRFLW(72) FORMTYPE(LASTELISTE)
             CALL       PGM(SAD025T) PARM(&IN01 &IN02 &AVD &TUR &ANT)
             IF         COND(&ANT = '0') THEN(GOTO CMDLBL(ENDPG))
                                                          /**/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGVAR     VAR(&DTA) VALUE(&WS *CAT &USER *CAT &IN39)
             CALL       PGM(QSNDDTAQ) PARM(SAD52PQ *LIBL &LENGTH &DTA)
                                                          /**/

 ENDPG:      RCLRSC
             ENDPGM
