/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 11016 * 01 YBC PTF11 OMBERERING                                         */
/* ********************************************************************    */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('E')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('EXP +
                          FORT  ')
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10)
             CALL       PGM(LOGUSR) PARM(&PGM)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             OVRDBF     FILE(SAEHOPD) TOFILE(SAEH)
/*N01*/      OVRDBF     FILE(SAEHO2) TOFILE(SAEH)
             CALL       PGM(SAD023) PARM(&KODE)
             RCLRSC
             CALL       PGM(SAD52P01) PARM(&PRT1 &PRT2 &PRT3)
             ENDDO

             ENDPGM
