             PGM        PARM(&AVD &TDN &SN)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TDN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

             CLRPFM     FILE(QTEMP/SADHEDI)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(SADHEDI) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             CLRPFM     FILE(QTEMP/SADVEDI)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(SADVEDI) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             CLRPFM     FILE(QTEMP/SADFEDI)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(SADFEDI) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))

             CALL       PGM(SAD016) PARM(&AVD &TDN &SN)

             ENDPGM
