             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('S')
             DCL        VAR(&LIBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DRIFTLIB) TYPE(*CHAR) LEN(10)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&DRIFTLIB)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBR)
             ADDLIBLE   LIB(&LIBR) POSITION(*BEFORE &DRIFTLIB)
             MONMSG     MSGID(CPF2103)
             OVRDBF     FILE(SADTRHUP) TOFILE(SADTRH)
             CALL       PGM(SAD040) PARM(&KODE)
             RMVLIBLE   LIB(&LIBR)
             MONMSG     MSGID(CPF2104)
             ENDDO

             ENDPGM
