             PGM
             DCL        VAR(&DRIFTLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&HISTLIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&DRIFTLIB)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&HISTLIB)
             ADDLIBLE   LIB(&HISTLIB) POSITION(*BEFORE &DRIFTLIB)
             DLTDTAQ    DTAQ(&HISTLIB/SAD52PQ)
             MONMSG     MSGID(CPF0000)
             CRTDTAQ    DTAQ(&HISTLIB/SAD52PQ) MAXLEN(128) +
                          TEXT('SAD EKSPORT, Dataq for +
                          utskriftsprogram') AUT(*ALL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SAD52P)
             ENDPGM
