/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 11016 * 01 YBC PTF11 OMBERERING                                         */
/* ********************************************************************    */
             PGM
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             OVRDBF     FILE(SADHOPD) TOFILE(SADH)
/*N01*/      OVRDBF     FILE(SADHO2) TOFILE(SADH)
             CHGVAR     VAR(&IN01) VALUE('1')
             CALL       PGM(SAD005) PARM(&IN01 &MODE)
             ENDDO

             ENDPGM
