             PGM
             DCL        VAR(&PRTTYP) TYPE(*CHAR) LEN(1) VALUE('P')
             DCL        VAR(&AVD) TYPE(*DEC) LEN(5 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             CALL       PGM(SAD41P) PARM(&PRTTYP &AVD &TDN)
             ENDPGM
