             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LENGTH) TYPE(*DEC) LEN(5 0) VALUE(30)
             DCL        VAR(&DTA) TYPE(*CHAR) LEN(30)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
                                                          /**/
             RTVJOBA    JOB(&WS)
             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGVAR     VAR(&DTA) VALUE(&WS *CAT &USER)
             CALL       PGM(QSNDDTAQ) PARM(SAD41PQ *LIBL &LENGTH &DTA)
             ENDPGM
