             PGM        PARM(&WSIKNKA &WDATOF &WDATOT &WFILNAM)
             DCL        VAR(&WSIKNKA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDATOF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDATOT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WFILNAM) TYPE(*CHAR) LEN(256)

             DLTF       FILE(QTEMP/SAD62AW)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/SAD62BW)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/SAD62CW)
             MONMSG     MSGID(CPF0000)

             CRTDUPOBJ  OBJ(SAD62AW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             CRTDUPOBJ  OBJ(SAD62BW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             CRTDUPOBJ  OBJ(SAD62CW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)

             CALL       PGM(SAD62R3) PARM(&WSIKNKA &WDATOF &WDATOT +
                          &WFILNAM)
             ENDPGM
