             PGM        PARM(&AVD &TDN)
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) /* Avdeling. */
             DCL        VAR(&TDN) TYPE(*CHAR) LEN(7) /* Oppdragsnr. */
             DCL        VAR(&AVD2) TYPE(*DEC) LEN(4 0) /* Avdeling. */
             DCL        VAR(&TDN2) TYPE(*DEC) LEN(7 0) /* +
                          Oppdragsnr. */
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3) VALUE('CHG')
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             RTVDTAARA  DTAARA(*LDA (19 3)) RTNVAR(&SG)
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             CHGVAR     VAR(&AVD2) VALUE(&AVD)
             CHGVAR     VAR(&TDN2) VALUE(&TDN)

             CALL       PGM(SAD061) PARM(&AVD2 &TDN2 &SG &TYPE &WS &MODE)
             RCLRSC
             CALL       PGM(SAD61P01) PARM(&PRT1 &PRT2 &PRT3)

             ENDPGM
