             PGM        PARM(&MBR)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             CALL       PGM(SYSPED/INLIBL)
             CALL         PGM(SADECSV) PARM(&MBR)
             ENDPGM
