             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             ALCOBJ     OBJ((&LIB/SADTRH *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             SNDPGMMSG  MSG('SAD-transitt i drift kan ikke +
                          reorganiseres pga. at noen bruker +
                          SAD-transitt filer.')
             GOTO       CMDLBL(SLUTT)
             ENDDO
             DLCOBJ     OBJ((&LIB/SADTRH *FILE *EXCL))
        /*______________________*/
        /* Reorganisere members */
        /*""""""""""""""""""""""*/
             RGZPFM     FILE(&LIB/SADTRH)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/SADTRV)
             MONMSG     MSGID(CPF2995 CPF2981)
 SLUTT:      ENDPGM
