             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)   TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)    TYPE(*DEC) LEN(6)
             DCL        VAR(&LIBFR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBTO) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBTO)
             OVRDBF     FILE(SADTRH11) TOFILE(&LIBFR/SADTRH11)
             OVRDBF     FILE(SADTRV) TOFILE(&LIBFR/SADTRV)
             OVRDBF     FILE(SADTRCMP) TOFILE(&LIBTO/SADTRCMP)
             CALL       PGM(SADRET2) PARM(&AVD &DT)
             ENDPGM
