             PGM        PARM(&CMD)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(200)
/*           STRPCCMD   PCCMD(&CMD) PAUSE(*YES) */
             STRPCCMD   PCCMD(&CMD) PAUSE(*NO)
             ENDPGM
