             PGM
             DCL        VAR(&FLY) TYPE(*CHAR) LEN(3) VALUE('000')
             DCL        VAR(&EKIM) TYPE(*CHAR) LEN(1) VALUE('E')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(TACTDESI)
             CALL       PGM(SAS070)
             CLRPFM     FILE(AIRLDWRK)
             CPYF       FROMFILE(AIRLD) TOFILE(AIRLDWRK) +
                          MBROPT(*ADD)
             CALL       PGM(SAS021SL) PARM(&FLY &EKIM)
             CALL       PGM(SAS071)   PARM(&EKIM)
             ENDPGM
