             PGM
             DCL        VAR(&FLY) TYPE(*CHAR) LEN(3) VALUE('117')
             DCL        VAR(&EKIM) TYPE(*CHAR) LEN(1) VALUE('I')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SAS021SL) PARM(&FLY &EKIM)
             CALL       PGM(SAS050)
             ENDPGM
