             PGM
             DCL        VAR(&SONE) TYPE(*DEC) LEN(2 0)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(SASDESI)
/* SONE 3 PRISER I SASPRISERA */
             CHGVAR     VAR(&SONE) VALUE(3)
             OVRDBF     FILE(SASPRISER) TOFILE(SASPRISERA)
             CALL       PGM(SAS020) PARM(&SONE)
/* SONE 2 PRISER I SASPRISERB */
             CHGVAR     VAR(&SONE) VALUE(2)
             OVRDBF     FILE(SASPRISER) TOFILE(SASPRISERB)
             CALL       PGM(SAS020) PARM(&SONE)
/* SONE 3 PRISER I SASPRISERC */
             CHGVAR     VAR(&SONE) VALUE(1)
             OVRDBF     FILE(SASPRISER) TOFILE(SASPRISERC)
             CALL       PGM(SAS020) PARM(&SONE)
             CALL       PGM(SAS021CL)
             ENDPGM
