             PGM
             DCL        VAR(&FLY) TYPE(*CHAR) LEN(3) VALUE('117')
             DCL        VAR(&EKIM) TYPE(*CHAR) LEN(1) VALUE('B')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(AIRLDWRK)
             CPYF       FROMFILE(AIRLD) TOFILE(AIRLDWRK) +
                          MBROPT(*ADD)
             CALL       PGM(SAS021SL) PARM(&FLY &EKIM)
             CALL       PGM(SAS021)   PARM(&EKIM)
             ENDPGM
