             PGM        PARM(&LOAD &SOURCE)
             DCL        VAR(&LOAD) TYPE(*CHAR) LEN(63)
             DCL        VAR(&SOURCE) TYPE(*CHAR) LEN(63)
             DCLF       FILE(DOK400)
          /*____________________*/
          /* LEGGER DOKUMENTNAVN I FIL  */
          /*""""""""""""""""""""*/
             DSPFLR     FLR(&SOURCE) TYPE(*DOC) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/DOK400) OUTMBR(*FIRST +
                          *REPLACE)
          /*____________________*/
          /* Les filbeskrivelse */
          /*""""""""""""""""""""*/
 READ:       RCVF       RCDFMT(DOCDTL)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))
             PRTDOC     DOC(&DOCNAM) FLR(&SOURCE) OUTQ(QPRINT) +
                          SAVOUTPUT(*YES) SAVDOC(&DOCNAM) SAVFLR(&LOAD)
             GOTO       CMDLBL(READ)
SLUTT:       ENDPGM
