             PGM
             DCL        VAR(&LOAD) TYPE(*CHAR) LEN(63)
             DCL        VAR(&SOURCE) TYPE(*CHAR) LEN(63)
             DCL        VAR(&LOADF1) TYPE(*CHAR) LEN(20)
             DCL        VAR(&LOADF2) TYPE(*CHAR) LEN(20)
             CHGVAR     VAR(&LOADF1) VALUE('SY400LO')
          /*____________________*/
          /* EDI                */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/edi')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/edi')
             CHGVAR     VAR(&LOADF2) VALUE('edi')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* FAX                */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/fax')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/fax')
             CHGVAR     VAR(&LOADF2) VALUE('fax')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* FELLES             */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/felles')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/felles')
             CHGVAR     VAR(&LOADF2) VALUE('felles')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* FLY                */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/fly')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/fly')
             CHGVAR     VAR(&LOADF2) VALUE('fly')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* LAND               */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/land')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/land')
             CHGVAR     VAR(&LOADF2) VALUE('land')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* LOGI               */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/logi')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/logi')
             CHGVAR     VAR(&LOADF2) VALUE('logi')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* MAINT              */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/maint')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/maint')
             CHGVAR     VAR(&LOADF2) VALUE('maint')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* SADTVINN           */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/sadtvinn')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/sadtvinn')
             CHGVAR     VAR(&LOADF2) VALUE('sadtvinn')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* SALG               */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/salg')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/salg')
             CHGVAR     VAR(&LOADF2) VALUE('salg')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* SJØ                */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/sjØ')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/sjØ')
             CHGVAR     VAR(&LOADF2) VALUE('sjØ')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* TET                */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/tet')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/tet')
             CHGVAR     VAR(&LOADF2) VALUE('tet')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* TRANS              */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&LOAD) VALUE('sy400lo/trans')
             CHGVAR     VAR(&SOURCE) VALUE('sy400/trans')
             CHGVAR     VAR(&LOADF2) VALUE('trans')
             CALL       PGM(SET400B) PARM(&LOAD &SOURCE &LOADF1 +
                          &LOADF2)
          /*____________________*/
          /* Løsning 1 har kun et nivå på loaden. Derfor først litt rydding */
             CHGVAR     VAR(&LOAD) VALUE('ibmfft')
             DLTDLO     DLO(*ALL) FLR(&LOAD)
             MONMSG     MSGID(CPF0000)
             CRTFLR     FLR(&LOAD)
          /* L1 ANLEGG          */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/anlegg')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 BESTILL         */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/bestill')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 FAKTURA         */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/faktura')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 FELLES          */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/felles')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 ORDRE           */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/ordre')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 REGNSKAP        */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/regnskap')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 STATISTIKK      */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/statikk')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
          /* L1 VEDLIKE         */
          /*""""""""""""""""""""*/
             CHGVAR     VAR(&SOURCE) VALUE('ibmhelp/vedlike')
             CALL       PGM(SET400C) PARM(&LOAD &SOURCE)
             ENDPGM
