             PGM        PARM(&HEUR)
             DCL        VAR(&HEUR) TYPE(*CHAR) LEN(3)
             OVRDBF     FILE(HEDUMMU) MBR(&HEUR) OVRSCOPE(*JOB)
             ENDPGM
