/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 TØMME ARBEIDSFIL                                   */
/* ********************************************************************    */
             PGM
          /*_____________________*/
          /* Deklarere Variabler */
          /*"""""""""""""""""""""*/
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
          /*________________________*/
          /* Overstyr til WRK-filer */
          /*""""""""""""""""""""""""*/
             OVRDBF     FILE(HEADF) TOFILE(SIDUPA)
             OVRDBF     FILE(FAKT) TOFILE(SIDUPB)
             OVRDBF     FILE(FAK2) TOFILE(SIDUPB2)
             OVRDBF     FILE(FAK4) TOFILE(SIDUPB4)
             OVRDBF     FILE(TELL) TOFILE(SIDUPC)
          /*____________________*/
          /* Hente Brukerprofil */
          /*""""""""""""""""""""*/
             RTVJOBA    USER(&USER)
          /*________________*/
          /* Starte Program */
          /*""""""""""""""""*/
/*N01*/      CLRPFM     FILE(QTEMP/GSS052F2)
/*N01*/      MONMSG     MSGID(CPF0000)
             CALL       PGM(SI01R) PARM(&USER)
          /*____________________*/
          /* Slette overstyring */
          /*""""""""""""""""""""*/
             DLTOVR     FILE(*ALL)
             ENDPGM
