/* *********************************************************************   */

             PGM        PARM(&UR)
             DCL        VAR(&UR) TYPE(*CHAR) LEN(3)
             OVRDBF     FILE(HEDUMMY) MBR(&UR) OVRSCOPE(*JOB)
 SLUTT:      ENDPGM
