             PGM
          /*_____________________*/
          /* Deklarere Variabler */
          /*"""""""""""""""""""""*/
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
          /*____________________*/
          /* Hente Brukerprofil */
          /*""""""""""""""""""""*/
             RTVJOBA    USER(&USER)
          /*________________*/
          /* Starte Program */
          /*""""""""""""""""*/
             CALL       PGM(SI04R) PARM(&USER)
             ENDPGM
