             PGM
             DCL        VAR(&OPPD) TYPE(*LGL) LEN(1) VALUE('0')
             CALL       PGM(SLPRO2) PARM(&OPPD)
 SLUTT:      ENDPGM
