             PGM
             DCL        VAR(&OPPD) TYPE(*LGL) LEN(1) VALUE('0')
             CALL       PGM(SLPROS) PARM(&OPPD)
             IF         COND(&OPPD = '0') THEN(GOTO CMDLBL(SLUTT))
             SBMJOB     CMD(CALL PGM(SLPROSREO)) JOB(PROSREO) +
                          JOBQ(SYJOBQNMAX)
             SNDPGMMSG  MSG('Jobben er sendt til jobbkø SYJOBQNMAX')
 SLUTT:       ENDPGM
