             PGM        PARM(&FIELD)

             DCL        VAR(&QNAME) TYPE(*CHAR) LEN(10) VALUE(SMA05Q)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE(*LIBL)
             DCL        VAR(&FLDLEN) TYPE(*DEC) LEN(5 0) VALUE(10)
             DCL        VAR(&FIELD) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KEYLEN) TYPE(*DEC) LEN(3 0) VALUE(10)
             DCL        VAR(&KEY) TYPE(*CHAR) LEN(10) VALUE(CB)

             CALL       PGM(QSNDDTAQ) PARM(&QNAME &LIB &FLDLEN +
                          &FIELD &KEYLEN &KEY)

             ENDPGM
