             PGM        PARM(&DATEI &JUL)
             DCL        VAR(&DATEI) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEU) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JUL) TYPE(*CHAR) LEN(3)
/*                 */
/* HENTER DAGNR    */
/*                 */
             RTVJOBA    DATE(&DATEU)
             CHGJOB     DATE(&DATEI)
             CHGJOB     DATFMT(*JUL)
             RTVJOBA    DATE(&DATEN)
             CHGJOB     DATFMT(*SYSVAL)
             CHGJOB     DATE(&DATEU)
             CHGVAR     VAR(&JUL) VALUE(%SST(&DATEN 3 3))
/*                 */
             ENDPGM
