/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NYTT PARAMETER INTEG                               */
/* 11XXX * 02 YBC PTF11 AVSENDERS EPOSTADRESSE.                            */
/* ********************************************************************    */
/*E01+E02*/  PGM        PARM(&KEY2 &WSUSER &WSKDB &WSNAB &WSSTD +
                          &MAILAVS &MAIL1 &MAIL2 &MAIL3 &MAIL4 &MAIL5 +
                          &WSNEDDT &WSSHCO &END &INTEG)
             DCL        VAR(&KEY2) TYPE(*CHAR) LEN(30)
             DCL        VAR(&WSUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WSKDB) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WSNAB) TYPE(*CHAR) LEN(30)
             DCL        VAR(&WSSTD) TYPE(*CHAR) LEN(5)
/*N02*/      DCL        VAR(&MAILAVS) TYPE(*CHAR) LEN(51)
             DCL        VAR(&MAIL1) TYPE(*CHAR) LEN(51)
             DCL        VAR(&MAIL2) TYPE(*CHAR) LEN(51)
             DCL        VAR(&MAIL3) TYPE(*CHAR) LEN(51)
             DCL        VAR(&MAIL4) TYPE(*CHAR) LEN(51)
             DCL        VAR(&MAIL5) TYPE(*CHAR) LEN(51)
             DCL        VAR(&WSNEDDT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WSSHCO) TYPE(*CHAR) LEN(541)
             DCL        VAR(&END) TYPE(*CHAR) LEN(1)
/*N01*/      DCL        VAR(&INTEG) TYPE(*CHAR) LEN(6)
   /*                                                                        */
/*E01+E02*/  SBMJOB     CMD(CALL PGM(SS002PCJ) PARM(&KEY2 &WSUSER +
                          &WSKDB &WSNAB &WSSTD &MAILAVS &MAIL1 &MAIL2 &MAIL3 +
                          &MAIL4 &MAIL5 &WSNEDDT &WSSHCO &END &INTEG)) +
                          JOB(ESPICKLIST)

             DLYJOB     DLY(2)

 SLUTT:      ENDPGM
