             PGM        PARM(&FIL &INT)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(30)
             DCL        VAR(&INT) TYPE(*CHAR) LEN(6)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
/*Variable/param som er spesifike for den jobb genererer spoolfil..*/
             DCL        VAR(&PRTF) TYPE(*CHAR) LEN(10) VALUE('SS182P')

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             CHGVAR     VAR(&STMF) VALUE('/syspeddev/temp/' +
                          *CAT &FIL)

             OVRPRTF    FILE(&PRTF) PAGESIZE(98 152) OVRFLW(92) +
                          FONT(204) OUTQ(SYCGIOUTQ) HOLD(*YES) +
                          SPLFOWN(*JOB)

             CALL       PGM(SS182PR) PARM(&INT)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CVTSPLFPDF SPLF(&PRTF) TOPDF(&STMF) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             ENDPGM
