             PGM        PARM(&TNO &STMF)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TNO) TYPE(*CHAR) LEN(11)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3) VALUE('PRT')
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) VALUE('WEB')
             DCL        VAR(&CPY) TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&UTFAX) TYPE(*CHAR) LEN(1)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

    /* OVERRIDE PRINTERFILE/SKRIV-PACKINGLIST */
             OVRPRTF    FILE(GSS022P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) LPI(6) CPI(15) OVRFLW(70) +
                          OUTQ(SYCGIOUTQ) FORMTYPE(*STD) SPLFOWN(*JOB)

             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             RMVM       FILE(GSS022W) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ADDPFM     FILE(GSS022W) MBR(&UNIK)
             OVRDBF     FILE(GSS022W) TOFILE(GSS022W) MBR(&UNIK)

             CALL       PGM(GSS022R) PARM(&TNO &TYPE &PRT &CPY +
                          &UTFAX &QJOB &QUSER &QNBR)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYGE40) PARM(&INFOP)
/*           IF         COND(&INFOP = 'N') THEN(DO) */
             CHGVAR     VAR(&STMF2) VALUE('/syspeddev/temp/' *CAT +
                          &TNO *CAT '.PDF')
             CHGVAR     VAR(&STMF) VALUE(&STMF2)
             RMVLNK     OBJLNK(&STMF)
             MONMSG     MSGID(CPF0000)
             CVTSPLFPDF SPLF(GSS022P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) TOPDF(&STMF)
/*                        ENDDO      */
/*           IF         COND(&INFOP = 'J') THEN(DO)                     */
/*           CHGVAR     VAR(&FILEN) VALUE('GSS023P')                    */
/*           CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +  */
/*                        &STMF)                        */
/*                        ENDDO                         */
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             DLTSPLF    FILE(GSS022P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
