             PGM
             DCL        VAR(&PRTDEV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&POLL) TYPE(*CHAR) LEN(4)
             CALL       PGM(SYSPED/INLIBL)
             RTVDTAARA  DTAARA(IFAX (1 10)) RTNVAR(&PRTDEV)
             RTVDTAARA  DTAARA(IFAX (10 4)) RTNVAR(&POLL)
             SBMJOB     CMD(CALL PGM(FAXPRT) PARM(&PRTDEV &POLL)) +
                          JOB(PRINTFAX) JOBQ(QFAX/QFAXJOBQ)
             ENDPGM
