 /*          PGM        PARM(&AVD &OPD &FBNR &TER &USER &DATI)  */
             PGM        PARM(&AVD &OPD &FBNR &TER &FUNK &TIM &USER &DATI)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FBNR) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TER) TYPE(*CHAR) LEN(5)
             DCL        VAR(&FUNK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TIM) TYPE(*CHAR) LEN(2)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATI) TYPE(*CHAR) LEN(14)

             SBMJOB     CMD(CALL PGM(STSCDIR2R) PARM(&AVD &OPD &FBNR +
                          &TER &FUNK &TIM &USER &DATI)) +
                          JOB(STSCDIROPD) JOBQ(SYJOBQNMAX)
 SLUTT:      ENDPGM
