             PGM        PARM(&STAT &TYPE &PRO &PRT &USR)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(5)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)

             OVRPRTF    FILE(STSF06P) PAGESIZE(70 80) OVRFLW(65) +
                          OUTQ(&PRT)
             CALL       PGM(STSF06R) PARM(&STAT &TYPE &PRO &USR)

             ENDPGM
