             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1) VALUE('0')

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)

             DLTDTAQ    DTAQ(SVE000DQ)
             MONMSG CPF0000

             IF         COND(&IN01 = '0') THEN(DO)

             CALL       PGM(SVT062R) PARM(&OK)
             IF         COND(&OK = '1') THEN(DO)
             CALL       PGM(SVE000R)
             ENDDO

             ENDDO

             ENDPGM
