             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
             CALL       PGM(SVG140R) PARM(&WMN1)
             ENDPGM
