             PGM        PARM(&EPOST)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* UNIKKODE */
             DCL        VAR(&QRYF) TYPE(*CHAR) LEN(10) +
                          VALUE('SVG511W   ')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDFSE ')
             DCL        VAR(&SEL) TYPE(*CHAR) LEN(4) VALUE('*NO ')
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TMPFIL) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TMPF10) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STMFIL) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(15)
             DCL        VAR(&FLR) TYPE(*CHAR) LEN(10) VALUE(QPGMR)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             /* UNIKE FILNAVN           */
             CHGVAR     VAR(&TMPFIL) VALUE('W' *CAT &QNBR)
             CHGVAR     VAR(&TMPF10) VALUE(&TMPFIL)
             CHGVAR     VAR(&STMF) VALUE(&TMPFIL *CAT '.CSV')
             CHGVAR     VAR(&STMFIL) VALUE('/QDLS/QPGMR/' *CAT &STMF)
             /* KJØR QUERYIER UANSETT  */
                          RUNQRY     QRY(*NONE) QRYFILE((&LIB/&QRYF)) +
                                       OUTTYPE(*OUTFILE) RCDSLT(&SEL) +
                                       OUTFILE(QTEMP/&TMPFIL *FIRST *RPLFILE) +
                                       AUT(*ALL)
             /* LAG FELTBESKRIVELSE                       */
                          CALL       PGM(SYGE28CL) PARM(&TMPF10)
             /* START SEMIKOLON-SEPARERT                       */
             CPYTOIMPF  FROMFILE(TMP4096) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*COMMA)

                          CPYTOIMPF  FROMFILE(QTEMP/&TMPFIL) TOSTMF(&STMFIL) +
                                       MBROPT(*ADD) STMFCODPAG(*PCASCII) +
                                       RCDDLM(*CRLF) FLDDLM(';') DECPNT(*COMMA)
             /* SEND FILA SOM EPOST */
                         SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD('Tulljo +
                                       urnal') MSG('Tulljournal') +
                          DOC(&STMF) FLR(&FLR)
             ENDPGM
