             PGM PARM(&PRT)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             RMVLNK     OBJLNK('/HOME/CB/MYPDFFILE.PDF')
             MONMSG     MSGID(CPF0000)
             OVRPRTF    FILE(SVI006P) DEVTYPE(*AFPDS) PAGESIZE(105 +
                          80) CPI(10) OVRFLW(103) FRONTOVL(SVI38 +
                          0.30 0.44) OUTQ(OUTMAIL) +
                          TOSTMF('/HOME/CB/MYPDFFILE.PDF') +
                          WSCST(*PDF) OVRSCOPE(*JOB)
             ENDPGM
