             PGM        PARM(&UORG &UKVART &UNAMN &UTEL &UEPOST +
                          &UDATOF &UDATOT)
             DCL        VAR(&UORG) TYPE(*CHAR) LEN(12)
             DCL        VAR(&UKVART) TYPE(*CHAR) LEN(4)
             DCL        VAR(&UNAMN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&UTEL) TYPE(*CHAR) LEN(15)
             DCL        VAR(&UEPOST) TYPE(*CHAR) LEN(40)
             DCL        VAR(&UDATOF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&UDATOT) TYPE(*CHAR) LEN(8)
             DLTF       FILE(QTEMP/Q)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(QTEMP/Q) RCDLEN(256)
             CALL       PGM(SVI202R) PARM(&UORG &UKVART &UNAMN &UTEL +
                          &UEPOST &UDATOF &UDATOT)
             CPYTOSTMF  FROMMBR('QSYS.LIB/QTEMP.LIB/Q.FILE/Q.MBR') +
                          TOSTMF('SYSPEDF/TDS/SVIISEK.CSV') +
                          STMFOPT(*REPLACE) STMFCODPAG(*STDASCII)
             CHGAUT     OBJ('SYSPEDF/TDS/SVIISEK.CSV') USER(*PUBLIC) +
                          DTAAUT(*RWX) OBJAUT(*ALL)
ENDPGM
