             PGM        PARM(&PRT)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             OVRPRTF    FILE(SVL006P) DEVTYPE(*AFPDS) PAGESIZE(105 +
                          80) LPI(9) CPI(10) OVRFLW(103) +
                          FRONTOVL(SVI16 0.0 0.15) OUTQ(&PRT) +
                          OVRSCOPE(*JOB)
             ENDPGM
