             PGM        PARM(&AVD &TDN &PRO &SG &TYPE &FLAGG)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&PRO) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
                                                          /**/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
                                                          /**/
             CALL       PGM(SVX011R) PARM(&AVD &TDN &PRO &SG &TYPE +
                          &WS &FLAGG)
             ENDPGM
