             PGM        PARM(&TYPE)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3) VALUE('000')
             OVRDBF     FILE(SVXKODLUP) TOFILE(SVXKODL01)
             CALL       PGM(SVX001R) PARM(&TYPE)
             ENDPGM
