/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SLETT DATAKØ SVX060DQ                              */
/* ********************************************************************    */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('TET-IMPORT')
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1) VALUE('0')

             CALL       PGM(LOGUSR) PARM(&PGM)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)

             CALL       PGM(SVT062R) PARM(&OK)
             IF         COND(&OK = '1') THEN(DO)
/*N01*/      DLTDTAQ    DTAQ(QTEMP/SVX060DQ)
/*N01*/      MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(SVNHOPD) TOFILE(SVNH)
             CALL       PGM(SVX060R)
             RCLRSC
             ENDDO

             ENDDO

             ENDPGM
