             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)

             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('    ')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '0') THEN(DO)
             CALL       PGM(SVX030R)
             ENDDO

             ENDPGM
