             PGM        PARM(&WS)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Avd+Tdn */
             RTVJOBA    USER(&USER)
             CALL       PGM(SVX157R) PARM(&USER &WS)
 END:        ENDPGM
