             PGM        PARM(&JOB)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ACT) TYPE(*CHAR) LEN(1)  VALUE(' ')
             CALL       PGM(SY400ACT) PARM(&JOB &ACT)
             SNDPGMMSG     MSG(&ACT)
             ENDPGM
