             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, AVBRYT PROGRAM               -
    /* */
             DCL        VAR(&TURNR) TYPE(*DEC)  LEN(8 0) VALUE(0)
             DCL        VAR(&AGENT) TYPE(*DEC)  LEN(8 0) VALUE(0)
             DCL        VAR(&FRA)   TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&PROG)  TYPE(*CHAR) LEN(2) VALUE('02')
             DCL        VAR(&PPRT) TYPE(*CHAR) LEN(10) +
                          VALUE('          ') /*   PRINTER    */
             DCL        VAR(&PPRTP) TYPE(*CHAR) LEN(10) +
                          VALUE('          ') /*   PRINTER    */
    /* */
    /* HENTE OPPLYSNINGER OM HVOR UTSKRIFT ØNSKES */
    /* */
             CALL       PGM(SYAMDK) PARM(&IN01 &PPRT &PPRTP &PROG)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* UTSKRIFT AV AMETASKJEMA */
    /* */
             OVRPRTF    FILE(SYAM02PF) OUTQ(&PPRT) PAGESIZE(48 180) +
                          CPI(15) OVRFLW(46) +
                          FORMTYPE(*STD)
             OVRPRTF    FILE(SYAM02P2) PAGESIZE(72 120) CPI(15) +
                          OVRFLW(66) PAGRTT(0) OUTQ(&PPRT) +
                          FORMTYPE(*STD)
    /* */
             CALL       PGM(SYAM02) PARM(&TURNR &AGENT &FRA)
 SLUTT:      ENDPGM
