             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1) VALUE('0') /* +
                          Hvis '1', skal skrive kopifaktura. */
             DCL        VAR(&MSGTXT) TYPE(*CHAR) LEN(12) /* +
                          Meldingtekst */
    /* */
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
             CALL       PGM(SYAMSA) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* UTSKRIVE FAKTURA */
             CALL       PGM(SYAM27CLJ) PARM(&KOPI &MSGTXT)
             SNDPGMMSG  MSGID(DIV0341) MSGF(SYMSGF) MSGDTA(&MSGTXT)
             GOTO       SLUTT
    /* */
                                                          /**/
 SLUTT:      ENDPGM
