             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* ARB.STASJ*/
             RTVJOBA    JOB(&WS)                /* Hente arbeidstsjonskode WS */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
           /* BLANK ARBEIDSFIL ELLER                        */
           /* LEGG TIL NYTT MEMBER (FÅR DATO)               */
             CLRPFM     FILE(AMDEWRK) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(AMDEWRK) +
                          MBR(&WS))
           /* OVERRIDE FILE TIL MEMBER (=DSPSTN NAVN.) */
             OVRDBF     FILE(AMDEWRK) TOFILE(AMDEWRK) MBR(&WS)
             CALL       PGM(SYAM01)
             DLTOVR     FILE(*ALL)
 SLUTT:      ENDPGM
