             PGM        PARM(&PPRT &P1FAVD &P1TAVD &P1FDAT &P1TDAT +
                          &P1AGNT &P1STAT)
    /* */
             DCL        VAR(&PPRT) TYPE(*CHAR) LEN(10) /* PRINTER */
             DCL        VAR(&P1FAVD) TYPE(*CHAR) LEN(4) +
                          VALUE('0000') /*   AVDELING FRA */
             DCL        VAR(&P1TAVD) TYPE(*CHAR) LEN(4) +
                          VALUE('0000') /*   AVDELING TIL */
             DCL        VAR(&P1FDAT) TYPE(*CHAR) LEN(6) +
                          VALUE('000000') /*   FOM DATO   */
             DCL        VAR(&P1TDAT) TYPE(*CHAR) LEN(6) +
                          VALUE('000000') /*  TOM DATO   */
             DCL        VAR(&P1AGNT) TYPE(*CHAR) LEN(8) +
                          VALUE('00000000') /*   AGENTNR    */
             DCL        VAR(&P1STAT) TYPE(*CHAR) LEN(1) +
                          VALUE(' ')        /*   STATUSR    */
    /* */
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* ARB.STASJ*/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             CLRPFM     FILE(AMTURWRK) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(AMTURWRK) +
                          MBR(&WS))
             OVRDBF     FILE(AMTURWRK) TOFILE(AMTURWRK) MBR(&WS)
    /* */
             CALL       PGM(SYAM10) PARM(&P1FAVD &P1TAVD +
                          &P1FDAT &P1TDAT &P1AGNT &P1STAT)
    /* */
             OVRPRTF    FILE(SYAM11PF) OUTQ(&PPRT) PAGESIZE(72 80) +
                          OVRFLW(70) PRTQLTY(*DRAFT)
    /* */
             CALL       PGM(SYAM11)
    /* */
             DLTOVR     FILE(*ALL)
    /* */
 SLUTT:      ENDPGM
