             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
                       /* Hvis &in01 på, AVBRYT PROGRAM */
    /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             CALL       PGM(SYAM90)
    /* */
 SLUTT:      ENDPGM
