             PGM        PARM(&PPARM &PRINTE &HOLD &BEVAR &ANT &FFDATO)
             DCL        VAR(&PPARM) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PRINTE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BEVAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FFDATO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PRØVE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&UTSNR) TYPE(*DEC) LEN(3 0) VALUE(040)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             CALL       PGM(GETPRT) PARM(&AVD &UTSNR &PRINTE &FORM)

/* SPLITT UT KODE FOR PRØVEKJØRING MM.(SISTE) FRA PPARM */
/* HVIS FRA GODSLISTE HOPP OVER PRINTERSTYRINGSBILDE    */
             CHGDTAARA  DTAARA(*LDA (1001 20)) VALUE(&PPARM)
             RTVDTAARA  DTAARA(*LDA (1020 1)) RTNVAR(&PRØVE)
             IF         COND(&PRØVE = 'G') THEN(GOTO CMDLBL(PRINT))

             CALL       PGM(SYAVIN) PARM(&PRINTE &BEVAR &HOLD &ANT +
                          &AVS &FFDATO)
             IF         COND(&AVS = 'J') THEN(GOTO CMDLBL(SLUTT))

 PRINT:      SBMJOB     CMD(CALL PGM(SYAV02CJ) PARM(&PPARM &PRINTE +
                          &FORM &HOLD &BEVAR &ANT &FFDATO)) +
                          JOB(AVRUTSKR) JOBQ(SYJOBQPRT)

 SLUTT:      ENDPGM
