/* INTERSPED - REN SPESIAL */
             PGM        PARM(&AVD &TUR)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             SBMJOB     CMD(CALL PGM(SYAVLACLJ) PARM(&AVD &TUR)) +
                          JOB(AVLASTEL) JOBD(*USRPRF) JOBQ(SYJOBQPRT)
             ENDPGM
