             PGM
             DCL        VAR(&PRINTE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BEVAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ANT) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&AVS) TYPE(*CHAR) LEN(1)
             CALL       PGM(SYAVIN) PARM(&PRINTE &BEVAR &HOLD &ANT +
                          &AVS)
             IF         COND(&AVS = 'J') THEN(GOTO CMDLBL(SLUTT))
             OVRPRTF    FILE(SYAV01PF) OUTQ(&PRINTE) COPIES(&ANT) +
                          HOLD(&HOLD) SAVE(&BEVAR)
             OVRPRTF    FILE(SYAV01PA) OUTQ(&PRINTE) COPIES(&ANT) +
                          HOLD(&HOLD) SAVE(&BEVAR)
             CALL       PGM(SYAV11)
SLUTT:       ENDPGM
