             PGM        PARM(&PPARM &PRINTE &FORM &HOLD &BEVAR &ANT +
                          &FFDATO)
             DCL        VAR(&PPARM) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PRINTE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BEVAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AANT) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&FFDATO) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&AANT) VALUE(&ANT)
             OVRPRTF    FILE(SYAV02PF) OUTQ(&PRINTE) COPIES(&AANT) +
                          HOLD(&HOLD) SAVE(&BEVAR) FORMTYPE(&FORM)
             OVRPRTF    FILE(SYAV02PA) OUTQ(&PRINTE) COPIES(&AANT) +
                          HOLD(&HOLD) SAVE(&BEVAR) FORMTYPE(&FORM)
             OVRDBF     FILE(WAVREGN) TOFILE(WAVREGN) FRCRATIO(1)
             MONMSG     MSGID(CPF0000)

             CALL       PGM(SYAV02) PARM(&PPARM &FFDATO)
SLUTT:       ENDPGM
