             PGM        PARM(&BRUKER)
             DCL        VAR(&BRUKER)   TYPE(*CHAR)  LEN(10)
             RTVUSRPRF  RTNUSRPRF(&BRUKER)
             ENDPGM
