/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SYFA55PF OG SYFA55CP                               */
/* ********************************************************************    */
/* SKRIV GODSLISTE SAMT FORELØPIG AVR.SPESIFIKASJON  */
/* BASERT PÅ F-TAST(F9) I TURBILDET (TURENS INNHOLD) */
             PGM        PARM(&AVD &TUR)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&UDSFAX) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&AGN) TYPE(*CHAR) LEN(8) VALUE('00000000')
             DCL        VAR(&BELJN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DADRJN) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PRTNR) TYPE(*DEC) LEN(3 0) VALUE(022)
    /* */
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til stående GODSliste. */
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til stående GODSliste. */
    /* */
    /*VENT I 60 SEK. SLIK AT OPPDRAG PÅ TUREN ER REBEREGNET(SYEX88Q) */
             DLYJOB     DLY(60)
    /* */
             CALL       PGM(GETPRT) PARM(&AVD &PRTNR &PRT1 &PT1)
/*S01        OVRPRTF    FILE(GODSLIST) OUTQ(&PRT1) PAGESIZE(72 120) +
                          CPI(15) OVRFLW(64) FORMTYPE(&PT1)           */
/*N01*/      OVRPRTF    FILE(SYFA55PF) PAGESIZE(72 120) CPI(15) +
                          OVRFLW(64) OUTQ(&PRT1) FORMTYPE(&PT1)
/*N01*/      CHGVAR     VAR(&PRTNR) VALUE(024)
/*N01*/      CALL       PGM(GETPRT) PARM(&AVD &PRTNR &PRT1 &PT1)
/*N01*/      OVRPRTF    FILE(SYFA55CP) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(72) PAGRTT(0) OUTQ(&PRT1) +
                          FORMTYPE(&PT1)
    /* ----------------------------------------------------------- */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)


    /* SKRIVER UT GODSLISTE */
             CHGDTAARA  DTAARA(*LDA (501 1)) VALUE('J') /*INT*/
             CALL       PGM(SYFA55) PARM(&AVD &TUR &AGN &BELJN +
                          &UDSFAX &DADRJN) /*E01*/
             CHGDTAARA  DTAARA(*LDA (501 1)) VALUE(' ') /*INT*/

    /* SKRIVER UT "PRØVEUT.SKRIFT" SPESIFIKASJON */
             CALL       PGM(SYAV02T) PARM(&AVD &TUR &PRT1)

             ENDPGM
