             PGM
             DCL        VAR(&INNPR) TYPE(*CHAR) LEN(5) VALUE('IN3PR') +
                          /* INNPR = fly-innland. IN3PR = BRAATHEN. */
    /* */
    /* VEDLIKEHOLD AV FLYFRAKTRATER JETPAKKE */
             CALL       PGM(SYFI02) PARM(&INNPR)
    /* */
             ENDPGM
