             PGM
             DCL        VAR(&KOPI) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &KOPI = 1, betyr det kopiering av +
                          flyfraktbrev-eksport. */
             CALL       PGM(SYEFFRCL) PARM(&KOPI)
             ENDPGM
