             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('1') /* +
                          Hvis &in01 av, betyr programer skal +
                          vedlikeholde samlastavganger. Ellers skal +
                          spørre på samlastavganger.  */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYEX01) PARM(&IN01)
             ENDPGM
