             PGM        PARM(&IN07 &IN08)
             DCL        VAR(&UFAX) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1)
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1)
             DCL        VAR(&PRT18) TYPE(*CHAR) LEN(10) /* +
                          Printernavn til manifest. */
             DCL        VAR(&PT18) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til manifest. */
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
    /* */
             RTVDTAARA  DTAARA(*LDA (681 10)) RTNVAR(&PRT18)
             RTVDTAARA  DTAARA(*LDA (691 10)) RTNVAR(&PT18)
             RTVJOBA    NBR(&JOBN)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &JOBN)
    /* */
    /* SKRIVER UT MANIFEST */
             OVRPRTF    FILE(SYEF30P) OUTQ(&PRT18) PAGESIZE(72 80) +
                          CPI(10) OVRFLW(64) FORMTYPE(&PT18) COPIES(2)
             RMVM       FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7306)
             OVRDBF     FILE(SUMMAN) TOFILE(SUMMAN) MBR(&UNIK)
             RMVM       FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7306)
             OVRDBF     FILE(SUMMAN) TOFILE(SUMMAN) MBR(&UNIK)
             RMVM       FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(SUMMAN) MBR(&UNIK)
             MONMSG     MSGID(CPF7306)
             OVRDBF     FILE(SUMMAN) TOFILE(SUMMAN) MBR(&UNIK)
             CALL       PGM(SYEK30) PARM(&IN07 &IN08 &PRANT &UFAX)
             RMVM       FILE(SUMMAN) MBR(&UNIK)
             SNDPGMMSG  MSG(' ' *BCAT &PRANT *BCAT 'manifest er klare +
                          til utskrift på skriver ' *BCAT &PRT18 +
                          *BCAT '.') MSGTYPE(*INFO)
    /* */
             ENDPGM
