             PGM
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(2)  VALUE('SY')
             DCL        VAR(&KUND) TYPE(*DEC) LEN(8 0) VALUE(1)
             DCL        VAR(&LAND) TYPE(*CHAR) LEN(2)  VALUE('DE')
             DCL        VAR(&STED) TYPE(*CHAR) LEN(5)  VALUE('HAM  ')
             DCL        VAR(&DELSY) TYPE(*CHAR) LEN(1) VALUE(' ')
                                                          /**/
             CALL       PGM(SYEF05) PARM(&FIRM &KUND &DELSY &LAND &STED)
             ENDPGM
