             PGM
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
    /* */
             CALL       PGM(SYEK40) PARM(&AVD &OPD)
    /* */
             ENDPGM
