             PGM
             DCL        VAR(&LK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PLUKK) TYPE(*CHAR) LEN(1) VALUE('N')
             CALL       PGM(SYEX05) PARM(&LK &PLUKK)
             ENDPGM
