             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
                                                          /**/
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
                                                          /**/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             CLRPFM     FILE(WFILHEAD) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(WFILHEAD) +
                          MBR(&WS))
             OVRDBF     FILE(WFILHEAD) TOFILE(WFILHEAD) MBR(&WS)
             OVRPRTF    FILE(SYFA03P) PAGESIZE(48 132) OVRFLW(46) +
                          OUTQ(*DEV)
             CALL       PGM(SYFA03)
             DLTOVR     FILE(WFILHEAD)
             CLRPFM     FILE(WFILHEAD) MBR(&WS)
                                                          /**/
 SLUTT:      ENDPGM
