/*  RETTET OVERFLOW PÅ SYFA27PS FRA 58->54                */
/*  BYTTET GETPR2 MED GETPRN FOR DRAWER OG ANTAL.L KOPIER */
/*  KODE F GÅR SOM P                                      */
             PGM
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&FAKTS) TYPE(*DEC) LEN(3 0) VALUE(073)
             DCL        VAR(&FAKTL) TYPE(*DEC) LEN(3 0) VALUE(019)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, AVBRYT PROGRAM               -
        */
             DCL        VAR(&P1) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P1E) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P1S) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P2) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&P3) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P4) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P5) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P6) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P7) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&P8) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&P9) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til fakturaer. */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype til +
                          fakturaer. */
             DCL        VAR(&PRTS) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til fakturaer SJØ */
             DCL        VAR(&PTS) TYPE(*CHAR) LEN(10) /* Papirtype til+
                          fakturaer SJØ */
             DCL        VAR(&PRTPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PTPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(10) /* Unikkode +
                          til register SORT. */
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(9)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&GIRO) TYPE(*DEC) LEN(3 0) VALUE(027)
             DCL        VAR(&FAKT) TYPE(*DEC) LEN(3 0) VALUE(004)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&GIRON) TYPE(*CHAR) LEN(10)
             DCL        VAR(&GIROP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LTYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI) TYPE(*DEC) LEN(2 0) VALUE(06)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LPP) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&LPS) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&PRTPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PTPP) TYPE(*CHAR) LEN(10)
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
    /* */
             DLTOVR     FILE(*ALL) LVL(*JOB)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
    /*    FOR Å HENTE TURNR               */
             CALL       PGM(SYFABK) PARM(&IN01 &P3)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* */
    /* TESTER LASER OG LPI                   */
    /* */
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             CALL       PGM(GETPRT) PARM(&AVD &GIRO &GIROP &GIRON)

    /*-------------------------------------- */
    /* SETTER LPI TIL 08                     */
    /*-------------------------------------- */
             IF         COND(&LPI2 = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE(096)
             CHGVAR     VAR(&LPI) VALUE(08)
             ENDDO
    /*----------------------------------------- */
    /* SETTEL ANTALL LINJER TIL 70/93 VED LASER */
    /*----------------------------------------- */
             IF         COND(&LASER = 'J') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('070')
             CHGVAR     VAR(&LPS) VALUE('070')
             IF         COND(&LPI = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('093')
             ENDDO
             ENDDO
    /*----------------------------------------- */
    /* SETTEL ANTALL LINJER TIL 70/93 VED LASER */
    /*----------------------------------------- */
             IF         COND(&LASER = 'A') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('070')
             CHGVAR     VAR(&LPS) VALUE('070')
             IF         COND(&LPI = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('093')
             ENDDO
             ENDDO
    /*                                    */

    /* */
    /* SKRIVER UT FAKTURAKOPI             */
    /*                                    */
             RTVDTAARA  DTAARA(*LDA (681 10)) RTNVAR(&PRT)
             RTVDTAARA  DTAARA(*LDA (691 10)) RTNVAR(&PT)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&PRTPP)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&PTPP)
             RTVDTAARA  DTAARA(*LDA (961 10)) RTNVAR(&PRTS)
             RTVDTAARA  DTAARA(*LDA (971 10)) RTNVAR(&PTS)
             RTVDTAARA  DTAARA(*LDA (81 1)) RTNVAR(&LTYPE)
             RTVDTAARA  DTAARA(*LDA (48 1)) RTNVAR(&TYPE)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
    /* */
    /**************************************/
    /* START FOR IKKE PDF DOKUMENTER      */
    /**************************************/
             IF         COND(&LASER *NE 'P') THEN(DO)

    /*---------------------------------------*/
    /* STANDARDFAKTURA LAND/FLY              */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             CALL       PGM(GETPRT) PARM(&AVD &GIRO &GIROP &GIRON)
             OVRPRTF    FILE(FAKTURA) PAGESIZE(72 85) CPI(10) +
                          OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT)
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF FILE(SYFA20P) +
                          DEVTYPE(*IPDS) PAGESIZE(&LPP 80) +
                          LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) FONT(011) +
                          CHRID(590 340) FRONTOVL(&LOGO) OUTQ(&PRT) +
                          FORMTYPE(&PT))
             ELSE       CMD(OVRPRTF FILE(SYFA20P) DEVTYPE(*SCS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT))
    /*---------------------------------------*/
    /* STANDARDFAKTURA SJØ                   */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTS &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PS) PAGESIZE(96 80) CPI(10) +
                          OVRFLW(96) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRTS) FORMTYPE(&PTS))
             ELSE       CMD(OVRPRTF FILE(SYFA20PS) PAGESIZE(72 80) +
                          LPI(6) CPI(10) OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRTS) FORMTYPE(&PTS))
             OVRPRTF    FILE(SYFA20PT) PAGESIZE(&LPP 80) LPI(&LPI) +
                          CPI(10) OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRTS) FORMTYPE(&PTS)
             OVRPRTF    FILE(SYFA20PD) PAGESIZE(96 80) CPI(10) +
                          OVRFLW(96) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT)
    /*---------------------------------------*/
    /* FRITTSTÅENDE GIRO                     */
    /*---------------------------------------*/
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA20PG) OUTQ(&GIROP) DEVTYPE(*IPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          FONT(011) CHRID(590 340) +
                          FORMTYPE(&GIRON))
             ELSE       CMD(OVRPRTF FILE(SYFA20PG) OUTQ(&GIROP) +
                          DEVTYPE(*SCS) PAGESIZE(24 80) CPI(10) +
                          OVRFLW(24) FORMTYPE(&GIRON))
             CALL       PGM(GETPRN) PARM(&AVD &FAKTL &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
    /*---------------------------------------*/
    /* SAMLEFAKTURA-LISTE                    */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTL &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             OVRPRTF    FILE(SYFA27PP) PAGESIZE(70 80) CPI(10) +
                          OVRFLW(66) DRAWER(&DRAWER) +
                          FRONTOVL(&LOGO) OUTQ(&PRTPP) +
                          FORMTYPE(&PTPP) /* Pirnterfil av +
                          samlefaktura liste */
             ENDDO
    /*                                    */
    /* SLUTT PÅ IKKE PDF                  */
    /*                                    */
    /*                                    */
    /* START FOR PDF DOKUMENTER           */
    /*                                    */
             IF         COND(&LASER = 'P') THEN(DO)
    /*---------------------------------------*/
    /* STANDARDFAKTURA LAND/FLY              */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
    /* */
             OVRPRTF    FILE(FAKTURA) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          85) CPI(10) OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FNTCHRSET(*LIBL/C0D0GT10 +
                          *LIBL/T1V10277) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT)
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF FILE(SYFA20P) +
                          DEVTYPE(*AFPDS) PAGESIZE(&LPP 80) +
                          LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) FONT(011) +
                          CHRID(590 340) FRONTOVL(&LOGO) OUTQ(&PRT) +
                          FORMTYPE(&PT))
             ELSE       CMD(OVRPRTF FILE(SYFA20P) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          FRONTMGN(0.2 0.1) OVRFLW(&LPP) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          FRONTOVL(&LOGO) OUTQ(&PRT) FORMTYPE(&PT))
    /*---------------------------------------*/
    /* STANDARDFAKTURA SJØ                   */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTS &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(96 80) CPI(10) OVRFLW(96) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          FRONTOVL(&LOGO) OUTQ(&PRTS) FORMTYPE(&PTS))
             ELSE       CMD(OVRPRTF FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 80) LPI(6) CPI(10) FRONTMGN(0 +
                          0.1) OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FNTCHRSET(*LIBL/C0D0GT10 +
                          *LIBL/T1V10277) FRONTOVL(&LOGO) +
                          OUTQ(&PRTS) FORMTYPE(&PTS))
             OVRPRTF    FILE(SYFA20PT) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          FRONTOVL(&LOGO) OUTQ(&PRTS) FORMTYPE(&PTS)
             OVRPRTF    FILE(SYFA20PD) DEVTYPE(*AFPDS) PAGESIZE(96 +
                          80) CPI(10) FRONTMGN(0 0.1) OVRFLW(96) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          FRONTOVL(&LOGO) OUTQ(&PRT) FORMTYPE(&PT)
    /*---------------------------------------*/
    /* FRITTSTÅENDE GIRO                     */
    /*---------------------------------------*/
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA20PG) DEVTYPE(*AFPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          FONT(011) CHRID(590 340) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          OUTQ(&GIROP) +
                          FORMTYPE(&GIRON))
             ELSE       CMD(OVRPRTF FILE(SYFA20PG) DEVTYPE(*AFPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          OUTQ(&GIROP) FORMTYPE(&GIRON))
    /*---------------------------------------*/
    /* SAMLEFAKTURA-LISTE                    */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTL &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             OVRPRTF    FILE(SYFA27PP) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) CPI(10) FRONTMGN(0 0.1) OVRFLW(66) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FNTCHRSET(*LIBL/C0D0GT10 *LIBL/T1V10277) +
                          FRONTOVL(&LOGO) OUTQ(&PRTPP) +
                          FORMTYPE(&PTPP) /* Pirnterfil av +
                          samlefaktura liste */
             ENDDO
    /*                                    */
    /* SLUTT PÅ  PDF                      */
    /*                                    */


    /*    - OGSÅ KOPI AV SAMLEFAKTURA KAN SKRIVES FRA SYFA20 */
    /*------------------------------------*/
    /* START FOR IKKE PDF DOKUMENTER      */
    /*------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             IF         COND(&LASER *NE 'P') THEN(DO)
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA27PF) DEVTYPE(*IPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FONT(011) CHRID(590 340) +
                          FRONTOVL(&LOGO) OUTQ(&PRT) FORMTYPE(&PT))
             IF         COND(&TYPE *NE B) THEN(OVRPRTF +
                          FILE(SYFA27PF) DEVTYPE(*SCS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT))
    /*---------------------------------------*/
    /* SAMLEFAKTURA-SPESIFIKASJON            */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTL &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             OVRPRTF    FILE(SYFA27PS) PAGESIZE(&LPS 80) CPI(10) +
                          OVRFLW(54) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(0) FRONTOVL(&LOGO) +
                          OUTQ(&PRTPP) FORMTYPE(&PTPP) SHARE(*YES) +
                          /* Pirnterfil av samlefaktura liste */
    /*---------------------------------------*/
    /* FRITTSTÅENDE GIRO                     */
    /*---------------------------------------*/
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA27PG) OUTQ(&GIROP) DEVTYPE(*IPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          FONT(011) CHRID(590 340) +
                          FORMTYPE(&GIRON))
             ELSE       CMD(OVRPRTF FILE(SYFA27PG) OUTQ(&GIROP) +
                          DEVTYPE(*SCS) PAGESIZE(24 80) CPI(10) +
                          OVRFLW(24) FORMTYPE(&GIRON))
             ENDDO
    /*                                    */
    /* SLUTT PÅ IKKE PDF                  */
    /*                                    */
    /*                                    */
    /* START FOR PDF DOKUMENTER           */
    /*                                    */
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             IF         COND(&LASER = 'P') THEN(DO)
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA27PF) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FONT(011) CHRID(590 340) +
                          FRONTOVL(&LOGO) OUTQ(&PRT) FORMTYPE(&PT))
             IF         COND(&TYPE *NE B) THEN(OVRPRTF +
                          FILE(SYFA27PF) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT))
    /*---------------------------------------*/
    /* SAMLEFAKTURA-SPESIFIKASJON            */
    /*---------------------------------------*/
             CALL       PGM(GETPRN) PARM(&AVD &FAKTL &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*---------------------------------------*/
       /* LASER TYPE F GÅR SOM P             */
       /*---------------------------------------*/
                IF         COND(&LASER *EQ 'F') THEN(CHGVAR VAR(&LASER) +
                             VALUE('P'))
             OVRPRTF    FILE(SYFA27PS) DEVTYPE(*AFPDS) PAGESIZE(&LPS +
                          80) CPI(10) OVRFLW(54) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(0) FRONTOVL(&LOGO) +
                          OUTQ(&PRTPP) FORMTYPE(&PTPP) SHARE(*YES) +
                          /* Pirnterfil av samlefaktura liste */
    /*---------------------------------------*/
    /* FRITTSTÅENDE GIRO                     */
    /*---------------------------------------*/
             IF         COND(&TYPE *EQ B) THEN(OVRPRTF +
                          FILE(SYFA27PG) DEVTYPE(*AFPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          FONT(011) CHRID(590 340) OUTQ(&GIROP) +
                          FORMTYPE(&GIRON))
             ELSE       CMD(OVRPRTF FILE(SYFA27PG) DEVTYPE(*AFPDS) +
                          PAGESIZE(24 80) CPI(10) OVRFLW(24) +
                          OUTQ(&GIROP) +
                          FORMTYPE(&GIRON))
             ENDDO
    /* */
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TIME)
    /*                                    */
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &TIME)
    /*                                    */
/* SORT OGSÅ I LØSNING 1 - INLIBL FOR Å SIKRE SORT I RIKTIG BIBL.*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             OVRDBF     FILE(SORT) TOFILE(&LIB/SORT)

             RMVM       FILE(SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(SORT) MBR(&UNIK)
             OVRDBF     FILE(SORT) TOFILE(SORT) MBR(&UNIK)
    /* */
    /*                                    */
    /* */
             CALL       PGM(SYBO22) PARM(&P3)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA20) PARM(&P1 &P1E &P1S &P2 &P3 &P4 +
                          &P5 &P6 &P7 &P8 &P9)
             SNDPGMMSG  MSG(' ' *BCAT &P1 *BCAT 'fakturakopierer er +
                          klare til utskrift på printer ' *BCAT &PRT +
                          *BCAT '.') MSGTYPE(*INFO)
             RMVM       FILE(SORT) MBR(&UNIK)
/*------------------------------------------------------*/
/*KAN HA VÆRT INNOM SYFA27 SOM IKKE CLOSER ALLE FILER...*/
/*------------------------------------------------------*/
             RCLRSC
             DLTOVR     FILE(FAKT)
             MONMSG     MSGID(CPF0000)
             DLTOVR     FILE(*ALL) LVL(*JOB)
             MONMSG     MSGID(CPF0000)
    /* */
             CHGDTAARA  DTAARA(*LDA (101 924)) VALUE(' ')
    /* */
 SLUTT:      ENDPGM
