             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&AUT) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGMR) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&JOB)
             CALL       PGM(INLIBL)
             CALL       PGM(SYFAFICL) PARM(&IN01)
             IF         COND(&IN01 *EQ '1') THEN(SNDBRKMSG MSG('du +
                          er ikke registrert som regskapsbruker') +
                          TOMSGQ(&JOB))
             IF         COND(&IN01 *EQ '1') THEN(DO)
             GOTO SLUTT
             ENDDO
             RTVUSRPRF  GRPPRF(&PGMR)
             IF         COND(&PGMR *NE QPGMR) THEN(DO)
             SNDBRKMSG  MSG('Du mangler henvisning til gruppeprofil +
                          qpgmr') TOMSGQ(&JOB)
             GOTO SLUTT
             ENDDO
/*                                     */
/*OPPDATERER STATISTIKK OG REGNSKAP    */
/*                                     */
/* */
/* KALLER SYFA62B FOR Å MERKE RECORDS MED 'G'  */
/* */
             CALL       PGM(SYFA62B)
/* */
/* KALLER SYFA70 FOR Å OPPDATERE PROSJEKTREGISTER */
/* */
             CALL       PGM(SYFA70)
/* */
/* KALLER SYFA35 FOR Å OPPDATERE POSTERINGER      */
/* */
             CALL       PGM(SYFA35) PARM(&AUT)
/* */
/* KALLER V005NY FOR Å OPPDATERE NATIVE ØKONOMI   */
/* */
             DLTOVR     FILE(*ALL)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')
             CALL       PGM(VC005NA)
             CALL       PGM(INLIBL)
             CPYF       FROMFILE(POSTA0) TOFILE(BACKUPA) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF2817)
             CPYF       FROMFILE(POST0) TOFILE(BACKUPB) +
                          MBROPT(*REPLACE)
             MONMSG     MSGID(CPF2817)
             CLRPFM     FILE(POST0)
             CLRPFM     FILE(POSTA0)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')

 SLUTT:      ENDPGM
