             PGM        PARM(&USERID)
             DCL        VAR(&USERID) TYPE(*CHAR) LEN(10)
             RTVUSRPRF  RTNUSRPRF(&USERID)
             ENDPGM
