/********************************************************************/
/*    KUNDERS AVVIK PR AVDELING M.H.T SAMLEFAKTURA                  */
/********************************************************************/
             PGM
             DCL        VAR(&KNR) TYPE(*DEC) LEN(8 0) VALUE(24)
             DCL        VAR(&DOK) TYPE(*CHAR) LEN(10) +
                          VALUE('SAMLEF.SPE')
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) VALUE(1)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0) VALUE(51649)
             DCL        VAR(&FAK) TYPE(*DEC) LEN(6 0) VALUE(0)
             DCL        VAR(&VAL) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&LI1) TYPE(*CHAR) LEN(79)
             DCL        VAR(&LI2) TYPE(*CHAR) LEN(79)
             DCL        VAR(&LI3) TYPE(*CHAR) LEN(79)

             CALL       PGM(SYFA57D) PARM(&KNR &DOK +
                          &AVD &OPD &FAK &VAL &LI1 &LI2 &LI3)

             CHGDTAARA  DTAARA(*LDA (1 79)) VALUE(&LI1)
             CHGDTAARA  DTAARA(*LDA (101 79)) VALUE(&LI2)
             CHGDTAARA  DTAARA(*LDA (201 79)) VALUE(&LI3)

             SNDPGMMSG  MSG('DSPDTAARA *LDA for å se på resultatet')

             ENDPGM
