             PGM
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UDOKN) TYPE(*DEC) LEN(3 0) VALUE(106)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&SJØ) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&COP) TYPE(*CHAR) LEN(1)
    /* */
    /* HENTE PRINTERSTYRING */
    /* */
             CALL       PGM(SYGE18) PARM(&UDOKN &PRT &LAS &STR &PTY +
                          &HOLD &SAVE &KOPI &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))
    /* */
    /* */
    /* SKRIVE UT STATISTIKK */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYFA46PF) PAGESIZE(48 198) CPI(15) +
                          OVRFLW(46) OUTQ(&PRT) FORMTYPE(&PTY) +
                          COPIES(&KOPI) HOLD(&HOLD) SAVE(&SAVE)
             RTVJOBA    JOB(&WS)
             CLRPFM     FILE(STATWRKF) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(STATWRKF) +
                          MBR(&WS))
             OVRDBF     FILE(STATWRKF) TOFILE(STATWRKF) MBR(&WS)
             OVRDBF     FILE(STATWRFF) TOFILE(STATWRKF) MBR(&WS)
             CLRPFM     FILE(STATWR2F) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(STATWR2F) +
                          MBR(&WS))
             OVRDBF     FILE(STATWR2F) TOFILE(STATWR2F) MBR(&WS)

             CHGVAR     VAR(&KOPIA) VALUE(&KOPI)
             CALL       PGM(SYFA46) PARM(&SJØ &LAS &STR &KOPIA)
    /* */
 SLUTT:      ENDPGM
