/********************************************************************/
/*    KUNDERS EGEN SAMLEFAKTURAPROFIL                               */
/********************************************************************/
             PGM        PARM(&UPDATE)
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             CALL       PGM(SYFA57B) PARM(&KNR &UPDATE)
             ENDPGM
