             PGM        PARM(&TUR)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             CALL       PGM(SYEX88S) PARM(&TUR)
             ENDPGM
