             PGM
             DCL        VAR(&KF) TYPE(*CHAR) LEN(2)
             DCL        VAR(&SØK) TYPE(*CHAR) LEN(1)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA71) PARM(&KF &SØK)
             ENDPGM
