             PGM        PARM(&FIR &KU1 &KU2 &ADR &DUPK)
             DCL        VAR(&FIR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&KU1) TYPE(*DEC) LEN(8 0) /* TIL */
             DCL        VAR(&KU2) TYPE(*DEC) LEN(8 0) /* FRA */
             DCL        VAR(&ADR) TYPE(*DEC) LEN(5 0) /* KUN ADR. NR */
             DCL        VAR(&DUPK) TYPE(*CHAR) LEN(1) /* DUP-KODE */
    /* */
             OVRDBF     FILE(VADROPD) TOFILE(VADR)
             CALL       PGM(SYFA05B) PARM(&FIR &KU1 &KU2 &ADR &DUPK)
             ENDPGM
