/* *********************************************************************   */
/* VEDLIKEHOLD SIGNATURKODER                                               */
/* ********************************************************************    */
             PGM
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(2) VALUE('V')
             DCL        VAR(&SIGN) TYPE(*DEC) LEN(4 0)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA60) PARM(&STAT &SIGN)
             ENDPGM
