             PGM
             DCL        VAR(&WSKUNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA88) PARM(&WSKUNR)
             ENDPGM
