             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
 /*                                                                */
 /*  Kall vedlikeholdsprogram - returnerer parameter for valuta-   */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('    ')
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '0') THEN(CALL PGM(SYFA36))
             ENDPGM
