/*  BYTTET GETPR2 MED GETPRN FOR DRAWER OG ANTAL.L KOPIER */
/*N01 OVERSTYRER  OGSÅ SYFA12SAP (STREKKODE PÅ AFP/LASER) */
/*SYFA12P LPI(12) + SIDESTØRRELSE/OVERFLOW DOBLET - INGEN MERKING  SYBRINGTMS */
             PGM        PARM(&KODE &VB &EKSP &LG &PO)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&TPFB) TYPE(*DEC) LEN(3 0) VALUE(014)
             DCL        VAR(&PDFDIR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STFB) TYPE(*DEC) LEN(3 0) VALUE(006)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) /* Kode = 'F', +
                          'T'. 'F'=fraktbrev, 'T'=tollpassfraktbrev  */
             DCL        VAR(&VB) TYPE(*CHAR) LEN(1) /* Hvis &VB = +
                          'J', skal sende valgbilde ut til bruker. */
             DCL        VAR(&PO) TYPE(*CHAR) LEN(1) /* Hvis &PO = +
                          'J', skal sortere på postnr. */
             DCL        VAR(&EKSP) TYPE(*CHAR) LEN(1) /* LEDIG*/

             DCL        VAR(&LG) TYPE(*CHAR) LEN(1) /* LEDIG */

     /* */
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* LEDIG */

             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* LEDIG*/

             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til vanlig tollpassfraktbrev. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til vanlig tollpassfraktbrev. */
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10) /* LEDIG*/

             DCL        VAR(&PT3) TYPE(*CHAR) LEN(10) /* LEDIG */

             DCL        VAR(&PRT4) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til merkelapp-3. */
             DCL        VAR(&PT4) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til merkelapper-3. */
             DCL        VAR(&PRT5) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til linjegods merkelapp. */
             DCL        VAR(&PT5) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til linjegods merkelapp. */
             DCL        VAR(&PRT6) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til følgebrev. */
             DCL        VAR(&PT6) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til følgebrev. */
             DCL        VAR(&PRT10) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til Vanlig Tollpass. */
             DCL        VAR(&PT10) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til vanlig tollpass. */
             DCL        VAR(&PRT11) TYPE(*CHAR) LEN(10) /* LEDIG*/

             DCL        VAR(&PT11) TYPE(*CHAR) LEN(10) /* LEDIG */

             DCL        VAR(&PRT67) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til ZEBRA-strekkodemerkelapper */
             DCL        VAR(&PT67) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til ZEBRA-strekkodemerkelapper */
             DCL        VAR(&PRT57) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til PAKKETRANS */
             DCL        VAR(&PT57) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til PAKKETRANS */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&NRBE) TYPE(*DEC) LEN(3 0) VALUE(058)
             DCL        VAR(&PRT58) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til BEDRIFTSPAKKE */
             DCL        VAR(&PT58) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til BEDRIFTSPAKKE */
    /* */
             RTVDTAARA  DTAARA(*LDA (701 10)) RTNVAR(&PRT1)
             RTVDTAARA  DTAARA(*LDA (711 10)) RTNVAR(&PT1)
             RTVDTAARA  DTAARA(*LDA (721 10)) RTNVAR(&PRT2)
             RTVDTAARA  DTAARA(*LDA (731 10)) RTNVAR(&PT2)
             RTVDTAARA  DTAARA(*LDA (741 10)) RTNVAR(&PRT3)
             RTVDTAARA  DTAARA(*LDA (751 10)) RTNVAR(&PT3)
             RTVDTAARA  DTAARA(*LDA (761 10)) RTNVAR(&PRT4)
             RTVDTAARA  DTAARA(*LDA (771 10)) RTNVAR(&PT4)
             RTVDTAARA  DTAARA(*LDA (781 10)) RTNVAR(&PRT5)
             RTVDTAARA  DTAARA(*LDA (791 10)) RTNVAR(&PT5)
             RTVDTAARA  DTAARA(*LDA (801 10)) RTNVAR(&PRT6)
             RTVDTAARA  DTAARA(*LDA (811 10)) RTNVAR(&PT6)
             RTVDTAARA  DTAARA(*LDA (801 10)) RTNVAR(&PRT6)
             RTVDTAARA  DTAARA(*LDA (811 10)) RTNVAR(&PT6)
             RTVDTAARA  DTAARA(*LDA (881 10)) RTNVAR(&PRT10)
             RTVDTAARA  DTAARA(*LDA (891 10)) RTNVAR(&PT10)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&PRT11)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&PT11)
             RTVDTAARA  DTAARA(*LDA (921 10)) RTNVAR(&PRT67)
             RTVDTAARA  DTAARA(*LDA (931 10)) RTNVAR(&PT67)
             RTVDTAARA  DTAARA(*LDA (941 10)) RTNVAR(&PRT57)
             RTVDTAARA  DTAARA(*LDA (951 10)) RTNVAR(&PT57)
/* BEDRIFTSPAKKE FÅR IKKE OVERSTYRT.....*/
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             CALL       PGM(GETPRT) PARM(&AVD &NRBE &PRT58 &PT58)
             CALL       PGM(GETPR2) PARM(&AVD &STFB &LASER &LPI2)
    /* */
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR FRAKTBREV */
     /* Fraktbrev - linjegods/vanlig */
     /* Girofr.brev linjegods og std på samme prt(har aldri begge) */
             IF         COND(&KODE = 'F') THEN(DO)
             CALL       PGM(GETPRN) PARM(&AVD &STFB &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /**************************************/
    /* START FOR IKKE PDF DOKUMENTER      */
    /**************************************/
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) PAGESIZE(144 80) CPI(10) LPI(12) +
                          OVRFLW(144) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             ENDDO
    /**************************************/
    /* START FOR PDF DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          80) CPI(10) LPI(12) OVRFLW(140) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
                        ENDDO
    /**************************************/
    /* START FOR AFP DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'F') THEN(DO)
 /*          OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) CPI(10) FRONTMGN(0.10 0.20) +
                          OVRFLW(70) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES) */
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          80) CPI(10) LPI(12) FRONTMGN(0.10 0.23) +
                          OVRFLW(140) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT2) FORMTYPE(&PT2) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
                        ENDDO
                        ENDDO
     /* Tollpass - linjegods/vanlig */
             IF         COND(&KODE = 'T') THEN(DO)
             CALL       PGM(GETPRN) PARM(&AVD &TPFB &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /**************************************/
    /* START FOR IKKE PDF DOKUMENTER      */
    /**************************************/
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) PAGESIZE(144 80) CPI(10) LPI(12) +
                          FRONTMGN(.14 0) OVRFLW(144) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) +
                          FRONTOVL(&LOGO) OUTQ(&PRT10) +
                          FORMTYPE(&PT10) COPIES(&COPIES)
             ENDDO
    /**************************************/
    /* START FOR PDF DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          80) CPI(10) LPI(12) OVRFLW(70) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT10) FORMTYPE(&PT10) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
             ENDDO
    /**************************************/
    /* START FOR AFP DOKUMENTER           */
    /**************************************/
             IF         COND(&LASER *EQ 'F') THEN(DO)
 /*          OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) CPI(10) FRONTMGN(0.10 0.20) +
                          OVRFLW(70) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT10) FORMTYPE(&PT10) COPIES(&COPIES) */
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          80) CPI(10) LPI(12) FRONTMGN(0.10 0.23) +
                          OVRFLW(140) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT10) FORMTYPE(&PT10) COPIES(&COPIES)
             CHGVAR     VAR(&PDFDIR) VALUE('J')
             ENDDO
                        ENDDO
    /* ----------------------------------------------------------- */
    /* */
             OVRPRTF    FILE(MLAPP) OUTQ(&PRT4) PAGESIZE(30 75) +
                          CPI(10) FORMTYPE(&PT4)
             OVRPRTF    FILE(LLAPP) OUTQ(&PRT5) PAGESIZE(18 75) +
                          CPI(10) FORMTYPE(&PT5)
             OVRPRTF    FILE(FØLGE) OUTQ(&PRT6) PAGESIZE(24 75) +
                          CPI(10) FORMTYPE(&PT6)
             OVRPRTF    FILE(ZBARC) OUTQ(&PRT67) +
                          FORMTYPE(&PT67)
             OVRPRTF    FILE(SYLA03P) OUTQ(&PRT67) +
                          FORMTYPE(&PT67)
/*N01*/      OVRPRTF    FILE(SYFA12SAP) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) LPI(8) CPI(10) OVRFLW(70) OUTQ(&PRT67) +
                          FORMTYPE(*STD)
             OVRPRTF    FILE(PAKKET) OUTQ(&PRT57) +
                          FORMTYPE(&PT57)
    /* */
    /* ----------------------------------------------------------- */
    /* SKRIVER UT FRAKTBREV */
             CALL       PGM(SYFA12) PARM(&PRANT &KODE &VB &PO &PDFDIR)
    /* ----------------------------------------------------------- */
    /* */
    /* ----------------------------------------------------------- */
    /* SKRIVER UT MEDLING TIL BRUKER */
    /* Tollpass - linjegods/vanlig */
             IF         COND(&KODE = 'T') THEN(DO)
             SNDPGMMSG  MSG(' ' *BCAT &PRANT *BCAT 'vanlig +
                          tollpassfraktbrev er klare til utskrift.') +
                          MSGTYPE(*INFO)
                        ENDDO
    /* Fraktbrev- linjegods/vanlig */
             IF         COND(&KODE = 'F') THEN(DO)
             SNDPGMMSG  MSG(' ' *BCAT &PRANT *BCAT 'vanlig +
                          er klare til utskrift.') +
                          MSGTYPE(*INFO)
                        ENDDO
    /* ----------------------------------------------------------- */
    /* */
             RETURN
             ENDPGM
