/********************************************************************/
/*    SYSPED400 FASTE KODER - OPPDATERING                           */
/********************************************************************/
             PGM        PARM(&TYPE)
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(5)
             CALL       PGM(SYFAKD) PARM(&TYPE &UPDATE &KODE)
             ENDPGM
