             PGM
             DCL        VAR(&TNR) TYPE(*CHAR) LEN(5) VALUE(' ')
             CALL       PGM(SYFA66) PARM(&TNR)
             ENDPGM
