             PGM        PARM(&IN01)
             DCL        VAR(&BRUK) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             OVRDBF     FILE(USERL02) TOFILE(&L1STDN/USERL02)
             RTVJOBA    USER(&BRUK)
             CALL       PGM(SYFAFI) PARM(&IN01 &BRUK)
             RETURN
             ENDPGM
