/********************************************************************/
/*    KUNDERS AVVIK PR AVDELING M.H.T SAMLEFAKTURA                  */
/********************************************************************/
             PGM
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&NR) TYPE(*DEC) LEN(3 0) VALUE(0)
             OVRDBF     FILE(SYFLDOPD) TOFILE(SYFLD)
             CALL       PGM(SYFA57X) PARM(&NR &UPDATE)
             ENDPGM
