             PGM
             DCL        VAR(&SYSPRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SAD) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
    /* HENT SYSTEMSKRIVER (DEFAULT FOR NYE UTSK.TYPER) */
             RTVSYSVAL  SYSVAL(QPRTDEV) RTNVAR(&SYSPRT)
             CHGDTAARA  DTAARA(*LDA (201 10)) VALUE(&SYSPRT)
    /* */
    /* VEDLH. AVDELING */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA28) PARM(&SAD &AVD &AVD)
    /* */
             ENDPGM
