             PGM
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) /* Avdeling. */
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0) /* Oppdragsnr. */
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(0) /* +
                          Hvis &FLAGG = 1, betyr det at programmet +
                          skal spørre på fritekst til oppdrag. +
                          Ellers vedlikeholder fritekst. */
 /*                                                                */
             OVRDBF     FILE(FRTIND) TOFILE(FREETXT1)
             CALL       PGM(SYFA31) PARM(&AVD &OPD &FLAGG)
 /*                                                                */
             ENDPGM
