             PGM        PARM(&WMN1)
             DCL        VAR(&WMN1) TYPE(*CHAR) LEN(9)
             ADDLIBLE   LIB(SYSPED)
             MONMSG CPF0000
             ADDLIBLE   LIB(SYSPEDF)
             MONMSG CPF0000
             ADDLIBLE   LIB(SYENDPTF)
             MONMSG CPF0000
             ADDLIBLE   LIB(SYENDRE)
             MONMSG CPF0000
             CALL       PGM(SYFA12LGRR) PARM(&WMN1)
             RMVLIBLE   LIB(SYENDRE)
             MONMSG CPF0000
             RMVLIBLE   LIB(SYENDPTF)
             MONMSG CPF0000
             RMVLIBLE   LIB(SYSPEDF)
             MONMSG CPF0000
             RMVLIBLE   LIB(SYSPED)
             MONMSG CPF0000
             ENDPGM
