             PGM
             DCL        VAR(&UTK) TYPE(*CHAR) LEN(10)
             RTVUSRPRF  OUTQ(&UTK)
             CALL       PGM(SYFA51R) PARM(&UTK)
             ENDPGM
