    /* UTSKRIFT AV GODSLISTE    */
    /*******************************************************************/
    /* OM KUNDER ØNSKER PDF ELLER AFP, MÅ DET GJØRES SOM SPESIAL PT..  */
    /*******************************************************************/
    /* N01 SYFA55PF IKKE GODSLIST */
             PGM        PARM(&AVD &SG &TUR &LOP8)
             DCL        VAR(&LOP8) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&CMR) TYPE(*DEC) LEN(3 0) VALUE(024)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til CMR-FRAKTBREV        */
             DCL        VAR(&PT3) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til CMR-FRAKTBREV        */
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&GODS) TYPE(*DEC) LEN(3 0) VALUE(050)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(1) /* HEADING */
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3) /* SIGNATUR */
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&AAVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&ATUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AGE) TYPE(*CHAR) LEN(8)  VALUE('00000000')
             DCL        VAR(&ANT) TYPE(*DEC) LEN(3 0) VALUE(0)
             DCL        VAR(&ANTA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&ATYPE) TYPE(*CHAR) LEN(2) VALUE('go')
             DCL        VAR(&XFAX) TYPE(*CHAR) LEN(1) VALUE('C')
             DCL        VAR(&XADR) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&XBELJ) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1) VALUE('N')
             RTVJOBA    USER(&AUSER)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CHGVAR     VAR(&AAVD) VALUE(&AVD)
             CHGVAR     VAR(&ATUR) VALUE(&TUR)
             CALL       PGM(SYFA55F11) PARM(&IN01 &AAVD &SG &TUR &PRT &PT &HE)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             CHGDTAARA  DTAARA(*LDA (30 1)) VALUE('J')
             CHGDTAARA  DTAARA(*LDA (961 1)) VALUE('F')
    /* */
    /* FIX KONVOLUTT            */
    /* */
             CALL       PGM(GETPRN) PARM(&AAVD &GODS &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR GODSLISTE STÅENDE  IKKE AFP/PDF          */
    /* ----------------------------------------------------------- */
             IF         COND((&LASER *NE 'P') *AND (&LASER *NE 'F')) +
                          THEN(DO)
             OVRPRTF    FILE(SYFA55PF) OUTQ(&PRT) PAGESIZE(72 120) +
                          CPI(15) OVRFLW(64) FORMTYPE(&PT)
                          ENDDO
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR GODSLISTE STÅENDE  */
    /* ----------------------------------------------------------- */
             IF         COND(&LASER *EQ 'P') +
                          THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT) COPIES(&COPIES)
             ENDDO
    /* SKRIVER UT GODSLISTE   * AFP                                */
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR GODSLISTE STÅENDE  */
    /* ----------------------------------------------------------- */
             IF         COND(&LASER *EQ 'F') +
                          THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT) FORMTYPE(&PT) COPIES(&COPIES)
             ENDDO
    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR SAMLE-CMR          */
    /* ----------------------------------------------------------- */
    /* */
             CALL       PGM(GETPRN) PARM(&AAVD &CMR &PRT3 &PT3 +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
    /* */
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55CP) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(0) FRONTOVL(&LOGO) +
                          OUTQ(&PRT3) FORMTYPE(&PT3) +
                          COPIES(&COPIES) /*N01*/
                          ENDDO
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55CP) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          80) CPI(10) OVRFLW(72) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(0) FRONTOVL(FCMR1 +
                          0.31 0.05) OUTQ(&PRT3) FORMTYPE(&PT3) +
                          COPIES(&COPIES) /*N01*/
                          ENDDO
             IF         COND(&LASER *EQ 'F') THEN(DO)
             OVRPRTF    FILE(SYFA55CP) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          80) CPI(10) FRONTMGN(0 0.32) OVRFLW(72) +
                          DRAWER(&DRAWER) OUTBIN(&DRAWUT) PAGRTT(0) +
                          FRONTOVL(FCMR1 0.31 0.05) OUTQ(&PRT3) +
                          FORMTYPE(&PT3) COPIES(&COPIES) /*N01*/
                          ENDDO
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* ----------------------------------------------------------- */
    /* */
    /* */
             CALL       PGM(SYFA55)  PARM(&AAVD &ATUR &LOP8 &XBELJ &XFAX +
                                          &XADR)
    /* */
             CHGVAR     VAR(&ANTA) VALUE(&ANT)
    /* */
             SNDPGMMSG  MSG(' ' *BCAT &ANTA *BCAT 'Konvolutter er +
                          klare til utskrift på printer ' *BCAT +
                          &PRT *BCAT '.') MSGTYPE(*INFO)
    /* */
    /* ARKIVJOBB            */
             SBMJOB     CMD(CALL PGM(ARC002CL) PARM(&ATYPE &AUSER +
                          &FINS)) JOB(ARKIV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQARK)
 SLUTT:      ENDPGM
