             PGM
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             CHGJOB     RUNPTY(51) LOG(*SAME *SAME *SECLVL) +
                          LOGCLPGM(*YES)
             OVRDBF     FILE(FAKT) FRCRATIO(1)
             OVRDBF     FILE(HEADF) FRCRATIO(1)
             OVRDBF     FILE(HEAD1) FRCRATIO(1)
 START:      CALL       PGM(SYFA44) PARM(&FLAGG)
             IF         COND(&FLAGG = 1) THEN(DO)
             CLRPFM     FILE(STATHF)
             CLRPFM     FILE(STATDF)
             CLRPFM     FILE(STATOHF)
             CLRPFM     FILE(STATODF)
             CALL       PGM(SYFA44A) /* Endre status på faktura fra +
                          O til Z for rekonstruering */
             GOTO       CMDLBL(START)
             ENDDO
             ENDPGM
