/*  BYTTET GETPR2 MED GETPRN FOR DRAWER OG ANTAL.L KOPIER */
/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SYFA55CP                                           */
/* 10XXX * 02 JOV PTF10 SYFA55CP - IKKE CMR VED INNLAND                    */
/*       * 03 JOV PTF10 TA HENSYN TIL F=AFP                                */
/* ********************************************************************    */
             PGM        PARM(&TUR)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) /* Hvis &in03 +
                          på, skal losseliste  være stående. */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AGNULL) TYPE(*CHAR) LEN(8) +
                          VALUE('00000000')
             DCL        VAR(&BELJN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UDSFAX) TYPE(*CHAR) LEN(1) VALUE('N')
  /*LÅNER PARM. FOR DISTR.ADRESSE FOR Å INDIKERE LASTELISTE INNLAND*/
             DCL        VAR(&DADRJN) TYPE(*CHAR) LEN(1) VALUE('L')
    /* */
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til stående losseliste. */
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til stående losseliste. */
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til liggende losseliste. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til liggende losseliste. */
/*N01*/      DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til CMR-FRAKTBREV        */
/*N01*/      DCL        VAR(&PT3) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til CMR-FRAKTBREV        */
             DCL        VAR(&UTSNR) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */

    /* */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
    /* EKSTRA PARAMETRE OVERFØRES I "CMR-DELEN" AV UDS.    */
             CALL       PGM(SYFAGL) PARM(&IN03 &IN01 +
                          &AVD &TUR)

             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* ----------------------------------------------------------- */
    /* SKRIVER UT GODSLISTE  INNLAND PÅ PAPIR - ALLTID DIREKTE */
    /* ----------------------------------------------------------- */
             RTVDTAARA  DTAARA(*LDA (821 10)) RTNVAR(&PRT1)
             RTVDTAARA  DTAARA(*LDA (831 10)) RTNVAR(&PT1)
             RTVDTAARA  DTAARA(*LDA (841 10)) RTNVAR(&PRT2)
             RTVDTAARA  DTAARA(*LDA (851 10)) RTNVAR(&PT2)
/*N01*/      RTVDTAARA  DTAARA(*LDA (861 10)) RTNVAR(&PRT3)
/*N01*/      RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PT3)

    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR GODSLISTE STÅENDE  */
    /* ----------------------------------------------------------- */
             IF         COND(&IN03 = '1') THEN(DO)
             CHGVAR     VAR(&UTSNR) VALUE(022)
             CALL       PGM(GETPRN) PARM(&AVD &UTSNR &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) PAGESIZE(70 120) CPI(15) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO
 /*AFP */
             IF         COND(&LASER *EQ 'F') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) CPI(16.7) FRONTMGN(0.14 0.76) +
                          OVRFLW(62) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) FRONTOVL(&LOGO) +
                          OUTQ(&PRT1) FORMTYPE(&PT1) COPIES(&COPIES)
                        ENDDO

             ENDDO

    /* ----------------------------------------------------------- */
    /* ORDNER PRINTER FOR GODSLISTE STÅENDE  */
    /* ----------------------------------------------------------- */
             IF         COND(&IN03 = '0') THEN(DO)
             CHGVAR     VAR(&UTSNR) VALUE(023)
             CALL       PGM(GETPRN) PARM(&AVD &UTSNR &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
             IF         COND(&LASER *NE 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) PAGESIZE(48 120) CPI(12) +
                          OVRFLW(44) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(90) +
                          FRONTOVL(&LOGO) OUTQ(&PRT2) +
                          FORMTYPE(&PT2) COPIES(&COPIES)

                        ENDDO
 /*PDF */
             IF         COND(&LASER *EQ 'P') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(48 +
                          120) CPI(12) FRONTMGN(0.14 0.80) +
                          OVRFLW(44) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(90) +
                          FRONTOVL(&LOGO) OUTQ(&PRT2) +
                          FORMTYPE(&PT2) COPIES(&COPIES)
                        ENDDO
 /*AFP */
             IF         COND(&LASER *EQ 'F') THEN(DO)
             OVRPRTF    FILE(SYFA55PF) DEVTYPE(*AFPDS) PAGESIZE(48 +
                          120) CPI(12) FRONTMGN(0.14 0.80) +
                          OVRFLW(44) DRAWER(&DRAWER) +
                          OUTBIN(&DRAWUT) PAGRTT(90) +
                          FRONTOVL(&LOGO) OUTQ(&PRT2) +
                          FORMTYPE(&PT2) COPIES(&COPIES)
                        ENDDO

             ENDDO

/*S02  OVERSTYRINGER AV SYFA55CP - CMR ER FJERNET - INGEN CMR VED INNLAND*/

             CALL       PGM(SYFA55) PARM(&AVD &TUR &AGNULL &BELJN +
                          &UDSFAX &DADRJN)

 SLUTT:      ENDPGM
