             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&KNT) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&PNF) TYPE(*CHAR) LEN(4)
    /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             CALL       PGM(SYFB12) PARM(&KNT &PNF &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             OVRDBF     FILE(WL) TOFILE(QS36F/NOC.WL)
             CALL       PGM(SYFB12A) PARM(&KNT &PNF)
             DLTOVR     FILE(WL)
    /* */
 SLUTT:      ENDPGM
