/* 01 JOV - HOPEP UT DERSOM WEBSERV-BIBL LIBHTTP IKKE FINNES */
/* 02 SH  - NY PARAMETER KUNDNR HOS TOLLPOST   &KNS          */
             PGM        PARM(&PNF &PNT &NT &VKT &M3 &KNT &BRTBL +
                          &NETBL &RAB &FLAGG &AVD &OPD &KN &KNS &TRA &PRO)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(5)
             DCL        VAR(&KNS) TYPE(*CHAR) LEN(12)
             DCL        VAR(&TRA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNF) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PNT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&NT) TYPE(*CHAR) LEN(7)
             DCL        VAR(&VKT) TYPE(*CHAR) LEN(9)
             DCL        VAR(&M3) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KNT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&BRTBL) TYPE(*CHAR) LEN(9)
             DCL        VAR(&NETBL) TYPE(*CHAR) LEN(9)
             DCL        VAR(&RAB) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FLAGG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KN) TYPE(*CHAR) LEN(8)

             RMVLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(LIBHTTP) POSITION(*LAST)
 /*N02*/     MONMSG     MSGID(CPF2110) EXEC(GOTO CMDLBL(SLUTT))
             CALL       PGM(SYFB05) PARM(&PNF &PNT &NT &VKT &M3 &KNT +
                          &BRTBL &NETBL &RAB &FLAGG &AVD &OPD &KN +
                          &KNS &TRA &PRO)
             RMVLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)
/*S01        ENDPGM   */
SLUTT:       ENDPGM
