             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* ARB.STASJ*/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             RTVJOBA    JOB(&JOB)
             CALL       PGM(INLIBL)
             CALL       PGM(SYFAFICL) PARM(&IN01)
             IF         COND(&IN01 *EQ '1') THEN(SNDBRKMSG MSG('du +
                          er ikke registrert som bruker') TOMSGQ(&JOB))
             IF         COND(&IN01 *EQ '1') THEN(RETURN)
/* FJERN MEMBER FRA ARBEIDSFIL */
             RMVM       FILE(KOSAL01) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSAL02) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSAF) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBL01) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBL02) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBF) MBR(&WS)
             MONMSG     MSGID(CPF0000)
/* LEGG TIL NYTT MEMBER TIL ARBEIDSFIL(FÅR DATO) */
             ADDPFM     FILE(KOSAF) MBR(&WS)
             ADDPFM     FILE(KOSBF) MBR(&WS)
             ADDLFM     FILE(KOSAL02) MBR(&WS) DTAMBRS((KOSAF (&WS)))
             ADDLFM     FILE(KOSBL01) MBR(&WS) DTAMBRS((KOSBF (&WS)))
/* OVERRIDE FILE TIL MEMBER (=DSPSTN NAVN.) */
             OVRDBF     FILE(KOSAF) TOFILE(KOSAF) MBR(&WS)
             OVRDBF     FILE(KOSAL02) TOFILE(KOSAL02) MBR(&WS)
             OVRDBF     FILE(KOSBF) TOFILE(KOSBF) MBR(&WS)
             OVRDBF     FILE(KOSBL01) TOFILE(KOSBL01) MBR(&WS)
/*                                     */
/*OPPDATERER REGNSKAP (IKKE STATISTIKK -FERGER UTENOM TUR M.M.) */
/* */
/* KALLER SYFE35 FOR Å OPPDATERE POSTERINGER      */
/* */
             CALL       PGM(SYFE35)
/* */
/* KALLER V005KS FOR Å OPPDATERE NATIVE ØKONOMI   */
/* */
             DLTOVR     FILE(*ALL)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')
             CALL       PGM(VC005KS) PARM(&WS)
/*   SETTER ORIGINAL SPEDISJONSBIBLIOTEKSLISTE     */
             CALL       PGM(INLIBL)
/* FJERN EVT. GAMMELT MEMBER FRA KOPI/BACKUPFILER */
             RMVM       FILE(BACKKSA) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(BACKKSB) MBR(&WS)
             MONMSG     MSGID(CPF0000)
/* KOPIER INN OVERFØRT MEMBER TIL  BACKUPFILER */
             CPYF       FROMFILE(*LIBL/KOSAF) TOFILE(*LIBL/BACKKSA) +
                          FROMMBR(&WS) TOMBR(&WS) MBROPT(*ADD)
             CPYF       FROMFILE(*LIBL/KOSBF) TOFILE(*LIBL/BACKKSB) +
                          FROMMBR(&WS) TOMBR(&WS) MBROPT(*ADD)
/* FJERN MEMBER FRA ARBEIDSFIL */
             RMVM       FILE(KOSAL02) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSAF) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBL01) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBL02) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(KOSBF) MBR(&WS)
             MONMSG     MSGID(CPF0000)
/* GJENOPPRETT LDA FRA FØR KJØRINGEN */
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')
/* */
             SNDPGMMSG  MSG('Utskrift av dagbok er sendt i jobkø +
                          QBATCH i bibliotek QGPL')
 SLUTT:      ENDPGM
