             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O') /* +
                          Hvis &KODE=' ', kalle fra SYFI10CL. */
                                                          /**/
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
                                                          /**/
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFF10) PARM(&KODE)
             RCLRSC
             CALL       PGM(SYFA20CLF)
 SLUTT:      ENDPGM
