             PGM
             DCL        VAR(&IEJ) TYPE(*CHAR) LEN(2) VALUE('AJ') /* +
                          AI = fly-innland.  AE = fly-eksport.  AJ = +
                          jetpakke. */
    /* */
    /* VEDLIKEHOLD AV AWBNR. FOR JETPAKKE */
             CALL       PGM(SYFA42) PARM(&IEJ)
    /* */
             ENDPGM
