/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NYTT PARAMETER FOR LASER                           */
/* ********************************************************************    */
/*S01        PGM        PARM(&PRANT &IN03 &IN04) */
/*N01*/      PGM        PARM(&PRANT &IN03 &IN04 &LASER)
/*N01*/      DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&GODS) TYPE(*CHAR) LEN(15)
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) /* Hvis &in03 +
                          på, skal losseliste  være stående. */
             DCL        VAR(&IN04) TYPE(*LGL) LEN(1) /* Hvis &in04 +
                          på, skal printetype være 4224. */
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
             DCL        VAR(&EDS) TYPE(*CHAR) LEN(39) +
                                  VALUE('*BLANKS')
    /* */
             CHGDTAARA  DTAARA(*LDA (993 3)) VALUE('000')
             RTVDTAARA  DTAARA(*LDA (981 15)) RTNVAR(&GODS)
    /* */
    /* SKRIVER UT LOSSELISTE */
    /* ----------------------------------------------------------- */
NESTE:       CALL       PGM(SYFI48AL) PARM(&PRANT &IN03 &IN04 &GODS)
             IF         COND(&GODS *EQ '               ') THEN(RETURN)
/*S01        CALL       PGM(SYFI48) PARM(&PRANT &IN03 &IN04 &EDS)   */
/*N01*/      CALL       PGM(SYFI48) PARM(&PRANT &IN03 &IN04 &LASER &EDS)
             GOTO       CMDLBL(NESTE)
             ENDPGM
