             PGM
             DCL        VAR(&ENDRE) TYPE(*CHAR) LEN(1) VALUE('S') /* +
                          S=Spørring,  E=Endring */
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))
             CALL       PGM(SYFM21) PARM(&ENDRE &AVD &OPD &SG)

SLUTT:       ENDPGM
