             PGM        PARM(&FRALIB &TILLIB)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             OVRPRTF    FILE(LISTE) PAGESIZE(70 80) OVRFLW(66) +
                          PAGRTT(0) OUTQ(QPRINT) SAVE(*YES)
             OVRDBF     FILE(KODTLKLF) TOFILE(&FRALIB/KODTLKLF)
             OVRDBF     FILE(KODTLK) TOFILE(&TILLIB/KODTLK)
             CALL       PGM(SYFU03)
             ENDPGM
