             PGM        PARM(&FRALIB &TILLIB)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             OVRDBF     FILE(STED2) TOFILE(&FRALIB/STED2)
             OVRDBF     FILE(STED2D) TOFILE(&TILLIB/STED2D)
             OVRPRTF    FILE(LISTE) PAGESIZE(70 80) OVRFLW(66) +
                          PAGRTT(0) OUTQ(QPRINT) SAVE(*YES)
             CALL       PGM(SYFU02)
             ENDPGM
