             PGM        PARM(&AVD &FPER &FAAR &TPER &TAAR +
                             &FORM &PRT &SPLQ &ANT &SAV &HLD)
  /* */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&FPER) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FAAR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&TPER) TYPE(*CHAR) LEN(2)
             DCL        VAR(&TAAR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SPLQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(2)
             DCL        VAR(&SAV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&HLD) TYPE(*CHAR) LEN(1)
 /*  */
             SBMJOB     CMD(CALL PGM(SYGB03C) PARM(&AVD &FPER &FAAR +
                          &TPER &TAAR &FORM &PRT &SPLQ &ANT &SAV +
                          &HLD)) JOB(GBUTSKR) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
 /*  */
 SLUTT:      ENDPGM
