/* ENKEL /LITE RESSURSKREVENDE TEST PÅ OM IFS-OBJEKT FINNES  */
/* RENAME OBJEKTET  TIL SEG SELV / SAMME NAVN - finnes -> CPCA084 (ER renamet)*/
/* MEN DERSOM FRAFILEN IKKE FINNES ER MELDINGEN CPFA0A9  */
/* OBS parameter &BANE er full path INKL- filnavn!!!     */
             PGM        PARM(&BANE &NYOBJ &FINS)
             DCL        VAR(&NYOBJ) TYPE(*CHAR) LEN(50)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(256)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(&FINS) VALUE('J')
             REN        OBJ(&BANE) NEWOBJ(&NYOBJ)
             MONMSG     MSGID(CPFA0A9) EXEC(DO)
             CHGVAR     VAR(&FINS) VALUE('N')
             RETURN
             ENDDO
    /* */
VIDERE:      ENDPGM
