/* SENDE FIL TIL SEG SELV      */
/* CPYCMD ENDRET               */
             PGM        PARM(&USR  &EPOSTF)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
             DCL        VAR(&RPLNA) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&RPLAD) TYPE(*CHAR) LEN(8)
             CHGVAR     VAR(&RPLNA) VALUE(&USR)
             RTVNETA    SYSNAME(&RPLAD)
             CALL       PGM(EPOS04) PARM(&USR &RPLNA &RPLAD &EPOSTF)
 SLUTT:      ENDPGM
