/* HENTE EN BRUKERS EPOSTADRESSE   */
             PGM        PARM(&EPOSTF)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&RPLNA) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&RPLAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
             RTVJOBA    USER(&QUSER)
             RTVNETA    SYSNAME(&RPLAD)
/*                      */
/* HENT REPLYADRESSE    */
/*                      */
/*                      */
             CALL       PGM(EPOS04) PARM(&QUSER &RPLNA &RPLAD &EPOSTF)
/*                      */
                          ENDPGM
