/* SLETTER IFS-OBJEKTER        */
/* ELDRE ENN XXXXX DAGER       */
             PGM        PARM(&BANE &DAGE)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(70) +
                          VALUE('/SYSPEDFX/DELL/EDIRE1K/BACKUP/')
             DCL        VAR(&DAGE) TYPE(*CHAR) LEN(5) VALUE('00100')
             IF         COND(&BANE = ' ') THEN(RETURN)
             IF         COND(&BANE = '/') THEN(RETURN)
             CALL       PGM(SYGE109) PARM(&BANE &DAGE)
             ENDPGM
