             PGM        PARM(&USE &TXT &FINS)
             DCL        VAR(&USE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(50)
             CHGVAR     VAR(&FINS) VALUE('J')
             RTVUSRPRF  USRPRF(&USE) TEXT(&TXT)
             MONMSG     MSGID(CPF2204) EXEC(CHGVAR VAR(&FINS) +
                          VALUE('N'))
             ENDPGM
