             PGM        PARM(&TURNRA &VAL &BEL &AE)
             DCL        VAR(&TURNRA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&VAL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&BEL) TYPE(*DEC) LEN(11 2)
             DCL        VAR(&AE) TYPE(*CHAR) LEN(1)
             OVRDBF     FILE(AVFRH) TOFILE(BUFRH) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHL02) TOFILE(BUFRHL02) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHL04) TOFILE(BUFRHL04) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRD) TOFILE(BUFRD) OVRSCOPE(*JOB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYGE79T) PARM(&TURNRA &VAL &BEL &AE)
             DLTOVR     FILE(*ALL)
             MONMSG     MSGID(CPF0000)
             DLTOVR     FILE(*ALL) LVL(*JOB)
             MONMSG     MSGID(CPF0000)
             ENDPGM
