             PGM        PARM(&DATE &QTIME)

             DCL        VAR(&DATE)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&QTIME)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&QYEAR)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&QMONTH) TYPE(*CHAR) LEN(2)
             DCL        VAR(&QDAY)   TYPE(*CHAR) LEN(2)

             RTVSYSVAL  SYSVAL(QYEAR)  RTNVAR(&QYEAR)
             RTVSYSVAL  SYSVAL(QMONTH) RTNVAR(&QMONTH)
             RTVSYSVAL  SYSVAL(QDAY)   RTNVAR(&QDAY)
             RTVSYSVAL  SYSVAL(QTIME)  RTNVAR(&QTIME)

             CHGVAR     VAR(&DATE) VALUE('20' *CAT &QYEAR *CAT +
                          &QMONTH *CAT &QDAY)

             ENDPGM
