/* HENTE EN BRUKERS EPOSTADRESSE   */
             PGM
             DCL        VAR(&UDIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/A43SYSPEDFX/AS400VISS/EDISE1K')
             DCL        VAR(&UDOK) TYPE(*CHAR) LEN(50)
             DCL        VAR(&UTEG) TYPE(*CHAR) LEN(2)
             DCL        VAR(&NY) TYPE(*CHAR) LEN(150)
/*                      */
/* HENT FILNAVN         */
/*                      */
             CALL       PGM(SYGE76) PARM(&UDIR &UDOK &UTEG)
/*                      */
             CHGVAR     VAR(&NY) VALUE(&UDIR *TCAT '/' *TCAT &UDOK)
             WRKLNK     OBJ(&NY)
                          ENDPGM
