             PGM        PARM(&LINK1 &LINK2 &LINK3 &LINK4)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(123) VALUE(' ')
             DCL        VAR(&URL) TYPE(*CHAR) LEN(90)
             DCL        VAR(&LINK1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&LINK2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&LINK3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&LINK4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&LINK1B) TYPE(*CHAR) LEN(100)
             DCL        VAR(&LINK2B) TYPE(*CHAR) LEN(100)
             DCL        VAR(&LINK3B) TYPE(*CHAR) LEN(100)
             DCL        VAR(&LINK4B) TYPE(*CHAR) LEN(100)
             CALL       PGM(SYGE38) PARM(&LINK1 &LINK2 &LINK3 &LINK4 +
                          &LINK1B &LINK2B &LINK3B &LINK4B)
             STRPCO
             MONMSG     MSGID(IWS4010)
             STRPCCMD   PCCMD(&LINK1B) PAUSE(*NO)
             IF         COND(&LINK2B *NE '                   ') THEN(DO)
             STRPCCMD   PCCMD(&LINK2B) PAUSE(*NO)
             ENDDO
             IF         COND(&LINK3B *NE '                   ') THEN(DO)
             STRPCCMD   PCCMD(&LINK3B) PAUSE(*NO)
             ENDDO
             IF         COND(&LINK4B *NE '                   ') THEN(DO)
             STRPCCMD   PCCMD(&LINK4B) PAUSE(*NO)
             ENDDO
             /* THE VALUE FIELD IS CASE SENSITIVE */
             IF         COND(&LINK4B *NE '                   ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE('echo RunDll32.exe +
                          url.dll,FileProtocolHandler %p1% %p2% +
                          %p3% %p4% >> C:\esped.bat')
             GOTO       CMDLBL(UT)
             ENDDO
             IF         COND(&LINK3B *NE '                   ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE('echo RunDll32.exe +
                          url.dll,FileProtocolHandler %p1% %p2% +
                          %p3%  >> C:\esped.bat')
             GOTO       CMDLBL(UT)
             ENDDO
             IF         COND(&LINK2B *NE '                   ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE('echo RunDll32.exe +
                          url.dll,FileProtocolHandler %p1% %p2% >> +
                          C:\esped.bat')
             GOTO       CMDLBL(UT)
             ENDDO
             CHGVAR     VAR(&CMD) VALUE('echo RunDll32.exe +
                          url.dll,FileProtocolHandler %p1% >> +
                          C:\esped.bat')
UT:          STRPCCMD   PCCMD(&CMD) PAUSE(*NO)
             STRPCCMD   PCCMD('c:\esped.bat') PAUSE(*NO)

             ENDPGM
