             PGM        PARM(&NAM &ADR &FINS)
             DCL        VAR(&NAM) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ADR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(&FINS) VALUE('J')
             DSPDIRE    USRID(&NAM &ADR) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/TEST)
             MONMSG     MSGID(CPF9006) EXEC(CHGVAR VAR(&FINS) +
                          VALUE('N'))
             ENDPGM
