             PGM        PARM(&OBJ &LIB &IN30 &OBJTYP)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN30) TYPE(*LGL) LEN(1)
             DCL        VAR(&OBJTYP) TYPE(*CHAR) LEN(10)
 /* NÅR CL EN KALLES FLERE GANGER MÅ &IN30 SETTES TIL 0  "MANUELT" */
 /* DET VIRKER SOM DCL-STATEMENT SKIPPES NÅR PROG ALT ER I STACKEN */
 /* (NYTTER ALTSÅ IKKE MED VALUE-STATEMENT FOR Å INITIERE) */
             CHGVAR     VAR(&IN30) VALUE('0')

             IF         COND(&OBJTYP = '*OUTQ     ') THEN(DO)
             IF         COND(&OBJ = '*JOB      ') THEN(GOTO +
                          CMDLBL(SLUTT))
             IF         COND(&OBJ = '*DEV      ') THEN(GOTO +
                          CMDLBL(SLUTT))
             ENDDO

             IF         COND(&LIB = '          ') THEN(CHGVAR +
                          VAR(&LIB) VALUE('*LIBL     '))
             CHKOBJ     OBJ(&LIB/&OBJ) OBJTYPE(&OBJTYP) MBR(*NONE)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&IN30) +
                          VALUE('1'))
 SLUTT:      ENDPGM
