             PGM        PARM(&AVD &OPD &BEL)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&BEL) TYPE(*DEC) LEN(9 2)
             DCL        VAR(&WSAVNR) TYPE(*DEC) LEN(9 0) VALUE(0)
             DCL        VAR(&UKUNNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(8)
             OVRDBF     FILE(AVFRT) TOFILE(BUFRT) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRH) TOFILE(BUFRH) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHL01) TOFILE(BUFRHL01) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHL02) TOFILE(BUFRHL02) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHL04) TOFILE(BUFRHL04) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRD) TOFILE(BUFRD) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRDL01) TOFILE(BUFRDL01) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRHCOP) TOFILE(BUFRH) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRDL01C) TOFILE(BUFRDL01) OVRSCOPE(*JOB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYGE88) PARM(&AVD &OPD &BEL)
             DLTOVR     FILE(*ALL)
             MONMSG     MSGID(CPF0000)
             DLTOVR     FILE(*ALL) LVL(*JOB)
             MONMSG     MSGID(CPF0000)
             ENDPGM
