             PGM        PARM(&DATEJ)
             DCL        VAR(&DATEJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DATEN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEU) TYPE(*CHAR) LEN(6)
/*                 */
/* HENTER DATO     */
/*                 */
             RTVJOBA    DATE(&DATEU)
             CHGJOB     DATFMT(*JUL)
             CHGJOB     DATE(&DATEJ)
             CHGJOB     DATFMT(*SYSVAL)
             RTVJOBA    DATE(&DATEJ)
             CHGJOB     DATE(&DATEU)
/*                 */
             ENDPGM
