/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 11XXX * 01 YBC PTF11 VED QTMHHTTP MÅ BRUKER ENDRES TIL QTMHHTP1         */
/* ********************************************************************    */
             PGM        PARM(&FILINN)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode +
                          til register LINK. */
             DCL        VAR(&FILINN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILUT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SPOOL) TYPE(*CHAR) LEN(10) +
                          VALUE('DSPFFDP')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
/*                 */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                         */
/* SLETTER WORKFILER       */
/*                         */
/*                 */
/* LAGER WORKFIL   */
/*                 */
             CRTDUPOBJ  OBJ(EPOST80) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(TMP001)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(QTEMP/TMP001)
/*                 */
             OVRDBF     FILE(EPOST80) TOFILE(QTEMP/TMP001)
/*                 */
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
    /* */
/* LAGER PRTFIL    */
/*                 */
             DSPFFDC    FILE(&FILINN)
/*                 */
/* KOPIERER PRTFIL */
/*                 */
/*N01*/      IF         COND(&QUSER = 'QTMHHTTP') THEN(DO)
/*N01*/      CPYSPLF    FILE(&SPOOL) TOFILE(QTEMP/TMP001) +
                          JOB(QTMHHTP1/QPRTJOB) SPLNBR(*LAST) +
                          MBROPT(*REPLACE) CTLCHAR(*NONE)
/*N01*/      DLTSPLF    FILE(&SPOOL) JOB(QTMHHTP1/QPRTJOB) +
                          SPLNBR(*LAST)
/*N01*/      MONMSG     MSGID(CPF0000)
/*N01*/      ENDDO
/*N01*/      ELSE       CMD(DO)
             CPYSPLF    FILE(&SPOOL) TOFILE(QTEMP/TMP001) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*REPLACE) CTLCHAR(*NONE)
/*N01*/      ENDDO
             DLTSPLF    FILE(DSPFFDP) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
/*                 */
/*           CRTDUPOBJ  OBJ(TMP1024) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(TMP1024)   */
             CRTDUPOBJ  OBJ(TMP4096) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(TMP4096)
             MONMSG     MSGID(CPF0000)
/*           CLRPFM     FILE(QTEMP/TMP1024) */
             CLRPFM     FILE(QTEMP/TMP4096)
             CALL       PGM(SYGE28)
/*                         */
 SLUTT:      ENDPGM
