             PGM        PARM(&MAPPE)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MAPPE2) TYPE(*CHAR) LEN(31)
             CHGVAR     VAR(&MAPPE2) VALUE('/' *TCAT &MAPPE)
             RST DEV('/QSYS.LIB/QGPL.LIB/SYTRFIFSM.FILE') OBJ(&MAPPE2) +
             CRTPRNDIR(*YES)
             ENDPGM
