             PGM
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8) VALUE('00501845')
             DCL        VAR(&BEL) TYPE(*CHAR) LEN(13) +
                          VALUE('0000000100000')
             CALL       PGM(SYGE90) PARM(&TUR &BEL)
             ENDPGM
