/* N01 MONMSG */
             PGM        PARM(&QJNA &QUSER &QJOB &SPLF &NBR)
             DCL        VAR(&NBR) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10)
/*                                     */
/* SETTER SPOLLFIL VERDIER             */
/*                                     */
             DLTSPLF    FILE(&SPLF) JOB(&QJOB/&QUSER/&QJNA) +
                          SPLNBR(&NBR)
             MONMSG     MSGID(CPF0000)
             ENDPGM
