/* *********************************************************************   */
/*       * STARTE PC VINDU AUTOMATISK                                      */

             PGM        PARM(&WWW)
             DCL        VAR(&EXP) TYPE(*CHAR) LEN(9) VALUE('EXPLORER ')
             DCL        VAR(&WWW) TYPE(*CHAR) LEN(70)
             DCL        VAR(&WWW2) TYPE(*CHAR) LEN(70)
             CHGVAR     VAR(&WWW2) VALUE(&EXP *cat &www)

             STRPCO
             MONMSG     MSGID(IWS4010)
             STRPCCMD   PCCMD(&WWW2)     +
                                 PAUSE(*NO)
             MONMSG     MSGID(CPF0000)
/*                                       */
             ENDPGM
