/* *********************************************************************   */
/*       * SENDE QRY SOM EPOST                                             */

             PGM        PARM(&PRTNA)
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&PRTNA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CALL       PGM(SYGE31) PARM(&PRTNA &PDF +
                          &EPOST &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8)
             IF         COND(&EPOST = '          ') THEN(GOTO +
                          CMDLBL(SLUTT))
             IF         COND(&PDF = '*YES') THEN(DO)
             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB +
                          &PRTNA &EPOST &CVP1 &CVP2 &CVP3 &CVP4 +
                          &CVP5 &CVP6 &CVP7 &CVP8 &CVP9 &PDF)
                          ENDDO
             IF         COND(&PDF = '*NO ') THEN(DO)
             CALL       PGM(FAXEPTXT) PARM(&QUSER &QNBR &QJOB +
                          &PRTNA &EPOST &CVP1 &CVP2 &CVP3 &CVP4 +
                          &CVP5 &CVP6 &CVP7 &CVP8 &CVP9 &CVP)
                          ENDDO
             DLTSPLF    FILE(&PRTNA) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
/*                                       */
 SLUTT:      ENDPGM
