             PGM
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&AVDALF) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&IN08) TYPE(*CHAR) LEN(3) VALUE('0')
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DUMMY) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&ENDRE) TYPE(*CHAR) LEN(1) VALUE(' ')

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('    ')
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVDALF)
             CHGVAR     VAR(&AVD) VALUE(&AVDALF)
             RTVDTAARA  DTAARA(*LDA (19 3)) RTNVAR(&SG)
             CALL       PGM(SYGR10) PARM(&AVD &OPD &SG &IN08 &KODE +
                          &ENDRE &DUMMY)
             RCLRSC
             ENDDO

             ENDPGM
