/********************************************************************/
             PGM
             DCL        VAR(&ANTKOL) TYPE(*DEC) LEN(2 0) VALUE(2)
             DCL        VAR(&TYPE0) TYPE(*CHAR) LEN(1) VALUE('H')
             DCL        VAR(&TYPE1) TYPE(*CHAR) LEN(1) VALUE('S')
             DCL        VAR(&TYPE2) TYPE(*CHAR) LEN(1) VALUE('D')
             DCL        VAR(&TYPE3) TYPE(*CHAR) LEN(1) VALUE('E')
             DCL        VAR(&TEXT0) TYPE(*CHAR) LEN(700) VALUE('Dette +
                          er en test av en tabell')
             DCL        VAR(&TEXT1) TYPE(*CHAR) LEN(700) +
                          VALUE('tabell1                            +
                          Tabell2')
             DCL        VAR(&TEXT3) TYPE(*CHAR) LEN(700) +
                          VALUE('totallinje                         +
                          Totatallinje')
             DCL        VAR(&COLOR1) TYPE(*CHAR) LEN(20) VALUE('GB')
             DCL        VAR(&COLOR3) TYPE(*CHAR) LEN(20) VALUE('BR')
             DCL        VAR(&COLOR) TYPE(*CHAR) LEN(20) VALUE('G')
             DCL        VAR(&BACK) TYPE(*CHAR) LEN(20)
             DCL        VAR(&BACK1) TYPE(*CHAR) LEN(20) VALUE('YP')
             DCL        VAR(&BACK3) TYPE(*CHAR) LEN(20) VALUE('PY')
             DCL        VAR(&RIGLEF) TYPE(*CHAR) LEN(20)
             DCL        VAR(&BOLD) TYPE(*CHAR) LEN(20) VALUE('J')
             DCL        VAR(&RIGLE1) TYPE(*CHAR) LEN(20) VALUE('LR')
             DCL        VAR(&RIGLE3) TYPE(*CHAR) LEN(20) VALUE('RL')
             DCL        VAR(&SIZE) TYPE(*CHAR) LEN(20) VALUE('1')
             DCL        VAR(&SIZE1) TYPE(*CHAR) LEN(20) VALUE('17')
             DCL        VAR(&SIZE3) TYPE(*CHAR) LEN(20) VALUE('71')
             CLRPFM     FILE(HTMLMAIL)
             CALL       PGM(SYHT03) PARM(&ANTKOL &TYPE0 &TEXT0 +
                          &COLOR &BACK &RIGLEF &BOLD &SIZE)
             CALL       PGM(SYHT03) PARM(&ANTKOL &TYPE1 &TEXT1 +
                          &COLOR1 &BACK1 &RIGLE1 &BOLD &SIZE1)
             CALL       PGM(SYHT03) PARM(&ANTKOL &TYPE3 &TEXT3 +
                          &COLOR3 &BACK3 &RIGLE3 &BOLD &SIZE3)
             SBMJOB     CMD(CALL PGM(MAIL198)) +
                          JOB(SNDEMAIL) JOBD(*USRPRF) +
                          JOBQ(SYJOBQNMAX)
             ENDPGM
