/********************************************************************/
             PGM
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70) +
                          VALUE('svein.huse@systema.no')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CLRPFM     FILE(STAWRK)
             CALL       PGM(SYHT01) PARM(&EPOST)
             CALL       PGM(SYHT02CL) PARM(&EPOST)
             ENDPGM
