/* BYTTET TIL WORKFIL 4096 */
             PGM
             DCL        VAR(&SDV) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&TMPFIL) TYPE(*CHAR) LEN(10) +
                          VALUE('SYIM11F')
             DCL        VAR(&STMFIL) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(15)
             DCL        VAR(&FLR) TYPE(*CHAR) LEN(10) VALUE(QPGMR)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LISS) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JUL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(70) +
                          VALUE('Ufortollede sendinger paa EMAIL')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10) +
                          VALUE('SYIM11P')
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&SNDNA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SNDAD) TYPE(*CHAR) LEN(8)
/*                                                                         */
/*                 */
/* HENTER DAGNR    */
/*                 */
             CHGJOB     DATFMT(*JUL)
             RTVJOBA    DATE(&DATE)
             CHGJOB     DATFMT(*SYSVAL)
             CHGVAR     VAR(&JUL) VALUE(%SST(&DATE 3 3))
/*                 */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CALL       PGM(EPOS04E) PARM(&QUSER &SNDNA &SNDAD &EPOST)
/*                                                                         */
/* FIKSER WORKFIL FOR SDV LOGIKK                                           */
/*                                                                         */
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             RMVM       FILE(&TMPFIL) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ADDPFM     FILE(&TMPFIL) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(&TMPFIL) TOFILE(&TMPFIL) MBR(&UNIK)
             OVRPRTF    FILE(SYIM11P) PAGESIZE(70 120) OVRFLW(66) +
                          HOLD(*YES)
             CALL       PGM(SYIM11R) PARM(&EPOST &JUL &IN01 &CVP1 +
                          &CVP2 &CVP3 &CVP4 &CVP5 &CVP6 &CVP7 &CVP8 +
                          &PRT &SDV)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             IF         COND(&PRT *NE '          ') THEN(DO)
             IF         COND(&EPOST *EQ '          ') THEN(DO)
             CHGSPLFA   FILE(SYIM11P) SPLNBR(*LAST) OUTQ(&PRT)
             GOTO       CMDLBL(SLUTT)
             ENDDO
             ENDDO
             IF         COND(EPOST = '  ') THEN(GOTO CMDLBL(SLUTT))
/*                                       */
             CALL       PGM(PDF003) PARM(&LISS)
             IF         COND(&LISS = 'J') THEN(DO)
/*                                       */
/* KOPIER TIL SEMIKOLONSEP. FIL */
/*                                       */
             IF         COND(&SDV = 'J') THEN(DO)
             RGZPFM     FILE(SYIM11F) MBR(&UNIK) KEYFILE(*FILE)
             MONMSG     MSGID(CPF0000)
/* UNIKE FILNAVN  */
             CHGVAR     VAR(&STMF) VALUE(&UNIK *CAT '.CSV')
/* LAGER BANEN TIL FILEN */
             CHGVAR     VAR(&STMFIL) VALUE('/QDLS/QPGMR/' *CAT &STMF)
             CALL       PGM(SYGE28CL) PARM(&TMPFIL)
/*                                       */
/* KOPIERER PRINT TIL  FILEN */
/* FØRST HEADER              */
/*           CPYTOIMPF  FROMFILE(TMP1024) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*PERIOD) */
/*           CPYTOIMPF  FROMFILE(TMP2048) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*PERIOD)    */
             CPYTOIMPF  FROMFILE(TMP4096) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*PERIOD)


             CPYTOIMPF  FROMFILE(&TMPFIL) TOSTMF(&STMFIL) +
                          MBROPT(*ADD) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) FLDDLM(';') DECPNT(*PERIOD)
/* FIX DOC-BESKRIVEØLSE = EMNE I MAIL )*/

             CHGVAR     VAR(&EMNE) VALUE('TOLLAGERLISTE SENDT +
                           SOM  .CSV-fil')
             CHGDOCD    DOC(&STMF) FLR(&FLR) DOCD(&EMNE) +
                          USRAUT((*PUBLIC *ALL))
/* SEND FILA SEM EPSOT (TIL SEG SELV..)*/
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD('FIL') +
                          MSG(&CVP1) DOC(&STMF) FLR(&FLR)
             RMVM       FILE(&TMPFIL) MBR(&UNIK)
                          RETURN
/*                                       */
             ENDDO
             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST &EMNE +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &PDF)
             GOTO       CMDLBL(SLUTT)
             ENDDO
             CALL       PGM(FAXEP120) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST &EMNE &CVP1 &CVP2 &CVP3 &CVP4 +
                          &CVP5 &CVP6 &CVP7 &CVP8 &CVP)
SLUTT:       ENDPGM
