             PGM        PARM(&UNIKF &EPOST)
             DCL        VAR(&UNIKF) TYPE(*CHAR) LEN(9) /* Unikkode */
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(50)
             DCL        VAR(&END) TYPE(*CHAR) LEN(1) VALUE('E')
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(60)
             CHGVAR     VAR(&PARM) VALUE(&UNIKF *CAT &EPOST *CAT +
                          &END)
             SBMJOB     CMD(CALL PGM(SYIM51CLE) PARM(&PARM +
                          )) JOB(UFORTOLL) JOBD(*USRPRF) +
                          JOBQ(SYJOBQNMAX)
             ENDPGM
