             PGM
             DCL        VAR(&INNPR) TYPE(*CHAR) LEN(5) VALUE('IN2PR') +
                          /* INNPR = fly-innland. IN2PR = jetpakke. */
    /* */
    /* VEDLIKEHOLD AV FLYFRAKTRATER JETPAKKE */
             CALL       PGM(SYFI02) PARM(&INNPR)
    /* */
             ENDPGM
