             PGM
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til flyfraktbrev. */
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til flyfraktbrev. */
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til merkelapp-1. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til merkelapp-1. */
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til merkelapp-2. */
             DCL        VAR(&PT3) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til merkelapp-2. */
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
    /* */
             RTVDTAARA  DTAARA(*LDA (621 10)) RTNVAR(&PRT1)
             RTVDTAARA  DTAARA(*LDA (631 10)) RTNVAR(&PT1)
             RTVDTAARA  DTAARA(*LDA (641 10)) RTNVAR(&PRT2)
             RTVDTAARA  DTAARA(*LDA (651 10)) RTNVAR(&PT2)
             RTVDTAARA  DTAARA(*LDA (661 10)) RTNVAR(&PRT3)
             RTVDTAARA  DTAARA(*LDA (671 10)) RTNVAR(&PT3)
    /* */
    /* SKRIVER UT INNENLANDS FLYFRAKTBREV */
             OVRPRTF    FILE(FLYFRAKT) PAGESIZE(72 85) LPI(8) +
                          CPI(10) OVRFLW(72) OUTQ(&PRT1) FORMTYPE(&PT1)
             OVRPRTF    FILE(MERKL1) OUTQ(&PRT2) PAGESIZE(18 50) +
                          CPI(10) OVRFLW(18) FORMTYPE(&PT2)
             OVRPRTF    FILE(MERKL2) OUTQ(&PRT3) PAGESIZE(24 50) +
                          CPI(10) OVRFLW(24) FORMTYPE(&PT2)
             CALL       PGM(SYIN44) PARM(&PRANT)
             SNDPGMMSG  MSG(' ' *BCAT &PRANT *BCAT 'MAWB-innenlands +
                          flyfraktbrev er klare til utskrift.') +
                          MSGTYPE(*INFO)
    /* */
 SLUTT:      ENDPGM
