             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
 /*                                                                */
 /*  Kall vedlikeholdsprogram - returnerer parameter for valuta-   */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '0') THEN(CALL PGM(SYIS10O))
             ENDPGM
