/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 IKKE INTIER ARBEIDFIL                              */
/* ********************************************************************    */
             PGM        PARM(&AVD &OPD &LOP &SAKN &FORM &PRT &SPLQ &ANT +
                             &SAV &HLD &EPOST)
  /* */
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40) VALUE('SENDER +
                          AVVIKSRAPPORT VIA EPOST')
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10) +
                          VALUE('SYIS20PF')
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&LOP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&SAKN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SPLQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(2)
             DCL        VAR(&SAV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&HLD) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSAV) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WHLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*S01        CALL       PGM(SYIS10BC)         */
    /* */
 /*  */
             IF         COND(&SAV *EQ 'J') THEN(CHGVAR VAR(&WSAV) +
                          VALUE('*YES'))
             IF         COND(&SAV *EQ ' ') THEN(CHGVAR VAR(&WSAV) +
                          VALUE('*NO'))
             IF         COND(&HLD *EQ 'J') THEN(CHGVAR VAR(&WHLD) +
                          VALUE('*YES'))
             IF         COND(&HLD *EQ ' ') THEN(CHGVAR VAR(&WHLD) +
                          VALUE('*NO'))
 /*  */
             IF         COND(&EPOST = ' ') THEN(DO)
             OVRPRTF    FILE(SYIS20PF) PAGESIZE(72 80) OVRFLW(66) +
                          OUTQ(&PRT) FORMTYPE(&FORM) COPIES(&ANT) +
                          HOLD(&WHLD) SAVE(&WSAV)
             CALL       PGM(SYIS22) PARM(&AVD &OPD &LOP &SAKN)
                          RETURN
                          ENDDO
 /*                                                                 */
 /* VED EPOSTSENDING                                                */
 /*                                                                 */
             OVRPRTF    FILE(SYIS20PF) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          80) OVRFLW(66) OUTQ(OUTMAIL)
 /*  */
             CALL       PGM(SYIS22) PARM(&AVD &OPD &LOP &SAKN)
/*                                       */
/* KALLER PROGRAMMET SOM SENDER EPOSTEN  */
/*                                       */
             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &CVP9 &PDF)

 /*  */
 SLUTT:      ENDPGM
