             PGM
             DCL        VAR(&IN01) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* ARB.STASJ*/
             DCL        VAR(&FLAGG) TYPE(*CHAR) LEN(1) VALUE('O')
                        /*"O"=OMKJ:IKKE OPPDATER FAKT.LINJER/STATIST?*/
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
             CALL       PGM(INLIBL)

             CALL       PGM(*LIBL/SYFAFICL) PARM(&IN01)
             IF         COND(&IN01 *EQ '1') THEN(DO)
             SNDBRKMSG  MSG('Du er ikke registrert som bruker i +
                          økonomisystemet - overføringen er +
                          avbrutt.') TOMSGQ(&WS)
             GOTO       CMDLBL(SLUTT)
             ENDDO
/* */
/* KALLER SYOM35 FOR Å SETTE 'O' TILBAKE TIL 'G'  */
/* */
             CALL       PGM(SYOK35) PARM(&IN01)
             IF         COND(&IN01 *EQ '3') THEN(DO)
             SNDBRKMSG  MSG('F3/F12-avslutt uten å kjøre er valgt. +
                          Ingen bilag er merket.  Omkjøringen +
                          avbrytes') TOMSGQ(&WS)
             GOTO SLUTT
             ENDDO
/* */
             SNDBRKMSG  MSG('Bilag er merket for omkjøring. Du kan +
                          nå gjenta prosessen, dersom det er flere +
                          som skal merkes med det samme. Når du har +
                          merket alle du vil, kan du ENTEN KJØRE +
                          PKT 59 FOR Å FÅ EN SEPARAT JOURNAL BARE +
                          MED OMKJØRINGSMERKEDE BILAG, eller du kan +
                          vente til bilagene inngår i de ordinære +
                          journalene ved vanlig overføring. UANSETT +
                          blir det enkelte bilaget merket i +
                          journalen med referanse til gammelt +
                          journalnr, og de GÅR IKKE OVER I +
                          STATISTIKK DOBBELT OPP') TOMSGQ(&WS)

 SLUTT:      ENDPGM
