             PGM        PARM(&PARM1 &PRT &PT)
             DCL        VAR(&PARM1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* */
    /* FIX PRINTERFILE          */
    /* */
             IF         COND(&PRT = ' ') THEN(DO)
             OVRPRTF    FILE(SYKS31PF) PAGESIZE(70 120) CPI(15) +
                   OVRFLW(60) OUTQ(QRPINT) FORMTYPE(&PT) HOLD(*YES)
                          ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SYKS31PF) PAGESIZE(70 120) CPI(15) +
                          OVRFLW(60) OUTQ(&PRT) FORMTYPE(&PT)
                        ENDDO
    /* */
             CALL       PGM(SYKS31) PARM(&PARM1)
    /* */
             IF         COND(&PRT = ' ') THEN(DO)
             DSPSPLF    FILE(SYKS31PF) SPLNBR(*LAST)
             DLTSPLF    FILE(SYKS31PF) SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                        ENDDO
 SLUTT:      ENDPGM
