             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&IMP) TYPE(*CHAR) LEN(1) VALUE('N') /* +
                          Hvis &IMP = 'J', betyr det at det nå er +
                          inne importplanlegging. */
             DCL        VAR(&SY10) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&TRAN) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&PRO) TYPE(*DEC) LEN(8 0) VALUE(0)
             DCL        VAR(&PRN) TYPE(*DEC) LEN(3 0) VALUE(101)
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10) /* Printerna */
             DCL        VAR(&PT1) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPP) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&OVR) TYPE(*DEC) LEN(3 0) VALUE(66)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
                                                          /**/
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
                                                          /**/
    /* */
    /* SJEKKER OM LASER */
    /* */
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             CALL       PGM(GETPR3) PARM(&AVD &PRN &PRT1 &PT1 &LASER +
                          &LPI2)
/* LASER */
             IF         COND(&LASER = 'J') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('066')
             CHGVAR     VAR(&OVR) VALUE('060')
             ENDDO
    /* */
    /* SKRIVER UT STATISTIKK */
    /* ----------------------------------------------------------- */
             IF         COND(&LASER = 'J') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('070')
             ENDDO
             OVRPRTF    FILE(SYKS90P) PAGESIZE(&LPP 80) CPI(10) +
                          OVRFLW(&OVR) PAGRTT(0) OUTQ(&PRT1) +
                          FORMTYPE(&PT1)
    /* */
             CALL       PGM(SYKS90) PARM(&IMP &SY10 &PRO &TRAN)
SLUTT:       ENDPGM
