             PGM        PARM(&STATUS &FAKNR &FROM &TO)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&STATUS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAKNR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(35)
             DCL        VAR(&TO) TYPE(*CHAR) LEN(35)
 /* MÅ HA EKSKLUSIV TILGANG PÅ FILA FOR Å HINDRE AT "NOE ER PÅ GANG"*/
 ALLOC:
             ALCOBJ     OBJ((INTFAS *FILE *EXCL))
             MONMSG     MSGID(CPF0000) EXEC(DO)
             DLYJOB     DLY(10)
             GOTO       CMDLBL(ALLOC)
             ENDDO

             CALL       PGM(SYKS37) PARM(&STATUS &FAKNR &FROM &TO)

 END:        DLCOBJ     OBJ((INTFAS *FILE *EXCL))

             ENDPGM
