             PGM
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&NOE) TYPE(*CHAR) LEN(1)
 /*BESTILLINGSPROGRAM */
             CALL       PGM(SYKS37B) PARM(&NOE)

             IF         COND(&NOE *EQ 'J') THEN(CALL PGM(SYKS38CL))

             ENDPGM
