             PGM        PARM(&SKRIVER &OUTQ)
             DCL        VAR(&SKRIVER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OUTQ)    TYPE(*CHAR) LEN(10)
             SBMJOB     CMD(RUNQRY QRY(QKSUATT)) OUTQ(&SKRIVER)
             ENDPGM
