             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CLRPFM     FILE(QTEMP/SYKS04WF)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(SYKS04WF) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             OVRDBF     FILE(SYKS04W2) TOFILE(QTEMP/SYKS04WF) +
                          OVRSCOPE(*JOB)
             ENDPGM
