             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10) VALUE(INTFA80)
             DCL        VAR(&MBRTXT) TYPE(*CHAR) LEN(50) +
                          VALUE('SYSPED INTERNFAKTURA - FLATFIL')
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(35)
             DCL        VAR(&TO) TYPE(*CHAR) LEN(35)
             DCL        VAR(&FMS1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&FMS2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OK) TYPE(*LGL) LEN(1)
 /* MÅ HA EKSKLUSIV TILGANG PÅ FILA FOR Å HINDRE AT "NOE ER PÅ GANG"*/
 ALLOC:
             ALCOBJ     OBJ((INTFAS *FILE *EXCL))
             MONMSG     MSGID(CPF0000) EXEC(DO)
             DLYJOB     DLY(60)
             GOTO       CMDLBL(ALLOC)
             ENDDO

/* */
             CRTPF      FILE(QTEMP/&FILE) RCDLEN(80) /* INTFA80 */
             MONMSG     MSGID(CPF7302)

 FLERE:      CLRPFM     FILE(QTEMP/&FILE)
             /*____________________*/
             /* ER DET NOE Å SENDE?? */
             /*""""""""""""""""""""*/
             CALL       PGM(SYKS38) PARM(&FROM &TO &OK)
             IF         COND(&OK *EQ '0') THEN(GOTO CMDLBL(OK))
             GOTO       CMDLBL(END)
 OK:         CALL       PGM(EGF03C) PARM(&FILE &MBRTXT &FROM &TO +
                          &FMS1 &FMS2)
 /* FLERE PARTER Å SENDE TIL??? */
             GOTO       CMDLBL(FLERE)

 END:        DLCOBJ     OBJ((INTFAS *FILE *EXCL))

             ENDPGM
