             PGM
             DCL        VAR(&BRUKER) TYPE(*CHAR) LEN(10)
             RTVJOBA    USER(&BRUKER)
             CALL       PGM(SYKS62) PARM(&BRUKER)
             ENDPGM
