/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers Beskrivelse..........................               */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* P0XXXX* 01 YBC PTF5 OVERSTYRE KOSTBVIS TIL KOSTB                        */
/* ********************************************************************    */
             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SAVDTA) TYPE(*CHAR) LEN(1024)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&FLAGG) TYPE(*CHAR) LEN(1)

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             RTVDTAARA  DTAARA(*LDA (1 1024)) RTNVAR(&SAVDTA)
             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGDTAARA  DTAARA(*LDA (401 10)) VALUE(&USER)

 START:      CLRPFM     FILE(WINTF)

             CALL       PGM(*LIBL/SYFAFICL) PARM(&IN01)
             CALL       PGM(SYKSIN) PARM(&IN01)
             IF         COND(&IN01 *EQ '1') THEN(DO)
             GOTO SLUTT
             ENDDO
             CALL       PGM(SYKSIN01) PARM(&FLAGG)
 /*FLAGG 2 = F12 - TILBAKE   */
 /*FLAGG 3 = F03 - AVSLUTT   */
 /*FLAGG 0 = F10 - FULLFØR   */
             IF         COND(&FLAGG *EQ '2') THEN(DO)
             CHGVAR     VAR(&IN01) VALUE('1')
             GOTO       CMDLBL(START)
             ENDDO

             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE(&SAVDTA)

SLUTT:       ENDPGM
