             PGM
             DCL        VAR(&SLETT) TYPE(*CHAR) LEN(1)
             CALL       PGM(SYKSDE) PARM(&SLETT)
             IF         COND(&SLETT = 'N') THEN(GOTO CMDLBL(SLUTT))
             RGZPFM     FILE(KOSTA)
             RGZPFM     FILE(KOSTB)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(FRISKK)
             MONMSG     MSGID(CPF2995 CPF2981)
 SLUTT:      ENDPGM
