/********************************************************************/
/*   KUNDESPESIFIKE!!!!!    FASTE KODER - OPPDATERING           */
/********************************************************************/
             PGM        PARM(&TYPE)
             DCL        VAR(&UPDATE) TYPE(*CHAR) LEN(1) VALUE('N') +
                          /* <N> betyr man KUN vedlikeholde poster +
                          i samme type. */
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(5)
             OVRDBF     FILE(KOFAST) TOFILE(KUFAST)
             CALL       PGM(SYFAKD) PARM(&TYPE &UPDATE &KODE)
             DLTOVR     FILE(KOFAST)
             ENDPGM
