             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CLRPFM     FILE(QTEMP/LLW013)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(LLW013*) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))

             ENDPGM
