             PGM        PARM(&KNR &REF1 &REF2 &REF3 &EPOST)
             DCL        VAR(&KNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&REF1) TYPE(*CHAR) LEN(17)
             DCL        VAR(&REF2) TYPE(*CHAR) LEN(17)
             DCL        VAR(&REF3) TYPE(*CHAR) LEN(17)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40) +
                          VALUE('WEB-PLUKKLISTE ER KOMMET.')
             DCL        VAR(&MSGTXT) TYPE(*CHAR) LEN(256)

             CHGVAR     VAR(&MSGTXT) VALUE('Plukkliste er kommet fra +
                          kundenr=' *BCAT &KNR *BCAT ', Kunderef1=' +
                          *BCAT &REF1 *BCAT ', ' *BCAT 'Kunderef2=' +
                          *BCAT &REF2 *BCAT ', ' *BCAT 'kunderef3=' +
                          *BCAT &REF3 *BCAT '.')
             SNDDST     TYPE(*LMSG) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          LONGMSG(&MSGTXT) SNDFMT(*NOCHG) DOCD(&EMNE)
             ENDPGM
