             PGM        PARM(&PARM)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0) VALUE(1)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0) VALUE(1)
             DCL        VAR(&PNR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&USN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) VALUE('*JOB')
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&MRNR) TYPE(*CHAR) LEN(5)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(LL027P) PAGESIZE(70 120) CPI(15) +
                          OVRFLW(61) PAGRTT(0) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) HOLD(*YES) SPLFOWN(*JOB)
             CALL       PGM(LL027R) PARM(&LAS &STR &KOPI &PARM)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&PNR) VALUE(%SST(&PARM 9 8))
             CHGVAR     VAR(&MRNR) VALUE(%SST(&PARM 17 5))
             CHGVAR     VAR(&USN) VALUE(%SST(&PARM 24 10))
             CHGVAR     VAR(&STMF) VALUE('/syspeddev/temp/LMR' *CAT +
                          &PNR *CAT &MRNR *CAT &USN *CAT '.PDF')
             CVTSPLFPDF SPLF(LL027P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) TOPDF(&STMF)
             DLTSPLF    FILE(ll027P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
