             PGM        PARM(&AVD &OPD &PTY &PNVN)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PNVN) TYPE(*CHAR) LEN(10)

 /* SJEKKER PRINTERTYPE OG KALLER PÅ RIKTIG PGM.        */

             IF         COND(&PTY = 'ZEBRA   ') THEN(DO)
             OVRPRTF    FILE(SYLA01P) OUTQ(&PNVN)
             CALL       PGM(SYLA01R) PARM(&AVD &OPD)
             DLTOVR     FILE(SYLA01P)
             ENDDO

             IF         COND(&PTY = 'ZEBRA 95') THEN(DO)
             OVRPRTF    FILE(SYLA01P) OUTQ(&PNVN)
             CALL       PGM(SYLA01R) PARM(&AVD &OPD)
             DLTOVR     FILE(SYLA01P)
             ENDDO

             IF         COND(&PTY = 'STRIPE  ') THEN(DO)
             OVRPRTF    FILE(SYLA02P) OUTQ(&PNVN)
             CALL       PGM(SYLA02R) PARM(&AVD &OPD)
             DLTOVR     FILE(SYLA02P)
             ENDDO

             IF         COND(&PTY = 'ELTRON  ') THEN(DO)
             OVRPRTF    FILE(SYLA03P) OUTQ(&PNVN)
             CALL       PGM(SYLA03R) PARM(&AVD &OPD)
             DLTOVR     FILE(SYLA03P)
             ENDDO

             ENDPGM
