/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 OVRPRTF TAS I RPG-PROGRAM                          */
/* ********************************************************************    */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&PNR) TYPE(*DEC) LEN(3 0) VALUE(013)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(10)
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CHGDTAARA  DTAARA(*LDA) VALUE(*BLANK)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             CALL       PGM(GETPRT) PARM(&AVD &PNR &PRT &FORM)
/*S01        OVRPRTF    FILE(SYLG01P) PAGESIZE(70 80) CPI(10) +
                          OVRFLW(60) OUTQ(&PRT) FORMTYPE(&FORM)      */
/*S01        CALL       PGM(SYLG01R) PARM(&IN01)                     */
/*N01*/      CALL       PGM(SYLG01R) PARM(&IN01 &PRT &FORM)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))
             SNDPGMMSG  MSG('Liste er sendt til printer ' *BCAT &PRT +
                          *BCAT '.') MSGTYPE(*INFO)
 SLUTT:      ENDPGM
