             PGM
             DCL        VAR(&LEV) TYPE(*DEC) LEN(8 0) VALUE(500)
             DCL        VAR(&GEB)  TYPE(*CHAR) LEN(3)
             CALL       PGM(SYNA05) PARM(&LEV &GEB)
             ENDPGM
