             PGM        PARM(&OBJ &FIL &FRAOBJ &TILBAN)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&FRAOBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&TILBAN) TYPE(*CHAR) LEN(70)
             RNM        OBJ(&OBJ) NEWOBJ(&FIL)
             MONMSG     MSGID(CPF0000)
             CPY        OBJ(&FRAOBJ) TODIR(&TILBAN) TOCCSID(277)
             MONMSG     MSGID(CPF0000)
             DMPCLPGM
             ENDPGM
