             PGM  PARM(&BUNR &PRT &FORM &ARB)

             DCL        VAR(&BUNR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ARB) TYPE(*CHAR) LEN(1)
    /* STÅENDE A4 */
             IF         COND(&FORM = 'S') THEN(DO)
             OVRPRTF    FILE(SYPA09P) PAGESIZE(70 120) +
                        CPI(15) OVRFLW(66) OUTQ(&PRT) FORMTYPE(A4)
                        ENDDO
    /* LIGGENDE A4 */
             IF         COND(&FORM = 'L') THEN(DO)
             OVRPRTF    FILE(SYPA09P) PAGESIZE(48 120) +
                        CPI(10) OVRFLW(45) OUTQ(&PRT) FORMTYPE(*STD)
                        ENDDO

             CALL       PGM(SYPA09) PARM(&BUNR &ARB)
    /* */
             ENDPGM
