             PGM
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('B')
             DCL        VAR(&KUNDE) TYPE(*DEC) LEN(8 0) VALUE(0)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYPO07) PARM(&KODE &KUNDE)
             CALL       PGM(SYPO08)
             ENDPGM
