             PGM
             DCL        VAR(&CPI) TYPE(*CHAR) LEN(2) VALUE('10')
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UDOKN) TYPE(*DEC) LEN(3 0) VALUE(69)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&AVDA) TYPE(*CHAR) LEN(4)  +
                          /* AVDELING                 */
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)+
                          /* AVDELING                 */
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(10) /* Skal +
                          heading skrives     */
        /* */
             CALL       PGM(SYGE18) PARM(&UDOKN &PRT &LAS &STR &PTY +
                          &HOLD &SAVE &KOPI &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))
        /* */
             OVRPRTF    FILE(SYPO21PF) PAGESIZE(72 120) LPI(6) +
                          CPI(&CPI) OVRFLW(72) FONT(*CPI) OUTQ(&PRT) +
                          FORMTYPE(&PTY) COPIES(&KOPI) HOLD(&HOLD) +
                          SAVE(&SAVE)
             CALL       PGM(SYPO21)  PARM(&LAS &STR &KOPIA)
 /*          CALL       PGM(SYYA02CLA) PARM(SYPO21PF) */
 SLUTT:      ENDPGM
