             PGM        PARM(&UTSKRIFTNR)
             DCL        VAR(&UTSKRIFTNR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DOKNAVN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&WS)
             CLRPFM     FILE(PRTDOCA) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(PRTDOCA) +
                          MBR(&WS))
             OVRDBF     FILE(PRTDOCA) TOFILE(PRTDOCA) MBR(&WS)
             CLRPFM     FILE(PRTDOCB) MBR(&WS)
             MONMSG     MSGID(CPF3141) EXEC(ADDPFM FILE(PRTDOCB) +
                          MBR(&WS))
             OVRDBF     FILE(PRTDOCB) TOFILE(PRTDOCB) MBR(&WS)
             OVRPRTF    FILE(&UTSKRIFTNR) HOLD(*YES)
             CPYSPLF    FILE(&UTSKRIFTNR) TOFILE(PRTDOCA) +
                          SPLNBR(*LAST) TOMBR(&WS) CTLCHAR(*PRTCTL)
             MONMSG     MSGID(CPF3309) EXEC(GOTO CMDLBL(INTET))
             DLTSPLF    FILE(&UTSKRIFTNR) SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYYA02B)
             GOTO       CMDLBL(SLUTT)
 INTET:      SNDPGMMSG  MSG('Ingen utskrift.')
 SLUTT:      ENDPGM
