             PGM        PARM(&WSAVNR &UKUNNR &FLAGG)
             DCL        VAR(&WSAVNR) TYPE(*DEC) LEN(9 0)
             DCL        VAR(&UKUNNR) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             OVRDBF     FILE(AVFRHCOP) TOFILE(AVFRH) OVRSCOPE(*JOB)
             OVRDBF     FILE(AVFRDL01C) TOFILE(AVFRDL01) OVRSCOPE(*JOB)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYPO09) PARM(&WSAVNR &UKUNNR &FLAGG)
             ENDPGM
