             PGM
             DCL        VAR(&WSAVNR) TYPE(*DEC) LEN(9 0) VALUE(0)
             DCL        VAR(&UKUNNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(1)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRDBF     FILE(AVFRHCOP) TOFILE(AVFRH)
             OVRDBF     FILE(AVFRDL01C) TOFILE(AVFRDL01)
             CALL       PGM(SYPO09) PARM(&WSAVNR &UKUNNR &FLAGG)
             ENDPGM
