             PGM
             DCL        VAR(&AVD)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK)   TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             RTVJOBA    NBR(&NBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &NBR)


             ADDPFM     FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(ARKSRC) MBR(&UNIK)
             OVRDBF     FILE(ARKSRC) TOFILE(&LIB/ARKSRC) MBR(&UNIK)
 /*Arbeid med psoter som ikke kunne sendes ... */
             CALL       PGM(SYRU03) PARM(&UNIK)

 /*Send alle som nå tilfredstiller krav ... */
             CALL       PGM(SYRU02) PARM(&AVD &OPD &UNIK)

             RMVM       FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             ENDPGM
