             PGM
             DCL        VAR(&AVD)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD)    TYPE(*CHAR) LEN(7)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK)   TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             RTVJOBA    NBR(&NBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &NBR)

             CALL       PGM(SYRU01) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))

             ADDPFM     FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(ARKSRC) MBR(&UNIK)
             OVRDBF     FILE(ARKSRC) TOFILE(&LIB/ARKSRC) MBR(&UNIK)

             CALL       PGM(SYRU02) PARM(&AVD &OPD &UNIK)

             RMVM       FILE(ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
 SLUTT:      ENDPGM
