             PGM
             DCL        VAR(&VEI) TYPE(*CHAR) LEN(1) VALUE('D')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRDBF     FILE(FRATN) TOFILE(FRATNWRK)
             OVRDBF     FILE(FRATNWRK) TOFILE(FRATN)
             CALL PGM(SYSA50)  PARM(&VEI)
             DLTOVR     FILE(*ALL)
             ENDPGM
