             PGM
             DCL        VAR(&VEI) TYPE(*CHAR) LEN(1) VALUE('S')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL PGM(SYSA50)  PARM(&VEI)
             DLTOVR     FILE(*ALL)
             ENDPGM
