             PGM
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&KDB) TYPE(*CHAR) LEN(5)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYSJ11) PARM(&FLAGG &KDB)
             ENDPGM
