             PGM        PARM(&PARM &ATTN)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(577)
             DCL        VAR(&ATTN) TYPE(*CHAR) LEN(40)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(12)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&CVP01) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP02) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP03) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP04) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP05) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP06) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP07) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP08) TYPE(*CHAR) LEN(40)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYSJ69P)  DEVTYPE(*SCS) +
                          PAGESIZE(72 90) LPI(8) CPI(15) +
                          OVRFLW(72) DRAWER(3) OUTQ(FAX/FAXOUT)
       /* */
             CHGVAR     VAR(&AVD) VALUE(%SST(&PARM 1 4))
             CHGVAR     VAR(&OPD) VALUE(%SST(&PARM 5 7))
             CHGVAR     VAR(&NAVN) VALUE(%SST(&PARM 297 30))
             CHGVAR     VAR(&FAXNR) VALUE(%SST(&PARM 17 21))
             CALL       PGM(SYSJ69A) PARM(&AVD &OPD &NAVN &FAXNR &ATTN)
    /* ----------------------------------------------------------- */
             CALL       PGM(FAX017) PARM(&FAXNR)

             CHGVAR     VAR(&CVP) VALUE(%SST(&PARM 16 1))
             CHGVAR     VAR(&FILEN) VALUE(%SST(&PARM 38 12))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&PARM 50 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&PARM 58 8))
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)

             CHGVAR     VAR(&CVP01) VALUE(%SST(&PARM 257 40))
             CHGVAR     VAR(&CVP02) VALUE(%SST(&PARM 297 40))
             CHGVAR     VAR(&CVP03) VALUE(%SST(&PARM 337 40))
             CHGVAR     VAR(&CVP04) VALUE(%SST(&PARM 377 40))
             CHGVAR     VAR(&CVP05) VALUE(%SST(&PARM 417 40))
             CHGVAR     VAR(&CVP06) VALUE(%SST(&PARM 457 40))
             CHGVAR     VAR(&CVP07) VALUE(%SST(&PARM 497 40))
             CHGVAR     VAR(&CVP08) VALUE(%SST(&PARM 537 40))
             IF         COND(&CVP = 'J') THEN(DO) /* MED COVERPAGE */
             FAX/SNDFAXSPLF FILE(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAXNR *N &NAVN)) +
                          CPGPAG(*DFT) CPGTXT(&CVP01 &CVP02 &CVP02 +
                          &CVP04 &CVP05 &CVP06 &CVP07 &CVP08)
             ENDDO
             ELSE       CMD(DO)
             FAX/SNDFAXSPLF FILE(&FILEN) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAXNR *N &NAVN))
             ENDDO

             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &FILEN &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
       /* */
             ENDPGM
