             PGM        PARM(&SG &SD &DT &MN &DTS &PRT35 &PT35 &JOBK)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&SD) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DT) TYPE(*CHAR) LEN(6)
             DCL        VAR(&MN) TYPE(*CHAR) LEN(17)
             DCL        VAR(&DTS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PRT35) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT35) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
       /* */
             IF         COND(&JOBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYSJ58CLJ) PARM(&SG &SD &DT &MN +
                          &DTS &PRT35 &PT35)) JOB(SAMLAST) +
                          JOBD(*USRPRF) JOBQ(*LIBL/SYJOBQNMAX)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYSJ58CLJ) PARM(&SG &SD &DT &MN &DTS +
                          &PRT35 &PT35)
                        ENDDO
       /* */
             ENDPGM
