             PGM
             DCL        VAR(&KOP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&OPDF) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDT) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&PRT26) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT26) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT28) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT28) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CHGVAR     VAR(&IN01) VALUE('0')
             CALL       PGM(SYSJBL) PARM(&IN01 &OPDF &OPDT &PRT26 +
                          &PT26 &PRT28 &PT28 &JOBK &KOP)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJ15CL) PARM(&OPDF &OPDT &PRT26 &PT26 +
                          &PRT28 &PT28 &JOBK &KOP)
       /* */
 SLUTT:      ENDPGM
