             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(0)
                                                          /**/
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
 AVD:        CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
                                                          /**/
             CALL       PGM(SYSJ24) PARM(&FLAGG)
             IF         COND(&FLAGG = 1) THEN(GOTO CMDLBL(AVD)) /* +
                          Hvis &flagg = 1, bytter avdelinger. */
                                                          /**/
SLUTT:       ENDPGM
