             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) /* Hvis &in03 +
                          på, skal losseliste  være stående. */
             DCL        VAR(&IN04) TYPE(*LGL) LEN(1) /* Hvis &in04 +
                          på, skal printetype være 4224. */
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&IN05) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in05 på, betyr programkallinng fra +
                          BORDERAUR. */
             DCL        VAR(&IN06) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in06 på, betyr programkalleing fra +
                          MANEFEST. */
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in07 på, betyr programkallinng fra +
                          KREDITERING. */
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in08 på, betyr programkallinng fra +
                          FAKTURERING. */
             DCL        VAR(&CMR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VF) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('F')
             DCL        VAR(&VB) TYPE(*CHAR) LEN(1)
             DCL        VAR(&EKSP) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&LG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PO) TYPE(*CHAR) LEN(1)
    /* */
             DCL        VAR(&AO) TYPE(*CHAR) LEN(1) /* Hvis 'J', +
                          skriver ut arbeidsordre. */
             DCL        VAR(&FAK) TYPE(*CHAR) LEN(12) /* Ferdig +
                          Ferdig meldte fakturaer. */
             DCL        VAR(&JBK) TYPE(*CHAR) LEN(1) /* Jobbkø. */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
             CALL       PGM(SYSJ40) PARM(&JBK &AO &FAK &IN01 &CMR +
                          &IN03 &IN04 &VF)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT ARBEIDSORDRE */
             IF         COND(&AO = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYEX40CLJ) PARM(&KOPI)) +
                          JOB(ARBORDRE) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT) LOG(0 99 +
                          *NOLIST) LOGCLPGM(*NO)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYEX40CLJ) PARM(&KOPI)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT FERDIGMELDTE FAKTURAER */
             IF         COND(&FAK = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA20CLJ) PARM(&FAK &IN05 +
                          &IN06 &IN07 &IN08 &KOPI)) JOB(FAKTURA) +
                          JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA20CLJ) PARM(&FAK &IN05 &IN06 &IN07 +
                          &IN08 &KOPI)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT CMR-FRAKTBREV          */
             IF         COND(&CMR = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYEX43CLJ) PARM(&IN03 &IN04)) +
                          JOB(CMR) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT) LOG(0 99 +
                          *NOLIST) LOGCLPGM(*NO)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYEX43CLJ) PARM(&IN03 &IN04)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* N01 START */
    /* */
    /* ============================================================ */
    /* SKRIVER UT VANLIG FRAKTBREV */
             IF         COND(&VF = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP +
                          &LG &PO)) JOB(FRBREV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP &LG &PO)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* N01 SLUTT */
 SLUTT:      ENDPGM
