             PGM
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) VALUE(0)
             DCL        VAR(&KDP) TYPE(*CHAR) LEN(5)
             CALL       PGM(SYSJ14) PARM(&FLAGG &KDP)
             ENDPGM
