             PGM        PARM(&PRT24 &PT24)
             DCL        VAR(&PRT24) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT24) TYPE(*CHAR) LEN(10)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYSJ64P) OUTQ(&PRT24) PAGESIZE(72 85) +
                          CPI(10) OVRFLW(72) FORMTYPE(&PT24)
       /* */
             CALL       PGM(SYSJ64)
       /* */
             ENDPGM
