             PGM
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SORT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(20)
             DCL        VAR(&TR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&ÅU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&OT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CO) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LB) TYPE(*CHAR) LEN(25)
             DCL        VAR(&OB) TYPE(*CHAR) LEN(25)
             DCL        VAR(&KN) TYPE(*CHAR) LEN(40)
             DCL        VAR(&KKN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KKD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&RGF) TYPE(*CHAR) LEN(2)
             DCL        VAR(&RGT) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PRT36) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT36) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&MSG) TYPE(*LGL) LEN(1) VALUE('0')
       /* */
             ALCOBJ     OBJ((WFILCD *FILE *EXCL WFILCD))
             MONMSG     MSGID(CPF1002) EXEC(CHGVAR VAR(&MSG) +
                          VALUE('1'))
             IF         COND(&MSG = '1') THEN(GOTO CMDLBL(UT))
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJLO) PARM(&IN01 &SG &DT &DTT &SORT +
                          &AVD &TR &ÅU &OT &CO &LB &OB &KN &KKN +
                          &KKD &RGF &RGT &PRT36 &PT36)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJ66CL) PARM(&SG &DT &DTT &SORT &AVD +
                          &TR &ÅU &OT &CO &LB &OB &KN &KKN &KKD &RGF +
                          &RGT &PRT36 &PT36)
       /* */
 SLUTT:      DLCOBJ     OBJ((WFILCD *FILE *EXCL WFILCD))
       /* */
 UT:         ENDPGM
