             PGM        PARM(&OPDF &OPDT &PRT26 &PT26 &PRT28 &PT28)
             DCL        VAR(&OPDF) TYPE(*CHAR) LEN(7)
             DCL        VAR(&OPDT) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT26) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT26) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT28) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT28) TYPE(*CHAR) LEN(10)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             DLTOVR     FILE(SYSJ15P)
             MONMSG     MSGID(CPF9841)
             OVRPRTF    FILE(SYSJ15P2) OUTQ(&PRT28) PAGESIZE(72 120) +
                          CPI(15) OVRFLW(66) FORMTYPE(&PT28)
             CALL       PGM(SYSJ55) PARM(&OPDF &OPDT &PRT26 &PT26)
       /* */
             ENDPGM
