             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&FAXSYS) TYPE(*CHAR) LEN(1) /* +
                          F=Faximile support 400,  X=Fax400, ' +
                          '=Ikke benytt fax-system */
             DCL        VAR(&USRPRF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(50) /* Brukernavn */
             DCLF       FILE(FAXSEN)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             RCVF       RCDFMT(*FILE)
             IF         COND(&FAXSYS *EQ ' ') THEN(GOTO CMDLBL(START))
             IF         COND(&FAXLIB *NE '          ') THEN(GOTO +
                          CMDLBL(START)) /* FAXLIB <> blank  ---> +
                          ikke faximile support 400 */
             CHGVAR     VAR(&FAXSYS) VALUE('F') /* Benytt faximile +
                          support 400 */
             RTVJOBA    USER(&USRPRF)
             RTVUSRPRF  USRPRF(&USRPRF) TEXT(&CVP6) /* Kun faximile +
                          support 400 bruke coverpage. */
       /* */
 START:      CALL       PGM(SYSJ27) PARM(&IN01 &FAXSYS &CVP6)
       /* */
 SLUTT:      ENDPGM
