             PGM        PARM(&PARM &PRT29 &PT29 &NAVN &ATTN)
             DCL        VAR(&LOGO)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&FAKT) TYPE(*DEC) LEN(3 0) VALUE(029)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(256)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ATTN) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&PRT29) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT29) TYPE(*CHAR) LEN(10)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CHGVAR     VAR(&AVD) VALUE(%SST(&PARM 1 4))
             CHGVAR     VAR(&OPD) VALUE(%SST(&PARM 5 7))
             CHGVAR     VAR(&FAXNR) VALUE(%SST(&PARM 17 21))
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO &DRAWUT)
       /*    OVRPRTF    FILE(SYSJ69P) OUTQ(&PRT29) PAGESIZE(72 80) +
                          CPI(10) OVRFLW(72) FORMTYPE(&PT29)  */
    /*---------------------------------------*/
    /* START FOR IKKE PDF DOKUMENTER      */
    /*---------------------------------------*/
             IF         COND(&LASER *NE 'P') THEN(DO)

             OVRPRTF    FILE(SYSJ69P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) CPI(12) FRONTMGN(.18 .21) OVRFLW(70) +
                          FRONTOVL(&LOGO) OUTQ(&PRT29) +
                          FORMTYPE(&PT29)
                          ENDDO
    /*---------------------------------------*/
    /* START FOR  PDF        DOKUMENTER      */
    /*---------------------------------------*/
             IF         COND(&LASER *EQ 'P') THEN(DO)

             OVRPRTF    FILE(SYSJ69P) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          96) CPI(12)  OVRFLW(70) +
                          FRONTOVL(&LOGO) OUTQ(&PRT29) +
                          FORMTYPE(&PT29)
                          ENDDO
       /* */
             CALL       PGM(SYSJ69A) PARM(&AVD &OPD &NAVN &FAXNR &ATTN)
       /* */
             ENDPGM
