             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) /* Hvis &in03 +
                          på, skal losseliste  være stående. */
             DCL        VAR(&IN04) TYPE(*LGL) LEN(1) /* Hvis &in04 +
                          på, skal printetype være 4224. */
             DCL        VAR(&JBK) TYPE(*CHAR) LEN(1) /* Jobbkø. */
             DCL        VAR(&PRT24) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT24) TYPE(*CHAR) LEN(10)
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
             CALL       PGM(SYEXCM) PARM(&JBK &IN03 &IN04 &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* ----------------------------------------------------------- */
    /* SKRIVER UT CMR-BREV   EKSPORT SJØ */
             RTVDTAARA  DTAARA(*LDA (861 10)) RTNVAR(&PRT24)
             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PT24)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYSJ64CLJ) PARM(&PRT24 &PT24)) +
                          JOB(CMR) JOBD(*USRPRF) +
                          JOBQ(SYJOBQNMAX)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYSJ64CLJ) PARM(&PRT24 &PT24)
                        ENDDO
    /* ----------------------------------------------------------- */
    /* */
 SLUTT:      ENDPGM
