             PGM
             DCL        VAR(&OPDF) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDT) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&BT) TYPE(*CHAR) LEN(5)
             DCL        VAR(&PRT29) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT29) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT37) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT37) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UTA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UTBB) TYPE(*CHAR) LEN(1)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJBK) PARM(&IN01 &OPDF &OPDT &BT +
                          &PRT29 &PT29 &PRT37 &PT37 &UTA &UTBB &JOBK)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJ56CL) PARM(&OPDF &OPDT &BT &PRT29 +
                          &PT29 &JOBK)
       /* */
             IF         COND(&UTBB = 'J') THEN(CALL PGM(SYSJ69CL) +
                          PARM(&OPDF &OPDT &PRT29 &PT29 &JOBK))
       /* */
             IF         COND(&UTA = 'J') THEN(CALL PGM(SYSJ65CL) +
                          PARM(&OPDF &OPDT &PRT37 &PT37 &JOBK))
       /* */
 SLUTT:      ENDPGM
