             PGM        PARM(&OPDF &OPDT &PRT18 &PT18 &JOBK)
             DCL        VAR(&OPDF) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDT) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDF2) TYPE(*CHAR) LEN(7)
             DCL        VAR(&OPDT2) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT18) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT18) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
       /* */
             CHGVAR     VAR(&OPDF2) VALUE(&OPDF)
             CHGVAR     VAR(&OPDT2) VALUE(&OPDT)
             IF         COND(&JOBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYSJ26CLJ) PARM(&OPDF2 &OPDT2 +
                          &PRT18 &PT18)) JOB(MANIFEST) +
                          JOBD(*USRPRF) JOBQ(*LIBL/SYJOBQNMAX)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYSJ26CLJ) PARM(&OPDF2 &OPDT2 &PRT18 &PT18)
                        ENDDO
       /* */
             ENDPGM
