             PGM        PARM(&DT &VH &KNR &TR &PRT30 &PT30 &JOBK)
             DCL        VAR(&DT) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&DT2) TYPE(*CHAR) LEN(6)
             DCL        VAR(&VH) TYPE(*CHAR) LEN(5)
             DCL        VAR(&KNR) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&KNR2) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TR) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PRT30) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT30) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
       /* */
             CHGVAR     VAR(&DT2) VALUE(&DT)
             CHGVAR     VAR(&KNR2) VALUE(&KNR)
             IF         COND(&JOBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYSJ68CLJ) PARM(&DT2 &VH &KNR2 +
                          &TR &PRT30 &PT30)) JOB(MANGBEKR) +
                          JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYSJ68CLJ) PARM(&DT2 &VH &KNR2 &TR +
                          &PRT30 &PT30)
                        ENDDO
       /* */
             ENDPGM
