             PGM        PARM(&PARM)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(833)
             DCL        VAR(&PAR1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&DOKNA) TYPE(*CHAR) LEN(12)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CVP01) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP02) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP03) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP04) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP05) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP06) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP07) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP08) TYPE(*CHAR) LEN(40)
       /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             OVRPRTF    FILE(SYSJ27PF) DEVTYPE(*SCS) +
                          PAGESIZE(48 198) CPI(15) OVRFLW(48) +
                          DRAWER(2) OUTQ(FAX/FAXOUT)
       /* */
             CHGVAR     VAR(&PAR1) VALUE(%SST(&PARM 1 256))
             CALL       PGM(SYSJ27C) PARM(&PAR1)
       /* */
             CHGVAR     VAR(&FAXNR) VALUE(%SST(&PARM 257 21))
             CALL       PGM(FAX017) PARM(&FAXNR)
       /* */
             CHGVAR     VAR(&DOKNA) VALUE(%SST(&PARM 278 12))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&PARM 290 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&PARM 298 8))
             CHGVAR     VAR(&CVP) VALUE(%SST(&PARM 308 1))
       /* */
             CHGVAR     VAR(&CVP01) VALUE(%SST(&PARM 513 40))
             CHGVAR     VAR(&CVP02) VALUE(%SST(&PARM 553 40))
             CHGVAR     VAR(&CVP03) VALUE(%SST(&PARM 593 40))
             CHGVAR     VAR(&CVP04) VALUE(%SST(&PARM 633 40))
             CHGVAR     VAR(&CVP05) VALUE(%SST(&PARM 673 40))
             CHGVAR     VAR(&CVP06) VALUE(%SST(&PARM 713 40))
             CHGVAR     VAR(&CVP07) VALUE(%SST(&PARM 753 40))
             CHGVAR     VAR(&CVP08) VALUE(%SST(&PARM 793 40))
             IF         COND(&CVP = 'J') THEN(DO) /* MED COVERPAGE */
             FAX/SNDFAXSPLF FILE(SYSJ27PF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAXNR *N &NAVN)) +
                          CPGPAG(*DFT) CPGTXT(&CVP01 &CVP02 &CVP02 +
                          &CVP04 &CVP05 &CVP06 &CVP07 &CVP08)

             ENDDO
             ELSE       CMD(DO)
             FAX/SNDFAXSPLF FILE(SYSJ27PF) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAXNR *N &NAVN))
             ENDDO
       /* */
             CHGVAR     VAR(&AVD) VALUE(%SST(&PARM 1 4))
             CHGVAR     VAR(&NAVN) VALUE(%SST(&PARM 106 30))
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &DOKNA &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
       /* */
 SLUTT:      ENDPGM
