             PGM        PARM(&TUR &SIDE2 &OVERLAY &BLOVL +
                          &FIRMA &STMF)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&OVERLAY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BLOVL) TYPE(*CHAR) LEN(5)
             DCL        VAR(&SIDE2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UTK) TYPE(*CHAR) LEN(10) +
                          VALUE('SYCGIOUTQ')
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) +
                          VALUE('BILLOFLADI')
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(2) VALUE('01')

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

/*ny         CHGVAR     VAR(&BLOVL) VALUE('CCBL')     */
             IF         COND(&OVERLAY = 'J') THEN(DO)
             OVRPRTF    FILE(SYSJ21P) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          120) LPI(6) CPI(15) OVRFLW(72) +
                          DUPLEX(*YES) FRONTOVL(&BLOVL) +
                          BACKOVL(CCBLB 0 0 *CONSTANT) +
                          OUTQ(SYCGIOUTQ) FORMTYPE(*STD) SPLFOWN(*JOB)
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SYSJ21P) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          120) LPI(6) CPI(15) OVRFLW(72) +
                          OUTQ(SYCGIOUTQ) FORMTYPE(*STD) SPLFOWN(*JOB)
             ENDDO
             OVRPRTF    FILE(SYSJ21PL) DEVTYPE(*AFPDS) PAGESIZE(72 +
                          120) LPI(6) CPI(15) OVRFLW(72) +
                          DUPLEX(*YES) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) SPLFOWN(*JOB)

             CALL       PGM(SYSJ21) PARM(&TUR)

             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYGE40) PARM(&INFOP)
             IF         COND(&INFOP = 'N') THEN(DO)
             IF         COND(&SIDE2 = 'J') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (551 50)) RTNVAR(&STMF)
             CHGVAR     VAR(&STMF2) VALUE('/syspeddev/temp/' *CAT &STMF)
             CHGVAR     VAR(&STMF) VALUE(&STMF2)
             CVTSPLFPDF SPLF(SYSJ21PL) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) TOPDF(&STMF)
             ENDDO
             ELSE       CMD(DO)
             RTVDTAARA  DTAARA(*LDA (501 50)) RTNVAR(&STMF)
             CHGVAR     VAR(&STMF2) VALUE('/syspeddev/temp/' *CAT &STMF)
             CHGVAR     VAR(&STMF) VALUE(&STMF2)
             CVTSPLFPDF SPLF(SYSJ21P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) TOPDF(&STMF)
             ENDDO
             ENDDO

             IF         COND(&INFOP = 'J') THEN(DO)
             IF         COND(&SIDE2 = 'J') THEN(DO)
             CHGVAR     VAR(&FILEN) VALUE('SYSJ21PL')
             RTVDTAARA  DTAARA(*LDA (551 50)) RTNVAR(&STMF)
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &STMF)
             ENDDO
             ELSE       CMD(DO)
             CHGVAR     VAR(&FILEN) VALUE('SYSJ21P')
             RTVDTAARA  DTAARA(*LDA (501 50)) RTNVAR(&STMF)
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &STMF)
             ENDDO
             ENDDO

             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             DLTSPLF    FILE(SYSJ21P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(SYSJ21PL) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
