             PGM        PARM(&OPDF &OPDT &PRT37 &PT37)
             DCL        VAR(&OPDF) TYPE(*CHAR) LEN(7)
             DCL        VAR(&OPDT) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT37) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT37) TYPE(*CHAR) LEN(10)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYSJ65P) OUTQ(&PRT37) PAGESIZE(72 80) +
                          CPI(10) OVRFLW(72) FORMTYPE(&PT37)
       /* */
             OVRDBF     FILE(BOOKOPD) TOFILE(BOOKING)
             CALL       PGM(SYSJ65) PARM(&OPDF &OPDT)
             DLTOVR     FILE(BOOKOPD)
       /* */
             ENDPGM
