             PGM
             DCL        VAR(&UR) TYPE(*CHAR) LEN(1) VALUE('F') /* +
                          Oppdragstype */
             DCL        VAR(&STACK1) TYPE(*CHAR) LEN(2) VALUE('BK')
             DCL        VAR(&STACK2) TYPE(*CHAR) LEN(2)
             DCL        VAR(&STACK3) TYPE(*CHAR) LEN(2)
             DCL        VAR(&TILMOD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('EXP +
                          SJØ   ')
             CALL       PGM(LOGUSR) PARM(&PGM)
                                                          /**/
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '0') THEN(DO)
             OVRDBF     FILE(HEADFOPD) TOFILE(HEADF)
             RTVUSRPRF  RTNUSRPRF(&USR)
             CHGDTAARA  DTAARA(*LDA (301 10)) VALUE(&USR)
             CALL       PGM(SYSJ81R) PARM(&UR &STACK1 &STACK2 +
                          &STACK3 &TILMOD)
             RCLRSC
             ENDDO
                                                          /**/
             ENDPGM
