             PGM        PARM(&PARM)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(512)
             DCL        VAR(&DOKNA) TYPE(*CHAR) LEN(12) +
                          VALUE('SYSJ16P')
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CVP01) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP02) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP03) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP04) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP05) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP06) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP07) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP08) TYPE(*CHAR) LEN(40)
       /* */
             CHGVAR     VAR(&NAVN) VALUE(%SST(&PARM 13 30))
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYSJ16P) DEVTYPE(*SCS) +
                          PAGESIZE(72 90) LPI(8) CPI(15) +
                          OVRFLW(72) OUTQ(FAX/FAXOUT)
       /* */
             CHGVAR     VAR(&AVD) VALUE(%SST(&PARM 1 4))
             CHGVAR     VAR(&OPD) VALUE(%SST(&PARM 5 7))
             CHGVAR     VAR(&NR) VALUE(%SST(&PARM 12 1))
             CALL       PGM(SYSJ16A) PARM(&AVD &OPD &NR)
       /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&FAXNR) VALUE(%SST(&PARM 43 21))
             CALL       PGM(FAX017) PARM(&FAXNR)
             CHGVAR     VAR(&CVP) VALUE(%SST(&PARM 64 1))
       /* */
             CHGVAR     VAR(&CVP01) VALUE(%SST(&PARM 65 40))
             CHGVAR     VAR(&CVP02) VALUE(%SST(&PARM 105 40))
             CHGVAR     VAR(&CVP03) VALUE(%SST(&PARM 145 40))
             CHGVAR     VAR(&CVP04) VALUE(%SST(&PARM 185 40))
             CHGVAR     VAR(&CVP05) VALUE(%SST(&PARM 225 40))
             CHGVAR     VAR(&CVP06) VALUE(%SST(&PARM 265 40))
             CHGVAR     VAR(&CVP07) VALUE(%SST(&PARM 305 40))
             CHGVAR     VAR(&CVP08) VALUE(%SST(&PARM 345 40))
       /* */
             IF         COND(&CVP = 'J') THEN(DO) /* MED COVERPAGE */
             FAX/SNDFAXSPLF FILE(SYSJ16P) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST) RCP((&FAXNR *N &NAVN)) +
                          CPGPAG(*DFT) CPGTXT(&CVP01 &CVP02 &CVP02 +
                          &CVP04 &CVP05 &CVP06 &CVP07 &CVP08)

             ENDDO
             ELSE       CMD(DO)
             FAX/SNDFAXSPLF FILE(SYSJ16P) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          RCP((&FAXNR *N &NAVN))
             ENDDO
       /* */
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)
       /* */
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &DOKNA &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
       /* */
             ENDPGM
