             PGM
             DCL        VAR(&OPDF) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDT) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&BT) TYPE(*CHAR) LEN(5)
             DCL        VAR(&PRT18) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT18) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJFM) PARM(&IN01 &OPDF &OPDT &PRT18 +
                          &PT18 &JOBK)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             CALL       PGM(SYSJ26CL) PARM(&OPDF &OPDT &PRT18 &PT18 +
                          &JOBK)
       /* */
 SLUTT:      ENDPGM
