/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 PARAMETER FOR AVBRYT                               */
/* ********************************************************************    */
             PGM
/*N01*/      DCL        VAR(&FLAG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OPDF) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&OPDT) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&BT) TYPE(*CHAR) LEN(5)
             DCL        VAR(&PRT31) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT31) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UTSKRIFT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCLF       FILE(FAXSEN)
       /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
       /* */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
       /* */
             RCVF       RCDFMT(*FILE)
             IF         COND(&FAXSYS *EQ ' ') THEN(CHGVAR VAR(&FAX) +
                          VALUE('N'))
             IF         COND((&FAXLIB *NE '          ') *AND +
                          (&FAXCPN *EQ '  ')) THEN(CHGVAR VAR(&CVP) +
                          VALUE('N'))
             CALL       PGM(SYSJAD) PARM(&IN01 &OPDF &OPDT &PRT31 +
                          &PT31 &JOBK &FAX &CVP)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             IF         COND(&FAX = 'N') THEN(CHGVAR VAR(&UTSKRIFT) +
                          VALUE('J'))
       /* */
/*E01*/      CALL       PGM(SYSJ16CL) PARM(&OPDF &OPDT &PRT31 &PT31 +
                          &JOBK &FAX &CVP &UTSKRIFT &FLAG)
       /* */
 SLUTT:      ENDPGM
