             PGM        PARM(&SMSNR &SMSTXT)
             DCL        VAR(&SMSNR) TYPE(*CHAR) LEN(200)
             DCL        VAR(&SMSTXT) TYPE(*CHAR) LEN(160)
             DCL        VAR(&APIID) TYPE(*CHAR) LEN(30) +
                          VALUE('api_id:3107910')
             DCL        VAR(&USER) TYPE(*CHAR) LEN(30) +
                          VALUE('user:jovoclick')
             DCL        VAR(&PASS) TYPE(*CHAR) LEN(30) +
                          VALUE('password:click01')
             DCL        VAR(&MELD) TYPE(*CHAR) LEN(2000)
             DCL        VAR(&AVID) TYPE(*CHAR) LEN(10) VALUE(JOVO)
             DCL        VAR(&AVADR) TYPE(*CHAR) LEN(10) VALUE(NO542SYS)

             CHGVAR     VAR(&MELD) VALUE(&APIID *CAT ':/N' +
                          *CAT &USER *CAT ':/N' *CAT &PASS *CAT +
                          ':/Nto:' *CAT &SMSNR *CAT ':/Ntext:' *CAT +
                          &SMSTXT *CAT ' ')

          /*              TOINTNET(('janottar@systema.no')) +   */
             SNDDST     TYPE(*LMSG) +
                          TOINTNET(('sms@messaging.clickatell.com')) +
                          DSTD('.') LONGMSG(&MELD) USRID(&AVID +
                          &AVADR) SNDFMT(*NOCHG)

             MONMSG     MSGID(CPF0000)

             ENDPGM
