             PGM        PARM(&AVD &OPD)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(5)
             DCL        VAR(&USERID) TYPE(*CHAR) LEN(10)
                                                          /**/
             RTVJOBA    USER(&USERID)
             CALL       PGM(SYST35A) PARM(&AVD &OPD &USERID)
                                                          /**/
             ENDPGM
