    /* UTSKRIFT AV "STATISTIKK" BASERT PÅ OPPDRAG*/
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&UTVAL1) TYPE(*CHAR) LEN(256) /* +
                          UTVALGSDATA 1 */
             DCL        VAR(&UTVAL2) TYPE(*CHAR) LEN(256) /* +
                          UTVALGSDATA 2 */
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(1) /* ANT KOPIER */
             DCL        VAR(&JOBQ) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3) /* SIGNATUR */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4) /*AVD*/
             DCL        VAR(&STTYPE) TYPE(*CHAR) LEN(10)


             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             RTVDTAARA  DTAARA(*LDA (19 3)) RTNVAR(&SG)
             CALL       PGM(SYST01A) PARM(&IN01 &AVD &SG &JOBQ &PRT +
                          &PT &ANT &STTYPE &UTVAL1 &UTVAL2)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
 /*MIDLERT*/
 /*MIDLERT   CHGDTAARA  DTAARA(*LDA (100 256)) VALUE(&UTVAL1)*/
 /*MIDLERT   CHGDTAARA  DTAARA(*LDA (357 256)) VALUE(&UTVAL2)*/
 /*MIDLERT   GOTO       CMDLBL(SLUTT)  */
    /* */
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             CHGDTAARA  DTAARA(*LDA (19 3)) VALUE(&SG)
             IF         COND(&JOBQ = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYST01CLJ) PARM(&ANT &PRT &PT +
                          &UTVAL1 &UTVAL2)) JOB(&STTYPE) +
                          JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             IF         COND(&JOBQ *NE 'J') THEN(DO)
             CALL       PGM(SYST01CLJ) PARM(&ANT &PRT &PT &UTVAL1 +
                          &UTVAL2)
                        ENDDO
 SLUTT:      ENDPGM
