             PGM
             DCL        VAR(&BATCH) TYPE(*CHAR) LEN(1) VALUE('J')
             CHGJOB     LOG(4 00 *SECLVL) LOGCLPGM(*YES)
             MONMSG     MSGID(CPF0000)
 /* KONV. VALUTA     */
             CALL SYTIVA1C

 /* KONV. TARIFF     */
             CALL SYTITA1C PARM(&BATCH)

 /* KONV. AVGIFTER   */
             CALL SYTIAV1C

 /* KONV. RT-AVGIFT  */
             CALL SYTIRT1C

SLUTT:       ENDPGM
