             PGM PARM(&STMF &FILE)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&RMTSYS) TYPE(*CHAR) LEN(15) +
                          VALUE('FTP.TOLL.NO')
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(30)
             /*_______________________________*/
             /* Lag CMD fil for å Hente filer */
             /*"""""""""""""""""""""""""""""""*/
           DLTF       FILE(QTEMP/SYTIHENT)
           MONMSG     MSGID(CPF0000)
           CRTPF      FILE(QTEMP/SYTIHENT) RCDLEN(80) SIZE(10)
           DLTF       FILE(QTEMP/SYTIHENL)
           MONMSG     MSGID(CPF0000)
           CRTPF      FILE(QTEMP/SYTIHENL) RCDLEN(80) SIZE(200)
             CALL       PGM(SYTIHENTR) PARM(&FILE &STMF)
             /*__________________*/
             /* Hent komponenter */
             /*""""""""""""""""""*/
             OVRDBF     FILE(INPUT) TOFILE(SYTIHENT)
             OVRDBF     FILE(OUTPUT) TOFILE(SYTIHENL)
             STRTCPFTP  RMTSYS(&RMTSYS)
             MONMSG     MSGID(CPF0000)
 EXIT:
             ENDPGM
