             PGM
             DCL        VAR(&BATCH) TYPE(*CHAR) LEN(1) VALUE('N')
 /* KONV. VALUTA     */
             CALL SYTIVA1C

 /* KONV. TARIFF     */
             CALL SYTITA1C PARM(&BATCH)

 /* KONV. AVGIFTER   */
             CALL SYTIAV1C

 /* KONV. RT-AVGIFT  */
             CALL SYTIRT1C

SLUTT:       ENDPGM
