             PGM        PARM(&FIL)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(100)

 START:      DLTF       FILE(QTEMP/Q1024)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(QTEMP/Q1024) RCDLEN(1024)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(SYTK11) PARM(&FIL)

 SLUTT:      ENDPGM
