             PGM
 /*                                                                */
 /*  Deklarer parametre/cl-variabler                               */
 /*                                                                */
             DCL        VAR(&UDATO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAGN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&UKOD) TYPE(*CHAR) LEN(5)
             DCL        VAR(&UKOD2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UOPD) TYPE(*CHAR) LEN(1) VALUE('J')

             CALL       PGM(SYTL03B) PARM(&UKOD &UKOD2 &UDATO &DAGN &UOPD)

             ENDPGM
