             PGM
             DCL        VAR(&MODE) TYPE(*CHAR) LEN(1) VALUE('V')
             DCL        VAR(&UNTY) TYPE(*CHAR) LEN(4)
    /* VEDLIKEHOLD UNITTYPER */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYTR20) PARM(&MODE &UNTY)
             ENDPGM
