    /* UTSKRIFT AV ARBEIDSLISTE TRANSP.AVREGNING */
             PGM        PARM(&BNR &PRT)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&BNR) TYPE(*CHAR) LEN(8)  /*BILAGSNR */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYTR12PH) OUTQ(&PRT) PAGESIZE(72 120) +
                          CPI(15) OVRFLW(67) PRTQLTY(*DRAFT) +
                          FORMTYPE(*STD)
    /* */
             CALL       PGM(SYTR12H) PARM(&BNR)
             ENDPGM
