    /* UTSKRIFT AV TURKONVOLUTT */
             PGM        PARM(&AVD &RUN &SKJE &TYPE)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&SKJE) TYPE(*CHAR) LEN(10) /* SKJERM */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(1) /* HEADING */
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1) /* TYPE */
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&RUN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PRTNR) TYPE(*DEC) LEN(3 0) VALUE(056)
             DCL        VAR(&FM) TYPE(*CHAR) LEN(5)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYGE01) PARM(&AVD &PRTNR &PRT &PT &HE &FM)
             OVRPRTF    FILE(SYTR91PF) OUTQ(&PRT) PAGESIZE(72 80) +
                          CPI(10) OVRFLW(36) FORMTYPE(&PT)
    /* */
             SBMJOB     CMD(CALL PGM(SYTR91) PARM(&RUN &SKJE &TYPE)) +
                          JOB(TURKONV) JOBQ(SYJOBQNMAX)
             ENDPGM
