             PGM
             DCL        VAR(&KOST) TYPE(*CHAR) LEN(1) VALUE('N')
    /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYTR15) PARM(&KOST)
             ENDPGM
