             PGM
             DCL        VAR(&SPØR) TYPE(*CHAR) LEN(1) VALUE('I')
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('TRA +
                          IMPEXP')
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&WS)
             CALL       PGM(LOGUSR) PARM(&PGM)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */

  /* SJEKK OM BRUKER ER I STYRINGSFIL BRUKER -> TERMINAL. */
             CALL       PGM(SYTR10D) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(DO)
             SNDBRKMSG  MSG('Din brukerid er ikke lagt inn i +
                          styringsfil BRUKERID->TERMINAL. Dette må +
                          gjøres før TRANSPORTMODUL INNLAND kan +
                          benyttes (For å få rett styring Postnr -> +
                          Avdeling m.m.)  KONTAKT SYSTEM-ANSVARLIG! +
                          ') TOMSGQ(&WS)
             GOTO CMDLBL(SLUTT)
             ENDDO
                                                          /**/
             OVRDBF     FILE(HEDUMMY) TOFILE(HEDUMMY) MBR(URH)
             OVRDBF     FILE(HEADDUM) TOFILE(HEADF)
             OVRDBF     FILE(TURERDUM) TOFILE(TURER)
             RTVUSRPRF  RTNUSRPRF(&USR)
             CHGDTAARA  DTAARA(*LDA (301 10)) VALUE(&USR)
             CALL       PGM(SYTR33) PARM(&SPØR)
             RCLRSC

SLUTT:       ENDPGM
