/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10007 * 01 YBC PTF10 OPPDRAGSNR OG AVDELING ER SKILT FRA HVER ANDRE     */
/* ********************************************************************    */
    /* UTSKRIFT AV ORDREFORMILAR INTERN/EKSTERN */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(1) /* HEADING */
             DCL        VAR(&TY) TYPE(*CHAR) LEN(1) /* TYPE */
             DCL        VAR(&JOBQ) TYPE(*CHAR) LEN(1) /* JOBQ */
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3) /* SIGNATUR */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
/*N01*/      DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(3)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYTR40A) PARM(&IN01 &AVD &SG &TUR &PRT +
                          &PT &HE &DATO &TY &JOBQ)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
             IF         COND(&JOBQ = 'Y') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYTR40CLJ) PARM(&AVD &SG &DATO +
                          &TUR &TY &HE &ANT &PRT &PT)) +
                          JOB(ORDRESPES) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
                        ENDDO
             IF         COND(&JOBQ *NE 'Y') THEN(DO)
/*E01*/      CALL       PGM(SYTR40CLJ) PARM(&AVD &SG &DATO &TUR &OPD +
                          &TY &HE &ANT &PRT &PT)
                        ENDDO
    /* */
    /* */
 SLUTT:      ENDPGM
