             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1) /* Hvis &in03 +
                          på, skal losseliste  være stående. */
             DCL        VAR(&IN04) TYPE(*LGL) LEN(1) /* Hvis &in04 +
                          på, skal printetype være 4224. */
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&IN05) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in05 på, betyr programkallinng fra +
                          BORDERAUR. */
             DCL        VAR(&IN06) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in06 på, betyr programkalleing fra +
                          MANEFEST. */
             DCL        VAR(&IN07) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in07 på, betyr programkallinng fra +
                          KREDITERING. */
             DCL        VAR(&IN08) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in08 på, betyr programkallinng fra +
                          FAKTURERING. */
             DCL        VAR(&BL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VF) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('F')
             DCL        VAR(&VB) TYPE(*CHAR) LEN(1)
             DCL        VAR(&EKSP) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&LG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ANT) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&CM) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ANT2) TYPE(*CHAR) LEN(3) /* Antall kopi +
                          av utskrift. */
    /* */
             DCL        VAR(&AO) TYPE(*CHAR) LEN(1) /* Hvis 'J', +
                          skriver ut arbeidsordre. */
             DCL        VAR(&FAK) TYPE(*CHAR) LEN(12) /* Ferdig +
                          Ferdig meldte fakturaer. */
             DCL        VAR(&TPFB) TYPE(*CHAR) LEN(1) /* Tollpass +
                          fraktbrev. */
             DCL        VAR(&LOSS) TYPE(*CHAR) LEN(1) /* Losseliste. */
             DCL        VAR(&OF) TYPE(*CHAR) LEN(1) /* +
                          Oppdragsformular. */
             DCL        VAR(&JBK) TYPE(*CHAR) LEN(1) /* Jobbkø. */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EDS) TYPE(*CHAR) LEN(39) +
                                  VALUE('*BLANKS')
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* HENTE OPPLYSNINGER OM HVA SLAGS UTSKRIFT MAN ØNSKER */
             CALL       PGM(SYTRKP) PARM(&JBK &AO &FAK &IN01 &BL +
                          &ANT &CM &VF &TPFB &OF &LOSS &IN03 &IN04)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT FERDIGMELDTE FAKTURAER */
             IF         COND(&FAK = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA20CLJ) PARM(&FAK &IN05 +
                          &IN06 &IN07 &IN08 &KOPI)) JOB(FAKTURA) +
                          JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA20CLJ) PARM(&FAK &IN05 &IN06 &IN07 +
                          &IN08 &KOPI)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT VANLIG FRAKTBREV */
             IF         COND(&VF = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP +
                          &LG &PO)) JOB(FRBREV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP &LG &PO)
                        ENDDO
                        ENDDO
    /* SKRIVER UT TOLLPASS */
             CHGVAR     VAR(&KODE) VALUE('T')
             IF         COND(&TPFB = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP +
                          &LG &PO)) JOB(FRBREV) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA12CLJ) PARM(&KODE &VB &EKSP &LG &PO)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* */
    /* ============================================================ */
    /* SKRIVER UT BILL OF LADING         */
             IF         COND(&BL = 'J') THEN(DO)
             CHGVAR     VAR(&ANT2) VALUE(&ANT)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYEX41CLJ) PARM(&KOPI &ANT2)) +
                          JOB(LADING) JOBD(*USRPRF) +
                          JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYEX41CLJ) PARM(&KOPI &ANT2)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
    /* SKRIVER UT OPPDRAGSFORMULAR */
             IF         COND(&OF = 'J') THEN(DO)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFA40CLJ)) JOB(OPPDRAG) +
                          JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFA40CLJ)
                        ENDDO
                        ENDDO
    /* */
    /* ============================================================ */
    /* LOSSELISTE */
             IF         COND(&LOSS = 'J') THEN(DO)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TIME)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &TIME)
             RMVM       FILE(ASSAM) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(ASSAM) MBR(&UNIK)
             OVRDBF     FILE(ASSAM) TOFILE(ASSAM) MBR(&UNIK)
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYFI48CLJ) PARM(&IN03 &IN04 &EDS)) +
                          JOB(LOSSELI) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYFI48CLJ) PARM(&IN03 &IN04 &EDS)
                        ENDDO
             RMVM       FILE(ASSAM) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
                        ENDDO
    /* */
    /* ============================================================ */
    /* SKRIVER UT CMR-FRAKTBREV          */
             IF         COND(&CM = 'J') THEN(DO)
             CHGDTAARA  DTAARA(*LDA (30 5)) VALUE('00000')
             IF         COND(&JBK = 'J') THEN(DO)
             SBMJOB     CMD(CALL PGM(SYEX43CLJ) PARM(&IN01 &IN01)) +
                          JOB(CMR) JOBD(*USRPRF) JOBQ(SYJOBQPRT)
                        ENDDO
             ELSE       CMD(DO)
             CALL       PGM(SYEX43CLJ) PARM(&IN01 &IN01)
                        ENDDO
                        ENDDO
    /* ============================================================ */
    /* */
 SLUTT:      ENDPGM
