             PGM
             DCL        VAR(&BKO) TYPE(*CHAR) LEN(3) /* BILKODE . */
             DCL        VAR(&SPO) TYPE(*CHAR) LEN(1) VALUE('N') /* +
                          SPØR    . */
    /* VEDLIKEHOLD BILKODERR */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYTR21)  PARM(&BKO &SPO)
             ENDPGM
