             PGM        PARM(&AVD &OPD)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&AVSNA) TYPE(*CHAR) LEN(30)
             DCL        VAR(&EPAVS) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EP01) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EP02) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EP03) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EP04) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EP05) TYPE(*CHAR) LEN(50)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             RTVJOBA    NBR(&NBR)
             CHGVAR     VAR(&MBR) VALUE('W' *CAT &NBR)

             ADDPFM     FILE(ARKSRC160) MBR(&MBR)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(ARKSRC160) MBR(&MBR)
             OVRDBF     FILE(ARKSRC160) TOFILE(&LIB/ARKSRC160) +
                          MBR(&MBR)

             CALL       PGM(SYTR33W) PARM(&AVD &OPD &AVSNA &EPAVS +
                          &EP01 &EP02 &EP03 &EP04 &EP05 &EMNE &OK)

             IF         COND(&OK = 'N') THEN(GOTO CMDLBL(SLUTT))


             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             IF         COND(&EP01 *NE ' ') THEN(DO)
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVSNA) +
                          FROMADDR(&EPAVS) TO(&EP01/&EP01/*TO) +
                          TXTF(&LIB/ARKSRC160) TXTMBR(&MBR) EDTMBR(*NO)
             ENDDO
             IF         COND(&EP02 *NE ' ') THEN(DO)
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVSNA) +
                          FROMADDR(&EPAVS) TO(&EP02/&EP02/*TO) +
                          TXTF(&LIB/ARKSRC160) TXTMBR(&MBR) EDTMBR(*NO)
             ENDDO
             IF         COND(&EP03 *NE ' ') THEN(DO)
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVSNA) +
                          FROMADDR(&EPAVS) TO(&EP03/&EP03/*TO) +
                          TXTF(&LIB/ARKSRC160) TXTMBR(&MBR) EDTMBR(*NO)
             ENDDO
             IF         COND(&EP04 *NE ' ') THEN(DO)
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVSNA) +
                          FROMADDR(&EPAVS) TO(&EP04/&EP04/*TO) +
                          TXTF(&LIB/ARKSRC160) TXTMBR(&MBR) EDTMBR(*NO)
             ENDDO
             IF         COND(&EP05 *NE ' ') THEN(DO)
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVSNA) +
                          FROMADDR(&EPAVS) TO(&EP05/&EP05/*TO) +
                          TXTF(&LIB/ARKSRC160) TXTMBR(&MBR) EDTMBR(*NO)
             ENDDO

             RMVLIBLE   LIB(MMAIL)

 SLUTT:      RMVM       FILE(ARKSRC160) MBR(&MBR)
             MONMSG     MSGID(CPF0000)

             ENDPGM
