/*  TESTER OM BILAG I LØSNING 1  */
             PGM
             DCL        VAR(&BILL1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTF) TYPE(*CHAR) LEN(10) +
                          VALUE('SYTR35P   ')
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PER) TYPE(*CHAR) LEN(2)
             DCL        VAR(&JANEI) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&NRBE) TYPE(*DEC) LEN(3 0) VALUE(110)
             DCL        VAR(&PRT110) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til JOURNALEN  */
             DCL        VAR(&PT110) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til JOURNALEN */
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
/*           DCL        VAR(&PGMR) TYPE(*CHAR) LEN(10)         */
             RTVJOBA    JOB(&JOB)
             CALL       PGM(INLIBL)
/*********************************************************************/
/* SKJEKKER FILLAG I LØSNING 1                                       */
/*********************************************************************/
             RTVDTAARA  DTAARA(EDIDTA (193 1)) RTNVAR(&BILL1)
             IF         COND(&BILL1 = 'Y') THEN(DO)
             CALL       PGM(HR900SY) PARM(&BILL1)
             IF         COND(&BILL1 = 'J') THEN(DO)
             RETURN
             ENDDO
             ENDDO
/**********************************************************************/
             CALL       PGM(*LIBL/SYFAFICL) PARM(&IN01)
             IF         COND(&IN01 *EQ '1') THEN(SNDBRKMSG MSG('du +
                          er ikke registrert som regskapsbruker') +
                          TOMSGQ(&JOB))
             IF         COND(&IN01 *EQ '1') THEN(DO)
             GOTO SLUTT
             ENDDO
/*                                     */
/*OPPDATERER STATISTIKK OG REGNSKAP    */
/*                                     */
/* */
/* KALLER SYFA70 FOR Å OPPDATERE PROSJEKTREGISTER */
/* */
/*S01RUN:    CALL       PGM(SYFA70)  */
/*S01RUN:    CALL       PGM(SYFA70I) KUN NORTRAIL  */
/* */
/* OVERSTYRER SKRIVERFIL                          */
/* */
             CALL       PGM(GETPRTB) PARM(&NRBE &PRT110 &PT110)
             OVRPRTF    FILE(&PRTF) OUTQ(&PRT110) PAGESIZE(48 132) +
                          CPI(10) OVRFLW(48) +
                          FORMTYPE(&PT110)
/*                                                */
/* HAR KUNDEN ARKIVSYSTEM ???                     */
/*                                                */
             CALL       PGM(ARC016) PARM(&JANEI)
             IF         COND(&JANEI = 'J') THEN(DO)
             OVRPRTF    FILE(&PRTF) OUTQ(SYARKIV) HOLD(*YES)
             ENDDO

    /* */
/* */
/* KALLER SYTR35 FOR Å OPPDATERE POSTERINGER      */
/* */
             CALL       PGM(SYTR35)
/*                                                */
/* OPPDATERER ARKIV                               */
/*                                                */
             IF         COND(&JANEI = 'J') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (1 2)) RTNVAR(&FIRMA)
             ADDLIBLE   LIB(IBMENDA)
             CALL PGM(ARK001CL) PARM(&FIRMA &PRTF +
                          &AAR &PER)
             RMVLIBLE   LIB(IBMENDA)
             ENDDO
/* */
/* KALLER V005NY FOR Å OPPDATERE NATIVE ØKONOMI   */
/* */
             DLTOVR     FILE(*ALL)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')
             CALL       PGM(VC005SY)
             CALL       PGM(INLIBL)
             CPYF       FROMFILE(POSTA0) +
                          TOFILE(BACKUPA) MBROPT(*REPLACE)
             MONMSG     MSGID(CPF2817)
             CPYF       FROMFILE(POSTB0) +
                          TOFILE(BACKUPB) MBROPT(*REPLACE)
             MONMSG     MSGID(CPF2817)
             CLRPFM     FILE(POSTB0)
             CLRPFM     FILE(POSTA0)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE('                 -
             ')


             SBMJOB     CMD(CALL PGM(SYFA39CL)) JOB(STATOPDAT) +
                          JOBD(*USRPRF) JOBQ(SYJOBQAV)
             IF         COND(&JANEI = 'J') THEN(DO)
             SIGNOFF    LOG(*LIST)
             ENDDO
 SLUTT:      ENDPGM
