    /* UTSKRIFT AV ANDRE TRANSPORTØRERS BRUK AV EGNE SEMITRAILERE */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(1) /* HEADING */
             DCL        VAR(&PER) TYPE(*DEC) LEN(2 0) VALUE(0)
             DCL        VAR(&AAR) TYPE(*DEC) LEN(2 0) VALUE(0)
             DCL        VAR(&PERT) TYPE(*DEC) LEN(2 0) VALUE(0)
             DCL        VAR(&AART) TYPE(*DEC) LEN(2 0) VALUE(0)
             DCL        VAR(&HENG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TRAN) TYPE(*DEC) LEN(8 0) VALUE(0)
             DCL        VAR(&BILK) TYPE(*CHAR) LEN(3)
             DCL        VAR(&ANT) TYPE(*DEC) LEN(3 0) VALUE(0)
             DCL        VAR(&ANTA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&SORT) TYPE(*CHAR) LEN(1)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             CALL       PGM(SYTR42A) PARM(&IN01 &PRT &PT &HE &PER +
                          &AAR &PERT &AART &TRAN &BILK &HENG &SORT)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* FIX KONVOLUTT            */
    /* */
             OVRPRTF    FILE(SYTR42PF) OUTQ(&PRT) PAGESIZE(48 132) +
                          CPI(10) OVRFLW(48) FORMTYPE(&PT)
    /* */
             CALL       PGM(SYTR42) PARM(&PER &AAR &PERT &AART &TRAN +
                          &BILK &HE &ANT &HENG &SORT)
    /* */
             CHGVAR     VAR(&ANTA) VALUE(&ANT)
    /* */
    /* */
 SLUTT:      ENDPGM
