/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10007 * 01 YBC PTF10 OPPDRAGSNR OG AVDELING ER SKILT FRA HVER ANDRE     */
/* ********************************************************************    */
    /* UTSKRIFT AV I/E/B ORDRE DOKUMENT FRA SYTR88 ELLER SYTR33*/
    /* NÅR FRA SYTR88 ER &TY "I"/"E"/"B", &TUR ER DA TUR.NR */
    /* NÅR FRA SYTR33 ER &TY "S"=SINGEL ORDRE, &TUR ER DA OPPDR.NR */
/*S01        PGM        PARM(&AVD &TUR &TY)  */
/*N01*/      PGM        PARM(&AVD &TUR &OPD &TY)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&HE) TYPE(*CHAR) LEN(1) /* HEADING */
             DCL        VAR(&TY) TYPE(*CHAR) LEN(1) /* TYPE */
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3) /* SIGNATUR */
             DCL        VAR(&AVDD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&PRTN) TYPE(*DEC) LEN(3 0) VALUE(51)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
/*N01*/      DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&ANT) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FM) TYPE(*CHAR) LEN(5)
   /* FLYTT ALFA PARAMETER OVER I NUMERISK */
             CHGVAR     VAR(&AVDD) VALUE(&AVD)
    /* */
   /* HENT DEFAULT PRINTER*/
             CALL       PGM(SYGE01) PARM(&AVDD &PRTN &PRT &PT &HE &FM)
    /* SEND I JOBKØ             */
    /* */
/*E01*/      CALL PGM(SYTR40CLJ) PARM(&AVD &SG &DATO +
                          &TUR &OPD &TY &HE &ANT &PRT &PT)
             ENDPGM
