    /* UTSKRIFT AV ARBEIDSLISTE TRANSP.AVREGNING */
             PGM        PARM(&TNR &AAR &PER &PRT)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&TNR) TYPE(*CHAR) LEN(8)  /*TRANSP   */
             DCL        VAR(&PER) TYPE(*CHAR) LEN(2)  /*PERMND   */
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(2)  /*PERÅR   */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
    /* OWERFLW ER SATT SÅ LAVT SOM 43 FOR Å SIKRE AT EN IKKE FÅR KUN TOTAL PÅ*/
    /* NY SIDE. SISTE SKRIVELINJE I TOTAL VIL NÅ I EKSTREME TILLF. VÆRE 47 */
    /*       OVRPRTF    FILE(SYTR12PF) DEV(&PRT) PAGESIZE(48 132) + */
    /*                    CPI(10) OVRFLW(43) PRTQLTY(*DRAFT) +      */
    /*                    OUTQ(*DEV) FORMTYPE(*STD)                 */
    /* TEST A4.FORMAT */
             OVRPRTF    FILE(SYTR12PF) OUTQ(&PRT) PAGESIZE(72 120) +
                          CPI(15) OVRFLW(67) PRTQLTY(*DRAFT) +
                          FORMTYPE(*STD)
    /* */
             CALL       PGM(SYTR12D) PARM(&TNR &AAR &PER)
             CALL       PGM(SYTR12E) PARM(&TNR &AAR &PER)
 SLUTT:      ENDPGM
