    /* UTSKRIFT AV RUNDTURER */
             PGM        PARM(&SKJE &TY &MEMBER &PRT &PT +
                             &IN01 &AVD &NR &KOD &TRAN &FP &TP)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype */
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 */
             DCL        VAR(&SKJE) TYPE(*CHAR) LEN(10) /* SKJERM */
             DCL        VAR(&TY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(7) /* MEMBER */
             DCL        VAR(&NR) TYPE(*CHAR) LEN(10) /* BILNR */
             DCL        VAR(&KOD) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TRAN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FP) TYPE(*CHAR) LEN(4) /* FRA PERIODE */
             DCL        VAR(&TP) TYPE(*CHAR) LEN(4) /* TIL PERIODE */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             OVRDBF     FILE(XTUR) MBR(&MEMBER)
             CALL       PGM(SYTR92B) PARM(&IN01 &NR &KOD &TRAN &FP &TP)
             OVRPRTF    FILE(SYTR91PF) PAGESIZE(48 132) CPI(10) +
                          OVRFLW(44) OUTQ(&PRT) FORMTYPE(&PT)
             MONMSG     MSGID(CPF0000 CPF0001)
             OVRDBF     FILE(XTUR) MBR(&MEMBER)
             CALL       PGM(SYTR92C) PARM(&SKJE &TY)
             RMVM       FILE(XTUR) MBR(&MEMBER)
             DLTOVR     FILE(*ALL)
    /* */
 SLUTT:      ENDPGM
