             PGM        PARM(&AVD &OPD &FLAGG)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) /* Avdeling. */
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0) /* Oppdragsnr. */
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) /* Hvis +
                          &FLAGG = 0, betyr det at programmet skal +
                          spørre på track & tracing tidsfølging. +
                          Ellers vedlikeholder. */
 /*                                                                */
             CALL       PGM(SYTT02) PARM(&AVD &OPD &FLAGG)
 /*                                                                */
             ENDPGM
