             PGM        PARM(&AVD &OPD &TUR &FLAGG)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) /* Avdeling. */
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0) /* Oppdragsnr. */
             DCL        VAR(&TUR) TYPE(*DEC) LEN(8 0) /* TURNR. */
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0) /* Hvis +
                          &FLAGG = 1, betyr det at programmet skal +
                          spørre på fritekst til oppdrag. Ellers +
                          vedlikeholder fritekst. */
 /*                                                                */
             CALL       PGM(SYTT01) PARM(&AVD &OPD &TUR &FLAGG)
 /*                                                                */
             ENDPGM
