             PGM        PARM(&PRO)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CLRPFM     FILE(QTEMP/SYTT03W)
             MONMSG     MSGID(CPF3142) EXEC(CRTDUPOBJ OBJ(SYTT03W) +
                          FROMLIB(&LIB) OBJTYPE(*FILE) TOLIB(QTEMP))
             OVRDBF     FILE(SYTT03W) TOFILE(QTEMP/SYTT03W)
             CALL       PGM(SYTT03) PARM(&PRO)
             ENDPGM
