/** BRUKES KUN AV A51 / KOMPLETT - SE I A51SYEND     */
/* 1...+... 1 ...+... 2 ...+... 3 ...+... 4 ...+... 5 ...+... 6 ...+... 7 ...*/
/*'09NO11091B100041B2'                                                       */
/*'0001/0090073        '                                                     */
/*'INVALID IE007 MESSAGE      MELDING IKKE I SEKVENS                     '   */

             PGM        PARM(&OK &MRN &REF &MSG)
             DCL        VAR(&OK)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&MRN)   TYPE(*CHAR) LEN(18)
             DCL        VAR(&REF)   TYPE(*CHAR) LEN(20)
             DCL        VAR(&EMNE)  TYPE(*CHAR) LEN(44)
             DCL        VAR(&MSG)   TYPE(*CHAR) LEN(70)
             DCL        VAR(&MSG2)  TYPE(*CHAR) LEN(256)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70) +
                          VALUE('JanOttar@Systema.no')

             CHGVAR     VAR(&EMNE) VALUE('LOSSETILLATELSE  +
                          på MRN ' *CAT &MRN *CAT  ' ')
             IF         COND(&OK *EQ 'N') THEN(CHGVAR VAR(&EMNE) +
                          VALUE('FEILmelding på MRN ' *CAT &MRN *CAT  ' '))

             CHGVAR     VAR(&MSG2) VALUE('Svar er mottat på +
                          ankomstmelding for MRN nr: ' *CAT &MRN *CAT +
                          ':/NIntern Ref: ' *CAT &REF *CAT +
                          ':/P' *CAT &MSG *CAT ' ')

             SNDDST     TYPE(*LMSG) TOINTNET((&EPOST)) DSTD(&EMNE) +
                          LONGMSG(&MSG2)
 SLUTT:      ENDPGM
