             PGM        PARM(&DELNO &MRNR)
             DCL        VAR(&DELNO) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MRNR) TYPE(*CHAR) LEN(18)
             DCL        VAR(&FILENAME) TYPE(*CHAR) LEN(10) +
                          VALUE('Q         ')
             DCL        VAR(&MBRTXT) TYPE(*CHAR) LEN(50) VALUE('XML +
                          Lossetillatelse')
             DCL        VAR(&FROM) TYPE(*CHAR) LEN(35) VALUE(KOMPSYSP)
             DCL        VAR(&TO) TYPE(*CHAR) LEN(35) VALUE(KOMPSAP)
             DCL        VAR(&FMS1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&FMS2) TYPE(*CHAR) LEN(80)
  /* TEMPFIL FOR Å LEGGE UT DATA I.. */
             DLTF       FILE(QTEMP/Q)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(QTEMP/Q) RCDLEN(1024)

             CALL       PGM(SYXML17B) PARM(&DELNO &MRNR)

             CALL       PGM(EGF03C1K) PARM(&FILENAME &MBRTXT &FROM +
                          &TO &FMS1 &FMS2)

             ENDPGM
