             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
 /* VAREUTTAK TOLLAGER */
             CALL       PGM(SYXML23B) PARM(&SN)
 /* EKSTRA BEHANDLING ???     */
 /******     CALL       PGM(SYXMLXXXX) PARM(&SN)  **/

             ENDPGM
