             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             OVRDBF     FILE(XMLRCVF01) TOFILE(XMLRCVF)
             CALL       PGM(SYXML28) PARM(&SN)

             ENDPGM
