             PGM        PARM(&KAT &DOK1 &DOK2)
             DCL        VAR(&KAT) TYPE(*CHAR) LEN(70)
             DCL        VAR(&DOK1) TYPE(*CHAR) LEN(70)
             DCL        VAR(&DOK2) TYPE(*CHAR) LEN(70)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(70)

             MD         DIR(&KAT) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)

             CPY        OBJ(&DOK1) TOOBJ(&DOK2)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CALL       PGM(SYXML01L) PARM(&MBR &FIL &DOK1 &DOK2)
             ENDDO

             ENDPGM
