             PGM        PARM(&LIB &FIL &MBR)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(70)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)

             CALL       PGM(SYXML04) PARM(&MBR) /* Send teknisk +
                          kvittering (MessageReceived) */

             CALL       PGM(SYXML13) PARM(&LIB &FIL &MBR) /* +
                          Konvertere inngående transport-XML */
             MONMSG     MSGID(CPF0000)

             ENDPGM
