/* 1...+... 1 ...+... 2 ...+... 3 ...+... 4 ...+... 5 ...+... 6 ...+... 7 ...*/
/*'000000000000004099999EN                                         '         */
/* GRP     KNR     MRAP EN                                                   */

             PGM        PARM(&PARM)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(1) VALUE('A')
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0) VALUE(1)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('0010')

             OVRPRTF    FILE(LL027P) PAGESIZE(70 120) CPI(15) +
                          OVRFLW(61) PAGRTT(0) OUTQ(QPRINT)
             CALL       PGM(LL027R) PARM(&LAS &STR &KOPI &PARM)

             ENDPGM
