             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             CALL       PGM(SYXML17E) PARM(&SN)

             ENDPGM
