             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
 /* VAREINNLEGG TOLLAGER */
             CALL       PGM(SYXML23A) PARM(&SN)
 /* EKSTRA BEHANDLING ???     */
 /******     CALL       PGM(SYXMLXXXX) PARM(&SN)  **/

             ENDPGM
