             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DLTF       FILE(QTEMP/XMLTP1K)
             MONMSG     MSGID(CPF0000)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CRTDUPOBJ  OBJ(XMLTP1K) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             CHGPF      FILE(QTEMP/XMLTP1K) SIZE(1000000 30000 10)
             ENDPGM
