             PGM        PARM(&MBR &FIL &KAT)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&KAT) TYPE(*CHAR) LEN(70)
             CTOPCF     FIL(XMLTILP) LIB(QTEMP) STMF(&FIL)
             MONMSG     MSGID(CPF0000)
             CHGAUT     OBJ(&FIL) USER(*PUBLIC) DTAAUT(*RWX) +
                          OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
             MOV        OBJ(&FIL) TODIR(&KAT)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/XMLTILP)
             ENDPGM
