             PGM
             DCL        VAR(&HOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PTY) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STR) TYPE(*CHAR) LEN(5)
             DCL        VAR(&LAS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UDOKN) TYPE(*DEC) LEN(3 0) VALUE(69)
             DCL        VAR(&KOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KOPIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&UKOPI) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) /* Hvis &in01 +
                          på, betyr det avslutt program fra +
                          avdelingsvalg. */
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) /* Navn til +
                          arbeidsstasjon. */
             DCL        VAR(&AVDA) TYPE(*CHAR) LEN(4) /* AVD PRT */
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) /* AVD PRT */
        /* */
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVDA)
             CALL       PGM(SYGE18) PARM(&UDOKN &PRT &LAS &STR &PTY +
                          &HOLD &SAVE &KOPI &IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT))
        /* */
             RTVJOBA    JOB(&WS) /* Hente arbeidstsjonskode WS */
/* FJERN MEMBER FRA ARBEIDSFIL */
             RMVM       FILE(WFILEAV1) MBR(&WS)
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(WFILEAVT) MBR(&WS)
             MONMSG     MSGID(CPF0000)
/* LEGG TIL NYTT MEMBER TIL ARBEIDSFIL */
             ADDPFM     FILE(WFILEAVT) MBR(&WS)
             ADDLFM     FILE(WFILEAV1) MBR(&WS) DTAMBRS((WFILEAVT +
                          (&WS)))
/* OVERRIDE FILE TIL MEMBER (=DSPSTN NAVN.) */
             OVRDBF     FILE(WFILEAVT) TOFILE(WFILEAVT) MBR(&WS)
             OVRDBF     FILE(WFILEAV1) TOFILE(WFILEAV1) MBR(&WS)
        /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
 /*HOLD PRINTERFILA I UTGANGSPUNKTET */
             OVRPRTF    FILE(SYYA02PF) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(68) OUTQ(&PRT) FORMTYPE(&PTY) +
                          COPIES(&KOPI) HOLD(&HOLD) SAVE(&SAVE)
             CHGVAR     VAR(&KOPIA) VALUE(&KOPI)
             CALL       PGM(SYYA02)   PARM(&LAS &STR &KOPIA)
/*           CALL       PGM(SYYA02CLA) PARM(SYYA02PF)        */
/*HVIS UTSKR. FINNES ENNÅ (IKKE VIA TEKSTBEH.) FRIGJØR DEN...*/
/*           RLSSPLF    FILE(SYYA02PF) SPLNBR(*LAST)         */
             MONMSG     CPF0000
 SLUTT:      ENDPGM
