             PGM
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&WS)
             CHKOBJ     OBJ(*LIBL/TARIGM) OBJTYPE(*FILE) MBR(*FIRST)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             SNDBRKMSG  MSG('GAMMEL TARIFF må ligge i +
                          bibliotekslisten og ha navn "TARIGM" for +
                          å kunne kjøre denne rutinen. (NY tariff +
                          skal ligge "ferdig installert" med navn +
                          "TARI")') TOMSGQ(&WS)
             GOTO       CMDLBL(END)
             ENDDO

             CALL       TARITX

 END:        ENDPGM
