             PGM        PARM(&WWAUTI)
    /* */
             DCL        VAR(&WWAUTI) TYPE(*CHAR) LEN(72)
             DCL        VAR(&WWUSER) TYPE(*CHAR) LEN(17)
             RTVJOBA    USER(&WWUSER)
    /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(*LIBL/SMAMSGF)
    /* */
             CALL       PGM(*LIBL/TDV51R) PARM(&WWAUTI &WWUSER)
    /* */
             DLTOVR     FILE(QUSERMSG)
             MONMSG     MSGID(CPF0000)
    /* */
             ENDPGM
