             PGM        PARM(&AWB &USER &RECN)
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&AWB) TYPE(*CHAR) LEN(11)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(17)
             DCL        VAR(&RECN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&SMALIBF) TYPE(*CHAR) LEN(10) VALUE('J')
             ADDLIBLE   LIB(SMALIBF)
             MONMSG     MSGID(CPF0000) CMPDTA(*NONE) EXEC(CHGVAR +
                          VAR(&SMALIBF) VALUE('N'))
             CALL       PGM(TDV61R) PARM(&AWB &USER &RECN)
             IF         COND(&SMALIBF = 'J') THEN(RMVLIBLE +
                          LIB(SMALIBF))
             ENDPGM
