/*****************************RS*,, CMD TIME**************************/
             PGM
             DCL        VAR(&MSG1) TYPE(*CHAR) VALUE('Klokken er:')
             DCL        VAR(&MSG2) TYPE(*CHAR) LEN(5) VALUE('Dato:')
             DCL        VAR(&TID) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
/**/
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TID)
             RTVSYSVAL  SYSVAL(QDATE) RTNVAR(&DATE)
/**/
             SNDPGMMSG  MSG(&MSG1 *TCAT &TID *BCAT &MSG2 *CAT &DATE)
/**/
             ENDPGM
