/* v kjøring EN gang (mange gamle data) er time -10       */
/*           default er 3000 eller noe slikt              */
/* -in / -out / -loglevel  er parametre i javakallet          */
/* -time = ventetid i millisekund mellom 2 filer              */
/* -loglevel 1 = full logging, 2,3,4 synkende, 5 = KUN FATAL errors logges  */

             PGM
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             CRTPF      FILE(QTEMP/TKOMTEGNL) RCDLEN(500) +
                          SIZE(100000 10000)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(SYSPED/TKOMTEGNL) RCDLEN(500) +
                          SIZE(10000000 10000)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(STDOUT) TOFILE(QTEMP/TKOMTEGNL)

 START:      QSH        CMD('java -Djava.awt.headless=true +
                          -classpath /syspeddev/TKomtegn TKomtegn +
                          -in /syspeddev/tksigntst +
                          -out /syspeddev/signatst +
                          -time 10 +
                          -loglevel 1')

             CPYF       FROMFILE(QTEMP/TKOMTEGNL) +
                          TOFILE(SYSPED/TKOMTEGNL) MBROPT(*ADD)
             MONMSG     MSGID(CPF0000)

ENDPGM
