             PGM        PARM(&DSMNA)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10) +
                          VALUE('TP123PB  ')
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50) +
                          VALUE('pdf/edi/ZE2010test.pdf')
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSMNA) TYPE(*CHAR) LEN(9)
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(TP123P) PAGESIZE(48 154) CPI(15) +
                          OVRFLW(46) OUTQ(QPRINT)
             OVRPRTF    FILE(TP123PB) PAGESIZE(48 120) CPI(15) +
                          OVRFLW(46) OUTQ(OUTMAIL)
             CALL       PGM(TPINV921R) PARM(&DSMNA &KOPI)
/* GENERERER PDF                                              */
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &BANE)
/*                                                            */
             ENDPGM
