             PGM        PARM(&TYPE)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3) VALUE('000')
             OVRDBF     FILE(TRKODLUP) TOFILE(TRKODL01)
             CALL       PGM(TR001R) PARM(&TYPE)
             ENDPGM
