             PGM
             DCL        VAR(&IE) TYPE(*CHAR) LEN(1) VALUE('I')
             CALL       PGM(TR003RA) PARM(&IE)
             ENDPGM
