/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10017 * 01 YBC PTF10 SKILLE TET-EKSPORT OG FORHÅNDSVARSLING IMPORT      */
/* ********************************************************************    */
             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('EL.TRANSIT')
/*N01*/      DCL        VAR(&IE) TYPE(*CHAR) LEN(1) VALUE('E')

             CALL       PGM(LOGUSR) PARM(&PGM)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             OVRDBF     FILE(TRUHOPD) TOFILE(TRUH)
/*E01*/      CALL       PGM(TR010R) PARM(&IE)
             RCLRSC
             CALL       PGM(TR014C)
             ENDDO

             ENDPGM
