/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10017 * 01 YBC PTF10 SKILLE TET-EKSPORT OG FORHÅNDSVARSLING IMPORT      */
/* ********************************************************************    */
             PGM
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
/*N01*/      DCL        VAR(&IE) TYPE(*CHAR) LEN(1) VALUE('E')
             RTVUSRPRF  RTNUSRPRF(&USR)
/*E01*/      CALL       PGM(TR015R) PARM(&USR &IE)
             ENDPGM
