             PGM
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             RTVUSRPRF  RTNUSRPRF(&USR)
             CALL       PGM(TR068R) PARM(&USR)
             ENDPGM
