             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)   TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)    TYPE(*DEC) LEN(6)
             DCL        VAR(&DLT)    TYPE(*CHAR) LEN(1)  VALUE('N')
             DCL        VAR(&LIBFR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIB)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDI)
             OVRDBF     FILE(EDIM2)     TOFILE(&LIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)      TOFILE(&LIBEDI/EDIS)
             OVRDBF     FILE(TRUERR)    TOFILE(&LIB/TRUERR)
             OVRDBF     FILE(TRUH09)    TOFILE(&LIB/TRUH09)
             OVRDBF     FILE(TRUHFR)    TOFILE(&LIB/TRUHFR)
             OVRDBF     FILE(TRUHFS)    TOFILE(&LIB/TRUHFS)
             OVRDBF     FILE(TRUHGB)    TOFILE(&LIB/TRUHGB)
             OVRDBF     FILE(TRUHGN)    TOFILE(&LIB/TRUHGN)
             OVRDBF     FILE(TRUHK)     TOFILE(&LIB/TRUHK)
             OVRDBF     FILE(TRUHL)     TOFILE(&LIB/TRUHL)
             OVRDBF     FILE(TRUV)      TOFILE(&LIB/TRUV)
             OVRDBF     FILE(TRUVAM)    TOFILE(&LIB/TRUVAM)
             OVRDBF     FILE(TRUVCN)    TOFILE(&LIB/TRUVCN)
             OVRDBF     FILE(TRUVDK)    TOFILE(&LIB/TRUVDK)
             OVRDBF     FILE(TRUVFS)    TOFILE(&LIB/TRUVFS)
             OVRDBF     FILE(TRUVMN)    TOFILE(&LIB/TRUVMN)
             OVRDBF     FILE(TRUVTD)    TOFILE(&LIB/TRUVTD)
             OVRDBF     FILE(TRUVVT)    TOFILE(&LIB/TRUVVT)
             OVRDBF     FILE(TVINF)     TOFILE(&LIBFR/TVINF)

             CALL       PGM(TR203R) PARM(&AVD &DT &DLT)

             ENDPGM
