             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIB)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDI)
             ALCOBJ     OBJ((&LIB/TRUH *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             SNDPGMMSG  MSG('TET-eksport i historikk kan ikke +
                          reorganiseres pga. at noen bruker +
                          TET-eksport filer.')
             GOTO       CMDLBL(SLUTT)
             ENDDO
             DLCOBJ     OBJ((&LIB/TRUH *FILE *EXCL))
        /*______________________*/
        /* Reorganisere members */
        /*""""""""""""""""""""""*/
             RGZPFM     FILE(&LIBEDI/EDIM)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIBEDI/EDIS)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUH)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHFR)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHFS)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHGB)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHGN)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHK)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUHL)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUV)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVAM)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVCN)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVDK)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVFS)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVMN)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVTD)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/TRUVVT)
             MONMSG     MSGID(CPF2995 CPF2981)
 SLUTT:      ENDPGM
