             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)    TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)     TYPE(*DEC) LEN(6)
             DCL        VAR(&LIBFR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBTO)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDIO) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBTO)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBEDI)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDIO)
             OVRDBF     FILE(EDIM2)     TOFILE(&LIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)      TOFILE(&LIBEDI/EDIS)
             OVRDBF     FILE(TRUERR)    TOFILE(&LIBFR/TRUERR)
             OVRDBF     FILE(TRUH09)    TOFILE(&LIBFR/TRUH09)
             OVRDBF     FILE(TRUHFR)    TOFILE(&LIBFR/TRUHFR)
             OVRDBF     FILE(TRUHFS)    TOFILE(&LIBFR/TRUHFS)
             OVRDBF     FILE(TRUHGB)    TOFILE(&LIBFR/TRUHGB)
             OVRDBF     FILE(TRUHGN)    TOFILE(&LIBFR/TRUHGN)
             OVRDBF     FILE(TRUHK)     TOFILE(&LIBFR/TRUHK)
             OVRDBF     FILE(TRUHL)     TOFILE(&LIBFR/TRUHL)
             OVRDBF     FILE(TRUV)      TOFILE(&LIBFR/TRUV)
             OVRDBF     FILE(TRUVAM)    TOFILE(&LIBFR/TRUVAM)
             OVRDBF     FILE(TRUVCN)    TOFILE(&LIBFR/TRUVCN)
             OVRDBF     FILE(TRUVDK)    TOFILE(&LIBFR/TRUVDK)
             OVRDBF     FILE(TRUVFS)    TOFILE(&LIBFR/TRUVFS)
             OVRDBF     FILE(TRUVMN)    TOFILE(&LIBFR/TRUVMN)
             OVRDBF     FILE(TRUVTD)    TOFILE(&LIBFR/TRUVTD)
             OVRDBF     FILE(TRUVVT)    TOFILE(&LIBFR/TRUVVT)
             OVRDBF     FILE(TVINF)     TOFILE(&LIBFR/TVINF)

             OVRDBF     FILE(EDIMOLD)   TOFILE(&LIBEDIO/EDIM)
             OVRDBF     FILE(EDISOLD)   TOFILE(&LIBEDIO/EDIS)
             OVRDBF     FILE(TRUHOLD)   TOFILE(&LIBTO/TRUH)
             OVRDBF     FILE(TRUHFROLD) TOFILE(&LIBTO/TRUHFR)
             OVRDBF     FILE(TRUHFSOLD) TOFILE(&LIBTO/TRUHFS)
             OVRDBF     FILE(TRUHGBOLD) TOFILE(&LIBTO/TRUHGB)
             OVRDBF     FILE(TRUHGNOLD) TOFILE(&LIBTO/TRUHGN)
             OVRDBF     FILE(TRUHKOLD)  TOFILE(&LIBTO/TRUHK)
             OVRDBF     FILE(TRUHLOLD)  TOFILE(&LIBTO/TRUHL)
             OVRDBF     FILE(TRUVOLD)   TOFILE(&LIBTO/TRUV)
             OVRDBF     FILE(TRUVAMOLD) TOFILE(&LIBTO/TRUVAM)
             OVRDBF     FILE(TRUVCNOLD) TOFILE(&LIBTO/TRUVCN)
             OVRDBF     FILE(TRUVDKOLD) TOFILE(&LIBTO/TRUVDK)
             OVRDBF     FILE(TRUVFSOLD) TOFILE(&LIBTO/TRUVFS)
             OVRDBF     FILE(TRUVMNOLD) TOFILE(&LIBTO/TRUVMN)
             OVRDBF     FILE(TRUVTDOLD) TOFILE(&LIBTO/TRUVTD)
             OVRDBF     FILE(TRUVVTOLD) TOFILE(&LIBTO/TRUVVT)

             CALL       PGM(TR201R) PARM(&AVD &DT)

             ENDPGM
