             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)   TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)    TYPE(*DEC) LEN(6)
             DCL        VAR(&DLT)    TYPE(*CHAR) LEN(1)  VALUE('N')
             DCL        VAR(&LIBFR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIB)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDI)
             OVRDBF     FILE(EDIM2)     TOFILE(&LIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)      TOFILE(&LIBEDI/EDIS)
             OVRDBF     FILE(TRIH09)    TOFILE(&LIB/TRIH09)
             OVRDBF     FILE(TRIHFS)    TOFILE(&LIB/TRIHFS)
             OVRDBF     FILE(TRIHPK)    TOFILE(&LIB/TRIHPK)
             OVRDBF     FILE(TRIL)      TOFILE(&LIB/TRIL)
             OVRDBF     FILE(TRILCN)    TOFILE(&LIB/TRILCN)
             OVRDBF     FILE(TRILDK)    TOFILE(&LIB/TRILDK)
             OVRDBF     FILE(TRILKL)    TOFILE(&LIB/TRILKL)
             OVRDBF     FILE(TRILMN)    TOFILE(&LIB/TRILMN)
             OVRDBF     FILE(TRILPK)    TOFILE(&LIB/TRILPK)
             OVRDBF     FILE(TRILVT)    TOFILE(&LIB/TRILVT)
             OVRDBF     FILE(TRIV)      TOFILE(&LIB/TRIV)
             OVRDBF     FILE(TRIVCN)    TOFILE(&LIB/TRIVCN)
             OVRDBF     FILE(TRIVFS)    TOFILE(&LIB/TRIVFS)
             OVRDBF     FILE(TVINF)     TOFILE(&LIBFR/TVINF)
             OVRDBF     FILE(TRIHCMP)   TOFILE(&LIB/TRIHCMP)

             CALL       PGM(TR252R) PARM(&AVD &DT &DLT)

             ENDPGM
