/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NY FIL TRILVT                                      */
/* ********************************************************************    */
             PGM
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&LIBFR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBTO)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDIO) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBTO)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBEDI)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDIO)
             OVRDBF     FILE(EDIM2)     TOFILE(&LIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)      TOFILE(&LIBEDI/EDIS)
             OVRDBF     FILE(TRIH09)    TOFILE(&LIBFR/TRIH09)
             OVRDBF     FILE(TRIHFS)    TOFILE(&LIBFR/TRIHFS)
             OVRDBF     FILE(TRIHPK)    TOFILE(&LIBFR/TRIHPK)
             OVRDBF     FILE(TRIL)      TOFILE(&LIBFR/TRIL)
             OVRDBF     FILE(TRILCN)    TOFILE(&LIBFR/TRILCN)
             OVRDBF     FILE(TRILDK)    TOFILE(&LIBFR/TRILDK)
             OVRDBF     FILE(TRILKL)    TOFILE(&LIBFR/TRILKL)
             OVRDBF     FILE(TRILMN)    TOFILE(&LIBFR/TRILMN)
             OVRDBF     FILE(TRILPK)    TOFILE(&LIBFR/TRILPK)
/*N01*/      OVRDBF     FILE(TRILVT)    TOFILE(&LIBFR/TRILVT)
             OVRDBF     FILE(TRIV)      TOFILE(&LIBFR/TRIV)
             OVRDBF     FILE(TRIVCN)    TOFILE(&LIBFR/TRIVCN)
             OVRDBF     FILE(TRIVFS)    TOFILE(&LIBFR/TRIVFS)
             OVRDBF     FILE(TVINF)     TOFILE(&LIBFR/TVINF)

             OVRDBF     FILE(EDIMOLD)   TOFILE(&LIBEDIO/EDIM)
             OVRDBF     FILE(EDISOLD)   TOFILE(&LIBEDIO/EDIS)
             OVRDBF     FILE(TRIHOLD)   TOFILE(&LIBTO/TRIH)
             OVRDBF     FILE(TRIHFSOLD) TOFILE(&LIBTO/TRIHFS)
             OVRDBF     FILE(TRIHPKOLD) TOFILE(&LIBTO/TRIHPK)
             OVRDBF     FILE(TRILOLD)   TOFILE(&LIBTO/TRIL)
             OVRDBF     FILE(TRILCNOLD) TOFILE(&LIBTO/TRILCN)
             OVRDBF     FILE(TRILDKOLD) TOFILE(&LIBTO/TRILDK)
             OVRDBF     FILE(TRILKLOLD) TOFILE(&LIBTO/TRILKL)
             OVRDBF     FILE(TRILMNOLD) TOFILE(&LIBTO/TRILMN)
             OVRDBF     FILE(TRILPKOLD) TOFILE(&LIBTO/TRILPK)
/*N01*/      OVRDBF     FILE(TRILVTOLD) TOFILE(&LIBTO/TRILVT)
             OVRDBF     FILE(TRIVOLD)   TOFILE(&LIBTO/TRIV)
             OVRDBF     FILE(TRIVCNOLD) TOFILE(&LIBTO/TRIVCN)
             OVRDBF     FILE(TRIVFSOLD) TOFILE(&LIBTO/TRIVFS)

             CRTBNDRPG  PGM(SYENDPTF/TR251R) +
                          SRCFILE(SYENDPTF/QRPGSRC) SRCMBR(TR251R)
             MONMSG     MSGID(RNS0000)
             DLTOVR     FILE(*ALL)

             ENDPGM
