/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 NY FIL TRILVT                                      */
/* ********************************************************************    */
             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)    TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)     TYPE(*DEC) LEN(6)
             DCL        VAR(&DLT)    TYPE(*CHAR) LEN(1)  VALUE('J')
             DCL        VAR(&LIBFR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBTO)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBFR)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIBTO)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBEDI)
             OVRDBF     FILE(EDIM2)     TOFILE(&LIBEDI/EDIM2)
             OVRDBF     FILE(EDIS)      TOFILE(&LIBEDI/EDIS)
             OVRDBF     FILE(TRIH09)    TOFILE(&LIBFR/TRIH09)
             OVRDBF     FILE(TRIHFS)    TOFILE(&LIBFR/TRIHFS)
             OVRDBF     FILE(TRIHPK)    TOFILE(&LIBFR/TRIHPK)
             OVRDBF     FILE(TRIL)      TOFILE(&LIBFR/TRIL)
             OVRDBF     FILE(TRILCN)    TOFILE(&LIBFR/TRILCN)
             OVRDBF     FILE(TRILDK)    TOFILE(&LIBFR/TRILDK)
             OVRDBF     FILE(TRILKL)    TOFILE(&LIBFR/TRILKL)
             OVRDBF     FILE(TRILMN)    TOFILE(&LIBFR/TRILMN)
             OVRDBF     FILE(TRILPK)    TOFILE(&LIBFR/TRILPK)
/*N01*/      OVRDBF     FILE(TRILVT)    TOFILE(&LIBFR/TRILVT)
             OVRDBF     FILE(TRIV)      TOFILE(&LIBFR/TRIV)
             OVRDBF     FILE(TRIVCN)    TOFILE(&LIBFR/TRIVCN)
             OVRDBF     FILE(TRIVFS)    TOFILE(&LIBFR/TRIVFS)
             OVRDBF     FILE(TRIHCMP)   TOFILE(&LIBTO/TRIHCMP)
             OVRDBF     FILE(TVINF)     TOFILE(&LIBFR/TVINF)

             CALL       PGM(TR252R) PARM(&AVD &DT &DLT)

             ENDPGM
