             PGM        PARM(&AVD &DT)
        /*___________________*/
        /* Declare Variables */
        /*"""""""""""""""""""*/
             DCL        VAR(&AVD)   TYPE(*DEC) LEN(4)
             DCL        VAR(&DT)    TYPE(*DEC) LEN(6)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
        /*_________________________________________________*/
        /* Slette records t.o.m et dato for valgt avdeling */
        /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIB)
             OVRDBF     FILE(TRIH1CMP) TOFILE(&LIB/TRIH1CMP)
             CALL       PGM(TR254R) PARM(&AVD &DT)
             ENDPGM
