             PGM

             DCL        VAR(&FRA) TYPE(*CHAR) LEN(120) +
                          VALUE('/mmail/infoprint/ARKIV/JOVO/738193_0+
                          00002_SYEX43P_02052009_000001.PDF')
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(120) +
                          VALUE('/nas/arc/cm2009000153978hlQpVa7Egl01.p+
                          df')


             SBMJOB     CMD(DEL OBJLNK(&TIL)) JOB(TSTDELNSF) +
                          JOBQ(SYJOBQNMAX) USER(NFSUSER) LOG(4 00 +
                          *SECLVL) LOGCLPGM(*YES)

             SBMJOB     CMD(CPY OBJ(&FRA) TOOBJ(&TIL)) +
                          JOB(TSTCPYNSF) JOBQ(SYJOBQNMAX) +
                          USER(NFSUSER) LOG(4 00 *SECLVL) +
                          LOGCLPGM(*YES)

             ENDPGM
