             PGM        PARM(&MSN &MMN &MAVD &MTDN &M0068A &M0068B +
                          &M0068C &M1001 &IN03)
     /*___________________*/
     /* Beskriv variabler */
     /*"""""""""""""""""""*/
             DCL        VAR(&MSN) TYPE(*DEC) LEN(5 0)
             DCL        VAR(&MMN) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&MAVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&MTDN) TYPE(*DEC) LEN(5 0)
             DCL        VAR(&M0068A) TYPE(*CHAR) LEN(8)
             DCL        VAR(&M0068B) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&M0068C) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&M1001) TYPE(*CHAR) LEN(3)
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1)
             DCL        VAR(&MRKP) TYPE(*CHAR) LEN(10) /* Printer +
                          Device for Merknader */
     /*______________________________________________*/
     /* Hente avdelingsopplysninger for å overstyre  */
     /* printerfiler.                                */
     /*""""""""""""""""""""""""""""""""""""""""""""""*/
             CALL       PGM(TVI11R) PARM(&MAVD &MRKP &M1001)
             OVRPRTF    FILE(TVINME) OUTQ(&MRKP)
     /*______________________________________________*/
     /* Lage melding type ME i EDIM.                 */
     /* Lage post i TVINF.                           */
     /* Lage print av melding.                       */
     /* Oppdatere SADH med status=P                  */
     /*""""""""""""""""""""""""""""""""""""""""""""""*/
             CALL       PGM(TVI10R) PARM(&MMN &MAVD &MTDN &M0068A +
                          &M0068B &M0068C &M1001 &IN03)
             ENDPGM
