             PGM
             DCL        VAR(&FILEPTR) TYPE(*CHAR) LEN(30) /* +
                          Parameter passed to QMRSWTR */
/*___________________________________________________________________*/
/* QMRSWTR startes for å skrive en fil mottat fra Tollvesenet.       */
/* Navnet på File, Library og Member returneres i variablen &FILEPTR.*/
/*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""*/
             CALL       PGM(QMRSWTR) PARM(&FILEPTR)
             ENDPGM
