             PGM        PARM(&AVD &TDN &MN)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TDN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&NRBE) TYPE(*DEC) LEN(3 0) VALUE(086)
             DCL        VAR(&PRT86) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PT86) TYPE(*CHAR) LEN(10)

             CALL       PGM(GETPRT) PARM(&AVD &NRBE &PRT86 &PT86)
             OVRPRTF    FILE(TVI28FP) PAGESIZE(72 80) CPI(10) +
                          OVRFLW(70) OUTQ(&PRT86) FORMTYPE(&PT86)
             CALL       PGM(TVI28RF) PARM(&AVD &TDN &MN)

             ENDPGM
