             PGM
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&ENDTIME) TYPE(*CHAR) LEN(6) /* +
                          Avsluttning av SBS */
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6) /* Systemtid */
             DCL        VAR(&UJN) TYPE(*CHAR) LEN(1)
 /*__________________________*/
 /* Skal polling avsluttes ? */
 /*""""""""""""""""""""""""""*/
TAG01:       RTVDTAARA  DTAARA(EDIDTA (160 6)) RTNVAR(&ENDTIME)
             IF         COND(&ENDTIME *NE *NONE) THEN(DO)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&ENDTIME *LT &QTIME) THEN(DO)
             GOTO       CMDLBL(END)
             ENDDO
             ENDDO
 /*_____________________*/
 /* Delsystem er aktivt */
 /*"""""""""""""""""""""*/
             CHGVAR     VAR(&UJN) VALUE('N')
             CALL       PGM(TYR01R) PARM(&UJN)
             IF         COND(&UJN *NE 'J') THEN(DLYJOB DLY(300))
             GOTO       CMDLBL(TAG01)
END:         ENDPGM
