             PGM        PARM(&AVD &OPD)
             DCL        VAR(&HOVED) TYPE(*CHAR) LEN(10)
             DCL        VAR(&VARE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FAXTYP) TYPE(*CHAR) LEN(1) VALUE('A')
/*           DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)     */
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&BANE1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&BANE2) TYPE(*CHAR) LEN(256)
             DCL        VAR(&ARLINK1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&ARLINK2) TYPE(*CHAR) LEN(40)
  /*         DCL        VAR(&IN01) TYPE(*CHAR) LEN(1)     */
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&BANE1) VALUE('/SYSPEDF/nas/arc/sadh' +
                          *CAT &AVD *CAT &OPD *CAT '.pdf')
             CHGVAR     VAR(&BANE2) VALUE('/SYSPEDF/nas/arc/sadv' +
                          *CAT &AVD *CAT &OPD *CAT '.pdf')
             CHGVAR     VAR(&ARLINK1) VALUE('sadh' +
                          *CAT &AVD *CAT &OPD *CAT '.pdf')
             CHGVAR     VAR(&ARLINK2) VALUE('sadv' +
                          *CAT &AVD *CAT &OPD *CAT '.pdf')
             RMVLNK     OBJLNK(&BANE1)
             MONMSG     MSGID(CPF0000)
             RMVLNK     OBJLNK(&BANE2)
             MONMSG     MSGID(CPF0000)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             OVRPRTF    FILE(TOLLDEK)  DEVTYPE(*AFPDS) +
                          PAGESIZE(72 83) LPI(6) CPI(10) +
                          FRONTMGN(0.14 0) OVRFLW(72) +
                          FRONTOVL(FSAD38) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD)
             OVRPRTF    FILE(DATALIST) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 83) LPI(6) CPI(10) +
                          OVRFLW(72) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD)
             OVRDBF     FILE(WFILEIMP) MBR(ARKIV)
             CHGVAR     VAR(&HOVED) VALUE('TOLLDEK')
             CHGVAR     VAR(&VARE) VALUE('DATALIST')
             CALL       PGM(SAD61P) PARM(&FAXTYP &AVD &OPD &PRT1 +
                          &PRT2 &PRT3)

                          ADDLIBLE   LIB(MMAIL)
                          MONMSG     MSGID(CPF0000)

                          CVTSPLFPDF SPLF(&HOVED) JOB(&QNBR/&QUSER/&QJOB) +
                                       TOPDF(&BANE1)
                          CVTSPLFPDF SPLF(&VARE) JOB(&QNBR/&QUSER/&QJOB) +
                                       TOPDF(&BANE2)

                          DLTSPLF    FILE(&HOVED) JOB(&QNBR/&QUSER/&QJOB) +
                                       SPLNBR(*LAST)
                          MONMSG     MSGID(CPF0000)
                          DLTSPLF    FILE(&VARE) JOB(&QNBR/&QUSER/&QJOB) +
                                       SPLNBR(*LAST)
                          MONMSG     MSGID(CPF0000)
             CALL       PGM(TYR22R) PARM(&AVD &OPD &ARLINK1 &ARLINK2)
/*           EMLSTMF    SUBJECT('SAD Import') FROMNAME('SYSPED') +
                          FROMADDR('systema@tyringe.se') +
                          TO('christer@systema.no'/'Nimatopaal'/*TO) +
                          STMF(&BANE1)   */
   /*        MONMSG     MSGID(MSG0008)     */
   /*        CALL       PGM(SYGE35CL) PARM(&BANE1 &IN01)     */
   /*        IF         COND(&IN01 = '0') THEN(DO)             */
   /*        EMLSTMF    SUBJECT('SAD Import') FROMNAME('SYSPED') +
                          FROMADDR('SYSTEMA@TYRINGE.SE') +
                          TO('christer@systema.no'/'Nimatopaal'/*TO) +
                          STMF(&BANE2)                           */
     /*      MONMSG     MSGID(MSG0008)                          */
     /*      ENDDO                                            */
            RMVLIBLE   LIB(MMAIL)
SLUTT:      ENDPGM
