             PGM
             DCL        VAR(&HISTLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DRIFTLIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&DRIFTLIB)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&HISTLIB)
             ADDLIBLE   LIB(&HISTLIB) POSITION(*BEFORE &DRIFTLIB)
             CHGDTAARA  DTAARA(*LDA (301 1)) VALUE('N')
             OVRDBF     FILE(V10FNF) TOFILE(V10SYSF/V10FNF)

             CALL       PGM(V10RE101)
             CALL       PGM(V10RE102)
             CALL       PGM(V10RE103)
             CALL       PGM(V10RE104)
             CALL       PGM(V10RE105)
             CALL       PGM(V10RE109)
             CALL       PGM(V10RE110)
             CALL       PGM(V10RE113)
             CALL       PGM(V10RE114)

             RMVLIBLE   LIB(&HISTLIB)
             MONMSG     MSGID(CPF2104)

             ENDPGM
