             PGM        PARM(&LIBF)
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DCLF       FILE(FIRM) RCDFMT(*ALL)
             OVRDBF     FILE(FIRM) TOFILE(&LIBF/FIRM)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             DLTOVR     FILE(FIRM)
             ALCOBJ     OBJ((&LIBF/PRGE *FILE *SHRRD))
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))

             CHGVAR     VAR(&LIB) VALUE('V11PR_' *CAT &FIFIRM)
             CRTLIB     LIB(&LIB) TEXT('Gamle filer for prisavtale')
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&LIBF/PRBFS) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBGE) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBLK) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBLS) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBTR) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBTS) OBJTYPE(*FILE) TOLIB(&LIB)
/*           MOVOBJ     OBJ(&LIBF/PRIKB) OBJTYPE(*FILE) TOLIB(&LIB)    */
             MOVOBJ     OBJ(&LIBF/PRIKB1) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIKB1D) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIKB1D2) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIKB2) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIKB3) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRBJOIN) OBJTYPE(*FILE) TOLIB(&LIB)

             MOVOBJ     OBJ(&LIBF/PRFS) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRGE) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRLK) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRLS) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRTR) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRTS) OBJTYPE(*FILE) TOLIB(&LIB)
/*           MOVOBJ     OBJ(&LIBF/PRIK) OBJTYPE(*FILE) TOLIB(&LIB)      */
             MOVOBJ     OBJ(&LIBF/PRIK1) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIK1D) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIK1D2) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIK2) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIK3) OBJTYPE(*FILE) TOLIB(&LIB)
             MOVOBJ     OBJ(&LIBF/PRIKJOIN) OBJTYPE(*FILE) TOLIB(&LIB)

 SLUTT:      ENDPGM
