             PGM
             DCL        VAR(&HISTLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DRIFTLIB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&DRIFTLIB)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&HISTLIB)
             ADDLIBLE   LIB(&HISTLIB) POSITION(*BEFORE &DRIFTLIB)
             CHGDTAARA  DTAARA(*LDA (301 1)) VALUE('N')
             OVRDBF     FILE(V11FNF) TOFILE(V11SYSF/V11FNF)

             CALL       PGM(V11RE001)
             CALL       PGM(V11RE002)
             CALL       PGM(V11RE003)
             CALL       PGM(V11RE101)
             CALL       PGM(V11RE102)
             CALL       PGM(V11RE103)
             CALL       PGM(V11RE104)
             CALL       PGM(V11RE107)
             CHGPF      FILE(SAEV) FRCRATIO(*NONE)
             CALL       PGM(V11RE113)
             CHGPF      FILE(SAEV) FRCRATIO(1)

             RMVLIBLE   LIB(&HISTLIB)
             MONMSG     MSGID(CPF2104)

             ENDPGM
