             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DCLF       FILE(FIRM) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             CHGVAR     VAR(&LIB) VALUE('V11PR_' *CAT &FIFIRM)

             OVRDBF     FILE(PRJOIN) TOFILE(&LIB/PRJOIN)
             OVRDBF     FILE(PRIK) TOFILE(&FILIBF/PRIK)
             CALL       PGM(V11RE117)
             OVRDBF     FILE(PRJOIN) TOFILE(&LIB/PRBJOIN)
             OVRDBF     FILE(PRIK) TOFILE(&FILIBF/PRIKB)
             CALL       PGM(V11RE117)

             ENDPGM
