             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('SYENDRE')
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(30)

             CALL       PGM(V12FKR51) PARM(&LIB)

             CRTMSGF    MSGF(&LIB/SYMFFIRMA) TEXT('Melingsfil for +
                          firmaopplysninger')
             MONMSG     MSGID(CPF2112) EXEC(DO)
             CHGMSGD    MSGID(SYS0001) MSGF(&LIB/SYMFFIRMA) +
                          MSG('Versjon 12')
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(V12FKR51A) PARM(&TXT)
             ADDMSGD    MSGID(SYS0000) MSGF(&LIB/SYMFFIRMA) MSG(&TXT)
             ADDMSGD    MSGID(SYS0001) MSGF(&LIB/SYMFFIRMA) +
                          MSG('Versjon 12')

 START:      CALL       PGM(CRTMENYCL) PARM('SYSPEDS' &LIB)
             IF         COND(&LIB > 'A00') THEN(DO)
             IF         COND(&LIB < 'A99') THEN(DO)
             CALL       PGM(CRTMENYCL) PARM('ASPSYENDPT' &LIB)
             CALL       PGM(CRTMENYCL) PARM('ASPSYEND' &LIB)
             GOTO       CMDLBL(SLUTT)
             ENDDO
             ENDDO
             CALL       PGM(CRTMENYCL) PARM('SYENDPTF' &LIB)

 SLUTT:      ENDPGM
