             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* Fra +
                          bibliotek V11 */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* Til +
                          bibliotek for datafiler V12 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V11 skal tømmes etter konvertering. */

             CLRPFM     FILE(&FILNV)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(SADV4) TOFILE(&FRALIB/SADV4)
             OVRDBF     FILE(SADV) TOFILE(&TILLIB/SADV)
             CALL       PGM(V12RE103)
             DLTOVR     FILE(SADV)
             DLTOVR     FILE(SADV4)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV)
             MONMSG     MSGID(CPF0000)
             ENDDO

             ENDPGM
