             PGM
             DCL        VAR(&SØK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VKOD) TYPE(*CHAR) LEN(3)
             CALL       PGM(V200SY) PARM(&SØK &VKOD)
             ENDPGM
