             PGM
             DCL        VAR(&SØK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VKOD) TYPE(*CHAR) LEN(3)
             OVRDBF     FILE(VALUL01) TOFILE(VAIAL01)
             CALL       PGM(V200SY) PARM(&SØK &VKOD)
             DLTOVR     FILE(VALUL01)
             ENDPGM
