             PGM        PARM(&FRALIB &TILLIB)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             OVRDBF     FILE(AIRLD) TOFILE(&TILLIB/AIRLD)
             CALL       PGM(FIXRAT)
             ENDPGM
