             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/BILLOF)
             OVRDBF     FILE(BILLOFNY) TOFILE(&TILLIB/BILLOF)
             OVRDBF     FILE(BILLOFGM) TOFILE(&FRALIB/BILLOF)
             CALL       PGM(V5FKR03)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BILLOF))

             ENDPGM
