             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SAML)
             OVRDBF     FILE(SAMLNY) TOFILE(&TILLIB/SAML)
             OVRDBF     FILE(SAMLGM) TOFILE(&FRALIB/SAML)
             CALL       PGM(V5FKR51)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SAML))

             ENDPGM
