             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(&FRALIB/ZAEH) TOFILE(&TILLIB/ZAEH) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000) CMPDTA(*NONE) EXEC(GOTO +
                          CMDLBL(SLUTT))
             OVRDBF     FILE(ZAEH) TOFILE(&TILLIB/ZAEH)
             CALL       PGM(V5FKR77)
 SLUTT:      IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ZAEH))

             ENDPGM
