             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/ZREETXT)
             OVRDBF     FILE(ZRTXTNY) TOFILE(&TILLIB/ZREETXT)
             OVRDBF     FILE(ZRTXTGM) TOFILE(&FRALIB/ZREETXT)
             CALL       PGM(V5FKR79)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ZREETXT))

             ENDPGM
