             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TVINRMD)
             OVRDBF     FILE(TVINRNY) TOFILE(&TILLIB/TVINRMD)
             OVRDBF     FILE(TVINRGM) TOFILE(&FRALIB/TVINRMD)
             CALL       PGM(V5FKR72)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TVINRMD))

             ENDPGM
