             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SADTRH)
             OVRDBF     FILE(SADTRHNY) TOFILE(&TILLIB/SADTRH)
             OVRDBF     FILE(SADTRHGM) TOFILE(&FRALIB/SADTRH)
             CALL       PGM(V5FKR48)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SADTRH))

             ENDPGM
