             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FREETXT)
             OVRDBF     FILE(FRTXTNY) TOFILE(&TILLIB/FREETXT)
             OVRDBF     FILE(FRTXTGM) TOFILE(&FRALIB/FREETXT)
             CALL       PGM(V5FKR24)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FREETXT))

             ENDPGM
