             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/GODSJF)
             OVRDBF     FILE(GODSJFNY) TOFILE(&TILLIB/GODSJF)
             OVRDBF     FILE(GODSJFGM) TOFILE(&FRALIB/GODSJF)
             CALL       PGM(V5FKR27)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/GODSJF))

             ENDPGM
