             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(&FRALIB/SAEH) TOFILE(&TILLIB/SAEH) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000) CMPDTA(*NONE) EXEC(GOTO +
                          CMDLBL(SLUTT))
             OVRDBF     FILE(SAEH) TOFILE(&TILLIB/SAEH)
             CALL       PGM(V5FKR50)
 SLUTT:      IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SAEH))

             ENDPGM
