             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/UNIT)
             OVRDBF     FILE(UNITNY) TOFILE(&TILLIB/UNIT)
             OVRDBF     FILE(UNITGM) TOFILE(&FRALIB/UNIT)
             CALL       PGM(V5FKR73)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/UNIT))

             ENDPGM
