             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FRMDOC)
             OVRDBF     FILE(FRMDOCNY) TOFILE(&TILLIB/FRMDOC)
             OVRDBF     FILE(FRMDOCGM) TOFILE(&FRALIB/FRMDOC)
             CALL       PGM(V5FKR26)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FRMDOC))

             ENDPGM
