             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FAKT)
             OVRDBF     FILE(FAKTNY) TOFILE(&TILLIB/FAKT)
             OVRDBF     FILE(FAKTGM) TOFILE(&FRALIB/FAKT)
             CALL       PGM(V5FKR15)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FAKT))

             ENDPGM
