             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/CDBOAT)
             OVRDBF     FILE(CDBOATNY) TOFILE(&TILLIB/CDBOAT)
             OVRDBF     FILE(CDBOATGM) TOFILE(&FRALIB/CDBOAT)
             CALL       PGM(V5FKR07)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDBOAT))

             ENDPGM
