             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FREETUR)
             OVRDBF     FILE(FRTURNY) TOFILE(&TILLIB/FREETUR)
             OVRDBF     FILE(FRTURGM) TOFILE(&FRALIB/FREETUR)
             CALL       PGM(V5FKR23)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FREETUR))

             ENDPGM
