             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FAXMANP)
             OVRDBF     FILE(FAXMANNY) TOFILE(&TILLIB/FAXMANP)
             OVRDBF     FILE(FAXMANGM) TOFILE(&FRALIB/FAXMANP)
             CALL       PGM(V5FKR17)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FAXMANP))

             ENDPGM
