             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/ZEADF)
             OVRDBF     FILE(ZEADFNY) TOFILE(&TILLIB/ZEADF)
             OVRDBF     FILE(ZEADFGM) TOFILE(&FRALIB/ZEADF)
             CALL       PGM(V5FKR78)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ZEADF))

             ENDPGM
