             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/AVFRH)
             OVRDBF     FILE(AVFRHNY) TOFILE(&TILLIB/AVFRH)
             OVRDBF     FILE(AVFRHGM) TOFILE(&FRALIB/AVFRH)
             CALL       PGM(V5FKR02)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/AVFRH))

             ENDPGM
