             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TRAB)
             OVRDBF     FILE(TRABNY) TOFILE(&TILLIB/TRAB)
             OVRDBF     FILE(TRABGM) TOFILE(&FRALIB/TRAB)
             CALL       PGM(V5FKR65)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TRAB))

             ENDPGM
