             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/HEADFCMP)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEADFCMP)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEADFCMP)
             CALL       PGM(V5FKR82)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEADFCMP))

             ENDPGM
