             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/CDBLF)
             ALCOBJ     OBJ((&FRALIB/CDBLF *FILE *SHRUPD))
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))
             DLCOBJ     OBJ((&FRALIB/CDBLF *FILE *SHRUPD))
             OVRDBF     FILE(CDBLFNY) TOFILE(&TILLIB/CDBLF)
             OVRDBF     FILE(CDBLFGM) TOFILE(&FRALIB/CDBLF)
             CALL       PGM(V5FKR88)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDBLF))

 SLUTT:      ENDPGM
