             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/CDBLF2)
             ALCOBJ     OBJ((&FRALIB/CDBLF2 *FILE *SHRUPD))
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))
             DLCOBJ     OBJ((&FRALIB/CDBLF2 *FILE *SHRUPD))
             OVRDBF     FILE(CDBLF2NY) TOFILE(&TILLIB/CDBLF2)
             OVRDBF     FILE(CDBLF2GM) TOFILE(&FRALIB/CDBLF2)
             CALL       PGM(V5FKR89)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDBLF2))

 SLUTT:      ENDPGM
