             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FRISKK)
             OVRDBF     FILE(FRISKKNY) TOFILE(&TILLIB/FRISKK)
             OVRDBF     FILE(FRISKKGM) TOFILE(&FRALIB/FRISKK)
             CALL       PGM(V5FKR25)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FRISKK))

             ENDPGM
