             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TRAVH)
             OVRDBF     FILE(TRAVHNY) TOFILE(&TILLIB/TRAVH)
             OVRDBF     FILE(TRAVHGM) TOFILE(&FRALIB/TRAVH)
             CALL       PGM(V5FKR67)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TRAVH))

             ENDPGM
