             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/GSSORF)
             OVRDBF     FILE(GSSORFNY) TOFILE(&TILLIB/GSSORF)
             OVRDBF     FILE(GSSORFGM) TOFILE(&FRALIB/GSSORF)
             CALL       PGM(V5FKR28)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/GSSORF))

             ENDPGM
