             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TUSTS)
             OVRDBF     FILE(TUSTSNY) TOFILE(&TILLIB/TUSTS)
             OVRDBF     FILE(TUSTSGM) TOFILE(&FRALIB/TUSTS)
             CALL       PGM(V5FKR70)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TUSTS))

             ENDPGM
