             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FAXLOG)
             OVRDBF     FILE(FAXLOGNY) TOFILE(&TILLIB/FAXLOG)
             OVRDBF     FILE(FAXLOGGM) TOFILE(&FRALIB/FAXLOG)
             CALL       PGM(V5FKR16)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FAXLOG))

             ENDPGM
