             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/PALLD)
             OVRDBF     FILE(PALLDNY) TOFILE(&TILLIB/PALLD)
             OVRDBF     FILE(PALLDGM) TOFILE(&FRALIB/PALLD)
             CALL       PGM(V5FKR42)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/PALLD))

             ENDPGM
