             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/PRFI)
             OVRDBF     FILE(PRFINY) TOFILE(&TILLIB/PRFI)
             OVRDBF     FILE(PRFIGM) TOFILE(&FRALIB/PRFI)
             CALL       PGM(V5FKR44)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/PRFI))

             ENDPGM
