             PGM        PARM(&FRALIB &TILLIB &SAD)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SAD) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DTAARA) TYPE(*CHAR) LEN(1000)

/* KONVERTER DATAOMRÅDER */

             MOVOBJ     OBJ(&FRALIB/BACK) OBJTYPE(*DTAARA) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF2112) EXEC(DO)
             RTVDTAARA  DTAARA(&FRALIB/BACK *ALL) RTNVAR(&DTAARA)
             CHGDTAARA  DTAARA(&TILLIB/BACK *ALL) VALUE(&DTAARA)
             ENDDO

             MOVOBJ     OBJ(&FRALIB/FIRMDT) OBJTYPE(*DTAARA) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF2112) EXEC(DO)
             RTVDTAARA  DTAARA(&FRALIB/FIRMDT *ALL) RTNVAR(&DTAARA)
             CHGDTAARA  DTAARA(&TILLIB/FIRMDT *ALL) VALUE(&DTAARA)
             ENDDO

             MOVOBJ     OBJ(&FRALIB/TESTUSER) OBJTYPE(*DTAARA) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF2112) EXEC(DO)
             RTVDTAARA  DTAARA(&FRALIB/TESTUSER *ALL) RTNVAR(&DTAARA)
             CHGDTAARA  DTAARA(&TILLIB/TESTUSER *ALL) VALUE(&DTAARA)
             ENDDO

             MOVOBJ     OBJ(&FRALIB/TVIDTAIIN) OBJTYPE(*DTAARA) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF2112) EXEC(DO)
             RTVDTAARA  DTAARA(&FRALIB/TVIDTAIIN *ALL) RTNVAR(&DTAARA)
             CHGDTAARA  DTAARA(&TILLIB/TVIDTAIIN *ALL) VALUE(&DTAARA)
             ENDDO

/* KOPIER DATAKØER */

             MOVOBJ     OBJ(&FRALIB/SAD41PQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&FRALIB/SAD52PQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&FRALIB/SAD61PQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             IF         COND(&SAD = 'J') THEN(GOTO CMDLBL(SLUTT))

             MOVOBJ     OBJ(&FRALIB/FAXDTAQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&FRALIB/SYEX88Q) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&FRALIB/SYFA20PQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

             MOVOBJ     OBJ(&FRALIB/SYFI10XQ) OBJTYPE(*DTAQ) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)

/* KOPIER BACKUPFILER */

             RMVM       FILE(&TILLIB/BACKKSA) MBR(*ALL)
             CPYF       FROMFILE(&FRALIB/BACKKSA) +
                          TOFILE(&TILLIB/BACKKSA) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*ADD) FMTOPT(*MAP +
                          *DROP)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(&TILLIB/BACKKSB) MBR(*ALL)
             CPYF       FROMFILE(&FRALIB/BACKKSB) +
                          TOFILE(&TILLIB/BACKKSB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*ADD) FMTOPT(*MAP +
                          *DROP)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(&TILLIB/BACKUPA) MBR(*ALL)
             CPYF       FROMFILE(&FRALIB/BACKUPA) +
                          TOFILE(&TILLIB/BACKUPA) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*ADD) FMTOPT(*MAP +
                          *DROP)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(&TILLIB/BACKUPB) MBR(*ALL)
             CPYF       FROMFILE(&FRALIB/BACKUPB) +
                          TOFILE(&TILLIB/BACKUPB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*ADD) FMTOPT(*MAP +
                          *DROP)
             MONMSG     MSGID(CPF0000)

 SLUTT:      ENDPGM
