             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/CDERF)
             OVRDBF     FILE(CDERFNY) TOFILE(&TILLIB/CDERF)
             OVRDBF     FILE(CDERFGM) TOFILE(&FRALIB/CDERF)
             CALL       PGM(V5FKR08)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDERF))

             ENDPGM
