             PGM        (&FRALIB &TILLIB &FILNAM)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILNAM) TYPE(*CHAR) LEN(10)
             CLRPFM     FILE(&TILLIB/&FILNAM)
             CPYF       FROMFILE(&FRALIB/&FILNAM) +
                          TOFILE(&TILLIB/&FILNAM) MBROPT(*ADD) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             ENDPGM
