             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/ZADF)
             OVRDBF     FILE(ZADFNY) TOFILE(&TILLIB/ZADF)
             OVRDBF     FILE(ZADFGM) TOFILE(&FRALIB/ZADF)
             CALL       PGM(V5FKR74)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ZADF))

             ENDPGM
