             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SAMLA)
             OVRDBF     FILE(SAMLANY) TOFILE(&TILLIB/SAMLA)
             OVRDBF     FILE(SAMLAGM) TOFILE(&FRALIB/SAMLA)
             CALL       PGM(V5FKR52)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SAMLA))

             ENDPGM
