             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TILL)
             OVRDBF     FILE(TILLNY) TOFILE(&TILLIB/TILL)
             OVRDBF     FILE(TILLGM) TOFILE(&FRALIB/TILL)
             CALL       PGM(V5FKR63)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TILL))

             ENDPGM
