             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TFAVH)
             OVRDBF     FILE(TFAVHNY) TOFILE(&TILLIB/TFAVH)
             OVRDBF     FILE(TFAVHGM) TOFILE(&FRALIB/TFAVH)
             CALL       PGM(V5FKR62)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TFAVH))

             ENDPGM
