             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             OVRDBF     FILE(UTSKRSNY) TOFILE(&TILLIB/UTSKRS)
             OVRDBF     FILE(UTSKRSGM) TOFILE(&FRALIB/UTSKRS)
             CALL       PGM(V5FKR80)

             OVRDBF     FILE(KODTA) TOFILE(&TILLIB/KODTA)
             OVRDBF     FILE(KODTP) TOFILE(&TILLIB/KODTP)
             OVRDBF     FILE(UTSKRS) TOFILE(&TILLIB/UTSKRS)
             CALL       PGM(FIXPRTA)

             DLTOVR     FILE(*ALL)

             ENDPGM
