             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/DOKECE)
             OVRDBF     FILE(DOKECENY) TOFILE(&TILLIB/DOKECE)
             OVRDBF     FILE(DOKECEGM) TOFILE(&FRALIB/DOKECE)
             CALL       PGM(V5FKR12)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/DOKECE))

             ENDPGM
