             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SADHCMP)
             OVRDBF     FILE(SADHNY) TOFILE(&TILLIB/SADHCMP)
             OVRDBF     FILE(SADHGM) TOFILE(&FRALIB/SADHCMP)
             CALL       PGM(V5FKR83)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SADHCMP))

             ENDPGM
