             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(&FRALIB/SAEHCMP) +
                          TOFILE(&TILLIB/SAEHCMP) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000) CMPDTA(*NONE) EXEC(GOTO +
                          CMDLBL(SLUTT))
             OVRDBF     FILE(SAEHCMP) TOFILE(&TILLIB/SAEHCMP)
             CALL       PGM(V5FKR85)
 SLUTT:      IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SAEHCMP))

             ENDPGM
