             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(&FRALIB/STATREK) +
                          TOFILE(&TILLIB/STATREK) MBROPT(*REPLACE) +
                          INCCHAR(*NONE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000) CMPDTA(*NONE) EXEC(GOTO +
                          CMDLBL(SLUTT))
             OVRDBF     FILE(STATREK) TOFILE(&TILLIB/STATREK)
             CALL       PGM(V5FKR59)
 SLUTT:      IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/STATREK))

             ENDPGM
