             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FIRM)
             OVRDBF     FILE(FIRMNY) TOFILE(&TILLIB/FIRM)
             OVRDBF     FILE(FIRMGM) TOFILE(&FRALIB/FIRM)
             CALL       PGM(V5FKR20)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FIRM))

             ENDPGM
