             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SAEF)
             OVRDBF     FILE(SADFNY) TOFILE(&TILLIB/SAEF)
             OVRDBF     FILE(SADFGM) TOFILE(&FRALIB/SAEF)
             CALL       PGM(V5FKR46)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SAEF))

             ENDPGM
