             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FERR)
             OVRDBF     FILE(FERRNY) TOFILE(&TILLIB/FERR)
             OVRDBF     FILE(FERRGM) TOFILE(&FRALIB/FERR)
             CALL       PGM(V5FKR19)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FERR))

             ENDPGM
