             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/KOSTA)
             OVRDBF     FILE(KOSTANY) TOFILE(&TILLIB/KOSTA)
             OVRDBF     FILE(KOSTAGM) TOFILE(&FRALIB/KOSTA)
             CALL       PGM(V5FKR40)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/KOSTA))

             ENDPGM
