             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/STANDI)
             OVRDBF     FILE(STANDINY) TOFILE(&TILLIB/STANDI)
             OVRDBF     FILE(STANDIGM) TOFILE(&FRALIB/STANDI)
             CALL       PGM(V5FKR54)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/STANDI))

             ENDPGM
