             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/SADTRCMP)
             OVRDBF     FILE(SADTRHNY) TOFILE(&TILLIB/SADTRCMP)
             OVRDBF     FILE(SADTRHGM) TOFILE(&FRALIB/SADTRCMP)
             CALL       PGM(V5FKR84)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/SADTRCMP))

             ENDPGM
