             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/TRAA)
             OVRDBF     FILE(TRAANY) TOFILE(&TILLIB/TRAA)
             OVRDBF     FILE(TRAAGM) TOFILE(&FRALIB/TRAA)
             CALL       PGM(V5FKR64)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/TRAA))

             ENDPGM
