             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/BLLOK)
             OVRDBF     FILE(BLLOKNY) TOFILE(&TILLIB/BLLOK)
             OVRDBF     FILE(BLLOKGM) TOFILE(&FRALIB/BLLOK)
             CALL       PGM(V5FKR04)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BLLOK))

             ENDPGM
