             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/KOSBP)
             OVRDBF     FILE(KOSBPNY) TOFILE(&TILLIB/KOSBP)
             OVRDBF     FILE(KOSBPGM) TOFILE(&FRALIB/KOSBP)
             CALL       PGM(V5FKR38)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/KOSBP))

             ENDPGM
