             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/INFO)
             OVRDBF     FILE(INFONY) TOFILE(&TILLIB/INFO)
             OVRDBF     FILE(INFOGM) TOFILE(&FRALIB/INFO)
             CALL       PGM(V5FKR33)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/INFO))

             ENDPGM
