/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers Beskrivelse..........................               */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* P00XXX* 01 JOV VER5 VED TØMMING BLE MEMBER KALT USA, USB, USC...        */
/*                     RETTER TIL URA, URB, URC.. UTEN VIDERE MERKING      */
/*                     URB BLE FEILAKTIG BLANKET ETTER KONVERTERING        */
/* ********************************************************************    */
             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URA)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URA)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URA)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URA))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URB)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URB)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URB)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URB))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URC)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URC)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URC)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URC))

/* S01       CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URB)  */
/*N01*/      CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URD)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URD)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URD)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URD))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URE)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URE)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URE)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URE))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URF)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URF)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URF)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URF))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URG)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URG)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URG)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URG))

             CLRPFM     FILE(&TILLIB/HEDUMMY) MBR(URH)
             OVRDBF     FILE(HEADFNY) TOFILE(&TILLIB/HEDUMMY) MBR(URH)
             OVRDBF     FILE(HEADFGM) TOFILE(&FRALIB/HEDUMMY) MBR(URH)
             CALL       PGM(V5FKR30)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/HEDUMMY) MBR(URH))

             ENDPGM
