             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/FRATN)
             OVRDBF     FILE(FRATNNY) TOFILE(&TILLIB/FRATN)
             OVRDBF     FILE(FRATNGM) TOFILE(&FRALIB/FRATN)
             CALL       PGM(V5FKR22)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/FRATN))

             ENDPGM
