             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/STATOHF)
             OVRDBF     FILE(STATHFNY) TOFILE(&TILLIB/STATOHF)
             OVRDBF     FILE(STATHFGM) TOFILE(&FRALIB/STATOHF)
             CALL       PGM(V5FKR56)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/STATOHF))

             ENDPGM
