             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/ISOSAKF)
             OVRDBF     FILE(ISOSAFNY) TOFILE(&TILLIB/ISOSAKF)
             OVRDBF     FILE(ISOSAFGM) TOFILE(&FRALIB/ISOSAKF)
             CALL       PGM(V5FKR35)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ISOSAKF))

             ENDPGM
