             PGM        PARM(&FRALIB &TILLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CLRPFM     FILE(&TILLIB/ZAKT)
             ALCOBJ     OBJ((&FRALIB/ZAKT *FILE *SHRUPD))
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))
             DLCOBJ     OBJ((&FRALIB/ZAKT *FILE *SHRUPD))
             OVRDBF     FILE(ZAKTNY) TOFILE(&TILLIB/ZAKT)
             OVRDBF     FILE(ZAKTGM) TOFILE(&FRALIB/ZAKT)
             CALL       PGM(V5FKR87)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/ZAKT))

 SLUTT:      ENDPGM
