             PGM        PARM(&FRALIB &TILLIB &GMLLIB &TOMME)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&GMLLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1)

             CRTLIB     LIB(&GMLLIB) TEXT('Gamle filer (drift) som +
                          er byttet etter PTF5')

             CLRPFM     FILE(&TILLIB/AVSLUTF)
             CPYF       FROMFILE(&FRALIB/AVSLUTF) +
                          TOFILE(&TILLIB/AVSLUTF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/AVSLUTF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/AVSLUTF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/AIRLH)
             CPYF       FROMFILE(&FRALIB/AIRLH) +
                          TOFILE(&TILLIB/AIRLH) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/AIRLH)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/AIRLH) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CPYF       FROMFILE(&FRALIB/BACKKSB) +
                          TOFILE(&TILLIB/BACKKSB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/BACKKSB) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CPYF       FROMFILE(&FRALIB/BACKUPB) +
                          TOFILE(&TILLIB/BACKUPB) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/BACKUPB) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/BILLOF)
             CPYF       FROMFILE(&FRALIB/BILLOF) +
                          TOFILE(&TILLIB/BILLOF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BILLOF))
             MOVOBJ     OBJ(&FRALIB/BILLOF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/BLV1)
             CPYF       FROMFILE(&FRALIB/BLV1) TOFILE(&TILLIB/BLV1) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BLV1))
             MOVOBJ     OBJ(&FRALIB/BLV1) OBJTYPE(*FILE) TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/BLV2)
             CPYF       FROMFILE(&FRALIB/BLV2) TOFILE(&TILLIB/BLV2) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BLV2))
             MOVOBJ     OBJ(&FRALIB/BLV2) OBJTYPE(*FILE) TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/BOOKING)
             CPYF       FROMFILE(&FRALIB/BOOKING) +
                          TOFILE(&TILLIB/BOOKING) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/BOOKING))
             MOVOBJ     OBJ(&FRALIB/BOOKING) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/CDBLF)
             OVRDBF     FILE(CDBLFNY) TOFILE(&TILLIB/CDBLF)
             OVRDBF     FILE(CDBLFGM) TOFILE(&FRALIB/CDBLF)
             CALL       PGM(V5FKR88)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDBLF))
             MOVOBJ     OBJ(&FRALIB/CDBLF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/CDBLF2)
             OVRDBF     FILE(CDBLF2NY) TOFILE(&TILLIB/CDBLF2)
             OVRDBF     FILE(CDBLF2GM) TOFILE(&FRALIB/CDBLF2)
             CALL       PGM(V5FKR89)
             IF         COND(&TOMME = 'J') THEN(CLRPFM +
                          FILE(&FRALIB/CDBLF2))
             MOVOBJ     OBJ(&FRALIB/CDBLF2) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/CUNDC)
             CPYF       FROMFILE(&FRALIB/CUNDC) +
                          TOFILE(&TILLIB/CUNDC) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/CUNDC)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/CUNDC) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/CUNDF)
             CPYF       FROMFILE(&FRALIB/CUNDF) +
                          TOFILE(&TILLIB/CUNDF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/CUNDF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/CUNDF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/CUNDMAF)
             CPYF       FROMFILE(&FRALIB/CUNDMAF) +
                          TOFILE(&TILLIB/CUNDMAF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/CUNDMAF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/CUNDMAF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/CUOTI)
             CPYF       FROMFILE(&FRALIB/CUOTI) +
                          TOFILE(&TILLIB/CUOTI) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/CUOTI)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/CUOTI) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/DOKUDGS)
             CPYF       FROMFILE(&FRALIB/DOKUDGS) +
                          TOFILE(&TILLIB/DOKUDGS) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/DOKUDGS)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/DOKUDGS) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/DOKUFE)
             CPYF       FROMFILE(&FRALIB/DOKUFE) +
                          TOFILE(&TILLIB/DOKUFE) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/DOKUFE)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/DOKUFE) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/DOKUMENT)
             CPYF       FROMFILE(&FRALIB/DOKUMENT) +
                          TOFILE(&TILLIB/DOKUMENT) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/DOKUMENT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/DOKUMENT) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/FAXMANP)
             CPYF       FROMFILE(&FRALIB/FAXMANP) +
                          TOFILE(&TILLIB/FAXMANP) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/FAXMANP)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/FAXMANP) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/FAXSEN)
             CPYF       FROMFILE(&FRALIB/FAXSEN) +
                          TOFILE(&TILLIB/FAXSEN) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/FAXSEN)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/FAXSEN) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/FIRFB)
             CPYF       FROMFILE(&FRALIB/FIRFB) +
                          TOFILE(&TILLIB/FIRFB) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/FIRFB)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/FIRFB) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/KODTS8)
             CPYF       FROMFILE(&FRALIB/KODTS8) +
                          TOFILE(&TILLIB/KODTS8) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/KODTS8)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/KODTS8) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/KODTP)
             CPYF       FROMFILE(&FRALIB/KODTP) +
                          TOFILE(&TILLIB/KODTP) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/KODTP)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/KODTP) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/KODTVA)
             CPYF       FROMFILE(&FRALIB/KODTVA) +
                          TOFILE(&TILLIB/KODTVA) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/KODTVA)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/KODTVA) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             MOVOBJ     OBJ(&FRALIB/KOSBF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/KOSTB)
             CPYF       FROMFILE(&FRALIB/KOSTB) +
                          TOFILE(&TILLIB/KOSTB) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/KOSTB)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/KOSTB) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/KUOPDTY)
             CPYF       FROMFILE(&FRALIB/KUOPDTY) +
                          TOFILE(&TILLIB/KUOPDTY) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/KUOPDTY)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/KUOPDTY) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLADAUT)
             CPYF       FROMFILE(&FRALIB/LLADAUT) +
                          TOFILE(&TILLIB/LLADAUT) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLADAUT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLADAUT) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLAGJD)
             CPYF       FROMFILE(&FRALIB/LLAGJD) +
                          TOFILE(&TILLIB/LLAGJD) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLAGJD)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLAGJD) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLAGJF)
             CPYF       FROMFILE(&FRALIB/LLAGJF) +
                          TOFILE(&TILLIB/LLAGJF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLAGJF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLAGJF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLGRPK)
             CPYF       FROMFILE(&FRALIB/LLGRPK) +
                          TOFILE(&TILLIB/LLGRPK) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLGRPK)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLGRPK) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLHEAD)
             CPYF       FROMFILE(&FRALIB/LLHEAD) +
                          TOFILE(&TILLIB/LLHEAD) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLHEAD)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLHEAD) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLHETXT)
             CPYF       FROMFILE(&FRALIB/LLHETXT) +
                          TOFILE(&TILLIB/LLHETXT) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLHETXT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLHETXT) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLLINE)
             CPYF       FROMFILE(&FRALIB/LLLINE) +
                          TOFILE(&TILLIB/LLLINE) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLLINE)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLLINE) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLLSDF)
             CPYF       FROMFILE(&FRALIB/LLLSDF) +
                          TOFILE(&TILLIB/LLLSDF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLLSDF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLLSDF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLMRF)
             CPYF       FROMFILE(&FRALIB/LLMRF) +
                          TOFILE(&TILLIB/LLMRF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLMRF)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLMRF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLMRT)
             CPYF       FROMFILE(&FRALIB/LLMRT) +
                          TOFILE(&TILLIB/LLMRT) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLMRT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLMRT) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLTELL)
             CPYF       FROMFILE(&FRALIB/LLTELL) +
                          TOFILE(&TILLIB/LLTELL) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLTELL)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLTELL) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/LLVARE)
             CPYF       FROMFILE(&FRALIB/LLVARE) +
                          TOFILE(&TILLIB/LLVARE) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/LLVARE)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/LLVARE) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/PALFIR)
             CPYF       FROMFILE(&FRALIB/PALFIR) +
                          TOFILE(&TILLIB/PALFIR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/PALFIR)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/PALFIR) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/PALLD)
             CPYF       FROMFILE(&FRALIB/PALLD) +
                          TOFILE(&TILLIB/PALLD) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/PALLD)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/PALLD) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/PAPA)
             CPYF       FROMFILE(&FRALIB/PAPA) TOFILE(&TILLIB/PAPA) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/PAPA)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/PAPA) OBJTYPE(*FILE) TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CPYF       FROMFILE(&FRALIB/POSTB0) +
                          TOFILE(&TILLIB/POSTB0) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/POSTB0) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/SADS)
             CPYF       FROMFILE(&FRALIB/SADS) TOFILE(&TILLIB/SADS) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/SADS)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/SADS) OBJTYPE(*FILE) TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/SADSD)
             CPYF       FROMFILE(&FRALIB/SADSD) +
                          TOFILE(&TILLIB/SADSD) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/SADSD)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/SADSD) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/SADVJ)
             CPYF       FROMFILE(&FRALIB/SADVJ) +
                          TOFILE(&TILLIB/SADVJ) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/SADVJ)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/SADVJ) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/STATHF)
             CPYF       FROMFILE(&FRALIB/STATHF) +
                          TOFILE(&TILLIB/STATHF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/STATHF)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/STATHF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/STATLOGF)
             CPYF       FROMFILE(&FRALIB/STATLOGF) +
                          TOFILE(&TILLIB/STATLOGF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/STATLOGF)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/STATLOGF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/STATOHF)
             CPYF       FROMFILE(&FRALIB/STATOHF) +
                          TOFILE(&TILLIB/STATOHF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/STATOHF)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/STATOHF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/STATVF)
             CPYF       FROMFILE(&FRALIB/STATVF) +
                          TOFILE(&TILLIB/STATVF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/STATVF)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/STATVF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/TRACKT)
             CPYF       FROMFILE(&FRALIB/TRACKT) +
                          TOFILE(&TILLIB/TRACKT) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/TRACKT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/TRACKT) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/TRAN)
             CPYF       FROMFILE(&FRALIB/TRAN) TOFILE(&TILLIB/TRAN) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/TRAN)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/TRAN) OBJTYPE(*FILE) TOLIB(&GMLLIB)

             CLRPFM     FILE(&TILLIB/VARELI)
             CPYF       FROMFILE(&FRALIB/VARELI) +
                          TOFILE(&TILLIB/VARELI) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/VARELI)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/VARELI) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/VARESL)
             CPYF       FROMFILE(&FRALIB/VARESL) +
                          TOFILE(&TILLIB/VARESL) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/VARESL)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/VARESL) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/ZAKT)
             CPYF       FROMFILE(&FRALIB/ZAKT) TOFILE(&TILLIB/ZAKT) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/ZAKT)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/ZAKT) OBJTYPE(*FILE) TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/ZRISOK)
             CPYF       FROMFILE(&FRALIB/ZRISOK) +
                          TOFILE(&TILLIB/ZRISOK) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/ZRISOK)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/ZRISOK) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(&TILLIB/ZTELL)
             CPYF       FROMFILE(&FRALIB/ZTELL) +
                          TOFILE(&TILLIB/ZTELL) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/ZTELL)
             MONMSG     MSGID(CPF0000)
             ENDDO
             MOVOBJ     OBJ(&FRALIB/ZTELL) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)


             MOVOBJ     OBJ(&FRALIB/MAILF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/KOFAST) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/LLW013) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/LLW042) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/LLW043) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/STATWRKF) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MOVOBJ     OBJ(&FRALIB/SYKS30W) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/SYKS30X) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/SYTT03W) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MONMSG     MSGID(CPF0000)
             MOVOBJ     OBJ(&FRALIB/WFILEEXP) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MOVOBJ     OBJ(&FRALIB/WFILEIMP) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MOVOBJ     OBJ(&FRALIB/WFILETR) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MOVOBJ     OBJ(&FRALIB/WSAMGE) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)
             MOVOBJ     OBJ(&FRALIB/WSAMGE1) OBJTYPE(*FILE) +
                          TOLIB(&GMLLIB)

             ENDPGM
