             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CALL       PGM(V6FKC00A) PARM(&FILNV &FRALIB)

             CLRPFM     FILE(&FILNV)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(ZOKUFGM) TOFILE(&FRALIB/ZOKUF)
             OVRDBF     FILE(ZOKUFNY) TOFILE(ZOKUF) FRCRATIO(*NONE)
             CALL       PGM(V6FKR02)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V6FKC00B) PARM(&FILNV &FRALIB &TILLIB)

             ENDPGM
