             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TOMME)  TYPE(*CHAR) LEN(1)

             CALL       PGM(V6FKC00A) PARM(&FILNV &FRALIB)

             CPYF       FROMFILE(&FRALIB/&FILNV) TOFILE(&FILNV) +
                          MBROPT(*ADD) INCREL((*IF UTPNR *GE 950) +
                          (*AND UTPNR *LE 997)) FMTOPT(*MAP *DROP)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V6FKC06B) PARM(&FILNV &FRALIB &TILLIB)
             CALL       PGM(FIXPRTA)

             ENDPGM
