             PGM        PARM(&FILNV &LIB)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCLF       FILE(V6DSPDBR)

             DSPDBR     FILE(&LIB/&FILNV) OUTPUT(*OUTFILE) +
                          OUTFILE(V6SYSF/V6DSPDBR)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))

 START:      RCVF       RCDFMT(QWHDRDBR)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(SLUTT))

             IF         COND(&WHREFI *NE '          ') THEN(DO)
             IF         COND(&WHREFI *NE &FILNV) THEN(DLTF +
                          FILE(&WHRELI/&WHREFI))
             ENDDO
             GOTO       CMDLBL(START)

 SLUTT:      ENDPGM
