             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('SYEDIF')

             CALL       PGM(V7FKR93) PARM(&LIB)

             RNMOBJ     OBJ(&LIB/EDII) OBJTYPE(*FILE) NEWOBJ(EDII.G)
             DLTF       FILE(&LIB/EDII1)
             DLTF       FILE(&LIB/EDII2)
             DLTF       FILE(&LIB/EDII3)
             DLTF       FILE(&LIB/EDIIJ1)
             CRTPF      FILE(&LIB/EDII) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDII)
             CRTLF      FILE(&LIB/EDII1) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDII1)
             CRTLF      FILE(&LIB/EDII2) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDII2)
             CRTLF      FILE(&LIB/EDII3) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDII3)
             CRTLF      FILE(&LIB/EDIIJ1) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDIIJ1)
             CPYF       FROMFILE(&LIB/EDII.G) TOFILE(&LIB/EDII) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)

             CHKOBJ     OBJ(&LIB/EDISS) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801 CPF9810) EXEC(DO)
             CRTPF      FILE(&LIB/EDISS) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDISS)
             CRTLF      FILE(&LIB/EDISS1) SRCFILE(SYEDIS/QDDSSRC) +
                          SRCMBR(EDISS1)
             ENDDO

             CHKOBJ     OBJ(&LIB/EDI10C4) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801 CPF9810) EXEC(CRTPF +
                          FILE(&LIB/EDI10C4) +
                          SRCFILE(SYEDIS/QDDSSRC) SRCMBR(EDI10C4))

             CHKOBJ     OBJ(&LIB/EOFTPSE) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801 CPF9810) EXEC(CRTPF +
                          FILE(&LIB/EOFTPSE) +
                          SRCFILE(SYEDIS/QDDSSRC) SRCMBR(EOFTPSE))

             ENDPGM
