             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V6 skal tømmes etter konvertering. */

             CPYF       FROMFILE(&FRALIB/&FILNV) +
                          TOFILE(&TILLIB/&FILNV) MBROPT(*ADD) +
                          CRTFILE(*YES) FROMRCD(1) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)

             CPYF       FROMFILE(&FILNV) TOFILE(&FRALIB/&FILNV) +
                          MBROPT(*REPLACE) FROMRCD(1) FMTOPT(*MAP +
                          *DROP)
             MONMSG     MSGID(CPF0000)

             ENDPGM
