             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V6 skal tømmes etter konvertering. */

             CALL       PGM(V7FKC00A) PARM(&FILNV &FRALIB) /* Slett +
                          alle logiske filer i driftbibliotek. */

             CLRPFM     FILE(&FILNV)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FRALIB/&FILNV) TOFILE(&FILNV) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)
             CALL       PGM(V7FKR03)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V7FKC00B) PARM(&FILNV &FRALIB &TILLIB) +
                          /* Kopiere ny fil til driftbibliotek og +
                          bygge nye logiske filer i driftbibliotek. */

             ENDPGM
