             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V6 skal tømmes etter konvertering. */

             CALL       PGM(V7FKC00A) PARM(&FILNV &FRALIB) /* Slett +
                          alle logiske filer i driftbibliotek. */

             CPYF       FROMFILE(V7SYSF/UTSKRS.N) TOFILE(&FILNV) +
                          MBROPT(*REPLACE)
             CPYF       FROMFILE(&FRALIB/&FILNV) TOFILE(&FILNV) +
                          MBROPT(*ADD) INCREL((*IF UTPNR *GE 950) +
                          (*AND UTPNR *LE 997)) FMTOPT(*MAP *DROP)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV) /* Tømme data i fil i +
                          driftbibliotek. */
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V7FKC00B) PARM(&FILNV &FRALIB &TILLIB) +
                          /* Kopiere ny fil til driftbibliotek og +
                          bygge nye logiske filer i driftbibliotek. */
             OVRDBF     FILE(UTSKRS) TOFILE(&FRALIB/UTSKRS)
             CALL       PGM(FIXPRTA)

             ENDPGM
