             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLTF       FILE(&LIB/BILLOFLG)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/BILLOFLG) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(BILLOFLG) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL17)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL17) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(DISPL17) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL18)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL18) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(DISPL18) LVLCHK(*NO)
             DLTF       FILE(&LIB/DOKUF6)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF6) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(DOKUF6) LVLCHK(*NO)
             DLTF       FILE(&LIB/FAK6)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/FAK6) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(FAK6) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL12)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL12) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL12) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL23)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL23) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL23) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD18)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD18) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD18) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD33)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD33) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD33) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD35)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD35) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD35) LVLCHK(*NO)
             DLTF       FILE(&LIB/HETRIU1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HETRIU1) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HETRIU1) LVLCHK(*NO)
             DLTF       FILE(&LIB/KODTVAL2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/KODTVAL2) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(KODTVAL2) LVLCHK(*NO)
             DLTF       FILE(&LIB/PALLDL09)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/PALLDL09) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(PALLDL09) LVLCHK(*NO)
             DLTF       FILE(&LIB/TRAVV5)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRAVV5) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(TRAVV5) LVLCHK(*NO)

             ENDPGM
