             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V6 skal tømmes etter konvertering. */

             OVRDBF     FILE(KUFAST) TOFILE(&FRALIB/KUFAST)
             OVRDBF     FILE(KUFASTNY) TOFILE(V8SYSF/KUFAST)
             CALL       PGM(V8FKR15)

             ENDPGM
