             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLTF       FILE(&LIB/DOKUF7)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF7) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(DOKUF7) LVLCHK(*NO)
             DLTF       FILE(&LIB/FRISOL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/FRISOL01) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(FRISOL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/FRISOL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/FRISOL02) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(FRISOL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD20)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD20) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD20) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD33)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD33) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD33) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD37)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD37) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD37) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD38)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD38) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(HEAD38) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(&LIB/STSCLI2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/STSCLI2) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(STSCLI2) LVLCHK(*NO)
             DLTF       FILE(&LIB/STSCLI3)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/STSCLI3) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(STSCLI3) LVLCHK(*NO)
             DLTF       FILE(&LIB/STSTUR2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/STSTUR2) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(STSTUR2) LVLCHK(*NO) AUT(*ALL)

             ENDPGM
