             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V6 skal tømmes etter konvertering. */

             CALL       PGM(V8FKC00A) PARM(&FILNV &FRALIB) /* Slett +
                          alle logiske filer i driftbibliotek. */

             OVRDBF     FILE(&FILNV) FRCRATIO(*NONE) /* Kopiere data +
                          fra fil i driftbibliotek til fil i V8SYSF. */
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV) /* Tømme data i fil i +
                          driftbibliotek. */
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V8FKC00B) PARM(&FILNV &FRALIB &TILLIB) +
                          /* Kopiere ny fil til driftbibliotek og +
                          bygge nye logiske filer i driftbibliotek. */
             CPYF       FROMFILE(V8SYSF/CHARPF.N) +
                          TOFILE(V8SYSF/CHARPF) MBROPT(*REPLACE)

             ENDPGM
