             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V9 skal tømmes etter konvertering. */

             MOVOBJ     OBJ(&FRALIB/CHARPF) OBJTYPE(*FILE) +
                          TOLIB(&TILLIB) /* Flytt datafil fra V8 +
                          til bevareringsbibliotek. */
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(CHARPF) TOFILE(&FRALIB/CHARPF) +
                          FROMMBR(*ALL) TOMBR(*FROMMBR) +
                          MBROPT(*ADD) CRTFILE(*YES) /* Kopiere +
                          konvertert ny datafil fra V9SYSF til +
                          driftdatabibliotek. */
             MONMSG     MSGID(CPF0000)

             ENDPGM
