             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V6 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V9 skal tømmes etter konvertering. */

             MOVOBJ     OBJ(&FRALIB/&FILNV) OBJTYPE(*FILE) +
                          TOLIB(&TILLIB)
             MONMSG     MSGID(CPF0000)
             CPYF       FROMFILE(&FILNV) TOFILE(&FRALIB/&FILNV) +
                          FROMMBR(*ALL) TOMBR(*FROMMBR) +
                          MBROPT(*REPLACE) CRTFILE(*YES)

             ENDPGM
