             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLTF       FILE(&LIB/DISPL17)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL17) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL17) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL18)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL18) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL18) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL19)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL19) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL19) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL20)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL20) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL20) LVLCHK(*NO)
             DLTF       FILE(&LIB/DOKUF8)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF8) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DOKUF8) LVLCHK(*NO)
             DLTF       FILE(&LIB/DOKUF9)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF9) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DOKUF9) LVLCHK(*NO)
             DLTF       FILE(&LIB/TRACKL06)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRACKL06) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(TRACKL06) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSLGL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSLGL02) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSLGL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSLGL03)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSLGL03) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSLGL03) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSOLL05)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSOLL05) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSOLL05) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL13)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL13) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL13) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL14)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL14) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL14) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL16)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL16) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL16) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL27)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL27) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL27) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL28)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL28) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL28) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL29)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL29) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL29) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSRFL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSRFL01) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSRFL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD37B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD37B) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD37B) LVLCHK(*NO)
             CRTLF      FILE(&LIB/TRACKTL99) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(TRACKTL99) LVLCHK(*NO)
             CRTLF      FILE(&LIB/SAEH11) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(SAEH11) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD37C)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD37C) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD37C) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD40)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD40) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD40) LVLCHK(*NO)

             ENDPGM
