             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLTF       FILE(&LIB/AVFRHL06)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/AVFRHL06) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(AVFRHL06) LVLCHK(*NO)
             DLTF       FILE(&LIB/EDIIJ1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIIJ1) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EDIIJ1) LVLCHK(*NO)
             DLTF       FILE(&LIB/EDIMH)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIMH) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EDIMH) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSLGL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSLGL02) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSLGL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSLGL03)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSLGL03) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSLGL03) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSOLL05)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSOLL05) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSOLL05) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL13)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL13) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL13) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL14)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL14) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL14) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL16)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL16) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL16) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL27)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL27) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL27) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL28)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL28) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL28) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSORL29)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSORL29) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSORL29) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSRFL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSRFL01) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(GSSRFL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/LLAGJD07)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/LLAGJD07) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(LLAGJD07) LVLCHK(*NO)
             DLTF       FILE(&LIB/LLW043L1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/LLW043L1) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(LLW043L1) LVLCHK(*NO) AUT(*ALL)
             DLTF       FILE(&LIB/MULTKODT)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/MULTKODT) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(MULTKODT) LVLCHK(*NO)
             DLTF       FILE(&LIB/PONRN1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/PONRN1) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(PONRN1) LVLCHK(*NO)
             DLTF       FILE(&LIB/SADH11)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SADH11) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(SADH11) LVLCHK(*NO)
             DLTF       FILE(&LIB/SVTAR2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SVTAR2) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(SVTAR2) LVLCHK(*NO)
             DLTF       FILE(&LIB/SVTVK1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SVTVK1) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(SVTVK1) LVLCHK(*NO) AUT(*ALL)
             DLTF       FILE(&LIB/TRACKL05)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRACKL05) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(TRACKL05) LVLCHK(*NO)
             DLTF       FILE(&LIB/VEIAVGL2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/VEIAVGL2) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(VEIAVGL2) LVLCHK(*NO) AUT(*ALL)
             DLTF       FILE(&LIB/ZADVL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/ZADVL02) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(ZADVL02) LVLCHK(*NO) AUT(*ALL)

             DLTF       FILE(&LIB/GSSPCL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSPCL01) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(GSSPCL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL17)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL17) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL17) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL18)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL18) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL18) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL19)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL19) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL19) LVLCHK(*NO)
             DLTF       FILE(&LIB/DISPL20)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DISPL20) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DISPL20) LVLCHK(*NO)
             DLTF       FILE(&LIB/DOKUF8)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF8) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DOKUF8) LVLCHK(*NO)
             DLTF       FILE(&LIB/DOKUF9)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/DOKUF9) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(DOKUF9) LVLCHK(*NO)
             DLTF       FILE(&LIB/TRACKL06)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRACKL06) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(TRACKL06) LVLCHK(*NO)
             DLTF       FILE(&LIB/UNITL04)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/UNITL04) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(UNITL04) LVLCHK(*NO)
             DLTF       FILE(&LIB/VEIAVGL3)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/VEIAVGL3) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(VEIAVGL3) LVLCHK(*NO)
             DLTF       FILE(&LIB/ZRISOL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/ZRISOL02) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(ZRISOL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD37B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD37B) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD37B) LVLCHK(*NO)
             CRTPF      FILE(&LIB/ARKSRC) RCDLEN(92) FILETYPE(*SRC) +
                          MAXMBRS(*NOMAX)
             CRTLF      FILE(&LIB/TRACKTL99) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(TRACKTL99) LVLCHK(*NO)
             CRTLF      FILE(&LIB/SAEH11) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(SAEH11) LVLCHK(*NO)
             CRTLF      FILE(&LIB/ARKLOGH2) +
                          SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(ARKLOGH2) LVLCHK(*NO)
             CRTPF      FILE(&LIB/ARKSRC) RCDLEN(92) FILETYPE(*SRC) +
                          MAXMBRS(*NOMAX)
             DLTF       FILE(&LIB/EJO04A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJO04A) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(EJO04A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ204A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ204A) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(EJ204A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ304A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ304A) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(EJ304A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ404A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ404A) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(EJ404A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ504A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ504A) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(EJ504A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ393A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ393A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ393A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ394B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ394B) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ394B) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ395A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ395A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ395A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ395B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ395B) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ395B) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ401B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ401B) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ401B) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ404A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ404A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ404A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ496A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ496A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ496A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ496B)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ496B) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ496B) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ497A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ497A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ497A) LVLCHK(*NO)
             DLTF       FILE(&LIB/EJ498A)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EJ498A) SRCFILE(SYSPEDS/QDDSSRC) +
                          SRCMBR(EJ498A) LVLCHK(*NO)
             DLTF       FILE(&LIB/GSSSFL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/GSSSFL01) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(GSSSFL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD17)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD17) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD17) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD37C)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD37C) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD37C) LVLCHK(*NO)
             DLTF       FILE(&LIB/HEAD40)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HEAD40) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HEAD40) LVLCHK(*NO)
             DLTF       FILE(&LIB/HODEL1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/HODEL1) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(HODEL1) LVLCHK(*NO)
             DLTF       FILE(&LIB/KOSAL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/KOSAL01) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(KOSAL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/KOSAL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/KOSAL02) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(KOSAL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/KOSBL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/KOSBL01) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(KOSBL01) LVLCHK(*NO)
             DLTF       FILE(&LIB/KOSBL02)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/KOSBL02) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(KOSBL02) LVLCHK(*NO)
             DLTF       FILE(&LIB/LLSERL05)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/LLSERL05) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(LLSERL05) LVLCHK(*NO)
             DLTF       FILE(&LIB/PRJOIN)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/PRJOIN) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(PRJOIN) LVLCHK(*NO)
             DLTF       FILE(&LIB/STSOPD3)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/STSOPD3) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(STSOPD3) LVLCHK(*NO)
             DLTF       FILE(&LIB/SVTHA1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SVTHA1) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(SVTHA1) LVLCHK(*NO)
             DLTF       FILE(&LIB/SVTKD2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SVTKD2) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(SVTKD2) LVLCHK(*NO)
             DLTF       FILE(&LIB/TRAVV7)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRAVV7) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(TRAVV7) LVLCHK(*NO)
             DLTF       FILE(&LIB/WADREL01)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/WADREL01) SRCFILE(SYENDPTF/QDDSSRC) +
                          SRCMBR(WADREL01) LVLCHK(*NO)

             ENDPGM
