             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V8 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V9 skal tømmes etter konvertering. */

             OVRDBF     FILE(KOFAST) TOFILE(&FRALIB/KOFAST)
             OVRDBF     FILE(KOFASTNY) TOFILE(V9SYSF/KOFAST)
             CALL       PGM(V9FKR09)

             ENDPGM
