             PGM
             DCL        VAR(&FI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&KU) TYPE(*CHAR) LEN(8)
             DCL          VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') +
                          /* Hvis &in01 av, betyr det programkalle +
                          fra SPEDISJONN */
                                                          /**/
             DCLF       FILE(FIRM) RCDFMT(FIRMR)
             RCVF       RCDFMT(*FILE)
             IF         COND((&FIURLI *NE 'J') *AND +
                             (&FIURLE *NE 'J') *AND +
                             (&FIURFI *NE 'J') *AND +
                             (&FIURFE *NE 'J') *AND +
                             (&FIURFL *NE 'J') *AND +
                             (&FIURBI *NE 'J') *AND +
                             (&FIURBE *NE 'J')) +
                        THEN(CHGVAR VAR(&IN01) VALUE('1'))
                                                          /**/
             CALL       PGM(VKUND) PARM(&IN01 &FI &KU)
                                                          /**/
             ENDPGM
