/*FEIL HVIS REULTATET ER 0 */
             PGM        PARM(&DAYS &DATE5)
/*___________________*/
/* Declare Variables */
/*"""""""""""""""""""*/
             DCL        VAR(&DATFMT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DAYS) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&DATE1) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE2) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&DATE3) TYPE(*DEC) LEN(5 0)
             DCL        VAR(&DATE4) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATE5) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE6) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DATE7) TYPE(*DEC) LEN(3 0)

             MONMSG CPF0000
/*___________________________________*/
/* Retreive Jobdate in Julian Format */
/*"""""""""""""""""""""""""""""""""""*/
             RTVJOBA    DATFMT(&DATFMT)
             CHGJOB     DATFMT(*JUL)
             RTVJOBA    DATE(&DATE1)
             CHGJOB     DATFMT(&DATFMT)
/*_________________________*/
/* Add XXX Days to Jobdate */
/*""""""""""""""""""""""""""*/
             CHGVAR     VAR(&DATE2) VALUE(&DATE1)
             CHGVAR     VAR(&DATE2) VALUE(&DATE2 - &DAYS)
             CHGVAR     VAR(&DATE3) VALUE(&DATE2)
             CHGVAR     VAR(&DATE4) VALUE(&DATE3)
             CHGVAR     VAR(&DATE6) VALUE(%SST(&DATE4 3 3))
             CHGVAR     VAR(&DATE7) VALUE(&DATE6)
             IF         COND(&DATE7 *GT 365) THEN(CHGVAR VAR(&DATE3) +
                          VALUE(&DATE3 - 634))
             IF         COND(&DATE7 *EQ 0) THEN(CHGVAR VAR(&DATE3) +
                          VALUE(&DATE3 + 1))
             CHGVAR     VAR(&DATE4) VALUE(&DATE3)
/*_____________________________________*/
/* Convert new date from Julian to YMD */
/*"""""""""""""""""""""""""""""""""""""*/
             CVTDAT     DATE(&DATE4) TOVAR(&DATE5) FROMFMT(*JUL) +
                          TOFMT(*YMD) TOSEP(*NONE)

             ENDPGM
