     A          R ALTINNFR
     A*  2018-03-06T03:01:27.527-ET DOKUMENT
     A*  2018-03-06T03:01:27.527-DAGSOPPGJØR
     A*
     A            ALDATO        22          COLHDG('DATO')
     A            ALFILP        64          COLHDG('FIL PDF')
     A            ALFILX        64          COLHDG('FIL XML')
     A            ALPDF          1          COLHDG('MOTATT PDF')
     A            ALXML          1          COLHDG('MOTATT XML')
     A            ALLOP          7S 0       COLHDG('LØPENR')
     A          K ALDATO
