     A*%%TS  SD  20190226  103327  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
     A*
     A          R SUBFIL                    SFL
     A*%%TS  SD  20190226  103327  SVEIN       REL-V7R1M0  5770-WDS
     A            MRGDOK       129A  O  6  2DSPATR(UL)
     A*
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20190226  103153  SVEIN       REL-V7R1M0  5770-WDS
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                  1 17MSGCON(050 SHU0906 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2100SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'ARC013B'
     A                                      COLOR(BLU)
     A                                  2 17MSGCON(030 SHU2013 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            MRGNAV        40A  O  2 49COLOR(YLW)
     A                                  5  2'Dokumentnavn'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      CF03(03 'EXIT')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(22)
     A                                      CLRL(06)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(RED)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
