     A*%%TS  SD  20200630  062415  SVEIN       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R WINDOW
     A*%%TS  SD  20200630  062415  SVEIN       REL-V7R3M0  5770-WDS
     A                                      OVERLAY
     A                                      CF12(12 'Avslutt')
     A                                      CF03(12 'Avslutt')
     A                                      CF10(10 'UPLOAD')
     A                                      CF04(04 'Søk type')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'ARCA000RD'
     A                                      COLOR(BLU)
     A                                  1 13'Upload direkte til ordre/tolldek'
     A                                      COLOR(WHT)
     A                                  3  2'Type'
     A            TYPE           2A  B  3  9
     A  70                                  DSPATR(RI)
     A            ARTXT         15A  O  3 12COLOR(WHT)
     A                                  3 37'F4=Søk '
     A                                      COLOR(BLU)
     A                                  4  2'Avdeling:'
     A            WSAVD          4S 0B  4 13
     A  71                                  DSPATR(RI)
     A                                  5  2'Ordrenr.:'
     A            WSOPD          7S 0B  5 13
     A                                  6  2'Ext ref.:'
     A            WSEXTR        35A  B  6 13
     A  72                                  DSPATR(RI)
     A  30        MSGTXT        45A  O 13  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                 12  2'F12=Avbryt upload   F10=Upload hen-
     A                                      t dokument'
     A                                      COLOR(BLU)
