     A          R ARCA023FR
     A            FJOBN         10
     A            FPATH        256
     A            FNAME        120
     A            FTIME         10
     A          K FJOBN
     A          K FTIME
