     A*%%TS  SD  20180105  112328  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
     A*
     A          R BILDE01
     A*%%TS  SD  20180105  112328  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF10(10 'BRENN')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/ARCHST01'
     A                                      COLOR(BLU)
     A                                  1 18MSGCON(050 SHU1745 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  9  3MSGCON(024 SHU1747 *LIBL/SYMSGF)
     A            WSTILA         4Y 0B  9 29EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(025 SHU1746 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
