     A          R ARKEXTR
     A            ARCFIR         2          COLHDG('FIRMA')
     A            ARCEXT         2          COLHDG('EXTERNMASKIN')
     A            ARCPAD        30          COLHDG('IPADRESSE LOKAL')
     A            ARCANE        30          COLHDG('BANE')
     A            ARCPAE        30          COLHDG('IPADRESSE EKSTERN')
     A            ARBHISF       30          COLHDG('BANE HISTORIKK')
     A            ARCPSI         1          COLHDG('HTTPS:// INT  J/ ')
     A            ARCPSE         1          COLHDG('HTTPS:// EXT  J/ ')
     A          K ARCFIR
     A          K ARCEXT
