     A          R ARKIVR                    PFILE(ARKIVP)
     A          K ARSTAT
     A          K ARAVD
     A          K AROPD
     A          K ARDATE
     A          K ARTIME
     A          K ARLINK
