     A          R ARKIVR                    PFILE(ARKIVP)
     A          K ARSTAT
     A          K ARUNDE
     A          K ARDATE
     A          K ARTIME
