     A          R ARKIVR                    PFILE(ARKIVP)
     A          K ARTYPE
     A          K ARDATE
     A          K ARLINK
     A          S ARBHIS                    COMP(EQ '                         ')
