     A          R ARKLOGMR
     A            EMUNIK         9S 0       COLHDG('UNIK')
     A            EMLINK       160          COLHDG('LENKE INTERN')
     A            EMLINE       160          COLHDG('LENKE EKSTERN')
     A            EMBANE       140          COLHDG('DOK.BANE')
     A          K EMUNIK
