N01   * LENGDE SAMSVARE MED ARKSRC
     A          R ARKLOGDR
     A            EPUNIK         9S 0       COLHDG('UNIK')
S01  A*           EPDATA        80          COLHDG('TEXT')
N01  A            EPDATA       160          COLHDG('TEXT')
     A          K EPUNIK
