     A          R ARKTXTR
     A            ARTYPE         2          COLHDG('DOKTYPE')
     A            ARTXT         15          COLHDG('TEXT')
     A            ARKJN          1          COLHDG('ARKIVERES JN')
     A            ARKSND         1          COLHDG('SENDES JN')
     A            ARKLAG         2          COLHDG('LAGRINGSSTED')
     A            ARKDAG         5S 0       COLHDG('DAGER LAGRES')
     A            ARKVED        60          COLHDG('VEDLEGG')
     A            ARSLAB         1          COLHDG('LABEL, IKKE SK.ARK ')
     A            ARSBAN        50          COLHDG('SCAN-BANE')
     A            ARMRG          1          COLHDG('MERGE')
     A            ARVEDL        40          COLHDG('VEDLEGG')
N01  A            ARSFSK         1          COLHDG('SCAN-FJERN SKILLEARK')
N01  A            ARSCTS         1          COLHDG('SCAN-APPEND TIMESTMP')
N01  A            ARSRLE         2S 0       COLHDG('SCAN-SPESREG.LENGDE')
N01  A            ARSRST         2S 0       COLHDG('SCAN-SPESREG.STRPOS')
N01  A            ARSRPA         5          COLHDG('SCAN-SPESREG.PATTERN')
N01  A            ARSRNO         1          COLHDG('SCAN-SPESREG.NUM.ONL')
N02  A            ARSAIN        50          COLHDG('SCAN-AVVIK. IMNMAPPE')
N02  A            ARAVTY         2          COLHDG('SCAN-AVVIK. TYPE')
     A          K ARTYPE
