     A          R AUTOKUNDER
     A*
     A            KUNDNR         8S 0       COLHDG('KUNDE')
     A            FYL            2S 0       COLHDG('FYLKE')
     A            TAN            2S 0       COLHDG('TARIFFNR')
     A            VER            2S 0       COLHDG('VERDI')
     A            BRV            2S 0       COLHDG('BRUTTO VEKT')
     A            NEV            2S 0       COLHDG('NETTO VEKT')
     A            ANT            2S 0       COLHDG('ANTALL')
     A            ART            2S 0       COLHDG('ARTNR')
     A            BES            2S 0       COLHDG('BESKRIVELSE')
     A            STR           25          COLHDG('STARTLINJE')
     A            DEC            1          COLHDG('DECIMALTEGN')
     A          K KUNDNR
