     A          R AUTOKUNDR
     A*
     A            KUNDNR         8S 0       COLHDG('KUNDE')
     A            LKN            2S 0       COLHDG('LK')
     A            TAN            2S 0       COLHDG('TARIFFNR')
     A            VER            2S 0       COLHDG('VERDI')
     A            BRV            2S 0       COLHDG('BRUTTO VEKT')
     A            NEV            2S 0       COLHDG('NETTO VEKT')
     A            ANT            2S 0       COLHDG('ANTALL')
     A            ART            2S 0       COLHDG('ARTNR')
     A            BES            2S 0       COLHDG('BESKRIVELSE')
     A            UND            2S 0       COLHDG('UNDERSTELLSNR')
     A            STR           25          COLHDG('START LINJE')
     A            DEC            1          COLHDG('DECIMALTEGN')
     A          K KUNDNR
