     A          R AUTOINIR
     A*
     A            KNR            8S 0       COLHDG('KUNDE')
     A            NAV           40          COLHDG('NAVN')
     A            NAVK           2S 0       COLHDG('NAVN KOLONNE')
     A            INT           30          COLHDG('INVOICE')
     A            INTK           2S 0       COLHDG('INV TX KOLONNE')
     A            INVK           2S 0       COLHDG('INV VERDI KOLONNE')
     A            DAT           30          COLHDG('DATO TXT')
     A            DATK           2S 0       COLHDG('DATO TEXT KOLONNE')
     A            DAVK           2S 0       COLHDG('DATO KOLONNE')
     A            DASK           1          COLHDG('DATO SKILLETEGN')
     A            DAFM           3          COLHDG('YMD')
     A            VAL           30          COLHDG('VALUTA')
     A            VALK           2S 0       COLHDG('VAL TX KOLONNE')
     A            VAVK           2S 0       COLHDG('VAL VERDI KOLONNE')
     A            BEL           30          COLHDG('BELOP')
     A            BELK           2S 0       COLHDG('BEL TX KOLONNE')
     A            BEVK           2S 0       COLHDG('BEL VERDI KOLONNE')
     A          K NAV
