********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 NYE FELTER FOR KOLLI OG KODE
********************************************************************
     A*__________________________
     A* SYSPED / BOOKINGS VARELINJEREGISTER SIDE 2
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BLVSD2R
     A            BVAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BVOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BVLI           3S 0       COLHDG('LINJENR')
     A            BVMN      R               REFFLD(FT17)
     A                                      COLHDG('MERKE & NUMMER')
     A            BVFT2         40          COLHDG('FRITEKST')
     A            BVVKT     R               REFFLD(VKT9)
     A                                      COLHDG('Vekt')
     A            BVM3           9S 3       COLHDG('KUBIKK')
N01  A            BVNT           5S 0       COLHDG('ANTALL')
N01  A            BVENH          1S 0       COLHDG('ENHET')
N01  A            BVKDC          2A         COLHDG('CONTAINER KODE')
     A          K BVAVD
     A          K BVOPD
     A          K BVLI
