     A*____________________________
     A* SYSPED / FRAKTTABELL CONTAINER
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R CFRATR
     A            FTKNR          8S 0       TEXT('KUNDENR.')
     A            FTFRAN         3          TEXT('FRANKATUR')
     A            FTOPDT         2          TEXT('OPPDRAGSTYPE')
     A            FTSK           1          TEXT('SELGER/KJØPER')
     A            FTFRA          5          TEXT('DESTINASJON FRA')
     A            FTTIL          5          TEXT('DESTINASJON TIL')
     A            FTTYPE         2          TEXT('CONTAINER TYPE')
     A            FTPRIS         9S 2       TEXT('PRIS PR. ENHET')
     A            FTVAL          3          TEXT('VALUTAKODE')
     A            FTTRA          4          TEXT('TRAFIKK')
     A            FTDF           8S 0       TEXT('FRA DATO')
     A            FTDT           8S 0       TEXT('TIL DATO')
     A            FTHST          1          TEXT('HISTORIKK(H)')
     A          K FTHST
     A          K FTKNR
     A          K FTTRA
     A          K FTFRAN
     A          K FTOPDT
     A          K FTSK
     A          K FTFRA
     A          K FTTIL
     A          K FTTYPE
     A          K FTDF
