     A*____________________________
     A* SYSPED / FRAKTTABELL
     A*""""""""""""""""""""""""""""
     A          R CFRATR                    PFILE(CFRAT)
     A          K FTHST
     A          K FTKNR
     A          K FTFRA
     A          K FTTRA
     A          K FTTIL
     A          K FTOPDT
     A          K FTFRAN
     A          K FTTYPE
