     A          R DKEFR
     A            DKEF_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            DKEF_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKEF_FATY      4          COLHDG('Fakturatyp')
     A            DKEF_FATX     35          COLHDG('Fakturanummer')
     A            DKEF_VAKD      3          COLHDG('Valutaslag, kod')
     A            DKEF_VAKU      7S 4       COLHDG('Valutaslag, kurs')
     A            DKEF_FABL     11S 3       COLHDG('Fakturabelopp')
     A            DKEF_MRN      18          COLHDG('MRN Referencenr')
     A          K DKEF_SYAV
     A          K DKEF_SYOP
     A          K DKEF_FATX
