     A          R DKEKR
     A            DKEK_KNR       8S 0       COLHDG('Kundens kundenr')
     A            DKEK_VNR      28          COLHDG('Kundens varenr')
     A            DKEK_311      16          COLHDG('Kollimærke')
     A            DKEK_314       2          COLHDG('Kolliart')
     A            DKEK_315      45          COLHDG('Varebeskrivelse')
     A            DKEK_331       8          COLHDG('Varekode')
     A            DKEK_332       4          COLHDG('YM Tillægskode')
     A            DKEK_SIKK      2          COLHDG('Sikkerhedsstillesle')
     A            DKEK_34A       2          COLHDG('Oprindelsesland')
     A            DKEK_37        7          COLHDG('Procedure')
     A            DKEK_401A      1          COLHDG('For.dok.kat')
     A            DKEK_402A      3          COLHDG('For.dok.type')
     A            DKEK_403A     20          COLHDG('For.dok.nr')
     A            DKEK_411       3          COLHDG('Suppl.enhed')
     A            DKEK_441      13          COLHDG('Bevillingsnr')
     A            DKEK_4421      4          COLHDG('Certifikatkode')
     A            DKEK_442A     35          COLHDG('Certifikatnr')
     A            DKEK_443       1          COLHDG('VAB bestemmelse')
     A            DKEK_444       4          COLHDG('FN Farlig gods UNDG')
     A            DKEK_446A     70          COLHDG('Suppl.vareopl.txt')
     A            DKEK_447       5          COLHDG('Delsendinger')
     A            DKEK_449A     20          COLHDG('Oplysningstype kode')
     A            DKEK_49       17          COLHDG('ID af oplag')
     A            DKEK_BEM1     70          COLHDG('Bemærkninger')
      *-----------------------------Key------------------------------
     A          K DKEK_KNR
     A          K DKEK_VNR
