     A*___________________________________________
     A* SYSPED / Tolldekl. TULL-ID
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A          K TITUID
