     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A          K TIAVD
     A          K TIST
