     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K TIWS
     A          K TIST
