     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TRANSITTERINGSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A          K TITRNR
