     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SIGNATUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A                                      TEXT('SIGNATUR')
     A          K TIAVD
     A          K TISG
     A          K TIDT
