     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, KJØPER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A          K THAVD
     A          K THKNK
     A          K THDT
