     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner TRANSIT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R DKXVR                     PFILE(DKXV)
     A          K TVAVD2
     A          K TVTDN2
