     A*_______________________________
     A* SYSPED / Kolli-IDer, LOGG PÅ ALLE SKYTINGER SENDT TIL SERVER
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUFLR
     A            FNCLID        18          COLHDG('KOLLI-ID uten 00')
     A            FNTERM         5          COLHDG('Term-Kode')
     A            FNSTAT         1          COLHDG('Status')
     A            FNDATE         8S 0       COLHDG('Dato')
     A            FNTIME         6S 0       COLHDG('Klokka')
     A            FNUSER        10          COLHDG('Bruker')
     A            FNDATL         8S 0       COLHDG('Dato Loggført')
     A            FNTIML         6S 0       COLHDG('Klokka Loggført')
     A            FNTEXT        35          COLHDG('Merknad')
     A            FNAVKO         5          COLHDG('Avvikskode')
     A          K FNCLID
     A          K FNDATE
     A          K FNTIME
