     A                                      REF(EFR99B)
     A          R CCDR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      *
     A            C4505     R               REFFLD(Ø4505)
     A            C4507     R               REFFLD(Ø4507)
     A            C4509     R               REFFLD(Ø4509)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
