     A                                      REF(ESR)
     A          R EDIIAMR
     A            INID          35          COLHDG('Interchange ID')
     A            IN0065         6          COLHDG('Msg ID, IFTMIN,..')
     A            INTCRD        64          COLHDG('FTP Remote dir')
     A            INTCRDT       64          COLHDG('FTP Remote dir, temp')
     A            INTCRF        32          COLHDG('FTP Remote file')
     A          K INID
     A          K IN0065
