     A                                      REF(SR)
     A          R EDIMTVINFR
     A            MAVD      R               REFFLD(AVD)
     A            MTDN      R               REFFLD(TDN)
     A            F0077     R               REFFLD(N0077)
     A            F4815     R               REFFLD(N4815)
     A            F0078A    R               REFFLD(N0078)
     A          K MAVD
     A          K MTDN
