********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SENDINGSNR/MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
12259 * 02 YBC PTF12 NYTT FELT FOR UUID
********************************************************************
     A                                      REF(ESR)
     A          R EDIMR
     A            M0004     R               REFFLD(N0004)
     A            M0010     R               REFFLD(N0010)
     A            M0035     R               REFFLD(N0035)
     A            M0062     R               REFFLD(N0062)
     A            M0065     R               REFFLD(N0065)
     A            M0068     R               REFFLD(N0068)
     A            M1001     R               REFFLD(N1001)
     A            M1004     R               REFFLD(N1004)
     A            M1225     R               REFFLD(N1225)
     A            MSN       R               REFFLD(SN)
S01  A*           MMN       R               REFFLD(N0036)
N01  A            MMN       R               REFFLD(MN)
     A                                      COLHDG('Message_no.')
     A            MSR       R               REFFLD(SR)
     A            MST       R               REFFLD(ST)
     A            MDT       R               REFFLD(DT)
     A                                      COLHDG('Status_date')
     A            MTM       R               REFFLD(TM)
     A                                      COLHDG('Status_time')
     A            MVEN      R               REFFLD(ST)
     A                                      COLHDG('Delay_code')
      *_____________________________________
      * ONLY FOR SYSPED400 TVINN-APPLIKATION
      *"""""""""""""""""""""""""""""""""""""
     A            M0068A    R               REFFLD(N0068A)
     A            M0068B    R               REFFLD(N0068B)
     A            M0068C    R               REFFLD(N0068C)
     A            M0068D    R               REFFLD(N0068A)
     A            M0068E    R               REFFLD(N0068B)
     A            M0068F    R               REFFLD(N0068C)
     A            M2005B    R               REFFLD(DT)
     A                                      COLHDG('Ønsket' 'Behandlin+
     A                                            gsdato')
     A            M3039D    R               REFFLD(N3039D)
     A            M3039E    R               REFFLD(N3039E)
     A            M5004D    R               REFFLD(BEL10S)
     A                                      COLHDG('Depositum' 'Beløp')
     A            M1N07     R               REFFLD(N1N07)
     A            M1N08     R               REFFLD(N1N08)
     A            M9N01     R               REFFLD(N9N01)
     A            MAVD      R               REFFLD(AVD)
     A            MTDN      R               REFFLD(TDN)
     A            MFFBNR    R               REFFLD(FRBN)
N02  A            MUUID         40          COLHDG('UUID')
     A          K MMN
