     A          R EDISR                     PFILE(EDIS)
N01  A            SIFS         256A         COLHDG('IFS Filnavn')
     A            S0026         14A
     A            SIFS64             I      SST(SIFS 1 64)
     A          K SIFS64
