     A          R EDISR                     PFILE(EDIS)
     A          K SDT
     A          K STM
     A          O SMBR                      COMP(EQ 'REMOVED')
