     A                                      REF(EFR99B)
     A          R EQNR
      * Key
     A            EMN       R               REFFLD(ØMN)
     A            EGN       R               REFFLD(ØGN)
     A            EREP0     R               REFFLD(ØREP0)
     A            EREP1     R               REFFLD(ØREP1)
     A            EREP2     R               REFFLD(ØREP2)
     A            EREP3     R               REFFLD(ØREP3)
     A            EREP4     R               REFFLD(ØREP4)
     A            EREP5     R               REFFLD(ØREP5)
     A            EREP6     R               REFFLD(ØREP6)
     A            EREP7     R               REFFLD(ØREP7)
     A            EREP8     R               REFFLD(ØREP8)
      * C523 Number of unit details
     A            E6350     R               REFFLD(Ø6350)
     A            E6353     R               REFFLD(Ø6353)
      * Key
     A          K EMN
     A          K EGN
     A          K EREP0
     A          K EREP1
     A          K EREP2
     A          K EREP3
     A          K EREP4
     A          K EREP5
     A          K EREP6
     A          K EREP7
     A          K EREP8
