     A          R DGSR                      PFILE(EDGS99B)
     A          K DMN
     A          R DIIR                      PFILE(EDII99B)
     A          K DMN
     A          R DIMR                      PFILE(EDIM99B)
     A          K DMN
     A          R DLIR                      PFILE(EDLI99B)
     A          K DMN
     A          R DLMR                      PFILE(EDLM99B)
     A          K DMN
     A          R DMSR                      PFILE(EDMS99B)
     A          K DMN
     A          R DOCR                      PFILE(EDOC99B)
     A          K DMN
     A          R DSIR                      PFILE(EDSI99B)
     A          K DMN
     A          R DTMR                      PFILE(EDTM99B)
     A          K DMN
     A          R EFIR                      PFILE(EEFI99B)
     A          K EMN
     A          R ELMR                      PFILE(EELM99B)
     A          K EMN
     A          R ELUR                      PFILE(EELU99B)
     A          K EMN
     A          R EMPR                      PFILE(EEMP99B)
     A          K EMN
     A          R EQAR                      PFILE(EEQA99B)
     A          K EMN
     A          R EQDR                      PFILE(EEQD99B)
     A          K EMN
     A          R EQNR                      PFILE(EEQN99B)
     A          K EMN
     A          R ERCR                      PFILE(EERC99B)
     A          K EMN
     A          R ERPR                      PFILE(EERP99B)
     A          K EMN
     A          R FCAR                      PFILE(EFCA99B)
     A          K FMN
     A          R FIIR                      PFILE(EFII99B)
     A          K FMN
     A          R FNSR                      PFILE(EFNS99B)
     A          K FMN
     A          R FNTR                      PFILE(EFNT99B)
     A          K FMN
     A          R FTXR                      PFILE(EFTX99B)
     A          K FMN
     A          R GDSR                      PFILE(EGDS99B)
     A          K GMN
     A          R GIDR                      PFILE(EGID99B)
     A          K GMN
     A          R GINR                      PFILE(EGIN99B)
     A          K GMN
     A          R GIRR                      PFILE(EGIR99B)
     A          K GMN
     A          R GISR                      PFILE(EGIS99B)
     A          K GMN
     A          R GORR                      PFILE(EGOR99B)
     A          K GMN
     A          R GRUR                      PFILE(EGRU99B)
     A          K GMN
     A          R HANR                      PFILE(EHAN99B)
     A          K HMN
     A          R ICDR                      PFILE(EICD99B)
     A          K IMN
