     A          R HANR                      PFILE(EHAN03A)
     A          K HMN
     A          R HYNR                      PFILE(EHYN03A)
     A          K HMN
     A          R ICDR                      PFILE(EICD03A)
     A          K IMN
     A          R IDER                      PFILE(EIDE03A)
     A          K IMN
     A          R IHCR                      PFILE(EIHC03A)
     A          K IMN
     A          R IMDR                      PFILE(EIMD03A)
     A          K IMN
     A          R INDR                      PFILE(EIND03A)
     A          K IMN
     A          R INPR                      PFILE(EINP03A)
     A          K IMN
     A          R INVR                      PFILE(EINV03A)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ03A)
     A          K IMN
     A          R LANR                      PFILE(ELAN03A)
     A          K LMN
     A          R LINR                      PFILE(ELIN03A)
     A          K LMN
     A          R LOCR                      PFILE(ELOC03A)
     A          K LMN
     A          R MEAR                      PFILE(EMEA03A)
     A          K MMN
     A          R MEMR                      PFILE(EMEM03A)
     A          K MMN
     A          R MKSR                      PFILE(EMKS03A)
     A          K MMN
     A          R MOAR                      PFILE(EMOA03A)
     A          K MMN
     A          R MSGR                      PFILE(EMSG03A)
     A          K MMN
     A          R MTDR                      PFILE(EMTD03A)
     A          K MMN
     A          R NADR                      PFILE(ENAD03A)
     A          K NMN
     A          R NATR                      PFILE(ENAT03A)
     A          K NMN
     A          R PACR                      PFILE(EPAC03A)
     A          K PMN
     A          R PAIR                      PFILE(EPAI03A)
     A          K PMN
     A          R PATR                      PFILE(EPAT03A)
     A          K PMN
     A          R PCDR                      PFILE(EPCD03A)
     A          K PMN
     A          R PCIR                      PFILE(EPCI03A)
     A          K PMN
     A          R PDIR                      PFILE(EPDI03A)
     A          K PMN
     A          R PGIR                      PFILE(EPGI03A)
     A          K PMN
     A          R PIAR                      PFILE(EPIA03A)
     A          K PMN
     A          R PITR                      PFILE(EPIT03A)
     A          K PMN
     A          R PNAR                      PFILE(EPNA03A)
     A          K PMN
     A          R PRCR                      PFILE(EPRC03A)
     A          K PMN
