     A          R IDER                      PFILE(EIDE99B)
     A          K IMN
     A          R IHCR                      PFILE(EIHC99B)
     A          K IMN
     A          R IMDR                      PFILE(EIMD99B)
     A          K IMN
     A          R INDR                      PFILE(EIND99B)
     A          K IMN
     A          R INPR                      PFILE(EINP99B)
     A          K IMN
     A          R INVR                      PFILE(EINV99B)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ99B)
     A          K IMN
     A          R LANR                      PFILE(ELAN99B)
     A          K LMN
     A          R LINR                      PFILE(ELIN99B)
     A          K LMN
     A          R LOCR                      PFILE(ELOC99B)
     A          K LMN
     A          R MEAR                      PFILE(EMEA99B)
     A          K MMN
     A          R MEMR                      PFILE(EMEM99B)
     A          K MMN
     A          R MKSR                      PFILE(EMKS99B)
     A          K MMN
     A          R MOAR                      PFILE(EMOA99B)
     A          K MMN
     A          R MSGR                      PFILE(EMSG99B)
     A          K MMN
     A          R NADR                      PFILE(ENAD99B)
     A          K NMN
     A          R NATR                      PFILE(ENAT99B)
     A          K NMN
     A          R PACR                      PFILE(EPAC99B)
     A          K PMN
     A          R PAIR                      PFILE(EPAI99B)
     A          K PMN
     A          R PATR                      PFILE(EPAT99B)
     A          K PMN
     A          R PCDR                      PFILE(EPCD99B)
     A          K PMN
     A          R PCIR                      PFILE(EPCI99B)
     A          K PMN
     A          R PDIR                      PFILE(EPDI99B)
     A          K PMN
     A          R PGIR                      PFILE(EPGI99B)
     A          K PMN
     A          R PIAR                      PFILE(EPIA99B)
     A          K PMN
     A          R PITR                      PFILE(EPIT99B)
     A          K PMN
     A          R PNAR                      PFILE(EPNA99B)
     A          K PMN
     A          R PRCR                      PFILE(EPRC99B)
     A          K PMN
     A          R PRIR                      PFILE(EPRI99B)
     A          K PMN
     A          R PSDR                      PFILE(EPSD99B)
     A          K PMN
     A          R PTYR                      PFILE(EPTY99B)
     A          K PMN
     A          R QTYR                      PFILE(EQTY99B)
     A          K QMN
