     A          R QVRR                      PFILE(EQVR99B)
     A          K QMN
     A          R RCSR                      PFILE(ERCS99B)
     A          K RMN
     A          R RELR                      PFILE(EREL99B)
     A          K RMN
     A          R RFFR                      PFILE(ERFF99B)
     A          K RMN
     A          R RNGR                      PFILE(ERNG99B)
     A          K RMN
     A          R RTER                      PFILE(ERTE99B)
     A          K RMN
     A          R SALR                      PFILE(ESAL99B)
     A          K SMN
     A          R SCCR                      PFILE(ESCC99B)
     A          K SMN
     A          R SCDR                      PFILE(ESCD99B)
     A          K SMN
     A          R SEGR                      PFILE(ESEG99B)
     A          K SMN
     A          R SELR                      PFILE(ESEL99B)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ99B)
     A          K SMN
     A          R SFIR                      PFILE(ESFI99B)
     A          K SMN
     A          R SGPR                      PFILE(ESGP99B)
     A          K SMN
     A          R SGUR                      PFILE(ESGU99B)
     A          K SMN
     A          R SPSR                      PFILE(ESPS99B)
     A          K SMN
     A          R STAR                      PFILE(ESTA99B)
     A          K SMN
     A          R STCR                      PFILE(ESTC99B)
     A          K SMN
     A          R STGR                      PFILE(ESTG99B)
     A          K SMN
     A          R STSR                      PFILE(ESTS99B)
     A          K SMN
     A          R TAXR                      PFILE(ETAX99B)
     A          K TMN
     A          R TCCR                      PFILE(ETCC99B)
     A          K TMN
     A          R TDTR                      PFILE(ETDT99B)
     A          K TMN
     A          R TEMR                      PFILE(ETEM99B)
     A          K TMN
     A          R TMDR                      PFILE(ETMD99B)
     A          K TMN
     A          R TMPR                      PFILE(ETMP99B)
     A          K TMN
     A          R TODR                      PFILE(ETOD99B)
     A          K TMN
     A          R TPLR                      PFILE(ETPL99B)
     A          K TMN
     A          R TSRR                      PFILE(ETSR99B)
     A          K TMN
     A          R VLIR                      PFILE(EVLI99B)
     A          K VMN
