     A          R TRUR                      PFILE(ETRU03A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR03A)
     A          K TMN
     A          R VLIR                      PFILE(EVLI03A)
     A          K VMN
     A          R GEIR                      PFILE(EGEI03A)
     A          K GMN
     A          R MTDR                      PFILE(EMTD03A)
     A          K MMN
     A          R PYTR                      PFILE(EPYT03A)
     A          K PMN
     A          R RJLR                      PFILE(ERJL03A)
     A          K RMN
