     A          R ADRR                      PFILE(EADR99B)
     A          K AMN
     A          R AGRR                      PFILE(EAGR99B)
     A          K AMN
     A          R AJTR                      PFILE(EAJT99B)
     A          K AMN
     A          R ALCR                      PFILE(EALC99B)
     A          K AMN
     A          R ALIR                      PFILE(EALI99B)
     A          K AMN
     A          R APRR                      PFILE(EAPR99B)
     A          K AMN
     A          R ARDR                      PFILE(EARD99B)
     A          K AMN
     A          R ARRR                      PFILE(EARR99B)
     A          K AMN
     A          R ASIR                      PFILE(EASI99B)
     A          K AMN
     A          R ATTR                      PFILE(EATT99B)
     A          K AMN
     A          R AUTR                      PFILE(EAUT99B)
     A          K AMN
     A          R BIIR                      PFILE(EBII99B)
     A          K BMN
     A          R BUSR                      PFILE(EBUS99B)
     A          K BMN
     A          R CAVR                      PFILE(ECAV99B)
     A          K CMN
     A          R CCDR                      PFILE(ECCD99B)
     A          K CMN
     A          R CCIR                      PFILE(ECCI99B)
     A          K CMN
     A          R CDIR                      PFILE(ECDI99B)
     A          K CMN
     A          R CDSR                      PFILE(ECDS99B)
     A          K CMN
     A          R CDVR                      PFILE(ECDV99B)
     A          K CMN
     A          R CEDR                      PFILE(ECED99B)
     A          K CMN
     A          R CMPR                      PFILE(ECMP99B)
     A          K CMN
     A          R CNIR                      PFILE(ECNI99B)
     A          K CMN
     A          R CNTR                      PFILE(ECNT99B)
     A          K CMN
     A          R CODR                      PFILE(ECOD99B)
     A          K CMN
     A          R COMR                      PFILE(ECOM99B)
     A          K CMN
     A          R COTR                      PFILE(ECOT99B)
     A          K CMN
     A          R CPIR                      PFILE(ECPI99B)
     A          K CMN
     A          R CPSR                      PFILE(ECPS99B)
     A          K CMN
     A          R CSTR                      PFILE(ECST99B)
     A          K CMN
     A          R CTAR                      PFILE(ECTA99B)
     A          K CMN
     A          R CUXR                      PFILE(ECUX99B)
     A          K CMN
     A          R DAMR                      PFILE(EDAM99B)
     A          K DMN
