     A          R ENHETFTR
     A            S0004         35          COLHDG('PARKSKODE')
     A            ENHETF0        7          COLHDG('ENHETSKODE FRA')
     A            ENHETT0        7          COLHDG('ENHETSKODE TIL')
     A          K S0004
     A          K ENHETF0
     A          K ENHETT0
