     A          R EPOALR
     A            EAKUND         8S 0       COLHDG('KUNDE')
     A            EAARTL        35A         COLHDG('LEV.ART.NR')
     A            EABES1        30A         COLHDG('BESKRIVELSE 1')
     A            EABES2        30A         COLHDG('BESKRIVELSE 2')
      *
     A          K EAKUND
     A          K EAARTL
