     A          R EPOLSOR
     A            SOKUND         8S 0       COLHDG('KUNDE')
     A            SOINV         36A         COLHDG('BUTIKKNR')
     A            SOBES         10A         COLHDG('BESTILLINGSNR')
     A            SOLIN          7S 0       COLHDG('LINJENR')
     A            SOULIN         5S 0       COLHDG('U-LINJENR')
     A            SOSTAT         1A         COLHDG('STATUS')
     A            SOSKUT         1A         COLHDG('SKAN UT J/N')
     A          K SOKUND
     A          K SOINV
     A          K SOBES
     A          K SOLIN
