     A                                      REF(EFR99B)
     A          R TMDR
      * Key
     A            TMN       R               REFFLD(ØMN)
     A            TGN       R               REFFLD(ØGN)
     A            TREP0     R               REFFLD(ØREP0)
     A            TREP1     R               REFFLD(ØREP1)
     A            TREP2     R               REFFLD(ØREP2)
     A            TREP3     R               REFFLD(ØREP3)
     A            TREP4     R               REFFLD(ØREP4)
     A            TREP5     R               REFFLD(ØREP5)
     A            TREP6     R               REFFLD(ØREP6)
     A            TREP7     R               REFFLD(ØREP7)
     A            TREP8     R               REFFLD(ØREP8)
      * C219 Movement type
     A            T8335     R               REFFLD(Ø8335)
     A            T8334     R               REFFLD(Ø8334)
      *
     A            T8332     R               REFFLD(Ø8332)
      *
     A            T8341     R               REFFLD(Ø8341)
      * Key
     A          K TMN
     A          K TGN
     A          K TREP0
     A          K TREP1
     A          K TREP2
     A          K TREP3
     A          K TREP4
     A          K TREP5
     A          K TREP6
     A          K TREP7
     A          K TREP8
