     A                                      REF(EFR99B)
     A          R VLIR
      * Key
     A            VMN       R               REFFLD(ØMN)
     A            VGN       R               REFFLD(ØGN)
     A            VREP0     R               REFFLD(ØREP0)
     A            VREP1     R               REFFLD(ØREP1)
     A            VREP2     R               REFFLD(ØREP2)
     A            VREP3     R               REFFLD(ØREP3)
     A            VREP4     R               REFFLD(ØREP4)
     A            VREP5     R               REFFLD(ØREP5)
     A            VREP6     R               REFFLD(ØREP6)
     A            VREP7     R               REFFLD(ØREP7)
     A            VREP8     R               REFFLD(ØREP8)
      * C780  VALUE LIST IDENTIFICATION
     A            V1518     R               REFFLD(Ø1518)
     A            V7405     R               REFFLD(Ø7405)
      * C082  PARTY IDENTIFICATION DETAILS
     A            V3039     R               REFFLD(Ø3039)
     A            V1131A    R               REFFLD(Ø1131)
     A            V3055A    R               REFFLD(Ø3055)
      *
     A            V4405     R               REFFLD(Ø4405)
     A            V1514     R               REFFLD(Ø1514)
     A            V1507     R               REFFLD(Ø1507)
     A            V1505     R               REFFLD(Ø1505)
      * C240  PRODUCT CHARACTERISTIC
     A            V7037     R               REFFLD(Ø7037)
     A            V1131B    R               REFFLD(Ø1131)
     A            V3055B    R               REFFLD(Ø3055)
     A            V7036A    R               REFFLD(Ø7036)
     A            V7036B    R               REFFLD(Ø7036)
      *
     A            V4513     R               REFFLD(Ø4513)
      * Key
     A          K VMN
     A          K VGN
     A          K VREP0
     A          K VREP1
     A          K VREP2
     A          K VREP3
     A          K VREP4
     A          K VREP5
     A          K VREP6
     A          K VREP7
     A          K VREP8
