     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A                                      TEXT('Avd+Opd+Kundenr.')
     A          K FAAVD
     A          K FAOPD
     A          K FAKUNR
NXX  A          K FAFAKT
     A          S FAOPKO                    VALUES('O')
