      *____________________________
      * SYSPED / readymade invoices
      *""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FERDR
     A            FEWS          10
     A                                      COLHDG('USERID')
     A            FEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            FEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdrnr.')
     A            FESKX          1          COLHDG('Kode S/K/X')
     A            FEKN      R               REFFLD(KN)
     A                                      COLHDG('Kundenr.')
     A            FESFAK         1          COLHDG('Samlefakt.kode')
     A            OVBETB         2          COLHDG('Betalinsbetingelse')
     A            EPOJN          1          COLHDG('EPOST J/N')
     A            PRINTO         1          COLHDG('PRINT OGSÅ')
     A            FVENT          1          COLHDG('Ventekode')
     A            WSFDAT         6S 0       COLHDG('Fakturadato')
     A          K FEWS
