     A          R FIRML1R
     A            L1FIRM         2          COLHDG('FIRMA')
     A            L1KJOR         1          COLHDG('KJØRER L1')
     A            L1STDN        10          COLHDG('NAVN STD')
     A            L1DATN        10          COLHDG('NAVN DAT')
     A            L1FOAN         1          COLHDG('1./2. GANGS REG')
     A          K L1FIRM
