     A          R FIRMVISR
     A*
     A*  1. BASEPATH TEGN 50
     A*  2. APPTYPE TEGN 30
     A*  3. COMPANY ID  TEGN 10
     A*  4. ACCESSTOKEN TEGN 50
     A*  5. CLIENT_ID  TEGN 100
     A*  6. CLIENT_SECRET TEGN 100
     A*  7  AUTHORIZATION_CODE TEGN 100
     A            VIFIRM         2          COLHDG('FIRMA I SYSPED')
     A            VIBAPA        50          COLHDG('BASEPATH')
     A            VIAPTY        30          COLHDG('APPTYPE')
     A            VICOID        10          COLHDG('COMPANY ID')
     A            VIACTO        50          COLHDG('ACCESSTOKEN')
     A            VICLID       100          COLHDG('CLIENT_ID')
     A            VICLSE       100          COLHDG('CLIENT_SECRET')
     A            VIAUCO       100          COLHDG('AUTHORIZATION_CODE')
     A            VIREUR       100          COLHDG('REDIRECT URI')
VIS  A            VINCDA         8S 0       COLHDG('SYNC. DATO')
VIS  A            VINCTM         6S 0       COLHDG('SYNC. TID')
VIS  A            VIRELF         1S 0       COLHDG('RELEASE FAKTURA')
VIS  A            VIRELK         1S 0       COLHDG('RELEASE KOSTNAD')
VIS  A            VIRELH         1S 0       COLHDG('RELEASE HOVEDBOK')
      *
      *
      *
     A          K VIFIRM
