     A          R FIRARCSIR
     A            ASITY          2          COLHDG('TY:RO=ROOT,IN=INN')
     A            ASIANE        30          COLHDG('BANE')
     A            ASITXT        30          COLHDG('TEKST')
     A          K ASITY
     A          K ASIANE
