     A          R FIRMINTR
     A            INFIRM         2          COLHDG('FIRMA')
     A            INKONM         5S 0       COLHDG('INT.KONTO MED MVA')
     A            INKONU         5S 0       COLHDG('INT.KONTO UTEN MVA')
     A          K INFIRM
