*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12053 * 01 YBC PTF12 FLERE BELØP-FELTER ER ENDRET FOR Å TA STØRRE VERDI
*****A**************************************************************
     A          R PHEAD
     A                                  2  2'OVERSIKT UNDEROPPDRAG VED FOR'
     A                                    +0'ENKLET PROSEDYRE'
     A                                  3  2'ref:'
     A            FPAVDH         4  0   3  7
     A                                  3 11'/'
     A            FPOPDH         7  0   3 12
     A                                  3 21'Tollkvitter.:'
     A            FPTLE          6  0   3 35
     A                                  3 41'/'
     A            FPTLL         10  0   3 42
     A                                  3 54'Dato:'
     A            FPTDT          8  0   3 60
     A                                  4  2'Totalbeløp:'
     A            TOBEL7        11  0   4 14EDTCDE(Z)
     A                                  4 29'Leveringsbet..:'
     A            FRANK          3      4 44
     A                                  5  1' -----------------------'
     A                                  5 25'------------------------'
     A                                  5 49'------------------------'
     A                                  5 73'------------------------'
     A                                  5 97'------------------------'
      *
     A                                  6  2'Referanse'
     A                                  6 31'Toll og MVA'
     A                                  6 45'Lev'
     A                                  6 49'Mottaker'
     A                                  7  1' -----------------------'
     A                                  7 25'------------------------'
     A                                  7 49'------------------------'
     A                                  7 73'------------------------'
     A                                  7 97'------------------------'
     A          R PDET                      SPACEB(1)
     A            FPKURE        17         2
     A            FPAVD          4  0     20
     A                                    24'/'
     A            FPOPD          7  0     25
S01  A*           SIBEL6         9  0     33EDTCDE(Z)
N01  A            SIBEL6_9       9  0     33EDTCDE(Z)
     A            SILV2          3        45
     A            SINAK         30        49
     A          R PDETT                     SPACEB(1)
     A            FPKURE        17         2
     A                                    18'** TOLL **'
     A            TOLL          11  0     31EDTCDE(Z)
     A          R PTOTD                     SPACEB(2)
     A                                    14'Totalsum:'
     A            FRANK          3        24
     A            DETSUM        11  0     31EDTCDE(Z)
     A          R PTOT                      SPACEB(2)
     A                                    14'Totalsum: ALLE'
     A            TOTSUM        11  0     31EDTCDE(Z)
