     A*____________________________
     A* SYSPED / FRAKTTABELL
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FRATR
     A            FTKNR          8S 0       TEXT('KUNDENR.')
     A            FTFRAN         3          TEXT('FRANKATUR')
     A            FTOPDT         2          TEXT('OPPDRAGSTYPE')
     A            FTSK           1          TEXT('SELGER/KJØPER')
     A            FTFRA          5          TEXT('DESTINASJON FRA')
     A            FTTIL          5          TEXT('DESTINASJON TIL')
     A            FTAVTN         1S 0       TEXT('AVTALENR')
     A            FB01           5P 0       TEXT('PRIS VEKTGR. 01')
     A            FB02           5P 0       TEXT('PRIS VEKTGR. 02')
     A            FB03           5P 0       TEXT('PRIS VEKTGR. 03')
     A            FB04           5P 0       TEXT('PRIS VEKTGR. 04')
     A            FB05           5P 0       TEXT('PRIS VEKTGR. 05')
     A            FB06           5P 0       TEXT('PRIS VEKTGR. 06')
     A            FB07           5P 0       TEXT('PRIS VEKTGR. 07')
     A            FB08           5P 0       TEXT('PRIS VEKTGR. 08')
     A            FB09           5P 0       TEXT('PRIS VEKTGR. 09')
     A            FB10           5P 0       TEXT('PRIS VEKTGR. 10')
     A            FB11           5P 0       TEXT('PRIS VEKTGR. 11')
     A            FB12           5P 0       TEXT('PRIS VEKTGR. 12')
     A            FTKODE         1          TEXT('KODE')
     A            FTMIN          5S 0       TEXT('MINIMUM PRIS')
     A            FTMAX1         5S 0       TEXT('MAXIMUM PRIS-1')
     A            FTKOLL         1          TEXT('KOLLI')
     A            FTPRPR         5P 0       TEXT('PR. ANTALL KG')
     A            FM01           5P 0       TEXT('MIN/MAX VEKTGR. 01')
     A            FM02           5P 0       TEXT('MIN/MAX VEKTGR. 02')
     A            FM03           5P 0       TEXT('MIN/MAX VEKTGR. 03')
     A            FM04           5P 0       TEXT('MIN/MAX VEKTGR. 04')
     A            FM05           5P 0       TEXT('MIN/MAX VEKTGR. 05')
     A            FM06           5P 0       TEXT('MIN/MAX VEKTGR. 06')
     A            FM07           5P 0       TEXT('MIN/MAX VEKTGR. 07')
     A            FM08           5P 0       TEXT('MIN/MAX VEKTGR. 08')
     A            FM09           5P 0       TEXT('MIN/MAX VEKTGR. 09')
     A            FM10           5P 0       TEXT('MIN/MAX VEKTGR. 10')
     A            FM11           5P 0       TEXT('MIN/MAX VEKTGR. 11')
     A            FM12           5P 0       TEXT('MIN/MAX VEKTGR. 12')
     A            FTMAX2         5P 0       TEXT('MAXIMUM PRIS-2')
     A            FTMAX3         5P 0       TEXT('MAXIMUM PRIS-3')
     A            FTFAST         2S 0       TEXT('FASTPRIS T.O.M VEKTGRUPPE')
     A            FTDT           8S 0       TEXT('UTDAT')
     A            FTMM           1S 0       TEXT('MINIMUM/MAKSIMUN')
     A            FTVAL          3          TEXT('VALUTA KODE')
     A            FTLMOM         5S 0       TEXT('OMREGNING LASTEMETER')
     A            FTM3OM         5S 0       TEXT('OMREGNING KUBIKKMETER')
     A            FRVK1          5P 0       TEXT('VEKTGRUPPE - 1')
     A            FRVK2          5P 0       TEXT('VEKTGRUPPE - 2')
     A            FRVK3          5P 0       TEXT('VEKTGRUPPE - 3')
     A            FRVK4          5P 0       TEXT('VEKTGRUPPE - 4')
     A            FRVK5          5P 0       TEXT('VEKTGRUPPE - 5')
     A            FRVK6          5P 0       TEXT('VEKTGRUPPE - 6')
     A            FRVK7          5P 0       TEXT('VEKTGRUPPE - 7')
     A            FRVK8          5P 0       TEXT('VEKTGRUPPE - 8')
     A            FRVK9          5P 0       TEXT('VEKTGRUPPE - 9')
     A            FRVK10         5P 0       TEXT('VEKTGRUPPE - 10')
     A            FRVK11         5P 0       TEXT('VEKTGRUPPE - 11')
     A            FTDF           8S 0       TEXT('FRA DATO')
     A            FTHST          1          TEXT('HISTORIKK(H)')
     A          K FTHST
     A          K FTKNR
     A          K FTFRAN
     A          K FTOPDT
     A          K FTSK
     A          K FTFRA
     A          K FTTIL
     A          K FTAVTN
