     A*__________________________
     A* SYSPED / Godsjournal - GNR/T.PAP.NR GJELDER POS XXX ,YYY ,ZZZ
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R GODSJTR                   TEXT('Godsjournal')
     A            GTGN      R               REFFLD(GN)
     A                                      COLHDG('Godsnummer')
     A            GTTRNR        20          COLHDG('Transitt. nr')
     A            GTPOS1         7          COLHDG('POSISJON')
     A            GTPOS2         4S 0       COLHDG('SUB.POS.')
     A          K GTGN
     A          K GTTRNR
     A          K GTPOS1
