     A*__________________________
     A* SYSPED / Godsjournal
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R GODSJR                    TEXT('Godsjournal')
     A            GOGN      R               REFFLD(GN)
     A                                      COLHDG('Godsnummer')
     A            GOMOTT        15          COLHDG('Godsmottaker')
     A            GOBILN        13          COLHDG('Bilnummer')
     A            GOAVG         15          COLHDG('Avg. tollsted')
     A            GOTRNR        20          COLHDG('Transitt. nr')
N01  A            GOTRTY         5          COLHDG('T-Papirtype')
     A            GOTRDT    R               REFFLD(DT)
     A                                      COLHDG('TRANSITT.DATE')
      * VED FORHÅNDSREGISTRERING
     A            GOREI1        20          TEXT('Reiserute 1')
     A            GOREI2        20          TEXT('Reiserute 2')
     A            GOREI3        20          TEXT('Reiserute 3')
     A            GOREI4        20          TEXT('Reiserute 4')
     A            GOGREN        20          TEXT('Grensepass-sted')
     A            GOGRDT         8S 0       TEXT('Grensepass  DATO')
     A            GOGRKL         4S 0       TEXT('Grensepass klokkeslett')
     A            GOLSEN        20          TEXT('Første Lossested')
     A            GOLSDT         8S 0       TEXT('Første L.S. DATO')
     A            GOLSKL         4S 0       TEXT('Første L.S.klokkeslett')
     A            GOTYPE        20          TEXT('Type gods')
     A            GOTURN        17          TEXT('TURNUMMER')
N01  A            GOORTN        20          COLHDG('Orig.T-nr v/forpassi')
N01  A            GOORTY         5          COLHDG('Orig.T-Papirtype')
