      * BRINGTMS-PROSJEKT
     A          R HLBFILTR
     A            ORTNO         11S 0       COLHDG('TUR')
     A            ORONO          7S 0       COLHDG('ORDRE')
     A            FIHT           3S 0       COLHDG('HØYDE 01')
     A            FILT           3S 0       COLHDG('LENGDE 01')
     A            FIBT           3S 0       COLHDG('BREDDE 01')
     A            FIAT           3S 0       COLHDG('ANTALL 01')
     A            FIVT           7S 2       COLHDG('VEKT 01')
     A          K ORTNO
     A          K ORONO
