********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10035 * 01 YBC PTF10 FLERE NYE FELTER
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12XXX * 02 YBC PTF12 FLERE NYE FELTER
********************************************************************
     A          R ISFWRK
     A            ISFAVD         4S 0       COLHDG('Avdeling')
     A            ISFOPD         7S 0       COLHDG('Oppdrag')
     A            ISFLOP         3S 0       COLHDG('Løpenummer')
     A            ISFTUA         4S 0       COLHDG('Tur-avdeling')
     A            ISFTUN         8S 0       COLHDG('Turnummer')
     A            ISFFLA         2          COLHDG('Fra land')
     A            ISFTLA         2          COLHDG('Til land')
     A            ISFTRF         8S 0       COLHDG('Transp. nr.')
     A            ISFBIL        10          COLHDG('Bilnummer')
     A            ISFHEN        10          COLHDG('Henger')
     A            ISFS1N         8S 0       COLHDG('Sjåfør 1-nr.')
     A            ISFS1T        30          COLHDG('Sjåfør 1-navn')
     A            ISFS2N         8S 0       COLHDG('Sjåfør 2-nr.')
     A            ISFS2T        30          COLHDG('Sjåfør 2-navn')
     A            ISFOPG         8S 0       COLHDG('Oppdragsgiver')
     A            ISFADA         8S 0       COLHDG('Avgangsdato')
     A            ISFADK         4S 0       COLHDG('Avgang kl.')
     A            ISFAND         8S 0       COLHDG('Ankomstdato')
     A            ISFANK         4S 0       COLHDG('Ankomst kl.')
     A            ISFPFO         5          COLHDG('Partsforklaring')
     A            ISFAVA         5          COLHDG('Avvikets art')
     A            ISFSKL         7S 0       COLHDG('Antall kolli')
     A            ISFSKG         9S 0       COLHDG('Antall kilo')
     A            ISFSLM         4S 2       COLHDG('Ant. lengdemeter')
     A            ISFSM3         7S 3       COLHDG('Antall M3')
     A            ISFMDA         8S 0       COLHDG('Mottatt dato')
     A            ISFMKL         4S 0       COLHDG('Mottatt kl.')
     A            ISFLDA         8S 0       COLHDG('Levert dato')
     A            ISFLKL         4S 0       COLHDG('Levert kl.')
     A            ISFAV1        75          COLHDG('Avvikets årsak 1')
     A            ISFAV2        75          COLHDG('Avvikets årsak 2')
     A            ISFAV3        75          COLHDG('Avvikets årsak 3')
     A            ISFANS         5          COLHDG('Ansvarlig part')
     A            ISFKO1        75          COLHDG('Korr. tiltak 1')
     A            ISFKO2        75          COLHDG('Korr. tiltak 2')
     A            ISFKO3        75          COLHDG('Korr. tiltak 3')
     A            ISFKO4        75          COLHDG('Korr. tiltak 4')
     A            ISFRDA         8S 0       COLHDG('Registreringsdato')
     A            ISFRSI         3          COLHDG('Reg. signatur')
     A            ISFGDA         8S 0       COLHDG('Tiltak godkj. dato')
     A            ISFGSI        15          COLHDG('Godkj. signatur')
     A            ISFFDA         8S 0       COLHDG('Frist gjennomføring')
     A            ISFFSI        15          COLHDG('Frist signatur')
     A            ISFUDA         8S 0       COLHDG('Gjennomført dato')
     A            ISFUSI        15          COLHDG('Gjennomført sign.')
     A            ISFKOS         9S 2       COLHDG('Erstatning')
     A            ISFKOM        30          COLHDG('Kommentar')
     A            ISFOPT         2          COLHDG('Oppdragstype')
     A            ISFUNT         4          COLHDG('Unittype/lastebærer')
     A            ISFSDA         8S 0       COLHDG('Siste saksbeh. dato')
     A            ISFSSI        10          COLHDG('Siste saksbeh. sign.')
     A            ISFODA         8S 0       COLHDG('Overf til saksb dato')
     A            ISFOSI        10          COLHDG('Overf til saksb sign')
      *
     A            ISST           1A         COLHDG('Status')
     A            ISRM           1A         COLHDG('Registreringsmåte')
     A            ISSAKN         7S 0       COLHDG('Saksnr')
     A            ISRTYP         2A         COLHDG('Reklamasjonstype')
     A            ISKNS          8S 0       COLHDG('Kundenr')
     A            ISFN           7S 0       COLHDG('Fakturanr')
     A            ISNYFN         7S 0       COLHDG('Nytt fakturanr')
     A            ISKRNO         7S 0       COLHDG('Kreditnota')
     A            ISFNIN        17A         COLHDG('Inngående fakturanr')
     A            ISVAL          3A         COLHDG('Valutakode')
     A            ISKRAU         9S 2       COLHDG('Krav i utenlansk val')
     A            ISKRAV         9S 2       COLHDG('Erstatningskrav')
     A            ISFORV         9S 2       COLHDG('Forventet erstatning')
     A            ISINT          9S 2       COLHDG('Internt kostnad')
     A            ISUSRR        10A         COLHDG('Bruker-id for reg.')
     A            ISFRTM         6S 0       COLHDG('Registreringstid')
     A            ISUSRS        10A         COLHDG('Br-id siste saksbeh.')
     A            ISFSTM         6S 0       COLHDG('Siste saksbeh. tid')
     A            ISSTPU         1A         COLHDG('STOPP PURRING I L1')
     A            ISSLUT         1A         COLHDG('SAKEN SLUTT')
     A            ISKNA          8S 0       COLHDG('Kundenr ANMELDER')
     A            ISKNO          8S 0       COLHDG('Kundenr OPPDRAG')
     A            ISSDT          8S 0       COLHDG('SAKSDATO')
N01  A            ISKP          30A         COLHDG('KONTAKTPERSON')
N01  A            ISKPEM        50A         COLHDG('KONTAKTPERSON E-POST')
N01  A            ISKPEMS        1A         COLHDG('K.PERSON EPOST SENDT')
N01  A            ISKDMT         5A         COLHDG('KODE FOR MELD.TEKST')
N02  A            ISKNAN1        8S 0       COLHDG('Kundenr ansvarlig 1')
N02  A            ISLKAN1        1A         COLHDG('Leverandør/Kunde 1')
N02  A            ISKNAN2        8S 0       COLHDG('Kundenr ansvarlig 2')
N02  A            ISLKAN2        1A         COLHDG('Leverandør/Kunde 2')
N02  A            ISKNAN3        8S 0       COLHDG('Kundenr ansvarlig 3')
N02  A            ISLKAN3        1A         COLHDG('Leverandør/Kunde 3')
      *
     A          K ISFAVD
     A          K ISFOPD
     A          K ISFLOP
