      *____________________________
      * SYSPED / Koderegister
      *""""""""""""""""""""""""""""
     A          R KODTSPRR
     A            SPRKD1         2S 0       COLHDG('PROS. FØRSTE 2 SIFF.')
     A            SPRKD2         2S 0       COLHDG('PROS. SISTE 2 SIFFER')
     A            SPRTXT        45A         COLHDG('BESKRIVELSE')
     A            SPRTST         1A         COLHDG('J/N TRANSAKSJONSTYPE')
     A            SPRGN          1A         COLHDG('J/N GODSNR')
     A            SPRLS          1A         COLHDG('J/N LAGRINGSSTED')
     A            SPRLKA         1A         COLHDG('J/N AVSENDERLAND')
     A            SPRLKB         1A         COLHDG('J/N BESTEMMELSESLAND')
     A          K SPRKD1
     A          K SPRKD2
