      *____________________________
      * SYSPED / Koderegister
      *""""""""""""""""""""""""""""
     A          R KODTSNR
     A            SNTANR         8S 0       TEXT('TARIFFNR.')
     A          K SNTANR
