********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12281 * 01 YBC PTF12 2 SIFFER TRANSAKSJONSTYPE
********************************************************************
     A*____________________________
     A* SYSPED / Koderegister  'S3'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOS3R
     A            KS3STA         1          TEXT('STATUS')
     A            KS3UNI         4          TEXT('UNIK KODE')
S01  A*           KS3TRT         1S 0       TEXT('TRANSAKSJONSTYPE')
N01  A            KS3TRT         2S 0       TEXT('TRANSAKSJONSTYPE')
     A            KS3FTX        58          TEXT('FRITEKST')
     A          K KS3UNI
     A          K KS3TRT
