     A*____________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER  EKSTRA
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KOSBUXR
     A            BUBNR          7S 0       COLHDG('BILAGSNUMMER')
     A            BUVAO          3          COLHDG('VAL,OPPR.')
     A            BUBLO          9P 2       COLHDG('BELØP,OPPR.')
     A          K BUBNR
