      *_____________________________________________
      * LOGISTIKK/LAGERSYSTEM,  PLUKKLISTE - HEADING
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R LLHEADR                   PFILE(LLHEAD)
     A          K LHTDT
