     A          R MODULERFR
     A            MKUNDE         8S 0       COLHDG('KUNDE')
     A            MPRO1          8          COLHDG('PRODUKT 1')
     A            MPRO2         10          COLHDG('PRODUKT 2')
     A            MLAND          2          COLHDG('LANDKODE')
     A            MANTBR         4S 0       COLHDG('ANT BRUKERE')
     A            MDATOE         8S 0       COLHDG('DATO ENDRET')
     A            MPRIS          7S 0       COLHDG('PRIS')
     A          K MKUNDE
     A          K MPRO1
     A          K MPRO2
