********************************************************************
     A          R NAVAUTKR
     A            NAVKUNA        8S 0       COLHDG('KUNDNR AUTOFORT.')
     A            NAVLKA         1          COLHDG('LAND I ART.NR. J/N')
     A            NAVNTA         1          COLHDG('NORSK TARIFFNR J/N')
     A            NAVPRE         1          COLHDG('DEFAULT PREFERANSE')
     A            NAVNB          3S 2       COLHDG('FORHOLD NTO/BRT.VKT')
     A          K NAVKUNA
