      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSIHR                   PFILE(NCTSIH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K TIWS
     A          K TIST
