     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SIGNATUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSEHR                   PFILE(NCTSEH)
     A                                      TEXT('SIGNATUR')
     A          K THAVD
     A          K THSG
     A          K THDT
