     A          R NCTSEIR                   PFILE(NCTSEI)
     A          K TIAVD
     A          K TITDN
     A          K TICNR
     A          K TIDFKD
