      *___________________________________________
      * SYSPED / Tolldekl. TRANSIT, TRADER
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSIHR                   PFILE(NCTSIH)
     A          K TIAVD
     A          K TIKNTA
     A          K TIDTR
