      * !!! THETA1/THETAT1 - THETA8/THETAT8 OPPDATERES I NCTS011RA
      * !!! THLIDT ER ERSTATTET AV THDDT
MRK01 * !!! FELTER SOM SYSPED IKKE BRUKER
MRK02 * !!! CONTAINER/SEALS ER FLYTTET TIL ITEM
MRK03 * !!! ACTOR, LOCATION SOM SYSPED IKKE BRUKER
      *
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR TR003PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV AVDELINGSO-
     A                                      PPLYSNINGER TET')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R NCTS011D01
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'HENTE REFERANSE FRA Z-FIL')
     A N36                                  CF07(07 'Søke oppdrag')
     A                                      CF10(10 'Slette ferdigmeldt TVINN')
     A                                      CA12(12 'Forrige')
     A          H                           HLPPNLGRP(TR011000 TR011PNL)
     A                                      HLPARA(01 001 08 080)
     A          H                           HLPPNLGRP(TR011000 TR011PNL)
     A                                      HLPARA(09 001 09 080)
     A          H                           HLPPNLGRP(TR01100A TR011PNL)
     A                                      HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(TR01100B TR011PNL)
     A                                      HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(TR01100C TR011PNL)
     A                                      HLPARA(13 001 13 080)
     A          H                           HLPPNLGRP(TR01100D TR011PNL)
     A                                      HLPARA(14 001 14 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYSPED/NCTS011R'
     A                                      COLOR(BLU)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(GRN)
     A                                  1 71TIME
     A                                      COLOR(GRN)
     A  41                              1 20'Registrering av Forh.varsel imp.'
     A                                      COLOR(WHT)
     A N41                              1 20'Registrering av NCTS avgang     '
     A                                      COLOR(WHT)
     A                                  2  3MSGCON(012 DIV1451 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A            FIFIRM         2A  O  2 16TEXT('FIRMAKODE')
     A                                      COLOR(TRQ)
     A                                  2 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  5 18'Avdeling:'
     A            UAVD           4Y 0B  5 34EDTCDE(4)
     A  95                                  DSPATR(PC)
     A  31                                  DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  8 18'Ekstern ref:'
     A            WSEXTR        35A  B  8 34DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 18'Signatur:'
     A            WSSG           3A  B  9 34DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 10 18'Tolldek.nr.'
     A            WSTDN          7Y 0B 10 34DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10 42'Tast oppdragsnr.'
     A                                      COLOR(BLU)
     A                                 11 18'Forenklet?'
     A            WSENKL         1A  B 11 34DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES('J' 'N')
     A                                 11 42'(J=Forenklet, N=Normal)'
     A                                      COLOR(BLU)
     A                                 13 18'Sendes NCTS'
     A            WSTOLK         1A  B 13 34VALUES(' ' 'J' 'N')
     A  96                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 42'(J/N/blank)'
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A N36                             23  2'F7=Søke oppdrag'
     A                                      COLOR(BLU)
     A                                 23 20'F12=Avbryt'
     A                                      COLOR(BLU)
     A                                 23 38'F4=Søk ekstern ref.'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NCTS011D02
     A N27                                  CF04(04 'Søking')
     A                                      CF06(06 'SIKKERHET')
     A N36                                  CF07(07 'Søke oppdrag')
     A                                      CF10(10 'Se TVINN logg')
     A                                      CA12(12 'Forrige')
     A                                      CF14(14 'KUNDEINFO')
     A                                      CF15(15 'ARBEIDE MED TILLEGG OPPL')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYSPED/NCTS011R'
     A                                      COLOR(BLU)
     A N27 41                           1 20'Vedl. av Forh.varsel'
     A                                      COLOR(WHT)
     A N27N41                           1 20'Vedl. av NCTS avg.'
     A                                      COLOR(WHT)
     A  27 41                           1 20'Spør. på forh.varsel'
     A                                      COLOR(WHT)
     A  27N41                           1 20'Spør. på NCTS avg.'
     A                                      COLOR(WHT)
     A                                  1 42'Ref.'
     A            UAVD           4Y 0O  1 47COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTDN          7Y 0O  1 52COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSSG           3A  O  1 60COLOR(WHT)
     A                                  1 64'Tur'
     A            WSPRO          8Y 0B  1 68DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 77'MRNnr/dt'
     A            WSTRNR        18A  O  1 86TEXT('Transittteringsnr')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSTRDT         6Y 0O  1105TEXT('Transitttersdato')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A                                  1114'Reg.dato'
     A            THDT           8Y 0H
     A            WSDT           6Y 0O  1123TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A                                  2  2'Dekl.ty'
     A            WSDK           5A  B  2 10TEXT('Deklarasjonstype')
     A                                      DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSDKT          1A  B  2 17TEXT('Deklarasjonstype')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  2 19'Autor:'
     A            WSATYP         4A  B  2 26TEXT('Autorisasjontype')
     A                                      DSPATR(UL)
     A  97                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAREF        35A  B  2 31TEXT('Autorisasjonsref')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  2 67'Las.liste'
     A            WSLSTL         4Y 0B  2 77EDTCDE(4)
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  2 82'V.post'
     A            WSVPOS         5Y 0O  2 90EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 96'Kolli'
     A            WSNTK          7Y 0O  2104EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2112'B.vkt'
     A            WSVKB         13Y 3O  2118EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3  2'Tollsted:'
     A                                  3 12'Avg'
     A            WSCATS         8A  B  3 16TEXT('AVG.TOLLSTED')
     A                                      DSPATR(UL)
     A  94                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  3 25'Ank'
     A            WSTSB          8A  B  3 29TEXT('Bestemmels tollsted')
     A                                      DSPATR(UL)
     A  93                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  3 38'Transit'
     A            WSTSD1         8A  B  3 46TEXT('Transitt tollsted 1')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD2         8A  B  3 55TEXT('Transitt tollsted 2')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD3         8A  B  3 64TEXT('Transitt tollsted 3')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD4         8A  B  3 73TEXT('Transitt tollsted 4')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD5         8A  B  3 82TEXT('Transitt tollsted 5')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD6         8A  B  3 91TEXT('Transitt tollsted 6')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD7         8A  B  3100TEXT('Transitt tollsted 7')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSD8         8A  B  3109TEXT('Transitt tollsted 8')
     A                                      DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  3118'Bet.måte'
     A            WSTRCH         1A  B  3127TEXT('Betalingsmåte')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4  2'Holder:'
     A            WSKNH          8Y 0B  4 12TEXT('Kundenr holder')
     A                                      DSPATR(UL)
     A  91                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTINH        17A  B  4 21TEXT('ID holder')
     A                                      DSPATR(UL)
     A  91                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4 39'TIR ID'
     A            WSTIRH        17A  B  4 46TEXT('TIR ID holder')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4 70'TIRnr'
     A            WSTIRN        12A  B  4 76TEXT('TIR Carnet nr')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4 89'Secur'
     A            WSSECU         1Y 0B  4 95TEXT('Security')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(3)
     A                                  4 97'R.ind'
     A            WSRDIN         1Y 0B  4103TEXT('Reduced dataset ind.')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(3)
     A                                      VALUES(0 1)
     A                                  4105'S.ind'
     A            WSSCIN         3A  B  4111TEXT('Specific circumstance ind')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4115'Språk'
     A            WSCLKD         2A  B  4121TEXT('Språk')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  4124'Bind.'
     A            WSBINI         1Y 0B  4130TEXT('Binding itinerary')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(3)
     A                                  5  2'NA/AD/PN/PS/LK'
     A            WSNAH         30A  B  5 17TEXT('Navn holder')
     A                                      DSPATR(UL)
     A  90                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1H        30A  B  5 48TEXT('Adr1 holder')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPNH         17A  B  5 79TEXT('Postnr holder')
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPSH         24A  B  5 97TEXT('Poststed holder')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKH          2A  B  5122TEXT('Landkode holder')
     A                                      DSPATR(UL)
     A  87                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  6  2'K.person/Tlf/Epost'
     A            WSCPH         30A  B  6 21TEXT('Kontaktperson holder')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTLH         20A  B  6 52TEXT('Telefonnr holder')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSEMH         50A  B  6 73TEXT('Epostadr holder')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
MRK01A*                                 7  2'Repre.:'
MRK01A*           WSKNA          8Y 0B  7 12TEXT('Kundenr representative')
MRK01A            WSKNA          8Y 0H
MRK01A*                                     DSPATR(UL)
MRK01A* 86                                  DSPATR(RI)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*                                     EDTCDE(4)
MRK01A*           WSTINA        17A  B  7 21TEXT('ID representative')
MRK01A            WSTINA        17A  H
MRK01A*                                     DSPATR(UL)
MRK01A* 85                                  DSPATR(RI)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*           WSSTA          1Y 0B  7 39TEXT('Status representative')
MRK01A            WSSTA          1Y 0H
MRK01A*                                     DSPATR(UL)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*                                     EDTCDE(4)
MRK01A*                                 8  2'K.person/Tlf/Epost'
MRK01A*           WSCPA         30A  B  8 21TEXT('Kontaktperson representative')
MRK01A            WSCPA         30A  H
MRK01A*                                     DSPATR(UL)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*           WSTLA         20A  B  8 52TEXT('Telefonnr representative')
MRK01A            WSTLA         20A  H
MRK01A*                                     DSPATR(UL)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*           WSEMA         50A  B  8 73TEXT('Epostadr representative')
MRK01A            WSEMA         50A  H
MRK01A*                                     DSPATR(UL)
MRK01A* 27                                  DSPATR(PR)
MRK01A*                                     COLOR(YLW)
MRK01A*                                     CHECK(LC)
     A                                  9  2'Garanti'
     A            WSGKD          1A  B  9 12TEXT('Garanti kode')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSGFT1        24A  B  9 14TEXT('Garanti ref.nr')
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSGFT2        35A  B  9 39TEXT('Annen Garanti')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSGADK         4A  B  9 75TEXT('Adgangkode')
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  9 96'Gar. bel:'
     A            WSGBL         11Y 0B  9106TEXT('GARANTI')
     A                                      DSPATR(UL)
     A  82                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  9118'VAL.'
     A            WSGVK          3A  B  9123TEXT('VALUTAKODE')
     A                                      DSPATR(UL)
     A  81                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10  2'Avs.LK'
     A            WSALK          2A  B 10 12TEXT('Landk avs/utf-land')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10 15'Best.LK'
     A            WSBLK          2A  B 10 23TEXT('Landk avs/utf-land')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10 26'Containe'
     A            WSKDC          1A  B 10 35TEXT('Container 0/1')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      VALUES('0' '1')
     A                                 10 37'Tr.mode innl/grense'
     A            WSTMIN         1Y 0B 10 57TEXT('Tr.mode innland')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A            WSTMGR         1Y 0B 10 59TEXT('Tr.mode grense')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A                                 10 61'UCR ref'
     A            WSUCR         35A  B 10 69TEXT('Ref.nr UCR')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 11  2'Tr.portør'
     A            WSKNC          8Y 0B 11 12TEXT('Kundenr transportør')
     A                                      DSPATR(UL)
     A  78                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTINC        17A  B 11 21TEXT('ID transportør')
     A                                      DSPATR(UL)
     A  78                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNAC         30A  B 11 39TEXT('Navn transportør')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTLC         20A  B 11 70TEXT('Telefonnr transportør')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSEMC         50A  H
     A            WSEMC_40      40A  B 11 91TEXT('Epostadr. transportør')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                 12  2'Avsender:'
     A            WSKNS          8Y 0B 12 12TEXT('Kundenr avsender')
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTINS        17A  B 12 21TEXT('ID avsender')
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 13  2'NA/AD/PN/PS/LK'
     A            WSNAS         30A  B 13 17TEXT('Navn avsender')
     A                                      DSPATR(UL)
     A  75                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1S        30A  B 13 48TEXT('Adr1 avsender')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPNS         17A  B 13 79TEXT('Postnr avsender')
     A                                      DSPATR(UL)
     A  74                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPSS         24A  B 13 97TEXT('Poststed avsender')
     A                                      DSPATR(UL)
     A  73                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKS          2A  B 13122TEXT('Landkode avsender')
     A                                      DSPATR(UL)
     A  72                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 14  2'K.person/Tlf/Epost'
     A            WSCPS         30A  B 14 21TEXT('Kontaktperson avsender')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTLS         20A  B 14 52TEXT('Telefonnr avsender')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSEMS         50A  B 14 73TEXT('Epostadr avsender')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                 15  2'Mottaker:'
     A            WSKNK          8Y 0B 15 12TEXT('Kundenr mottaker')
     A                                      DSPATR(UL)
     A  71                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTINK        17A  B 15 21TEXT('ID mottaker')
     A                                      DSPATR(UL)
     A  71                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 16  2'NA/AD/PN/PS/LK'
     A            WSNAK         30A  B 16 17TEXT('Navn mottaker')
     A                                      DSPATR(UL)
     A  70                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1K        30A  B 16 48TEXT('Adr1 mottaker')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPNK         17A  B 16 79TEXT('Postnr mottaker')
     A                                      DSPATR(UL)
     A  69                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSPSK         24A  B 16 97TEXT('Poststed mottaker')
     A                                      DSPATR(UL)
     A  68                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKK          2A  B 16122TEXT('Landkode mottaker')
     A                                      DSPATR(UL)
     A  67                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
MRK03A*                                17  2'Actor:'
MRK03A*           WSROLE         3A  B 17 12TEXT('Role actor')
MRK03A            WSROLE         3A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSIDR         17A  B 17 16TEXT('Role ID actor')
MRK03A            WSIDR         17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK02A*                                17 34'Container (Nr/Ant/Seal)'
MRK02A*           WSCNR         17A  B 17 58TEXT('Containernr')
MRK02A*                                     DSPATR(UL)
MRK02A* 27                                  DSPATR(PR)
MRK02A*                                     COLOR(YLW)
MRK02A*           WSDANT         4Y 0B 17 76TEXT('Antall seal')
MRK02A*                                     DSPATR(UL)
MRK02A* 27                                  DSPATR(PR)
MRK02A*                                     COLOR(YLW)
MRK02A*                                     EDTCDE(4)
MRK02A*           WSDFKD        20A  B 17 81TEXT('Seal')
MRK02A*                                     DSPATR(UL)
MRK02A* 27                                  DSPATR(PR)
MRK02A*                                     COLOR(YLW)
MRK02A*                                17102'Gods ref'
MRK02A*           WSGINR         5Y 0B 17111TEXT('Seal')
MRK02A*                                     DSPATR(UL)
MRK02A* 27                                  DSPATR(PR)
MRK02A*                                     COLOR(YLW)
MRK02A*                                     EDTCDE(4)
MRK03A*                                18  2'Lok:'
MRK03A*                                18  7'T'
MRK03A*           WSLGTY         1A  B 18  9TEXT('Type')
MRK03A            WSLGTY         1A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                18 11'I'
MRK03A*           WSLGID         1A  B 18 13TEXT('ID qualifier')
MRK03A            WSLGID         1A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                18 15'Aut'
MRK03A*           WSLGAU        35A  B 18 19TEXT('Autorisasjonsnr')
MRK03A            WSLGAU        35A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                18 55'ID'
MRK03A*           WSLGAI         4A  B 18 58TEXT('Tilleggs ID')
MRK03A            WSLGAI         4A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                18 63'UN'
MRK03A*           WSLGUN        17A  B 18 66TEXT('Tilleggs UN')
MRK03A            WSLGUN        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                18 84'TS'
MRK03A*           WSLGTS         8A  B 18 87TEXT('Tollsted')
MRK03A            WSLGTS         8A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 66                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSLGLA        17A  B 18 96TEXT('Latitude')
MRK03A            WSLGLA        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSLGLO        17A  B 18114TEXT('Longitude')
MRK03A            WSLGLO        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                19  2'Økonomi:'
MRK03A*           WSKNE          8Y 0B 19 12TEXT('Kundenr økonomi operatør')
MRK03A            WSKNE          8Y 0H
MRK03A*                                     DSPATR(UL)
MRK03A* 65                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                     EDTCDE(4)
MRK03A*           WSTINE        17A  B 19 21TEXT('ID økonomi operatør')
MRK03A            WSTINE        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                19 39'Husnr'
MRK03A*           WSADE2        17A  B 19 45TEXT('Husnr økonomi operatør')
MRK03A            WSADE2        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSPNE2        17A  B 19 63TEXT('Postnr økonomi operatør')
MRK03A            WSPNE2        17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSLKE2         2A  B 19 81TEXT('Landkode økonomi operatør')
MRK03A            WSLKE2         2A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 64                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                20  2'AD/PN/PS/LK'
MRK03A*           WSADE1        30A  B 20 48TEXT('Adr1 økonomi operatør')
MRK03A            WSADE1        30A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSPNE         17A  B 20 79TEXT('Postnr økonomi operatør')
MRK03A            WSPNE         17A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 63                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSPSE         24A  B 20 97TEXT('Poststed økonomi operatør')
MRK03A            WSPSE         24A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 62                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSLKE          2A  B 20122TEXT('Landkode økonomi operatør')
MRK03A            WSLKE          2A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 61                                  DSPATR(RI)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                21  2'K.person/Tlf/Epost'
MRK03A*           WSCPE         30A  B 21 21TEXT('Kontaktperson økonomi')
MRK03A            WSCPE         30A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSTLE         20A  B 21 52TEXT('Telefonnr økonomi operatør')
MRK03A            WSTLE         20A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*           WSEME         50A  B 21 73TEXT('Epostadr økonomi operatør')
MRK03A            WSEME         50A  H
MRK03A*                                     DSPATR(UL)
MRK03A* 27                                  DSPATR(PR)
MRK03A*                                     COLOR(YLW)
MRK03A*                                     CHECK(LC)
     A                                 22  2'Tr.m.typ'
     A            WSTRM          2Y 0B 22 12TEXT('Transportmåte')
     A                                      DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A                                 22 15'Tr.midl.ID'
     A            WSTAID        35A  B 22 26TEXT('Transportmiddel id')
     A                                      DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 22 62'LK'
     A            WSTALK         2A  B 22 65TEXT('Transportmiddel landkode')
     A                                      DSPATR(UL)
     A  59                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 22 70'Rute'
     A            WSLKR1         2A  B 22 75TEXT('Landkode 1 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKR2         2A  B 22 78TEXT('Landkode 2 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKR3         2A  B 22 81TEXT('Landkode 3 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKR4         2A  B 22 84TEXT('Landkode 4 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKR5         2A  B 22 87TEXT('Landkode 5 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLKR6         2A  B 22 90TEXT('Landkode 6 i rute')
     A                                      DSPATR(UL)
     A  58                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23  2'Activ grense:'
     A                                 23 16'Tollsted'
     A            WSTGTS         8A  B 23 25TEXT('Tollsted grense')
     A                                      DSPATR(UL)
     A  57                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23 34'Type'
     A            WSTRMG         2Y 0B 23 39TEXT('Type ID')
     A                                      DSPATR(UL)
     A  56                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A                                 23 42'ID'
     A            WSTGID        35A  B 23 45TEXT('Type ID')
     A                                      DSPATR(UL)
     A  56                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23 81'LK'
     A            WSTGLK         2A  B 23 84TEXT('Landkode')
     A                                      DSPATR(UL)
     A  55                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23 87'Flight'
     A            WSTGCN        17A  B 23 94TEXT('Flight nr')
     A                                      DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 24  2'La.st'
     A            WSLSUN        17A  B 24  8TEXT('UN lok.kode')
     A                                      DSPATR(UL)
     A  54                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLSLK         2A  B 24 26TEXT('Landkode')
     A                                      DSPATR(UL)
     A  54                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLSNA        35A  B 24 29TEXT('Stedsnavn')
     A                                      DSPATR(UL)
     A  54                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 24 65'Lo.st'
     A            WSLOUN        17A  B 24 71TEXT('UN lok.kode')
     A                                      DSPATR(UL)
     A  53                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLOLK         2A  B 24 89TEXT('Landkode')
     A                                      DSPATR(UL)
     A  53                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSLONA        35A  B 24 92TEXT('Stedsnavn')
     A                                      DSPATR(UL)
     A  53                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A*                                25  2'D.'
     A*                                25  5'Ktl.res'
     A*           WSDKR          2A  B 25 13TEXT('Kontroll resultat')
     A*                                     DSPATR(UL)
     A* 53                                  DSPATR(RI)
     A* 27                                  DSPATR(PR)
     A*                                     COLOR(YLW)
     A                                 25 16'Frist'
     A            WSDDT          6Y 0B 25 22DSPATR(UL)
     A  52                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Y)
     A                                 25 32'Exit transit'
     A            WSTSDE         8A  B 25 45TEXT('Exit tollsted')
     A                                      DSPATR(UL)
     A  51                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSTSDE2        8A  B 25 54TEXT('Exit tollsted')
     A                                      DSPATR(UL)
     A  50                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A* 27                             25 31'KTL.TSD/DT'
     A* 27        WSDATS         8   O 25 42COLOR(WHT)
     A* 27        WSDDTK         6Y 0O 25 51COLOR(WHT)
     A*                                     EDTCDE(Y)
     A*                                25 60'Dekl.sted'
     A*           WSDST         15A  B 25 70DSPATR(UL)
     A* 51                                  DSPATR(RI)
     A* 27                                  DSPATR(PR)
     A*                                     COLOR(YLW)
     A                                 25 86'Ext.ref.'
     A            WSSOK         35A  B 25 95TEXT('Frisøkevei')
     A                                      DSPATR(UL)
     A  27
     AO 44                                  DSPATR(PR)
     A  44                                  COLOR(WHT)
     A N44                                  COLOR(YLW)
     A*                                26  1'F3=Avslutt u/oppdatering'
     A*                                     COLOR(BLU)
     A                                 26 28'F4=Kodesøking'
     A                                      COLOR(BLU)
     A                                 26 44'F12=Gå til forrige u/oppdatering'
     A                                      COLOR(BLU)
     A                                 26 81'F15=Tillegg'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NCTS011D03
     A                                      WINDOW(*DFT 5 45 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'Brukt garantibeløp er over'
     A                                  2  2'varslingsgrense på'
     A            TGPRM          3Y 0O  2 21EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  2 25'%'
     A                                  3  2'Totalt garantibeløp er'
     A            TGGBL         11Y 0O  3 25EDTCDE(2)
     A                                      COLOR(BLU)
     A                                  4  2'Totalt brukt garantibeløp'
     A                                  5  2'inkluderer denne NCTS er'
     A            TGGBLB        11Y 0O  5 28EDTCDE(2)
     A                                      COLOR(YLW)
      *
     A          R NCTS011D04
     A                                      WINDOW(*DFT 3 45 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'Oppgitt garantitype krever'
     A N99                              2  2'normal prosedyre.'
     A  99                              2  2'forenklet prosedyre.'
     A                                  3  2'Vil du endre prosedyre?'
     A            WSJN           1A  B  3 26DSPATR(UL)
     A                                      VALUES('J' 'N')
      *
