     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSEHR                   PFILE(NCTSEH)
     A                                      TEXT('Regdato')
     A          K THAVD
     A          K THDT
