      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, SIGNATUR
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSIHR                   PFILE(NCTSIH)
     A                                      TEXT('SIGNATUR')
     A          K TIAVD
     A          K TISG
     A          K TIDTR
