     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSEHR                   PFILE(NCTSEH)
     A          K THST
     A          K THAVD
     A          K THTDN
