********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12304 * 01 CB  PTF12 ADRESSE AVSENDER/MOTTAKER MANGLER
12317 * 02 ORG PTF12 ADRESSE HOVEDANSVARLIG (HOLDER) MANGLER
********************************************************************
      *_________________________________
      * FØLGESEDDEL
      *"""""""""""""""""""""""""""""""""
     A          R NCTS014F1
     A N96N50     PFFM1         75      1  2
     A  96N50     PFFM12        75      1  2
      *
     A          R NCTS014F2
     A N96N50     PFFM2         75      1  2
     A  96N50     PFFM22        75      1  2
     A                                  2  9'REF.'
     A            THAVD          4  0   2 14EDTCDE(Z)
     A                                  2 18'/'
     A            THTDN          7  0   2 19EDTCDE(Z)
     A                                  2 26'/'
     A            THSG           3      2 27
     A            FSSO25        25      2 31
     A            THTINS        17      3 31
     A  50        XHTRNR        18      3 58BARCODE(CODE128 2 *HRI *HRZ +
     A                                      (*WIDTH 0.008) (*RATIO 3) X'02')
     A            THNAS         30      4 10
     A            THDK           5      4 52
S01  A*           THADS1        30      5 10
N01  A            THAD1S        30      5 10
     A            THPNS         17      6 10
     A N29        XSIDEN         3  0   6 45EDTCDE(Z)
     A  29                              6 46'--'
     A N29        XSIDET         3  0   6 48EDTCDE(Z)
     A  29                              6 49'--'
     A N29                              6 52'---'
     A  29        THLSTL         4  0   6 52EDTCDE(Z)
     A            THPSS         24      7 10
     A            THLKS          2      7 36
     A            THVPOS         5  0   8 45EDTCDE(Z)
     A            THNTK          7  0   8 51EDTCDE(Z)
     A            THVKB         13  3   8101EDTCDE(4)
     A            THTINK        17      9 31
     A            THNAK         30     10 10
     A*           THTSSD         8     10 46
     A            THCATS         8     10 46
     A            THTSLK         2     10 76
     A            THUCR         35     10101
S01  A*           THADK1        30     11 10
N01  A            THAD1K        30     11 10
     A            THTSN1        35     11 46
     A            THPNK         17     12 10
     A            THTSN2        35     12 46
     A            THPSK         24     13 10
     A            THLKK          2     13 36
     A            THTSPN         9     13 46
     A            THTSPS        24     13 56
     A N41        XXALKT        17     16 46
     A  41                             16 49'-----'
     A N42        XXBLKT        17     18 64
     A  42                             18 64'-----'
     A N43        THTAID        35     20 10
     A  43                             20 10'-----'
     A N44        THTALK         2     20 38
     A  44                             20 38'--'
      *
     A          R NCTS014F3
     A            TICCH_A        6     28 55
     A            TICCCD         2     28 64
     A            TIPMRK_11     17     29 10
     A            TICNR         17     29 28
     A            TIPNT          8  0  30 10EDTCDE(Z)
     A            TIPTY          2     30 19
     A            TIVKB         13  3  30 61EDTCDE(4)
     A            TICTX_11      50     31 10
     A            TIVKN         13  3  32 61EDTCDE(4)
     A            TIPDRF_11     50     33 10
     A            TISDRF_11     50     34 10
     A            TITDRF_11     50     35 10
     A            TIADRF_11     50     36 10
     A            TIAITX_11     50     37 10
      *
     A          R NCTS014F4
     A                                 30 15'SE VARELISTE'
     A            THVKB         13  3  30 61EDTCDE(4)
      *
     A          R NCTS014F5
      * ALLL SKAL HA EN POS. TIL HØYRE. INGEN MERKING
     A            THTINH        17     51 27
      * ALLE POSISJONER HAR FLYTTET EN PLASS TIL VENSTRE. INGEN MERKING
     A            THNAH         30     52 10
     A                                 52 58'NO'
     A            XKTXTC        16     52 61
S02  A*           THADH1        30     53 10
N02  A            THAD1H        30     53 10
     A*           THCATS         8     53 61
     A            THPNH         17     54 10
     A                                 54 59'------'
     A            THTRDT         8  0  54 68EDTWRD('    .  .  ')
     A            THPSH         24     55 10
     A                                 55 34'FRITATT FOR UNDERSKRIFT'
     A            XHCNA1        12     55 58
     A            XHCANR1        6     55 73
     A            THLKA          2     56 10
     A            THDST         15     56 19
     A            XIDAG          8  0  56 36EDTWRD('    .  .  ')
     A            XHCNA2        10     56 59
     A            XHCANR2        6     56 73
      *
     A          R NCTS014F6                 FONT(755 (*POINTSIZE 4.8))
     A            XKTXT1        25     57 10
     A            XKTXT2        25     57 22
     A            XKTXT3        25     57 34
     A            XKTXT4        25     57 46
     A            XKTXT5        25     57 58
     A            XKTXT6        25     57 70
     A            XHTSD1         2     58 10
     A            XHTSD2         2     58 22
     A            XHTSD3         2     58 34
     A            XHTSD4         2     58 46
     A            XHTSD5         2     58 58
     A            XHTSD6         2     58 70
      *
     A          R NCTS014F7
      * ALLL SKAL HA EN POS. TIL HØYRE. INGEN MERKING
     A N49        THGFT1        24     59 10
     A  49        THGFT2        35     59 10
     A            XHGBGI         2     59 51
     A            THGBGU         2     60 11
     A            XHGBGU        30     60 14
     A            THGKD          1     60 56
     A            XKTXTB        18     60 58
     A            XXTSB          2     60 77
     A N46                             60 70'*'
     A            XHDKR         35     62 15
     A N47        THDANT         4  0  63 15EDTCDE(Z)
     A  47                             63 15'--'
     A N47        THDFKD        20     64 15
     A  47                             64 15'--'
     A            THDDT          8  0  65 15EDTWRD('    .  .  ')
     A N46                             65 27'OMDIRIGERING FORBUDT'
     A N48                             66 27'BINDENDE REISERUTE'
     A N96        PFFM3         75     69  2
     A  96        PFFM32        75     69  2
