     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE
     A                                      WINDOW(*DFT 21 120 *NOMSGLIN)
     A                                      CF12(12 'Forrige')
     A                                  1  2'SYSPED/NCTS071R'
     A                                      COLOR(BLU)
     A                                  1 21'Ekstra info.'
     A                                      COLOR(WHT)
     A                                  1 55'Tdeknr.'
     A            UAVD           4Y 0O  1 63COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 68'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 70COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 88'-'
     A                                      COLOR(WHT)
     A            ULI            5Y 0O  1 90COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 96'-'
     A                                      COLOR(WHT)
     A            TNLI2          5Y 0O  1 98COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2'D.g.item:'
     A            TNLIT          5Y 0O  3 12TEXT('Deklarasjon gods item nr')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2'Godsbesk:'
     A            TNCTX        120A  H
     A            TNCTX_50      50A  O  3 12TEXT('Godsbeskrivelse')
     A                                      COLOR(WHT)
     A                                  3 63'CUS kode:'
     A            TNCCUS         9A  O  3 74TEXT('CUS kode')
     A                                      COLOR(WHT)
     A                                  3 84'Tariff:'
     A            TNCCH          6A  O  3 92TEXT('Tariffnr')
     A                                      COLOR(WHT)
     A            TNCCCD         2A  O  3 99TEXT('Tariffnr')
     A                                      COLOR(WHT)
     A                                  3102'UNNR:'
     A            TNUNNR         4A  O  3108TEXT('UNNR')
     A                                      COLOR(WHT)
     A                                  4  2'Brt.vekt:'
     A            TNVKB         13Y 3O  4 12TEXT('Bruttovekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4 27'Net.vekt:'
     A            TNVKN         13Y 3O  4 37TEXT('Nettovekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4 52'Annen enh:'
     A            TNNTS         13Y 3O  4 63TEXT('Annen enhet')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5  2'Enhet Kolli Merking'
     A            TNPTY          2A  O  6  2TEXT('Pakketype')
     A                                      COLOR(WHT)
     A            TNPNT          8Y 0O  6  5TEXT('Antall pakker')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TNPMRK       120A  H
     A            TNPMRK_1     100A  O  6 14TEXT('Merke & nr')
     A                                      COLOR(WHT)
     A            TNPTY2         2A  O  7  2TEXT('Pakketype')
     A                                      COLOR(WHT)
     A            TNPNT2         8Y 0O  7  5TEXT('Antall pakker')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TNPMRK2      120A  H
     A            TNPMRK2_1    100A  O  7 14TEXT('Merke & nr 2')
     A                                      COLOR(WHT)
     A            TNPTY3         2A  O  8  2TEXT('Pakketype')
     A                                      COLOR(WHT)
     A            TNPNT3         8Y 0O  8  5TEXT('Antall pakker')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TNPMRK3      120A  H
     A            TNPMRK3_1    100A  O  8 14TEXT('Merke & nr 2')
     A                                      COLOR(WHT)
      *
     A                                  9  2'Tidligere dokument'
     A            TNPDTY         4A  O 10  2TEXT('Dokumenttype')
     A                                      COLOR(WHT)
     A            TNPDRF        70A  O 10  7TEXT('Dokument ref')
     A                                      COLOR(WHT)
     A            TNPDTY2        4A  O 11  2TEXT('Dokumenttype 2')
     A                                      COLOR(WHT)
     A            TNPDRF2       70A  O 11  7TEXT('Dokument ref 2')
     A                                      COLOR(WHT)
     A            TNPDTY3        4A  O 12  2TEXT('Dokumenttype 3')
     A                                      COLOR(WHT)
     A            TNPDRF3       70A  O 12  7TEXT('Dokument ref 3')
     A                                      COLOR(WHT)
      *
     A                                 13  2'Støtte dokument'
     A            TNSDTY         4A  O 14 12TEXT('Dokumenttype')
     A                                      COLOR(WHT)
     A            TNSDRF        70A  O 14 17TEXT('Dokument ref')
     A                                      COLOR(WHT)
     A                                 15  2'Transport dokument'
     A            TNTDTY         4A  O 16 12TEXT('Dokumenttype')
     A                                      COLOR(WHT)
     A            TNTDRF        70A  O 16 17TEXT('Dokument ref')
     A                                      COLOR(WHT)
     A                                 17  2'Tilleggs referanse'
     A            TNADTY         4A  O 18 12TEXT('Dokumenttype')
     A                                      COLOR(WHT)
     A            TNADRF        70A  O 18 17TEXT('Dokument ref')
     A                                      COLOR(WHT)
     A                                 19  2'Tilleggsinformasjon'
     A            TNAICD         5A  O 20 12TEXT('Dokumenttype')
     A                                      COLOR(WHT)
     A            TNAITX       120A  H
     A            TNAITX_100   100A  O 20 18TEXT('Dokument ref')
     A                                      COLOR(WHT)
     A                                 21  2'F12=Forrige'
     A                                      COLOR(BLU)
