     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSEHR                   PFILE(NCTSEH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K THWS
     A          K THST
