      *_____________________________________
      * SYSPED / Tolldekl. TRANSITT, HOUSE CONSIGNMENT, COSIGNOR/CONSIGNEE
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R NCTSECAMR
     A            TCAVD     R               REFFLD(AVD)
     A            TCTDN     R               REFFLD(TDN)
     A            TCLI      R               REFFLD(LI5)
      * AVSENDER
     A            TCKNS     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            TCNAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            TCAD1S    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Selger')
     A            TCPNS          9A         COLHDG('POSTNR SELGER')
     A            TCPSS         24A         COLHDG('POSTSTED SELGER')
     A            TCLKS          2A         COLHDG('LANDKODE SELGER')
     A            TCTINS        17A         COLHDG('TIN-KODE SELGER')
     A            TCCPS         30A         COLHDG('KONTAKTPERSON SELGER')
     A            TCTLS         20A         COLHDG('SELGER TEL.')
     A            TCEMS         50A         COLHDG('EMAIL K.PERS. SELGER')
      * MOTTAKER
     A            TCKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            TCNAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            TCAD1K    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            TCPNK          9A         COLHDG('POSTNR KJØPER')
     A            TCPSK         24A         COLHDG('POSTSTED KJØPER')
     A            TCLKK          2A         COLHDG('LANDKODE KJØPER')
     A            TCTINK        17A         COLHDG('TIN-KODE KJØPER')
     A          K TCAVD
     A          K TCTDN
     A          K TCLI
