      *_____________________________________
      * SYSPED / Tolldekl. TRANSITT, ITEM, COSIGNOR/CONSIGNEE
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R NCTSEIAMR
     A            TIAVD     R               REFFLD(AVD)
     A            TITDN     R               REFFLD(TDN)
     A            TILI      R               REFFLD(LI5)
     A            TILI2     R               REFFLD(LI5)
      * AVSENDER
     A*           TIKNS     R               REFFLD(KN)
     A*                                     COLHDG('Kundenr Selger')
     A*           TINAS     R               REFFLD(NA)
     A*                                     COLHDG('Navn Selger')
     A*           TIAD1S    R               REFFLD(AD)
     A*                                     COLHDG('Adresse-1 Selger')
     A*           TIPNS          9A         COLHDG('POSTNR SELGER')
     A*           TIPSS         24A         COLHDG('POSTSTED SELGER')
     A*           TILKS          2A         COLHDG('LANDKODE SELGER')
     A*           TITINS        17A         COLHDG('TIN-KODE SELGER')
     A*           TICPS         30A         COLHDG('KONTAKTPERSON SELGER')
     A*           TITLS         20A         COLHDG('SELGER TEL.')
     A*           TIEMS         50A         COLHDG('EMAIL K.PERS. SELGER')
      * MOTTAKER
     A            TIKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            TINAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            TIAD1K    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            TIPNK          9A         COLHDG('POSTNR KJØPER')
     A            TIPSK         24A         COLHDG('POSTSTED KJØPER')
     A            TILKK          2A         COLHDG('LANDKODE KJØPER')
     A            TITINK        17A         COLHDG('TIN-KODE KJØPER')
      *
     A          K TIAVD
     A          K TITDN
     A          K TILI
     A          K TILI2
