      *__________________________________
      * SYSPED / Tolldekl. TRANSITT, ITEM
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R NCTSIIR
     A            TN01           1          COLHDG('IKKE I BRUK')
     A            TNAVD     R               REFFLD(AVD)
     A            TNTDN     R               REFFLD(TDN)
      *================================================================
      * FOR IE43 LOSSETILLATELSE
      *================================================================
     A            TNLI      R               REFFLD(LI5)
     A            TNLI2     R               REFFLD(LI5)
     A                                      COLHDG('LINJENR I HOUSE')
     A            TNLIT     R               REFFLD(LI5)
     A                                      COLHDG('LINJENR FOR ALLE')
      *
     A            TNDK           5A         COLHDG('DEKLARASJONSTYPE')
     A            TNBLK          2A         COLHDG('BESTEMMELSESLAND')
      * MOTTAKER
     A            TNTINK        17A         COLHDG('TIN-KODE KJØPER')
     A            TNNAK         70A         COLHDG('Navn kjøper')
     A            TNAD1K        70A         COLHDG('Adresse-1 kjøper')
     A            TNPNK         17A         COLHDG('POSTNR KJØPER')
     A            TNPSK         35A         COLHDG('POSTSTED KJØPER')
     A            TNLKK          2A         COLHDG('LANDKODE KJØPER')
      * COMMODITY
     A            TNCTX        120A         COLHDG('TEKST')
     A            TNCCUS         9A         COLHDG('CUS CODE')
      *  COMMODITY CODE
     A            TNCCH          6A         COLHDG('HARMONIZED SYS. CODE')
     A            TNCCCD         2A         COLHDG('COMBINED NOMENCLATUR')
      *  DANGEROUS GOODS
     A            TNUNNR         4A         COLHDG('UN NUMMER')
      *  GOODS MEASURE
     A            TNVKB         13S 3       COLHDG('BRUTTOVEKT')
     A            TNVKN         13S 3       COLHDG('NETTOVEKT')
     A            TNNTS         13S 3       COLHDG('SUPPLEMENTARY UNITS')
      * PACKING
     A            TNPTY          2A         COLHDG('PAKK TYPE')
     A            TNPNT          8S 0       COLHDG('ANTALL PAKKE')
     A            TNPMRK       120A         COLHDG('MERKE & NR')
     A            TNPTY2         2A         COLHDG('PAKK TYPE')
     A            TNPNT2         8S 0       COLHDG('ANTALL PAKKE')
     A            TNPMRK2      120A         COLHDG('MERKE & NR')
     A            TNPTY3         2A         COLHDG('PAKK TYPE')
     A            TNPNT3         8S 0       COLHDG('ANTALL PAKKE')
     A            TNPMRK3      120A         COLHDG('MERKE & NR')
     A            TNPTY4         2A         COLHDG('PAKK TYPE')
     A            TNPNT4         8S 0       COLHDG('ANTALL PAKKE')
     A            TNPMRK4      120A         COLHDG('MERKE & NR')
     A            TNPTY5         2A         COLHDG('PAKK TYPE')
     A            TNPNT5         8S 0       COLHDG('ANTALL PAKKE')
     A            TNPMRK5      120A         COLHDG('MERKE & NR')
      * PREVIOUS DOCUMENT
     A            TNPDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TNPDRF        70A         COLHDG('DOKUMENT REF.')
     A            TNPDGN         5S 0       COLHDG('GOODS ITEM NO')
     A            TNPDIN        35A         COLHDG('INFORMASJON')
     A            TNPDTY2        4A         COLHDG('DOKUMENT TYPE')
     A            TNPDRF2       70A         COLHDG('DOKUMENT REF.')
     A            TNPDGN2        5S 0       COLHDG('GOODS ITEM NO')
     A            TNPDIN2       35A         COLHDG('INFORMASJON')
     A            TNPDTY3        4A         COLHDG('DOKUMENT TYPE')
     A            TNPDRF3       70A         COLHDG('DOKUMENT REF.')
     A            TNPDGN3        5S 0       COLHDG('GOODS ITEM NO')
     A            TNPDIN3       35A         COLHDG('INFORMASJON')
     A            TNPDTY4        4A         COLHDG('DOKUMENT TYPE')
     A            TNPDRF4       70A         COLHDG('DOKUMENT REF.')
     A            TNPDGN4        5S 0       COLHDG('GOODS ITEM NO')
     A            TNPDIN4       35A         COLHDG('INFORMASJON')
     A            TNPDTY5        4A         COLHDG('DOKUMENT TYPE')
     A            TNPDRF5       70A         COLHDG('DOKUMENT REF.')
     A            TNPDGN5        5S 0       COLHDG('GOODS ITEM NO')
     A            TNPDIN5       35A         COLHDG('INFORMASJON')
      * SUPPORTING DOCUMENT
     A            TNSDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TNSDRF        70A         COLHDG('DOKUMENT REF.')
     A            TNSDIN        35A         COLHDG('INFORMASJON')
      * TRANSPORT DOCUMENT
     A            TNTDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TNTDRF        70A         COLHDG('DOKUMENT REF.')
      * ADDITIONAL REFERENCE
     A            TNADTY         4A         COLHDG('REFERENSE TYPE')
     A            TNADRF        70A         COLHDG('REFERANSE')
      * ADDITIONAL INFORMATION
     A            TNAICD         5A         COLHDG('INFORMASJON KODE')
     A            TNAITX       120A         COLHDG('TEKST')
      *================================================================
      * FOR IE44 LOSSEMERKNADER
      *================================================================
      * COMMODITY
     A            NNCTX        120A         COLHDG('TEKST')
     A            NNCCUS         9A         COLHDG('CUS CODE')
      *  COMMODITY CODE
     A            NNCCH          6A         COLHDG('HAMONIZED SYS. CODE')
     A            NNCCCD         2A         COLHDG('COMBINED NOMENCLATUR')
      *  GOODS MEASURE
     A            NNVKB         13S 3       COLHDG('BRUTTOVEKT')
     A            NNVKN         13S 3       COLHDG('NETTOVEKT')
      * PACKING
     A            NNPTY          2A         COLHDG('PAKK TYPE')
     A            NNPNT          8S 0       COLHDG('ANTALL PAKKE')
     A            NNPMRK       120A         COLHDG('MERKE & NR')
     A            NNPTY2         2A         COLHDG('PAKK TYPE')
     A            NNPNT2         8S 0       COLHDG('ANTALL PAKKE')
     A            NNPTY3         2A         COLHDG('PAKK TYPE')
     A            NNPNT3         8S 0       COLHDG('ANTALL PAKKE')
     A            NNPTY4         2A         COLHDG('PAKK TYPE')
     A            NNPNT4         8S 0       COLHDG('ANTALL PAKKE')
     A            NNPTY5         2A         COLHDG('PAKK TYPE')
     A            NNPNT5         8S 0       COLHDG('ANTALL PAKKE')
      * SUPPORTING DOCUMENT
     A            NNSDTY         4A         COLHDG('DOKUMENT TYPE')
     A            NNSDRF        70A         COLHDG('DOKUMENT REF.')
     A            NNSDIN        35A         COLHDG('INFORMASJON')
      * TRANSPORT DOCUMENT
     A            NNTDTY         4A         COLHDG('DOKUMENT TYPE')
     A            NNTDRF        70A         COLHDG('DOKUMENT REF.')
      * ADDITIONAL REFERENCE
     A            NNADTY         4A         COLHDG('REFERENSE TYPE')
     A            NNADRF        70A         COLHDG('REFERANSE')
      *
     A          K TNAVD
     A          K TNTDN
     A          K TNLI
     A          K TNLI2
