      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, SIGNATUR
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSEHR                   PFILE(NCTSEH)
     A          K THSG
     A          K THDT
     A          K THAVD
     A          K THTDN
