      *__________________________________
      * SYSPED / Tolldekl. TRANSITT (NON-ARRIVAL)
      *""""""""""""""""""""""""""""""""""
     A          R NCTSEHCR
     A            TCAVD          4S 0       COLHDG('AVDELING')
     A            TCTDN          7S 0       COLHDG('TOLLDEK.NR')
      * ENQUIRY TRADER (UTLYSNING SENDING)
      *
      * INNKOMMENDE IE035
     A            TCDTA          8S 0       COLHDG('DECL. AKSEPT DATO')
     A            TCDTR          8S 0       COLHDG('GJENOPPRETTET DATO')
     A            TCTXT        512A         COLHDG('TEXT')
     A            TCBEL         16S 2       COLHDG('AMOUNT CLAIMED')
     A            TCVAL          3A         COLHDG('VALUTAKODE')
     A            TCTSD          8A         COLHDG('AVGANG TOLLSTED')
     A            TCTSRD         8A         COLHDG('GJ. AVGANG TOLLSTED')
     A            TCTIN         17A         COLHDG('GARANTIST TIN')
     A            TCNA          70A         COLHDG('GARANTIST NAVN')
     A            TCAD1         70A         COLHDG('GARANTIST ADRESSE')
     A            TCPN          17A         COLHDG('GARANTIST POSTNR')
     A            TCPS          35A         COLHDG('GARANTIST POSTSTED')
     A            TCLK           2A         COLHDG('GARANTIST LANDKODE')
      *
     A          K TCAVD
     A          K TCTDN
