      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, ITEM
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSIIR                   PFILE(NCTSII)
     A          K TNAVD
     A          K TNTDN
     A          K TNLIT
