     A          R NCTSEHR                   PFILE(NCTSEH)
     A          K THDDT
     A          S THGBL                     COMP(GE 0)
     A            THGKD                     COMP(EQ '1')
     A            THGFT1                    COMP(NE ' ')
     A            THST                      COMP(NE 'D')
     A            THST                      COMP(NE 'Z')
     A            THST                      COMP(NE 'S')
