      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, HOUSE CONSIGNMENT
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R NCTSECR                   PFILE(NCTSEC)
     A                                      TEXT('Utg.linjenr')
     A          K TCAVD
     A          K TCTDN
     A          K TCLN
