      *__________________________________
      * SYSPED / Tolldekl. TRANSITT (RELEASE)
      *""""""""""""""""""""""""""""""""""
     A          R NCTSEHLR
     A            TLAVD          4S 0       COLHDG('AVDELING')
     A            TLTDN          7S 0       COLHDG('TOLLDEK.NR')
     A            TLST           1S 0       COLHDG('RELEASED 1/0')
     A            TLDT           8S 0       COLHDG('RELEASEDATO')
     A            TLTM           6S 0       COLHDG('RELEASETID')
      *
     A          K TLAVD
     A          K TLTDN
