     A*____________________________
     A* SYSPED / NORSKE POSTNR GEOFENCING PUNKTER, ANT. NAVN MM
     A*""""""""""""""""""""""""""""
     A          R NOPNFAR
     A            PTPONR         4  0       COLHDG('Postnr')
     A            PTSANT         5S 0       COLHDG('ANTALL POINTS')
     A            NONAVN        30          COLHDG('Stedsnavn..')
     A          K PTPONR
