     A          R PONRNOR
     A            NOPONR         4  0       COLHDG('POSTNR')
     A            NOPOST        30          COLHDG('POSTSTED')
     A            NOKOMM         4  0       COLHDG('KUMMUNENR')
     A            NOKOMN        30          COLHDG('KOMMUNENAVN')
     A            NOKATE         1          COLHDG('KATEGORI')
     A          K NOPONR
