     A          R PRESTARTTR
     A            SYSBS         10          COLHDG('SBS')
     A            SYPGM         10          COLHDG('PROGRAM')
     A            SYLIB         10          COLHDG('BIBLIOTEK')
     A            SYJOB         10          COLHDG('JOBNAVN')
     A            SYJOBT         9          COLHDG('JOBTYPE')
     A            SYJOBQ        10          COLHDG('JOBQ')
     A            SYJOBD        10          COLHDG('JOBD')
     A            SYTXT         30          COLHDG('BESKRIVELSE')
     A          K SYSBS
     A          K SYJOB
