      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr *Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 helpdesk@systema.no endres til eRequest
********************************************************************
      *
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
      *
     A          R BILDE01
     A                                      CF03(03 'EXIT')
     A                                      CF10(10 'BRENN')
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  5  6'VEDLIKEHOLD tolltariff er ikke til-
     A                                      latt for brukere                   -
     A                                                                         -
     A                                                                         -
     A                                                          '
     A                                      COLOR(RED)
     A                                  7  6'Tariffen lastes ned med oppdaterin-
     A                                      ger hver uke'
     A                                  8  6'så hvis tollvesenet sender feil ve-
     A                                      rdier må dette'
     A                                  9  6'meldes til'
S01  A*                                 9 17'helpdesk@systema.no'
N01  A                                  9 17'eRequest'
     A                                      COLOR(YLW)
     A                                 10  6'med info. om hva feilen er i tarif-
     A                                      fen'
