********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10318 * 01 YBC PTF10 VEKT ER ENDRET FRA 5.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
      *              MYE ENDRINGER, INGEN MERKING
XXXXXX*XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
11XXX * 02 YBC PTF11 LEDERTEKST POSISJON
11XXX * 03 YBC PTF11 SKRIV UT ENDRING AV AVGIFTER
11XXX * 04 YBC PTF11 SKRIV UT LØPENR AV OPPRINNELIG SAD PÅ OMBEREGNING
11102 * 05 YBC PTF11 5. LINJE FOR BEGRUNNELSE AV OMBEREGING
11109 * 06 YBC PTF11 OMBEREGNING PÅ OMBEREGNING
XXXXXX*XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
12XXX * 07 YBC PTF12 FEIL INDIKATOR BRUKT
12XXX * 08 YBC PTF12 FEIL FEIL VARIABLER
12064 * 09 YBC PTF12 FLERE BELØP ER ENDRET FOR Å TA STØRRE VERDI
12XXX * 10 YBC PTF12 VIS BRUTTOVEKT
12XXX * 11 YBC PTF12 KREDITNOTA MED BELØP UNDER 0
12201 * 12 YBC PTF12 CONTAINER ER I EGEN FIL
12230 * 13 YBC PTF12 PREFERANSE
12237 * 14 YBC PTF11 KURS UTVIDES TIL 7,3
12248 * 15 YBC PTF12 VEKT, KOLLI, MENGDE ER UTVIDET.
12258 * 16 YBC PTF12 VF-KODE FRA OG MED 01.12.2021.
12281 * 17 YBC PTF12 4 SIFFER PROSEDYRE OG 2 SIFFER TRANSAKSJONSTYPE
********************************************************************
      *
      *  TILLEGGSARK
      *
     A          R DLHEAD
     A            KFMT1         75      1  1
     A                                  2  2'REF:'
     A            SEAVD          4S 0   2  7EDTCDE(Z)
     A                                  2 11'/'
     A            SETDN          7S 0   2 12EDTCDE(Z)
     A                                  2 19'/'
     A            SESG           3      2 20
     A            FSSO25        15      2 41
S07  A* 39N26 29                        2 91'LINJEDEKLARERT'
N07  A  39N26N37                        2 91'LINJEDEKLARERT'
E03  A  39N26 37                        2 91'UTLEVERINGSATTEST'
S07  A*N39N26 29                        2 91'LINJEDEKLARERT KOPI'
N07  A N39N26N37                        2 91'LINJEDEKLARERT KOPI'
E03  A N39N26 37                        2 91'UTLEVERINGSATTEST KOPI'
N03  A     26                           2 91'OMBEREGNING:'
S08  A*    26     SIMF           3A     2104
S08  A*    26     SITYPE         4A     2108
N08  A     26     SEMF           3A     2104
N08  A     26     SETYPE         4A     2108
     A                                  3  2'EKSP.ENHET:'
     A            SETLE          6A     3 14
     A                                  3 22'LØPENR:'
     A            SETLL         10A     3 30
     A                                  3 43'DATO:'
     A            SEDTG         10A     3 49
N04  A     26                           3 59'ORI. EKSP.ENHET:'
N04  A     26     OMB_SETLE      6A     3 76
N04  A     26                           3 83'LØPENR:'
N04  A     26     OMB_SETLL     10A     3 91
N04  A     26                           3102'DATO:'
N04  A     26     OMB_SEDTG     10A     3108
     A                                  4  2'L.NR.'
     A                                  4  8'VARENR.'
     A                                  4 17'VAREBESKRIVELSE'
S17  O*                                 4 48'PR'
S02  O*                                 4 51'   STAT.VERDI'
S17  O*                                 4 51' STAT.VERDI'
S17  O*                                 4 63'FK'
S17  O*                                 4 66'NETTOVEKT'
S17  O*                                 4 79'P'
N17  O                                  4 48'PROS'
N17  O                                  4 53' STAT.VERDI'
N17  O                                  4 65'FK'
N17  O                                  4 68'NETTOVEKT'
N17  O                                  4 80'P'
E15  O                                  4 83'TYPE'
E15  O                                  4 87' GRUNNLAG'
E15  O                                  4 96'    SATS'
E15  O                                  4106'    BELØP'
     A                                  5 48'REFERANSE'
S17  A*                                 5 66'BRUT.VEKT'
N17  A                                  5 68'BRUT.VEKT'
S10  A*                                 5 67'   MENGDE'
S15  A*                                 5 76'   MENGDE'
S17  A*                                 5 78'   MENGDE'
N17  A                                  5 80'   MENGDE'
     A                                  6  2'----------------------------------'
     A                                  6 36'----------------------------------'
     A                                  6 60'----------------------------------'
     A                                  6 84'----------------------------------'
     A                                  6106'-------------'
     A                                  7  2' '
      *
     A          R DLBLIN                    SPACEB(1)
     A                                     2' '
      *
     A          R DLIST1                    SPACEB(1)
     A            WFERNR         5  0      2EDTCDE(Z)
     A            WFEVNT         8S 0      8
     A            WFEVB1        30A       17
S17  A*           SEDP           2S 0     48EDTCDE(Z)
S17  A*           WFESTB        11S 0     51EDTCDE(Z)
S17  A*           WFEFYL         2A       63
S15  A*           WFEVKN         9S 0     66EDTCDE(Z)
S17  A*           WFEVKN        11S 0     66EDTCDE(Z)
S17  A*           WFEPRE         1A       79
N17  A            SEDP_4         4A       48
N17  A            WFESTB        11S 0     53EDTCDE(Z)
N17  A            WFEFYL         2A       65
N17  A            WFEVKN        11S 0     68EDTCDE(Z)
N17  A            WFEPRE         1A       80
E15  A            WTY01          2A       82
E15  A            WGL01         11S 0     87EDTCDE(4)
E15  A            WST01          7S 3     98EDTCDE(4)
E15  A            WPR01          1A      106
E15  A            WBL01         11S 0    108EDTCDE(Z)
     A                                      SPACEA(1)
N16  A                                     8'VF:'
N16  A            WFEVF          1A       12
     A            WFEVB2        30A       17
     A            WFETO1A       17A       48
S15  A*           WFEVKB         9S 0     66EDTCDE(Z)
S17  A*           WFEVKB        11S 0     66EDTCDE(Z)
N17  A            WFEVKB        11S 0     68EDTCDE(Z)
S15  A*           WFENTM         9S 0     76EDTCDE(Z)
S17  A*           WFENTM        11S 0     78EDTCDE(Z)
N17  A            WFENTM        11S 0     80EDTCDE(Z)
S10  A*           WFENTM         9S 0     67EDTCDE(Z)
S10  A*           WTY02          2A       80
S10  A*           WGL02         11S 0     85EDTCDE(4)
S10  A*           WST02          7S 3     96EDTCDE(4)
S10  A*           WPR02          1A      104
S10  A*           WBL02         11S 0    106EDTCDE(Z)
      *
     A          R DLIST2                    SPACEB(1)
     A            WFEVB3        30A       17
     A            WFETO2A       17A       48
S10  A*           WTY03          2A       80
S10  A*           WGL03         11S 0     85EDTCDE(Z)
S10  A*           WST03          7S 3     96EDTCDE(4)
S10  A*           WPR03          1A      104
S10  A*           WBL03         11S 0    106EDTCDE(Z)
      *
     A          R DLIST3                    SPACEB(1)
     A            WFEVB4        30A       17
     A            WFETO3A       17A       48
S10  A*           WTY04          2A       80
S10  A*           WGL04         11S 0     85EDTCDE(Z)
S10  A*           WST04          7S 3     96EDTCDE(4)
S10  A*           WPR04          1A      104
S10  A*           WBL04         11S 0    106EDTCDE(Z)
      *
     A          R DLIST4                    SPACEB(1)
     A            WFEVB5        30A       17
     A            WFETO4A       17A       48
      *
     A          R DLIST5                    SPACEB(1)
     A*           WFEVB6        30A       17
N12  A            WFEVB6        30A       17
     A*           WFETO5A       17A       48
     A            WFETO         17A       48
      *
     A*         R DLIST6                    SPACEB(1)
     A*           WFEVB7        30A       17
N12   *
N12  A          R DLIST9                    SPACEB(1)
N12  A            SVCNR         17A       17
      *
     A          R DLIMV2                    SPACEB(1)
     A                                     6'Understells nr:'
S39  A*           WFEKN1        28A       19
N39  A            WFEKN1        28A       22
      *
     A          R RU28H
     A            DLFMT1        75      1  1
     A                                  2  2'Rubr.28'
     A                                  2 11'Avd:'
     A            SEAVD          4S 0   2 16EDTCDE(Z)
     A                                  2 22'T.dek.nr.'
     A            SETDN          7S 0   2 32EDTCDE(Z)
     A                                  2 41'Tariffør'
     A            SETARF        16A     2 50
S07  A* 39N26 29                        2 90'LINJEDEKLARERT'
N07  A  39N26N37                        2 90'LINJEDEKLARERT'
E03  A  39N26 37                        2 90'UTLEVERINGSATTEST'
S07  A*N39N26 29                        2 90'LINJEDEKLARERT KOPI'
N07  A N39N26N37                        2 90'LINJEDEKLARERT KOPI'
E03  A N39N26 37                        2 90'UTLEVERINGSATTEST KOPI'
N03  A     26                           2 90'OMBEREGNING:'
N03  A     26     SEMF           3A     2103
N03  A     26     SETYPE         4A     2107
     A                                  3  2'Referanse:'
     A            FSSO25        15A     3 13
     A                                  3 41'Eksp.enhet:'
     A            SETLE          6A     3 53
     A                                  3 60'Løpenr:'
     A            SETLL         10A     3 68
     A                                  3 81'Dato:'
     A            SEDTG         10A     3 87
     A  40                              3101'Side:'
     A  40        XR28SD         3S 0   3107EDTCDE(Z)
N04  A     26                           4 36'Ori. eksp.enhet:'
N04  A     26     OMB_SETLE      6A     4 53
N04  A     26                           4 60'Løpenr:'
N04  A     26     OMB_SETLL     10A     4 68
N04  A     26                           4 81'Dato:'
N04  A     26     OMB_SEDTG     10A     4 87
N04   * Alle linjer nede er justert med +1, ingen merking
     A                                  5  2'----------------------------------'
     A                                  5 36'----------------------------------'
     A                                  5 60'----------------------------------'
     A                                  5 84'----------------------------------'
     A                                  5106'-------------'
     A                                  6 10'Finansielle opplysninger'
     A                                  6 35'og bankdata             '
     A                                  6 60'Dato'
     A                                  7  2'----------------------------------'
     A                                  7 36'----------------------------------'
     A                                  7 60'----------------------------------'
     A                                  7 84'----------------------------------'
     A                                  7106'-------------'
     A                                  8  2' '
      *
     A          R RU28H2                    SPACEB(1)
     A            SEFIF         17A       10
     A            SEFID          8S 0     60EDTWRD('    .  .  ')
      *
     A          R RU28D                     SPACEB(1)
     A            SFTXT         17A       10
     A            SFDT           8S 0     60EDTWRD('    .  .  ')
S11  A*           SFBL28        12S 2     75EDTCDE(4)
N11  A            SFBL28        12S 2     75EDTCDE(M)
     A            SFVK28         3A       90
S14  A*           SFKR28         6S 3     96EDTCDE(4)
N14  A            SFKR28         7S 3     96EDTCDE(4)
N03   *
N03  A          R OMBEREGN
N03  A                                  2  2'Omberegning:'
N03  A            SEMF           3A     2 15
N03  A            SETYPE         4A     2 19
N03  A                                  4  2'Avd:'
N03  A            SEAVD          4S 0   4  7EDTCDE(Z)
N03  A                                  4 13'T.dek.nr.'
N03  A            SETDN          7S 0   4 23EDTCDE(Z)
N03  A                                  4 32'Tariffør'
N03  A            SETARF        16A     4 41
N03  A                                  5  2'Referanse:'
N03  A            FSSO25        15A     5 13
N03  A                                  5 41'Eksp.enhet:'
N03  A            SETLE          6A     5 53
N03  A                                  5 60'Løpenr:'
N03  A            SETLL         10A     5 68
N03  A                                  5 81'Dato:'
N03  A            SEDTG         10A     5 87
N04  A                                  6 21'Opprinnelig SAD:'
N04  A                                  6 41'Eksp.enhet:'
N04  A            OMB_SETLE      6A     6 53
N04  A                                  6 60'Løpenr:'
N04  A            OMB_SETLL     10A     6 68
N04  A                                  6 81'Dato:'
N04  A            OMB_SEDTG     10A     6 87
N06   * TIDLIGERE OMBEREGNING
N06  A  35                              7 21'Tidligere omberegning:'
N06  A  35        TO1_SETLE      6A     7 44
N06  A  35        TO1_SETLL     10A     7 51
N06  A  35        TO2_SETLE      6A     7 63
N06  A  35        TO2_SETLL     10A     7 70
N06  A  35        TO3_SETLE      6A     7 82
N06  A  35        TO3_SETLL     10A     7 89
N06  A  35        TO4_SETLE      6A     7101
N06  A  35        TO4_SETLL     10A     7108
N06   * START    ALLE LINJENR NEDE ER ØKT MED 1. INGEN MERKING.
N04   * Alle linjer nede er justert med +1. Ingen merking
N03  A                                  9  2'Begrunnelse for OMB:'
N03  A            SEFT01        70A     9 23
N03  A            SEFT02        70A    10 23
N03  A            SEFT03        70A    11 23
N03  A            SEFT04        70A    12 23
N05  A            SEFT05        70A    13 23
N05   * START    ALLE LINJER ER ØKT MED 1
N03  A                                 15  2'Beskjed fra TVINN:'
N03  A            SEFT11        70A    15 23
N03  A            SEFT12        70A    16 23
N03  A            SEFT13        70A    17 23
N03  A            SEFT14        70A    18 23
N05   * SLUTT    ALLE LINJER ER ØKT MED 1
N05  A            SEFT15        70A    19 23
N05   * START    ALLE LINJER ER ØKT MED 2
N03  A                                 21  2'Total endring avg.:'
N03  A            SEBLTT        11  2  21 23EDTCDE(M)
N03  A                                 23  2'Endret avgifter:'
N03  A                                 23 23'Avgift'
N03  A                                 23 30'       Beløp'
N03  A            SETY01         2A    24 23
N03  A            SEBL01        11  2  24 30EDTCDE(M)
N03  A            SETY02         2A    25 23
N03  A            SEBL02        11  2  25 30EDTCDE(M)
N03  A            SETY03         2A    26 23
N03  A            SEBL03        11  2  26 30EDTCDE(M)
N03  A            SETY04         2A    27 23
N03  A            SEBL04        11  2  27 30EDTCDE(M)
N03  A            SETY05         2A    28 23
N03  A            SEBL05        11  2  28 30EDTCDE(M)
N03  A            SETY06         2A    29 23
N03  A            SEBL06        11  2  29 30EDTCDE(M)
N03  A            SETY07         2A    30 23
N03  A            SEBL07        11  2  30 30EDTCDE(M)
N03  A            SETY08         2A    31 23
N03  A            SEBL08        11  2  31 30EDTCDE(M)
N03  A            SETY09         2A    32 23
N03  A            SEBL09        11  2  32 30EDTCDE(M)
N03  A            SETY10         2A    33 23
N03  A            SEBL10        11  2  33 30EDTCDE(M)
N03  A            SETY11         2A    34 23
N03  A            SEBL11        11  2  34 30EDTCDE(M)
N03  A            SETY12         2A    35 23
N03  A            SEBL12        11  2  35 30EDTCDE(M)
N03  A            SETY13         2A    36 23
N03  A            SEBL13        11  2  36 30EDTCDE(M)
N03  A            SETY14         2A    37 23
N03  A            SEBL14        11  2  37 30EDTCDE(M)
N03  A            SETY15         2A    38 23
N03  A            SEBL15        11  2  38 30EDTCDE(M)
N03  A            SETY16         2A    39 23
N03  A            SEBL16        11  2  39 30EDTCDE(M)
N03  A            SETY17         2A    40 23
N03  A            SEBL17        11  2  40 30EDTCDE(M)
N03  A            SETY18         2A    41 23
N03  A            SEBL18        11  2  41 30EDTCDE(M)
N03  A            SETY19         2A    42 23
N03  A            SEBL19        11  2  42 30EDTCDE(M)
N03  A            SETY20         2A    43 23
N03  A            SEBL20        11  2  43 30EDTCDE(M)
N05   * SLUTT    ALLE LINJER ER ØKT MED 2
N06   * SLUTT    ALLE LINJER ER ØKT MED 1
