********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10286 * 01 YBC PTF10 VEKT ER ENDRET FRA 9.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
10XXX * 02 YBC PTF10 ALLE POSISJONER FLYTTES 1 TIL VENSTR
10329 * 03 YBC PTF10 MENGDE I ANNEN ENHET ER ENDRET FRA 7.0 TIL 9.0
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 04 YBC PTF11 TEKSTEN PÅ UNDERSTELLSNR FORKORTES
11XXX * 05 YBC PTF11 SKRIV UT ENDRING AV AVGIFTER
11XXX * 06 YBC PTF11 SKRIV UT LØPENR AV OPPRINNELIG SAD PÅ OMBEREGNING
11101 * 07 YBC PTF11 5. LINJE FOR BEGRUNNELSE AV OMBEREGING
11108 * 08 YBC PTF11 OMBEREGNING PÅ OMBEREGNING
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12001 * 09 YBC PTF12 LISTE FOR MVA-REGISTRERTE
12XXX * 10 YBC PTF12 FEIL INDIKATOR BRUKT
12047 * 11 YBC PTF12 SKRIV CONTAINERNR/GODSMERKING
12053 * 12 YBC PTF12 FLERE FELETER ER UTVIDET. INGEN MERKING.
12XXX * 13 YBC PTF12 GLEMTE FELTER PÅ ENDRING 12
12108 * 14 YBC PTF12 MULIGHET FOR AVVIKENDE PROSEDYRE
12110 * 15 YBC PTF12 VARIABEL FOR TOTAL AVGIFT ENDRES TIL 11.0
12XXX * 16 YBC PTF12 KREDITNOTA MED BELØP UNDER 0
12200 * 17 YBC PTF12 CONTAINER ER I EGEN FIL
12237 * 18 YBC PTF12 KURS UTVIDES TIL 7,3
12XXX * 19 YBC PTF12 CONTAINERNR OG UNDERST.NR KAN KOMME SAMTIDIG
12251 * 20 YBC PTF12 SKRIV UT LØPENR AV OPPRINNELIG SAD PÅ OPPGJØR
12281 * 21 YBC PTF12 4 SIFFER PROSEDYRE OG 2 SIFFER TRANSAKSJONSTYPE
********************************************************************
      *
      *  TILLEGGSARK
      *
     A          R DLHEAD
     A            KFMT1         75      1  1
     A                                  2  1'REF:'
     A            SIAVD          4S 0   2  6EDTCDE(Z)
     A                                  2 10'/'
     A            SITDN          7S 0   2 11EDTCDE(Z)
     A                                  2 18'/'
     A            SISG           3      2 19
     A            FSSO25        25      2 40
S10  A* 39N26 29                        2 90'LINJEDEKLARERT'
N10  A  39N26N37                        2 90'LINJEDEKLARERT'
E05  A  39N26 37                        2 90'UTLEVERINGSATTEST'
S10  A*N39N26 29                        2 90'LINJEDEKLARERT KOPI'
N10  A N39N26N37                        2 90'LINJEDEKLARERT KOPI'
E05  A N39N26 37                        2 90'UTLEVERINGSATTEST KOPI'
N05  A     26                           2 90'OMBEREGNING:'
N05  A     26     SIMF           3A     2103
N05  A     26     SITYPE         4A     2107
     A                                  3  1'EKSP.ENHET:'
     A            SITLE          6A     3 13
     A                                  3 21'LØPENR:'
     A            SITLL         10A     3 29
     A                                  3 42'DATO:'
     A            SIDTG         10A     3 48
N06  A     26                           3 59'ORI. EKSP.ENHET:'
N06  A     26     OMB_SITLE      6A     3 76
N06  A     26                           3 83'LØPENR:'
N06  A     26     OMB_SITLL     10A     3 91
N06  A     26                           3102'DATO:'
N06  A     26     OMB_SIDTG     10A     3108
N20  A     25                           3 59'ORI. EKSP.ENHET:'
N20  A     25     SITLE1         6A     3 76
N20  A     25                           3 83'LØPENR:'
N20  A     25     SITLL1        10A     3 91
N20  A     25                           3102'DATO:'
N20  A     25     SIDTG1        10A     3108
     A                                  4  1'L.NR.'
     A                                  4  7'VARENR.'
     A                                  4 16'VAREBESKRIVELSE'
     O                                  4 47'TN'
     O                                  4 50'OP'
     O                                  4 53'P'
S21  O*                                 4 55'PR'
S21  O*                                 4 58'   STAT.VERDI'
S21  O*                                 4 72'VF'
N21  O                                  4 55'PROS'
N21  O                                  4 61'   STAT.VERDI'
N21  O                                  4 75'VF'
     O                                  4 79'TY'
     O                                  4 82'        GRUNNLAG'
     O                                  4 97'    SATS'
     O                                  4107'      BELØP'
     O*                                 4119 'BM'
     A                                  5 41'REFERANSE'
     A                                  5 59'NETTOVEKT'
     A                                  5 72'MENGDE'
     A                                  6  1'----------------------------------'
     A                                  6 35'----------------------------------'
     A                                  6 59'----------------------------------'
     A                                  6 83'----------------------------------'
     A                                  6105'-------------'
     A                                  7  2' '
      *
     A          R DTOMLI                    SPACEB(1)
     A                                     2' '
      *
     A          R DLIST1                    SPACEB(1)
     A            WFIRNR         5  0      1EDTCDE(Z)
     A            WFIVNT         8S 0      7
     A            WFIVB1        30A       16
     A            WFITN          1A       47
     A            WFILK          2A       50
     A            WFIPRE         1A       53
S14  A*           SIDP           2S 0     55EDTCDE(Z)
N14  A            X_DP           2S 0     55EDTCDE(Z)
N21  A            X_DP2          2S 0     57
S21  A*           WFISTB        13S 0     58EDTCDE(Z)
S21  A*           WFIVF          1A       72
N21  A            WFISTB        13S 0     61EDTCDE(Z)
N21  A            WFIVF          1A       75
     A            WTY01          2A       79
     A  61        WGL01         13S 2     82EDTCDE(4)
     A N61        WGL01A        11S 0     85EDTCDE(Z)
     A            WST01          7S 2     97EDTCDE(4)
     A            WPR01          1A      105
     A            WBL01         11S 0    107EDTCDE(Z)
     A*           WTR01          2A      119SPACEA(1)
     A                                      SPACEA(1)
S03  A*           WFIVB2        30A       16
S03  A*           WFITO1A       17A       47
S03  A*           WFIVKN         9S 0     65EDTCDE(Z)
S03  A*           WFINTM         7S 0     75EDTCDE(Z)
N03  A            WFIVB2        30A       10
N03  A            WFITO1A       17A       41
N03  A            WFIVKN         9S 0     59EDTCDE(Z)
N03  A            WFINTM         9S 0     69EDTCDE(Z)
     A            WTY02          2A       79
     A  62        WGL02         13S 2     82EDTCDE(4)
     A N62        WGL02A        11S 0     85EDTCDE(Z)
     A            WST02          7S 2     97EDTCDE(4)
     A            WPR02          1A      105
     A            WBL02         11S 0    107EDTCDE(Z)
     A*           WTR02          2A      119SPACEA(1)
      *
     A          R DLIST2                    SPACEB(1)
     A            WFIVB3        30A       10
     A            WFITO2A       17A       41
     A            WTY03          2A       79
     A  63        WGL03         13S 2     82EDTCDE(4)
     A N63        WGL03A        11S 0     85EDTCDE(Z)
     A            WST03          7S 2     97EDTCDE(4)
     A            WPR03          1A      105
     A            WBL03         11S 0    107EDTCDE(Z)
     A*           WTR03          2A      119SPACEA(1)
      *
     A          R DLIST3                    SPACEB(1)
     A            WFIVB4        30A       10
     A            WFITO3A       17A       41
     A            WTY04          2A       79
     A  64        WGL04         13S 2     82EDTCDE(4)
     A N64        WGL04A        11S 0     85EDTCDE(Z)
     A            WST04          7S 2     97EDTCDE(4)
     A            WPR04          1A      105
     A            WBL04         11S 0    107EDTCDE(Z)
     A*           WTR04          2A      119SPACEA(1)
      *
     A          R DLIST4                    SPACEB(1)
     A            WFIVB5        30A       10
     A            WFITO4A       17A       41
     A            WTY05          2A       79
     A  65        WGL05         13S 2     82EDTCDE(4)
     A N65        WGL05A        11S 0     85EDTCDE(Z)
     A            WST05          7S 2     97EDTCDE(4)
     A            WPR05          1A      105
     A            WBL05         11S 0    107EDTCDE(Z)
     A*           WTR05          2A      119SPACEA(1)
      *
     A          R DLIST5                    SPACEB(1)
     A*           WFIVB6        30A       10
N17  A            WFIVB6        30A       10
     A            WFITO5A       17A       41
     A            WTY06          2A       79
     A  66        WGL06         13S 2     82EDTCDE(4)
     A N66        WGL06A        11S 0     85EDTCDE(Z)
     A            WST06          7S 2     97EDTCDE(4)
     A            WPR06          1A      105
     A            WBL06         11S 0    107EDTCDE(Z)
     A*           WTR06          2A      119SPACEA(1)
      *
     A          R DLIST6                    SPACEB(1)
     A*           WFIVB7        30A       10
N17  A            WFIVB7        30A       10
     A            WFITO6A       17A       41
     A            WTY07          2A       79
     A  67        WGL07         13S 2     82EDTCDE(4)
     A N67        WGL07A        11S 0     85EDTCDE(Z)
     A            WST07          7S 2     97EDTCDE(4)
     A            WPR07          1A      105
     A            WBL07         11S 0    107EDTCDE(Z)
     A*           WTR07          2A      119SPACEA(1)
      *
     A          R DLIST7                    SPACEB(1)
N17  A            WFIVB8        30A       10
     A            WFITO7A       17A       41
     A            WTY08          2A       79
     A  68        WGL08         13S 2     82EDTCDE(4)
     A N68        WGL08A        11S 0     85EDTCDE(Z)
     A            WST08          7S 2     97EDTCDE(4)
     A            WPR08          1A      105
     A            WBL08         11S 0    107EDTCDE(Z)
     A*           WTR08          2A      119SPACEA(1)
      *
     A          R DLIST8                    SPACEB(1)
N11  A            WFIVB         30A       10
     A            WFITO         17A       41
      *
     A          R DLIMVO                    SPACEB(1)
     A                                     5'Underst.nr:'
     A            SWUNNR        17A       18
     A            DSFTXM        36A       41SPACEA(1)
     A            DSFTXV        21A       10
     A            DSFTXE        21A       34
     A            DSFTXK        21A       57
      *
     A          R DLIMV2                    SPACEB(1)
S04  A*                                    5'Understells nr:'
N04  A                                     5'Underst.nr:'
     A            WFIKN1        28A       18
N19   *
N19  A          R DLIMV3                    SPACEB(1)
N19  A                                     5'Containernr:'
N19  A            X_CONTNR      17A       18
      *
     A          R DLAVGH
     A            KFMT1         75      1  1
     A                                  2  2'REF:'
     A            SIAVD          4S 0   2  7EDTCDE(Z)
     A                                  2 11'/'
     A            SITDN          7S 0   2 12EDTCDE(Z)
     A                                  2 19'/'
     A            SISG           3      2 20
     A            FSSO25        25      2 41
S10  A* 39N26 29                        2 91'LINJEDEKLARERT'
N10  A  39N26N37                        2 91'LINJEDEKLARERT'
E05  A  39N26 37                        2 91'UTLEVERINGSATTEST'
S10  A*N39N26 29                        2 91'LINJEDEKLARERT KOPI'
N10  A N39N26N37                        2 91'LINJEDEKLARERT KOPI'
E05  A N39N26 37                        2 91'UTLEVERINGSATTEST KOPI'
N05  A     26                           2 91'OMBEREGNING:'
N05  A     26     SIMF           3A     2104
N05  A     26     SITYPE         4A     2108
     A                                  3  2'EKSP.ENHET:'
     A            SITLE          6A     3 14
     A                                  3 22'LØPENR:'
     A            SITLL         10A     3 30
     A                                  3 43'DATO:'
     A            SIDTG         10A     3 49
N06  A     26                           3 60'ORI. EKSP.ENHET:'
N06  A     26     OMB_SITLE      6A     3 77
N06  A     26                           3 84'LØPENR:'
N06  A     26     OMB_SITLL     10A     3 92
N06  A     26                           3103'DATO:'
N06  A     26     OMB_SIDTG     10A     3109
N20  A     25                           3 60'ORI. EKSP.ENHET:'
N20  A     25     SITLE1         6A     3 77
N20  A     25                           3 84'LØPENR:'
N20  A     25     SITLL1        10A     3 92
N20  A     25                           3103'DATO:'
N20  A     25     SIDTG1        10A     3109
     O                                  5  2'TYPE'
     O                                  5 12'    BELØP'
     A                                  6  2'----------------------------------'
     A                                  6 36'----------------------------------'
     A                                  6 60'----------------------------------'
     A                                  6 84'----------------------------------'
     A                                  6106'-------------'
     A                                  7  2' '
      *
     A          R DLAVGD                    SPACEB(1)
     A            XTAVGT         2         2
S15  A*           XTAVGB         9S 0     12EDTCDE(Z)
N15  A            XTAVGB        11S 0     10EDTCDE(Z)
      *
     A          R DLAVGS                    SPACEB(1)
     A                                     2'----------------------------------'
     A                                    36'----------------------------------'
     A                                    60'----------------------------------'
     A                                    84'----------------------------------'
     A                                   106'-------------'
     A                                      SPACEA(1)
     A                                     2'SUM:'
     A N94N98     SIBEL7        11S 0     10EDTCDE(Z)
S09  A*N94 98     XDSUM          9S 0     12EDTCDE(Z)
N09  A N94 98     XDSUM         11S 0     10EDTCDE(Z)
S12  A* 94N93     SIBELT         9S 0     12EDTCDE(Z)
N12  A  94N93     SIBELT        11S 0     10EDTCDE(Z)
      *
     A          R RU28H
     A            DLFMT1        75      1  1
     A                                  2  2'Rubr.28'
     A                                  2 11'Avd:'
     A            SIAVD          4S 0   2 16EDTCDE(Z)
     A                                  2 22'T.dek.nr.'
     A            SITDN          7S 0   2 32EDTCDE(Z)
     A                                  2 41'Tariffør'
     A            SITARF        16A     2 50
S10  A* 39N26 29                        2 90'LINJEDEKLARERT'
N10  A  39N26N37                        2 90'LINJEDEKLARERT'
E05  A  39N26 37                        2 90'UTLEVERINGSATTEST'
S10  A*N39N26 29                        2 90'LINJEDEKLARERT KOPI'
N10  A N39N26N37                        2 90'LINJEDEKLARERT KOPI'
E05  A N39N26 37                        2 90'UTLEVERINGSATTEST KOPI'
N05  A     26                           2 90'OMBEREGNING:'
N05  A     26     SIMF           3A     2104
N05  A     26     SITYPE         4A     2107
     A                                  3  2'Referanse:'
     A            FSSO25        25A     3 13
     A                                  3 41'Eksp.enhet:'
     A            SITLE          6A     3 53
     A                                  3 60'Løpenr:'
     A            SITLL         10A     3 68
     A                                  3 81'Dato:'
     A            SIDTG         10A     3 87
     A  40                              3101'Side:'
     A  40        XR28SD         3S 0   3107EDTCDE(Z)
     A                                  4  2'----------------------------------'
     A                                  4 36'----------------------------------'
     A                                  4 60'----------------------------------'
     A                                  4 84'----------------------------------'
     A                                  4106'-------------'
     A                                  5 10'Finansielle opplysninger'
     A                                  5 35'og bankdata             '
     A                                  5 60'Dato'
     A                                  6  2'----------------------------------'
     A                                  6 36'----------------------------------'
     A                                  6 60'----------------------------------'
     A                                  6 84'----------------------------------'
     A                                  6106'-------------'
     A                                  7  2' '
      *
     A          R RU28H2                    SPACEB(1)
     A            SIFIF         17A       10
     A            SIFID          8S 0     60EDTWRD('    .  .  ')
      *
     A          R RU28D                     SPACEB(1)
     A            SFTXT         17A       10
     A            SFDT           8S 0     60EDTWRD('    .  .  ')
S16  A*           SFBL28        12S 2     75EDTCDE(4)
N16  A            SFBL28        12S 2     75EDTCDE(M)
     A            SFVK28         3A       90
S18  A*           SFKR28         6S 3     96EDTCDE(4)
N18  A            SFKR28         7S 3     96EDTCDE(4)
N05   *
N05  A          R OMBEREGN
N05  A                                  2  2'Omberegning:'
N05  A            SIMF           3A     2 15
N05  A            SITYPE         4A     2 19
N05  A                                  4  2'Avd:'
N05  A            SIAVD          4S 0   4  7EDTCDE(Z)
N05  A                                  4 13'T.dek.nr.'
N05  A            SITDN          7S 0   4 23EDTCDE(Z)
N05  A                                  4 32'Tariffør'
N05  A            SITARF        16A     4 41
N05  A                                  5  2'Referanse:'
N05  A            FSSO25        25A     5 13
N05  A                                  5 41'Eksp.enhet:'
N05  A            SITLE          6A     5 53
N05  A                                  5 60'Løpenr:'
N05  A            SITLL         10A     5 68
N05  A                                  5 81'Dato:'
N05  A            SIDTG         10A     5 87
N06  A                                  6 21'Opprinnelig SAD:'
N06  A                                  6 41'Eksp.enhet:'
N06  A            OMB_SITLE      6A     6 53
N06  A                                  6 60'Løpenr:'
N06  A            OMB_SITLL     10A     6 68
N06  A                                  6 81'Dato:'
N06  A            OMB_SIDTG     10A     6 87
N08   * TIDLIGERE OMBEREGNING
N08  A  35                              7 21'Tidligere omberegning:'
N08  A  35        TO1_SITLE      6A     7 44
N08  A  35        TO1_SITLL     10A     7 51
N08  A  35        TO2_SITLE      6A     7 63
N08  A  35        TO2_SITLL     10A     7 70
N08  A  35        TO3_SITLE      6A     7 82
N08  A  35        TO3_SITLL     10A     7 89
N08  A  35        TO4_SITLE      6A     7101
N08  A  35        TO4_SITLL     10A     7108
N08   * START    ALLE LINJENR NEDE ER ØKT MED 1. INGEN MERKING.
N06   * LINJER UNDER HAR ØKT MED EN UTEN MERKING
N05  A                                  9  2'Begrunnelse for OMB:'
N05  A            SIFT01        70A     9 23
N05  A            SIFT02        70A    10 23
N05  A            SIFT03        70A    11 23
N05  A            SIFT04        70A    12 23
N07  A            SIFT05        70A    13 23
N07   * START    ALLE LINJER ER ØKT MED 1
N05  A                                 15  2'Beskjed fra TVINN:'
N05  A            SIFT11        70A    15 23
N05  A            SIFT12        70A    16 23
N05  A            SIFT13        70A    17 23
N05  A            SIFT14        70A    18 23
N07   * SLUTT    ALLE LINJER ER ØKT MED 1
N07  A            SIFT15        70A    19 23
N07   * START    ALLE LINJER ER ØKT MED 2
N05  A                                 21  2'Total endring avg.:'
N05  A            SIBLTT        11  2  21 23EDTCDE(M)
N05  A                                 23  2'Endret avgifter:'
N05  A                                 23 23'Avgift'
N05  A                                 23 30'       Beløp'
N05  A            SITY01         2A    24 23
N05  A            SIBL01        11  2  24 30EDTCDE(M)
N05  A            SITY02         2A    25 23
N05  A            SIBL02        11  2  25 30EDTCDE(M)
N05  A            SITY03         2A    26 23
N05  A            SIBL03        11  2  26 30EDTCDE(M)
N05  A            SITY04         2A    27 23
N05  A            SIBL04        11  2  27 30EDTCDE(M)
N05  A            SITY05         2A    28 23
N05  A            SIBL05        11  2  28 30EDTCDE(M)
N05  A            SITY06         2A    29 23
N05  A            SIBL06        11  2  29 30EDTCDE(M)
N05  A            SITY07         2A    30 23
N05  A            SIBL07        11  2  30 30EDTCDE(M)
N05  A            SITY08         2A    31 23
N05  A            SIBL08        11  2  31 30EDTCDE(M)
N05  A            SITY09         2A    32 23
N05  A            SIBL09        11  2  32 30EDTCDE(M)
N05  A            SITY10         2A    33 23
N05  A            SIBL10        11  2  33 30EDTCDE(M)
N05  A            SITY11         2A    34 23
N05  A            SIBL11        11  2  34 30EDTCDE(M)
N05  A            SITY12         2A    35 23
N05  A            SIBL12        11  2  35 30EDTCDE(M)
N05  A            SITY13         2A    36 23
N05  A            SIBL13        11  2  36 30EDTCDE(M)
N05  A            SITY14         2A    37 23
N05  A            SIBL14        11  2  37 30EDTCDE(M)
N05  A            SITY15         2A    38 23
N05  A            SIBL15        11  2  38 30EDTCDE(M)
N05  A            SITY16         2A    39 23
N05  A            SIBL16        11  2  39 30EDTCDE(M)
N05  A            SITY17         2A    40 23
N05  A            SIBL17        11  2  40 30EDTCDE(M)
N05  A            SITY18         2A    41 23
N05  A            SIBL18        11  2  41 30EDTCDE(M)
N05  A            SITY19         2A    42 23
N05  A            SIBL19        11  2  42 30EDTCDE(M)
N05  A            SITY20         2A    43 23
N05  A            SIBL20        11  2  43 30EDTCDE(M)
N07   * SLUTT    ALLE LINJER ER ØKT MED 2
N08   * SLUTT    ALLE LINJER ER ØKT MED 1
N09   *
N09  A          R AVGSP01
N09.1A                                  2  2'Avgift spesifikasjon (estimert):'
N09  A                                  4  2'Avd:'
N09  A            SIAVD          4S 0   4  7EDTCDE(Z)
N09  A                                  4 13'T.dek.nr.'
N09  A            SITDN          7S 0   4 23EDTCDE(Z)
N09  A                                  4 32'Tariffør'
N09  A            SITARF        16A     4 41
N09  A                                  5  2'Referanse:'
N09  A            FSSO25        25A     5 13
N09  A                                  5 41'Eksp.enhet:'
N09  A            SITLE          6A     5 53
N09  A                                  5 60'Løpenr:'
N09  A            SITLL         10A     5 68
N09  A                                  5 81'Dato:'
N09  A            SIDTG         10A     5 87
N20  A  25                              6 21'Opprinnelig SAD:'
N20  A  25                              6 41'Eksp.enhet:'
N20  A  25        SITLE1         6A     6 53
N20  A  25                              6 60'Løpenr:'
N20  A  25        SITLL1        10A     6 68
N20  A  25                              6 81'Dato:'
N20  A  25        SIDTG1        10A     6 87
N09  A                                  7  2'Linjenr'
N09  A                                  7 11'Avgift'
S13  A*                                 7 29'Grunnlag'
S13  A*                                 7 44'Sats'
S13  A*                                 7 56'Beløp'
N13  A                                  7 31'Grunnlag'
N13  A                                  7 46'Sats'
N13  A                                  7 58'Beløp'
N09  A                                  8  2'----------------------------------'
N09  A                                  8 36'----------------------------------'
N09   *
N09  A          R AVGSP02                   SPACEB(1)
N09  A            WFIRNR         5S 0      2EDTCDE(Z)
N09  A            X_AVGKD        2A       11
N09  A            X_AVGSK        3A       14
N09  A            X_AVGTY        1A       18
S13  A*           X_AVGGR       11S 2     25EDTCDE(4)
S13  A*           X_AVGSA        7S 2     40EDTCDE(4)
S13  A*           X_AVGBL       11S 0     50EDTCDE(Z)
N13  A            X_AVGGR       13S 2     25EDTCDE(4)
N13  A            X_AVGSA        7S 2     42EDTCDE(4)
N13  A            X_AVGBL       11S 0     52EDTCDE(Z)
N09   *
N09  A          R AVGSP03                   SPACEB(1)
N09  A                                     2'Linjetotal:'
N09  A            X_AVGTT       11S 0     50EDTCDE(Z)
N09   *
N09  A          R AVGSP04                   SPACEB(2)
N09  A                                     2'----------------------------------'
N09  A                                    36'----------------------------------'
N09  A                                      SPACEA(1)
N09  A                                     2'Sum avgifter:'
N09   *
N09  A          R AVGSP05                   SPACEB(1)
N09  A            X_AVGKD        2A       11
N09  A            X_AVGSK        3A       14
S13  A*           X_AVGGR       11S 2     25EDTCDE(4)
S13  A*           X_AVGSA        7S 2     40EDTCDE(4)
S13  A*           X_AVGBL       11S 0     50EDTCDE(Z)
N13  A            X_AVGGR       13S 2     25EDTCDE(4)
N13  A            X_AVGSA        7S 2     42EDTCDE(4)
N13  A            X_AVGBL       11S 0     52EDTCDE(Z)
N09   *
N09  A          R AVGSP06                   SPACEB(1)
N09  A                                     2'----------------------------------'
N09  A                                    36'----------------------------------'
N09  A                                      SPACEA(1)
N09  A                                     2'Totale avgifter:'
S13  A*           X_AVGTT       11S 0     50EDTCDE(Z)
N13  A            X_AVGTT       11S 0     52EDTCDE(Z)
