     A          R SADEXHFR                   PFILE(SADEXHF)
     A          K EHTRID
     A          K EH3039E
     A          S EHPRO                      VALUES(0)
