      *__________________________________
      * EKSP.MANIFEST (HOUSECONSIGNMENT)
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADEXHFR
     A            EHST      R               REFFLD(ST)
     A                                      COLHDG('Status')
      * ' ' --> Ny registrert houseconsignment
      * 'C' --> Houseconsignment er sendt til Tollvesenet
      * 'M' --> Feil i houseconsignment til Tollvesenet
      * 'O' --> Houseconsignment kan sendes til Tollvesenet
     A            EHST2     R               REFFLD(ST)
     A                                      COLHDG('Status 2')
      * ' ' --> Houseconsignment er ikke sendt til Tollvesenet
      * 'S' --> Houseconsignment er sendt til Tollvesenet med POST
      * 'R' --> Houseconsignment er sendt til Tollvesenet med PUT
      * 'D' --> Houseconsignment er sendt til Tollvesenet med DELETE
     A            EHST3     R               REFFLD(ST)
     A                                      COLHDG('Status 3')
      *
     A            EHUUID        36A         COLHDG('LRN')
     A            EHMID         18A         COLHDG('MRN')
     A            EHDTS          8S 0       COLHDG('Sendingsdato')
     A            EHTMS          6S 0       COLHDG('Sendingstid')
      *
     A            EHPRO     R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
      *
     A            EHAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            EHTDN     R               REFFLD(TDN)
     A                                      COLHDG('Oppdragsnr')
      * Deklarant
     A            EHKND          8S 0       COLHDG('Deklarant')
     A            EHRGD         17A         COLHDG('Org.nr deklarant')
     A            EHNAD         30A         COLHDG('Navn deklarant')
     A            EHNA2D        30A         COLHDG('SubDivvision dekla.')
     A            EHAD1D        30A         COLHDG('Gateadr. dekla.')
     A*           EHAD2D        30A         COLHDG('Ekstra ADR1 dekla.')
     A            EHNRD         15A         COLHDG('Husnr dekla.')
     A            EHPND          9A         COLHDG('Postnr deklarant')
     A            EHPSD         24A         COLHDG('P.sted deklarant')
     A            EHLKD          2A         COLHDG('L.kode deklarant')
     A            EHPBD         15A         COLHDG('Postbox dekla.')
     A            EHEMD         50A         COLHDG('Epostadr dekla.')
     A            EHEMDT         2A         COLHDG('Kodetype decla.')
      * EM = Epostadr. TE = Telefon
      * Representative
     A            EHKNR          8S 0       COLHDG('Representative')
     A            EHRGR         17A         COLHDG('Org.nr representativ')
     A            EHSTR          1A         COLHDG('Status representativ')
      * 2 = Direkte, 3 = Indirekte
     A            EHNAR         30A         COLHDG('Navn representative')
     A            EHNA2R        30A         COLHDG('SubDivvision repre.')
     A            EHAD1R        30A         COLHDG('Gateadr. repre.')
     A*           EHAD2R        30A         COLHDG('Ekstra ADR1 repre.')
     A            EHNRR         15A         COLHDG('Husnr repre.')
     A            EHPNR          9A         COLHDG('Postnr representativ')
     A            EHPSR         24A         COLHDG('P.sted representativ')
     A            EHLKR          2A         COLHDG('L.kode representativ')
     A            EHPBR         15A         COLHDG('Postbox repre.')
     A            EHEMR         50A         COLHDG('Epostadr/tlf repre.')
     A            EHEMRT         2A         COLHDG('Kodetype repre.')
      * EM = Epostadr. TE = Telefon
      *
      * consigmentHouseLevel
      *
     A            EHCNIN         2S 0       COLHDG('Container indikator')
     A            EHVKB         13S 3       COLHDG('Total vekt')
     A            EHUCR         50A         COLHDG('Ref.nr UCR')
     A            EHNTK          7S 0       COLHDG('Total kolli')
     A            EHVT          30A         COLHDG('Varebeskrivelse')
      * exportFromEU
     A            EHETYP         2A         COLHDG('Type')
     A            EHETYPT       30A         COLHDG('Type tekst')
     A            EHEID         18A         COLHDG('Eksport Id')
      * importProcedure
     A            EHPR           2A         COLHDG('Prosedyre')
     A            EHPRT         30A         COLHDG('Prosedyre tekst')
      * OutgoingProcedure
     A            EHUPR          5A         COLHDG('OutgoingProsedyre')
     A            EHUPRT        30A         COLHDG('OutgoingPros. tekst')
      * previousDocuments (norsk import fortolling eller NCTS)
      * Norsk import
     A            EHRG          11A         COLHDG('Org.nr')
     A            EH0068A        8S 0       COLHDG('Sendingsdato')
     A            EH0068B        6S 0       COLHDG('Sendingssekv')
      * NCTS
     A            EHTRNR        18A         COLHDG('MRN-nr')
     A            EHTRTY         4A         COLHDG('Ref.type CUDE')
      * additionalFiscalReference
     A            EHRGA         17A         COLHDG('MVA.nr')
     A            EHRGRO         3A         COLHDG('MVA-aktørens rolle')
      * placeOfLoading
     A            EHLKF          2A         COLHDG('Land of loading')
     A            EHSDF          5A         COLHDG('Place of loading')
     A            EHSDFT        30A         COLHDG('Place of loading')
      * placeOfUnloading
     A            EHLKT          2A         COLHDG('Land of unloading')
     A            EHSDT          5A         COLHDG('Place of unloading')
     A            EHSDTT        30A         COLHDG('Place of unloading')
      * additionalSupplyChainActor
     A            EHRGE         17A         COLHDG('Autorisert økonomi')
     A            EHROE          2A         COLHDG('Rollen operatør')
      * consignee
     A            EHKNM          8S 0       COLHDG('Mottaker')
     A            EHRGM         17A         COLHDG('Org.nr mottaker')
     A            EHNAM         30A         COLHDG('Navn mottaker')
     A            EHNA2M        30A         COLHDG('SubDivvision mottak.')
     A            EHAD1M        30A         COLHDG('Gateadr. mottaker')
     A*           EHAD2M        30A         COLHDG('Ekstra ADR1 mottaker')
     A            EHNRM         15A         COLHDG('Husnr mottaker')
     A            EHPNM          9A         COLHDG('Postnr mottaker')
     A            EHPSM         24A         COLHDG('P.sted mottaker')
     A            EHLKM          2A         COLHDG('L.kode mottaker')
     A            EHPBM         15A         COLHDG('Postbox mottaker')
     A            EHEMM         50A         COLHDG('Ep.adr/tlf mottaker')
     A            EHEMMT         2A         COLHDG('Kodetype mottaker')
      * EM = Epostadr. TE = Telefon
      * consignor
     A            EHKNS          8S 0       COLHDG('Avsender')
     A            EHRGS         17A         COLHDG('Org.nr avsender')
     A            EHNAS         30A         COLHDG('Navn avsender')
     A            EHNA2S        30A         COLHDG('SubDivvision avsend.')
     A            EHAD1S        30A         COLHDG('Gateadr. avsender')
     A*           EHAD2S        30A         COLHDG('Ekstra ADR1 avsender')
     A            EHNRS         15A         COLHDG('Husnr avsender')
     A            EHPNS          9A         COLHDG('Postnr avsender')
     A            EHPSS         24A         COLHDG('P.sted avsender')
     A            EHLKS          2A         COLHDG('L.kode avsender')
     A            EHPBS         15A         COLHDG('Postbox avsender')
     A            EHEMS         50A         COLHDG('Epostadr avsender')
     A            EHEMST         2A         COLHDG('Kodetype mottaker')
      * EM = Epostadr. TE = Telefon
      *
      * transportDocumentHouseLevel
     A            EHDKH         50A         COLHDG('House Dokumentnr')
     A            EHDKHT         4A         COLHDG('House Dokumenttype')
      * transportCharges
     A            EHTCMP         1A         COLHDG('Betalingsmåte')
     A            EHTCVA         3A         COLHDG('Valutakode')
     A            EHTCBL        11S 2       COLHDG('Beløp')
      * countryOfRoutingOfConsinments
     A            EHLKR1         2A         COLHDG('Landkode1 reiserute')
     A            EHLKR2         2A         COLHDG('Landkode2 reiserute')
     A            EHLKR3         2A         COLHDG('Landkode3 reiserute')
     A            EHLKR4         2A         COLHDG('Landkode4 reiserute')
     A            EHLKR5         2A         COLHDG('Landkode5 reiserute')
     A            EHLKR6         2A         COLHDG('Landkode6 reiserute')
     A            EHLKR7         2A         COLHDG('Landkode7 reiserute')
     A            EHLKR8         2A         COLHDG('Landkode8 reiserute')
      * container nummer
     A            EHCNR         11A         COLHDG('Containernr')
      * Kjøretøy passiv
     A            EHPMRK        30A         COLHDG('Kjennemerke')
     A            EHPTYP         2A         COLHDG('Kjøretøy type')
     A            EHPTM          4A         COLHDG('Transportmåte')
     A            EHPTMT        50A         COLHDG('Transportmåte tekst')
     A            EHPLK          2A         COLHDG('Kjøretøynasjonalitet')
      *
     A            EHTRID        17A         COLHDG('Bilnr')
     A            EH3039E        6S 0       COLHDG('Ekspedisjonsenhet')
      *
