     A          R SADEFCFR                   PFILE(SADEFCF)
     A          K CL3039E
     A          K CLTRID
     A          S CLPRO                      VALUES(0)
