     A          R SADEXIFR                   PFILE(SADEXIF)
     A          K EIPRO
     A          K EIAVD
     A          K EITDN
     A          K EILI
