     A          R SADEXLOGR                 PFILE(SADEXLOG)
     A          K ELPRO
     A          K ELAVD
     A          K ELTDN
     A          K ELDATE
     A          K ELTIME
