      *__________________________________
      * EKSP.MANIFEST (GOODSITEM)
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADEXIFR
     A            EIST      R               REFFLD(ST)
     A                                      COLHDG('Status')
      *
     A            EIPRO     R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
     A            EIAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            EITDN     R               REFFLD(TDN)
     A                                      COLHDG('Oppdragsnr')
     A            EILI      R               REFFLD(LI5)
     A                                      COLHDG('Linjenr')
      *
     A            EILID     R               REFFLD(LI5)
     A                                      COLHDG('Dekl. Linjenr')
     A            EILIT     R               REFFLD(LI5)
     A                                      COLHDG('NCTS Linjenr')
      *
     A            EIGTY          2A         COLHDG('Godstype')
      * itemAmountInvoiced
     A            EIBL          13S 2       COLHDG('Linje beløp')
     A            EIVAL          3A         COLHDG('Valutakode')
      * additionalSupplyChainActor
     A            EIRGE         17A         COLHDG('Autorisert økonomi')
     A            EIROE          3A         COLHDG('Rollen operatør')
      * referenceNumberUCR
     A            EIUCR         50A         COLHDG('Ref.nr UCR')
      * commodity
     A            EIVT          70A         COLHDG('Godsbeskrivelse')
     A            EICKD          9A         COLHDG('cusCode')
     A            EIVNT          8S 0       COLHDG('Tariffnr')
     A            EIUNNR         4A         COLHDG('UN-nummer')
     A            EICVKN        11S 3       COLHDG('Nettovekt')
     A            EICVKB        11S 3       COLHDG('Bruttovekt')
     A            EIUNIT        35A         COLHDG('SupplementaryUnits')
      *
     A            EILK           2A         COLHDG('Opprinnelses land')
     A            EIMK          17A         COLHDG('Merking')
     A            EINT           7S 0       COLHDG('Kolli')
     A            EINTEH         2A         COLHDG('Kolli enhet')
      * Kjøretøy passiv
     A            EIPMRK        30A         COLHDG('Kjennemerke')
     A            EIPTYP         2A         COLHDG('Kjøretøy type')
     A            EIPTM          4A         COLHDG('Transportmåte')
     A            EIPTMT        50A         COLHDG('Transportmåte tekst')
     A            EIPLK          2A         COLHDG('Kjøretøynasjonalitet')
      * container nummer
     A            EICNR         11A         COLHDG('Containernr')
      *
