      *__________________________________
      * SYSPED / JOIN-REGISTER (LOGISK)
      *""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A            SIFIF
     A            SIFID
     A            SIAVD
     A            SITDN
     A          K SIFIF
     A          K SIFID
     A          K SIAVD
     A          K SITDN
     A          O SIFID                     COMP(EQ 99999999)
      *
     A          R SADFR                     PFILE(SADF)
     A            SFTXT
     A            SFDT
     A            SFAVD
     A            SFOPDN
     A          K SFTXT
     A          K SFDT
     A          K SFAVD
     A          K SFOPDN
      *
