     A          R SADFFAR                   PFILE(SADFFA)
     A          K SFAFTXT
     A          K SFAFDT
     A          K SFAFTXT21
     A          K SFAFAVD
     A          K SFAFOPDN
