********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10319 * 01 YBC PTF10 FLERE ENN 8 AVGIFTER
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11108 * 02 YBC PTF11 FELTER FOR OMBEREGNING
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12053 * 03 YBC PTF12 FLERE BELØP-FELTER ER ENDRET FOR Å TA STØRRE VERDI
12281 * 04 YBC PTF12 4 SIFFER PROSEDYRE OG 2 SIFFER TRANSAKSJONSTYPE
********************************************************************
     A*__________________________________
     A* SYSPED / Tolldeklarasjoner Import
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADHEDIR
     A            SIAVD          4S 0       COLHDG('AVDELING')
     A            SITDN     R               REFFLD(TDN)
     A            SI1225         3A         COLHDG('MELDINGSTYPE')
     A            SI1225T       12A         COLHDG('MELDINGSTYPE TEKST')
     A            S3039E    R               REFFLD(N3039E)
     A            SIDTY     R               REFFLD(DTY)
     A            SIDP      R               REFFLD(DP)
N04  A            SIDP2          2S 0       COLHDG('Siste 2 siffer pros')
     A            SIKNS     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            SINAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            SIADS1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Selger')
     A            SIADS2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Selger')
     A            SIADS3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Selger')
     A            SINTK     R               REFFLD(NTK)
     A            SITOTL    R               REFFLD(LI5)
     A            SIKDDK    R               REFFLD(KDDK)
     A            SIKDC     R               REFFLD(KDC)
     A            SISG      R               REFFLD(SG)
     A            SIKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            SIRG          11A         COLHDG('FORETAKSNR.')
     A            SINAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            SIADK1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            SIADK2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Kjøper')
     A            SIADK3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Kjøper')
     A            SIVAL1    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode Frakt')
     A            SIBEL1    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp tollb.frakt')
     A            SIVAL2    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode A. kost')
     A            SIBEL2    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp A. kost')
     A            SIFTG2    R               REFFLD(KDFT)
     A                                      COLHDG('Fortegn +/- a.kost')
     A            SILKA     R               REFFLD(LKA)
     A                                      COLHDG('Landk avs/utf-land')
     A            SITLF     R               REFFLD(TLF)
     A                                      COLHDG('Telefon Deklarant')
     A            SINAD     R               REFFLD(NA)
     A                                      COLHDG('Navn Deklarant')
     A            SILV      R               REFFLD(LV)
     A            SILVT     R               REFFLD(LVT)
     A            SITRID    R               REFFLD(TRID)
     A            SILKT     R               REFFLD(LKA)
     A                                      COLHDG('Landk Tr.middel')
     A            SIVAL3    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode Faktsum')
     A            SIBEL3    R               REFFLD(BEL13)
     A                                      COLHDG('Beløp Faktsum')
     A            SIVKU     R               REFFLD(VKU)
S04  A*           SITST     R               REFFLD(TST)
N04  A            SITST          2S 0       COLHDG('Transaksjonstype')
     A            SITRT     R               REFFLD(TRT)
     A* BRUKER POSISJON 1 I SITRT TIL SAMMENSLÅING VARELINJER          )
     A            SITRM     R               REFFLD(TRM)
     A            SIFIF     R               REFFLD(FIF)
     A            SIFID     R               REFFLD(DT)
     A                                      COLHDG('Finans oppl.fakdat')
S03  A*           SIBELT    R               REFFLD(BEL9)
S03  A*                                     COLHDG('Beløp Trafikkavg')
N03  A            SIBELT        11S 0       COLHDG('Beløp Trafikkavg')
     A            SIKT           8          COLHDG('TOLLKREDITNR')
     A            SIGN          15          COLHDG('GODSNR.')
     A            SIDST     R               REFFLD(DST)
     A            SILS      R               REFFLD(LS)
     A            SIKDLS         2A         COLHDG('Lagringssted kode')
     A            SIAS      R               REFFLD(AS)
     A                                      COLHDG('Avgiftssats transp')
     A            SIDT      R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            SIPOS     R               REFFLD(POS9)
     A            SITARF        16          COLHDG('TARIFFØRSNAVN')
      *
     A            SIVALR    R               REFFLD(VAL)
     A            SIBELR    R               REFFLD(BEL11)
     A                                      COLHDG('Bearbeidskostnad')
     A            SITOTA        11S 0       COLHDG('TOTAL AVGIFTER')
     A            SITKD1         2          COLHDG('TOTAL AVGIFT1, KODE')
     A            SITAV1        11S 0       COLHDG('TOTAL AVGIFT1, BELØP')
     A            SITKD2         2          COLHDG('TOTAL AVGIFT2, KODE')
     A            SITAV2        11S 0       COLHDG('TOTAL AVGIFT2, BELØP')
     A            SITKD3         2          COLHDG('TOTAL AVGIFT3, KODE')
     A            SITAV3        11S 0       COLHDG('TOTAL AVGIFT3, BELØP')
     A            SITKD4         2          COLHDG('TOTAL AVGIFT4, KODE')
     A            SITAV4        11S 0       COLHDG('TOTAL AVGIFT4, BELØP')
     A            SITKD5         2          COLHDG('TOTAL AVGIFT5, KODE')
     A            SITAV5        11S 0       COLHDG('TOTAL AVGIFT5, BELØP')
     A            SITKD6         2          COLHDG('TOTAL AVGIFT6, KODE')
     A            SITAV6        11S 0       COLHDG('TOTAL AVGIFT6, BELØP')
     A            SITKD7         2          COLHDG('TOTAL AVGIFT7, KODE')
     A            SITAV7        11S 0       COLHDG('TOTAL AVGIFT7, BELØP')
     A            SITKD8         2          COLHDG('TOTAL AVGIFT8, KODE')
     A            SITAV8        11S 0       COLHDG('TOTAL AVGIFT8, BELØP')
     A            SITKD9         2          COLHDG('TOTAL AVGIFT9, KODE')
     A            SITAV9        11S 0       COLHDG('TOTAL AVGIFT9, BELØP')
N01  A            SITKD10        2          COLHDG('TOTAL AVG.10, KODE')
N01  A            SITAV10       11S 0       COLHDG('TOTAL AVG.10, BELØP')
N01  A            SITKD11        2          COLHDG('TOTAL AVG.11, KODE')
N01  A            SITAV11       11S 0       COLHDG('TOTAL AVG.11, BELØP')
N01  A            SITKD12        2          COLHDG('TOTAL AVG.12, KODE')
N01  A            SITAV12       11S 0       COLHDG('TOTAL AVG.12, BELØP')
N01  A            SITKD13        2          COLHDG('TOTAL AVG.13, KODE')
N01  A            SITAV13       11S 0       COLHDG('TOTAL AVG.13, BELØP')
N01  A            SITKD14        2          COLHDG('TOTAL AVG.14, KODE')
N01  A            SITAV14       11S 0       COLHDG('TOTAL AVG.14, BELØP')
N01  A            SITKD15        2          COLHDG('TOTAL AVG.15, KODE')
N01  A            SITAV15       11S 0       COLHDG('TOTAL AVG.15, BELØP')
N01  A            SITKD16        2          COLHDG('TOTAL AVG.16, KODE')
N01  A            SITAV16       11S 0       COLHDG('TOTAL AVG.16, BELØP')
N02   *
N02   * EKSTRA FELTER FOR OMBEREGNING
N02  A            SITYPE         4A         COLHDG('TYPETILFELLE')
N02  A            SIFT01        70A         COLHDG('BEGRUNNELSE 1')
N02  A            SIFT02        70A         COLHDG('BEGRUNNELSE 2')
N02  A            SIFT03        70A         COLHDG('BEGRUNNELSE 3')
N02  A            SIFT04        70A         COLHDG('BEGRUNNELSE 4')
N02  A            SIFT05        70A         COLHDG('BEGRUNNELSE 5')
N02  A            SIFT11        70A         COLHDG('BESKJED FRA TVINN 1')
N02  A            SIFT12        70A         COLHDG('BESKJED FRA TVINN 2')
N02  A            SIFT13        70A         COLHDG('BESKJED FRA TVINN 3')
N02  A            SIFT14        70A         COLHDG('BESKJED FRA TVINN 4')
N02  A            SIFT15        70A         COLHDG('BESKJED FRA TVINN 5')
N02  A            SIBLTT    R               REFFLD(BEL11)
N02  A                                      COLHDG('TOTAL AVGIFTER')
N02  A            SITY01         2A         COLHDG('AVGIFTSTYPE 1')
N02  A            SIBL01    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 1')
N02  A            SITY02         2A         COLHDG('AVGIFTSTYPE 2')
N02  A            SIBL02    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 2')
N02  A            SITY03         2A         COLHDG('AVGIFTSTYPE 3')
N02  A            SIBL03    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 3')
N02  A            SITY04         2A         COLHDG('AVGIFTSTYPE 4')
N02  A            SIBL04    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 4')
N02  A            SITY05         2A         COLHDG('AVGIFTSTYPE 5')
N02  A            SIBL05    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 5')
N02  A            SITY06         2A         COLHDG('AVGIFTSTYPE 6')
N02  A            SIBL06    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 6')
N02  A            SITY07         2A         COLHDG('AVGIFTSTYPE 7')
N02  A            SIBL07    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 7')
N02  A            SITY08         2A         COLHDG('AVGIFTSTYPE 8')
N02  A            SIBL08    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 8')
N02  A            SITY09         2A         COLHDG('AVGIFTSTYPE 9')
N02  A            SIBL09    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 9')
N02  A            SITY10         2A         COLHDG('AVGIFTSTYPE 10')
N02  A            SIBL10    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 10')
N02  A            SITY11         2A         COLHDG('AVGIFTSTYPE 11')
N02  A            SIBL11    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 11')
N02  A            SITY12         2A         COLHDG('AVGIFTSTYPE 12')
N02  A            SIBL12    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 12')
N02  A            SITY13         2A         COLHDG('AVGIFTSTYPE 13')
N02  A            SIBL13    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 13')
N02  A            SITY14         2A         COLHDG('AVGIFTSTYPE 14')
N02  A            SIBL14    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 14')
N02  A            SITY15         2A         COLHDG('AVGIFTSTYPE 15')
N02  A            SIBL15    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 15')
N02  A            SITY16         2A         COLHDG('AVGIFTSTYPE 16')
N02  A            SIBL16    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 16')
N02  A            SITY17         2A         COLHDG('AVGIFTSTYPE 17')
N02  A            SIBL17    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 17')
N02  A            SITY18         2A         COLHDG('AVGIFTSTYPE 18')
N02  A            SIBL18    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 18')
N02  A            SITY19         2A         COLHDG('AVGIFTSTYPE 19')
N02  A            SIBL19    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 19')
N02  A            SITY20         2A         COLHDG('AVGIFTSTYPE 20')
N02  A            SIBL20    R               REFFLD(BEL11)
N02  A                                      COLHDG('AVGIFTS BELØP 20')
     A          K SIAVD
     A          K SITDN
