      *____________________________________________________
      * SYSPED / Tolldeklarasjoner Import, GODKJENNINGSDATO
      *""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('STATUS')
     A          K SIKNK
     A          K SIDTG
