      *____________________________________________________
      * SYSPED / Tolldeklarasjoner Import, Transportmiddel
      *""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A          K SITRID
     A          K SIAVD
     A          K SITDN
     A          S SIST                      VALUES(' ' 'F')
     A            SITDN                     COMP(GT 0)
     A            SITLL                     VALUES(' ')
