      *_____________________________________________
      * SYSPED / Tolldeklarasjoner Import, STATUS
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('STATUS')
     A          K SIAVD
     A          K SIST
     A          S SITDN                     COMP(LT 0)
