     A                                      REF(SR)
     A          R SADHANR
     A            WIE            1          COLHDG('IMPORT/EKSPORT')
     A            SIAVD          4S 0       COLHDG('AVDELING')
     A            SITDN     R               REFFLD(TDN)
     A            SISG      R               REFFLD(SG)
     A            SIDT      R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            SILKA     R               REFFLD(LKA)
     A                                      COLHDG('Landk avs/utf-land')
     A            SIKNS     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            SIKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            SIDTG     R               REFFLD(DTG)
     A            SIGN          15          COLHDG('GODSNR.')
     A            WANTDAG        5S 0       COLHDG('ANT.DAG.')
     A            WEXTREF       35A         COLHDG('EXTERN REFERANSE')
     A            WVPREG         5S 0       COLHDG('ANT.REG.VP')
     A            WVPOFF         5S 0       COLHDG('ANT.OFF.VP')
     A            WMERK          5          COLHDG('MERKNAD')
     A            WSVEXR03      35A         COLHDG('ANDRE REF.')
     A            WAI            5S 0       COLHDG('ANT.AVS.I')
     A            WAII           5S 0       COLHDG('ANT.AVS.II')
     A            WAIII          5S 0       COLHDG('ANT.AVS.III')
     A            WAIV           5S 0       COLHDG('ANT.AVS.IV')
     A            WAV            5S 0       COLHDG('ANT.AVS.V')
     A            WAVI           5S 0       COLHDG('ANT.AVS.VI')
     A            WAVII          5S 0       COLHDG('ANT.AVS.VII')
     A            WAVIII         5S 0       COLHDG('ANT.AVS.VIII')
     A            WAIX           5S 0       COLHDG('ANT.AVS.IX')
     A            WAX            5S 0       COLHDG('ANT.AVS.X')
     A            WAXI           5S 0       COLHDG('ANT.AVS.XI')
     A            WAXII          5S 0       COLHDG('ANT.AVS.XII')
     A            WAXIII         5S 0       COLHDG('ANT.AVS.XIII')
     A            WAXIV          5S 0       COLHDG('ANT.AVS.XIV')
     A            WAXV           5S 0       COLHDG('ANT.AVS.XV')
     A            WAXVI          5S 0       COLHDG('ANT.AVS.XVI')
     A            WAXVII         5S 0       COLHDG('ANT.AVS.XVII')
     A            WAXVIII        5S 0       COLHDG('ANT.AVS.XVIII')
     A            WAXVIX         5S 0       COLHDG('ANT.AVS.XVIX')
     A            WAXX           5S 0       COLHDG('ANT.AVS.XX')
     A            WAXXI          5S 0       COLHDG('ANT.AVS.XXI')
