     A          R SADKAAR
     A            SADKAA02       5          COLHDG('Avsnitt')
     A            SADKAA03     128          COLHDG('Text')
     A          K SADKAA02
