     A          R SADKMCFR                   PFILE(SADKMCF)
     A          K MCPRO
     A          K MCAVD
     A          K MCTDN
     A          K MCCN
