     A          R SADKAPR
     A            SADKAP01       2          COLHDG('Kapittel')
     A            SADKAP02       5          COLHDG('Avsnitt')
     A          K SADKAP01
