      *__________________________________
      * SYSPED / Tolldekl. Import KURERMANIFEST (ITEM)
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADKMVFR
     A            MVST      R               REFFLD(ST)
     A                                      COLHDG('Status')
     A            MVCN      R               REFFLD(LI)
     A                                      COLHDG('Consignment nr')
     A            MVLI      R               REFFLD(LI)
     A                                      COLHDG('Linjenr')
     A            MVPRO     R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
      *
     A            MVBL          11S 2       COLHDG('Beløp')
     A            MVVOEC        17A         COLHDG('VOEC nr')
     A            MVVS          50A         COLHDG('Varebeskrivelse')
     A            MVVNT          8S 0       COLHDG('Tariffnr')
     A            MVVKTB         9S 3       COLHDG('Bruttvekt')
     A            MVVKTN         9S 3       COLHDG('Nettvekt')
     A            MVNT           5S 0       COLHDG('Antall kolli')
