     A          R SADVCNR                   PFILE(SADVCN)
     A          K SVCNR
     A          K SVAVD
     A          K SVTDN
     A          K SVLI
