********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12281 * 01 YBC PTF12 4 SIFFER PROSEDYRE
********************************************************************
      *#############################################################
      * OBS!!!  KOPI AV SADV FOR Å BEVARE OPPRINNELIG FORTOLLING
      *#############################################################
      *_____________________________________
      * SYSPED / Tolldekl. Import Varelinjer
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R SADVKOR
      *** SV01 = B ---> HENTE MERKE & NR. FRA B/L    120691
     A            SV01           1          COLHDG('*blanks')
     A            SVAVD     R               REFFLD(AVD)
     A            SVTDN     R               REFFLD(TDN)
     A            SVLI      R               REFFLD(LI5)
     A            SVDP      R               REFFLD(DP)
N01  A            SVDP2          2S 0       COLHDG('Siste 2 siffer pros')
     A            SVLK      R               REFFLD(LKA)
     A                                      COLHDG('Landk. oppr.land')
     A            SVVNT     R               REFFLD(VNT)
     A            SVTN      R               REFFLD(TN)
     A            SVPRE     R               REFFLD(PRE)
     A            SVAS           7S 2       COLHDG('TOLLSATS')
     A            SVPVA     R               REFFLD(PVA)
     A            SVMFR     R               REFFLD(MFR)
     A            SVVF      R               REFFLD(VF)
     A            SVVKTB        12S 3       COLHDG('Vekt Brutto')
     A            SVNTM          9S 0       COLHDG('MENGDE')
     A            SVBELT        13S 2       COLHDG('BELØP TOLLVERDI')
     A            SVBELS        13S 2       COLHDG('STAT. TOLLVERDI')
     A            SVVKTN        12S 3       COLHDG('Vekt Netto')
     A            SVFT01        28A         COLHDG('Merke & nr 1')
     A            SVFT02        28A         COLHDG('Merke & nr 2')
     A            SVFT03        28A         COLHDG('Merke & nr 3')
     A            SVFT04        28A         COLHDG('Merke & nr 4')
     A            SVFT05        28A         COLHDG('Merke & nr 5')
     A            SVFT06        28A         COLHDG('Merke & nr 6')
     A            SVFT07        28A         COLHDG('Merke & nr 7')
     A            SVNT01         6S 0       COLHDG('ANTALL 1')
     A            SVNT02         6S 0       COLHDG('ANTALL 2')
     A            SVNT03         6S 0       COLHDG('ANTALL 3')
     A            SVNT04         6S 0       COLHDG('ANTALL 4')
     A            SVNT05         6S 0       COLHDG('ANTALL 5')
     A            SVNT06         6S 0       COLHDG('ANTALL 6')
     A            SVNT07         6S 0       COLHDG('ANTALL 7')
     A            SVEH01    R               REFFLD(EH)
     A            SVEH02    R               REFFLD(EH)
     A            SVEH03    R               REFFLD(EH)
     A            SVEH04    R               REFFLD(EH)
     A            SVEH05    R               REFFLD(EH)
     A            SVEH06    R               REFFLD(EH)
     A            SVEH07    R               REFFLD(EH)
     A            SVVT01        30A         COLHDG('VARETEKST 1')
     A            SVVT02        30A         COLHDG('VARETEKST 2')
     A            SVVT03        30A         COLHDG('VARETEKST 3')
     A            SVVT04        30A         COLHDG('VARETEKST 4')
     A            SVVT05        30A         COLHDG('VARETEKST 5')
     A            SVCRE1         3          COLHDG('KOMMUNIKASJONREF. 1')
     A            SVCRE2         3          COLHDG('KOMMUNIKASJONREF. 2')
     A            SVCRE3         3          COLHDG('KOMMUNIKASJONREF. 3')
     A            SVCRE4         3          COLHDG('KOMMUNIKASJONREF. 4')
     A            SVCRE5         3          COLHDG('KOMMUNIKASJONREF. 5')
     A            SVCRE6         3          COLHDG('KOMMUNIKASJONREF. 6')
     A            SVCRE7         3          COLHDG('KOMMUNIKASJONREF. 7')
     A            SVCRE8         3          COLHDG('KOMMUNIKASJONREF. 8')
     A            SVCRE9         3          COLHDG('KOMMUNIKASJONREF. 9')
     A            SVCRE10        3          COLHDG('KOMMUNIKASJONREF. 10')
     A            SVTOA     R               REFFLD(TO22)
     A            SVTOB     R               REFFLD(TO23)
     A            SVTOP1        17A         COLHDG('KOMM.REF. 1')
     A            SVTOP2        17A         COLHDG('KOMM.REF. 2')
     A            SVTOP3        17A         COLHDG('KOMM.REF. 3')
     A            SVTOP4        17A         COLHDG('KOMM.REF. 4')
     A            SVTOP5        17A         COLHDG('KOMM.REF. 5')
     A            SVTOP6        17A         COLHDG('KOMM.REF. 6')
     A            SVTOP7        17A         COLHDG('KOMM.REF. 7')
     A            SVTOP8        17A         COLHDG('KOMM.REF. 8')
     A            SVTOP9        17A         COLHDG('KOMM.REF. 9')
     A            SVTOP10       17A         COLHDG('KOMM.REF. 10')
     A            SVAKD1    R               REFFLD(KDAV)
     A            SVAKD2    R               REFFLD(KDAV)
     A            SVAKD3    R               REFFLD(KDAV)
     A            SVAKD4    R               REFFLD(KDAV)
     A            SVAKD5    R               REFFLD(KDAV)
     A            SVAKD6    R               REFFLD(KDAV)
     A            SVAKD7    R               REFFLD(KDAV)
     A            SVAKD8    R               REFFLD(KDAV)
     A            SVASV1         3A         COLHDG('AVGIFTS SEKVENS 1')
     A            SVASV2         3A         COLHDG('AVGIFTS SEKVENS 2')
     A            SVASV3         3A         COLHDG('AVGIFTS SEKVENS 3')
     A            SVASV4         3A         COLHDG('AVGIFTS SEKVENS 4')
     A            SVASV5         3A         COLHDG('AVGIFTS SEKVENS 5')
     A            SVASV6         3A         COLHDG('AVGIFTS SEKVENS 6')
     A            SVASV7         3A         COLHDG('AVGIFTS SEKVENS 7')
     A            SVASV8         3A         COLHDG('AVGIFTS SEKVENS 7')
     A            SVABL1        13S 2       COLHDG('Avgift 1')
     A            SVABL2        13S 2       COLHDG('Avgift 2')
     A            SVABL3        13S 2       COLHDG('Avgift 3')
     A            SVABL4        13S 2       COLHDG('Avgift 4')
     A            SVABL5        13S 2       COLHDG('Avgift 5')
     A            SVABL6        13S 2       COLHDG('Avgift 6')
     A            SVABL7        13S 2       COLHDG('Avgift 7')
     A            SVABL8        13S 2       COLHDG('Avgift 8')
     A            SVAGR1        13S 2       COLHDG('Avgiftsgrunnlag 1')
     A            SVAGR2        13S 2       COLHDG('Avgiftsgrunnlag 2')
     A            SVAGR3        13S 2       COLHDG('Avgiftsgrunnlag 3')
     A            SVAGR4        13S 2       COLHDG('Avgiftsgrunnlag 4')
     A            SVAGR5        13S 2       COLHDG('Avgiftsgrunnlag 5')
     A            SVAGR6        13S 2       COLHDG('Avgiftsgrunnlag 6')
     A            SVAGR7        13S 2       COLHDG('Avgiftsgrunnlag 7')
     A            SVAGR8        13S 2       COLHDG('Avgiftsgrunnlag 8')
     A            SVASA1         7S 2       COLHDG('Toll og Avg.sats 1')
     A            SVASA2         7S 2       COLHDG('Toll og Avg.sats 2')
     A            SVASA3         7S 2       COLHDG('Toll og Avg.sats 3')
     A            SVASA4         7S 2       COLHDG('Toll og Avg.sats 4')
     A            SVASA5         7S 2       COLHDG('Toll og Avg.sats 5')
     A            SVASA6         7S 2       COLHDG('Toll og Avg.sats 6')
     A            SVASA7         7S 2       COLHDG('Toll og Avg.sats 7')
     A            SVASA8         7S 2       COLHDG('Toll og Avg.sats 8')
     A            SVEH21         1A         COLHDG('Satsenhet 1')
     A            SVEH22         1A         COLHDG('Satsenhet 2')
     A            SVEH23         1A         COLHDG('Satsenhet 3')
     A            SVEH24         1A         COLHDG('Satsenhet 4')
     A            SVEH25         1A         COLHDG('Satsenhet 5')
     A            SVEH26         1A         COLHDG('Satsenhet 6')
     A            SVEH27         1A         COLHDG('Satsenhet 7')
     A            SVEH28         1A         COLHDG('Satsenhet 8')
     A            SVPREÆ    R               REFFLD(PRE)
     A                                      COLHDG('OMBER. J=NY/S=SLETT')
     A            SVEH2Æ    R               REFFLD(EH1)
     A                                      COLHDG('Satsenhet')
     A            SVLN           5S 0       COLHDG('LINJENR')
     A            SVREFL         5S 0       COLHDG('ANT. TILL.LINJER')
     A            SVEXR01        5A         COLHDG('SYSTEM')
     A            SVEXR02       17A         COLHDG('EKSTERN REF.')
     A            SVEXR03       35A         COLHDG('ANDRE REF.')
     A            SVEXR04        9S 0       COLHDG('LINJENR')
     A            SVEXR05        5S 0       COLHDG('UNDERLINJENR')
     A            SVEXR06        3A         COLHDG('VALUTA')
     A            SVEXR07       11S 2       COLHDG('BELØP')
     A            SVEXR08       10A         COLHDG('MEMBER')
     A            SVERR          1          COLHDG('Error flag')
     A          K SVAVD
     A          K SVTDN
     A          K SVLI
