     A                                      REF(SR)
     A                                      UNIQUE
     A          R SADVXR
     A            SXAVD     R               REFFLD(AVD)
     A            SXTDN     R               REFFLD(TDN)
     A            SXLI      R               REFFLD(LI5)
     A            SXKUNS         1A         COLHDG('J/N KUNST')
     A          K SXAVD
     A          K SXTDN
     A          K SXLI
