      *__________________________________
      * SYSPED / JOIN-REGISTER (LOGISK)
      *""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A            SEFIF
     A            SEFID
     A            SEAVD
     A            SETDN
     A          K SEFIF
     A          K SEFID
     A          K SEAVD
     A          K SETDN
     A          O SEFID                     COMP(EQ 99999999)
      *
     A          R SADFR                     PFILE(SAEF)
     A            SFTXT
     A            SFDT
     A            SFAVD
     A            SFOPDN
     A          K SFTXT
     A          K SFDT
     A          K SFAVD
     A          K SFOPDN
      *
