     A*_____________________________________________
     A* SYSPED / Tolldeklarasjoner Import, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('TOLLD DATO')
     A          K SEDTG
