      *___________________________________________
      * SYSPED / Tolldeklarasjoner EKSPORT, SELGER
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEKNK
     A          K SEDT
     A          K SEAVD
     A          K SETDN
