      *___________________________________________
      * SYSPED / Tolldeklarasjoner EKSPORT, INNSTIKK
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEMI
     A          K SEAVD
     A          K SETDN
