     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, INNSTIKK
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEAVD
     A          K SEMI
