     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, SELGER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('SELGER')
     A          K SEAVD
     A          K SEKNK
     A          K SEDT
