      *___________________________________________
      * SYSPED / Tolldeklarasjoner EKSPORT, Regdato
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEDT
     A          K SEAVD
     A          K SETDN
