      *___________________________________________
      * SYSPED / Tolldeklarasjoner EKSPORT, STATUS
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEAVD
     A          K SEST
     A          S SETDN                     COMP(LT 0)
