     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K SEWS
     A          K SEST
