     A                                      REF(SR)
     A          R SAEHMOR
     A            SESTMO         1A         COLHDG('STATUS')
     A            SEAVD          4S 0       COLHDG('AVDELING')
     A            SETDN     R               REFFLD(TDN)
     A            SESG      R               REFFLD(SG)
     A            SEAVD_O        4S 0       COLHDG('AVDELING OPPR.')
     A            SETDN_O   R               REFFLD(TDN)
     A                                      COLHDG('OPPDRAGSNR OPPR.')
     A            SETLL1    R               REFFLD(TLL)
     A            SETLE1    R               REFFLD(TLE)
     A            SEDTG1    R               REFFLD(DTG)
     A            SETXT1        70A         COLHDG('BEGRUNNELSE 1')
     A            SETXT2        70A         COLHDG('BEGRUNNELSE 2')
     A            SETXT3        70A         COLHDG('BEGRUNNELSE 3')
     A            SETXT4        70A         COLHDG('BEGRUNNELSE 4')
     A            SETXT5        70A         COLHDG('BEGRUNNELSE 5')
     A          K SEAVD
     A          K SETDN
