     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, GODSNR.
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('GODSNR.')
     A          K SEGN
     A          K SEPOS
