     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEST
     A          K SEAVD
     A          K SETDN
