      *___________________________________________
      * SYSPED / Tolldeklarasjoner EKSPORT, KJØPER
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A          K SEKNS
     A          K SEDT
     A          K SEAVD
     A          K SETDN
