      *__________________________________
      * SYSPED / JOIN-REGISTER (LOGISK)
      *""""""""""""""""""""""""""""""""""
     A          R SAEVR1                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT01 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR2                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT02 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR3                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT03 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR4                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT04 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR5                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT05 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR6                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT06 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
     A          R SAEVR7                    PFILE(SAEV)
     A            SVMRK              I      SST(SVFT07 1 28)
     A            SVAVD
     A            SVTDN
     A          K SVAVD
     A          K SVMRK
     A          K SVTDN
      *
