     A          R SAEVCNR                   PFILE(SAEVCN)
     A          K SVCNR
     A          K SVAVD
     A          K SVTDN
     A          K SVLI
