********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12230 * 01 YBC PTF12 PREFERANSEKODE
12248 * 02 YBC PTF12 VEKT, KOLLI OG MENDE ER UTVIDET.
12258 * 03 YBC PTF12 VF-KODE FRA OG MED 01.12.2021
********************************************************************
      *#############################################################
      * OBS!!!  KOPI AV SADV FOR Å BEVARE OPPRINNELIG FORTOLLING
      *#############################################################
      *_____________________________________
      * SYSPED / Tolldekl. EKSPORT Varelinjer
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R SAEVKOR
      *** SV01 = B ---> HENTE MERKE & NR. FRA B/L    120691
     A            SV01           1          COLHDG('*blanks')
     A            SVAVD     R               REFFLD(AVD)
     A            SVTDN     R               REFFLD(TDN)
     A            SVLI      R               REFFLD(LI5)
     A            SVBELT        13S 2       COLHDG('BELØP TOLLVERDI')
     A            SVFYL          2          COLHDG('FYLKE')
     A            SVVNT     R               REFFLD(VNT)
     A            SVAVT          1          COLHDG('FERSK FISK')
     A            SVAVTS         3          COLHDG('AVG.SEKVENS')
     A            SVAVTP         7S 3       COLHDG('PROSENTSATS AV SVAVT')
S02  A*           SVVKTB        12S 3       COLHDG('Vekt Brutto')
S02  A*           SVVKTN        12S 3       COLHDG('Vekt Netto')
S02  A*           SVNTM          9S 0       COLHDG('MENGDE')
N02  A            SVVKTB        14S 3       COLHDG('Vekt Brutto')
N02  A            SVVKTN        14S 3       COLHDG('Vekt Netto')
N02  A            SVNTM         11S 0       COLHDG('MENGDE')
     A            SVCRE1         3          COLHDG('KOMMUNIKASJONREF. 1')
     A            SVCRE2         3          COLHDG('KOMMUNIKASJONREF. 2')
     A            SVCRE3         3          COLHDG('KOMMUNIKASJONREF. 3')
     A            SVCRE4         3          COLHDG('KOMMUNIKASJONREF. 4')
     A            SVCRE5         3          COLHDG('KOMMUNIKASJONREF. 5')
     A            SVCRE6         3          COLHDG('KOMMUNIKASJONREF. 6')
     A            SVCRE7         3          COLHDG('KOMMUNIKASJONREF. 7')
     A            SVCRE8         3          COLHDG('KOMMUNIKASJONREF. 8')
     A            SVCRE9         3          COLHDG('KOMMUNIKASJONREF. 9')
     A            SVCRE10        3          COLHDG('KOMMUNIKASJONREF. 10')
     A            SVTOA     R               REFFLD(TO22)
     A            SVTOB     R               REFFLD(TO23)
     A            SVTOP1        17A         COLHDG('KOMM.REF. 1')
     A            SVTOP2        17A         COLHDG('KOMM.REF. 2')
     A            SVTOP3        17A         COLHDG('KOMM.REF. 3')
     A            SVTOP4        17A         COLHDG('KOMM.REF. 4')
     A            SVTOP5        17A         COLHDG('KOMM.REF. 5')
     A            SVTOP6        17A         COLHDG('KOMM.REF. 6')
     A            SVTOP7        17A         COLHDG('KOMM.REF. 7')
     A            SVTOP8        17A         COLHDG('KOMM.REF. 8')
     A            SVTOP9        17A         COLHDG('KOMM.REF. 9')
     A            SVTOP10       17A         COLHDG('KOMM.REF. 10')
     A            SVFT01        28A         COLHDG('Merke & nr 1')
     A            SVFT02        28A         COLHDG('Merke & nr 2')
     A            SVFT03        28A         COLHDG('Merke & nr 3')
     A            SVFT04        28A         COLHDG('Merke & nr 4')
     A            SVFT05        28A         COLHDG('Merke & nr 5')
     A            SVFT06        28A         COLHDG('Merke & nr 6')
     A            SVFT07        28A         COLHDG('Merke & nr 7')
S02  A*           SVNT01         6S 0       COLHDG('ANTALL 1')
S02  A*           SVNT02         6S 0       COLHDG('ANTALL 2')
S02  A*           SVNT03         6S 0       COLHDG('ANTALL 3')
S02  A*           SVNT04         6S 0       COLHDG('ANTALL 4')
S02  A*           SVNT05         6S 0       COLHDG('ANTALL 5')
S02  A*           SVNT06         6S 0       COLHDG('ANTALL 6')
S02  A*           SVNT07         6S 0       COLHDG('ANTALL 7')
N02  A            SVNT01         9S 0       COLHDG('ANTALL 1')
N02  A            SVNT02         9S 0       COLHDG('ANTALL 2')
N02  A            SVNT03         9S 0       COLHDG('ANTALL 3')
N02  A            SVNT04         9S 0       COLHDG('ANTALL 4')
N02  A            SVNT05         9S 0       COLHDG('ANTALL 5')
N02  A            SVNT06         9S 0       COLHDG('ANTALL 6')
N02  A            SVNT07         9S 0       COLHDG('ANTALL 7')
     A            SVEH01    R               REFFLD(EH)
     A            SVEH02    R               REFFLD(EH)
     A            SVEH03    R               REFFLD(EH)
     A            SVEH04    R               REFFLD(EH)
     A            SVEH05    R               REFFLD(EH)
     A            SVEH06    R               REFFLD(EH)
     A            SVEH07    R               REFFLD(EH)
     A            SVVT01        30A         COLHDG('VARETEKST 1')
     A            SVVT02        30A         COLHDG('VARETEKST 2')
     A            SVVT03        30A         COLHDG('VARETEKST 3')
     A            SVVT04        30A         COLHDG('VARETEKST 4')
     A            SVVT05        30A         COLHDG('VARETEKST 5')
     A            SVLN           5S 0       COLHDG('LINJENR')
     A            SVREFL         5S 0       COLHDG('ANT. TILL.LINJER')
     A            SVEXR01        5A         COLHDG('SYSTEM')
     A            SVEXR02       17A         COLHDG('EKSTERN REF.')
     A            SVEXR03       35A         COLHDG('ANDRE REF.')
     A            SVEXR04        9S 0       COLHDG('LINJENR')
     A            SVEXR05        5S 0       COLHDG('UNDERLINJENR')
     A            SVEXR06        3A         COLHDG('VALUTA')
     A            SVEXR07       11S 2       COLHDG('BELØP')
     A            SVEXR08       10A         COLHDG('MEMBER')
     A            SVLK           2A         COLHDG('LK Oppr. internt')
     A            SVNYL          1A         COLHDG('NY LINJE I OMBER.')
     A            SVERR          1          COLHDG('Error flag')
N01  A            SVPRE     R               REFFLD(PRE)
N03  A            SVVF      R               REFFLD(VF)
     A          K SVAVD
     A          K SVTDN
     A          K SVLI
