     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(SIDUPB)
     A                                      TEXT('Avd+Opd+K/S')
     A          K FAAVD
     A          K FAOPD
     A          K FASK
     A          K FAFAKT
     A          K FACD11
