     A          R SVEFR
     A            SVEF_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVEF_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVEF_FATY      4          COLHDG('Fakturatyp')
     A            SVEF_FATX     35          COLHDG('Fakturanummer')
     A            SVEF_VAKD      3          COLHDG('Valutaslag, kod')
     A            SVEF_VAKU      7S 4       COLHDG('Valutaslag, kurs')
     A            SVEF_FABL     11S 3       COLHDG('Fakturabelopp')
     A            SVEF_TUID     10          COLHDG('Tullid')
     A          K SVEF_SYAV
     A          K SVEF_SYOP
     A          K SVEF_FATX
