     A          R SVLTHR
     A            SVLTH_H        1          COLHDG('Händelse')
      *                                             I=Inlägg
      *                                             U=Uttag
      *                                             R=Rättelse
      * Inlägg
     A            SVLTH_IRN     18          COLHDG('MRN')
     A            SVLTH_IGL      3          COLHDG('Godslokalkod')
     A            SVLTH_IGN     15          COLHDG('Godsnummer')
     A            SVLTH_POS      9          COLHDG('Position')
     A            SVLTH_IEX     15          COLHDG('Extern referans')
     A            SVLTH_IUS     10          COLHDG('Arkiv. användarid')
     A            SVLTH_ID1      8S 0       COLHDG('Arkiveringsdatum')
     A            SVLTH_IM1      6S 0       COLHDG('Arkiveringstid')
     A            SVLTH_ID2      8S 0       COLHDG('Ankomstdatum')
     A            SVLTH_IH1     35          COLHDG('Tidigare handling-1')
     A            SVLTH_IH2     35          COLHDG('Tidigare handling-2')
     A            SVLTH_IH3     35          COLHDG('Tidigare handling-2')
     A            SVLTH_IH4     35          COLHDG('Tidigare handling-2')
     A            SVLTH_IH5     35          COLHDG('Tidigare handling-2')
     A            SVLTH_INT      5S 0       COLHDG('Kollital')
     A            SVLTH_ISL      4          COLHDG('Kollislag')
     A            SVLTH_IBR     14S 3       COLHDG('Bruttovikt')
     A            SVLTH_IVB     70          COLHDG('Varubeskrivning')
     A            SVLTH_IVB2    70          COLHDG('Varubeskrivning-2')
     A            SVLTH_IVB3    70          COLHDG('Varubeskrivning-3')
     A            SVLTH_IVB4    70          COLHDG('Varubeskrivning-4')
     A            SVLTH_IVB5    70          COLHDG('Varubeskrivning-5')
     A            SVLTH_ITX     70          COLHDG('Information')
      * Uttag
     A            SVLTH_UEX     15          COLHDG('Extern referans')
     A            SVLTH_UD1      8S 0       COLHDG('Uttagsdatum')
     A            SVLTH_UM1      6S 0       COLHDG('Uttagstid')
     A            SVLTH_UTI     18          COLHDG('Tullid')
     A            SVLTH_UNT      5S 0       COLHDG('Kollital')
     A            SVLTH_UTX     70          COLHDG('Intern fritext')
      * Rättelse
     A            SVLTH_RTY      1          COLHDG('Typ av rättelse')
      *                                             A=Fel antal
      *                                             B=Befodran
     A            SVLTH_RRN     18          COLHDG('MRN')
     A            SVLTH_REX     15          COLHDG('Extern referans')
     A            SVLTH_RD2      8S 0       COLHDG('Ankomstdatum')
     A            SVLTH_RH1     35          COLHDG('Tidigare handling-1')
     A            SVLTH_RH2     35          COLHDG('Tidigare handling-2')
     A            SVLTH_RH3     35          COLHDG('Tidigare handling-2')
     A            SVLTH_RH4     35          COLHDG('Tidigare handling-2')
     A            SVLTH_RH5     35          COLHDG('Tidigare handling-2')
     A            SVLTH_RNT      5S 0       COLHDG('Kollital')
     A            SVLTH_RSL      4          COLHDG('Kollislag')
     A            SVLTH_RBR     14S 3       COLHDG('Bruttovikt')
     A            SVLTH_RVB     70          COLHDG('Varubeskrivning')
     A            SVLTH_RVB2    70          COLHDG('Varubeskrivning-2')
     A            SVLTH_RVB3    70          COLHDG('Varubeskrivning-3')
     A            SVLTH_RVB4    70          COLHDG('Varubeskrivning-4')
     A            SVLTH_RVB5    70          COLHDG('Varubeskrivning-5')
     A            SVLTH_RTX     70          COLHDG('Information')
     A            SVLTH_RUD1     8S 0       COLHDG('Uttagsdatum')
     A            SVLTH_RUM1     6S 0       COLHDG('Uttagstid')
     A            SVLTH_RUTI    18          COLHDG('Tullid')
