     A          R SVLTUR
     A            SVLTU_IGL      3          COLHDG('Godslokalkod')
     A            SVLTU_IGN     15          COLHDG('Godsnummer')
     A            SVLTU_POS      9          COLHDG('Position')
     A            SVLTU_UHA     35          COLHDG('Utgående handling')
