     A          R SVLTFR
     A            SVLTF_IGL      3          COLHDG('Godslokalkod')
     A            SVLTF_TXT     30          COLHDG('Benämning')
     A            SVLTF_AAR      2S 0       COLHDG('Årstal räknare GN')
     A            SVLTF_NUM      4S 0       COLHDG('Räknare godsnummer')
