     A*___________________________________________
     A* SYSPED / Tolldekl. TULL-ID
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVNHR                     PFILE(SVNH)
     A          K TITUID
