     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, NÄRINGSLIV
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVNHR                     PFILE(SVNH)
     A          K TIAVD
     A          K TIKN
     A          K TIDT
