     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVNHR                     PFILE(SVNH)
     A          K TIAVD
     A          K TIST
