     A*_______________________________________________
     A* SYSPED / TET-IMPORT, VARELINJE LOSSETILLATELSE
     A*"""""""""""""""""""""""""""""""""""""""""""""""
     A          R SVNLR                     PFILE(SVNL)
     A          K TVAVD
     A          K TVTDN
     A          K TVVNT
     A          K TVDK
