     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, KJØPER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHR                     PFILE(SVXH)
     A          K THAVD
     A          K THKNK
     A          K THDT
