     A*___________________________________________
     A* SYSPED / Tolldekl. TULL-ID
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHR                     PFILE(SVXH)
     A          K THTUID
