     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SELGER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHR                     PFILE(SVXH)
     A          K THAVD
     A          K THKNS
     A          K THDT
