     A                                      REF(SR)
     A          R SVXVIR
     A            ITVAVD         4S 0       COLHDG('AVDELNING')
     A            ITVTDN         7S 0       COLHDG('ÄRENDENUMMER')
     A            ITVLI          3S 0       COLHDG('HOUSENUMMER')
     A            ITVITN         4S 0       COLHDG('ITEMNUMMER')
     A            ITVVT         48A         COLHDG('VARUBESKRIVNING')
     A            ITVVKTB       11S 3       COLHDG('Bruttovikt')
     A            ITVVKTN       11S 3       COLHDG('Nettovikt')
     A            ITVALK         2A         COLHDG('AVSENDERSLAND')
     A            ITVBLK         2A         COLHDG('BESTEMMELSESLAND')
     A            ITVTDT         4A         COLHDG('40 TIDLIGERE DOK.TYP')
     A            ITVTDR        70A         COLHDG('40 TIDLIGERE DOK.REF')
     - PREVIOUS DOCUMENT.Goods item number n..5
     - PREVIOUS DOCUMENT.Type of packages an2
     - PREVIOUS DOCUMENT.Number of packages n..8
     - PREVIOUS DOCUMENT.Measurement unit and qualifier an..4
     - PREVIOUS DOCUMENT.Quantity n..16,6
     - PREVIOUS DOCUMENT.Complement of information an..35
     - PREVIOUS DOCUMENT.Complete control n1
     - SUPPORTING DOCUMENT.Sequence number n..5
     - SUPPORTING DOCUMENT.Type an4
     A            ITVTDO        70A         COLHDG('40 UTFYLT OPPLYSN.')
     - SUPPORTING DOCUMENT.Document line item number n..5
     - SUPPORTING DOCUMENT.Complement of information an..35
     - SUPPORTING DOCUMENT.Complete control n1
     A            ITVDTY         4A         COLHDG('44 DOKUMENTTYP')
     A            ITVDREF       20A         COLHDG('44 DOKUMENTREF.')
     A            ITVMTXT       48A         COLHDG('44 MERKNADER')
     A            ITVTLO         5A         COLHDG('44 TILLEGGSOPPL.')
     A            ITVMN         17A         COLHDG('31 MERKE & NR')
     A            ITVEH          2A         COLHDG('31 PAKKTYPE')
     A            ITVNT          8S 0       COLHDG('31 ANTALL KOLLI')
     A            ITVFV          2A         COLHDG('FØLSOMME VARE KODE')
     A            ITVFVNT       11S 3       COLHDG('MENGDE PÅ F.VARE')
     - COMMODITY - COMMODITY CODE.Harmonized System subheading code an6
     - COMMODITY - COMMODITY CODE.Combined nomenclature code an2
     Declaration type an..5
     Reference number UCR an..70
     Release type n1
     Reference number UCR an..35
     - CONSIGNEE.Identification number an..17
     - CONSIGNEE.Name an..70
     - CONSIGNEE - ADDRESS Address
     - CONSIGNEE - ADDRESS.Street and number an..70
     - CONSIGNEE - ADDRESS.Postcode an..17
     - CONSIGNEE - ADDRESS.City an..35
     - CONSIGNEE - ADDRESS.Country a2
     - ADDITIONAL SUPPLY CHAIN ACTOR.Sequence number n..5
     - ADDITIONAL SUPPLY CHAIN ACTOR.Role a..3
     - ADDITIONAL SUPPLY CHAIN ACTOR.Identification number an..17
     - COMMODITY.Description of goods an..512
     - COMMODITY.CUS code an9
     - COMMODITY - DANGEROUS GOODS.Sequence number n..5
     - COMMODITY - DANGEROUS GOODS.UN Number an4
     - COMMODITY - GOODS MEASURE.Supplementary units n..16,6
     - PACKAGING.Shipping marks an..512 shippingMarks
     - TRANSPORT DOCUMENT.Sequence number n..5
     - TRANSPORT DOCUMENT.Type an4
     - TRANSPORT DOCUMENT.Reference number an..70
     - ADDITIONAL REFERENCE.Sequence number n..5
     - ADDITIONAL REFERENCE.Type an4
     - ADDITIONAL REFERENCE.Reference number an..70
     - ADDITIONAL INFORMATION.Sequence number n..5
     - ADDITIONAL INFORMATION.Code an5
     - ADDITIONAL INFORMATION.Text an..512
     - ADDITIONAL INFORMATION.Complete control n1
     - TRANSPORT DOCUMENT.Sequence number n..5
     - TRANSPORT DOCUMENT.Type an4
     - TRANSPORT DOCUMENT.Reference number an..70
     - ADDITIONAL REFERENCE.Sequence number n..5
     - ADDITIONAL REFERENCE.Type an4
     - ADDITIONAL REFERENCE.Reference number an..70
     - ADDITIONAL INFORMATION.Sequence number n..5
     - ADDITIONAL INFORMATION.Code an5
     - ADDITIONAL INFORMATION.Text an..512
     - ADDITIONAL INFORMATION.Complete control n1
     - TRANSPORT CHARGES TransportCharges
     - TRANSPORT CHARGES.Method of payment a1
     A          K ITVAVD
     A          K ITVTDN
     A          K ITVLI
     A          K ITVITN
