     A*__________________________________________
     A* SYSPED / Tolldekl. TRANSITT VARELINJE (VARENR.)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SVXVR                     PFILE(SVXV)
     A          K TVVNT
