     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner TRANSIT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SVXVR                     PFILE(SVXV)
     A          K TVDREF
