********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12229 * 01 YBC PTF12 LAG EHF PÅ FAKTURA SOM VAR LAGET FOR EHF-SETTING PÅ KUNDE.
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  1  5'SYBO20FM'
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(040 DIV1629 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  5MSGCON(012 DIV0050 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  5 18DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
N01  A                                  7  5'Skape EHF?:'
N01  A            WSEHF          1A  B  7 18DSPATR(UL)
N01  A                                      COLOR(YLW)
N01  A                                      VALUES(' ' 'J' 'N')
N01  A                                  7 20'(J/N)'
     A                                  9  5MSGCON(040 DIV1630 *LIBL/SYMSGF)
     A                                 10  7'01'
     A                                 10 15'02'
     A                                 10 23'03'
     A                                 10 31'04'
     A                                 10 39'05'
     A                                 10 47'06'
     A                                 10 55'07'
     A            WSFN1          7Y 0B 11  5DSPATR(UL)
N01  A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN2          7Y 0B 11 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN3          7Y 0B 11 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN4          7Y 0B 11 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN5          7Y 0B 11 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN6          7Y 0B 11 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN7          7Y 0B 11 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  7'08'
     A                                 12 15'09'
     A                                 12 23'10'
     A                                 12 31'11'
     A                                 12 39'12'
     A                                 12 47'13'
     A                                 12 55'14'
     A            WSFN8          7Y 0B 13  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN9          7Y 0B 13 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN10         7Y 0B 13 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN11         7Y 0B 13 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN12         7Y 0B 13 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN13         7Y 0B 13 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN14         7Y 0B 13 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 14  7'15'
     A                                 14 15'16'
     A                                 14 23'17'
     A                                 14 31'18'
     A                                 14 39'19'
     A                                 14 47'20'
     A                                 14 55'21'
     A            WSFN15         7Y 0B 15  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN16         7Y 0B 15 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN17         7Y 0B 15 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN18         7Y 0B 15 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN19         7Y 0B 15 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN20         7Y 0B 15 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN21         7Y 0B 15 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 16  7'22'
     A                                 16 15'23'
     A                                 16 23'24'
     A                                 16 31'25'
     A                                 16 39'26'
     A                                 16 47'27'
     A                                 16 55'28'
     A            WSFN22         7Y 0B 17  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN23         7Y 0B 17 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN24         7Y 0B 17 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN25         7Y 0B 17 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN26         7Y 0B 17 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN27         7Y 0B 17 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN28         7Y 0B 17 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  7'29'
     A                                 18 15'30'
     A            WSFN29         7Y 0B 19  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFN30         7Y 0B 19 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 21  5MSGCON(025 SHU0511 *LIBL/SYMSGF)
     A            WSFRA          7Y 0B 21 32EDTCDE(4)
     A  70                                  DSPATR(RI PC)
     A            WSTIL          7Y 0B 21 42EDTCDE(4)
     A                                 23  5MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A  30        YFN            7Y 0O 24 73COLOR(RED)
     A            MSGNR          7A  P
