     A          R SYCASS1FR
     A            KAFNR         13          COLHDG('Fakturanr')
     A            KABNR          7S 0       COLHDG('Bilagsnr')
     A            MAWBNOF       12          COLHDG('Mawbnr')
     A            MORIGN         3A         COLHDG('Fra')
     A            MDEST          3A         COLHDG('Til')
     A            WWHGCP         9S 2       COLHDG('Weight_val')
     A            WDACHC         9S 2       COLHDG('Collect')
     A            WDISC          9S 2       COLHDG('Commisjon')
     A            WKABL          9S 2       COLHDG('Beløp')
     A            WEAVD          4S 0       COLHDG('Avd')
     A            WEOPD          7S 0       COLHDG('Opdnr')
     A            WMARK1        20          COLHDG('Merknader')
     A            WMARK2        20          COLHDG('Merknader')
     A            WBUDSJ         9S 2       COLHDG('Budsjett')
     A            WBUDSD         9S 2       COLHDG('Differanse')
     A            WWHGGR         6S 1       COLHDG('Vekt')
     A            WDCCHP         9S 2       COLHDG('Other_airl')
     A            WDISC2         9S 2       COLHDG('Incentive')
     A            WTAXD          9S 2       COLHDG('VAT')
     A            WFAKT          9S 2       COLHDG('Fakturert')
     A            WFAKTD         9S 2       COLHDG('Differanse')
