     A          R SYDRSBSJNR
     A            SYSBS         10          COLHDG('SBS')
     A            SYLIB         10          COLHDG('BIBLIOTEK')
     A            SYJOBN         6          COLHDG('JOBNR')
     A            SYSTDT         8S 0       COLHDG('START DATO')
     A            SYSTKL         6S 0       COLHDG('START KLOKKA')
     A            SYAKTI         1A         COLHDG('AKTIV')
     A            SYSTR          1A         COLHDG('STARTTE J/N')
     A            SYDAG          1A         COLHDG('DAGLIG START')
     A          K SYSBS
     A          K SYJOBN
