     A          R SYDRSTATR
     A            PRTKOD         4          COLHDG('PRTKOD')
     A            TEXT         132          COLHDG('TEKST')
