     A          R SYDRUSRFR
     A            FIRMA         30          COLHDG('FIRMANAVN')
     A            GRENSE         4S 2       COLHDG('GRENSE DISKLAGRING')
     A            ARUS1         10          COLHDG('BRUKER 1')
     A            AREP1         70          COLHDG('EPOST 1')
     A            ARUS2         10          COLHDG('BRUKER 2')
     A            AREP2         70          COLHDG('EPOST 2')
     A            ARUS3         10          COLHDG('BRUKER 3')
     A            AREP3         70          COLHDG('EPOST 3')
     A            ARUS4         10          COLHDG('BRUKER 4')
     A            AREP4         70          COLHDG('EPOST 4')
     A            ARUS5         10          COLHDG('BRUKER 5')
     A            AREP5         70          COLHDG('EPOST 5')
