********************************************************************
     A* Stringkode linje 1/2
     A          R CMRH1
     A            KFMT1         75      1  1
     A          R CMRH2
     A            KFMT2         75      2  1
      * SELVE CMR-BREVET
     A          R CMR
      * 52N53 SKAL ERSTATTES AV STRINGKODE MED SENDNR INNFLETTET.
      *            (SE SYFA12)
     A N49                              2  3'Trip No:'
     A N49        HEPRO          8  0   2 11
     A N50                              2 20'Truck No:'
     A N50        TUBILN        10      2 29
     A N51                              2 40'Ref No:'
     A N51        HEAVD          4  0   2 47
     A N51                              2 51'/'
     A N51        HEOPD          7  0   2 52
     A N51                              2 59'/'
     A N51        HESG           3      2 60
     A            ANAVN         30      4 11
     A            AADR1         30      5 11
     A            AADR2         30      6 11
     A            TUNAT         30      6 47
     A N46        HELKS          2      7 11
     A N46                              7 13'-'
     A N46        AADR3         30      7 14
     A  46        AADR3X        30      7 11
     A            TUAD1T        30      7 47
     A                                  8 11'Custno:'
     A            HEKNS          8  0   8 19
     A            TUAD2T        30      8 47
     A            TUAD3T        30      9 47
     A            DCNAM         30     10 11
      * BARCODE VED FAX/PDF-ARKIV / PDF-PRINT - SAMT AFP
     A  52        SNDNR         20     10 50BARCODE(CODE128 2 *HRI *HRZ +
     A                                      (*WIDTH 0.018) (*RATIO 3) X'02')
     A            DCADM1        30     11 11
     A            DCADM2        30     12 11
     A N47        HELKK          2     13 11
     A N47                             13 13'-'
     A N47        DCADM3        30     13 14
     A  47        DCADM3X       30     13 11
     A N48                             14 11'Custno:'
     A N48        HEKNK          8  0  14 19
     A            DCR13A        30     14 47
     A            DCR13B        30     15 47
     A            DCR13C        30     16 47
     A            DCNAL         30     17 11
     A            DCR13D        30     17 47
     A            DCADL1        30     18 11
     A  99 98                          18 47'LINJEDEKLARERT:       '
     A  99N98                          18 47'LINJEDEKLARERT  ID.NR:'
     A  99N98     FIRG          11     18 69
     A            DCADL2        30     19 11
     A  99                             19 47'Eks.enh:'
     A  99        HETLE          6     19 55
     A  99                             19 62'Løpenr:'
     A  99        HETLL         10     19 69
     A            DCADL3        30     20 11
     A            FRA1B         18     22 11
     A            XCDT           6  0  22 34EDTCDE(Y)
     A            DCVL1         30     22 47
     A            DCVL2         30     23 47
     A            DCVL3         30     24 47
     A            TIL1          18     25 13
     A          R CMR1
     A            HEGM1         15     30 11
     A            HENT           7  0  30 27EDTCDE(Z)
     A            HEVS1         25     30 35
     A            HEVKT          9  0  30 61EDTCDE(Z)
     A N44        HEM3           7  3  30 72EDTCDE(3)
     A            HEGM2         15     31 11
     A            HEVS2         25     31 35
     A N45        HELM           4  2  31 72EDTCDE(3)
     A N45                             31 77'LM'
     A          R VARELI0                   SKIPB(28)
     A          R VARELI                    SPACEB(1)
     A                                      FONT(416 (*POINTSIZE 10))
     A            R33MRK        18        11
     A            R34ANT         7  0     27EDTCDE(Z)
     A            R35VSL        23        35
     A            R36VKT         9  0     61EDTCDE(Z)
     A            FVVOL          7  3     72EDTCDE(4)
      *
     A          R VARELIT                   SPACEB(1)
     A                                      FONT(416 (*POINTSIZE 10))
     A  77                                11'TOTALS:'
     A                                      HIGHLIGHT
     A  77        HENT           7  0     27EDTCDE(Z)
     A  77        HEVKT          9  0     61EDTCDE(Z)
     A  77
     AAN44        HEM3           7  3     72EDTCDE(3)
     A N45        HELM           4  2     72EDTCDE(3)
     A                                      SPACEB(1)
     A N45                                77'LM'
N27  A          R VARELIC                   SPACEB(1)
N27  A                                    11'* Continues next page *'
     A          R VARELI1
     A                                      FONT(416 (*POINTSIZE 12))
     A                                    11'________________________'
     A                                      FONT(416 (*POINTSIZE 12))
     A                                    35'________________________'
     A                                      FONT(416 (*POINTSIZE 12))
     A                                    59'________________________'
     A                                      FONT(416 (*POINTSIZE 12))
     A          R CMR2
     A            XDCAI150      50     39 11FONT(223)
     A            XDCAI250      50     40 11FONT(223)
     A            XDCAI350      50     41 11FONT(223)
     A            XDCAI450      50     42 11FONT(223)
     A            XDCAI550      50     43 11FONT(223)
     A            XDCAI650      50     44 11FONT(223)
     A            DCFR           3     46 11
     A            DCFRFT        26     46 15
      * TO LINJER NED FRA HER
     A            DCFT          50     52 11
     A N90        DCVAL          3     52 68
     A N90        DCBEL          6  0  52 74EDTCDE(Z)
     A  90        TRETTB        13  2  52 66EDTCDE(3)
     A  90        TRETTV         3     52 65
     A            DCR12A        30     54 11
     A            DCR12B        30     55 11
     A            DCR12C        30     56 11
      * TO LINJER NED SLUTT
     A            FRA1          18     62 11
     A            FRA1X         18     62 35
     A            XCDTB          6  0  63 24EDTCDE(Y)
     A            XCDTC          6  0  63 48EDTCDE(Y)
      *
      * Stringkode bunn
     A          R CNRH3                     SKIPB(62)
     A            KFMT3         75         1
     A          R OVL
     A                                      ENDPAGE
     A                                      OVERLAY(&FB01 0 0)
     A            FB01           8A  P
      *
