     A*%%TS  SD  20170523  080051  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLSTED' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20170523  052945  SVEIN       REL-V7R1M0  5770-WDS
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A            ENHETF0        7   O  5  9
     A            ENHETT0        7   O  5 20
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20170523  052945  SVEIN       REL-V7R1M0  5770-WDS
     A  *DS3                                SFLSIZ(0016)
     A  *DS4                                SFLSIZ(0016)
     A  *DS3                                SFLPAG(0015)
     A  *DS4                                SFLPAG(0015)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYFA100'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU1719 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            W0004         35   O  2  3
     A            ZRECNO         4S 0O  3 70SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(040 SHU1721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WNAVN         30   O  2 39
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(010 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 15MSGCON(010 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 30MSGCON(010 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 45MSGCON(010 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 60MSGCON(012 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VARELI
     A*%%TS  SD  20170523  080051  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      CF04(04 'Søk ENHETSKODE')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A            WENHF          7A  B  2  9
     A            WENHT          7A  B  2 20
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A                                  1  2MSGCON(040 SHU1721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3 22MSGCON(018 SHU1728 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VAREL2
     A*%%TS  SD  20170523  052945  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1 12MSGCON(040 SHU1721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(015 DIV1147 *LIBL/SYMSGF)
     A            W2ENHF         7   B  2 18
     A            W2ENHT         7   B  2 29
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A          R VAREL3
     A*%%TS  SD  20170523  052945  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  6MSGCON(040 SHU1721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            ENHETF0        7   O  2 13
     A            ENHETT0        7   O  2 24
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A          R NYKUNDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYFA100'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU1719 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            W0004         35   O  2  3
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(040 SHU1721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WNAVN         30   O  2 39
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R BILDE1
     A*%%TS  SD  20170523  052945  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF04(04 'Søk PART')
     A                                      CF12(03)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1 19MSGCON(040 SHU1719 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                 11  2MSGCON(038 EDI0028 *LIBL/SYMSGF)
     A            W0004         35   B 11 42
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  1  2'SYSPED/SYFA100'
     A                                      COLOR(BLU)
     A                                 12  2MSGCON(040 SHU1720 *LIBL/SYMSGF)
