     A          R SYFA37XLR
     A            HESG           3A         COLHDG('Sign')
     A            HEAVD          4S 0       COLHDG('Avd')
     A            HEOPD          7S         COLHDG('Opdnr')
     A            HEST           1A         COLHDG('Status')
     A            HEOT           2A         COLHDG('Opdtyp')
     A            HEFR           3A         COLHDG('Frankatur')
     A            HEGN          15A         COLHDG('Godsnr')
     A            HEHAWB         9A         COLHDG('Bilnr')
     A            HENAK         30A         COLHDG('Kundanavn')
     A            HENT           7S 0       COLHDG('Antall')
     A            HEVKT          9S 0       COLHDG('Vekt')
     A            UDT13          6S 0       COLHDG('Dato')
     A            TSTMND         2S 0       COLHDG('Mnd')
     A            TSTAAR         2S 0       COLHDG('Aar')
     A            XBL            9S 0       COLHDG('Beløp')
