     A*%%TS  SD  20170919  091319  JOVO        REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 TOLLSTEDSKODE ER ENDRET TIL 4.0
10XXXA* 02 YBC PTF10 TILLEGGS PRODUKTKODER
xxxxxA*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXXA* 03 YBC PTF11 BILDE02 MANGLER F7
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYFI10APNL)
     A                                      HLPTITLE('FRAKTBREV')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A*%%TS  SD  20151023  142755  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF02(02 'SLETT DUP')
     A N31                                  CF03(03 'Avslutt')
     A                                      CF04(04 'Søke kundenr.')
     A N31                                  CF05(05 'Videre')
     A                                      CF07(07 'Kont.oppl')
     A                                      CF08(08 'BEREGNE FRAKT')
     A N31                                  CF09(09 'Neste fraktbrev')
     A                                      CF10(10 'Varelinjer')
     A                                      CF11(11 'DUP')
     A                                      CF12(12 'Avbryt')
     A                                      CF13(13 'MERKE')
     A N31                                  CF16(16 'Neste posisjon')
     A                                      CF17(17 'Rubrikk 36')
     A                                      CF18(18 'Rubrikk 29')
     A                                      CF19(19 'SEND FAX')
     A                                      CF20(20 'ANENN FRAKTBET')
     A                                      CF21(21 'FARLIG GODS')
     A                                      CF22(22 'SE EDI-LOGG')
     A                                      CF23(23 'DROPP EDI-TEST')
     A                                      CF24(24 'FLERE TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SYFI10A010 SYFI10APNL)
     A  *DS3                                HLPARA(01 001 02 080)
     A  *DS4                                HLPARA(01 001 02 080)
     A          H                           HLPPNLGRP(SYFI10A020 SYFI10APNL)
     A  *DS3                                HLPARA(03 001 03 009)
     A  *DS4                                HLPARA(03 001 03 009)
     A          H                           HLPPNLGRP(SYFI10A030 SYFI10APNL)
     A  *DS3                                HLPARA(03 010 03 028)
     A  *DS4                                HLPARA(03 010 03 028)
     A          H                           HLPPNLGRP(SYFI10A040 SYFI10APNL)
     A  *DS3                                HLPARA(03 029 03 080)
     A  *DS4                                HLPARA(03 029 03 080)
     A          H                           HLPPNLGRP(SYFI10A050 SYFI10APNL)
     A  *DS3                                HLPARA(04 001 06 080)
     A  *DS4                                HLPARA(04 001 06 080)
     A          H                           HLPPNLGRP(SYFI10A060 SYFI10APNL)
     A  *DS3                                HLPARA(07 001 08 080)
     A  *DS4                                HLPARA(07 001 08 080)
     A          H                           HLPPNLGRP(SYFI10A070 SYFI10APNL)
     A  *DS3                                HLPARA(09 001 09 080)
     A  *DS4                                HLPARA(09 001 09 080)
     A          H                           HLPPNLGRP(SYFI10A080 SYFI10APNL)
     A  *DS3                                HLPARA(10 001 10 080)
     A  *DS4                                HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(SYFI10A090 SYFI10APNL)
     A  *DS3                                HLPARA(11 001 11 080)
     A  *DS4                                HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(SYFI10A100 SYFI10APNL)
     A  *DS3                                HLPARA(12 001 12 048)
     A  *DS4                                HLPARA(12 001 12 048)
     A          H                           HLPPNLGRP(SYFI10A110 SYFI10APNL)
     A  *DS3                                HLPARA(12 049 12 080)
     A  *DS4                                HLPARA(12 049 12 080)
     A          H                           HLPPNLGRP(SYFI10A120 SYFI10APNL)
     A  *DS3                                HLPARA(13 001 13 033)
     A  *DS4                                HLPARA(13 001 13 033)
     A          H                           HLPPNLGRP(SYFI10A130 SYFI10APNL)
     A  *DS3                                HLPARA(13 034 13 080)
     A  *DS4                                HLPARA(13 034 13 080)
     A          H                           HLPPNLGRP(SYFI10A140 SYFI10APNL)
     A  *DS3                                HLPARA(14 001 16 080)
     A  *DS4                                HLPARA(14 001 16 080)
     A          H                           HLPPNLGRP(SYFI10A150 SYFI10APNL)
     A  *DS3                                HLPARA(17 001 17 080)
     A  *DS4                                HLPARA(17 001 17 080)
     A          H                           HLPPNLGRP(SYFI10A160 SYFI10APNL)
     A  *DS3                                HLPARA(18 001 18 080)
     A  *DS4                                HLPARA(18 001 18 080)
     A          H                           HLPPNLGRP(SYFI10A170 SYFI10APNL)
     A  *DS3                                HLPARA(19 001 20 080)
     A  *DS4                                HLPARA(19 001 20 080)
     A          H                           HLPPNLGRP(SYFI10A190 SYFI10APNL)
     A  *DS3                                HLPARA(21 001 21 048)
     A  *DS4                                HLPARA(21 001 21 048)
     A          H                           HLPPNLGRP(SYFI10A180 SYFI10APNL)
     A  *DS3                                HLPARA(21 049 21 080)
     A  *DS4                                HLPARA(21 049 21 080)
     A          H                           HLPPNLGRP(SYFI10A999 SYFI10APNL)
     A  *DS3                                HLPARA(22 001 24 080)
     A  *DS4                                HLPARA(22 001 24 080)
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGLN5         7A  P
     A            MSGLN6         7A  P
     A            MSGLN7         7A  P
     A            MSGLN8         7A  P
     A            MSGNR          7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYFI10A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(013 SHU0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSSNDA         2Y 0B  1 34EDTCDE(4)
     A                                      COLOR(RED)
     A  87                                  DSPATR(PR)
     A            WSSNDB         5Y 0B  1 37EDTCDE(4)
     A  87                                  DSPATR(PR)
     A                                      COLOR(RED)
     A            WSSNDN        10Y 0B  1 43COLOR(RED)
     A  87                                  DSPATR(PR)
     A            UAVD           4Y 0O  1 54EDTCDE(4)
     A                                      COLOR(WHT)
     A            UOPD           7Y 0O  1 59EDTCDE(4)
     A                                      COLOR(WHT)
     A            UFBNR          3Y 0O  1 67EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(006 DIV0151 *LIBL/SYMSGF)
     A            WSST           1A  B  2  9TEXT('Status')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 11MSGCON(010 DIV0152 *LIBL/SYMSGF)
     A            WSKDME         1A  B  2 22TEXT('Merkelapp  /X')
     A                                      DSPATR(UL)
     A  94                                  DSPATR(RI)
     A N51                                  COLOR(YLW)
     A  51                                  COLOR(WHT)
     A            WSMANT         4Y 0B  2 24EDTCDE(4)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSKDE          1A  B  2 43TEXT('Etterkrav  /X')
     A                                      DSPATR(UL)
     A                                      VALUES(' ' 'X')
     A                                      COLOR(YLW)
     A                                  2 46MSGCON(008 DIV0131 *LIBL/SYMSGF)
     A            WSSIGN         3A  B  2 55
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
S01  A*                                 2 60'Tollst'
S01  A*           WSTOLL         2Y 0B  2 67TEXT('Tollsted')
     A                                  2 60'T.std'
     A            WSTOLL         4Y 0B  2 66TEXT('Tollsted')
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  3 11'EDIfact ?'
     A            WSCMN     R        B  3 22REFFLD(DOKUFR/DFCMN *LIBL/DOKUF)
     A                                      VALUES(' ' 'Y' 'N')
     A                                      COLOR(YLW)
     A                                  3 24'Y/N'
     A                                  3 30'Ventekode'
     A            WSVEN     R        B  3 43REFFLD(DOKUFR/DFVEN *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A            DUPINT        12A  O  3 45COLOR(WHT)
     A                                  3 58'17.Utst.dato'
     A            WSDTU          6Y 0O  3 71COLOR(WHT)
     A                                      EDTWRD('  .  .  ')
     A                                  4  2'01.Sender'
     A            WSKNSS         8Y 0B  4 12TEXT('Kundenr Sender')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4 21'15.Knr hos tr.'
     A            WSKNS         12A  B  4 36TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  4 49'16.Senders ref'
     A            WSSREF        17A  B  4 64TEXT('Senders ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNAVS        30A  B  5  2COLOR(YLW)
     A                                  5 49'18.Booking ref'
     A            WSBREF        17A  B  5 64TEXT('Booking ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1S        30A  B  6  2COLOR(YLW)
     A                                  6 36'Oppr. avsender/Fakturasender'
     A            SLDUPTXT      16A  O  6 65COLOR(BLU)
     A            WSPNLS    R        B  7  2REFFLD(DOKUFR/DFPNLS *LIBL/DOKUF)
     A                                      EDTWRD('    ')
     A                                      COLOR(PNK)
     A            WSAD3S        25A  B  7  7COLOR(YLW)
     A            WSFASE        25A  B  7 36COLOR(YLW)
     A                                  8  2'04.Mottak'
     A            WSKNSM         8Y 0B  8 12TEXT('Kundenr Sender')
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  8 21'23.Knr hos tr.'
     A            WSKNM         12A  B  8 36TEXT('Kundenr Mottaker')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  8 49'25.Mottak. ref'
     A            WSMREF        17A  B  8 64TEXT('Mottak. ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNAVM        30A  B  9  2TEXT('Navn Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 41'07.Lever.'
     A            WSNAVL        30A  B  9 51TEXT('Navn Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1M        30A  B 10  2TEXT('Adresse Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1L        30A  B 10 51TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3M        30A  B 11  2TEXT('P-adr Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 41'09.UTL.st'
     A            WSPOUL    R        B 11 51REFFLD(DOKUFR/DFPOUL *LIBL/DOKUF)
     A                                      EDTWRD('    ')
     A                                      COLOR(PNK)
     A            WSADUL        25A  B 11 56TEXT('Utleveringssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2'28.Belast'
     A            WSBELA         1A  B 12 12TEXT('Sender bet henting')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'S' 'M' 'A')
     A                                 12 14'S/M/A'
S02  A*                                12 56'F7=Kontaktopplysninger'
     A                                 12 21'F7=Kontaktoppl.'
     A N76                                  DSPATR(ND)
     A  76                                  COLOR(RED)
     A                                 12 51'Budsjett:'
     A            WSBUDV         3A  O 12 62COLOR(WHT)
     A            WSBUDB         9Y 2O 12 68EDTCDE(J)
     A                                      COLOR(WHT)
     A                                 13  2'10.Transp'
     A            WSTRAN    R     Y  B 13 12REFFLD(DOKUFR/DFTRAN *LIBL/DOKUF)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAT         20A  B 13 21TEXT('Navn Transportør')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 42'14.Prod.'
     A            WSPROK         5A  B 13 51COLOR(YLW)
     A  82                                  DSPATR(RI)
     A            PRODNA        24A  O 13 57COLOR(WHT)
     A                                 14  2'11.Over'
     A            WSOVER        17A  B 14 12TEXT('Over Tollsted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  52                             14 30'Po.Till.'
     A  52        WSTPK1         5A  B 14 39COLOR(YLW)
     A  74                                  DSPATR(RI)
     A  52        WSTPK2         5A  B 14 45COLOR(YLW)
     A  73                                  DSPATR(RI)
     A            WSPRO1        30A  B 14 51TEXT('PRODTXT1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSBELE    R     Y  B 15 18REFFLD(DOKUFR/DFBELE *LIBL/DOKUF)
     A                                      EDTCDE(M)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A  50                             15 43'Kontonr'
     A            WSPRO2        30A  B 15 51TEXT('PRODTXT 2')
     A                                      DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 16  2'24.Varefors.verdi'
     A            WSFVCU    R        B 16 20REFFLD(DOKUFR/DFFVCU *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A            WSFVBL    R     Y  B 16 24REFFLD(DOKUFR/DFFVBL *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16 36'Kateg'
     A            WSFKAT         4A  B 16 42COLOR(YLW)
     A                                 16 47'26.Polise/SKAL for'
     A            WSPOLI        13A  B 16 66COLOR(YLW)
     A            WSSKFO         1A  B 16 80COLOR(YLW)
     A                                 17  2'27.Le.bet'
     A            WSLEVB         3A  B 17 12COLOR(YLW)
     A            WSLEVT        20A  B 17 16COLOR(YLW)
     A N50                             17 37'30.Lev.instr.'
     A  50                             17 37'30.Tlf v/ekr.'
     A            WSLEVI        30A  B 17 51COLOR(YLW)
     A  83                                  DSPATR(RI)
     A                                 18  2MSGCON(020 SHU0524 *LIBL/SYMSGF)
     A            WSVALK    R        B 18 23REFFLD(DOKUFR/DFFVCU *LIBL/DOKUF)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSBELV    R     Y  B 18 27REFFLD(DOKUFR/DFFVBL *LIBL/DOKUF)
     A                                      EDTCDE(M)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 18 49'12.Utv.pll'
     A            WSNTEU         2Y 0B 18 60TEXT('Ant EURO-plr utveksl')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A                                 18 63'13.Andre pll'
     A            WSNTAU         2Y 0B 18 76TEXT('Ant andr-plr utveksl')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A                                 19  2'33.Merking   34.Ant. 35.Type pakn.-
     A                                      /godsslag 36.Br.vkt/39.Fr.v  37.M3 -
     A                                        37.Lm '
     A            WSGM          12A  B 20  2TEXT('Godsmerking')
     A  32                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT           7Y 0B 20 15TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSVS          25A  B 20 23TEXT('Vareslag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKT          9Y 0B 20 49TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSM3           7Y 3B 20 63TEXT('Kubikk')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,000)
     A            WSLM           4Y 2B 20 73TEXT('Lastem.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,00)
     A            WSGM2         12A  B 21  2TEXT('Godsmerking')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS2         25A  B 21 23TEXT('Vareslag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKTF         9Y 0B 21 52TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A N31                             21 62MSGCON(015 DIV0379 *LIBL/SYMSGF)
     A N31        W2FBNR         3N 0I 21 78TEXT('Fraktbrevnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSGL1         18A  O 22  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 22 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 22 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 22 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL5         18A  O 23  2MSGID(&MSGLN5 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL6         18A  O 23 22MSGID(&MSGLN6 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL7         18A  O 23 42MSGID(&MSGLN7 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL8         18A  O 23 62MSGID(&MSGLN8 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30        UMSG          62A  O 24  2COLOR(WHT)
     A                                  2 30MSGCON(012 SHU1612 *LIBL/SYMSGF)
     A                                 15  2MSGCON(015 SHU1613 *LIBL/SYMSGF)
     A          R BILDE02
     A*%%TS  SD  20151023  142755  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF02(02 'SLETT DUP')
     A N31                                  CF03(03 'Avslutt')
     A                                      CF04(04 'Søke kundenr.')
     A N31                                  CF05(05 'Videre')
     A                                      CF07(07 'Kont.oppl')
     A                                      CF08(08 'BEREGNE FRAKT')
     A N31                                  CF09(09 'Neste fraktbrev')
     A                                      CF10(10 'Varelinjer')
     A                                      CF11(11 'DUP')
     A                                      CF12(12 'Avbryt')
     A                                      CF13(13 'MERKE')
     A N31                                  CF16(16 'Neste posisjon')
     A                                      CF17(17 'Rubrikk 36')
     A                                      CF18(18 'Rubrikk 29')
     A                                      CF19(19 'SEND FAX')
     A                                      CF20(20 'ANENN FRAKTBET')
     A                                      CF21(21 'FARLIG GODS')
     A                                      CF22(22 'SE EDI-LOGG')
     A                                      CF23(23 'DROPP EDI-TEST')
     A                                      CF24(24 'FLERE TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SYFI10A010 SYFI10APNL)
     A  *DS3                                HLPARA(01 001 02 080)
     A  *DS4                                HLPARA(01 001 02 080)
     A          H                           HLPPNLGRP(SYFI10A020 SYFI10APNL)
     A  *DS3                                HLPARA(03 001 03 009)
     A  *DS4                                HLPARA(03 001 03 009)
     A          H                           HLPPNLGRP(SYFI10A030 SYFI10APNL)
     A  *DS3                                HLPARA(03 010 03 028)
     A  *DS4                                HLPARA(03 010 03 028)
     A          H                           HLPPNLGRP(SYFI10A040 SYFI10APNL)
     A  *DS3                                HLPARA(03 029 03 080)
     A  *DS4                                HLPARA(03 029 03 080)
     A          H                           HLPPNLGRP(SYFI10A050 SYFI10APNL)
     A  *DS3                                HLPARA(04 001 06 080)
     A  *DS4                                HLPARA(04 001 06 080)
     A          H                           HLPPNLGRP(SYFI10A060 SYFI10APNL)
     A  *DS3                                HLPARA(07 001 08 080)
     A  *DS4                                HLPARA(07 001 08 080)
     A          H                           HLPPNLGRP(SYFI10A070 SYFI10APNL)
     A  *DS3                                HLPARA(09 001 09 080)
     A  *DS4                                HLPARA(09 001 09 080)
     A          H                           HLPPNLGRP(SYFI10A080 SYFI10APNL)
     A  *DS3                                HLPARA(10 001 10 080)
     A  *DS4                                HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(SYFI10A090 SYFI10APNL)
     A  *DS3                                HLPARA(11 001 11 080)
     A  *DS4                                HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(SYFI10A100 SYFI10APNL)
     A  *DS3                                HLPARA(12 001 12 048)
     A  *DS4                                HLPARA(12 001 12 048)
     A          H                           HLPPNLGRP(SYFI10A110 SYFI10APNL)
     A  *DS3                                HLPARA(12 049 12 080)
     A  *DS4                                HLPARA(12 049 12 080)
     A          H                           HLPPNLGRP(SYFI10A120 SYFI10APNL)
     A  *DS3                                HLPARA(13 001 13 033)
     A  *DS4                                HLPARA(13 001 13 033)
     A          H                           HLPPNLGRP(SYFI10A130 SYFI10APNL)
     A  *DS3                                HLPARA(13 034 13 080)
     A  *DS4                                HLPARA(13 034 13 080)
     A          H                           HLPPNLGRP(SYFI10A140 SYFI10APNL)
     A  *DS3                                HLPARA(14 001 16 080)
     A  *DS4                                HLPARA(14 001 16 080)
     A          H                           HLPPNLGRP(SYFI10A150 SYFI10APNL)
     A  *DS3                                HLPARA(17 001 17 080)
     A  *DS4                                HLPARA(17 001 17 080)
     A          H                           HLPPNLGRP(SYFI10A160 SYFI10APNL)
     A  *DS3                                HLPARA(18 001 18 080)
     A  *DS4                                HLPARA(18 001 18 080)
     A          H                           HLPPNLGRP(SYFI10A170 SYFI10APNL)
     A  *DS3                                HLPARA(19 001 20 080)
     A  *DS4                                HLPARA(19 001 20 080)
     A          H                           HLPPNLGRP(SYFI10A190 SYFI10APNL)
     A  *DS3                                HLPARA(21 001 21 048)
     A  *DS4                                HLPARA(21 001 21 048)
     A          H                           HLPPNLGRP(SYFI10A190 SYFI10APNL)
     A  *DS3                                HLPARA(21 049 21 080)
     A  *DS4                                HLPARA(21 049 21 080)
     A          H                           HLPPNLGRP(SYFI10A999 SYFI10APNL)
     A  *DS3                                HLPARA(22 001 24 080)
     A  *DS4                                HLPARA(22 001 24 080)
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGLN5         7A  P
     A            MSGLN6         7A  P
     A            MSGLN7         7A  P
     A            MSGLN8         7A  P
     A            MSGNR          7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYFI10A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(013 SHU0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSSNDA         2Y 0B  1 34EDTCDE(4)
     A                                      COLOR(RED)
     A  87                                  DSPATR(PR)
     A            WSSNDB         5Y 0B  1 37EDTCDE(4)
     A  87                                  DSPATR(PR)
     A                                      COLOR(RED)
     A            WSSNDN        10Y 0B  1 43COLOR(RED)
     A  87                                  DSPATR(PR)
     A            UAVD           4Y 0O  1 54EDTCDE(4)
     A                                      COLOR(WHT)
     A            UOPD           7Y 0O  1 59EDTCDE(4)
     A                                      COLOR(WHT)
     A            UFBNR          3Y 0O  1 67EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(006 DIV0151 *LIBL/SYMSGF)
     A            WSST           1A  B  2  9TEXT('Status')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 11MSGCON(010 DIV0152 *LIBL/SYMSGF)
     A            WSKDME         1A  B  2 22TEXT('Merkelapp  /X')
     A                                      DSPATR(UL)
     A  94                                  DSPATR(RI)
     A N51                                  COLOR(YLW)
     A  51                                  COLOR(WHT)
     A            WSMANT         4Y 0B  2 24EDTCDE(4)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSKDE          1A  B  2 43TEXT('Etterkrav  /X')
     A                                      DSPATR(UL)
     A                                      VALUES(' ' 'X')
     A                                      COLOR(YLW)
     A                                  2 46MSGCON(008 DIV0131 *LIBL/SYMSGF)
     A            WSSIGN         3A  B  2 55
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
S01  A*                                 2 60'Tollst'
S01  A*           WSTOLL         2Y 0B  2 67TEXT('Tollsted')
     A                                  2 60'T.std'
     A            WSTOLL         4Y 0B  2 66TEXT('Tollsted')
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  3 11'EDIfact ?'
     A            WSCMN     R        B  3 22REFFLD(DOKUFR/DFCMN *LIBL/DOKUF)
     A                                      VALUES(' ' 'Y' 'N')
     A                                      COLOR(YLW)
     A                                  3 24'Y/N'
     A                                  3 30'Ventekode'
     A            WSVEN     R        B  3 43REFFLD(DOKUFR/DFVEN *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A                                  3 58'17.Utst.dato'
     A            WSDTU          6Y 0O  3 71COLOR(WHT)
     A                                      EDTWRD('  .  .  ')
     A                                  4  2'01.Sender'
     A            WSKNSS         8Y 0B  4 12TEXT('Kundenr Sender')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4 21'15.Knr hos tr.'
     A            WSKNS         12A  B  4 36TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 49'16.Senders ref'
     A            WSSREF        17A  B  4 64TEXT('Senders ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNAVS        30A  B  5  2COLOR(YLW)
     A                                  5 49'18.Booking ref'
     A            WSBREF        17A  B  5 64TEXT('Booking ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1S        30A  B  6  2COLOR(YLW)
     A                                  6 36'Oppr. avsender/Fakturasender'
     A            SLDUPTXT      16A  O  6 65COLOR(BLU)
     A            WSAD2S        30A  B  7  2COLOR(YLW)
     A            WSFASE        25A  B  7 36COLOR(YLW)
     A            WSLKS          2A  B  8  2TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSPNUS         9A  B  8  5TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3S        25A  B  8 15COLOR(YLW)
     A                                  8 51'F7=Kontaktopplysninger'
     A N76                                  DSPATR(ND)
     A  76                                  COLOR(RED)
     A                                  9  2'04.Mottak'
     A            WSKNSM         8Y 0B  9 12TEXT('Kundenr Sender')
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  9 21'23.Knr hos tr.'
     A            WSKNM         12A  B  9 36TEXT('Kundenr Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 49'25.Mottak. ref'
     A            WSMREF        17A  B  9 64TEXT('Mottak. ref')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNAVM        30A  B 10  2TEXT('Navn Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 43'Leveres'
     A            WSNAVL        30A  B 10 51TEXT('Navn Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1M        30A  B 11  2TEXT('Adresse Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1L        30A  B 11 51TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2M        30A  B 12  2TEXT('Adresse Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2L        30A  B 12 51TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLKM          2A  B 13  2TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSPNUM         9A  B 13  5TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAU3M        25A  B 13 15TEXT('P-adr Mottaker')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLKL          2A  B 13 43TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSPNUL         9A  B 13 46TEXT('Leveringsadresse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADUL        25A  B 13 56TEXT('Utleveringssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14  2'28.Belast'
     A            WSBELA         1A  B 14 12TEXT('Sender bet henting')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'S' 'M' 'A')
     A                                 14 14'S/M/A'
     A                                 14 21'12.Utv.pll'
     A            WSNTEU         2Y 0B 14 32TEXT('Ant EURO-plr utveksl')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A                                 14 36'13.A.pll:'
     A            WSNTAU         2Y 0B 14 46TEXT('Ant andr-plr utveksl')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A                                 14 51'Budsjett:'
     A            WSBUDV         3A  O 14 62COLOR(WHT)
     A            WSBUDB         9Y 2O 14 68COLOR(WHT)
     A                                      EDTCDE(J)
     A                                 15  2'10.Transp'
     A            WSTRAN    R     Y  B 15 12REFFLD(DOKUFR/DFTRAN *LIBL/DOKUF)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAT         20A  B 15 21TEXT('Navn Transportør')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 43'14.Prod'
     A            WSPROK         5A  B 15 51COLOR(YLW)
     A            PRODNA        24A  O 15 57COLOR(WHT)
     A                                 16  2'24.Varefors.verdi'
     A            WSFVCU    R        B 16 20REFFLD(DOKUFR/DFFVCU *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A            WSFVBL    R     Y  B 16 24REFFLD(DOKUFR/DFFVBL *LIBL/DOKUF)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16 36'Kateg'
     A            WSFKAT         4A  B 16 42COLOR(YLW)
     A            WSPRO1        30A  B 16 51COLOR(YLW)
     A                                 17  2'26.Polise/SKAL for'
     A            WSPOLI        13A  B 17 21COLOR(YLW)
     A            WSSKFO         1A  B 17 35COLOR(YLW)
     A            WSPRO2        30A  B 17 51COLOR(YLW)
     A                                 18  2'27.Le.bet'
     A            WSLEVB         3A  B 18 12COLOR(YLW)
     A            WSLEVT        20A  B 18 16COLOR(YLW)
     A                                 18 37'30.Lev.instr.'
     A            WSLEVI        30A  B 18 51COLOR(YLW)
     A                                 19  2'33.Merking   34.Ant. 35.Type pakn.-
     A                                      /godsslag 36.Br.vkt/39.Fr.v  37.M3 -
     A                                        37.Lm '
     A            WSGM          12A  B 20  2TEXT('Godsmerking')
     A  32                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT           7Y 0B 20 15TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSVS          25A  B 20 23TEXT('Vareslag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKT          9Y 0B 20 49TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A            WSM3           7Y 3B 20 63TEXT('Kubikk')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,000)
     A            WSLM           4Y 2B 20 73TEXT('Lastem.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,00)
     A            WSGM2         12A  B 21  2TEXT('Godsmerking')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS2         25A  B 21 23TEXT('Vareslag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKTF         9Y 0B 21 52TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      COMP(GE 0)
     A N31                             21 62MSGCON(015 DIV0379 *LIBL/SYMSGF)
     A N31        W2FBNR         3N 0I 21 78TEXT('Fraktbrevnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSGL1         18A  O 22  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 22 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 22 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 22 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL5         18A  O 23  2MSGID(&MSGLN5 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL6         18A  O 23 22MSGID(&MSGLN6 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL7         18A  O 23 42MSGID(&MSGLN7 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL8         18A  O 23 62MSGID(&MSGLN8 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30        UMSG          62A  O 24  2COLOR(WHT)
     A                                  2 30MSGCON(012 SHU1612 *LIBL/SYMSGF)
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  2VALUES(' ' '2' '3')
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            DFFBNR    R        O  6  4REFFLD(DOKUFR/DFFBNR *LIBL/DOKUF)
     A            FLD001        10  0O  6  8COLOR(YLW)
     A            DFNAVM    R        O  6 19REFFLD(DOKUFR/DFNAVM *LIBL/DOKUF)
     A            DSSTED        31   O  6 50
     A            DFNT      R        O  7 11REFFLD(DOKUFR/DFNT *LIBL/DOKUF)
     A            DFVS      R        O  7 19REFFLD(DOKUFR/DFVS *LIBL/DOKUF)
     A            DFVKT     R        O  7 45REFFLD(DOKUFR/DFVKT *LIBL/DOKUF)
     A            DFNAT     R        O  7 55REFFLD(DOKUFR/DFNAT *LIBL/DOKUF)
     A*
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYFI10A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 DIV0378 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            UAVD           4Y 0O  1 51EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1 56'/'
     A            UOPD           7Y 0O  1 58EDTCDE(4)
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2 65TIME
     A                                  3  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 33MSGCON(040 SHU0134 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  1MSGCON(078 SHU0156 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5 11MSGCON(069 SHU0157 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A*
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF12(12)
     A                                      SLNO(22)
     A                                      CLRL(03)
     A                                      OVERLAY
     A            MSGNR          7A  P
     A                                  1  2MSGCON(023 DIV0058 *LIBL/SYMSGF)
     A  30        MSGTXT        78A  O  3  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R NYVARE
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYFI10A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 DIV0378 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            UAVD           4Y 0O  1 51EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1 56'/'
     A            UOPD           7Y 0O  1 58EDTCDE(4)
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 76DSPATR(ND)
     A                                  2 65TIME
     A                                  4  3MSGCON(078 SHU0157 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5 12MSGCON(069 SHU0156 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R POSTEN
     A                                      WINDOW(09 3 7 44)
     A                                  1  8'*** POSTENS BEDRIFTSPAKKE ***'
     A                                      DSPATR(HI)
     A            WSVT1         40   B  2  2COLOR(YLW)
     A            WSVT2         40   B  3  2COLOR(YLW)
     A            WSVT3         40   B  4  2COLOR(YLW)
     A            WSVT4         40   B  5  2COLOR(YLW)
     A                                  6  2MSGCON(030 BBA0138 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R ANNEN
     A                                      WINDOW(9 20 10 42)
     A                                      CF04(04 'Søke kundenr.')
     A                                      CF12(12 'AVBRYT')
     A                                  1  8'Annen Fraktbetaler    '
     A                                      DSPATR(HI)
     A                                  3  2'19.Annen'
     A            WSKNSX         8Y 0B  3 12TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4  2'20.Knr hos tr.'
     A            WSKNX         12A  B  4 20TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  77                                  DSPATR(RI)
     A            WSNAVX        30A  B  5  2TEXT('Navn Annen')
     A  86                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1X        30A  B  6  2TEXT('Adresse Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3X        30A  B  7  2TEXT('Adr.3   Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A N30                              9  2'F4=Søk'
     A                                      COLOR(BLU)
     A N30                              9  9MSGCON(030 BBA0138 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX2        40A  O  9  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R ANNEN2
     A                                      WINDOW(11 20 11 42)
     A                                      CF04(04 'Søke kundenr.')
     A                                      CF12(12 'AVBRYT')
     A                                  1  8'Annen Fraktbetaler           '
     A                                      DSPATR(HI)
     A                                  3  2'19.Annen'
     A            WSKNSX         8Y 0B  3 12TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4  2'20.Knr hos tr.'
     A            WSKNX         12A  B  4 20TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNAVX        30A  B  5  2TEXT('Navn Annen')
     A  86                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1X        30A  B  6  2TEXT('Adresse Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2X        30A  B  7  2TEXT('Adr.2   Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLKX          2A  B  8  2TEXT('LK Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSPNUX         9A  B  8  5TEXT('Utenl. pnr Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAU3X        25A  B  8 15TEXT('P-sted Annen')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A N30                             10  2'F4=Søk'
     A                                      COLOR(BLU)
     A N30                             10  9MSGCON(030 BBA0138 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX2        40A  O 10  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R SJEKKN
     A                                      WINDOW(*DFT 6 50 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'Sjekk kundenr hos tranportør:'
     A                                      DSPATR(HI)
     A                                  3  2'Oppgitt kundenr hos tranportør:'
     A            WSKNS         12A  O  3 34DSPATR(UL)
     A                                      COLOR(RED)
     A                                  4  2'Default kundenr hos tranportør:'
     A            XXKNS         12A  O  4 34DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2'Vil du bruke oppgitt?'
     A            WSJN           1A  B  6 34TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                  6 37'(J/N)'
     A          R F23
     A                                      CF23(23 'BEKREFT')
     A                                      WINDOW(*DFT 6 50 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'BEKREFT SLETTING FRAKTBREV:'
     A                                      DSPATR(HI)
     A                                  2  2'TAST DA F23:'
     A                                      DSPATR(HI)
     A*         R SJEKKN
     A          R SJEKLAB
     A*%%TS  SD  20150804  131727  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 6 50 *NOMSGLIN)
     A  *DS4                                WINDOW(*DFT 6 50 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'Du har bedt om særdeles mange merk-
     A                                      elapper'
     A                                      DSPATR(HI)
     A                                  3  2'Antall merkelapper bestilt....:'
     A            WSKDME         1A  O  3 35COLOR(WHT)
     A            WSMANT         4Y 0O  3 37EDTCDE(Z)
     A                                      COLOR(WHT)
     A                                  4  2'(maks antall tillat u/bekreftelse)'
     A            MAXANTLAB      4Y 0O  4 37EDTCDE(Z)
     A                                  6  2'Vil du virkelig bruke oppgitt?'
     A            WSMLJN         1A  B  6 34TEXT('Kundenr ANNEN')
     A                                      DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                  6 37'(J/N)'
     A*         R SJEKLAB
     A          R SPREDWARN
     A*%%TS  SD  20170919  091319  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 6 55 *NOMSGLIN)
     A  *DS4                                WINDOW(*DFT 6 55 *NOMSGLIN)
     A                                      OVERLAY
     A                                  1  2'F9 fra 1. fraktbrev = påbegynne sp-
     A                                      redning '
     A                                      DSPATR(HI)
     A                                  2  2'Til info -                        -
     A                                                     '
     A                                  3  2'Fraktbrev 001 vil få status O. '
     A                                  4  2'Fr.br.001 er reservert for oppdrag-
     A                                      stotaler.      '
     A                                  5  2'Den kan ikke inngå i fordeling/red-
     A                                      usert ant/vekt.'
     A                                  6  2'Benytt 002,003,004.. for fordeling'
     A                                  6 38'Tast Enter'
     A                                      COLOR(WHT)
