     A*%%TS  SD  20181119  122642  JOVO        REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 JOV PTF10 FEIL INNH/UTKJ OPD ..FA / LEDETEKST KORTET 13-6 I ALLE
12XXX * 02 YBC PTF12 Vis registrert CO2
12XXX * 03 YBC PTF12 WSCO2 ENDRES FRA 6.3 TIL 9.6
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A                                      CA20(20 'Send fax')
     A                                      CF13(13 'SAD')
     A          R BILDEFA
     A*%%TS  SD  20181119  122642  JOVO        REL-V7R1M0  5770-WDS
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A N55                                  CF16(16 'Se tur')
     A                                      CF17(17 'Innland oppd.')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0586 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 65TEXT('Referanse Agent')
     A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('PLANLEGGINSKODE')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A            HEGNN     R        O  2 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.KODE TILLEGG')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28TEXT('PROSENT TILLEGG')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(003 DIV0590 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('KUBIKK')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 67TEXT('LASTEMETER')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('FORFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('VIDEREFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A                                 17 15MSGCON(010 DIV2119 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HETLE     R        O 18 21REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            HETLL     R        O 18 35REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            W2TOLL         2Y 0O 19  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 19 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 19 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 19 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 19 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 19 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4Y 0O 21 24COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
     A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
S01  A*                                21 68'/'
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27                             22 42MSGCON(018 TRO0162 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(012 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 36MSGCON(013 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 50MSGCON(010 TRO0164 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  55                                  DSPATR(ND)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 18 15MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 18 28MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A          R BILDEEX
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A N55                                  CF16(16 'Se tur')
     A                                      CF17(17 'Import oppd.')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0726 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 20COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  2 33COLOR(WHT)
     A                                  2 45MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  2 52COLOR(WHT)
     A                                  2 65MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  2 75COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  3 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 37COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 57'Bil'
     A            HEHAWB    R        O  4 61REFFLD(HEADFR/HEHAWB SYSPEDF/HEADF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5  8TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRN2        30A  O  5 18COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 67TEXT('Lastemeter')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 15  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 15  9COLOR(WHT)
     A            HEKFT1         1A  O 15 12COLOR(WHT)
     A            HEFT1A        30A  O 15 15COLOR(WHT)
     A            HEFT1B        15A  O 15 46COLOR(WHT)
     A            WSUSR         10A  O 15 62COLOR(PNK)
     A                                 16  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 16 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 16 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 16 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 16 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 16 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 16 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 16 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 17  2MSGCON(048 YBC0202 *LIBL/SYMSGF)
     A            HEPK3          1A  O 18  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 18 16TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1   O 18 28TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 18 42TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 19 32MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 19 42TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 19 51'/'
     A            HEKLMO         4Y 0O 19 54COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 19 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 19 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 19 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 20  2MSGCON(006 SHU0325 *LIBL/SYMSGF)
     A            TRFA11         7A  O 20 12COLOR(WHT)
     A                                 20 20'-'
     A            TRFA12         4A  O 20 22COLOR(WHT)
     A                                 20 28MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A            TRFLP1         3Y 0O 20 34COLOR(WHT)
     A                                      EDTCDE(M)
     A                                 20 42MSGCON(006 SHU0332 *LIBL/SYMSGF)
     A            TRFA21         7A  O 20 49COLOR(WHT)
     A            TRFA22         4A  O 20 57COLOR(WHT)
     A                                 20 63MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A            TRFLP2         3Y 0O 20 69COLOR(WHT)
     A                                      EDTCDE(M)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A N27                             22 42MSGCON(018 TRO0163 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(012 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 36MSGCON(013 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 50MSGCON(010 TRO0164 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  55                                  DSPATR(ND)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEFI
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0070 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 60MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  1 63COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17'P'
     A            HEPOS1         7A  O  2 19TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 27TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 38MSGCON(006 DIV0077 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 45TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  2 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 18MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 23TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(003 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0098 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEFBV          9Y 0O 13 70TEXT('Fraktberegn.vekt')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(015 DIV0101 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 18 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A            HETLE     R        O 18 24REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            HETLL     R        O 18 38REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            W2TOLL         2Y 0O 19  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 19 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 19 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 19 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 19 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 19 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 19'/'
     A            HEKLMO         4Y 0O 22 22COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 18 18MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 18 31MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HEGNN     R        O 18 50REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDEEF
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(020 DIV0123 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0124 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A            HESAML         6A  O  5 66TEXT('SAMLASTNR')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0125 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  7TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13 18TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 35MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 52TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV0122 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  3TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 17  6TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK8          1A  O 17 10TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 17 14COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 14  2MSGCON(010 SHU0514 *LIBL/SYMSGF)
     A            HEGM1         15A  O 14 13COLOR(WHT)
     A            HEGM2         15A  O 15 13COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 20 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 20 21'/'
     A            HEKLMO         4Y 0O 20 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 21 13TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 22 13TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 17 21MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 17 34MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 17 27REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 17 41REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 17 18COLOR(WHT)
     A          R BILDEIN
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0115 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2'Dato:'
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 16MSGCON(009 DIV0116 *LIBL/SYMSGF)
     A            HEPK9          1A  O  2 26TEXT('Printerkode-9')
     A                                      COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0613 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  5 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0121 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 71TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV5101 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4  0O 21 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDETR
     A N27                                  CF03(03 'Avslutt')
     A N27                                  CF11(11 'Til rekv./budsj.')
     A N27                                  CF12(12 'Til rullbilde')
     A                                      CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF10(10 'SE TUR.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                      CF24(24 'FLERE FTASTER')
     A            TRSDFD         8Y 0H
     A            TRSDTD         8Y 0H
     A            TRSFFD         8Y 0H
     A            TRSVTD         8Y 0H
N03  A            MSGLN1         7A  P
N03  A            MSGLN2         7A  P
N03  A            MSGLN3         7A  P
N03  A            MSGLN4         7A  P
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(039 DIV4082 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 69TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 21MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 25TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 29MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 34TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 39'Tur'
     A            HEPRO          8Y 0O  2 43TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 52'Rundt'
     A            TRRUND         8Y 0O  2 58TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 67MSGCON(003 JOV0169 *LIBL/SYMSGF)
     A            HEHAWB    R        O  2 71REFFLD(HEADFR/HEHAWB *LIBL/HEADF)
     A                                      COLOR(WHT)
     A                                  3  2'Opdgi'
     A            TRKDAK         1A  O  3  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRKNFA         8Y 0O  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  3 19TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEADA         30A  O  3 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Fmott'
     A            TRKDFF         1A  O  4  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKNSF         8Y 0O  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENASF        30A  O  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADSF        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Søref'
NRFA A*           HERFA         15A  O  5  8TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  5  8TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 24'LS'
     A            WSSDL         15A  O  5 27TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 43MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  5 47TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 49MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  5 52TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 54MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  5 58TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 62'T.'
     A            HEVALT         3A  O  5 65TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  5 69DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 74'T-st'
     A            TRTSTA         1A  O  5 79COLOR(WHT)
     A                                      DSPATR(UL)
      * LINJE 6-7, STED FRA -TIL (+ VIA VIA) BØR GJØRES LIKT SOM I SYTR10FM
     A                                  6  2'Fra'
     A            HESDF          5A  O  6  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDFD         6Y 0O  6 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDFK         4Y 0O  6 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANF         2A  O  6 28COLOR(WHT)
     A            WSSONF         3A  O  6 31COLOR(WHT)
     A            WSPNRF         5Y 0O  6 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 44'Til'
     A            HESDT          5A  O  6 48TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDTD         6Y 0O  6 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDTK         4Y 0O  6 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANT         2A  O  6 68COLOR(WHT)
     A            WSSONT         3A  O  6 71COLOR(WHT)
     A            WSPNRT         5Y 0O  6 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Forf'
     A            HESDFF         5A  O  7  8TEXT('Forfrakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSFFD         6Y 0O  7 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSFFK         4Y 0O  7 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAF         1A  O  7 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN1         2A  O  7 28COLOR(WHT)
     A            WSSON1         3A  O  7 31COLOR(WHT)
     A            WSPNR1         5Y 0O  7 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7 44'Vid'
     A            HESDVT         5A  O  7 48TEXT('Viderefrakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSVTD         6Y 0O  7 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSVTK         4Y 0O  7 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAE         1A  O  7 66DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN2         2A  O  7 68COLOR(WHT)
     A            WSSON2         3A  O  7 71COLOR(WHT)
     A            WSPNR2         5Y 0O  7 75COLOR(WHT)
     A                                      EDTCDE(4)
      *
     A                                  8  2MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  8  8COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            HENAFA        30A  O  8 19COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEADFA        30A  O  8 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  9  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMS        30A  O  9 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRS        30A  O  9 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2'Henteadresse'
     A            HENAS         30A  O 10 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O 10 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 11 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 11 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 12  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMK        30A  O 12 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13  2'Leveringsadr'
     A            HENAK         30A  O 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 73TEXT('KUBIKK')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 17 68TEXT('Lastemeter')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 18  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKFT1         1A  O 18 12COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1A        30A  O 18 15COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1B        15A  O 18 46COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSUSR         10A  O 18 62COLOR(PNK)
     A                                 19  2'Verdi.'
     A            TRVERV         3A  O 19  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRVERB        13Y 2O 19 13EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 28'E'
     A            TRETTV         3A  O 19 30COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRETTB        13Y 2O 19 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 49'Frakt'
     A            TRFRAK         1A  O 19 55COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAV         3A  O 19 57COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAB        13Y 2O 19 61COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 19 76'M'
     A            TRMVA          1A  O 19 78COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20  2'Far(I)'
     A            TRFA11         7A  O 20  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 17'-'
     A            TRFA12         4A  O 20 19COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 24'Fl.p'
     A            TRFLP1         3Y 0O 20 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 33'Far(A)'
     A            TRFA21         7A  O 20 40COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFA22         4A  O 20 48COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 53'Fl.p'
     A            TRFLP2         3Y 0O 20 58COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2'Godsn'
     A            HEGN          15A  O 21  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21 25'P'
     A            HEPOS1         7A  O 21 27COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEPOS2         4Y 0O 21 35EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2'Ar.or'
     A            HEPK3          1A  O 22  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 22 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 13'Told '
     A            HEPK6          1A  O 22 19TEXT('Printerkode-6')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 21'CMR/BL'
     A            HEPK7          1A  O 22 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 30'Frab'
     A            HEPK1          1A  O 22 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 37'Forp'
     A            HEPK2          1A  O 22 42TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENTVS         3Y 0O 22 44EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 23 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A  29                             23 22MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 25MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 23 35TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 23 44'/'
     A            HEKLMO         4Y 0O 23 46COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 23 52'R.dat'
     A            WSDTR          6Y 0O 23 58DSPATR(UL)
     A                                      COLOR(WHT)
S03  A*                                24  2MSGCON(018 DIV4098 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*N29                             24 22MSGCON(018 DIV0037 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*                                24 42MSGCON(018 SHU0209 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*N27                             24 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
N03  A            MSGL1         18A  O 24  2MSGID(&MSGLN1 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL2         18A  O 24 22MSGID(&MSGLN2 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL3         18A  O 24 42MSGID(&MSGLN3 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL4         18A  O 24 62MSGID(&MSGLN4 SYMSGF)
N03  A                                      COLOR(BLU)
     A                                 22 48MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 22 61MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 22 54REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 22 68REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLKU    R        O 22 79REFFLD(HEADFR/HETLKU *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HEGNN     R        O 23 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDESJ
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV3285 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  3 40TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV3284 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A                                 18 16MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 28TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 18 30MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 42TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 18 44MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 19 19MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            BLLSTY         3A  O 19 25COLOR(WHT)
     A                                 19 30MSGCON(005 DIV3240 *LIBL/SYMSGF)
     A            BLOB           5A  O 19 36COLOR(WHT)
     A                                 19 43MSGCON(005 DIV3192 *LIBL/SYMSGF)
     A            BLREIS        14A  O 19 49COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4Y 0O 21 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            HEGNN     R        O  2 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A                                 17 16MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 17 30MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 17 22REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 17 37REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDESE
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV3286 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 22MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 26TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 33MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 38TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  2 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  3  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  3 20COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  3 33COLOR(WHT)
     A                                  3 47MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  3 55COLOR(WHT)
     A                                  3 68MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  3 77COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  4  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  4 14'-'
     A            HESDT          5A  O  4 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  4 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  4 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  4 37DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4 46MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  4 51TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  4 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  4 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  5 63COLOR(WHT)
     A                                  6  2MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  6  8TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  6 19MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            BLLSTY         3A  O  6 25COLOR(WHT)
     A                                  6 30MSGCON(005 DIV3240 *LIBL/SYMSGF)
     A            BLOB           5A  O  6 36COLOR(WHT)
     A                                  6 43MSGCON(005 DIV3192 *LIBL/SYMSGF)
     A            BLREIS        14A  O  6 49COLOR(WHT)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  8  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  8 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  8 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  8 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  8 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  8 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  8 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  8 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  9  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  9 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 10  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 10 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                 11  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 11  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O 11 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O 11 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O 11 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O 11 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O 11 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 12  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 12 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 13  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 13 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 18  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 18 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 18 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 18 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 18 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 18 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 18 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(022 YBC0205 *LIBL/SYMSGF)
     A                                 19 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 19 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 19 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            HEPK3          1A  O 20  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 20 12TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 20 18TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 20 22TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A                                 20 27MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 37TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 48MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 20 58TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 20 67'/'
     A            HEKLMO         4  0O 20 69COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 42MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILDE02V
     A*%%TS  SD  20171003  072632  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A N27                                  CF11(11 'Til rekv./budsj.')
     A                                      CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF10(10 'SE TUR.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                      CF24(24 'FLERE FTASTER')
     A                                      CF07(07 'flere varelinjer')
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGLN5         7A  P
     A            MSGLN6         7A  P
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 16MSGCON(030 SHU1520 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A  37                              1 16MSGCON(030 JOV0216 *LIBL/SYMSGF)
     A  37                                  COLOR(RED)
     A  37                                  DSPATR(UL)
     A  37                                  DSPATR(RI)
     A            RETNING        3A  O  1 47COLOR(WHT)
     A                                  1 51MSGCON(005 SHU1519 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 57TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 62'/'
     A N45        HEOPD          7Y 0O  1 64TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 72MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 76TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 86MSGCON(005 SHU1517 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  1 92TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1104MSGCON(005 SHU0320 *LIBL/SYMSGF)
     A            TRRUND         8Y 0O  1110TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 JOV0168 *LIBL/SYMSGF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(RED)
     A  45                              2 15'*NY*'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2 15MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O  2 22COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O  2 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 37'/'
     A            TRAVD2         4Y 0O  2 39COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O  2 44COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 53MSGCON(006 SHU1488 *LIBL/SYMSGF)
     A            TRAVD0    R        O  2 60REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A            TROPD0    R        O  2 65REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                  2 86MSGCON(005 SHU1516 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  2 92COLOR(WHT)
     A            AVRTXT        17A  O  2104COLOR(RED)
     A                                  3  2MSGCON(005 SHU0316 *LIBL/SYMSGF)
     A            TRKDAK         1A  O  3  8COLOR(WHT)
     A            HEKNA          8Y 0O  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  3 19TEXT('Navn Agent')
     A  98                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A  98                                  COLOR(RED)
     A N98                                  COLOR(WHT)
     A            HEADA         30A  O  3 50DSPATR(UL)
     A                                      COLOR(WHT)
     A  91                                  DSPATR(RI)
     A                                  3 86MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRKNFA    R     Y  O  3 92REFFLD(HEADFR/TRKNFA *LIBL/HEADF)
     A  32                                  DSPATR(ND)
     A  82                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENAO         30A  O  3101
     A  32                                  DSPATR(ND)
     A N23                                  COLOR(WHT)
     A  23                                  COLOR(RED)
     A  23                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A                                  4  2MSGCON(005 SHU1513 *LIBL/SYMSGF)
     A            TRKDFF         1A  O  4  8COLOR(WHT)
     A  93                                  DSPATR(RI)
     A                                  4 12MSGCON(005 SHU1504 *LIBL/SYMSGF)
     A            HERFA         35A  O  4 18TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A  59                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  4 54MSGCON(005 SHU1505 *LIBL/SYMSGF)
     A            HERFK         35A  O  4 61COLOR(WHT)
N02  A                                  4 98'CO2 pr tonn:'
S03  A*           WSCO2          6Y 3B  4111COLOR(WHT)
N03  A            WSCO2          9Y 6B  4111COLOR(WHT)
N02  A                                      DSPATR(UL)
N02  A                                      EDTCDE(4)
     A                                  5  2MSGCON(004 JOV1544 *LIBL/SYMSGF)
     A N42        HESDF          5A  O  5  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPLANF         2A  O  5  8COLOR(WHT)
     A  42        WPSDF          5A  O  5 11TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        WSSDFD         6Y 0O  5 14DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WPSDFD         6Y 0O  5 17DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A N42        TRSDFK         4Y 0O  5 21EDTCDE(4)
     A                                      COLOR(WHT)
     A  72                                  DSPATR(RI)
     A  42        WPSDFK         4Y 0O  5 24EDTCDE(4)
     A                                      COLOR(WHT)
     A  72                                  DSPATR(RI)
     A N42        WSLANF         2A  O  5 28COLOR(WHT)
     A  42        WPPNS1        14A  O  5 29
     A N42        WSSONF         3A  O  5 31COLOR(WHT)
     A N42        WSPNRF         5Y 0O  5 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 44MSGCON(003 SHU0321 *LIBL/SYMSGF)
     A N42        HESDT          5A  O  5 48TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A  42        WPLANT         2A  O  5 48COLOR(WHT)
     A  42        WPSDT          5A  O  5 51TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A N42        WSSDTD         6Y 0O  5 54DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WPSDTD         6Y 0O  5 57DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A N42        TRSDTK         4Y 0O  5 61EDTCDE(4)
     A  73                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPSDTK         4Y 0O  5 64EDTCDE(4)
     A  73                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        WSLANT         2A  O  5 68COLOR(WHT)
     A  42        WPPNS2        12A  O  5 69
     A N42        WSSONT         3A  O  5 71COLOR(WHT)
     A N42        WSPNRT         5Y 0O  5 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 86MSGCON(007 SHU0323 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRTSTA         1A  O  5 96COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  90                                  DSPATR(RI)
     A            WSADFX        20A  O  5101COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42                              6  2'Via'
     A  32                                  DSPATR(ND)
     A                                  6  2MSGCON(003 SHU0322 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A N42        WSSDFF         5A  O  6  8TEXT('Forfrakt fra')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPLAN1         2A  O  6  8COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSDFF         5A  O  6 11TEXT('Via base')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        WSSFFD         6Y 0O  6 14DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WPSFFD         6Y 0O  6 17DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A N42        TRSFFK         4Y 0O  6 21EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  74                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPSFFK         4Y 0O  6 24EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  74                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        WSSTAF         1A  O  6 26
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  43                                  DSPATR(HI)
     A  32N42     WSLAN1         2A  O  6 28COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAF         1A  O  6 29
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  43                                  DSPATR(HI)
     A  32N42     WSSON1         3A  O  6 31COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS3        12A  O  6 31
     A  32                                  DSPATR(ND)
     A N42        WSPNR1         5Y 0O  6 35COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  6 44MSGCON(003 SHU0322 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A N42        HESDVT         5A  O  6 48TEXT('Viderefrakt til')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPLAN2         2A  O  6 48COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSDVT         5A  O  6 51TEXT('Via base')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        WSSVTD         6Y 0O  6 54DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WPSVTD         6Y 0O  6 57DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A N42        TRSVTK         4Y 0O  6 61EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  75                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  42        WPSVTK         4Y 0O  6 64EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  75                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A N42        TRSTAE         1A  O  6 66
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  44                                  DSPATR(HI)
     A  32N42     WSLAN2         2A  O  6 68COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAE         1A  O  6 69
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A  44                                  DSPATR(HI)
     A N42        WSSON2         3A  O  6 71COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS4        10A  O  6 71
     A  32                                  DSPATR(ND)
     A N42        WSPNR2         5Y 0O  6 75COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  7  2MSGCON(005 SHU1500 *LIBL/SYMSGF)
     A            HEOT           2A  O  7  8TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  7 11MSGCON(009 SHU1501 *LIBL/SYMSGF)
     A            HEFR           3A  O  7 21TEXT('Frankatur')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  7 25MSGCON(011 SHU1561 *LIBL/SYMSGF)
     A            WSBODT         6S 0O  7 39COLOR(WHT)
     A                                  7 46MSGCON(003 SHU1562 *LIBL/SYMSGF)
     A            WSBOTM         4S 0O  7 50COLOR(WHT)
     A                                  7 57MSGCON(010 JOV1675 *LIBL/SYMSGF)
     A            WSSTN7         1A  O  7 68COLOR(RED)
     A                                  7 86MSGCON(020 SHU1491 *LIBL/SYMSGF)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEKNS          8Y 0O  8  8TEXT('Kundenr Selger')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  67
     AO 68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENAMS        30A  O  8 19TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRS        30A  O  8 50TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEKNSF         8Y 0O  8 86TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENASF        30A  O  8 95TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A                                  9  2MSGCON(014 SHU0337 *LIBL/SYMSGF)
     A            HENAS         30A  O  9 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  9 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 86MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEVALS         3A  O  9 91TEXT('Valutakode Selger')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  9 95MSGCON(010 SHU1489 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  9106TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9109MSGCON(006 SHU1490 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEANS          1Y 0O  9116TEXT('Avtalenr Selger')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSEDIINF      15A  O 10  2COLOR(RED)
     A            HEADS2        30A  O 10 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 10 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10 86MSGCON(009 SHU1497 *LIBL/SYMSGF)
     A            HESDLA        20A  O 10 97TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 11 86MSGCON(020 SHU1492 *LIBL/SYMSGF)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEKNK          8Y 0O 12  8TEXT('Kundenr Kjøper')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  62
     AO 61                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMK        30A  O 12 19TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A            HEADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A            HEKNKF         8Y 0O 12 86TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  17                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENAKF        30A  O 12 95TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A                                 13  2MSGCON(014 SHU0338 *LIBL/SYMSGF)
     A            HENAK         30A  O 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13 86MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O 13 91TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 13 95MSGCON(010 SHU1489 *LIBL/SYMSGF)
     A            HEKDFK         1A  O 13106TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13109MSGCON(006 SHU1490 *LIBL/SYMSGF)
     A            HEANK          1Y 0O 13116TEXT('Avtalenr Selger')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEADK2        30A  O 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 86MSGCON(009 SHU1512 *LIBL/SYMSGF)
     A            HESDL         20A  O 14 97TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(130 SHU1485 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSLI1         1A  O 16  2
     A            WSGM01        15A  O 16  4COLOR(WHT)
     A            WSANT1    R        O 16 20REFFLD(DOKUFVR/FVANT *LIBL/DOKUFV)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(Z)
     A                                      COLOR(WHT)
     A            WSPAKN1   R        O 16 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(WHT)
     A            WSVT1         25A  O 16 36COLOR(WHT)
     A  86                                  DSPATR(RI)
     A            WSVKT1    R        O 16 62REFFLD(DOKUFVR/FVVKT *LIBL/DOKUFV)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(Z)
     A                                      COLOR(WHT)
     A            WSLE01         4Y 0O 16 72EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSBR01         4Y 0O 16 77EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSHO01         4Y 0O 16 82EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSVOL1    R        O 16 87REFFLD(DOKUFVR/FVVOL *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSLM1     R        O 16 96REFFLD(DOKUFVR/FVLM *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSLM1B    R        O 16102REFFLD(DOKUFVR/FVLM *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSUNN1         4A  O 16108COLOR(WHT)
     A            WSEMB1         3A  O 16113COLOR(WHT)
     A            WSANK1         2Y 0O 16117COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSANM1         4Y 0O 16120COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSENH1         1A  O 16125COLOR(WHT)
     A            WSPOE1         4Y 0O 16127EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI2         1A  O 17  2
     A            WSGM02        15A  O 17  4COLOR(WHT)
     A            WSANT2         7Y 0O 17 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSPAKN2   R        O 17 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(WHT)
     A            WSVT2         25A  O 17 36COLOR(WHT)
     A            WSVKT2         9Y 0O 17 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSLE02         4Y 0O 17 72EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSBR02         4Y 0O 17 77EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSHO02         4Y 0O 17 82EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSVOL2         7Y 3O 17 87EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSLM2          4Y 2O 17 96TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSLM2B         4Y 2O 17102EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSUNN2         4A  O 17108COLOR(WHT)
     A            WSEMB2         3A  O 17113COLOR(WHT)
     A            WSANK2         2Y 0O 17117COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSANM2         4Y 0O 17120COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSENH2         1A  O 17125COLOR(WHT)
     A            WSPOE2         4Y 0O 17127EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI3         1A  O 18  2
     A            WSGM03        15A  O 18  4COLOR(WHT)
     A            WSANT3         7Y 0O 18 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSPAKN3   R        O 18 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(WHT)
     A            WSVT3         25A  O 18 36COLOR(WHT)
     A            WSVKT3         9Y 0O 18 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSLE03         4Y 0O 18 72EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSBR03         4Y 0O 18 77EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSHO03         4Y 0O 18 82EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSVOL3         7Y 3O 18 87EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSLM3          4Y 2O 18 96TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSLM3B         4Y 2O 18102EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSUNN3         4A  O 18108COLOR(WHT)
     A            WSEMB3         3A  O 18113COLOR(WHT)
     A            WSANK3         2Y 0O 18117COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSANM3         4Y 0O 18120COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSENH3         1A  O 18125COLOR(WHT)
     A            WSPOE3         4Y 0O 18127EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI4         1A  O 19  2
     A            HEGM1         15A  O 19  4TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 19 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEVS1         25A  O 19 36TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 19 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEM3           7Y 3O 19 87EDTCDE(4)
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 19 96TEXT('Kubikk')
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HELMLA         4Y 2O 19102TEXT('Kubikk')
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            FLER3          5A  O 19119COLOR(WHT)
     A            HEPOEP         5Y 0O 19126TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A            HEGM2         15A  O 20  4TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 20 36TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 20 77MSGCON(009 SHU1499 *LIBL/SYMSGF)
     A            HEFBV          9Y 0O 20 87TEXT('FBVekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSPOEN         5Y 0O 20126TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A                                 21103MSGCON(010 SHU1487 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRVERV         3A  O 21114COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  49                                  DSPATR(RI)
     A            TRVERB        13Y 2O 21118EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  56                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(005 SHU0333 *LIBL/SYMSGF)
     A            TRFRAK         1A  O 22  9COLOR(WHT)
     A  53                                  DSPATR(RI)
     A            TRFRAV         3A  O 22 12COLOR(WHT)
     A  52                                  DSPATR(RI)
     A            TRFRAB        13Y 2O 22 17COLOR(WHT)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 22 33MSGCON(001 SHU0334 *LIBL/SYMSGF)
     A            TRMVA          1A  O 22 35
     A  50                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            XKDA           1A  O 22 38COLOR(WHT)
     A                                 22 40MSGCON(006 YBC0489 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 22 47TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 22 49MSGCON(007 SHU1494 *LIBL/SYMSGF)
     A            HEVALT         3A  O 22 57TEXT('V.kode tillegg')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 22 61'%'
     A            WSVALP         3Y 1O 22 63DSPATR(UL)
     A  32                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      EDTCDE(M)
     A                                 22 69MSGCON(008 SHU1538 *LIBL/SYMSGF)
     A            WTGX           5A  O 22 78COLOR(WHT)
     A                                 22 84'P'
     A            HESTN6         1A  O 22 86COLOR(WHT)
     A                                 22 89MSGCON(006 SHU1498 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSBRUT         6Y 0O 22 96COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                 22103MSGCON(010 SHU1486 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRETTV         3A  O 22114COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  55                                  DSPATR(RI)
     A            TRETTB        13Y 2O 22118EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  54                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEKF           2A  O 23  9DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  40                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEKFT1         1A  O 23 12DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  39                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEFT1A        30A  O 23 15DSPATR(UL)
     A  32                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A            HEFT1B        15A  O 23 46DSPATR(UL)
     A  32                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                 23 70MSGCON(006 SHU0325 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            HEFA11         7A  O 23 77COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                 23 85'UN'
     A  32                                  DSPATR(ND)
     A            HEFA12         4A  O 23 88COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                 23 93MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRFLP1         3Y 0O 23 98COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(M)
     A                                 23103MSGCON(006 SHU0332 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRFA21         7A  O 23110COLOR(WHT)
     A  32                                  DSPATR(ND)
     A            TRFA22         4A  O 23118COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                 23123MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            TRFLP2         3Y 0O 23128COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(M)
     A                                 24  2MSGCON(005 SHU1495 *LIBL/SYMSGF)
     A            WSGNA          4A  O 24  9COLOR(WHT)
     A            WSGNB          5A  O 24 14COLOR(WHT)
     A            WSGNC          6A  O 24 20COLOR(WHT)
     A                                 24 27MSGCON(003 SHU1496 *LIBL/SYMSGF)
     A            HEPOS1         7A  O 24 31COLOR(WHT)
     A                                 24 39'Pos2'
     A            HEPOS2         4Y 0O 24 44COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 24 49MSGCON(008 SHU1597 *LIBL/SYMSGF)
     A            WSGNNA         4A  O 24 58COLOR(WHT)
     A            WSGNNB         5A  O 24 63COLOR(WHT)
     A            WSGNNC         6A  O 24 69COLOR(WHT)
     A                                 24 83'Eks/Lø'
     A            HETLE          6A  O 24 91COLOR(WHT)
     A            HETLL         10A  O 24 99COLOR(WHT)
     A                                 24111'Kan Utf'
     A            HETLKU         1A  O 24119COLOR(WHT)
     A            WSUSR         10A  O 24122COLOR(PNK)
     A                                 25  2MSGCON(006 SHU0327 *LIBL/SYMSGF)
     A            HEPK3          1A  O 25  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 25 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 25 13MSGCON(003 JOV0805 *LIBL/SYMSGF)
     A            HEPK4          1A  O 25 17TEXT('Printerkode-4 Sad imp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 25 19TEXT('Printerkode-6  Sad-exp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 25 21'CMR/BL'
     A            HEPK7          1A  O 25 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 25 30MSGCON(004 SHU0329 *LIBL/SYMSGF)
     A            HEPK1          1A  O 25 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 25 37EDTCDE(4)
     A  58                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            W2KDME         1A  O 25 43TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 25 45'Ek'
     A            W2KDE          1A  O 25 48TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 25 50MSGCON(002 SHU0335 *LIBL/SYMSGF)
     A            HEPK2          1A  O 25 53TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            HENTVS         3Y 0O 25 55EDTCDE(4)
     A  57                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 25 59'Fly'
     A            HEPK8          1A  O 25 63COLOR(WHT)
     A                                 25 65MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 25 75TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 25 86MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 25 97TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 25105'/'
     A            HEKLMO         4Y 0O 25106COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 25112'R.dat'
     A            WSDTR          6Y 0O 25118COLOR(WHT)
     A            MSGL1         18A  O 27  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 27 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 27 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 27 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL5         18A  O 27 82MSGID(&MSGLN5 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL6         18A  O 27102MSGID(&MSGLN6 SYMSGF)
     A                                      COLOR(BLU)
     A            TRSLAG         2   O  2  7COLOR(RED)
     A  41                                  DSPATR(ND)
