     A*%%TS  SD  20170504  081059  SVEIN       REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 BEVARE SIFS I SUBFIL
10XXXA* 02 CB  PTF10 27X132, IKKE MERKET
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Avslutt program')
     A                                      CF02(02 'BYTT PROGRAM')
     A                                      HLPPNLGRP(HLPSCR EDI40PNL)
     A                                      HLPTITLE('EDI UTVEKSLINGER')
     A                                      HELP
     A                                      ALTHELP
     A*
     A          R BILDE01
     A*%%TS  SD  20170504  081059  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF04(04 'Query')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYGE55R'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(050 SHU1710 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  3MSGCON(006 SHU1711 *LIBL/SYMSGF)
     A            EPOST         70A  B  8 11CHECK(LC)
     A  70                                  DSPATR(RI)
     A                                 10  3MSGCON(006 SHU0838 *LIBL/SYMSGF)
     A            EMNE          70   B 10 11
