     A*%%TS  SD  20181003  175636  JOVO        REL-V7R1M0  5770-WDS
     A*
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4                 -
     A                                             24 80 *DS3)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A*
     A          R BILDE
     A*%%TS  SD  20181003  175636  JOVO        REL-V7R1M0  5770-WDS
     A  *DS4                                WINDOW(*DFT 7 60 *NOMSGLIN)
     A  *DS3                                WINDOW(*DFT 7 60 *NOMSGLIN)
     A                                      CF04(04 'REFRESH')
     A                                      CF05(05 'REFRESH')
     A                                      CF07(07 'KPERSS')
     A                                      CF08(08 'SEND AVS')
     A                                      CF09(09 'SEND TRAN')
     A                                      CF19(19 'SEND EDI TRAN')
     A                                      CF21(21 'SEND SMS TRAN')
     A                                      CF22(22 'SEND SMS TRAN')
     A                                      CF10(10 'SEND ANNEN')
     A                                      CF11(11 'TRACK &TRACE')
     A                                      CF03(03 'Avslutt')
     A                                      CF12(12 'Avslutt')
     A                                  1  1'SYGE72T'
     A                                      COLOR(BLU)
     A*                                     BLINK
     A*                                     WDWBORDER((*DSPATR HI) (*CHAR '...:-
     A*                                     ::.:'))
     A                                  1  9MSGCON(050 JOV1760 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  9'Turnummer:'
     A            TURNR          8A  O  2 20COLOR(WHT)
     A                                  2 30'Bilnummer:'
     A            TUBILN        10A  O  2 42COLOR(WHT)
     A                                  4  1'Mail:'
     A            WSMAIL        50A  B  4  8CHECK(LC)
     A                                  5  1'Merk: '
     A            WSMERK        50A  B  5  8CHECK(LC)
     A                                  6  8'F10=send'
     A                                      COLOR(BLU)
     A                                  6 42'F12=Forrige'
     A                                      COLOR(BLU)
     A                                  3  1'Språk:'
     A            WSSPRAK        2A  B  3  8
     A                                  3 12'(EN=Engelsk)'
