     A*%%TS  SD  20171214  081230  JOVO        REL-V7R1M0  5770-WDS
     A*
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4                 -
     A                                             24 80 *DS3 )
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A*
     A          R BILDE
     A*%%TS  SD  20171214  081230  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 7 60 *NOMSGLIN)
     A  *DS4                                WINDOW(*DFT 7 60 *NOMSGLIN)
     A                                      CF04(04 'REFRESH')
     A                                      CF05(05 'REFRESH')
     A                                      CF07(07 'KPERSS')
     A                                      CF08(08 'SEND AVS')
     A                                      CF09(09 'SEND TRAN')
     A                                      CF19(19 'SEND EDI TRAN')
     A                                      CF21(21 'SEND SMS TRAN')
     A                                      CF22(22 'SEND SMS TRAN')
     A                                      CF10(10 'SEND ANNEN')
     A                                      CF11(11 'TRACK &TRACE')
     A                                      CF03(03 'Avslutt')
     A                                      CF12(12 'Avslutt')
     A*                                     BLINK
     A*                                     WDWBORDER((*DSPATR HI) (*CHAR '...:-
     A*                                     ::.:'))
     A                                  1  8MSGCON(050 JOV1761 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  8'Avd'
     A            UAVD           4Y 0O  2 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17'Oppd'
     A            UOPD           7Y 0O  2 22COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4  1'Mail:'
     A            WSAMAIL       50A  B  4  8CHECK(LC)
     A                                  5  1'Merk: '
     A            WSMERK        50A  B  5  8CHECK(LC)
     A                                  6  8'F10=send'
     A                                      COLOR(BLU)
     A                                  6 27'F7=K.pers'
     A                                      COLOR(BLU)
     A                                  6 47'F12=Forrige'
     A                                      COLOR(BLU)
     A                                  1  1'SYGE72'
     A                                      COLOR(BLU)
