     A*%%TS  SD  20170302  113614  SVEIN       REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 SKJERMEN STØRRELSE
*****A**************************************************************
S01  A*                                     DSPSIZ(24 80 *DS3)
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      ALTHELP(CA01)
     A                                      HELP
     A          R BILDE01
     A*%%TS  SD  20170302  113614  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'søking')
     A                                      CF05(05 'SE ORDRE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  4 12'Teste tall til bokstaver '
     A                                      COLOR(WHT)
     A                                  6 12'Land:'
     A            LK             2   B  6 19
     A                                  7 12'Tall:'
     A            TALL          13Y 2B  7 19EDTWRD('           .  ')
     A                                 10 12'Resultat:'
     A            BOKS         128A  O 10 23
