     A*%%TS  SD  20181002  165849  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20181002  165849  SVEIN       REL-V7R1M0  5770-WDS
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A            BETBET    R        O  5  6REFFLD(KODAR/BETBET *LIBL/KODAF)
     A            BETTXT    R        O  5 11REFFLD(KODAR/BETTXT *LIBL/KODAF)
     A            FRILEV    R        O  5 47REFFLD(KODAR/FRILEV *LIBL/KODAF)
     A            TIDBER    R        O  5 58REFFLD(KODAR/TIDBER *LIBL/KODAF)
     A            BETTID    R        O  5 69REFFLD(KODAR/BETTID *LIBL/KODAF)
     A            AKTKOD    R        O  5 75REFFLD(KONTR/AKTKOD *LIBL/KONTF)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20181002  162054  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYIB01'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(130 SHU1896 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 17MSGCON(040 SHU1897 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 42MSGCON(18 DIV0022 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VARELI
     A*%%TS  SD  20181002  165849  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A            WSTBET    R        B  2  6REFFLD(KODAR/BETBET *LIBL/KODAF)
     A  90                                  DSPATR(RI)
     A            WSTTXT    R        B  2 11REFFLD(KODAR/BETTXT *LIBL/KODAF)
     A                                      CHECK(LC)
     A            WSILEV    R        B  2 47REFFLD(KODAR/FRILEV *LIBL/KODAF)
     A            WSDBER    R        B  2 58REFFLD(KODAR/TIDBER *LIBL/KODAF)
     A            WSTTID    R        B  2 69REFFLD(KODAR/BETTID *LIBL/KODAF)
     A            WSTKOD    R        B  2 75REFFLD(KONTR/AKTKOD *LIBL/KONTF)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  1  2MSGCON(130 SHU1896 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R VAREL3
     A*%%TS  SD  20181002  165849  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            BETBET    R        O  2  6REFFLD(KODAR/BETBET *LIBL/KODAF)
     A                                      COLOR(RED)
     A            BETTXT    R        O  2 11REFFLD(KODAR/BETTXT *LIBL/KODAF)
     A                                      COLOR(RED)
     A            FRILEV    R        O  2 47REFFLD(KODAR/FRILEV *LIBL/KODAF)
     A                                      COLOR(RED)
     A            TIDBER    R        O  2 58REFFLD(KODAR/TIDBER *LIBL/KODAF)
     A                                      COLOR(RED)
     A            BETTID    R        O  2 69REFFLD(KODAR/BETTID *LIBL/KODAF)
     A                                      COLOR(RED)
     A            AKTKOD    R        B  2 75REFFLD(KONTR/AKTKOD *LIBL/KONTF)
     A                                      COLOR(RED)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  1  2MSGCON(030 SHU1896 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R NYVARE
     A*%%TS  SD  20181002  162054  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYIB01'
     A                                      COLOR(BLU)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                  1 17MSGCON(040 SHU1897 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(130 SHU1896 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
