      *________
      *""""""""
     A          R SYIM01FR
     A            ZUSER         10
     A            ZAVDF          4  0
     A            ZAVDT          4  0
     A            ZGNF          15
     A            ZGNT          15
     A            ZLNRF          1
     A            ZLNRT          1
     A            ZDTF           6  0
     A            ZDTT           6  0
     A            ZOT           20
     A            ZST01          1A
     A            ZST02          1A
     A            ZST03          1A
     A            ZST04          1A
     A            ZST05          1A
     A            ZUNG           1A
     A            ZBRUDD         1A
     A            ZDEV          10A
     A            ZA4            1A
     A            EPOST         70
     A            ZPS            1A
     A          K ZUSER
