     A*%%TS  SD  20190904  092633  SVEIN       REL-V7R1M0  5770-WDS
     A*********************************************************************
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8068A* 01 TH  PTF8 NY HELPFUNKSJON  KUN DDS
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CF03(03 'Avslutt')
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYEX05PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV FLYFRAKTRA-
     A                                      TER')
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20190830  080526  SVEIN       REL-V7R1M0  5770-WDS
     A            WSNR           1A  I  7  3
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                      VALUES(' ' '1' '2')
     A            MENU      R        O  7  7REFFLD(MENUFR/MENU *LIBL/SYMENUF)
     A            TEXT      R        O  7 18REFFLD(MENUFR/TEXT *LIBL/SYMENUF)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20190904  092633  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91N93                               CF05(05 'Frisk')
     A  91N93                               CF06(06 'LAGE NY')
     A  91N93                               CF08(08 'SØK')
     A                                  1  3'SYSPED/SYME01 '
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 SHU2026 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 57'Dato:'
     A                                      COLOR(BLU)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 57'Kl. :'
     A                                      COLOR(BLU)
     A                                  2 63TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  3'Velg funksjon, trykk Enter'
     A                                      COLOR(BLU)
     A                                  4  3MSGCON(040 SHU2027 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(060 SHU2028 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            DIRMNU        10   I  6  7
     A  70                                  DSPATR(RI)
     A          R BUNN
     A*%%TS  SD  20190827  134339  SVEIN       REL-V7R1M0  5770-WDS
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 60MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                             24  2'INVALID OPTION'
     A                                      COLOR(WHT)
     A N98                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL2
     A*%%TS  SD  20190827  134339  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  2  2MSGCON(012 DIV0026 *LIBL/SYMSGF)
     A            WSFILE        10   I  2 17
     A          R NYWRK
     A*%%TS  SD  20190827  140806  SVEIN       REL-V7R1M0  5770-WDS
     A                                  1  3'SYSPED/SYME01 '
     A                                      COLOR(BLU)
     A                                  1 57'Dato:'
     A                                      COLOR(BLU)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 57'Kl. :'
     A                                      COLOR(BLU)
     A                                  2 63TIME
     A                                      COLOR(BLU)
     A                                  4  3'Velg funksjon, trykk Enter'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 SHU2026 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  3MSGCON(040 SHU2027 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(060 SHU2028 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 60MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
