     A          R MENUFR
     A            USER          10          COLHDG('BRUKER')
     A            MENU          10          COLHDG('MENU')
     A            TEXT          50          COLHDG('TEKST')
     A          K USER
     A          K MENU
