     A*%%TS  SD  20180814  140642  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
     A*
     A          R BILDE01
     A*%%TS  SD  20180814  140642  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'EXIT')
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/SYNA10 '
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU1700 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  4  3'Firmakode.......:'
     A            NAFIRM         2A  B  4 21DSPATR(PR)
     A                                  5  3MSGCON(060 SHU1850 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  6  3'Bilagsserie.....:'
     A            WRSERI    R        B  6 21REFFLD(FIRMNAR/NASERI *LIBL/FIRMNA)
     A                                  7  3'Dokumenttype....:'
     A            WRDTDO    R        B  7 21REFFLD(FIRMNAR/NADTDO *LIBL/FIRMNA)
     A                                  8  3'Kontonr øre.avru:'
     A            WRONTO    R        B  8 21REFFLD(FIRMNAR/OKONTO *LIBL/FIRMNA)
     A                                  9  3'Gebyrkode øre.av:'
     A            WREBYO    R        B  9 21REFFLD(FIRMNAR/OGEBYR *LIBL/FIRMNA)
     A                                 10  3'Avdeling øre.avr:'
     A            WRSTED    R        B 10 21REFFLD(FIRMNAR/OKSTED *LIBL/FIRMNA)
     A                                 11  3'Gebyrkode ubudsj:'
     A            WREBYR    R        B 11 21REFFLD(FIRMNAR/UGEBYR *LIBL/FIRMNA)
     A                                 11 27'Differanse fra busjett føres egen -
     A                                      konto'
     A                                 12  3'For at bilaget skal bli autogodkje-
     A                                      nt:'
     A                                      COLOR(WHT)
     A                                 13  3'Max % over budsj:'
     A            WRGRPL         3Y 1B 13 21EDTCDE(J)
     A                                      COMP(GE 0,0)
     A                                 13 28'(0 eller positiv verdi)'
     A                                 14  3'Max'
     A                                 14  7'%'
     A                                 14  9'under'
     A                                 14 15'buds:'
     A            WRGRMI         3Y 1B 14 21EDTCDE(J)
     A                                      COMP(LE 0,0)
     A                                 14 28'(0 eller negativ verdi)'
     A                                 15  3MSGCON(060 SHU1851 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                 16  3'Dokumenttype....:'
     A            WRDTDH    R        B 16 21REFFLD(FIRMNAR/NADTDO *LIBL/FIRMNA)
     A                                 23  2'F12 = Avbryt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
