     A          R SYOUTQFR
     A            UTKO          10          COLHDG('UTKØ')
     A            BIBL          10          COLHDG('BIBLIOTEK')
