     A          R SYQRYFR
     A*
     A            ODOBNM        10          COLHDG('QEURYNAVN')
     A            ODLBNM        10          COLHDG('QUERY BIBLIOTEK')
     A            ODOBTX        50          COLHDG('TEKST')
     A          K ODOBNM
     A          K ODLBNM
