     A          R SYREO31FR
     A            R31MOD        10A         COLHDG('MODUL')
     A            R31AR1         2S 0       COLHDG('ANT. ÅR FOR FIRMA')
     A            R31AR2         2S 0       COLHDG('ANT. ÅR FOR PERSON')
     A            R31ARS         4S 0       COLHDG('START ÅR FOR SLETT.')
     A            R31ST          1A         COLHDG('STATUS')
     A            R31REO         1A         COLHDG('REORG. ETTER SLETT')
     A            R31PGM        10A         COLHDG('PROGRAM')
     A            R31DT1         8S 0       COLHDG('START DATO')
     A            R31TM1         6S 0       COLHDG('START TID')
     A            R31DT2         8S 0       COLHDG('SLUTT DATO')
     A            R31TM2         6S 0       COLHDG('SLUTT TID')
     A          K R31MOD
