     A          R SYREO01FR
     A            R01MOD        10A         COLHDG('MODUL')
     A            R01AR1         2S 0       COLHDG('ANT. ÅR FOR FIRMA')
     A            R01AR2         2S 0       COLHDG('ANT. ÅR FOR PERSON')
     A            R01ARS         4S 0       COLHDG('START ÅR FOR SLETT.')
     A            R01ST          1A         COLHDG('STATUS')
     A            R01REO         1A         COLHDG('REORG. ETTER SLETT')
     A            R01PGM        10A         COLHDG('PROGRAM')
     A            R01DT1         8S 0       COLHDG('START DATO')
     A            R01TM1         6S 0       COLHDG('START TID')
     A            R01DT2         8S 0       COLHDG('SLUTT DATO')
     A            R01TM2         6S 0       COLHDG('SLUTT TID')
     A          K R01MOD
