     A          R SYREO01F2R
     A            R012MOD       10A         COLHDG('MODUL')
     A            R012FIL       10A         COLHDG('FILNAVN')
     A            R012ST         1A         COLHDG('STATUS')
     A            R012DT         8S 0       COLHDG('START DATO')
     A            R012TM         6S 0       COLHDG('START TID')
     A          K R012MOD
     A          K R012ST
     A          K R012FIL
