********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FRITEKST FOR OVERSJØ SYSTEM
12240 * 02 YBC PTF12 NYE FELTER FOR KOLLI OG KODE
********************************************************************
     A          R SIDE2
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A                                  3 71MSGCON(12 DIV3311 SYMSGF)
     A            BLAVD          4  0   3 84
     A                                  3 88'/'
     A            BLOPD          7  0   3 89
     A                                  3 96'/'
     A            BLSG           3      3 97
     A                                  4 71MSGCON(12 DIV3312 SYMSGF)
     A            UDT3           2  0   4 84
     A                                  4 86'.'
     A            UDT2           2  0   4 87
     A                                  4 89'.'
     A            UDT1           2  0   4 90
     A                                  6  3MSGCON(21 DIV3313 SYMSGF)
     A            XOBNAV        30      6 26
     A                                  6 70MSGCON(18 DIV3314 SYMSGF)
     A            BLREIS        14      6 90
     A                                  7  3MSGCON(21 DIV3315 SYMSGF)
     A            XLSTN         30      7 26
     A                                  7 70MSGCON(18 DIV3316 SYMSGF)
     A            XLSTHN        30      7 90
     A                                  8  3MSGCON(21 DIV3317 SYMSGF)
     A            XVIAHN        30      8 26
     A                                  8 70MSGCON(18 DIV3318 SYMSGF)
     A            XLOSHN        30      8 90
     A                                  9  3MSGCON(21 DIV3319 SYMSGF)
     A            XLOSN         30      9 26
     A                                  9 70MSGCON(18 DIV3320 SYMSGF)
     A            XLBNAV        30      9 90
     A                                 10  1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
S02  A*                                11 11MSGCON(100 DIV3322 SYMSGF)
N02  A                                 11 11MSGCON(108 DIV3322 SYMSGF)
     A                                      HIGHLIGHT
     A                                 12  1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
      *
     A          R TOMS2                     SPACEB(1)
     A                                     1' '
      *
     A          R SIDE2D                    SPACEB(1)
     A            BVMN          17        11
     A            BVFT2         40        36
S02  A* 96        BVVKT          9  0     82EDTCDE(1)
S02  A* 32        BVM3           9  3     99EDTCDE(1)
N02  A  96        BVVKT          9  0     80EDTCDE(1)
N02  A  32        BVM3           9  3     93EDTCDE(1)
N02  A  31        BVNT           5  0    107EDTCDE(1)
N02  A            BVKDC          2       115
N01   *
N01  A          R SIDE2DOS                  SPACEB(1)
N01  A            BVFTOS       100        11
      *
     A          R SIDE2S                    SPACEB(1)
     A                                     1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
     A                                      SPACEA(1)
     A                                    69MSGCON(10 DIV3323 SYMSGF)
S02  A*N96                                92'0'
S02  A* 96        XSUMVK         9  0     81EDTCDE(1)
S02  A*N32                               105'0.000'
S02  A* 32        XSUMKB         9  3     99EDTCDE(1)
N02  A N96                                90'0'
N02  A  96        XSUMVK         9  0     80EDTCDE(1)
N02  A N32                                99'0.000'
N02  A  32        XSUMKB         9  3     93EDTCDE(1)
N02  A N31                               111'0'
N02  A  31        XSUMKL         5  0    107EDTCDE(1)
