     A*%%TS  SD  20180723  083248  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HELP
     A          R VARELI
     A*%%TS  SD  20180723  083248  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avbryt')
     A                                      CF12(03)
     A                                      OVERLAY
     A                                  1  3'SYSPED/SYTRFIX'
     A                                      COLOR(BLU)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A            WSTRAN         8Y 0B 12 31EDTCDE(4)
     A            WSDATO         8Y 0B 14 31EDTCDE(4)
     A                                 13  4'Alle turer til og med    '
     A                                  1 21'Sett merke for avregnet/oppgjort p-
     A                                      å alle turer'
     A                                      COLOR(WHT)
     A                                  2 21'for gitt transportør (til og med g-
     A                                      itt dato)   '
     A                                      COLOR(WHT)
     A                                 12  4'Transportørnummer.....'
     A                                 14 41'På formen HHÅÅMMDD (f.eks. 2000113-
     A                                      1)'
     A                                 14  4'dato (turens fradato)....'
     A                                 22  4'ENTER=Oppdater     F12=Avbryt'
     A                                      COLOR(BLU)
     A                                 17  4'(Rutinen setter  X  i et felt TUAV-
     A                                      RE i registeret TURER)             -
     A                                          '
     A                                 18  4'(I tillegg legges det høyrestilt i-
     A                                       sjåførnavn2 <SYTRFIX + dato for kj-
     A                                      øring>'
     A                                 19  5'slik at en skal kunne vite at det -
     A                                      er dette fix-programmet som har sat-
     A                                      t X)'
     A                                  4  4'OBS! Programmet bør kun brukes når-
     A                                       en transportør har endret kategori-
     A                                       fra '
     A                                  5  4'1=Sender faktura til 0=Skal avregn-
     A                                      es. Da vil det være behov for å <fj-
     A                                      erne>'
     A                                  6  4'gamle turer (ved å sette X i avreg-
     A                                      net-status) slik at de ikke skal du-
     A                                      kke  '
     A                                  7  4'opp i avregningslista.            -
     A                                                                         -
     A                                           '
     A                                 10  4MSGCON(022 SHU1848 *LIBL/SYMSGF)
     A            WSTUR          8Y 0B 10 31EDTCDE(Z)
     A  70                                  DSPATR(RI)
     A                                 10 42MSGCON(017 SHU1849 *LIBL/SYMSGF)
     A            WSTURS         8  0O 10 61COLOR(RED)
