     A*%%TS  SD  20180924  090420  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(*LIBL/FAK3)
     A                                      PRINT
     A                                      CF03(03 'Exit')
     A          R NOREC
     A                                      TEXT('Select')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A                                      CF12(12)
     A                                      CF06(06 'LAG NY')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYTR04K'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(045 SHU1889 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  3  2MSGCON(040 DIV2055 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
S01  A*                                 5  1MSGCON(078 JOV0439 *LIBL/SYMSGF)
S01  A*                                     COLOR(WHT)
S01  A*           TOPOPT         1   B  6  2
S01  A*           WSKN           8Y 0B  6  5
S01  A*                                     EDTCDE(4)
S01  A* 51                                  DSPATR(PR)
S01  A* 51                                  COLOR(WHT)
S01  A*           TOPAVD         4Y 0B  6 46EDTCDE(4)
     A                                 23  2MSGCON(010 DIV2056 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 17MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R SUBFIL                    SFL
     A*%%TS  SD  20180924  060940  SVEIN       REL-V7R1M0  5770-WDS
     A                                      TEXT('SUBFILE')
     A            WSNR           1A  B  7  2VALUES(' ' '2' '4' '1' '3')
     A            UNSAVD         4S 0O  7  5
     A            UNVAL          3A  O  7 12
     A            UNKMP          5Y 2O  7 16EDTCDE(4)
     A            UNVALE         3A  O  7 25
     A            UNKMPE         5Y 2O  7 29EDTCDE(4)
     A            UNVALI         3A  O  7 38
     A            UNKMPI         5Y 2O  7 42EDTCDE(4)
     A            KOANVN        33A  O  7 50
     A*
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20180924  090420  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      TEXT('SUBCTL')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF05(05 'Forny')
     A                                      CF06(06 'LAG NY')
     A                                      CF12(12 'Annuller')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYTR04K'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(045 SHU1889 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 83DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(007 SHU1891 *LIBL/SYMSGF)
     A            UNBILN        10A  O  2 11
     A                                  2 23MSGCON(012 SHU1892 *LIBL/SYMSGF)
     A            UNTRAN         8S 0O  2 37
     A            UNAVN         30A  O  2 46
     A                                  2 83TIME
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(040 DIV2057 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 78SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  6  1MSGCON(100 SHU1888 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(040 SHU1894 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BOTREC
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 41MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 61MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BLANKREC                  TEXT('Message')
     A                                      OVERLAY
     A            ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
     A            ZMSGNO         7A  P
     A          R CHGREC
     A*%%TS  SD  20180924  062135  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Annuller')
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            WSSAVD         4Y 0O 23  5
     A            WSVAL          3A  B 23 12
     A  71                                  DSPATR(RI)
     A            WSKMP          5Y 2B 23 16EDTCDE(4)
     A            WSVALE         3A  B 23 25
     A  72                                  DSPATR(RI)
     A            WSKMPE         5Y 2B 23 29EDTCDE(4)
     A            WSVALI         3A  B 23 38
     A  73                                  DSPATR(RI)
     A            WSKMPI         5Y 2B 23 42EDTCDE(4)
     A                                 24  3MSGCON(040 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22  1MSGCON(100 SHU1888 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
N01  A            MSGNR          7A  P
N01  A  30        MSGTXT        78A  O 25  2MSGID(&MSGNR SYMSGF)
N01  A                                      COLOR(RED)
     A          R NEWREC
     A*%%TS  SD  20180924  062135  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Annuller')
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            WSSAVD         4Y 0B 23  5
     A  70                                  DSPATR(RI)
     A            WSVAL          3A  B 23 12
     A  71                                  DSPATR(RI)
     A            WSKMP          5Y 2B 23 16EDTCDE(4)
     A            WSVALE         3A  B 23 25
     A  72                                  DSPATR(RI)
     A            WSKMPE         5Y 2B 23 29EDTCDE(4)
     A            WSVALI         3A  B 23 38
     A  73                                  DSPATR(RI)
     A            WSKMPI         5Y 2B 23 42EDTCDE(4)
     A                                 24  3MSGCON(040 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22  1MSGCON(100 SHU1888 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
N01  A            MSGNR          7A  P
N01  A  30        MSGTXT        78A  O 25  2MSGID(&MSGNR SYMSGF)
N01  A                                      COLOR(RED)
