     A*%%TS  SD  20150521  081910  SVEIN       REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10261A* 01 YBC PTF10 VEKT/KUBIKK/KOLLI I TURER ER ENDRET TIL 9.0, 7.3 OG 7.0
     A*        BRINGTMS-PROSJEKT
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYTR88CPNL)
     A                                      HLPTITLE('PLUKKE OPPDRAG TIL TUR (T-
     A                                      RANSPORTMODULEN)')
     A                                      ALTHELP
     A                                      HELP
     A          R SUBFIL                    SFL
S10  A*           WSNR           1A  I  9  2VALUES(' ' '1' '5' 'L' 'A')
N10  A            WSNR           1A  I  9  2VALUES(' ' '1' '5' 'L' 'A' 'H')
     A            IMCO           1A  O  9  4COLOR(RED)
     A            HEAVD          4Y 0O  9  6EDTCDE(4)
     A            HEOPD          7Y 0O  9 11EDTCDE(4)
     A            HEOT           2A  O  9 19
     A  59                                  DSPATR(RI)
     A            HEFR           3A  O  9 22
     A            HESDF          5A  O  9 26
     A            WRSDFD         6S 0O  9 32
     A            TRSTAF         1A  O  9 39DSPATR(HI)
     A            HESDT          5A  O  9 41
     A            WRSDTD         6S 0O  9 47
     A            TRSTAE         1A  O  9 54DSPATR(HI)
     A            HENT           7Y 0H
     A            HENT4          4Y 0O  9 56EDTCDE(4)
     A            HEVKTW         5Y 0O  9 61EDTCDE(4)
     A            HEM3           7Y 3H
     A            WSM3SU         4Y 1O  9 67EDTCDE(4)
     A            HELMLA         4Y 2O  9 73EDTCDE(4)
     A            HEST           1A  O  9 79
N13  A            TTSTAT         8   O  9 82
N13  A  76                                  COLOR(RED)
N13  A  77                                  COLOR(YLW)
     A            HENAS         30   O 10  5DSPATR(UL)
     A  55                                  DSPATR(RI)
     A  71                                  COLOR(PNK)
     A            HENAK         30A  O 10 36DSPATR(UL)
     A            HEVS10        10A  O 10 67DSPATR(UL)
     A            ETTE           1A  O 10 78COLOR(RED)
     A            FAREKL         7A  O 10 80COLOR(RED)
     A*
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20150521  081910  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF03(03 'Avslutt')
     A                                      CF05(05 'FORNY')
     A                                      CF12(12 'FORRIGE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYSPED/SYTR88C'
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(030 DIV4024 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(009 DIV0050 *LIBL/SYMSGF)
     A            TUAVD          4Y 0O  2 12EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 22MSGCON(011 DIV4023 *LIBL/SYMSGF)
     A            TUPRO          8Y 0O  2 34EDTCDE(4)
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  2 35SFLRCDNBR
     A                                      DSPATR(ND)
     A            TURUND         8Y 0O  2 43EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 53MSGCON(006 DIV0683 *LIBL/SYMSGF)
     A            TUSDF         20A  O  2 60COLOR(WHT)
     A                                  3  2MSGCON(009 DIV4021 *LIBL/SYMSGF)
     A            TUBILN    R        O  3 12REFFLD(TURERR/TUBILN *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TULK      R        O  3 23REFFLD(TURERR/TULK *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TUHENG    R        O  3 27REFFLD(TURERR/TUHENG *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TULKH     R        O  3 38REFFLD(TURERR/TULKH *LIBL/TURER)
     A                                      COLOR(WHT)
     A                                  3 53MSGCON(006 DIV0685 *LIBL/SYMSGF)
     A            TUSDT         20A  O  3 60COLOR(WHT)
     A                                  4  2MSGCON(008 DIV0686 *LIBL/SYMSGF)
     A            TUKNT2         8Y 0O  4 12EDTCDE(4)
     A                                      COLOR(WHT)
     A            TUNAT         30A  O  4 21COLOR(WHT)
     A                                  4 53MSGCON(006 DIV4022 *LIBL/SYMSGF)
     A            WSDAFR         6S 0O  4 60COLOR(WHT)
     A                                  4 67'----->'
     A            WSDATI         6S 0O  4 74COLOR(WHT)
     A                                  5  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 35'1=Plukk til tur'
     A                                      COLOR(BLU)
     A                                  5 52'A=Arkiv'
     A                                      COLOR(BLU)
     A                                  5 67'L=Logg(T&T)'
     A                                      COLOR(BLU)
S13  A*                                 6  1MSGCON(130 YBC0093 *LIBL/SYMSGF)
N13  A                                  6  1MSGCON(130 JOV1800 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
S13  A*                                 7  5MSGCON(075 YBC0094 *LIBL/SYMSGF)
N13  A                                  7  5MSGCON(125 JOV1799 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           1A  B  8  2VALUES(' ' '1' '5')
     A                                      DSPATR(UL)
     A            W2AVD          4Y 0B  8  6EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  8 11EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPDT         2A  B  8 19DSPATR(UL)
     A            W2SDF          5A  B  8 26DSPATR(UL)
     A            W2SDFD         6S 0B  8 32DSPATR(UL)
     A            W2SDT          5A  B  8 41DSPATR(UL)
     A                                  8 48MSGCON(014 YBC0095 *LIBL/SYMSGF)
     A            W2SONF         5A  B  8 63DSPATR(UL)
     A            W2SONT         5A  B  8 69DSPATR(UL)
     A*
     A          R BUNN
     A*%%TS  SD  20150217  095119  SVEIN       REL-V7R1M0  5770-WDS
     A            MSGNR          7A  P
     A                                 21  2'Kll'
     A            WSNT           7Y 0O 21  6COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 14'Vkt'
     A            WSVKT          9Y 0O 21 18COLOR(WHT)
     A                                      EDTCDE(4)
     A            TUTARA         5Y 0O 21 28COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSBER1         9Y 0O 21 34COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 44'M3'
     A            WSM3           7Y 3O 21 47COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 56'LML'
     A            WSLMLA         4Y 2O 21 60COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'LMF'
     A            WSLM           4Y 2O 21 70COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 76MSGCON(005 SHU1511 *LIBL/SYMSGF)
     A            WSPOEN         5S 0O 21 82COLOR(WHT)
     A                                 21 89MSGCON(006 DIV0697 *LIBL/SYMSGF)
     A            WSNTO          5Y 0O 21 96COLOR(WHT)
     A                                      EDTCDE(4)
     A            TUKVKT         9Y 0O 22 18COLOR(WHT)
     A                                      EDTCDE(4)
     A            TUBER2         9Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A            TUKAM3         7Y 3O 22 47COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 56'LML'
     A            TUKALM         4Y 2O 22 60COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23 22MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R NYWRK
     A                                      CF03(03 'Avslutt')
     A                                      CF05(05 'FORNY')
     A                                      CF12(12 'FORRIGE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYSPED/SYTR88C'
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(030 DIV4024 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(009 DIV0050 *LIBL/SYMSGF)
     A            TUAVD          4Y 0O  2 12EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 22MSGCON(011 DIV4023 *LIBL/SYMSGF)
     A            TUPRO          8Y 0O  2 34EDTCDE(4)
     A                                      COLOR(WHT)
     A            TURUND         8Y 0O  2 43EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 53MSGCON(006 DIV0683 *LIBL/SYMSGF)
     A            TUSDF         20A  O  2 60COLOR(WHT)
     A                                  3  2MSGCON(009 DIV4021 *LIBL/SYMSGF)
     A            TUBILN    R        O  3 12REFFLD(TURERR/TUBILN *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TULK      R        O  3 23REFFLD(TURERR/TULK *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TUHENG    R        O  3 27REFFLD(TURERR/TUHENG *LIBL/TURER)
     A                                      COLOR(WHT)
     A            TULKH     R        O  3 38REFFLD(TURERR/TULKH *LIBL/TURER)
     A                                      COLOR(WHT)
     A                                  3 53MSGCON(006 DIV0685 *LIBL/SYMSGF)
     A            TUSDT         20A  O  3 60COLOR(WHT)
     A                                  4  2MSGCON(008 DIV0686 *LIBL/SYMSGF)
     A            TUKNT2         8Y 0O  4 12EDTCDE(4)
     A                                      COLOR(WHT)
     A            TUNAT         30A  O  4 21COLOR(WHT)
     A                                  4 53MSGCON(006 DIV4022 *LIBL/SYMSGF)
     A            WSDAFR         6S 0O  4 60COLOR(WHT)
     A                                  4 67'----->'
     A            WSDATI         6S 0O  4 74COLOR(WHT)
     A                                  5  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 35MSGCON(018 DIV0700 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
S13  A*                                 6  1MSGCON(130 YBC0093 *LIBL/SYMSGF)
N13  A                                  6  1MSGCON(130 JOV1800 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
S13  A*                                 7  5MSGCON(075 YBC0094 *LIBL/SYMSGF)
N13  A                                  7  5MSGCON(125 JOV1799 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           1A  B  8  2VALUES(' ' '1' '5')
     A                                      DSPATR(UL)
     A            W2AVD          4Y 0B  8  6EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  8 11EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPDT         2A  B  8 19DSPATR(UL)
     A            W2SDF          5A  B  8 26DSPATR(UL)
     A            W2SDFD         6S 0B  8 32DSPATR(UL)
     A            W2SDT          5A  B  8 41DSPATR(UL)
     A                                  8 48MSGCON(014 YBC0095 *LIBL/SYMSGF)
     A            W2SONF         5A  B  8 63DSPATR(UL)
     A            W2SONT         5A  B  8 69DSPATR(UL)
     A                                 23 22MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
