     A*%%TS  SD  20221006  160250  JOVO        REL-V7R4M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 MISTER KUBIKK ETTER UTVIDELSE AV OPPDRAGSNR
N02  A* NYE FILTER  32 ON = PROTECT/NONDISPLAY EKSTRAFILTER
     A*        BRINGTMS-PROSJEKT
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Avslutt')
     A                                      CF10(10 'TUR-INNHOLD')
     A                                      CF11(11 'HENTE-OPPDR')
     A                                      CF13(13 'E-SNDINGER')
     A                                      CF22(22 'HURTIGBOOK')
     A                                      HLPPNLGRP(HLPSCR SYTR33PNL)
     A                                      HLPTITLE('ARBEIDE MED ORDRE (TRANSP-
     A                                      ORTMODULEN)')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE02
     A*%%TS  SD  20221006  160250  JOVO        REL-V7R4M0  5770-WDS
     A                                      CF02(02 'PROTECT FILTER')
     A                                      CF04(04 'Søke')
     A                                      CF05(05 'FORNY')
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR330500 SYTR33PNL)
     A                                      HLPARA(02 001 03 080)
     A          H                           HLPPNLGRP(SYTR330510 SYTR33PNL)
     A                                      HLPARA(04 001 04 080)
     A          H                           HLPPNLGRP(SYTR330520 SYTR33PNL)
     A                                      HLPARA(05 001 05 080)
     A          H                           HLPPNLGRP(SYTR330530 SYTR33PNL)
     A                                      HLPARA(06 001 06 080)
     A          H                           HLPPNLGRP(SYTR330540 SYTR33PNL)
     A                                      HLPARA(07 001 07 007)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(07 008 07 008)
     A          H                           HLPPNLGRP(SYTR330540 SYTR33PNL)
     A                                      HLPARA(07 010 07 015)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(07 016 07 016)
     A          H                           HLPPNLGRP(SYTR330540 SYTR33PNL)
     A                                      HLPARA(07 017 07 080)
     A          H                           HLPPNLGRP(SYTR330550 SYTR33PNL)
     A                                      HLPARA(08 001 08 007)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(08 008 08 008)
     A          H                           HLPPNLGRP(SYTR330550 SYTR33PNL)
     A                                      HLPARA(08 010 08 015)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(08 016 08 016)
     A          H                           HLPPNLGRP(SYTR330550 SYTR33PNL)
     A                                      HLPARA(08 017 08 080)
     A          H                           HLPPNLGRP(SYTR330560 SYTR33PNL)
     A                                      HLPARA(09 001 09 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(10 001 10 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(10 036 10 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(11 001 11 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(11 036 11 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(12 001 12 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(12 036 12 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(13 001 13 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(13 036 13 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(14 001 14 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(14 036 14 080)
     A          H                           HLPPNLGRP(SYTR330570 SYTR33PNL)
     A                                      HLPARA(15 001 15 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(15 036 15 080)
     A          H                           HLPPNLGRP(SYTR330580 SYTR33PNL)
     A                                      HLPARA(16 001 16 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(16 036 16 080)
     A          H                           HLPPNLGRP(SYTR330580 SYTR33PNL)
     A                                      HLPARA(17 001 17 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(17 036 17 080)
     A          H                           HLPPNLGRP(SYTR330580 SYTR33PNL)
     A                                      HLPARA(18 001 18 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(18 036 18 080)
     A          H                           HLPPNLGRP(SYTR330580 SYTR33PNL)
     A                                      HLPARA(19 001 19 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(19 036 19 080)
     A          H                           HLPPNLGRP(SYTR330580 SYTR33PNL)
     A                                      HLPARA(20 001 20 035)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(20 036 20 080)
     A          H                           HLPPNLGRP(SYTR330590 SYTR33PNL)
     A                                      HLPARA(21 001 21 080)
     A          H                           HLPPNLGRP(SYTR330600 SYTR33PNL)
     A                                      HLPARA(22 001 23 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGN2K         7A  P
     A            MSGN2L         7A  P
     A            MSGN2M         7A  P
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTR33'
     A                                      COLOR(BLU)
     A  61                              1 20MSGCON(030 DIV4061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  60                              1 20MSGCON(030 DIV0044 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1116TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(010 YBC0065 *LIBL/SYMSGF)
     A            WSAVDU         4S 0O  2 14COLOR(WHT)
     A                                  2 20MSGCON(045 JOV0208 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 67MSGCON(055 JOV0209 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  66                              3  2'Sendingsnummer.'
     A  66        WSSNDN        20A  B  3 20DSPATR(UL)
     A  66                                  DSPATR(PC)
     A                                      COLOR(GRN)
     A                                  4  2MSGCON(015 DIV1497 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  4 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A                                  4 25MSGCON(024 DIV0457 *LIBL/SYMSGF)
     A                                  4 51MSGCON(009 SHU1664 *LIBL/SYMSGF)
     A            UFAKT          1A  B  4 61COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A                                  5  2MSGCON(015 DIV0053 *LIBL/SYMSGF)
     A            WSOPD          7Y 0B  5 20DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S02  A*                                 5 46MSGCON(023 JOV1536 *LIBL/SYMSGF)
     A                                  5 46MSGCON(020 JOV1536 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  37                              5 67MSGCON(010 JOV1556 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N37                              5 67MSGCON(010 JOV1557 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            WSDIST         1A  B  6  2COLOR(YLW)
     A                                  6 20MSGCON(025 DIV4081 *LIBL/SYMSGF)
     A                                  6 46MSGCON(011 JOV1537 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A            WSVKTO         5Y 0B  6 58DSPATR(UL)
     A  37                                  DSPATR(PR)
     A  37                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
     A                                  6 64MSGCON(006 JOV1538 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A            WSVKTU         5Y 0B  6 71DSPATR(UL)
     A  37                                  DSPATR(PR)
     A  37                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
     A                                  6 78'Kun frankat.:'
     A  37                                  DSPATR(ND)
     A            WSKFR          3A  B  6 92
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  37                                  DSPATR(PR)
     A            WSSTEF         5A  B  7  2COLOR(YLW)
     A            WXSTEF         1A  B  7  8
     A            WSSTET         5A  B  7 10COLOR(YLW)
     A            WXSTET         1A  B  7 16
     A                                  7 20MSGCON(025 DIV3805 *LIBL/SYMSGF)
     A                                  7 46MSGCON(035 JOV1539 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A            WSSONF         5A  B  8  2COLOR(YLW)
     A            WXSONF         1A  B  8  8
     A            WSSONT         5A  B  8 10COLOR(YLW)
     A            WXSONT         1A  B  8 16
     A                                  8 20MSGCON(025 DIV3806 *LIBL/SYMSGF)
     A                                  8 46MSGCON(004 JOV1540 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A            WSHNAV        12A  B  8 51
     A  37                                  DSPATR(PR)
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                  8 64MSGCON(004 JOV1541 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A            WSLNAV        12A  B  8 69
     A  37                                  DSPATR(PR)
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSDATO         6Y 0B  9  2EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  9  9'('
     A            WSDATT         6Y 0B  9 11EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  9 18')'
     A                                  9 20MSGCON(025 JOV1542 *LIBL/SYMSGF)
     A                                  9 46'Kun mine avd:'
     A  37                                  DSPATR(ND)
     A            WSMIAV         1A  B  9 60
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  37                                  DSPATR(PR)
     A                                  9 64'Kun hen.stat:'
     A  37                                  DSPATR(ND)
     A            WSHSTAT        2A  B  9 78
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  37                                  DSPATR(PR)
     A                                 10  2MSGCON(015 DIV3770 *LIBL/SYMSGF)
     A            WSOPDT         2A  B 10 20
     A            WXOPDT         1A  B 10 36
     A                                 11  2MSGCON(015 SHU0725 *LIBL/SYMSGF)
     A            WSNRAG         8Y 0B 11 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXNRAG         1A  B 11 36
     A                                 12  2MSGCON(015 SHU0010 *LIBL/SYMSGF)
     A            WSHAWN         9A  B 12 20
     A            WXHAWN         1A  B 12 36
     A                                 13  2MSGCON(015 SHU1151 *LIBL/SYMSGF)
     A            WSAGNR         8Y 0B 13 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXAGNR         1A  B 13 36
     A            WXTRAN         1A  B 13 42VALUES(' ' 'T')
     A                                 13 45MSGCON(015 SHU1152 *LIBL/SYMSGF)
     A                                 14  2MSGCON(015 SHU1509 *LIBL/SYMSGF)
     A            WSRFA         35A  B 14 20DSPATR(UL)
     A  48                                  DSPATR(PC)
     A                                      COLOR(GRN)
     A            WXRFA          1A  B 14 56
     A                                 15  2MSGCON(015 SHU1510 *LIBL/SYMSGF)
     A            WSRFK         35A  B 15 20DSPATR(UL)
     A  48                                  DSPATR(PC)
     A                                      COLOR(GRN)
     A            WXRFK          1A  B 15 56
     A                                 16  2MSGCON(015 JOV0187 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B 16 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXPRO          1A  B 16 36
     A                                 17  2MSGCON(015 DIV0054 *LIBL/SYMSGF)
     A            WSSG           3A  B 17 20DSPATR(UL)
     A  43                                  DSPATR(PC)
     A                                      COLOR(GRN)
     A            WXSG           1A  B 17 36
     A                                 18  2MSGCON(015 JOV0260 *LIBL/SYMSGF)
     A            WSKNSF         8Y 0B 18 20DSPATR(UL)
     A  45                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXKNSF         1A  B 18 36
     A            WXSEVA         1A  B 18 42
     A                                 18 45MSGCON(018 SHU0586 *LIBL/SYMSGF)
     A                                 19  2MSGCON(015 JOV0261 *LIBL/SYMSGF)
     A            WSKNKF         8Y 0B 19 20DSPATR(UL)
     A  46                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXKNKF         1A  B 19 36
     A            WXKJVA         1A  B 19 42
     A                                 19 45MSGCON(018 SHU0586 *LIBL/SYMSGF)
     A                                 20  2MSGCON(015 DIV4080 *LIBL/SYMSGF)
     A            WSGN          15A  B 20 20DSPATR(UL)
     A  44                                  DSPATR(PC)
     A                                      COLOR(GRN)
     A            WXGN           1A  B 20 36
     A                                 20 45MSGCON(025 JOV0880 *LIBL/SYMSGF)
     A            WSUTEN         1A  B 20 71
     A                                 20 73MSGCON(007 JOV0881 *LIBL/SYMSGF)
     A                                 21  2MSGCON(015 JOV0188 *LIBL/SYMSGF)
     A            WSFN           7Y 0B 21 20DSPATR(UL)
     A  41
     AO 99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
S08  A*                                     CHECK(RB)
     A            WXFN           1A  B 21 36
     A                                 22  2MSGCON(015 SHU0128 *LIBL/SYMSGF)
     A            WSFRI1         3A  B 22 20
     A            WSFRI2        35A  B 22 24
     A                                 23  2MSGCON(015 JOV1620 *LIBL/SYMSGF)
     A            WSMERK        35A  B 23 20
     A                                 24  2MSGCON(015 JOV1618 *LIBL/SYMSGF)
     A            WSTT           1A  B 24 20
S82  A*                                24 24MSGCON(040 JOV1619 *LIBL/SYMSGF)
N82  A                                 24 24MSGCON(080 JOV1801 *LIBL/SYMSGF)
     A            MSGT2K        18A  O 26  2MSGID(&MSGN2K SYMSGF)
     A                                      COLOR(BLU)
     A            MSGT2L        18A  O 26 22MSGID(&MSGN2L SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 42MSGCON(020 JOV1750 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGT2M        18A  O 26 63MSGID(&MSGN2M SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 10 46'PrebookStat.:'
     A  37                                  DSPATR(ND)
     A            WSPBST         1A  B 10 60
     A  37                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  37                                  DSPATR(PR)
     A                                 10 64MSGCON(030 JOV1759 *LIBL/SYMSGF)
     A  37                                  DSPATR(ND)
     A          R SUBFIL                    SFL
     A*%%TS  SD  20150324  205550  SVEIN       REL-V7R1M0  5770-WDS
     A            DITUAV         4Y 0H
     A            DITUR          8Y 0H
     A            TRSDFD         8S 0H
     A            TRSDTD         8S 0H
     A            HEHAWB         9A  H
     A*           HERFA         15A  H
     A            HERFA         35A  H
     A            HERFK         35A  H
     A            HEGN          15A  H
     A            HEPOS1         7A  H
     A            FSSOK         35A  H
     A            WSNR           2A  B  7  2
     A  30                                  DSPATR(RI)
     A            WXTUR          8Y 0B  7  5EDTCDE(4)
     A  35
     AO 60                                  DSPATR(PR)
     A  60                                  DSPATR(HI)
     A            HEAVD          4Y 0O  7 14EDTCDE(4)
     A            HEOPD          7Y 0O  7 19EDTCDE(4)
     A  88                                  DSPATR(RI)
     A            DISTA1         1A  O  7 27DSPATR(HI)
     A            HESDF          5A  O  7 29
     A            WRSDFD         6Y 0O  7 35EDTCDE(4)
     A  86                                  DSPATR(RI)
     A            TRSDFK         4Y 0O  7 42EDTCDE(4)
     A  86                                  DSPATR(RI)
     A            TRSTAF         1A  O  7 47DSPATR(HI)
     A            HESDT          5A  O  7 50
     A  81                                  COLOR(YLW)
     A            WRSDTD         6Y 0O  7 56EDTCDE(4)
     A  87                                  DSPATR(RI)
     A  81                                  COLOR(YLW)
     A            TRSDTK         4Y 0O  7 63EDTCDE(4)
     A  87                                  DSPATR(RI)
     A            TRSTAE         1A  O  7 68DSPATR(HI)
     A            SFRFA         20A  O  7 72
     A  48
     AO 63
     AO 77                                  COLOR(WHT)
     A            HENLEV         8A  O  7 94
     A  57 58                               DSPATR(ND)
     A  57                                  COLOR(RED)
     A  58                                  COLOR(YLW)
     A            HEOT           2A  O  7103
     A  59                                  DSPATR(RI)
     A            HEFR           3A  O  7106
     A            ETTE           1A  O  7110COLOR(RED)
     A            HEST           1A  O  7112DSPATR(HI)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O  7114EDTCDE(4)
     A            HEM3           7Y 3O  7124EDTCDE(4)
     A            WXHAWB         9A  B  8  5DSPATR(UL)
     A  36
     AO 60                                  DSPATR(PR)
     A            HESG      R        O  8 15REFFLD(HEADFR/HESG *LIBL/HEADF)
     A                                      DSPATR(UL)
     A            DUPASG    R        O  8 19REFFLD(HEADFR/HESG *LIBL/HEADF)
     A                                      DSPATR(UL)
     A            HENAS2        20A  O  8 29DSPATR(UL)
     A  71                                  COLOR(PNK)
     A  69                                  COLOR(WHT)
     A            HENAK2        20A  O  8 50DSPATR(UL)
     A  69                                  COLOR(WHT)
     A            IMCO           1A  O  8 72COLOR(RED)
     A            FAREKL         7A  O  8 74COLOR(RED)
     A            INFTXT        10A  O  8 82COLOR(RED)
     A            ULEST          3A  O  8 94COLOR(RED)
     A            HENT           7Y 0O  8 98DSPATR(UL)
     A                                      EDTCDE(4)
     A  85                                  COLOR(RED)
     A            HEVS15        15A  O  8107DSPATR(UL)
     A            HELM           4Y 2O  8124EDTCDE(4)
     A                                      DSPATR(UL)
     A            QFSU           1A  O  8130COLOR(RED)
     A            QEPOST         1   O  8132COLOR(RED)
     A*
     A*                                     SFLSIZ(0009)
     A*                                     SFLPAG(0008)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20131107  161645  JOVO        REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF02(02 'MODUS')
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØKING')
     A                                      CF09(09 'LAGE NY KOPIMAL')
     A                                      CF12(08)
     A                                      CF16(16 'Udisp. siste først')
     A                                      CF17(17 'Udisp. datosortert')
     A                                      CF20(20 'PLUKK EDIOPPDRAG')
     A                                      CF23(23 'FLERE OPSJONER')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR330010 SYTR33PNL)
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPPNLGRP(SYTR330020 SYTR33PNL)
     A                                      HLPARA(02 001 02 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(04 001 04 003)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(07 001 07 003)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(04 005 04 012)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(07 005 07 012)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(04 014 04 017)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(07 014 07 017)
     A          H                           HLPPNLGRP(SYTR330090 SYTR33PNL)
     A                                      HLPARA(04 019 04 026)
     A          H                           HLPPNLGRP(SYTR330090 SYTR33PNL)
     A                                      HLPARA(07 019 07 026)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(04 027 04 027)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(07 027 07 027)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(04 029 04 034)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(07 029 07 034)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(04 035 04 046)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(07 035 07 046)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(04 047 04 049)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(07 047 07 049)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(04 050 04 055)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(07 050 07 055)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(04 056 04 071)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(07 056 07 071)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(04 055 04 055)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(07 055 07 055)
     A          H                           HLPPNLGRP(SYTR330220 SYTR33PNL)
     A                                      HLPARA(04 072 04 093)
     A          H                           HLPPNLGRP(SYTR330220 SYTR33PNL)
     A                                      HLPARA(07 072 07 093)
     A          H                           HLPPNLGRP(SYTR330225 SYTR33PNL)
     A                                      HLPARA(04 094 04 102)
     A          H                           HLPPNLGRP(SYTR330220 SYTR33PNL)
     A                                      HLPARA(07 094 07 102)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(04 103 04 111)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(07 103 07 111)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(04 112 04 112)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(07 112 07 112)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(04 119 04 130)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(07 119 07 130)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(05 005 05 017)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(08 005 08 017)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(05 024 05 038)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(08 024 08 038)
     A          H                           HLPPNLGRP(SYTR330110 SYTR33PNL)
     A                                      HLPARA(05 040 05 080)
     A          H                           HLPPNLGRP(SYTR330110 SYTR33PNL)
     A                                      HLPARA(08 040 08 080)
     A          H                           HLPPNLGRP(SYTR330030 SYTR33PNL)
     A                                      HLPARA(06 001 06 080)
     A            MSGC1V         7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
S28  A*           WSFRI2        35A  H
     A                                  1  2'SYSPED/SYTR33'
     A                                      COLOR(BLU)
     A  60                              1 27MSGCON(030 DIV0044 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 29MSGCON(030 DIV4061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1116TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  1128SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2  2MSGCON(010 YBC0065 *LIBL/SYMSGF)
     A            WSAVDU         4Y 0B  2 13EDTCDE(4)
     A                                      DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                  2 18MSGCON(008 JOV0189 *LIBL/SYMSGF)
     A N40                              2 27MSGCON(004 YBC0080 *LIBL/SYMSGF)
     A  40                              2 27MSGCON(009 JOV0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40        WSAVD          4Y 0O  2 32EDTCDE(4)
     A                                      COLOR(WHT)
     A  31                              2 37MSGCON(026 JOV0190 *LIBL/SYMSGF)
     A  41                              2 37MSGCON(017 DIV0052 *LIBL/SYMSGF)
     A  42                              2 37MSGCON(017 DIV0053 *LIBL/SYMSGF)
     A  43                              2 37MSGCON(017 DIV0054 *LIBL/SYMSGF)
     A  44                              2 37MSGCON(014 JOV0205 *LIBL/SYMSGF)
     A  45                              2 37MSGCON(017 JOV0260 *LIBL/SYMSGF)
     A  46                              2 37MSGCON(017 JOV0261 *LIBL/SYMSGF)
     A  48                              2 37MSGCON(010 JOV0206 *LIBL/SYMSGF)
     A  49N32                           2 37MSGCON(017 DIV0058 *LIBL/SYMSGF)
     A  49 32                           2 37MSGCON(026 JOV0191 *LIBL/SYMSGF)
     A  51                              2 37MSGCON(016 JOV0193 *LIBL/SYMSGF)
     A  52                              2 37MSGCON(017 JOV0194 *LIBL/SYMSGF)
     A  53                              2 37MSGCON(017 JOV0195 *LIBL/SYMSGF)
     A  28                              2 37MSGCON(017 JOV0196 *LIBL/SYMSGF)
     A  29                              2 37MSGCON(017 JOV0197 *LIBL/SYMSGF)
     A  27                              2 37MSGCON(017 JOV0198 *LIBL/SYMSGF)
     A  50                              2 37MSGCON(017 SHU1153 *LIBL/SYMSGF)
     A  26                              2 37MSGCON(026 JOV0200 *LIBL/SYMSGF)
     A  54                              2 37MSGCON(026 JOV0192 *LIBL/SYMSGF)
     A  55                              2 37MSGCON(026 JOV0217 *LIBL/SYMSGF)
     A  56                              2 37MSGCON(026 JOV0218 *LIBL/SYMSGF)
     A  62                              2 37MSGCON(026 JOV0219 *LIBL/SYMSGF)
     A  63                              2 37MSGCON(010 JOV0257 *LIBL/SYMSGF)
N28  A  79                              2 37MSGCON(010 JOV1620 *LIBL/SYMSGF)
     A  65                              2 37MSGCON(005 JOV1452 *LIBL/SYMSGF)
     A  65        WSSNDN        20A  O  2 43DSPATR(UL)
     A                                      COLOR(WHT)
     A  48        WSRFA15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
N47  A  77        WSRFK15       15A  O  2 48DSPATR(UL)
N47  A                                      COLOR(WHT)
S28  A* 63        WSFRIX        15A  O  2 48DSPATR(UL)
     A  63        WSFRI2        35A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
N28  A  79        WSMERK        35A  O  2 48DSPATR(UL)
N28  A                                      COLOR(WHT)
     A  44        WSGN          15A  O  2 52DSPATR(UL)
     A                                      COLOR(WHT)
     A  51        WSHAWN         9A  O  2 54DSPATR(UL)
     A                                      COLOR(WHT)
     A  41        WSFN           7Y 0O  2 55EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WSOPD          7Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  43        WSSG           3A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  45        WSKNSF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  46        WSKNKF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  49N32     WSPRO          8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  52        WSSTET         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  53        WSSONT         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  28        WSSTEF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  29        WSSONF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  27        WSOPDT         2A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  50        WSAGNR         8Y 0O  2 55DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 98MSGCON(009 JOV0204 *LIBL/SYMSGF)
     A            WSDATO         6Y 0O  2108DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2116MSGCON(009 JOV1617 *LIBL/SYMSGF)
     A            WSDATT         6Y 0O  2126DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            MSGC1T       130A  O  3  2MSGID(&MSGC1V SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(130 JOV1614 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N69                              5  5MSGCON(128 JOV1615 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  69                              5  5MSGCON(128 JOV1616 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           2A  B  6  2DSPATR(UL)
     A            W2TUR          8Y 0B  6  5EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2AVD          4Y 0B  6 14EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  6 19EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2STA1         1A  B  6 27DSPATR(UL)
     A            W2SDF          5A  B  6 29DSPATR(UL)
     A            W2SDFD         6Y 0B  6 35EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2SDT          5A  B  6 50DSPATR(UL)
     A            W2RFA         20A  B  6 72DSPATR(UL)
     A            W2TT           1A  B  6 94DSPATR(UL)
     A            W2OT           2A  B  6103DSPATR(UL)
      *
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SYTR330300 SYTR33PNL)
     A                                      HLPARA(22 001 23 080)
     A            MSGB1T        18A  O 25  2MSGID(&MSGB1V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB2T        18A  O 25 22MSGID(&MSGB2V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB3T        18A  O 25 42MSGID(&MSGB3V SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A            MSGB1V         7A  P
     A            MSGB2V         7A  P
     A            MSGB3V         7A  P
     A*
     A          R NYVARE
     A*%%TS  SD  20131107  161645  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF02(02 'MODUS')
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØKING')
     A                                      CF09(09 'LAGE NY KOPIMAL')
     A                                      CF12(08)
     A                                      CF16(16 'Udisp. siste først')
     A                                      CF17(17 'Udisp. datosortert')
     A                                      CF20(20 'PLUKK EDIOPPDRAG')
     A                                      CF23(23 'FLERE OPSJONER')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR330010 SYTR33PNL)
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPPNLGRP(SYTR330020 SYTR33PNL)
     A                                      HLPARA(02 001 02 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(04 001 04 003)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(07 001 07 003)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(04 005 04 012)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(07 005 07 012)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(04 014 04 017)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(07 014 07 017)
     A          H                           HLPPNLGRP(SYTR330090 SYTR33PNL)
     A                                      HLPARA(04 019 04 023)
     A          H                           HLPPNLGRP(SYTR330090 SYTR33PNL)
     A                                      HLPARA(07 019 07 023)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(04 025 04 025)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(07 025 07 025)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(04 027 04 031)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(07 027 07 031)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(04 033 04 038)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(07 033 07 038)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(04 040 04 040)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(07 040 07 040)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(04 042 04 046)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(07 042 07 046)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(04 048 04 053)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(07 048 07 053)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(04 055 04 055)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(07 055 07 055)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(04 057 04 064)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(07 057 07 064)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(04 066 04 066)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(07 066 07 066)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(04 068 04 080)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(07 068 07 080)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(05 005 05 017)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(08 005 08 017)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(05 024 05 038)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(08 024 08 038)
     A          H                           HLPPNLGRP(SYTR330110 SYTR33PNL)
     A                                      HLPARA(05 040 05 080)
     A          H                           HLPPNLGRP(SYTR330110 SYTR33PNL)
     A                                      HLPARA(08 040 08 080)
     A          H                           HLPPNLGRP(SYTR330030 SYTR33PNL)
     A                                      HLPARA(06 001 06 080)
     A            MSGC1V         7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
S28  A*           WSFRI2        35A  H
     A                                  1  2'SYSPED/SYTR33'
     A                                      COLOR(BLU)
     A  60                              1 27MSGCON(030 DIV0044 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 29MSGCON(030 DIV4061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1116TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(010 YBC0065 *LIBL/SYMSGF)
     A            WSAVDU         4Y 0B  2 13EDTCDE(4)
     A                                      DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                  2 18MSGCON(008 JOV0189 *LIBL/SYMSGF)
     A N40                              2 27MSGCON(004 YBC0080 *LIBL/SYMSGF)
     A  40                              2 27MSGCON(009 JOV0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40        WSAVD          4Y 0O  2 32EDTCDE(4)
     A                                      COLOR(WHT)
     A  31                              2 37MSGCON(026 JOV0190 *LIBL/SYMSGF)
     A  41                              2 37MSGCON(017 DIV0052 *LIBL/SYMSGF)
     A  42                              2 37MSGCON(017 DIV0053 *LIBL/SYMSGF)
     A  43                              2 37MSGCON(017 DIV0054 *LIBL/SYMSGF)
     A  44                              2 37MSGCON(014 JOV0205 *LIBL/SYMSGF)
     A  45                              2 37MSGCON(017 JOV0260 *LIBL/SYMSGF)
     A  46                              2 37MSGCON(017 JOV0261 *LIBL/SYMSGF)
     A  48                              2 37MSGCON(010 JOV0206 *LIBL/SYMSGF)
     A  49N32                           2 37MSGCON(017 DIV0058 *LIBL/SYMSGF)
     A  49 32                           2 37MSGCON(026 JOV0191 *LIBL/SYMSGF)
     A  51                              2 37MSGCON(016 JOV0193 *LIBL/SYMSGF)
     A  52                              2 37MSGCON(017 JOV0194 *LIBL/SYMSGF)
     A  53                              2 37MSGCON(017 JOV0195 *LIBL/SYMSGF)
     A  28                              2 37MSGCON(017 JOV0196 *LIBL/SYMSGF)
     A  29                              2 37MSGCON(017 JOV0197 *LIBL/SYMSGF)
     A  27                              2 37MSGCON(017 JOV0198 *LIBL/SYMSGF)
     A  50                              2 37MSGCON(017 SHU1153 *LIBL/SYMSGF)
     A  26                              2 37MSGCON(026 JOV0200 *LIBL/SYMSGF)
     A  54                              2 37MSGCON(026 JOV0192 *LIBL/SYMSGF)
     A  55                              2 37MSGCON(026 JOV0217 *LIBL/SYMSGF)
     A  56                              2 37MSGCON(026 JOV0218 *LIBL/SYMSGF)
     A  62                              2 37MSGCON(026 JOV0219 *LIBL/SYMSGF)
     A  63                              2 37MSGCON(010 JOV0257 *LIBL/SYMSGF)
N28  A  79                              2 37MSGCON(010 JOV1620 *LIBL/SYMSGF)
     A  65                              2 37MSGCON(005 JOV1452 *LIBL/SYMSGF)
     A  65        WSSNDN        20A  O  2 43DSPATR(UL)
     A                                      COLOR(WHT)
     A  48        WSRFA15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  77        WSRFK15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
S28  A* 63        WSFRIX        15A  O  2 48DSPATR(UL)
     A  63        WSFRI2        35A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
N28  A  79        WSMERK        35A  O  2 48DSPATR(UL)
N28  A                                      COLOR(WHT)
     A  44        WSGN          15A  O  2 52DSPATR(UL)
     A                                      COLOR(WHT)
     A  51        WSHAWN         9A  O  2 54DSPATR(UL)
     A                                      COLOR(WHT)
     A  41        WSFN           7Y 0O  2 55EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WSOPD          7Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  43        WSSG           3A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  45        WSKNSF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  46        WSKNKF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  49N32     WSPRO          8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  52        WSSTET         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  53        WSSONT         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  28        WSSTEF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  29        WSSONF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  27        WSOPDT         2A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  50        WSAGNR         8Y 0O  2 55DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 98MSGCON(009 JOV0204 *LIBL/SYMSGF)
     A            WSDATO         6Y 0O  2108DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2116MSGCON(009 JOV1617 *LIBL/SYMSGF)
     A            WSDATT         6Y 0O  2126DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            MSGC1T       130A  O  3  2MSGID(&MSGC1V SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(130 JOV1614 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N69                              5  5MSGCON(128 JOV1615 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  69                              5  5MSGCON(128 JOV1616 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           2A  B  6  2DSPATR(UL)
     A            W2TUR          8Y 0B  6  5EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2AVD          4Y 0B  6 14EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  6 19EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2STA1         1A  B  6 27DSPATR(UL)
     A            W2SDF          5A  B  6 29DSPATR(UL)
     A            W2SDFD         6Y 0B  6 35EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2SDT          5A  B  6 50DSPATR(UL)
     A            W2RFA         20A  B  6 72DSPATR(UL)
     A            W2TT           1A  B  6 94DSPATR(UL)
     A            W2OT           2A  B  6103DSPATR(UL)
     A            MSGB1T        18A  O 25  2MSGID(&MSGB1V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB2T        18A  O 25 22MSGID(&MSGB2V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB3T        18A  O 25 42MSGID(&MSGB3V SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A            MSGB1V         7A  P
     A            MSGB2V         7A  P
     A            MSGB3V         7A  P
     A*-----------------------
     A*  SUBFI2
     A*-----------------------
     A          R SUBFI2                    SFL
     A*%%TS  SD  20131002  104203  JOVO        REL-V7R1M0  5770-WDS
     A            DITUAV         4Y 0H
     A            DITUR          8Y 0H
     A            TRSDFD         8S 0H
     A            TRSDTD         8S 0H
     A            HEHAWB         9A  H
     A            UHSTAT         2A  H
     A            HERFA         35A  H
     A            HERFK         35A  H
     A            HEGN          15A  H
     A            HEPOS1         7A  H
     A            FSSOK         35A  H
     A            WSNR01         1A  B  6  2
     A  30                                  DSPATR(RI)
     A            HEAVD          4Y 0O  6  5EDTCDE(4)
     A            HEOPD          7Y 0O  6 10EDTCDE(4)
     A            HEPRO          8Y 0O  6 18EDTCDE(4)
     A            SFDS          52A  O  6 27
     A  81                                  COLOR(YLW)
     A            HXEDIK         1A  O  6 80
     A  82
     AO 83                                  DSPATR(RI)
     A N82N83                               COLOR(WHT)
     A  82N83                               COLOR(RED)
     A N82 83                               COLOR(YLW)
     A  82 83                               COLOR(PNK)
     A            HENLEV         8A  O  6 91
     A  57 58                               DSPATR(ND)
     A  57                                  COLOR(RED)
     A  58                                  COLOR(YLW)
     A            HENT           7Y 0O  6100EDTCDE(4)
     A  88                                  DSPATR(RI)
     A  35                                  COLOR(RED)
     A            HEVKT          9Y 0O  6108EDTCDE(4)
SXX  A* 79                                  COLOR(RED)
     A            HEM3           7Y 3O  6118EDTCDE(4)
     A  59                                  DSPATR(RI)
     A            HELM           4Y 2O  6127EDTCDE(4)
     A  84
     AO 80                                  DSPATR(RI)
     A  80                                  COLOR(RED)
     A  75                                  COLOR(PNK)
     A  72                                  COLOR(YLW)
     A  76                                  COLOR(WHT)
     A  73                                  COLOR(BLU)
     A  74                                  COLOR(TRQ)
     A*         R SUBCTL                    SFLCTL(SUBFIL)
     A*-----------------------
     A*  SUBCT2
     A*-----------------------
     A          R SUBCT2                    SFLCTL(SUBFI2)
     A*%%TS  SD  20131002  133343  JOVO        REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF02(02 'MODUS')
     A                                      CF04(04 'SØK TUR')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØKING')
     A                                      CF07(07 'TURER I ARBEID')
     A                                      CF09(09 'LAGE NY KOPIMAL')
     A                                      CF12(08)
     A                                      CF16(16 'Udisp. siste først')
     A                                      CF17(17 'Udisp. datosortert')
     A                                      CF18(18 'Udisp. dato- ALLE')
     A                                      CF19(19 'UDISP. ALLE INNG.')
     A                                      CF20(20 'PLUKK EDIOPPDRAG')
     A                                      CF23(23 'FLERE OPSJONER')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR330010 SYTR33PNL)
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPPNLGRP(SYTR330020 SYTR33PNL)
     A                                      HLPARA(02 001 02 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(04 001 04 004)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(07 001 07 004)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(04 005 04 012)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(07 005 07 012)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(04 013 04 023)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(07 013 07 023)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(04 024 04 025)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(07 024 07 025)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(04 026 04 031)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(07 026 07 031)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(04 032 04 038)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(07 032 07 038)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(04 039 04 040)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(07 039 07 040)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(04 041 04 046)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(07 041 07 046)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(04 047 04 053)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(07 047 07 053)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(04 054 04 055)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(07 054 07 055)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(04 056 04 064)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(07 056 07 064)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(04 065 04 066)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(07 065 07 066)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(04 067 04 080)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(07 067 07 080)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(05 004 05 022)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(08 004 08 022)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(05 023 05 080)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(08 023 08 080)
     A          H                           HLPPNLGRP(SYTR330030 SYTR33PNL)
     A                                      HLPARA(06 001 06 080)
     A            MSGC1V         7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            WSFRI2        35A  H
     A                                  1  2'SYSPED/SYTR33'
     A                                      COLOR(BLU)
     A  67N68                           1 18'Arb.med ordre UTGÅENDE innland.   '
     A                                      COLOR(WHT)
     A  68N67                           1 18'Arb.med ordre INNGÅENDE innland.  '
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1116TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  1128SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2  2MSGCON(010 YBC0065 *LIBL/SYMSGF)
     A            WSAVDU         4Y 0B  2 13EDTCDE(4)
     A                                      DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                  2 18MSGCON(008 JOV0189 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40                              2 27MSGCON(004 YBC0080 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  40                              2 27MSGCON(009 JOV0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40        WSAVD          4Y 0O  2 32EDTCDE(4)
     A                                      COLOR(WHT)
     A  31 67 68                        2 37MSGCON(026 JOV0190 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  31 67N68                        2 37MSGCON(026 SHU0721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  31 68N67                        2 37MSGCON(026 SHU0722 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  41                              2 37MSGCON(017 DIV0052 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  42                              2 37MSGCON(017 DIV0053 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  43                              2 37MSGCON(017 DIV0054 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  44                              2 37MSGCON(014 JOV0205 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  45                              2 37MSGCON(017 JOV0260 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  46                              2 37MSGCON(017 JOV0261 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  48                              2 37MSGCON(010 JOV0206 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49N32                           2 37MSGCON(017 DIV0058 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49 32                           2 37MSGCON(026 JOV0191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  51                              2 37MSGCON(016 JOV0193 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  52                              2 37MSGCON(017 JOV0194 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  53                              2 37MSGCON(017 JOV0195 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  28                              2 37MSGCON(017 JOV0196 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  29                              2 37MSGCON(017 JOV0197 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  27                              2 37MSGCON(017 JOV0198 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  50                              2 37MSGCON(017 JOV0199 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  26                              2 37MSGCON(026 JOV0200 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  54                              2 37MSGCON(026 JOV0192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  55                              2 37MSGCON(026 JOV0217 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  56                              2 37MSGCON(026 JOV0218 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  62                              2 37MSGCON(026 JOV0219 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  63                              2 37MSGCON(010 JOV0257 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  65                              2 37MSGCON(005 JOV1452 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  65        WSSNDN        20A  O  2 43DSPATR(UL)
     A                                      COLOR(WHT)
     A  48        WSRFA15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  77        WSRFK15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  63        WSFRIX        15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  44        WSGN          15A  O  2 52DSPATR(UL)
     A                                      COLOR(WHT)
     A  51        WSHAWN         9A  O  2 54DSPATR(UL)
     A                                      COLOR(WHT)
     A  41        WSFN           7Y 0O  2 55EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WSOPD          7Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  43        WSSG           3A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  45        WSKNSF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  46        WSKNKF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  49N32     WSPRO          8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  52        WSSTET         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  53        WSSONT         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  28        WSSTEF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  29        WSSONF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  27        WSOPDT         2A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  50        WSAGNR         8Y 0O  2 55DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  2 72MSGCON(009 JOV0204 *LIBL/SYMSGF)
     A            WSDATO         6Y 0O  2 82DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 90MSGCON(009 JOV1617 *LIBL/SYMSGF)
     A            WSDATT         6Y 0O  2100DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A*           MSGC1T        78A  O  3  2MSGID(&MSGC1V SYMSGF)
     A            MSGC1T       130A  O  3  2MSGID(&MSGC1V SYMSGF)
     A                                      COLOR(BLU)
     A  67N68                           4  2'Op Avd. Oppdrag   Turnr. Avsender -
     A                                                Mottaker           Til Pn-
     A                                      r/Sted              T&T-stat  Antal-
     A                                      l     Vekt   Kubikk  La.m.'
     A                                      COLOR(WHT)
     A  68N67                           4  2'Op Avd. Oppdrag   Turnr. Avsender -
     A                                                Fra Pnr/Sted    Mottaker -
     A                                                          T&T-stat  Antal-
     A                                      l     Vekt   Kubikk  La.m.'
     A                                      COLOR(WHT)
     A            W2NR           2A  B  5  2DSPATR(UL)
     A            W2AVD          4Y 0B  5  5EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  5 10EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2TUR          8Y 0B  5 18EDTCDE(4)
     A                                      DSPATR(UL)
     A N67 68     W2SDF4         4A  B  5 46DSPATR(UL)
     A  67N68     W2SDT4         4A  B  5 65DSPATR(UL)
     A            W2TT           1A  B  5 91DSPATR(UL)
     A                                  5100'S.nr'
     A            W2SNDN        20A  B  5105DSPATR(UL)
     A*         R BUNN
     A*-----------------------
     A*  BIABCD
     A*-----------------------
     A          R BIABCD
     A*%%TS  SD  20131002  125511  JOVO        REL-V7R1M0  5770-WDS
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A            MSGNR          7A  P
     A            MSGB1V         7A  P
     A            MSGB2V         7A  P
     A            MSGB3V         7A  P
     A                                 22  2'__________ Tur A ______________ __-
     A                                      _________ Tur B ______________ ____-
     A                                      _______ Tur C ______________ ______-
     A                                      _____ Tur D ____________'
     A                                      COLOR(BLU)
     A            LI20A         17A  O 23  2
     A                                 23 33'|'
     A                                      COLOR(BLU)
     A            LI20B         17A  O 23 35
     A                                 23 66'|'
     A                                      COLOR(BLU)
     A            LI20C         17A  O 23 68
     A                                 23 99'|'
     A                                      COLOR(BLU)
     A            LI20D         17A  O 23101
     A                                 24  2'A:'
     A            LI21AA         3Y 0O 24  5EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24  9'V:'
     A            LI21AV         7  0O 24 12EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 20'M3:'
     A            LI21AM         6Y 3O 24 24EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 33'|'
     A                                      COLOR(BLU)
     A                                 24 35'A:'
     A            LI21BA         3Y 0O 24 38EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 42'V:'
     A            LI21BV         7Y 0O 24 45EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 53'M3:'
     A            LI21BM         6Y 3O 24 57EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 66'|'
     A                                      COLOR(BLU)
     A                                 24 68'A:'
     A            LI21CA         3Y 0O 24 71EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 75'V:'
     A            LI21CV         7Y 0O 24 78EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 86'M3:'
     A            LI21CM         6Y 3O 24 90EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 99'|'
     A                                      COLOR(BLU)
     A                                 24101'A:'
     A            LI21DA         3Y 0O 24104EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24108'V:'
     A            LI21DV         7Y 0O 24111EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24119'M3:'
     A            LI21DM         6Y 3O 24123EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A            LI22A         17A  O 25  2
     A                                 25 33'|'
     A                                      COLOR(BLU)
     A            LI22B         17A  O 25 35
     A                                 25 66'|'
     A                                      COLOR(BLU)
     A            LI22C         17A  O 25 68
     A                                 25 99'|'
     A                                      COLOR(BLU)
     A            LI22D         17A  O 25101
     A            MSGB1T        18A  O 26  2MSGID(&MSGB1V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB2T        18A  O 26 22MSGID(&MSGB2V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB3T        18A  O 26 42MSGID(&MSGB3V SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A*-----------------------
     A*  NYVA02
     A*-----------------------
     A          R NYVA02
     A                                      CF02(02 'MODUS')
     A                                      CF04(04 'SØK TUR')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØKING')
     A                                      CF07(07 'TURER I ARBEID')
     A                                      CF09(09 'LAGE NY KOPIMAL')
     A                                      CF12(08)
     A                                      CF16(16 'Udisp. siste først')
     A                                      CF17(17 'Udisp. datosortert')
     A                                      CF18(18 'Udisp. dato- ALLE')
     A                                      CF19(19 'UDISP. ALLE INNG.')
     A                                      CF20(20 'PLUKK EDIOPPDRAG')
     A                                      CF23(23 'FLERE OPSJONER')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR330010 SYTR33PNL)
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPPNLGRP(SYTR330020 SYTR33PNL)
     A                                      HLPARA(02 001 02 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(04 001 04 004)
     A          H                           HLPPNLGRP(SYTR330050 SYTR33PNL)
     A                                      HLPARA(07 001 07 004)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(04 005 04 012)
     A          H                           HLPPNLGRP(SYTR330060 SYTR33PNL)
     A                                      HLPARA(07 005 07 012)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(04 013 04 023)
     A          H                           HLPPNLGRP(SYTR330070 SYTR33PNL)
     A                                      HLPARA(07 013 07 023)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(04 024 04 025)
     A          H                           HLPPNLGRP(SYTR330080 SYTR33PNL)
     A                                      HLPARA(07 024 07 025)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(04 026 04 031)
     A          H                           HLPPNLGRP(SYTR330160 SYTR33PNL)
     A                                      HLPARA(07 026 07 031)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(04 032 04 038)
     A          H                           HLPPNLGRP(SYTR330170 SYTR33PNL)
     A                                      HLPARA(07 032 07 038)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(04 039 04 040)
     A          H                           HLPPNLGRP(SYTR330180 SYTR33PNL)
     A                                      HLPARA(07 039 07 040)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(04 041 04 046)
     A          H                           HLPPNLGRP(SYTR330190 SYTR33PNL)
     A                                      HLPARA(07 041 07 046)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(04 047 04 053)
     A          H                           HLPPNLGRP(SYTR330200 SYTR33PNL)
     A                                      HLPARA(07 047 07 053)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(04 054 04 055)
     A          H                           HLPPNLGRP(SYTR330210 SYTR33PNL)
     A                                      HLPARA(07 054 07 055)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(04 056 04 064)
     A          H                           HLPPNLGRP(SYTR330230 SYTR33PNL)
     A                                      HLPARA(07 056 07 064)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(04 065 04 066)
     A          H                           HLPPNLGRP(SYTR330240 SYTR33PNL)
     A                                      HLPARA(07 065 07 066)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(04 067 04 080)
     A          H                           HLPPNLGRP(SYTR330250 SYTR33PNL)
     A                                      HLPARA(07 067 07 080)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(05 004 05 022)
     A          H                           HLPPNLGRP(SYTR330260 SYTR33PNL)
     A                                      HLPARA(08 004 08 022)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(05 023 05 080)
     A          H                           HLPPNLGRP(SYTR330150 SYTR33PNL)
     A                                      HLPARA(08 023 08 080)
     A          H                           HLPPNLGRP(SYTR330030 SYTR33PNL)
     A                                      HLPARA(06 001 06 080)
     A            MSGC1V         7A  P
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            WSFRI2        35A  H
     A                                  1  2'SYSPED/SYTR33'
     A                                      COLOR(BLU)
     A  67N68                           1 18'Arb.med ordre UTGÅENDE innland.   '
     A                                      COLOR(WHT)
     A  68N67                           1 18'Arb.med ordre INNGÅENDE innland.  '
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1116TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(010 YBC0065 *LIBL/SYMSGF)
     A            WSAVDU         4Y 0B  2 13EDTCDE(4)
     A                                      DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                  2 18MSGCON(008 JOV0189 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40                              2 27MSGCON(004 YBC0080 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  40                              2 27MSGCON(009 JOV0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N40        WSAVD          4Y 0O  2 32EDTCDE(4)
     A                                      COLOR(WHT)
     A  31 67 68                        2 37MSGCON(026 JOV0190 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  31 67N68                        2 37MSGCON(026 SHU0721 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  31 68N67                        2 37MSGCON(026 SHU0722 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  41                              2 37MSGCON(017 DIV0052 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  42                              2 37MSGCON(017 DIV0053 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  43                              2 37MSGCON(017 DIV0054 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  44                              2 37MSGCON(014 JOV0205 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  45                              2 37MSGCON(017 JOV0260 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  46                              2 37MSGCON(017 JOV0261 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  48                              2 37MSGCON(010 JOV0206 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49N32                           2 37MSGCON(017 DIV0058 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49 32                           2 37MSGCON(026 JOV0191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  51                              2 37MSGCON(016 JOV0193 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  52                              2 37MSGCON(017 JOV0194 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  53                              2 37MSGCON(017 JOV0195 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  28                              2 37MSGCON(017 JOV0196 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  29                              2 37MSGCON(017 JOV0197 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  27                              2 37MSGCON(017 JOV0198 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  50                              2 37MSGCON(017 JOV0199 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  26                              2 37MSGCON(026 JOV0200 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  54                              2 37MSGCON(026 JOV0192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  55                              2 37MSGCON(026 JOV0217 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  56                              2 37MSGCON(026 JOV0218 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  62                              2 37MSGCON(026 JOV0219 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  63                              2 37MSGCON(010 JOV0257 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  65                              2 37MSGCON(005 JOV1452 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  65        WSSNDN        20A  O  2 43DSPATR(UL)
     A                                      COLOR(WHT)
     A  48        WSRFA15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  77        WSRFK15       15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  63        WSFRIX        15A  O  2 48DSPATR(UL)
     A                                      COLOR(WHT)
     A  44        WSGN          15A  O  2 52DSPATR(UL)
     A                                      COLOR(WHT)
     A  51        WSHAWN         9A  O  2 54DSPATR(UL)
     A                                      COLOR(WHT)
     A  41        WSFN           7Y 0O  2 55EDTCDE(4)
     A                                      COLOR(WHT)
     A  42        WSOPD          7Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  43        WSSG           3A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  45        WSKNSF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  46        WSKNKF         8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  49N32     WSPRO          8Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  52        WSSTET         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  53        WSSONT         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  28        WSSTEF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  29        WSSONF         5A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  27        WSOPDT         2A  O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A  50        WSAGNR         8Y 0O  2 55DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  2 72MSGCON(009 JOV0204 *LIBL/SYMSGF)
     A            WSDATO         6Y 0O  2 82DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 90MSGCON(009 JOV1617 *LIBL/SYMSGF)
     A            WSDATT         6Y 0O  2100DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A*           MSGC1T        78A  O  3  2MSGID(&MSGC1V SYMSGF)
     A            MSGC1T       130A  O  3  2MSGID(&MSGC1V SYMSGF)
     A                                      COLOR(BLU)
     A  67N68                           4  2'Op Avd. Oppdrag   Turnr. Avsender -
     A                                                Mottaker           Til Pn-
     A                                      r/Sted              T&T-stat  Antal-
     A                                      l     Vekt   Kubikk  La.m.'
     A                                      COLOR(WHT)
     A  68N67                           4  2'Op Avd. Oppdrag   Turnr. Avsender -
     A                                                Fra Pnr/Sted    Mottaker -
     A                                                          T&T-stat  Antal-
     A                                      l     Vekt   Kubikk  La.m.'
     A                                      COLOR(WHT)
     A            W2NR           2A  B  5  2DSPATR(UL)
     A            W2AVD          4Y 0B  5  5EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2OPD          7Y 0B  5 10EDTCDE(4)
     A                                      DSPATR(UL)
     A            W2TUR          8Y 0B  5 18EDTCDE(4)
     A                                      DSPATR(UL)
     A N67 68     W2SDF4         4A  B  5 46DSPATR(UL)
     A  67N68     W2SDT4         4A  B  5 65DSPATR(UL)
     A            W2TT           1A  B  5 91DSPATR(UL)
     A                                  5100'S.nr'
     A            W2SNDN        20A  B  5105DSPATR(UL)
     A                                 22  2'__________ Tur A ______________ __-
     A                                      _________ Tur B ______________ ____-
     A                                      _______ Tur C ______________ ______-
     A                                      _____ Tur D ____________'
     A                                      COLOR(BLU)
     A            LI20A         17A  O 23  2
     A                                 23 33'|'
     A                                      COLOR(BLU)
     A            LI20B         17A  O 23 35
     A                                 23 66'|'
     A                                      COLOR(BLU)
     A            LI20C         17A  O 23 68
     A                                 23 99'|'
     A                                      COLOR(BLU)
     A            LI20D         17A  O 23101
     A                                 24  2'A:'
     A            LI21AA         3Y 0O 24  5EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24  9'V:'
     A            LI21AV         7  0O 24 12EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 20'M3:'
     A            LI21AM         6Y 3O 24 24EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 33'|'
     A                                      COLOR(BLU)
     A                                 24 35'A:'
     A            LI21BA         3Y 0O 24 38EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 42'V:'
     A            LI21BV         7Y 0O 24 45EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 53'M3:'
     A            LI21BM         6Y 3O 24 57EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 66'|'
     A                                      COLOR(BLU)
     A                                 24 68'A:'
     A            LI21CA         3Y 0O 24 71EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 75'V:'
     A            LI21CV         7Y 0O 24 78EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24 86'M3:'
     A            LI21CM         6Y 3O 24 90EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A                                 24 99'|'
     A                                      COLOR(BLU)
     A                                 24101'A:'
     A            LI21DA         3Y 0O 24104EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24108'V:'
     A            LI21DV         7Y 0O 24111EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 24119'M3:'
     A            LI21DM         6Y 3O 24123EDTWRD('   ,   ')
     A                                      COLOR(YLW)
     A            LI22A         17A  O 25  2
     A                                 25 33'|'
     A                                      COLOR(BLU)
     A            LI22B         17A  O 25 35
     A                                 25 66'|'
     A                                      COLOR(BLU)
     A            LI22C         17A  O 25 68
     A                                 25 99'|'
     A                                      COLOR(BLU)
     A            LI22D         17A  O 25101
     A            MSGB1T        18A  O 26  2MSGID(&MSGB1V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB2T        18A  O 26 22MSGID(&MSGB2V SYMSGF)
     A                                      COLOR(BLU)
     A            MSGB3T        18A  O 26 42MSGID(&MSGB3V SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A            MSGB1V         7A  P
     A            MSGB2V         7A  P
     A            MSGB3V         7A  P
     A          R DELWIND
     A*%%TS  SD  20130823  084336  JOVO        REL-V7R1M0  5770-WDS
     A  *DS4                                WINDOW(*DFT 06 75 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF12(12)
     A            MSGNR2         7A  P
     A                                  1  2'SYTR33'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(050 JOV1611 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(007 JOV1609 *LIBL/SYMSGF)
     A            WSDREA        60A  B  3 10CHECK(LC)
     A                                      COLOR(YLW)
     A                                  5  2'Enter'
     A                                      COLOR(BLU)
     A                                  5 27MSGCON(015 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX2        70A  O  6  2MSGID(&MSGNR2 SYMSGF)
     A                                      COLOR(WHT)
     A          R BEKREFT
     A                                      WINDOW(*DFT 4 54 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF12(12)
     A                                  1  2'SYTR33'
     A            UUAVD          4Y 0O  1 10DSPATR(UL)
     A                                  1 14'/'
     A            UUOPD          7Y 0O  1 15DSPATR(UL)
     A                                  2  2MSGCON(050 SHU1533 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 SHU1534 *LIBL/SYMSGF)
     A            WSTILA         4Y 0B  3 22DSPATR(UL)
     A N33                              4  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  33                              4  2MSGCON(040 SHU1535 *LIBL/SYMSGF)
     A                                      DSPATR(RI)
N03  A*
     A          R BEKMLAP
     A*%%TS  SD  20171002  182220  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 5 60 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF12(12)
     A                                  1  2'SYTR33'
     A                                      COLOR(BLU)
     A                                  2 15'/'
     A N33                              5  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(040 JOV1755 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O  3  2EDTCDE(4)
     A                                      COLOR(WHT)
     A            ZZPRT67       10   O  3 45COLOR(WHT)
     A                                  3 11MSGCON(033 JOV1756 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(055 JOV1757 *LIBL/SYMSGF)
     A            HEAVDA         4   O  2 10
     A            HEOPDA         7   O  2 17
