     A*%%TS  SD  20180110  112352  SVEIN       REL-V7R1M0  5770-WDS
     A* BRINGTMS-PROSJEKT
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 TOLLSTEDSKODE ER ENDRET TIL 4.0
10XXXA* 08 YBC PTF10 PTF08 I RPG-UNDETRYKKE KOPIFELT (NAVN RED TIL 28)
12XXX * 09 YBC PTF12 CO2 registrering
12XXX * 10 YBC PTF12 WSCO2 ENDRES FRA 7.4 TIL 9.6
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYTR10PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV OPPDRAG (T-
     A                                      RANSPORTMODULEN)')
     A                                      ALTHELP
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12)
     A                                      CF05(05 'Gå direkte til faktura')
     A                                      CF07(07 'SPØRRING OPPDRAG')
     A                                      CF09(09 'Bytt signatur')
     A                                  1  3'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(045 DIV0596 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 21MSGCON(045 DIV3753 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3 21MSGCON(045 DIV3754 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  7  3MSGCON(018 SHU0315 *LIBL/SYMSGF)
     A            WSIE           1A  B  7 24VALUES('T' ' ' 'I' 'E')
     A                                  9  3MSGCON(018 DIV0599 *LIBL/SYMSGF)
     A            WSSG           3A  B  9 24TEXT('Signatur')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                 11  3MSGCON(018 DIV0600 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B 11 24TEXT('Avdeling')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                 13  3MSGCON(018 DIV0601 *LIBL/SYMSGF)
     A            WSOPD          7Y 0B 13 24TEXT('Oppdragsnummer')
     A                                      DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 39MSGCON(020 DIV0604 *LIBL/SYMSGF)
     A                                 15  3MSGCON(018 DIV0602 *LIBL/SYMSGF)
     A            HEAVD          4Y 0B 15 24TEXT('Avdeling')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0B 15 31TEXT('Oppdragsnummer')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 39MSGCON(020 DIV0036 *LIBL/SYMSGF)
     A                                 18  3MSGCON(018 DIV0603 *LIBL/SYMSGF)
     A            WSOPDG         7Y 0O 18 24COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23  3MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0605 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0606 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0033 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A*
     A          R BILDE02
     A*%%TS  SD  20171003  071716  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF02(02 'MODUS')
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF04(04 'SØKING')
     A N37                                  CF05(05 'Gå til faktura')
     A N37                                  CF06(06 'BEREGN KUBIKK')
     A N37                                  CF07(07 'SPØRRING PÅ OPPDRAG')
     A N37                                  CF08(08 'LASTEBÆRERE/VARELINJER')
     A N37                                  CF09(09 'PLANLEGG/PLUKK')
     A N37                                  CF10(10 'FULLOAD')
     A N37                                  CF11(11 'REKVISISJON')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF13(13 'SETTE ETD/ATD...')
     A                                      CF14(14 'Vise opplysning')
     A                                      CF15(15 'FRIE SØKEVEIER')
     A N37                                  CF16(16 'Neste')
     A                                      CF17(17 'Arkiv')
     A                                      CF18(18 'FRITEKSTER')
     A                                      CF19(19 'Avreegn')
     A                                      CF20(20 'TRACK&TRACE')
     A                                      CF22(22 'Hurtigbooking')
     A                                      CF23(23 'SKILLEARK')
     A                                      CF24(24 'FLERE TASTER')
     A  27                                  ALARM
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR100005 SYTR10PNL)
     A                                      HLPARA(01 001 01 049)
     A          H                           HLPPNLGRP(SYTR100007 SYTR10PNL)
     A                                      HLPARA(01 051 01 132)
     A          H                           HLPPNLGRP(SYTR100007 SYTR10PNL)
     A                                      HLPARA(02 086 02 132)
     A          H                           HLPPNLGRP(SYTR100010 SYTR10PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR100011 SYTR10PNL)
     A                                      HLPARA(02 015 02 085)
     A          H                           HLPPNLGRP(SYTR100020 SYTR10PNL)
     A                                      HLPARA(04 001 04 008)
     A          H                           HLPPNLGRP(SYTR100030 SYTR10PNL)
     A                                      HLPARA(04 012 04 095)
     A          H                           HLPPNLGRP(SYTR100040 SYTR10PNL)
     A                                      HLPARA(09 086 09 116)
     A          H                           HLPPNLGRP(SYTR100040 SYTR10PNL)
     A                                      HLPARA(13 086 13 116)
     A          H                           HLPPNLGRP(SYTR100041 SYTR10PNL)
     A                                      HLPARA(22 049 22 082)
     A          H                           HLPPNLGRP(SYTR100050 SYTR10PNL)
     A                                      HLPARA(05 001 05 042)
     A          H                           HLPPNLGRP(SYTR100070 SYTR10PNL)
     A                                      HLPARA(05 044 05 080)
     A          H                           HLPPNLGRP(SYTR100080 SYTR10PNL)
     A                                      HLPARA(06 001 06 027)
     A          H                           HLPPNLGRP(SYTR100090 SYTR10PNL)
     A                                      HLPARA(06 029 06 042)
     A          H                           HLPPNLGRP(SYTR100100 SYTR10PNL)
     A                                      HLPARA(06 044 06 067)
     A          H                           HLPPNLGRP(SYTR100110 SYTR10PNL)
     A                                      HLPARA(06 069 06 080)
     A          H                           HLPPNLGRP(SYTR100120 SYTR10PNL)
     A                                      HLPARA(03 086 03 130)
     A          H                           HLPPNLGRP(SYTR100130 SYTR10PNL)
     A                                      HLPARA(05 086 05 120)
     A          H                           HLPPNLGRP(SYTR100140 SYTR10PNL)
     A                                      HLPARA(08 001 08 132)
     A          H                           HLPPNLGRP(SYTR100141 SYTR10PNL)
     A                                      HLPARA(09 001 09 079)
     A          H                           HLPPNLGRP(SYTR100141 SYTR10PNL)
     A                                      HLPARA(10 019 10 079)
     A          H                           HLPPNLGRP(SYTR100142 SYTR10PNL)
     A                                      HLPARA(10 086 10 116)
     A          H                           HLPPNLGRP(SYTR100142 SYTR10PNL)
     A                                      HLPARA(14 086 14 116)
     A          H                           HLPPNLGRP(SYTR100150 SYTR10PNL)
     A                                      HLPARA(11 086 11 104)
     A          H                           HLPPNLGRP(SYTR100150 SYTR10PNL)
     A                                      HLPARA(12 001 12 122)
     A          H                           HLPPNLGRP(SYTR100151 SYTR10PNL)
     A                                      HLPARA(13 001 13 080)
     A          H                           HLPPNLGRP(SYTR100151 SYTR10PNL)
     A                                      HLPARA(14 001 14 080)
     A          H                           HLPPNLGRP(SYTR100160 SYTR10PNL)
     A                                      HLPARA(07 001 07 023)
     A          H                           HLPPNLGRP(SYTR100161 SYTR10PNL)
     A                                      HLPARA(07 026 07 068)
     A          H                           HLPPNLGRP(SYTR100165 SYTR10PNL)
     A                                      HLPARA(15 001 20 132)
     A          H                           HLPPNLGRP(SYTR100180 SYTR10PNL)
     A                                      HLPARA(23 002 23 060)
     A          H                           HLPPNLGRP(SYTR100185 SYTR10PNL)
     A                                      HLPARA(22 040 22 047)
     A          H                           HLPPNLGRP(SYTR100185 SYTR10PNL)
     A                                      HLPARA(19 001 19 047)
     A          H                           HLPPNLGRP(SYTR100186 SYTR10PNL)
     A                                      HLPARA(21 103 21 132)
     A          H                           HLPPNLGRP(SYTR100187 SYTR10PNL)
     A                                      HLPARA(22 103 22 132)
     A          H                           HLPPNLGRP(SYTR100188 SYTR10PNL)
     A                                      HLPARA(22 002 22 036)
     A          H                           HLPPNLGRP(SYTR100190 SYTR10PNL)
     A                                      HLPARA(23 070 23 132)
     A          H                           HLPPNLGRP(SYTR100200 SYTR10PNL)
     A                                      HLPARA(24 001 24 047)
     A          H                           HLPPNLGRP(SYTR100201 SYTR10PNL)
     A                                      HLPARA(24 055 24 089)
     A          H                           HLPPNLGRP(SYTR100205 SYTR10PNL)
     A                                      HLPARA(02 015 02 050)
     A          H                           HLPPNLGRP(SYTR100210 SYTR10PNL)
     A                                      HLPARA(25 001 25 048)
     A          H                           HLPPNLGRP(SYTR100220 SYTR10PNL)
     A                                      HLPARA(22 030 22 048)
     A          H                           HLPPNLGRP(SYTR100230 SYTR10PNL)
     A                                      HLPARA(25 050 25 080)
     A          H                           HLPPNLGRP(SYTR100240 SYTR10PNL)
     A                                      HLPARA(23 001 23 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGLN5         7A  P
     A            MSGLN6         7A  P
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A  32                              1 16MSGCON(030 SHU1518 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A N32                              1 16MSGCON(030 SHU1560 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A  37                              1 16MSGCON(030 JOV0216 *LIBL/SYMSGF)
     A  37                                  COLOR(RED)
     A  37                                  DSPATR(UL)
     A  37                                  DSPATR(RI)
     A            RETNING        3A  O  1 47COLOR(WHT)
     A                                  1 51MSGCON(005 SHU1519 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  1 57TEXT('Avdeling')
     A N45                                  DSPATR(PR)
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 62'/'
     A N45        WSOPD          7Y 0O  1 64TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 72MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            WSSG           3A  B  1 76TEXT('Signatur')
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                  1 86MSGCON(005 SHU1517 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  1 92TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  1104MSGCON(005 SHU0320 *LIBL/SYMSGF)
     A            WSRUND         8Y 0B  1110TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 JOV0168 *LIBL/SYMSGF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(RED)
     A  45                              2 15'*NY*'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2 15MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O  2 22COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            TROPD1         7Y 0O  2 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 37'/'
     A            TRAVD2         4Y 0O  2 39COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            TROPD2         7Y 0O  2 44COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 53MSGCON(006 SHU1488 *LIBL/SYMSGF)
     A            TRAVD0    R        O  2 60REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TROPD0    R        O  2 65REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  2 86MSGCON(005 SHU1516 *LIBL/SYMSGF)
     A            WSHAWB        10A  O  2 92COLOR(WHT)
     A                                      DSPATR(UL)
     A            AVRTXT        17A  O  2104COLOR(RED)
     A                                  3  2MSGCON(005 SHU0316 *LIBL/SYMSGF)
     A            WSKDAK         1A  B  3  8COLOR(YLW)
     A            WSKNA          8Y 0B  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAA         30A  B  3 19TEXT('Navn Agent')
     A  98                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A  98                                  COLOR(RED)
     A N98                                  COLOR(WHT)
     A            WSADA         30A  O  3 50DSPATR(UL)
     A                                      COLOR(WHT)
     A  91                                  DSPATR(RI)
     A                                  3 86MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNFA    R     Y  B  3 92REFFLD(HEADFR/TRKNFA *LIBL/HEADF)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  82                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAFA        30A  B  3101
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A N23                                  COLOR(WHT)
     A  23                                  COLOR(RED)
     A  23                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A                                  4  2MSGCON(005 SHU1513 *LIBL/SYMSGF)
     A            WSKDFF         1A  B  4  8COLOR(YLW)
     A  93                                  DSPATR(RI)
     A                                  4 12MSGCON(005 SHU1504 *LIBL/SYMSGF)
     A            WSRFA         35A  B  4 18TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A  59                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  4 54MSGCON(005 SHU1505 *LIBL/SYMSGF)
     A            WSRFK         35A  B  4 61COLOR(YLW)
     A                                      DSPATR(UL)
     A  59                                  DSPATR(RI)
N09  A                                  4 98'CO2 pr tonn:'
S10  A*           WSCO2          6Y 3B  4111COLOR(YLW)
N10  A            WSCO2          9Y 6B  4111COLOR(YLW)
N09  A                                      DSPATR(UL)
N09  A                                      EDTCDE(4)
     A                                  5  2MSGCON(004 JOV1544 *LIBL/SYMSGF)
     A N42        WSSDF          5A  B  5  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLANF         2A  B  5  8COLOR(YLW)
     A  42        WPSDF          5A  B  5 11TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSDFD         6Y 0B  5 14DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  34                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A  34                                  COLOR(WHT)
     A N34                                  COLOR(YLW)
     A  42        WPSDFD         6Y 0B  5 17DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  34                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A  34                                  COLOR(WHT)
     A N34                                  COLOR(YLW)
     A N42        WSSDFK         4Y 0B  5 21EDTCDE(4)
     A  34                                  COLOR(WHT)
     A N34                                  COLOR(YLW)
     A  72                                  DSPATR(RI)
     A  34                                  DSPATR(PR)
     A  42        WPSDFK         4Y 0B  5 24EDTCDE(4)
     A  34                                  COLOR(WHT)
     A N34                                  COLOR(YLW)
     A  72                                  DSPATR(RI)
     A  34                                  DSPATR(PR)
     A N42        WSLANF         2A  O  5 28COLOR(WHT)
     A  42        WPPNS1        14A  B  5 29
     A N42        WSSONF         3A  O  5 31COLOR(WHT)
     A N42        WSPNRF         5Y 0O  5 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 44MSGCON(003 SHU0321 *LIBL/SYMSGF)
     A N42        WSSDT          5A  B  5 48TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  42        WPLANT         2A  B  5 48COLOR(YLW)
     A  42        WPSDT          5A  B  5 51TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A N42        WSSDTD         6Y 0B  5 54DSPATR(UL)
     A  64                                  DSPATR(RI)
     A  35                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A  35                                  COLOR(WHT)
     A N35                                  COLOR(YLW)
     A  42        WPSDTD         6Y 0B  5 57DSPATR(UL)
     A  64                                  DSPATR(RI)
     A  35                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A  35                                  COLOR(WHT)
     A N35                                  COLOR(YLW)
     A N42        WSSDTK         4Y 0B  5 61EDTCDE(4)
     A  73                                  DSPATR(RI)
     A  35                                  DSPATR(PR)
     A  35                                  COLOR(WHT)
     A N35                                  COLOR(YLW)
     A  42        WPSDTK         4Y 0B  5 64EDTCDE(4)
     A  73                                  DSPATR(RI)
     A  35                                  DSPATR(PR)
     A  35                                  COLOR(WHT)
     A N35                                  COLOR(YLW)
     A N42        WSLANT         2A  O  5 68COLOR(WHT)
     A  42        WPPNS2        12A  B  5 69
     A N42        WSSONT         3A  O  5 71COLOR(WHT)
     A N42        WSPNRT         5Y 0O  5 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 86MSGCON(007 SHU0323 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSTSTA         1A  B  5 96COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  90                                  DSPATR(RI)
     A            WSADFX        20A  O  5101COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42                              6  2'Via'
     A  32                                  DSPATR(ND)
     A                                  6  2MSGCON(003 SHU0322 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A N42        WSSDFF         5A  B  6  8TEXT('Forfrakt fra')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLAN1         2A  B  6  8COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  42        WPSDFF         5A  B  6 11TEXT('Via base')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSFFD         6Y 0B  6 14DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSFFD         6Y 0B  6 17DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSFFK         4Y 0B  6 21EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPSFFK         4Y 0B  6 24EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSTAF         1A  B  6 26
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  43                                  DSPATR(HI)
     A  32
     AO 43                                  DSPATR(PR)
     A N42        WSLAN1         2A  O  6 28COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAF         1A  B  6 29
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  43                                  DSPATR(HI)
     A  32
     AO 43                                  DSPATR(PR)
     A N42        WSSON1         3A  O  6 31COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS3        12A  B  6 31
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A N42        WSPNR1         5Y 0O  6 35COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  6 44MSGCON(003 SHU0322 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A N42        WSSDVT         5A  B  6 48TEXT('Viderefrakt til')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLAN2         2A  B  6 48COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  42        WPSDVT         5A  B  6 51TEXT('Via base')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSVTD         6Y 0B  6 54DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSVTD         6Y 0B  6 57DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSVTK         4Y 0B  6 61EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPSVTK         4Y 0B  6 64EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSTAE         1A  B  6 66
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  44                                  DSPATR(HI)
     A  32
     AO 44                                  DSPATR(PR)
     A N42        WSLAN2         2A  O  6 68COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAE         1A  B  6 69
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  44                                  DSPATR(HI)
     A  32
     AO 44                                  DSPATR(PR)
     A N42        WSSON2         3A  O  6 71COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS4        10A  B  6 71
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A N42        WSPNR2         5Y 0O  6 75COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  7  2MSGCON(005 SHU1500 *LIBL/SYMSGF)
     A            WSOT           2A  B  7  8TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  7 11MSGCON(009 SHU1501 *LIBL/SYMSGF)
     A            WSFR           3A  B  7 21TEXT('Frankatur')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  7 26MSGCON(013 SHU1561 *LIBL/SYMSGF)
     A            WSBODT         6Y 0B  7 40DSPATR(UL)
     A  38                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  7 47MSGCON(003 SHU1562 *LIBL/SYMSGF)
     A            WSBOTM         4Y 0B  7 51EDTCDE(4)
     A  38                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  7 86MSGCON(020 SHU1491 *LIBL/SYMSGF)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNS          8Y 0B  8  8TEXT('Kundenr Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  67
     AO 68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAMS        30A  B  8 19TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSADRS        30A  O  8 50TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSKNSF         8Y 0B  8 86TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNASF28      28A  B  8 95TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A                                  9  2MSGCON(014 SHU0337 *LIBL/SYMSGF)
     A            WSNAS         30A  B  9 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADS1        30A  B  9 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 86MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            WSVALS         3A  B  9 91TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  9 95MSGCON(010 SHU1489 *LIBL/SYMSGF)
     A            WSKDFS         1A  B  9106TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X' 'B' 'E')
     A                                  9109MSGCON(006 SHU1490 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSANS          1Y 0B  9116TEXT('Avtalenr Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSEDIINF      15A  O 10  2COLOR(RED)
     A            WSADS2        30A  B 10 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADS3        30A  B 10 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 86MSGCON(009 SHU1497 *LIBL/SYMSGF)
     A            WSSDLA        20A  B 10 97TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                 11 86MSGCON(020 SHU1492 *LIBL/SYMSGF)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNK          8Y 0B 12  8TEXT('Kundenr Kjøper')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  62
     AO 61                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAMK        30A  B 12 19TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A            WSADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A            WSKNKF         8Y 0B 12 86TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  17                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAKF28      28A  B 12 95TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A                                 13  2MSGCON(014 SHU0338 *LIBL/SYMSGF)
     A            WSNAK         30A  B 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADK1        30A  B 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 86MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            WSVALK         3A  B 13 91TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 13 95MSGCON(010 SHU1489 *LIBL/SYMSGF)
     A            WSKDFK         1A  B 13106TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X' 'B' 'E')
     A                                 13109MSGCON(006 SHU1490 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSANK          1Y 0B 13116TEXT('Avtalenr Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSADK2        30A  B 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADK3        30A  B 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14 86MSGCON(009 SHU1512 *LIBL/SYMSGF)
     A            WSSDL         20A  B 14 97TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A*                                15  2MSGCON(130 SHU1485 *LIBL/SYMSGF)
     A                                 15  2MSGCON(131 JOV1689 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSLI1         1A  B 16  2COLOR(RED)
     A            WSGM01        15A  B 16  4COLOR(YLW)
     A            WSANT1    R        B 16 20REFFLD(DOKUFVR/FVANT *LIBL/DOKUFV)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            WSPAKN1   R        B 16 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(YLW)
     A            WSVT1         25A  B 16 36COLOR(YLW)
     A  86                                  DSPATR(RI)
     A            WSVKT1    R        B 16 62REFFLD(DOKUFVR/FVVKT *LIBL/DOKUFV)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            WSLE01         4Y 0B 16 72EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSBR01         4Y 0B 16 77EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSHO01         4Y 0B 16 82EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSVOL1    R        B 16 87REFFLD(DOKUFVR/FVVOL *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSLM1     R        B 16 96REFFLD(DOKUFVR/FVLM *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSLM1B    R        B 16102REFFLD(DOKUFVR/FVLM *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSUNN1         4A  B 16108COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSEMB1         3A  B 16113COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSIND1         1A  B 16117COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSANK1         2Y 0B 16119COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSANM1         4Y 0B 16122COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSENH1         1A  B 16127COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSPOE1         4Y 0O 16129EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI2         1A  B 17  2COLOR(RED)
     A            WSGM02        15A  B 17  4COLOR(YLW)
     A            WSANT2         7Y 0B 17 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSPAKN2   R        B 17 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(YLW)
     A            WSVT2         25A  B 17 36COLOR(YLW)
     A            WSVKT2         9Y 0B 17 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSLE02         4Y 0B 17 72EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSBR02         4Y 0B 17 77EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSHO02         4Y 0B 17 82EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSVOL2         7Y 3B 17 87EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSLM2          4Y 2B 17 96TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSLM2B         4Y 2B 17102EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSUNN2         4A  B 17108COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSEMB2         3A  B 17113COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSIND2         1A  B 17117COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSANK2         2Y 0B 17119COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSANM2         4Y 0B 17122COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSENH2         1A  B 17127COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSPOE2         4Y 0O 17129EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI3         1A  B 18  2COLOR(RED)
     A            WSGM03        15A  B 18  4COLOR(YLW)
     A            WSANT3         7Y 0B 18 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSPAKN3   R        B 18 28REFFLD(DOKUFVR/FVPAKN *LIBL/DOKUFV)
     A                                      COLOR(YLW)
     A            WSVT3         25A  B 18 36COLOR(YLW)
     A            WSVKT3         9Y 0B 18 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSLE03         4Y 0B 18 72EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSBR03         4Y 0B 18 77EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSHO03         4Y 0B 18 82EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSVOL3         7Y 3B 18 87EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSLM3          4Y 2B 18 96TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSLM3B         4Y 2B 18102EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSUNN3         4A  B 18108COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSEMB3         3A  B 18113COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSIND3         1A  B 18117COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSANK3         2Y 0B 18119COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSANM3         4Y 0B 18122COLOR(YLW)
     A                                      EDTCDE(4)
     A  01                                  DSPATR(PR)
     A            WSENH3         1A  B 18127COLOR(YLW)
     A  01                                  DSPATR(PR)
     A            WSPOE3         4Y 0O 18129EDTCDE(4)
     A                                      COLOR(RED)
     A            WSSLI4         1A  B 19  2
     A            WSGM1         15A  B 19  4TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSNT           7Y 0B 19 20TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSVS1         25A  B 19 36TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVKT          9Y 0B 19 62TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSM3           7Y 3B 19 87EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSLM           4Y 2B 19 96TEXT('Kubikk')
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLMLA         4Y 2B 19102TEXT('Kubikk')
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            FLER3          5A  O 19 28COLOR(BLU)
     A                                      DSPATR(HI)
     A            WSPOEP         5Y 0O 19128TEXT('Antall')
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A            WSGM2         15A  B 20  4TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVS2         25A  B 20 36TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 20 77MSGCON(009 SHU1499 *LIBL/SYMSGF)
     A            WSFBV          9Y 0O 20 87TEXT('FBVekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSPOEN         5Y 0O 20128TEXT('Antall')
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A                                 21103MSGCON(010 SHU1487 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSVERV         3A  B 21114COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  49                                  DSPATR(RI)
     A            WSVERB        13Y 2B 21118EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  56                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE ,00)
     A                                 22  2MSGCON(005 SHU0333 *LIBL/SYMSGF)
     A            WSFRAK         1A  B 22  9
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  53                                  DSPATR(RI)
     A            WSFRAV         3A  B 22 12
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  52                                  DSPATR(RI)
     A            WSFRAB        13Y 2B 22 17
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,00)
     A                                 22 34MSGCON(001 SHU0334 *LIBL/SYMSGF)
     A            WSMVA          1A  B 22 36
     A  50                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            XKDA           1A  O 22 32COLOR(WHT)
     A                                 22 40MSGCON(006 YBC0489 *LIBL/SYMSGF)
     A            WSKDPL         1A  B 22 47TEXT('Planleggingskode')
     A                                      COLOR(YLW)
     A                                 22 49MSGCON(007 SHU1494 *LIBL/SYMSGF)
     A            WSVALT         3A  B 22 57TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 22 61'%'
     A            WSVALP         3Y 1B 22 63DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 22 69MSGCON(008 SHU1538 *LIBL/SYMSGF)
     A            WTGX           5A  B 22 78COLOR(YLW)
     A                                 22 84'P'
     A            WSSTN6         1A  B 22 86COLOR(YLW)
     A                                      VALUES(' ' 'P')
     A                                 22 89MSGCON(006 SHU1498 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSBRUT         6Y 0O 22 96COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                 22103MSGCON(010 SHU1486 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSETTV         3A  B 22114COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  55                                  DSPATR(RI)
     A            WSETTB        13Y 2B 22118EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  54                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE ,00)
     A                                 23  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKF           2A  B 23  9DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  40                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSKFT1         1A  B 23 12DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  39                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFT1A        30A  B 23 15DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSFT1B        15A  B 23 46DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23 70MSGCON(006 SHU0325 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFA11         7A  B 23 77COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A*                                23 17'-'
     A                                 23 85'UN'
     A  32                                  DSPATR(ND)
     A            WSFA12         4A  B 23 88COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 23 93MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFLP1         3Y 0B 23 98COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 23103MSGCON(006 SHU0332 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFA21         7A  B 23110COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A            WSFA22         4A  B 23118COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 23123MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFLP2         3Y 0B 23128COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 24  2MSGCON(005 SHU1495 *LIBL/SYMSGF)
     A            WSGNA          4A  B 24  9COLOR(YLW)
     A            WSGNB          5A  B 24 14COLOR(YLW)
     A            WSGNC          6A  B 24 20COLOR(YLW)
     A                                 24 27MSGCON(003 SHU1496 *LIBL/SYMSGF)
     A            WSPOS1         7A  B 24 31COLOR(YLW)
     A                                 24 39'Pos2'
     A            WSPOS2         4Y 0B 24 44COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 24 55'Eks/Lø'
     A            WSTLE          6A  B 24 62COLOR(YLW)
     A            WSTLL         10A  B 24 69COLOR(YLW)
     A                                 24 81'Kan Utf'
     A            WSTLKU         1A  B 24 89COLOR(YLW)
     A            WSUSR         10A  O 24122COLOR(PNK)
     A                                 25  2MSGCON(006 SHU0327 *LIBL/SYMSGF)
     A            WSPK3          1A  B 25  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A            WSPK5          1A  B 25 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                 25 13MSGCON(003 JOV0805 *LIBL/SYMSGF)
     A            WSPK4          1A  B 25 17TEXT('Printerkode-4 Sad imp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                      COLOR(YLW)
     A            WSPK6          1A  B 25 19TEXT('Printerkode-6  Sad-exp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                      COLOR(YLW)
     A                                 25 21'CMR/BL'
     A            WSPK7          1A  B 25 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'B' 'C' 'N' 'P' 'W')
     A                                 25 30MSGCON(004 SHU0329 *LIBL/SYMSGF)
     A            WSPK1          1A  B 25 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
S01  A*           W2TOLL         2Y 0B 25 37EDTCDE(4)
     A            W2TOLL         4Y 0B 25 37EDTCDE(4)
     A  58                                  DSPATR(RI)
     A                                      COLOR(YLW)
S01  A*                                25 40MSGCON(002 SHU0336 *LIBL/SYMSGF)
     A            W2KDME         1A  B 25 43TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 25 45'Ek'
     A            W2KDE          1A  B 25 48TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 25 50MSGCON(002 SHU0335 *LIBL/SYMSGF)
     A            WSPK2          1A  B 25 53TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'B' 'C' 'N' 'P')
     A            WSNTVS         3Y 0B 25 55EDTCDE(4)
     A  57                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 25 59'Fly'
     A            WSPK8          1A  B 25 63COLOR(YLW)
     A                                      VALUES(' ' 'J' 'P' 'N' 'S')
     A                                 25 66MSGCON(007 DIV0607 *LIBL/SYMSGF)
     A            WSOPDG         7Y 0O 25 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSGL1         18A  O 26  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 26 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 26 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 26 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL5         18A  O 26 82MSGID(&MSGLN5 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL6         18A  O 26102MSGID(&MSGLN6 SYMSGF)
     A                                      COLOR(BLU)
     A  30        FELTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30        WSMSG         62A  O 27  2COLOR(RED)
     A                                  7 57MSGCON(010 JOV1675 *LIBL/SYMSGF)
     A            WSSTN7         1A  B  7 68COLOR(RED)
     A                                 19110MSGCON(015 JOV1680 *LIBL/SYMSGF)
     A            WSSTN8         1A  B 19108COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            TRSLAG         2   O  2  7COLOR(RED)
     A  41                                  DSPATR(ND)
     A*
     A          R BILDE03
     A*%%TS  SD  20110601  135950  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 19 72 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Gå til faktura')
     A                                      CF12(12)
     A                                      CF16(16 'Neste')
     A  27                                  ALARM
     A          H                           HLPPNLGRP(SYTR100500 SYTR10PNL)
     A                                      HLPARA(01 001 16 070)
     A          H                           HLPPNLGRP(SYTR100510 SYTR10PNL)
     A                                      HLPARA(18 001 18 070)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR2         7A  P
     A                                  1  2'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 JOV0703 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  2 11MSGCON(055 JOV0699 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(014 SHU0339 *LIBL/SYMSGF)
     A                                      DSPATR(RI)
     A            WSSDF          5A  B  4 19TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSDFD         6Y 0B  4 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A            WSSDFK         4Y 0B  4 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                  4 40'------>'
     A  34                                  DSPATR(ND)
     A            WSSDFF         5A  B  4 49TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSFFD         6Y 0B  4 56EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSFFK         4Y 0B  4 64EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42        XXPNS1        14A  O  5 19
     A  34                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A  42        XXPNS3        12A  O  5 49COLOR(WHT)
     A  34                                  DSPATR(ND)
     A                                  6  2MSGCON(045 JOV0700 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSAVD1         4Y 0B  6 49EDTCDE(4)
     A  91                                  DSPATR(PR)
     A  34                                  DSPATR(ND)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A            WSOTFF         2A  B  6 54
     A  91                                  DSPATR(PR)
     A  34                                  DSPATR(ND)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  6 57'Ft:'
     A  34                                  DSPATR(ND)
     A            WSFRD1         1A  B  6 61
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A                                  6 63'Mod: '
     A  34                                  DSPATR(ND)
     A            WSURF          1A  B  6 69VALUES(' ' 'A' 'B' 'C' 'D' 'E' 'F' -
     A                                      'G' 'H' 'K' 'L')
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A            WSSTAF         1A  O  6 63DSPATR(BL)
     A  34                                  DSPATR(ND)
     A            WSOPD1         7Y 0O  6 65DSPATR(HI)
     A  34                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Avvik lev.adr:'
     A  34                                  DSPATR(ND)
     A            WSLNAV        30A  B  7 17
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
N76  A                                      CHECK(LC)
     A                                  7 49'Pr.k:'
     A  34                                  DSPATR(ND)
     A            WSPKFF         1A  B  7 55
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  7 57'Frank:'
     A  34                                  DSPATR(ND)
     A            WSFRFF         3A  B  7 64
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  8  2MSGCON(045 JOV0701 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSFFBN        10A  B  8 49
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A            WSFFTN         8Y 0B  8 60EDTCDE(4)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                  9  3MSGCON(006 JOV0702 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSFFBL         9Y 2B  9 10EDTCDE(J)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                  9 24'A/E:'
     A  34                                  DSPATR(ND)
     A            WSFFAE         1A  B  9 29
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A            WSFFTX        35A  B  9 33
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                 11  2MSGCON(014 SHU0340 *LIBL/SYMSGF)
     A                                      DSPATR(RI)
     A            WSSDVT         5A  B 11 19TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSVTD         6Y 0B 11 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSVTK         4Y 0B 11 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                 11 40'------>'
     A  35                                  DSPATR(ND)
     A            WSSDT          5A  B 11 49TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSDTD         6Y 0B 11 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSDTK         4Y 0B 11 64EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42        XXPNS4        10A  O 12 19COLOR(WHT)
     A  35                                  DSPATR(ND)
     A  42        XXPNS2        12A  O 12 49COLOR(WHT)
     A  35                                  DSPATR(ND)
     A                                 13  2MSGCON(045 JOV0700 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSAVD2         4Y 0B 13 49EDTCDE(4)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSOTVT         2A  B 13 54
     A  92                                  DSPATR(PR)
     A  35                                  DSPATR(ND)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 13 57'Ft:'
     A  35                                  DSPATR(ND)
     A            WSFRD2         1A  B 13 61
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A                                 13 63'Mod: '
     A  35                                  DSPATR(ND)
     A            WSURE          1A  B 13 69VALUES(' ' 'A' 'B' 'C' 'D' 'E' 'F' -
     A                                      'G' 'H' 'K' 'L')
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A            WSSTAE         1A  O 13 63DSPATR(BL)
     A  35                                  DSPATR(ND)
     A            WSOPD2         7Y 0O 13 65DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  35                                  DSPATR(ND)
     A                                 14  2'Avvik hen.adr:'
     A  35                                  DSPATR(ND)
     A            WSHNAV        30A  B 14 17
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
N76  A                                      CHECK(LC)
     A                                 14 49'Pr.k:'
     A  35                                  DSPATR(ND)
     A            WSPKVT         1A  B 14 55
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 14 57'Frank:'
     A  35                                  DSPATR(ND)
     A            WSFRVT         3A  B 14 64
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 15  2MSGCON(045 JOV0701 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSVFBN        10A  B 15 49
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSVFTN         8Y 0B 15 60EDTCDE(4)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 16  3MSGCON(006 JOV0702 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSVFBL         9Y 2B 16 10EDTCDE(J)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 16 24'A/E:'
     A  35                                  DSPATR(ND)
     A            WSVFAE         1A  B 16 29
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSVFTX        35A  B 16 33
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 18  2MSGCON(015 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 18MSGCON(015 DIV0030 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 34MSGCON(015 DIV0031 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 53MSGCON(015 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX2        65A  O 19  2MSGID(&MSGNR2 SYMSGF)
     A                                      COLOR(WHT)
     A* FORENKLET BILDE VED REN INNLAND!!!!!
     A          R BILDE22
     A*%%TS  SD  20170324  085908  SYSTEMA     REL-V7R1M0  5770-WDS
     A                                      CF02(02 'MODUS')
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF04(04 'SØKING')
     A N37                                  CF05(05 'Gå til faktura')
     A N37                                  CF06(06 'BEREGN KUBIKK')
     A N37                                  CF07(07 'SPØRRING PÅ OPPDRAG')
     A N37                                  CF08(08 'LASTEBÆRERE/VARELINJER')
     A N37                                  CF09(09 'PLANLEGG/PLUKK')
     A N37                                  CF10(10 'FULLOAD')
     A N37                                  CF11(11 'REKVISISJON')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF13(13 'SETTE ETD/ATD.')
     A                                      CF14(14 'Vise opplysning')
     A                                      CF15(15 'FRIE SØKEVEIER')
     A N37                                  CF16(16 'Neste')
     A                                      CF17(17 'Arkiv')
     A                                      CF18(18 'FRITEKSTER')
     A                                      CF19(19 'Avreegn')
     A                                      CF20(20 'TRACK&TRACE')
     A                                      CF22(22 'Hurtigbooking')
     A                                      CF23(23 'SKILLEARK')
     A                                      CF24(24 'FLERE TASTER')
     A  27                                  ALARM
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYTR100005 SYTR10PNL)
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPPNLGRP(SYTR100007 SYTR10PNL)
     A                                      HLPARA(02 001 02 080)
     A          H                           HLPPNLGRP(SYTR100010 SYTR10PNL)
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPPNLGRP(SYTR100020 SYTR10PNL)
     A                                      HLPARA(04 001 04 008)
     A          H                           HLPPNLGRP(SYTR100030 SYTR10PNL)
     A                                      HLPARA(04 012 04 095)
     A          H                           HLPPNLGRP(SYTR100040 SYTR10PNL)
     A                                      HLPARA(05 061 05 080)
     A          H                           HLPPNLGRP(SYTR100050 SYTR10PNL)
     A                                      HLPARA(06 001 06 042)
     A          H                           HLPPNLGRP(SYTR100070 SYTR10PNL)
     A                                      HLPARA(06 044 06 080)
     A          H                           HLPPNLGRP(SYTR100080 SYTR10PNL)
     A                                      HLPARA(07 001 07 027)
     A          H                           HLPPNLGRP(SYTR100007 SYTR10PNL)
     A                                      HLPARA(07 029 07 042)
     A          H                           HLPPNLGRP(SYTR100100 SYTR10PNL)
     A                                      HLPARA(07 044 07 067)
     A          H                           HLPPNLGRP(SYTR100100 SYTR10PNL)
     A                                      HLPARA(07 069 07 080)
     A          H                           HLPPNLGRP(SYTR100120 SYTR10PNL)
     A                                      HLPARA(08 001 08 069)
     A          H                           HLPPNLGRP(SYTR100130 SYTR10PNL)
     A                                      HLPARA(08 071 08 080)
     A          H                           HLPPNLGRP(SYTR100140 SYTR10PNL)
     A                                      HLPARA(09 001 11 080)
     A          H                           HLPPNLGRP(SYTR100150 SYTR10PNL)
     A                                      HLPARA(12 001 14 080)
     A          H                           HLPPNLGRP(SYTR100160 SYTR10PNL)
     A                                      HLPARA(15 001 15 023)
     A          H                           HLPPNLGRP(SYTR100160 SYTR10PNL)
     A                                      HLPARA(16 001 16 023)
     A          H                           HLPPNLGRP(SYTR100160 SYTR10PNL)
     A                                      HLPARA(17 001 17 023)
     A          H                           HLPPNLGRP(SYTR100170 SYTR10PNL)
     A                                      HLPARA(15 025 15 080)
     A          H                           HLPPNLGRP(SYTR100170 SYTR10PNL)
     A                                      HLPARA(16 025 16 080)
     A          H                           HLPPNLGRP(SYTR100170 SYTR10PNL)
     A                                      HLPARA(17 025 17 080)
     A          H                           HLPPNLGRP(SYTR100170 SYTR10PNL)
     A                                      HLPARA(18 001 18 060)
     A          H                           HLPPNLGRP(SYTR100180 SYTR10PNL)
     A                                      HLPARA(23 001 23 060)
     A          H                           HLPPNLGRP(SYTR100185 SYTR10PNL)
     A                                      HLPARA(23 001 23 060)
     A          H                           HLPPNLGRP(SYTR100190 SYTR10PNL)
     A                                      HLPARA(20 001 20 080)
     A          H                           HLPPNLGRP(SYTR100200 SYTR10PNL)
     A                                      HLPARA(21 001 21 080)
     A          H                           HLPPNLGRP(SYTR100210 SYTR10PNL)
     A                                      HLPARA(22 001 22 028)
     A          H                           HLPPNLGRP(SYTR100220 SYTR10PNL)
     A                                      HLPARA(22 030 22 048)
     A          H                           HLPPNLGRP(SYTR100230 SYTR10PNL)
     A                                      HLPARA(22 050 22 080)
     A          H                           HLPPNLGRP(SYTR100240 SYTR10PNL)
     A                                      HLPARA(23 001 23 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGLN5         7A  P
     A            MSGLN6         7A  P
     A            MSGNR          7A  P
     A            WSRUND         8S 0H
     A            WSANS          1S 0H
     A            WSKDFS         1A  H
     A            WSVALS         3A  H
     A            WSVALT         3A  H
     A            WSVALP         3S 1H
     A            WSSDF          5A  H
     A            WSSDFD         6S 0H
     A            WSSDFK         4S 0H
     A            WSLANF         2A  H
     A            WSSONF         3A  H
     A            WSPNRF         5Y 0H
     A            WSSDT          5A  H
     A            WSSDTD         6S 0H
     A            WSSDTK         4S 0H
     A            WSLANT         2A  H
     A            WSSONT         3A  H
     A            WSPNRT         5S 0H
     A            WSADFX        20A  H
     A            WSADRS        30A  H
     A            WSADS2        30A  H
     A            WSADRK        30A  H
     A            WSADK2        30A  H
     A            WSGM1         15A  H
     A            WSNT           7S 0H
     A            WSGM2         15A  H
     A            WSVS2         25A  H
     A            WSVERV         3A  H
     A            WSVERB        13S 2H
     A            WSETTV         3A  H
     A            WSFRAV         3A  H
     A            WSFRAB        13S 2H
     A            WSMVA          1A  H
     A            WSFA11         7A  H
     A            WSFA12         4A  H
     A            WSFLP1         3S 0H
     A            WSFA21         7A  H
     A            WSFA22         4A  H
     A            WSFLP2         3S 0H
     A            WSGNA          4A  H
     A            WSGNB          5A  H
     A            WSGNC          6A  H
     A            WPLANF         2A  H
     A            WPLANT         2A  H
     A            WPSDFD         6S 0H
     A            WPSDFK         4S 0H
     A            WPSDTD         6S 0H
     A            WPSDTK         4S 0H
     A            WSETTB        13S 2H
     A            WSPOS2         4S 0H
     A            WSPK4          1A  H
     A            WSPK6          1A  H
     A            WSPK7          1A  H
S01  A*           W2TOLL         2S 0H
     A            W2TOLL         4S 0H
     A            W2KDME         1A  H
     A            W2KDE          1A  H
     A            WSPK2          1A  H
     A            WSNTVS         3S 0H
     A            WSOPDG         7S 0H
     A            MSGIN          7A  P
     A                                  1  2'SYSPED400/SYTR10'
     A                                      COLOR(BLU)
     A N37        MSGINL        40A  O  1 19MSGID(&MSGIN SYMSGF)
     A                                      COLOR(WHT)
     A  37                              1 19MSGCON(040 JOV0216 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N38                              1 60DATE
     A                                      EDTCDE(Y)
     A  38                              1 60MSGCON(017 DIV2400 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N38                              1 69TIME
     A                                  2  2'Send.'
     A            WSSNDN        20A  B  2  8COLOR(YLW)
     A                                  2 29MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  2 34TEXT('Avdeling')
     A N45                                  DSPATR(PR)
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A N45        WSOPD          7Y 0O  2 39TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A  45                              2 39'*NY*'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2 47MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            WSSG           3A  B  2 51TEXT('Signatur')
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                  2 55'Tu/Bil'
     A            WSPRO          8Y 0B  2 62TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSHAWB        10A  O  2 71COLOR(WHT)
     A                                  3  2MSGCON(005 SHU0316 *LIBL/SYMSGF)
     A            WSKDAK         1A  B  3  8COLOR(YLW)
     A            WSKNA          8Y 0B  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAA         30A  B  3 19TEXT('Navn Agent')
     A  98                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A  98                                  COLOR(RED)
     A N98                                  COLOR(WHT)
     A            WSADA         30A  O  3 50DSPATR(UL)
     A                                      COLOR(WHT)
     A  91                                  DSPATR(RI)
     A                                  4  2MSGCON(005 SHU0317 *LIBL/SYMSGF)
     A            WSKDFF         1A  B  4  8COLOR(YLW)
     A  93                                  DSPATR(RI)
     A            WSKNFP         8Y 0B  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAFP        30A  B  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A            WSADFP        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A  92                                  DSPATR(RI)
     A                                  5  2MSGCON(005 SHU0318 *LIBL/SYMSGF)
     A            WSRFFP        35A  B  5  8TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  59                                  DSPATR(RI)
     A            WSAVVA        18A  O  5 50COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            WSKNS          8Y 0B  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A  67
     AO 68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAMS        30A  B  6 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(014 SHU0337 *LIBL/SYMSGF)
     A            WSNAS         30A  B  7 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADS1        30A  B  7 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADS3        30A  B  8 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            WSKNK          8Y 0B  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A  62
     AO 61                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAMK        30A  B  9 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(014 SHU0338 *LIBL/SYMSGF)
     A            WSNAK         30A  B 10 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADK1        30A  B 10 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSEDIINF      15A  O 11  2COLOR(RED)
     A            WSADK3        30A  B 11 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2'Agent'
     A            WSKNFA    R     Y  B 12  8REFFLD(HEADFR/TRKNFA *LIBL/HEADF)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSTSTA         1A  B 12 17COLOR(YLW)
     A            WSNAFA        30A  B 12 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13  2'Fra'
     A            WPSDF          5A  B 13  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WPPNS1        14A  B 13 14
     A                                 13 50MSGCON(003 SHU0321 *LIBL/SYMSGF)
     A            WPSDT          5A  B 13 54TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WPPNS2        12A  B 13 60
     A            WPSDFF         5A  O 14 14COLOR(WHT)
     A            WPPNS3        12A  O 14 20COLOR(WHT)
     A            WPSDVT         5A  O 14 43COLOR(WHT)
     A            WPPNS4        10A  O 14 49COLOR(WHT)
     A                                 14 62MSGCON(010 SHU0757 *LIBL/SYMSGF)
     A            WSBRUT         6Y 0O 14 74COLOR(WHT)
     A                                      EDTCDE(M)
     A                                 15  2'OT FRA ANTALL ENH/VARESLAG        -
     A                                                B.VEKT   KUBIKK LA.M. F.B-
     A                                      .VEKT  PK'
     A                                      DSPATR(UL)
     A            WSOT           2A  B 16  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR           3A  B 16  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSNTWS         5Y 0B 16 10TEXT('Antall')
     A                                      DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS1         25A  B 16 16TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVKT          9Y 0B 16 43TEXT('Vekt')
     A                                      DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM3           7Y 3B 16 53EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSLM           4Y 2B 16 62TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSFBV          9Y 0B 16 68TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A            WSKDPL         1A  B 16 79TEXT('Planleggingskode')
     A                                      COLOR(YLW)
N40  A*                                17  2'Varmegods'
N40  A*           WSVARM         1A  B 17 12DSPATR(UL)
N40  A*                                     COLOR(YLW)
N40  A*                                17 15'Farlig gods'
N40  A*           WSFARL         1A  B 17 27DSPATR(UL)
N40  A*                                     COLOR(YLW)
     A                                 17  2'Varm'
     A            WSVARM         1A  B 17  7DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  9'Farl'
     A            WSFARL         1A  B 17 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17 16'Leng'
     A            WSLENG         1A  B 17 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17 23'Adv'
     A            WSADVI         1A  B 17 27DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSETTX         6A  O 17 29COLOR(RED)
     A            WSET82         8Y 2O 17 36EDTCDE(4)
     A                                      COLOR(RED)
     A                                 17 46MSGCON(006 JOV0168 *LIBL/SYMSGF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(RED)
     A            TRAVD0    R        O 17 53REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A            TROPD0    R        O 17 58REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                 17 66'UTFAKT'
     A                                 17 74'AVR'
     A                                 17 77'F19'
     A                                      COLOR(BLU)
     A                                 18  2'LS'
     A            WSSDL         20A  B 18  8TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A                                 18 44'Innh. '
     A            TRAVD1         4Y 0O 18 51COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 18 56COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSINHF         7Y 0B 18 64DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            WSINHA         7Y 0B 18 73DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            WSUFTX         5A  O 19  2
     A            WSKF           2A  O 19  8COLOR(RED)
     A            WSKFT1         1A  O 19 11COLOR(RED)
     A            WSFT1A        30A  O 19 13COLOR(RED)
     A                                 19 46MSGCON(005 SHU0333 *LIBL/SYMSGF)
     A            WSAVV2         9A  O 19 52COLOR(WHT)
     A            WSFRAK         1A  B 19 62
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  53                                  DSPATR(RI)
     A            WSFRAF         7Y 0B 19 64
     A  51                                  DSPATR(RI)
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A            WSFRAA         7Y 0B 19 73DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A  63                                  DSPATR(RI)
     A            WSFT1B        15A  O 20 13COLOR(WHT)
     A            WSUSR         10A  O 20 29COLOR(PNK)
     A                                 20 44'Utkj. '
     A            TRAVD2         4Y 0O 20 51COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 20 56COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSUTKF         7Y 0B 20 64DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            WSUTKA         7Y 0B 20 73
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 21  2'L.sted'
     A            WSLKOD         5A  B 21  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21 15'LL.st'
     A            WSLLST         1A  B 21 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21 23'Pos'
     A            WSPOSA         3A  B 21 27DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21 46'Annet '
     A            WSFRJF         7Y 0B 21 64EDTCDE(M)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A            WSFRJA         7Y 0B 21 73
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 22  2MSGCON(006 SHU0327 *LIBL/SYMSGF)
     A            WSPK3          1A  B 22  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A            WSPK5          1A  B 22 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                 22 13MSGCON(004 SHU0329 *LIBL/SYMSGF)
     A            WSPK1          1A  B 22 18TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 22 35'B.pall'
     A            WSAPLL         3Y 0B 22 42EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 22 46'SUM...'
     A                                 22 53'Godkj.'
     A            WSBLGK         3A  B 22 60DSPATR(UL)
     A  36                                  DSPATR(PR)
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A            WSSUMF         7Y 0B 22 64DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            WSSUMA         7Y 0B 22 73DSPATR(PR)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            MSGL1         18A  O 26  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 26 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 26 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 26 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL5         18A  O 26 82MSGID(&MSGLN5 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL6         18A  O 26102MSGID(&MSGLN6 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 81'|'
     A                                      COLOR(BLU)
     A                                  3 81'|'
     A                                      COLOR(BLU)
     A                                  4 81'|'
     A                                      COLOR(BLU)
     A                                  5 81'|'
     A                                      COLOR(BLU)
     A                                  6 81'|'
     A                                      COLOR(BLU)
     A                                  7 81'|'
     A                                      COLOR(BLU)
     A                                  8 81'|'
     A                                      COLOR(BLU)
     A                                  9 81'|'
     A                                      COLOR(BLU)
     A                                 10 81'|'
     A                                      COLOR(BLU)
     A                                 11 81'|'
     A                                      COLOR(BLU)
     A                                 12 81'|'
     A                                      COLOR(BLU)
     A                                 13 81'|'
     A                                      COLOR(BLU)
     A                                 15 81'|'
     A                                      COLOR(BLU)
     A                                 16 81'|'
     A                                      COLOR(BLU)
     A                                 17 81'|'
     A                                      COLOR(BLU)
     A                                 23 81'|'
     A                                      COLOR(BLU)
     A                                 24 81'|'
     A                                      COLOR(BLU)
NXX  A                                  1 85'Diverse ekstra info.......'
NXX  A                                      COLOR(WHT)
NXX  A            EXTR01        49A  O  2 83
NXX  A            EXTR02        49A  O  3 83
NXX  A            EXTR03        49A  O  4 83
NXX  A            EXTR04        49A  O  5 83
NXX  A            EXTR05        49A  O  6 83
NXX  A            EXTR06        49A  O  7 83
NXX  A            EXTR07        49A  O  8 83
NXX  A            EXTR08        49A  O  9 83
NXX  A            EXTR09        49A  O 10 83
NXX  A            EXTR10        49A  O 11 83
NXX  A            EXTR11        49A  O 12 83
NXX  A            EXTR12        49A  O 13 83
NXX  A            EXTR13        49A  O 14 83
NXX  A            EXTR14        49A  O 15 83
NXX  A            EXTR15        49A  O 16 83
NXX  A            EXTR16        49A  O 17 83
NXX  A            EXTR17        49A  O 18 83
NXX  A            EXTR18        49A  O 19 83
NXX  A            EXTR19        49A  O 20 83
NXX  A            EXTR20        49A  O 21 83
NXX  A            EXTR21        49A  O 22 83
NXX  A            EXTR22        49A  O 23 83
NXX  A            EXTR23        49A  O 24 83
NXX  A            EXTR24        49A  O 25 83
     A          R STATFEIL
     A*%%TS  SD  20110601  135950  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                      CF12(12)
     A                                      CF03(12)
     A                                  1  2'SYTR10'
     A                                      COLOR(BLU)
     A                                  1 11MSGCON(032 JOV1239 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(040 JOV1240 *LIBL/SYMSGF)
     A                                  5  2MSGCON(040 JOV1241 *LIBL/SYMSGF)
     A                                  6  2MSGCON(040 JOV1242 *LIBL/SYMSGF)
     A                                  7  2MSGCON(040 JOV1243 *LIBL/SYMSGF)
     A                                  8  2MSGCON(040 JOV1244 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(040 JOV1245 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 10 32'Enter'
     A                                      COLOR(BLU)
     A          R SLETFERD
     A*%%TS  SD  20110601  135950  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                      CF12(12)
     A                                      CF03(12)
     A                                  1  2'SYTR10'
     A                                      COLOR(BLU)
     A                                 10 32'Enter'
     A                                      COLOR(BLU)
     A                                  1 11MSGCON(032 SHU1043 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  3  2MSGCON(040 SHU1044 *LIBL/SYMSGF)
     A                                  4  2MSGCON(040 SHU1045 *LIBL/SYMSGF)
     A                                  5  2MSGCON(040 SHU1046 *LIBL/SYMSGF)
     A                                  6  2MSGCON(040 SHU1047 *LIBL/SYMSGF)
     A                                  7  2MSGCON(040 SHU1048 *LIBL/SYMSGF)
     A                                  8  2MSGCON(040 SHU1049 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R ENDRET
     A*%%TS  SD  20110601  135950  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                  1  2'SYTR10'
     A                                      COLOR(BLU)
     A                                  1 11MSGCON(032 JOV1397 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(040 JOV1398 *LIBL/SYMSGF)
     A                                  4  2MSGCON(040 JOV1399 *LIBL/SYMSGF)
     A                                  5  2MSGCON(040 JOV1400 *LIBL/SYMSGF)
     A                                  6 24MSGCON(010 JOV1401 *LIBL/SYMSGF)
     A                                  6  2MSGCON(010 JOV1402 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  7 24MSGCON(010 JOV1403 *LIBL/SYMSGF)
     A                                  7  2MSGCON(010 JOV1404 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  8  2MSGCON(040 JOV1405 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(040 JOV1406 *LIBL/SYMSGF)
     A                                 10 32'Enter'
     A                                      COLOR(BLU)
     A            HEVKT     R        O  6 13REFFLD(HEADFR/HEVKT *LIBL/HEADF)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEM3      R        O  7 14REFFLD(HEADFR/HEM3 *LIBL/HEADF)
     A                                      EDTCDE(M)
     A                                      COLOR(WHT)
     A            GMM32     R        O  7 36REFFLD(HEADFR/HEM3 *LIBL/HEADF)
     A                                      EDTCDE(M)
     A            GMVKT2    R        O  6 35REFFLD(HEADFR/HEVKT *LIBL/HEADF)
     A                                      EDTCDE(4)
     A          R VELGTRAN
     A*%%TS  SD  20110601  135950  JOVO        REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF04(04)
     A                                      CF12(12)
     A                                      CF03(12)
     A            MSGNR3         7A  P
     A                                  1  2'SYTR10'
     A                                      COLOR(BLU)
     A                                  1  9MSGCON(032 JOV1442 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  9  2'Enter'
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(043 JOV1443 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(012 JOV1444 *LIBL/SYMSGF)
     A            WSATRA         8Y 0B  5  6EDTCDE(4)
     A                                      COLOR(YLW)
     A            VMNAVN        30A  O  5 15COLOR(WHT)
     A                                  7  2MSGCON(043 JOV1445 *LIBL/SYMSGF)
     A                                  8  2MSGCON(043 JOV1446 *LIBL/SYMSGF)
     A                                  9 11MSGCON(015 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  9 27MSGCON(015 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX3        40A  O 10  2MSGID(&MSGNR3 SYMSGF)
     A                                      COLOR(WHT)
