     A*___________________________
     A* SYSPED / TACT
     A*"""""""""""""""""""""""""""
     A          R TACTFR                    PFILE(TACTF)
     A                                      TEXT('TACT')
     A          K TACAR1
     A          K TASTFR
     A          K TASTTI
     A          K TAFLIG
     A          K TAVEKT
