     A          R TARIR                     PFILE(TARI)
     A          K TAALFA
     A          K TADATO
     A          S TADTS                     COMP(EQ 0)
