     A          R TARIR                     PFILE(TARI)
     A          K TATANR
     A          K TATAR
     A          K TADATO
     A          S TADTS                     COMP(EQ 0)
