     A*%%TS  SD  20230328  134353  CB          REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
      *
     A          R NOERAS
     A                                      ASSUME
     A                                      OVERLAY
     A                                  1  2' '
     A*
     A          R WIND01
     A*%%TS  SD  20230328  134211  CB          REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A                                      WINDOW(*DFT 16 82)
     A*
     A          R SUBFIL                    SFL
     A*%%TS  SD  20230328  134353  CB          REL-V7R4M0  5770-WDS
     A            SFNR           1A  B  5  3VALUES(' ' '1')
     A  51                                  DSPATR(PR)
     A            T2KUNIK   R        O  5  6REFFLD(T2KUNIK TRKODF2)
     A            T2KTXTN   R        O  5 11REFFLD(T2KTXTN TRKODF2)
     A*
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20230328  134353  CB          REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      WINDOW(WIND01)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF12(12 'tilbake')
     A                                      KEEP
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A            ZRECNO         4S 0H      SFLRCDNBR
     A                                  1  1MSGCON(023 EDI0602 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  2  3MSGCON(008 EDI0701 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(003 EDI0609 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            W2KUNIK   R        B  4  6REFFLD(T2KUNIK TRKODF2)
     A                                  3  6'Kode'
     A                                      COLOR(WHT)
     A                                  3 11'Tekst'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      SLNO(15)
     A                                      CLRL(01)
     A                                      OVERLAY
     A                                      WINDOW(WIND01)
     A                                  1  2MSGCON(010 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
