     A          R TR019FR
     A            TRSESG         3          COLHDG('Signatur')
     A            TRSEAVD        4S 0       COLHDG('Avdeling')
     A            TRSETDN        7S 0       COLHDG('Deklarasjonsnummer')
     A          K TRSESG
     A          K TRSEAVD
     A          K TRSETDN
