     A*%%TS  SD  20230427  093240  CB          REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A          R BILDE01
     A*%%TS  SD  20230424  205051  CB          REL-V7R4M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'Søk kunde/leverandør')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SAD023'
     A                                      COLOR(BLU)
     A                                  1 30'Hente til NCTS Eksport'
     A                                      COLOR(WHT)
     A                                  1110DATE
     A                                      EDTCDE(Y)
     A                                  1120TIME
     A                                  4 13'Avdeling:'
     A            WSAAVD         4Y 0B  4 23TEXT('AVDELINGSNR')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  99                                  ERRMSG('Tastet avdeling er ikke reg-
     A                                      istrert.' 99)
     A            KOANVN        33A  O  4 30TEXT('AVDELINGSNAVN')
     A                                      COLOR(BLU)
     A                                  7 20'Velg søkevei med startpunkt'
     A                                      COLOR(WHT)
     A                                  8 20'EKSTERN REF'
     A            WFSSOK        35A  B  8 35TEXT('CL-REF')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 20'Dato:'
     A            WSDT           6Y 0B  9 35TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  98                                  ERRMSG('Du må velge et av de startp-
     A                                      unktene.' 98)
     A                                 10 20'Tolldek.nr.'
     A            WSTDN          7Y 0B 10 35TEXT('Tolldeklarasjonsnr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 20'Avsendersnr.'
     A            WSKNK          8Y 0B 11 35TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  97                                  ERRMSG('Tastet kundenr. finnes ikke-
     A                                      . Frøv F5 for kundesøk.' 97)
     A                                 11 48'Dato:'
     A            WSDTK          6Y 0B 11 55TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12 20'Mottakersnr.'
     A            WSKNS          8Y 0B 12 35TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  96                                  ERRMSG('Tastet lev.nr. finnes ikke.-
     A                                       Prøv F5 for lev.søking' 96)
     A                                 12 48'Dato:'
     A            WSDTS          6Y 0B 12 55TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 13 20'Tariffør:'
     A            WSSG           3A  B 13 35TEXT('Signatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 48'Dato:'
     A            WSDTT          6Y 0B 13 55TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 14 20'Løpenummer:'
     A            WSTLL         10A  B 14 35TEXT('Tollnr Løpenr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 23'Eksp.enhet:'
     A            WSTLE          6Y 0B 15 38DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                 16 20'Godsnummer:'
     A            WSAAR          4A  B 16 35TEXT('Tollnr Løpenr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSGN          11A  B 16 40TEXT('Godsnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17 20MSGCON(014 YBC0053 *LIBL/SYMSGF)
     A            WSST           1A  B 17 35TEXT('STATUS')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 20MSGCON(014 DIV1909 *LIBL/SYMSGF)
     A            WSMI           1A  B 18 35TEXT('Midlertidig  /I')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I')
     A                                 19 20MSGCON(013 SHU1234 *LIBL/SYMSGF)
     A            WSSEKV         6Y 0B 19 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 19 48MSGCON(006 DIV1902 *LIBL/SYMSGF)
     A            WSSEKD         6Y 0B 19 55TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 20 20MSGCON(013 SHU1279 *LIBL/SYMSGF)
     A            WSRG          11A  B 20 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20 48MSGCON(006 DIV1902 *LIBL/SYMSGF)
     A            WSDTRG         6Y 0B 20 55TEXT('Registreringsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 21 20MSGCON(013 YBC2022 *LIBL/SYMSGF)
     A            WSFN          17A  B 21 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 22 20MSGCON(013 YBC2023 *LIBL/SYMSGF)
     A            WSMRK         17A  B 22 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 26 20'F3 = Avslutt'
     A                                      COLOR(BLU)
     A                                 26 36'F4 = Søk kunde/leverandør'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A          R SUBFIL                    SFL
     A*%%TS  SD  20230427  093240  CB          REL-V7R4M0  5770-WDS
     A            SEKNK          8Y 0H
     A            XIN50          1A  H
     A            XIN36          1A  H
     A            SETLE          6A  H
     A            SEDTG         10A  H
     A            SETLL         10A  H
     A            SEVKB         11Y 0H
     A            WSNR           1Y 0B  5  2EDTCDE(4)
     A            SEAVD          4Y 0O  5  5TEXT('Tolldeklarasjonsnr')
     A                                      EDTCDE(4)
     A            SETDN          7Y 0O  5 10TEXT('Tolldeklarasjonsnr')
     A                                      EDTCDE(4)
     A  42                                  COLOR(TRQ)
     A  36                                  DSPATR(RI)
     A            SESG           3A  O  5 18TEXT('Signatur')
     A  45                                  COLOR(TRQ)
     A            WSDT2          6S 0O  5 22TEXT('Registreringsdato')
     A  41                                  COLOR(TRQ)
     A            XSETLL        10A  O  5 29TEXT('Tollnr Løpenr')
     A  38
     AO 46                                  COLOR(TRQ)
     A            XSETLE         6A  O  5 40TEXT('Tollnr Ekspsted')
     A  38
     AO 46                                  COLOR(TRQ)
     A            SEST           1A  O  5 47TEXT('Status')
     A  50                                  DSPATR(UL)
     A N49                                  COLOR(RED)
     A  49                                  COLOR(TRQ)
     A            WSNAK         26A  O  5 49
     A  40
     AO 34
     AO 35
     AO 43                                  COLOR(TRQ)
     A            SEVKB09        9Y 0O  5 76TEXT('Bruttovekt')
     A                                      EDTCDE(4)
     A            SEMI           1A  O  5 86
     A  48                                  COLOR(TRQ)
     A            SEGN          15A  O  5 88TEXT('Godsnummer')
     A  47                                  COLOR(TRQ)
     A            WOVERFOR       1A  O  5104
     A  36                                  DSPATR(RI)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20230427  093240  CB          REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0021)
     A                                      SFLPAG(0020)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF07(07 'Overfør')
     A                                      CF08(08 'Søk')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SAD023'
     A                                      COLOR(BLU)
     A                                  1 20'Hente til NCTS Eksport'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 60SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1110DATE
     A                                      EDTCDE(Y)
     A                                  1120TIME
     A                                  2  2'Avdeling:'
     A            WSAAVD         4Y 0O  2 12COLOR(BLU)
     A                                      EDTCDE(4)
     A            KOANVN        33A  O  2 17TEXT('AVDELINGSNAVN')
     A                                      COLOR(BLU)
     A                                  3  2'1=Overför til NCTS   5=Vis tolldek-
     A                                      larasjon   9=Fjern overføring'
     A                                      COLOR(BLU)
     A                                  4  2'O  Avd  Tdeknr  Sig Dato   Løpenr -
     A                                          Eksp   S Mottaker              -
     A                                                Vekt I Godsnummer     '
     A                                      COLOR(WHT)
     A                                  4104'Skal_overføres'
     A                                      COLOR(WHT)
     A          R BUNN
     A*%%TS  SD  20230424  204512  CB          REL-V7R4M0  5770-WDS
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A            MSGNR          7A  P
     A                                 26  2'F3=Avslutt   F5=Forny   F7=Hent ma-
     A                                      rkerte   F8=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
