********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11128 * 01 YBC PTF11 VEKT ER ENDRET FRA 9.0 TIL 11.3
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12XXX * 02 YBC PTF12 Ut med transportør
12XXX * 03 SH  PTF12 EDITKODE PÅ VEKT FRA Z TIL 4
********************************************************************
     A          R TR108P1
     A            KFMT1         75      1  2
     A            KFMT2         75      2  2
     A                                  4  2'FORHÅNDSVARSEL NORGE'
     A            UTRNR         18      6 42BARCODE(CODE128 3 *HRITOP *HRZ +
     A                                      (*WIDTH 0.010) (*RATIO 3) X'02')
     A                                 12  2'Utskriftdato  :'
     A                                 12 20DATE
     A                                      EDTCDE(Y)
     A                                 12 34'Tid:'
     A                                 12 39TIME
     A                                      EDTWRD('  :  :  ')
     A                                 14  2'Vår referanse :'
     A            THAVD          4  0  14 20
     A                                 14 24'/'
     A            THTDN          7  0  14 25
     A                                 14 32'/'
     A            THSG           3     14 33
     A                                 16  2'Avg.tollsted  :'
     A            THCATS         8A    16 20HIGHLIGHT
     A            XHCATS        35A    16 30HIGHLIGHT
     A                                 18  2'Avsender      :'
     A            THNAS         30A    18 20
S02  A*           XHTINS        17A    18 51
N02  A            THTINS        17A    18 51
     A            THADS1        30A    19 20
     A            THPNS          9A    20 20
     A            THPSS         24A    20 30
     A                                 22  2'Mottaker      :'
     A            THNAK         30A    22 20
S02  A*           XHTINK        17A    22 51
N02  A            THTINK        17A    22 51
     A            THADK1        30A    23 20
     A            THPNK          9A    24 20
     A            THPSK         24A    24 30
     A            THLKK          2A    24 58
N02  A                                 26  2'Transportør   :'
N02  A            THNAT         30A    26 20
N02  A            THTINT        17A    26 51
N02  A            THADT1        30A    27 20
N02  A            THPNT          9A    28 20
N02  A            THPST         24A    28 30
N02  A            THLKT          2A    28 58
N02   * Start:  Alle linjenr + 4.  Ingen merking
     A                                 30  2'Hovedansvarlig:'
     A            THNAA         30A    30 20
S02  A*           XHTINA        17A    30 51
N02  A            THTINA        17A    30 51
     A            THADA1        30A    31 20
     A            THPNA          9A    32 20
     A            THPSA         24A    32 30
     A            THLKA          2A    32 58
     A                                 34  2'Brutto vekt   :'
S01  A*           THVKB          9  0  34 20EDTCDE(Z)
S03  A*           THVKB         11  3  34 20EDTCDE(Z)
N03  A            THVKB         11  3  34 20EDTCDE(4)
     A                                 36  2'Antall kolli  :'
     A            THNTK          7  0  36 20EDTCDE(Z)
     A                                 38  2'Transportmåte :'
     A            THTRM          2  0  38 20
     A                                 40  2'Tr.middels ID :'
     A            THTAID        27A    40 20
N02   * Slutt:  Alle linjenr + 4.  Ingen merking
     A            KFMT3         75     64  2
