     A          R TRKODUR
     A            TRKODU01       5A         COLHDG('Location code')
     A            TRKODU02     128A         COLHDG('Location name')
     A            TRKODU03       2A         COLHDG('Subdivision')
     A            TRKODU04       8A         COLHDG('Function')
     A            TRKODU05       2A         COLHDG('Status')
     A            TRKODU06       4A         COLHDG('Date')
     A            TRKODU07      11A         COLHDG('Coordinates')
