     A          R TRKODF2R
     A            T2KUNIK        3A         COLHDG('UNIK KODE')
     A            T2KTXTN       70A         COLHDG('NORSK TEKST')
     A            T2KTXTE       70A         COLHDG('ENGELSK TEKST')
     A          K T2KUNIK
