     A          R TRKODU2R
     A            TRKODU201      5A         COLHDG('Unit code')
     A            TRKODU202    128A         COLHDG('Unit name')
