      *____________________________________
      * SYSPED / NCTS REGLER OG BETINGELSER
      *""""""""""""""""""""""""""""""""""""
     A          R TRREGR
     A            TRUNI1         1A         COLHDG('REGEL/BETINGELSE')
     A            TRUNI2         5A         COLHDG('KODE')
     A            TRTXT1        70A         COLHDG('TEKST 1')
     A            TRTXT2        70A         COLHDG('TEKST 2')
     A            TRTXT3        70A         COLHDG('TEKST 3')
     A            TRTXT4        70A         COLHDG('TEKST 4')
     A            TRTXT5        70A         COLHDG('TEKST 5')
     A            TRTXT6        70A         COLHDG('TEKST 6')
     A            TRTXT7        70A         COLHDG('TEKST 7')
     A            TRTXT8        70A         COLHDG('TEKST 8')
     A            TRTXT9        70A         COLHDG('TEKST 9')
     A            TRTXTA        70A         COLHDG('TEKST A')
