      *____________________________________
      * SYSPED / NCTS REGLER OG BETINGELSER
      *""""""""""""""""""""""""""""""""""""
     A          R TRREGR                    PFILE(TRREGELF)
     A          K TRUNI1
     A          K TRUNI2
