     A          R TVIN01FR
     A            T01GRP         5A         COLHDG('LANDGRUPPE')
     A            T01TXT        50A         COLHDG('BESKRIVELSE')
     A            T01PRE         1A         COLHDG('PREFERANSE')
     A            T01DTF         8S 0       COLHDG('F.O.M. DATO')
     A            T01I01         2A         COLHDG('INNKLUDERT LAND 01')
     A            T01I02         2A         COLHDG('INNKLUDERT LAND 02')
     A            T01I03         2A         COLHDG('INNKLUDERT LAND 03')
     A            T01I04         2A         COLHDG('INNKLUDERT LAND 04')
     A            T01I05         2A         COLHDG('INNKLUDERT LAND 05')
     A            T01I06         2A         COLHDG('INNKLUDERT LAND 06')
     A            T01I07         2A         COLHDG('INNKLUDERT LAND 07')
     A            T01I08         2A         COLHDG('INNKLUDERT LAND 08')
     A            T01I09         2A         COLHDG('INNKLUDERT LAND 09')
     A            T01I10         2A         COLHDG('INNKLUDERT LAND 10')
     A            T01E01         2A         COLHDG('EKSKLUDERT LAND 01')
     A            T01E02         2A         COLHDG('EKSKLUDERT LAND 02')
     A            T01E03         2A         COLHDG('EKSKLUDERT LAND 03')
     A            T01E04         2A         COLHDG('EKSKLUDERT LAND 04')
     A            T01E05         2A         COLHDG('EKSKLUDERT LAND 05')
     A            T01E06         2A         COLHDG('EKSKLUDERT LAND 06')
     A            T01E07         2A         COLHDG('EKSKLUDERT LAND 07')
     A            T01E08         2A         COLHDG('EKSKLUDERT LAND 08')
     A            T01E09         2A         COLHDG('EKSKLUDERT LAND 09')
     A            T01E10         2A         COLHDG('EKSKLUDERT LAND 10')
     A          K T01GRP
