     A*__________________________________
     A* SYSPED / UNIT PÅ BILNUMMER
     A*""""""""""""""""""""""""""""""""""
     A          R UNITAKMR                  PFILE(UNITAKM)
     A          K UNBILN
     A          K UNSAVD
