     A          R V12FNFR
     A            FNFN          10A         COLHDG('FILNAVN')
     A            FNTXT         50A         COLHDG('FILBESKRIVELSE')
     A            FNDRIF         1A         COLHDG('DRIFT')
     A            FNHIST         1A         COLHDG('HISTORIKK')
     A            FNSAD          1A         COLHDG('SAD')
     A            FNPGM         10A         COLHDG('PROGRAM')
     A            FNKNV          1A         COLHDG('KONV. DRIFT')
     A            FNST           1A         COLHDG('STATUS DRIFT')
     A            FNHST          1A         COLHDG('STATUS HIST.')
     A            FNHKNV         1A         COLHDG('KONV. HIST.')
     A          K FNFN
