********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12001 * 02 YBC PTF12 NYTT FELT FOR MVA-REGISTRTERT
********************************************************************
     A          R VISKULOGR
     A            FIRMA          2A         COLHDG('FIRMCODE')
     A            LEVNR          8S 0       COLHDG('CUST.NO')
     A            LNAVN         30A         COLHDG('NAME')
VIS  A            STATUS         2          COLHDG('STATUS')
VIS  A            SYNCDA         8S 0       COLHDG('SYNC. DATO')
VIS  A            SYNCTM         6S 0       COLHDG('SYNC. TID')
VIS  A            SYERRO       800A         COLHDG('ERROR TEKST')
     A          K FIRMA
     A          K LEVNR
