     A          R VISPNRR
VIS  A            VILK           2          COLHDG('LAND')
VIS  A            VIPONR         9          COLHDG('POSTNR')
VIS  A            VIREGI        20          COLHDG('REGION')
VIS  A            VILKNA        30          COLHDG('STEDSNAVN')
VIS  A          K VILK
VIS  A          K VIPONR
