********************************************************************
      * VISMA TRANSAKSJONSLOGG FAKTURAPOSTERINGER
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
     A          R VISTRLOGKR
     A            FIRMA          2A         COLHDG('FIRMCODE')
     A            BILNR          7S 0       COLHDG('FAKTURANR')
     A            BILAAR         4S 0       COLHDG('AAR')
     A            BILMND         4S 0       COLHDG('MND')
     A            BILDAG         4S 0       COLHDG('DAG')
VIS  A            STATUS         2          COLHDG('STATUS')
VIS  A            SYNCDA         8S 0       COLHDG('SYNC. DATO')
VIS  A            SYNCTM         6S 0       COLHDG('SYNC. TID')
VIS  A            SYERRO       800A         COLHDG('ERROR TEKST')
     A          K FIRMA
     A          K BILNR
     A          K BILAAR
     A          K BILMND
     A          K BILDAG
