     A                                      REF(L1FRF)
     A          R VISTRAFAKR
     A            AKTKOD    R
     A            FIRMA     R
     A            BILNR     R
     A            POSNR     R
     A            BILAAR    R
     A            BILMND    R
     A            BILDAG    R
     A            PERAAR    R
     A            PERNR     R
     A            VALKOD    R
     A            VALKU1    R
     A            TYPE      R
     A            BILKOD    R
     A            BILTXT    R
     A            RESNR     R
     A            KONTO     R
     A            KSTED     R
     A            KBARER    R
     A            NIV1PO    R               REFFLD(NIV1)
     A            NIV2PO    R               REFFLD(NIV2)
     A            MOMSK     R
     A            BBELOP    R
     A            VALKOX    R
     A            BELOPV    R
     A            ANT       R
     A            ENHET     R
     A            PROSNR    R
     A            REFNR     R
     A            KRNR      R
     A            KRDAAR    R
     A            KRDMND    R
     A            KRDDAG    R
     A            FFDAAR    R
     A            FFDMND    R
     A            FFDDAG    R
     A            BETBET    R
     A            ATTEST    R
     A            KRYSS     R
     A            OPDKOD    R
     A            RECNR     R
     A            BILNRE    R
     A            NOKKEL    R
     A            AGIO      R
     A            DELKOD    R
     A            LKID      R
     A            FKUND     R
     A            GRKODE    R
     A            PRGRUP    R
     A            OPDMVA    R
     A            INTKOD    R
     A            KRNRDB    R
     A            POSLNR    R
     A            KRNOKD    R
     A            KAARPO    R
     A            KMNDPO    R
     A            KDAGPO    R
     A            NBELPO    R
     A            MVABPO    R
     A            INVBPO    R
     A            BAARPO    R
     A            BMNDPO    R
     A            BDAGPO    R
     A            BONSPO    R
     A            KONBPO    R
     A            STEBPO    R
     A            BARBPO    R
     A            NIB1PO    R               REFFLD(NIV1)
     A                                      TEXT('Rapp.nivå 1 bonus')
     A            NIB2PO    R               REFFLD(NIV2)
     A                                      TEXT('Rapp.nivå 2 bonus')
     A            GRKOPO    R               REFFLD(GRKOTQ)
     A            FREFPO    R               REFFLD(FREFKH)
     A            OPKDPO    R               REFFLD(OPKDFA)
     A            ANIDPO    R               REFFLD(ANIDNR)
N24  A            ANTTPO    R               REFFLD(ANTTYP)
N24P A            EUVEPO    R               REFFLD(EURVER)
N55   *****************************************************************
N55  A            FJDAPO    R               REFFLD(DATO8)
N55  A                                      COLHDG('Fakt.jour.' 'dato')
N55  A            FJNRPO    R               REFFLD(FJNRFS)
N55  A            LJDAPO    R               REFFLD(DATO8)
N55  A                                      COLHDG('Lagerjour.' 'dato')
N55  A            LJNRPO    R               REFFLD(FJNRFS)
N55  A                                      COLHDG('Lagerjour.' 'nr.')
N611  *****************************************************************
N611 A            SNRMPO    R               REFFLD(SUTSK)
N611 A                                      TEXT('Summeringsnr. mva.')
N611 A                                      COLHDG('Sum.nr.' 'mva')
N611 A            MGUTPO    R               REFFLD(BBELOP)
N611 A                                      TEXT('Mva. grunnlag')
N611 A                                      COLHDG('Mva.' 'grunnlag')
N611 A            STARPO    R               REFFLD(AR4)
N611 A                                      TEXT('Startår')
N611 A                                      COLHDG('Start' 'år')
N611 A            STPEPO    R               REFFLD(PERNR)
N611 A                                      TEXT('Startperiode')
N611 A                                      COLHDG('Start' 'per.')
N611 A            INKDPO    R               REFFLD(PURRE)
N611 A                                      TEXT('Intervall kode')
N611 A                                      COLHDG('Int' 'kode')
N611 A            ANTPPO    R               REFFLD(PERNR)
N611 A                                      TEXT('Ant. perioder')
N611 A                                      COLHDG('Ant.' 'per.')
N611 A            PKTOPO    R               REFFLD(KONTO)
N611 A                                      TEXT('Periodiseringskonto')
N611 A                                      COLHDG('Per.' 'konto')
N611 A            BLKPPO    R               REFFLD(BILKOD)
N611 A                                      TEXT('Bilagskode periodisering')
N611 A                                      COLHDG('Bil.' 'kode p.')
N611 A          K BILNR
N611 A          K TYPE
