     A          R WRKINVR
     A            WRKSPCN       10
     A            WRKAVD         4S 0
     A            WRKTDN         7S 0
     A            WRKSIF        17
     A          K WRKSPCN
     A          K WRKAVD
     A          K WRKTDN
