     A          R WRKR31FR
     A            WRKSPCN       10
     A            WRKAVD         4S 0
     A            WRKTDN         7S 0
     A            WRKR31        30
     A          K WRKSPCN
     A          K WRKAVD
     A          K WRKR31
