********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 LENGDE PÅ BANKKONTO ER UTVIDET TIL 25 LANG
********************************************************************
     A          R XMLU2FR
     A            XFFIRM         2          COLHDG('FIRMA')
     A            XFTYPE         5          COLHDG('TYPE')
     A            XFFN           7S 0       COLHDG('FAKTURANR')
     A            XFANTL         5S 0       COLHDG('ANTAL FAKTURALINJER')
     A            XFFK           1A         COLHDG('FAKTURA/KREDITNOTA')
     A            XFKN           8S 0       COLHDG('KUNDENR')
     A            XFAVD          4S 0       COLHDG('AVDELING')
     A            XFST           1A         COLHDG('STATUS')
     A            XFSAML         1A         COLHDG('SAMLEFAKTURA')
     A            XFDTS          8S 0       COLHDG('SENDINGSDATO')
     A            XFTDS          6S 0       COLHDG('SENDINGSTID')
     A            XFBB           2A         COLHDG('BETALINGSBET.')
     A            XFBBT         30A         COLHDG('BETALINGSBET. TEKST')
S01  A*           XFKT          11A         COLHDG('BANKKONTO')
N01  A            XFKT          25A         COLHDG('BANKKONTO')
     A            XFKID         21A         COLHDG('KIDNR')
     A            XFVAL          3A         COLHDG('VALUTAKODE')
     A            XFTOT         13S 2       COLHDG('TOTAL MED MVA')
     A            XFMS01         4S 2       COLHDG('MVA SATS 01')
     A            XFMS02         4S 2       COLHDG('MVA SATS 02')
     A            XFMS03         4S 2       COLHDG('MVA SATS 03')
     A            XFMS04         4S 2       COLHDG('MVA SATS 04')
     A            XFMS05         4S 2       COLHDG('MVA SATS 05')
     A            XFMS06         4S 2       COLHDG('MVA SATS 06')
     A            XFMS07         4S 2       COLHDG('MVA SATS 07')
     A            XFMS08         4S 2       COLHDG('MVA SATS 08')
     A            XFMS09         4S 2       COLHDG('MVA SATS 09')
     A            XFMS10         4S 2       COLHDG('MVA SATS 10')
     A            XFMS11         4S 2       COLHDG('MVA SATS 11')
     A            XFMV01         3A         COLHDG('MVA VAL 01')
     A            XFMV02         3A         COLHDG('MVA VAL 02')
     A            XFMV03         3A         COLHDG('MVA VAL 03')
     A            XFMV04         3A         COLHDG('MVA VAL 04')
     A            XFMV05         3A         COLHDG('MVA VAL 05')
     A            XFMV06         3A         COLHDG('MVA VAL 06')
     A            XFMV07         3A         COLHDG('MVA VAL 07')
     A            XFMV08         3A         COLHDG('MVA VAL 08')
     A            XFMV09         3A         COLHDG('MVA VAL 09')
     A            XFMV10         3A         COLHDG('MVA VAL 10')
     A            XFMV11         3A         COLHDG('MVA VAL 11')
     A            XFMGN1        13S 2       COLHDG('MVA GRUNNLAG 01')
     A            XFMGN2        13S 2       COLHDG('MVA GRUNNLAG 02')
     A            XFMGN3        13S 2       COLHDG('MVA GRUNNLAG 03')
     A            XFMGN4        13S 2       COLHDG('MVA GRUNNLAG 04')
     A            XFMGN5        13S 2       COLHDG('MVA GRUNNLAG 05')
     A            XFMGN6        13S 2       COLHDG('MVA GRUNNLAG 06')
     A            XFMGN7        13S 2       COLHDG('MVA GRUNNLAG 07')
     A            XFMGN8        13S 2       COLHDG('MVA GRUNNLAG 08')
     A            XFMGN9        13S 2       COLHDG('MVA GRUNNLAG 09')
     A            XFMGNA        13S 2       COLHDG('MVA GRUNNLAG 10')
     A            XFMGNB        13S 2       COLHDG('MVA GRUNNLAG 11')
     A            XFMGV1        13S 2       COLHDG('MVA GRUNNLAG 01')
     A            XFMGV2        13S 2       COLHDG('MVA GRUNNLAG 02')
     A            XFMGV3        13S 2       COLHDG('MVA GRUNNLAG 03')
     A            XFMGV4        13S 2       COLHDG('MVA GRUNNLAG 04')
     A            XFMGV5        13S 2       COLHDG('MVA GRUNNLAG 05')
     A            XFMGV6        13S 2       COLHDG('MVA GRUNNLAG 06')
     A            XFMGV7        13S 2       COLHDG('MVA GRUNNLAG 07')
     A            XFMGV8        13S 2       COLHDG('MVA GRUNNLAG 08')
     A            XFMGV9        13S 2       COLHDG('MVA GRUNNLAG 09')
     A            XFMGVA        13S 2       COLHDG('MVA GRUNNLAG 10')
     A            XFMGVB        13S 2       COLHDG('MVA GRUNNLAG 11')
