      *_____________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R NCTSEIR
     A            TI01           1          COLHDG('IKKE I BRUK')
     A            TIAVD     R               REFFLD(AVD)
     A            TITDN     R               REFFLD(TDN)
     A            TILI      R               REFFLD(LI5)
     A                                      COLHDG('HOUSE CONSIGNMENT NR')
     A            TILI2     R               REFFLD(LI5)
     A                                      COLHDG('LINJENR I HOUSE')
     A            TILIT     R               REFFLD(LI5)
     A                                      COLHDG('LINJENR FOR ALLE')
      *
     A            TIAVD2    R               REFFLD(AVD)
     A                                      COLHDG('AVD. FOR HENTET OPD')
     A            TITDN2    R               REFFLD(TDN)
     A                                      COLHDG('OPD. FOR HENTET OPD')
     A            TIXEXT        35          COLHDG('EKSTERN REF')
      *
     A            TIDK           5A         COLHDG('DEKLARASJONSTYPE')
     A            TIALK          2A         COLHDG('AVSENDERSLAND')
     A            TIBLK          2A         COLHDG('BESTEMMELSESLAND')
     A            TIUCR         35A         COLHDG('REF.NR UCR')
      * ADDITIONAL SUPPLY CHAIN ACTOR
     A            TILROL         3A         COLHDG('LEVERANDØR ROLLE')
     A            TILID         17A         COLHDG('LEVERANDØR ID')
      * COMMODITY
     A            TICTX        120A         COLHDG('TEKST')
     A            TICCUS         9A         COLHDG('CUS CODE')
      *  COMMODITY CODE
     A            TICCH          6S 0       COLHDG('HARMONIZED SYS. CODE')
     A            TICCCD         2A         COLHDG('COMBINED NOMENCLATUR')
      *  DANGEROUS GOODS
     A            TIUNNR         4A         COLHDG('UN NUMMER')
      *  GOODS MEASURE
     A            TIVKB         13S 3       COLHDG('BRUTTOVEKT')
     A            TIVKN         13S 3       COLHDG('NETTOVEKT')
     A            TINTS         13S 3       COLHDG('SUPPLEMENTARY UNITS')
      * PACKING
     A            TIPTY          2A         COLHDG('PAKK TYPE')
     A            TIPNT          8S 0       COLHDG('ANTALL PAKKER')
     A            TIPMRK       120A         COLHDG('MERKE & NR')
     A            TIPTY2         2A         COLHDG('PAKK TYPE')
     A            TIPNT2         8S 0       COLHDG('ANTALL PAKKER')
     A            TIPMRK2      120A         COLHDG('MERKE & NR')
     A            TIPTY3         2A         COLHDG('PAKK TYPE')
     A            TIPNT3         8S 0       COLHDG('ANTALL PAKKER')
     A            TIPMRK3      120A         COLHDG('MERKE & NR')
     A            TIPTY4         2A         COLHDG('PAKK TYPE')
     A            TIPNT4         8S 0       COLHDG('ANTALL PAKKER')
     A            TIPMRK4      120A         COLHDG('MERKE & NR')
     A            TIPTY5         2A         COLHDG('PAKK TYPE')
     A            TIPNT5         8S 0       COLHDG('ANTALL PAKKER')
     A            TIPMRK5      120A         COLHDG('MERKE & NR')
      * TRANSPORT EQUIPMENT
     A            TICNR         17A         COLHDG('CONTAINE')
      *   SEAL
     A            TIDFKD        20A         COLHDG('FORSEGLING-ID KODE')
      * PREVIOUS DOCUMENT
     A            TIPDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TIPDRF        70A         COLHDG('DOKUMENT REF.')
     A            TIPDGN         5S 0       COLHDG('GOODS ITEM NO')
     A            TIPDTP         2A         COLHDG('PAKKTYPE')
     A            TIPDAN         8S 0       COLHDG('ANTALL PAKKER')
     A            TIPDUN         4A         COLHDG('DOKUMENT TYPE')
     A            TIPDPC        16S 6       COLHDG('QUANTITY')
     A            TIPDIN        35A         COLHDG('INFORMASJON')
     A            TIPDTY2        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDRF2       70A         COLHDG('DOKUMENT REF.')
     A            TIPDGN2        5S 0       COLHDG('GOODS ITEM NO')
     A            TIPDTP2        2A         COLHDG('PAKKTYPE')
     A            TIPDAN2        8S 0       COLHDG('ANTALL PAKKER')
     A            TIPDUN2        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDPC2       16S 6       COLHDG('QUANTITY')
     A            TIPDIN2       35A         COLHDG('INFORMASJON')
     A            TIPDTY3        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDRF3       70A         COLHDG('DOKUMENT REF.')
     A            TIPDGN3        5S 0       COLHDG('GOODS ITEM NO')
     A            TIPDTP3        2A         COLHDG('PAKKTYPE')
     A            TIPDAN3        8S 0       COLHDG('ANTALL PAKKER')
     A            TIPDUN3        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDPC3       16S 6       COLHDG('QUANTITY')
     A            TIPDIN3       35A         COLHDG('INFORMASJON')
     A            TIPDTY4        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDRF4       70A         COLHDG('DOKUMENT REF.')
     A            TIPDGN4        5S 0       COLHDG('GOODS ITEM NO')
     A            TIPDTP4        2A         COLHDG('PAKKTYPE')
     A            TIPDAN4        8S 0       COLHDG('ANTALL PAKKER')
     A            TIPDUN4        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDPC4       16S 6       COLHDG('QUANTITY')
     A            TIPDIN4       35A         COLHDG('INFORMASJON')
     A            TIPDTY5        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDRF5       70A         COLHDG('DOKUMENT REF.')
     A            TIPDGN5        5S 0       COLHDG('GOODS ITEM NO')
     A            TIPDTP5        2A         COLHDG('PAKKTYPE')
     A            TIPDAN5        8S 0       COLHDG('ANTALL PAKKER')
     A            TIPDUN5        4A         COLHDG('DOKUMENT TYPE')
     A            TIPDPC5       16S 6       COLHDG('QUANTITY')
     A            TIPDIN5       35A         COLHDG('INFORMASJON')
      * SUPPORTING DOCUMENT
     A            TISDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TISDRF        70A         COLHDG('DOKUMENT REF.')
     A            TISDLN         5S 0       COLHDG('LINE ITEM NUMBER')
     A            TISDIN        35A         COLHDG('INFORMASJON')
      * TRANSPORT DOCUMENT
     A            TITDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TITDRF        70A         COLHDG('DOKUMENT REF.')
      * ADDITIONAL REFERENCE
     A            TIADTY         4A         COLHDG('REFERENSE TYPE')
     A            TIADRF        70A         COLHDG('REFERANSE')
      * ADDITIONAL INFORMATION
     A            TIAICD         5A         COLHDG('INFORMASJON KODE')
     A            TIAITX       120A         COLHDG('TEKST')
      * TRANSPORT CHARGE
     A            TITRCH         1A         COLHDG('BETALINGSMÅTE')
      *
     A            TIUNIK         9  0       COLHDG('RECORDNR')
     A            TIREFF        17          COLHDG('REFERANSE')
