      *__________________________________
      * SYSPED / Tolldekl. TRANSITT, CONSIGNMENT
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R NCTSECR
     A            TC01           1          COLHDG('IKKE I BRUK')
     A            TCAVD     R               REFFLD(AVD)
     A            TCTDN     R               REFFLD(TDN)
     A            TCLI      R               REFFLD(LI5)
     A            TCLN      R               REFFLD(LI5)
     A                                      COLHDG('UTGÅENDE LINJENR')
     A            TCDK           5A         COLHDG('DEKLARASJONSTYPE')
     A            TCALK          2A         COLHDG('AVSENDERSLAND')
     A            TCBLK          2A         COLHDG('BESTEMMELSESLAND')
     A            TCVKTB        13S 3       COLHDG('Vekt Brutto')
     A            TCUCR         35A         COLHDG('REF.NR UCR')
      *
     A            TCAVD2    R               REFFLD(AVD)
     A                                      COLHDG('AVD. FOR HENTET OPD')
     A            TCTDN2    R               REFFLD(TDN)
     A                                      COLHDG('OPD. FOR HENTET OPD')
     A            TCXEXT        35          COLHDG('EKSTERN REF')
      * ADDITIONAL SUPPLY CHAIN ACTOR
     A            TCLROL         3A         COLHDG('LEVERANDØR ROLLE')
     A            TCLID         17A         COLHDG('LEVERANDØR ID')
      * DEPARTURE TRANSPORT MEANS
     A            TCTATY         2S 0       COLHDG('TYPE IDENTIFIKASJON')
     A            TCTAID        35A         COLHDG('IDENTITET')
     A            TCTALK    R               REFFLD(LKA)
     A                                      COLHDG('Landk Tr.middel')
      * PREVIOUS DOCUMENT
     A            TCPDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TCPDRF        70A         COLHDG('DOKUMENT REF.')
     A            TCPDIN        35A         COLHDG('INFORMASJON')
      * SUPPORTING DOCUMENT
     A            TCSDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TCSDRF        70A         COLHDG('DOKUMENT REF.')
     A            TCSDLN         5S 0       COLHDG('LINE ITEM NUMBER')
     A            TCSDIN        35A         COLHDG('INFORMASJON')
      * TRANSPORT DOCUMENT
     A            TCTDTY         4A         COLHDG('DOKUMENT TYPE')
     A            TCTDRF        70A         COLHDG('DOKUMENT REF.')
      * ADDITIONAL REFERENCE
     A            TCARTY         4A         COLHDG('REFERENSE TYPE')
     A            TCARRF        70A         COLHDG('REFERANSE')
      * ADDITIONAL INFORMATION
     A            TCAICD         5A         COLHDG('INFORMASJON KODE')
     A            TCAITX       120A         COLHDG('TEKST')
      * TRANSPORT CHARGE
     A            TCTRCH         1A         COLHDG('BETALINGSMÅTE')
      *
     A            TCUNIK         9  0       COLHDG('RECORDNR')
     A            TCREFF        17          COLHDG('REFERANSE')
