      * KEY PARALLELL TIL DOKUFM
     A          R DOKUFMR                   PFILE(ZOKUFM)
     A          K FMUNIK
     A          K FMFBNR
     A          K FMLINR
     A          K FMMKNR
     A          K FMLONR
