      * KEY PARALLELL TIL DOKUFV
     A          R DOKUFVR                   PFILE(ZOKUFV)
     A          K FVUNIK
     A          K FVFBNR
     A          K FVLINR
