      * KEY PARALLELL TIL DOKUFVF
     A          R DOKUFVFR                  PFILE(ZOKUFVF)
     A          K FFUNIK
     A          K FFFBNR
     A          K FFLINR
     A          K FFLIN2
