             PGM
             DCL        VAR(&ARBAN0) TYPE(*CHAR) LEN(30)
             DCL        VAR(&MOVE) TYPE(*CHAR) LEN(1) VALUE('M')
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRMARC) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
/*                                     */
/* BYGG MAPPE HVIS IKKE FINNES FRA FØR */
/*                                     */
/*S01        CHGVAR     VAR(&ARBAN0) VALUE(&ARCANE *TCAT '/del')  */
/*N01*/      CHGVAR     VAR(&ARBAN0) VALUE('/' *TCAT &ARCANE *TCAT '/del')
             MD         DIR(&ARBAN0) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
/*                                     */
/* tømmer workfiler                    */
/*                                     */
/*                                     */
/* WRKIVP innholder alle filer i IFS   */
/*                                     */
             CLRPFM     FILE(WRKIVP)
             MONMSG     MSGID(CPF0000)
/*                                     */
/* WRKIVP2 innholder flyttede til /del */
/*         ikke tømm                   */
/*           CLRPFM     FILE(WRKIVP2)  */
             CALL       PGM(ARC051R)
             CALL       PGM(ARC052R) PARM(&MOVE)
             ENDPGM
