/* *********************************************************************   */
/*       * VISE ARKIVERINGSLOGG                                            */
/* ********************************************************************    */
             PGM        PARM(&AVD &OPD)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVJOBA    NBR(&NBR)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &NBR)
             ADDPFM     FILE(&LIB/ARKSRC) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(&LIB/ARKSRC) MBR(&UNIK)
             OVRDBF     FILE(ARKSRC) TOFILE(&LIB/ARKSRC) MBR(&UNIK) +
                          FRCRATIO(1) OVRSCOPE(*JOB)
             CALL       PGM(ARC012) PARM(&AVD &OPD)
    /* */
             DLTOVR     FILE(*ALL) LVL(*JOB)
             ENDPGM
