/* N01  CVP TIL 80 TEGN     + 4 NYE                         */
/* N01  CVP1 RETTET TIL  0 TEGN   DERFOR ENDRING I UDS OGSÅ */
/* N06  KOPIER TILBAKE I WORKFILE                           */
             PGM        PARM(&EPOST &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8 &CVP9 &CVP10 &CVP11 +
                          &CVP12 &IE &AV &OP &TU &KU &MRG)
             DCL        VAR(&MRG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AV) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OP) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&KU) TYPE(*CHAR) LEN(8)
/* S02       DCL        VAR(&PARM) TYPE(*CHAR) LEN(431)  */
/*S03        DCL        VAR(&PARM) TYPE(*CHAR) LEN(458)  */
/*N03*/      DCL        VAR(&PARM) TYPE(*CHAR) LEN(1059)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
/*E01*/      DCL        VAR(&CVP1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP10) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP11) TYPE(*CHAR) LEN(80)
             DCL        VAR(&CVP12) TYPE(*CHAR) LEN(80)
             DCL        VAR(&IE) TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(&PARM) VALUE(&EPOST *CAT &CVP1 *CAT +
                          &CVP2 *CAT &CVP3 *CAT &CVP4 *CAT &CVP5 +
                          *CAT &CVP6 *CAT &CVP7 *CAT &CVP8 *CAT +
                          &CVP9 *CAT &CVP10 *CAT &CVP11 *CAT &CVP12 +
                          *CAT &IE *CAT &AV *CAT &OP *CAT &TU *CAT +
                          &KU *CAT &MRG)
/*                      */
             CALL PGM(ARC005CLJ) PARM(&PARM)
/*                      */
             CHGJOB     CCSID(65535)
/*N06*/      CPYF       FROMFILE(WRKEPOW) TOFILE(ARKEPOW) MBROPT(*ADD)
             ENDPGM
