/*E01 - NAVNELENGDE PÅ FOLDER ENDRET TIL 60 */
             PGM        PARM(&FLD)
             DCL        VAR(&FLD) TYPE(*CHAR) LEN(60)
             CRTDIR     DIR(&FLD) DTAAUT(*RWX) OBJAUT(*ALL)
/*N01*/      MONMSG     MSGID(CPF0000)
             ENDPGM
