/**************************************************************************/
/*   KOPIERER OBJEKT  (BASRT PÅ ARCAMOVC..)                              */
/**************************************************************************/
/*                                                                        */
/* OBS! FØR KOMPILERING: CRTPF FILE(QTEMP/XIFSAUT) RCDLEN(132) AUT(*ALL)  */
/*                                                                        */
             PGM        PARM(&TRNR)
             DCL        VAR(&TRNR) TYPE(*CHAR) LEN(8)
             OVRDBF     FILE(ARKIVL04W) TOFILE(ARKIVL04)
             CALL       PGM(ARC003T) PARM(&TRNR)
             ENDPGM
