/* EN GANG PR DØGN - OVERFØRE DE SOM IKKE BLE OVERFØRT SISTE DØGN */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) /* +
                          Directory/mappe som leses inn */
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) /* Program som +
                          skal behandle vellykket lest fil */
/* HARKODET I SYENDXXX   */
/* KUNNE VÆRE LAGET SOM GENERELST PROGRAM / DERSOM VERDIER FIRMGOOG=XXXX */
/* MEN IGANGSETTING AV DETTE MÅ VENTE TIL HOVED-OPPRYDDING ER GJORT */
             CHGVAR     VAR(&DIR) VALUE('/PDF/ARC')
             CHGVAR     VAR(&PGM) VALUE('ARC99WSU1N')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
/* IKKE LOOP - KUN EN GJENOMKJØRING FOR Å RYDDE SISTE DØGN */
             ENDPGM
