/**************************************************************************/
/*   KOPIERER OBJEKT TIL ENDELIG MAPPE (ARKIV SKANN MM)                   */
/**************************************************************************/
             PGM   PARM(&FRA &TIL &OK)
             DCL        VAR(&FRA) TYPE(*CHAR) LEN(120)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(120)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)
             CPY        OBJ(&FRA) TOOBJ(&TIL) TOCCSID(277)
             MONMSG     MSGID(CPF0000)
             ENDPGM
