/* LABELSKRIVER ENDRET TIL KODE 114 */
/*N01 V11 - SIKRE AT LABEL FILOVERTYRING OVERTYRER TIDLIGER (SYOP..) ...*/
             PGM        PARM(&TY)
             DCL        VAR(&TY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&IN01) TYPE(*CHAR) LEN(1) VALUE('0')

             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
             CALL       PGM(ARCA000RD) PARM(&TY)


 SLUTT:      ENDPGM
