             PGM
             DCL        VAR(&BATCH) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(ARCHST01) PARM(&BATCH &AAR)
             ENDPGM
