             PGM        PARM(&WAVDA &WFILE)
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&WAVDA) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WFILE) TYPE(*CHAR) LEN(26)
             DCL        VAR(&RMTSYS) TYPE(*CHAR) LEN(64)
             DLYJOB     DLY(15)
             /*_____________________________________________*/
             /* Generere fil for tcpip kommandoer og output */
             /*"""""""""""""""""""""""""""""""""""""""""""""*/
             CLRPFM     FILE(DKE031FR)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(DKE031FS)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(DKE031R) PARM(&WAVDA &WFILE &RMTSYS)
             /*_______________*/
             /* Send over fil */
             /*"""""""""""""""*/
             OVRDBF     FILE(INPUT) TOFILE(DKE031FS)
             OVRDBF     FILE(OUTPUT) TOFILE(DKE031FR)
             STRTCPFTP  RMTSYS(&RMTSYS)
             ENDPGM
