             PGM        PARM(&FILE &LIB &COLHDG)
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&COLHDG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CRT) TYPE(*CHAR) LEN(13)
             DCL        VAR(&CHG) TYPE(*CHAR) LEN(13)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             RTVOBJD    OBJ(&LIB/&FILE) OBJTYPE(*FILE) TEXT(&TXT) +
                          CRTDATE(&CRT) CHGDATE(&CHG)
 /*___________________*/
 /* Slette gammel fil */
 /*"""""""""""""""""""*/
             DLTF       FILE(DSPFFDF)
             MONMSG     MSGID(CPF0000)
 /*______________________*/
 /* Hente filbeskrivelse */
 /*""""""""""""""""""""""*/
             DSPFFD     FILE(&LIB/&FILE) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/DSPFFDF)
 /*______________________*/
 /* Skriv ut beskrivelse */
 /*""""""""""""""""""""""*/
             OVRPRTF    FILE(DSPFFDP) PAGESIZE(72 80) LPI(6) CPI(10) +
                          OVRFLW(62) OUTQ(EPOSTDIR) HOLD(*NO)
             CALL       PGM(DSPFFDR) PARM(&TXT &CRT &CHG &COLHDG)
             ENDPGM
