             PGM        PARM(&FIL &OK)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(100)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&OK) VALUE('J')
             DSPLNK     OBJ(&FIL) OUTPUT(*PRINT) OBJTYPE(*STMF) +
                          DETAIL(*NAME) DSPOPT(*USER)
             MONMSG     MSGID(CPFA0A9) EXEC(CHGVAR VAR(&OK) VALUE('N'))

             ENDPGM
