             PGM        PARM(&FIL)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(256)
             DCL        VAR(&FILTMP) TYPE(*CHAR) LEN(256)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(500)
             CHGVAR     VAR(&CMD) VALUE(DDD)
             qsh cmd('tr -d "\r\n" < &fil> &filtmp')

             ENDPGM
