             PGM        PARM(&EMNE &MSG)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(256)
/*S01        DCL        VAR(&EP) TYPE(*CHAR) LEN(70) +
                          VALUE('BING@SYSTEMA.NO')      */
/*N01*/      DCL        VAR(&EP) TYPE(*CHAR) LEN(70) +
                          VALUE('helpdesk@systema.no')

             SNDDST     TYPE(*LMSG) TOINTNET((&EP)) DSTD(&EMNE) +
                          LONGMSG(&MSG) USRID(*CURRENT) SNDFMT(*NOCHG)
             MONMSG     MSGID(CPF0000)

             ENDPGM
