/*N01 LASER-LABEL           */
             PGM        PARM(&USR &FI &POREF &LIN &ULIN &LTYP &KOP +
                          &LAY &UNIK)
             DCL        VAR(&SPL) TYPE(*CHAR) LEN(10) +
                          VALUE('EPOMS04DP')
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&LTYP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LAY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&POREF) TYPE(*CHAR) LEN(18)
             DCL        VAR(&LIN) TYPE(*CHAR) LEN(7)
             DCL        VAR(&ULIN) TYPE(*CHAR) LEN(5)
             DCL        VAR(&KN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&BES) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TMP196) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TMP196M) TYPE(*CHAR) LEN(50)
             DCL        VAR(&KOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             CHGVAR     VAR(&TMP196) VALUE('TMP' *CAT &UNIK)
             CHGVAR     VAR(&TMP196M) VALUE('/QSYS.LIB/QTEMP.LIB/' +
                          *CAT &TMP196 *CAT '.FILE/' *CAT &TMP196 +
                          *CAT '.MBR')
             IF         COND(&LAY = '  ') THEN(CHGVAR VAR(&LAY) +
                          VALUE('WW'))

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             CHGVAR     VAR(&KN) VALUE(%SUBSTRING(&POREF 1 8))
             CHGVAR     VAR(&BES) VALUE(%SUBSTRING(&POREF 9 10))

 /*LEGG INN START-HTML*/
             CHGVAR     VAR(&STMF) VALUE('/syspeddev/temp/LASLAB' +
                          *TCAT &POREF *TCAT '.pdf')
             RMVLNK     OBJLNK(&STMF)
             MONMSG     MSGID(CPF0000)
             OVRPRTF    FILE(EPOMS04DP) PAGESIZE(70 80) LPI(8) +
                          CPI(10) OVRFLW(70) OUTQ(SYCGIOUTQ) +
                          DEVTYPE(*AFPDS) +
                          FORMTYPE(*STD) SPLFOWN(*JOB) +
                          TOSTMF(&STMF) WSCST(*PDF)
             CALL       PGM(EPOMS04D) PARM(&USR &FI &LAY &KN &BES +
                          &LIN &ULIN &KOP)

             ENDPGM
