             PGM        PARM(&QNBR &QUSER &QJOB &SPLF &NBR &USERM)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&MAILTAG) TYPE(*CHAR) LEN(80)
             DCL        VAR(&NBR) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USERM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10)
/*                                     */
/* HENTER EPOSTADRESSE                 */
/*                                     */
             CALL       PGM(SYGE108CU) PARM(&USERM &EPOST)
             CHGVAR     VAR(&MAILTAG) VALUE('MAILTAG(' *TCAT +
                          &EPOST *TCAT ')')
/*                                     */
/* SETTER SPOLLFIL VERDIER             */
/*                                     */
             CHGSPLFA   FILE(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(&NBR) OUTQ(EPOSTSND) +
                          USRDFNDTA(&MAILTAG)
             MONMSG     MSGID(CPF0000)
             ENDPGM
