/* SENDE FRAKTBREV PÅ EMAIL  BASERT PÅ ZEADF    */
/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/*       * 01 JOV PTV11 bruk TOSTMF('xxx') WSCST(*PDF) for PDF-konvertering*/
/*       *              RYDDET GA MELT TJAFS                               */
/*       * 02 sh  ptf12 MER UNIK FILNAVN I STMF (som i SYFA12CES)          */
/*       *              &ts ER IKKE UNIK NO VED DOBELT-KLIKK               */
/* ********************************************************************    */
             PGM        PARM(&UUUNIK &STMF &TOLLP)
/*N02*/      DCL        VAR(&TELL) TYPE(*CHAR) LEN(8) +
                          VALUE('WEBUNIK')
/*N02*/      DCL        VAR(&UN) TYPE(*DEC) LEN(7 0)
/*N02*/      DCL        VAR(&UA) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TOLLP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&UUUNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMFTMP) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
 /*S02       DCL        VAR(&TS) TYPE(*CHAR) LEN(9)  */

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
 /*S02       RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&TS)     */

    /* OVERRIDE PRINTERFILE/SKRIV-FR.BEV  */
    /*                                     */
    /* HENTER NESTE UNIKE NUMMER          */
    /*                                     */
 /*N02*/     CALL       PGM(SYGE49) PARM(&TELL &UN)
 /*N02*/     CHGVAR     VAR(&UA) VALUE(&UN)
 /*S02       CHGVAR     VAR(&STMFTMP) VALUE('/syspeddev/temp/CMR' +
                          *CAT &TS *CAT '.pdf')  */
 /*N02*/     CHGVAR     VAR(&STMFTMP) VALUE('/syspeddev/temp/' *CAT +
                          'FB' *CAT &UUUNIK *CAT &UA *CAT '.PDF') +

             RMVLNK     OBJLNK(&STMFTMP)
             MONMSG     MSGID(CPF0000)
             OVRPRTF    FILE(SYFA12P) DEVTYPE(*AFPDS) PAGESIZE(140 +
                          85) LPI(12) CPI(10) OVRFLW(140) +
                          FRONTMGN(0 0) +
                          FRONTOVL(FRAKTBRE 0.1) +
                          OUTQ(SYCGIOUTQ) FORMTYPE(*STD) SPLFOWN(*JOB) +
                          TOSTMF(&STMFTMP) WSCST(*PDF)

             CALL       PGM(SYFA12B) PARM(&UUUNIK &STMF &TOLLP)

             RMVLNK     OBJLNK(&STMF)
             MONMSG     MSGID(CPF0000)
             MOV        OBJ(&STMFTMP) TOOBJ(&STMF)
             MONMSG     MSGID(CPF0000)
    /* */
 SLUTT:      ENDPGM
