/*       * 01 sh  PTF12 aktivt bibliteksnavn på arksrc                     */
             PGM        PARM(&UNIK &EMNE &AVNA &AVAD &MONA &MOAD)
/*N01*/      DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UNIK)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&EMNE)   TYPE(*CHAR) LEN(70)
             DCL        VAR(&AVNA)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&AVAD)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&MONA)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&MOAD)   TYPE(*CHAR) LEN(50)

/*N01*/      RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&MOAD/&MONA/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)

             RMVLIBLE   LIB(MMAIL)

  /*&unik=W+jobnr - initieres første gang i ESTSTTC, tømmes her mellom hver */
             CLRPFM     FILE(ARKSRC) MBR(&UNIK)

             ENDPGM
