             PGM        PARM(&SIAVD &SIOPD)
             DCL        VAR(&SIAVD) TYPE(*DEC) LEN(4 0) VALUE(0)
             DCL        VAR(&SIOPD) TYPE(*DEC) LEN(7 0) VALUE(0)
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1) VALUE('0') /* +
                          Hvis &in01 på, betyr det avslutt program +
                          fra valgbilde. */
    /* */
    /* HENTE AVDELING, SIGNATUR OG FIRMAKODE */
             CALL       PGM(SYFA00) PARM(&IN01)
             IF         COND(&IN01 = '1') THEN(GOTO CMDLBL(SLUTT)) /* +
                          Hvis &IN01 på, avslutter program. */
    /* */
    /* */
    /* */
             CALL       PGM(FAX033A) PARM((&SIAVD) (&SIOPD))
    /* */
    /* */
 SLUTT:      ENDPGM
