/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 JOV PTF10 IKKE KOPIER SPOOLFIL VED TR014PF                   */
/* 10XXX * 01 SH  PTF11 TATT BORT CPYSPLF                                 */
/* ********************************************************************    */
/* ENDRET EPOSTSRC TIL Å LIGGE I QTEMPO */
             PGM        PARM(&QUSER &QNBR &QJOB &SPOOL &EPOST &EMNE +
                          &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 &CVP6 &CVP7 +
                          &CVP8 &PDF)
             DCL        VAR(&MANAUT) TYPE(*CHAR) LEN(1) VALUE('V')
             DCL        VAR(&RPLNA) TYPE(*CHAR) LEN(8) +
                          VALUE('*CURRENT')
             DCL        VAR(&RPLAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&UUUNIK) TYPE(*CHAR) LEN(9)
             DCL        VAR(&MELD1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&DIST) TYPE(*CHAR) LEN(1) /* DISTLISTE */
             DCL        VAR(&MELD1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD2) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD3) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD4) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD5) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD6) TYPE(*CHAR) LEN(256)
             DCL        VAR(&MELD) TYPE(*CHAR) LEN(1536)
             DCL        VAR(&DISTL) TYPE(*CHAR) LEN(6) /* DISTLISTE */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(11) /* Unikkode */
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(30)
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPOSTF) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EPO01) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO02) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO03) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO04) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO05) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO06) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO07) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO08) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO09) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO10) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO11) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO12) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO13) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO14) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO15) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO16) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO17) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO18) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO19) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EPO20) TYPE(*CHAR) LEN(50)
             DCL        VAR(&SPOOL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4)
             DCL        VAR(&TIL50) TYPE(*CHAR) LEN(50)
             DCL        VAR(&LOG50) TYPE(*CHAR) LEN(50)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE(QTEMP)
 RTVTIME:    RTVJOBA    NBR(&JOBN)
/*                      */
             CHGVAR     VAR(&RPLNA) VALUE(&QUSER)
             RTVNETA    SYSNAME(&RPLAD)
/*                      */
/* HENT REPLYADRESSE    */
/*                      */
/*                      */
             CALL       PGM(EPOS04) PARM(&QUSER &RPLNA &RPLAD &EPOSTF)
/*                      */
/*                      */
/* LEGGER UT COVERPAGE  */
/* I SOURCE             */
/*                      */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             ADDPFM     FILE(&LIB/EPOSTSRC) MBR(&QUSER)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(&LIB/EPOSTSRC) MBR(&QUSER)
             OVRDBF     FILE(EPOSTSRC) TOFILE(&LIB/EPOSTSRC) +
                          MBR(&QUSER)
/*           CHGVAR     VAR(&LOG50) VALUE(&EPOST)      */
             CALL       PGM(EPMM01) PARM(&CVP1 &CVP2 &CVP3 &CVP4 +
             &CVP5 &CVP6 &CVP7 &EMNE &EPOST &MANAUT &UUUNIK)
/* LAG SNDDST I QTEMP   */
/*                      */
             DLTF       FILE(QTEMP/SNDDST)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(EPOST80) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SNDDST)
/*                                     */
/* PRØVER Å LAGRE SPOOLFILE            */
/*                                     */
/*           IF         COND(((&SPOOL *NE 'SYEF44P') *AND (&SPOOL +
                          *NE 'SYEF14P')) *AND (&SPOOL *NE +
                          'TR014PF')) THEN(DO)    */
/*           CPYSPLF    FILE(&SPOOL) TOFILE(QTEMP/SNDDST) +      */
/*                        JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST)  */
/*                        MBROPT(*ADD) CTLCHAR(*NONE)            */
/*           MONMSG     MSGID(CPA0000 CPF0000)                   */
/*           ENDDO                                               */
/*           OVRDBF     FILE(EPOST80) TOFILE(QTEMP/SNDDST)       */
/*           CALL       PGM(EPMM02) PARM(&UUUNIK)                */
/*                                     */
/* UTEN DISTRIBUSJONSLISTE             */
/*                                     */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&DIST) VALUE(%SST(&EPOST 1 1))
             CHGVAR     VAR(&DISTL) VALUE(%SST(&EPOST 2 6))
             IF         COND(&DIST *NE '*') THEN(DO)
             CHGVAR     VAR(&TIL50) VALUE(&EPOST)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&TIL50/&TIL50/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             MONMSG     MSGID(CPF0000) EXEC(RETURN)
/*                      */
/*           DLTSPLF    FILE(&SPOOL) JOB(&QNBR/&QUSER/&QJOB)  */
/*           MONMSG     MSGID(CPF0000)   */
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                      */
/*                                       */
/*                                     */
/*  SENDING VED DISTRIBUSJONSLISTE     */
/*                                     */
             CALL       PGM(EPODIS) PARM(&DISTL &EPO01 &EPO02 &EPO03 +
                          &EPO04 &EPO05 &EPO06 &EPO07 &EPO08 &EPO09 +
                          &EPO10 &EPO11 &EPO12 &EPO13 &EPO14 &EPO15 +
                          &EPO16 &EPO17 &EPO18 &EPO19 &EPO20)
/*                                     */
/*  SENDING TIL 20  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO20 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO +
                          &EPO20/&EPO20/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 19  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO19 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO &EPO19/&EPO19/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 18  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO18 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO +
                          &EPO18/&EPO18/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 17  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO17 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO  +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO  +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO  +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO  +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO  +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO  +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO  +
                          &EPO16/&EPO16/*TO &EPO17/&EPO17/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 16  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO16 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO +
                          &EPO16/&EPO16/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 15  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO15 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO  +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO  +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO  +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO  +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO  +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO  +
                          &EPO14/&EPO14/*TO &EPO15/&EPO15/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 14  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO14 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO +
                          &EPO14/&EPO14/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 13  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO13 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO &EPO13/&EPO13/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 12  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO12 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO +
                          &EPO12/&EPO12/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 11  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO11 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO &EPO11/&EPO11/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 10  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO10 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO +
                          &EPO10/&EPO10/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 09  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO09 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO &EPO09/&EPO09/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 08  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO08 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO +
                          &EPO08/&EPO08/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 07  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO07 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO +
                          &EPO06/&EPO06/*TO &EPO07/&EPO07/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 06  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO06 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO  +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO  +
                          &EPO06/&EPO06/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 05  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO05 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO  +
                          &EPO04/&EPO04/*TO &EPO05/&EPO05/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 04  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO04 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO +
                          &EPO04/&EPO04/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 03  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO03 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO &EPO03/&EPO03/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 02  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO02 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO +
                          &EPO02/&EPO02/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
/*                                     */
/*  SENDING TIL 01  MOTTAGERE          */
/*                                     */
             IF         COND(&EPO01 *NE '*NONE                    ') +
                          THEN(DO)
             EMLSPL     SUBJECT(&EMNE) FROMNAME(&RPLNA) +
                          FROMADDR(&EPOSTF) TO(&EPO01/&EPO01/*TO) +
                          SPLF(&PDF/*LAST/&QNBR/&QUSER/&QJOB/&SPOOL) +
                          MSGM(&LIB/EPOSTSRC/&QUSER)
             RMVLIBLE   LIB(MMAIL)
             RETURN
             ENDDO
             RMVLIBLE   LIB(MMAIL)
             ENDPGM
/*                      */
