             PGM        PARM(&LIB)
             DCL        VAR(&LIB)  TYPE(*CHAR) LEN(10)
             IF         COND(&LIB = ' ') THEN(CHGVAR VAR(&LIB) +
                          VALUE('*LIBL'))
             DSPOBJD    OBJ(&LIB/*ALL) OBJTYPE(*QRYDFN) +
                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/XXQRY)

             RUNQRY     QRY(FINNQRY) ??OUTTYPE(*DISPLAY) RCDSLT(*YES)
  /* MELDING  */
             SNDPGMMSG  MSG('Hvis data ble sendt til fil er nå +
                          XXFINNQRY skapt (tips epost/11=send som +
                          mail)')
             ENDPGM
