 /* BRUK SOM HALVFABRIKATA HOS UTVALGTE KUNDER SOM BENYTTER NOPNR...      */
 /* Aldri snann om mer en EN fil, men.. behand via mappe=Navne-uavhengig..*/
 /*********************************************************************   */
 /* PTF 01 - PGA ØNSKE OM FÆRRE SHARE (OG I ALLE FALL IKKE /ROOT..        */
 /*          SÅ ER MAPPE ENDRET (NÅ PARALLELT MED LEVTID.)                */
             PGM
/*S01        DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/SYNOPNR')  */
/*N01*/      DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) +
                          VALUE('/SYSPEDFX/DIVCSV/NOPNR')
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('FIXNOPNRC2')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)
             ENDPGM
