             PGM        PARM(&AAR)
             DCL        VAR(&AAR) TYPE(*CHAR) LEN(4)
                                                          /**/
             CLRPFM     FILE(WRKK)
                                                          /**/
/*    HEADF                                                 */
             CALL       PGM(KUNWHED) PARM(&AAR)
/*    SADH                                                  */
             CALL       PGM(KUNWSDH) PARM(&AAR)
/*    SAEH                                                  */
             CALL       PGM(KUNWSEH) PARM(&AAR)
/*    KODTA                                                 */
             CALL       PGM(KUNWKTA)
/*    KODTFS                                                */
             CALL       PGM(KUNWKFS)
/*    SAMLA                                                 */
             CALL       PGM(KUNWSAM) PARM(&AAR)
/*    TRAN                                                  */
             CALL       PGM(KUNWTRA)
                                                          /**/
   /* MERK MED AKTKOD I ALLE MED SALDO 0,KJØP I ÅR 0,KJØP I FJOR 0, */
   /* SOM IKKE FINNES I WRKK */
             CALL       PGM(KUNWMRK)
                                                          /**/
             CLRPFM     FILE(WRKK)
                                                          /**/
 SLUTT:      ENDPGM
