             PGM
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             CHGDTAARA  DTAARA(*LDA (1 1023)) +
                          VALUE('                              ')
             IF         COND(&L1KJOR = 'V') THEN(DO)
             CALL       PGM(&L1STDN/MC030)
             ENDDO
             IF         COND(&L1KJOR = 'J') THEN(DO)
             CALL       PGM(&L1STDN/MC030)
             ENDDO
             IF         COND(&L1KJOR = 'G') THEN(DO)
             CALL       PGM(&L1STDN/VC005)
             ENDDO
             ENDPGM
