             PGM
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             RTVUSRPRF  RTNUSRPRF(&USR)
             CALL       PGM(NCTS068R) PARM((&USR))
             ENDPGM
