             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             CALL       PGM(NCTS154R4) PARM((&SN))

             ENDPGM
