             PGM
             DCL        VAR(&IE) TYPE(*CHAR) LEN(1) VALUE('E')
             CALL       PGM(NCTS003RA) PARM(&IE)
             ENDPGM
