             PGM
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             RUNQRY     QRY(NCTSGBL1_4) QRYFILE((TRUH)) +
                          OUTTYPE(*OUTFILE)
             RUNQRY     QRY(NCTSGBL1_5) QRYFILE((NCTSEH)) +
                          OUTTYPE(*OUTFILE)
             RUNQRY     QRY(NCTSGBL1_9) OUTTYPE(*DISPLAY)
             RTVUSRPRF  RTNUSRPRF(&USER)
             IF         COND((&USER = 'SYSTEMA   ') *OR (&USER = +
                          'ORG       ')) THEN(DO)
             RUNQRY     QRY(NCTSGBL1_A)
             RUNQRY     QRY(NCTSGBL1_B)
             ENDDO
             ENDPGM
