             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             CALL       PGM(NCTS104R1) PARM(&SN)

             ENDPGM
