             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DTA) TYPE(*CHAR) LEN(128)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) VALUE(TVINR) /* +
                          "Skjerm ID"= Membernavn arbeidsfil*/
             DCL        VAR(&LENGTH) TYPE(*DEC) LEN(5 0) VALUE(128)
             DCL        VAR(&IN39) TYPE(*CHAR) LEN(1) VALUE('1') /* +
                          Print av TK kalles fra TVINN eller +
                          registrering */

             CALL       PGM(NCTS104R3) PARM(&SN)

             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGVAR     VAR(&DTA) VALUE(&WS *CAT &USER *CAT &IN39)
             CALL       PGM(QSNDDTAQ) PARM(NCTS014RQ *LIBL +
                          &LENGTH &DTA)

             ENDPGM
