/*  RETTET OVERFLOW PÅ SYFA27PS FRA 58->54                */
/* NY KODE SINSAM A/B SINGEL/SAMLE     */
/* DENNE KJØRER EPOST  FAKTURA         */
/* STRORE RETTELSE I LPI/LPP */
/* ENDRING 90->80  SYFA20PS     */
/* MONMSG AV ADDPFM   */
/* PTF LOGO           */
/* TATT BORT INLIBL   */
/* D I INFOPRINT     */
/* TATT BORT VISE ALTERNATIV */
/* SORT TIL QTEMP            */
             PGM        PARM(&AVD &FANR &STMF &BANE &FINS1 &BANES +
                          &FINS2 &INFOP &SINSAM)
             DCL        VAR(&OBJECT) TYPE(*CHAR) LEN(256)
             DCL        VAR(&SINSAM) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAKT) TYPE(*DEC) LEN(3 0) VALUE(004)
             DCL        VAR(&LOGO) TYPE(*CHAR) LEN(10) +
                          VALUE('LOGOFAKT')
             DCL        VAR(&DRAWER) TYPE(*CHAR) LEN(7)
             DCL        VAR(&DRAWUT) TYPE(*CHAR) LEN(11)
             DCL        VAR(&COPIES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&PNAVN)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOGO2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LPP) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&LPS) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI) TYPE(*DEC) LEN(2 0) VALUE(06)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FINS1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FINS2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FANR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILENS) TYPE(*CHAR) LEN(10) +
                          VALUE('SYFA27PS')
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&P1) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P1E) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P1S) TYPE(*CHAR) LEN(2) VALUE('00')
             DCL        VAR(&P2) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&P3) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P4) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P5) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P6) TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&P7) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&P8) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&P9) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(152)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&BANES) TYPE(*CHAR) LEN(50)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode +
                          til register SORT. */
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&LTYPE) TYPE(*CHAR) LEN(1)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                                         */
    /* FIXER UDS                             */
             CALL       PGM(SYFABKD) PARM(&AVD &FANR &FILEN)
    /* */
             RTVDTAARA  DTAARA(*LDA (81 1)) RTNVAR(&LTYPE)
/*           CHGDTAARA  DTAARA(*LDA (47 1)) VALUE('A')    */
             CHGDTAARA  DTAARA(*LDA (47 1)) VALUE(&SINSAM)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)

/*                                         */
/*           HENTER AVT AVVIKENDE LOGO     */
/*                                         */
/*           CALL       PGM(GETPR2) PARM(&AVD &FAKT &LASER &LPI2) */
             CALL       PGM(GETPRN) PARM(&AVD &FAKT &PNAVN &FORM +
                          &LASER &LPI2 &DRAWER &COPIES &LOGO2 &DRAWUT)
             IF         COND(&LOGO2 *NE '*NONE     ') THEN(DO)
             IF         COND(&LOGO2 *NE '          ') THEN(CHGVAR +
                          VAR(&LOGO) VALUE(&LOGO2))
             ENDDO

    /* */
    /* SETTER LPI TIL 08                     */
    /* */
             IF         COND(&LPI2 = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE(096)
             CHGVAR     VAR(&LPI) VALUE(08)
             ENDDO
    /* */
    /* SETTEL ANTALL LINJER TIL 70/93 VED LASER */
    /* */
             IF         COND(&LASER = 'J') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('070')
             CHGVAR     VAR(&LPS) VALUE('070')
             IF         COND(&LPI = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('093')
             ENDDO
             ENDDO
             IF         COND(&LASER = 'A') THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('070')
             CHGVAR     VAR(&LPS) VALUE('070')
             IF         COND(&LPI = 08) THEN(DO)
             CHGVAR     VAR(&LPP) VALUE('093')
             ENDDO
             ENDDO

/************************************************************************/
/*  FØRST OVERRIDER MED  D = DIEKTE TIL STMF                            */
/************************************************************************/
/*                                                                      */
             IF         COND(&INFOP = 'D') THEN(DO)
             OVRPRTF    FILE(FAKTURA) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
/************************************************************************/
/*         SYFA20P    ***************************************************/
/************************************************************************/
             IF         COND(&FILEN = SYFA20P) THEN(OVRPRTF +
                          FILE(SYFA20P) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          FRONTMGN(0.2 0.1) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
                          ELSE CMD( +
             OVRPRTF    FILE(SYFA20P) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) FRONTMGN(0.2 0.1) +
                          OVRFLW(&LPP) PRTQLTY(*NLQ) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD) HOLD(*YES))

/************************************************************************/
/*         SYFA20PS 1 ***************************************************/
/************************************************************************/
             IF         COND(&FILEN = SYFA20PS) THEN(DO)
             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(96 80) LPI(8) CPI(10) OVRFLW(96) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
             ELSE       CMD(OVRPRTF FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 80) LPI(6) CPI(10) OVRFLW(72) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
                          ENDDO
/************************************************************************/
/*         SYFA20PS 2 ***************************************************/
/************************************************************************/
             IF         COND(&FILEN *NE SYFA20PS) THEN(DO)
             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(96 80) LPI(8) CPI(10) OVRFLW(96) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))
             ELSE       CMD(OVRPRTF FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 80) LPI(6) CPI(10) OVRFLW(72) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))
                          ENDDO
/************************************************************************/
/*         SYFA20PD   ***************************************************/
/************************************************************************/
             IF         COND(&FILEN = SYFA20PD) THEN(DO)
             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PD) DEVTYPE(*AFPDS) +
                          PAGESIZE(96 80) LPI(8) CPI(10) OVRFLW(96) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
             ELSE       CMD(OVRPRTF FILE(SYFA20PD) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 80) LPI(6) CPI(10) OVRFLW(72) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
                          ENDDO

/************************************************************************/
/*         SYFA20PT   ***************************************************/
/************************************************************************/
             IF         COND(&FILEN = SYFA20PT) THEN(OVRPRTF +
                        FILE(SYFA20PT) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(12) OVRFLW(&LPP) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
             ELSE  CMD(OVRPRTF    FILE(SYFA20PT) +
                                       DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))
/************************************************************************/
/*         SYFA27PF   ***************************************************/
/************************************************************************/
             IF         COND(&BANE *NE *BLANKS) THEN(OVRPRTF +
                        FILE(SYFA27PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANE) WSCST(*PDF))
             ELSE       CMD(OVRPRTF FILE(SYFA27PF) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(&LPP) PRTQLTY(*NLQ) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD) HOLD(*YES))
/************************************************************************/
/*         SYFA27PS   ***************************************************/
/************************************************************************/
             IF         COND(&BANES *NE *BLANKS) THEN(OVRPRTF +
                        FILE(SYFA27PS) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(54) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES) +
                          TOSTMF(&BANES) WSCST(*PDF))
             ELSE       CMD(OVRPRTF FILE(SYFA27PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(&LPP 80) LPI(&LPI) CPI(10) +
                          OVRFLW(54) PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))
/************************************************************************/
/*         SYFA27PP   ***************************************************/
/************************************************************************/
             OVRPRTF    FILE(SYFA27PP) PAGESIZE(&LPP 80) LPI(&LPI) +
                          CPI(10) OVRFLW(66) OUTQ(OUTMAIL)
/************************************************************************/
             GOTO       CMDLBL(VIDERE)
             ENDDO
/*                                                                      */
/************************************************************************/
/*  DERETTER INFOPRINT OG CVTTOPDF  (J/N)                              */
/************************************************************************/
/*                                                                      */
             OVRPRTF    FILE(FAKTURA) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SYFA20P) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) FRONTMGN(0.2 0.1) +
                          OVRFLW(&LPP) PRTQLTY(*NLQ) +
                          FRONTOVL(&LOGO) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD) HOLD(*YES)



             IF         COND(&LTYPE = 'S') THEN(OVRPRTF +
                          FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(96 80) LPI(8) CPI(10) OVRFLW(96) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))
             ELSE       CMD(OVRPRTF FILE(SYFA20PS) DEVTYPE(*AFPDS) +
                          PAGESIZE(72 80) LPI(6) CPI(10) OVRFLW(72) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES))

             OVRPRTF    FILE(SYFA20PD) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(12) OVRFLW(&LPP) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SYFA20PT) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SYFA27PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(&LPP) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SYFA27PS) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) LPI(&LPI) CPI(10) OVRFLW(54) +
                          PRTQLTY(*NLQ) FRONTOVL(&LOGO) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) HOLD(*YES)
             OVRPRTF    FILE(SYFA27PP) PAGESIZE(&LPP 80) LPI(&LPI) +
                          CPI(10) OVRFLW(66) OUTQ(OUTMAIL) /* +
                          PRINTERFIL AV SAMLEFAKTURA LISTE */
/*                                                                  */
VIDERE:      CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
/* SORT OGSÅ I LØSNING 1 - INLIBL FOR Å SIKRE BIBLIOTEKSLISTE */
/*                                                                  */
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             CRTDUPOBJ  OBJ(SORT) FROMLIB(&LIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPF0000)
/*           OVRDBF     FILE(SORT) TOFILE(&LIB/SORT)     */
             OVRDBF     FILE(SORT) TOFILE(QTEMP/SORT)

/*           RMVM       FILE(&LIB/SORT) MBR(&UNIK)    */
             RMVM       FILE(QTEMP/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7310 CPF5815 CPF7315)
/* TAGADD:     ADDPFM     FILE(&LIB/SORT) MBR(&UNIK)  */
TAGADD:      ADDPFM     FILE(QTEMP/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7306) EXEC(DO)
             DLYJOB     DLY(5)
             GOTO       CMDLBL(TAGADD)
             ENDDO
             OVRDBF     FILE(SORT) TOFILE(QTEMP/SORT) MBR(&UNIK)
/*           OVRDBF     FILE(SORT) TOFILE(&LIB/SORT) MBR(&UNIK) */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)

/*                                       */
/* KALLER PRINTPROGRAM                   */
/*                                       */
             CALL       PGM(SYFA20) PARM(&P1 &P1E &P1S &P2 &P3 &P4 +
                          &P5 &P6 &P7 &P8 &P9)
/*           RMVM       FILE(SORT) MBR(&UNIK)       */
             RMVM       FILE(QTEMP/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7310 CPF5815 CPF7315)
/*                                       */
/* LAGER PDF AV SELVE FAKTURAEN          */
/*                                       */
/* FINNES FILEN  ??                      */
/*                                       */
/*---------------------------------------------------------------------*/
/*  SPESIAL VED KODE D                                                 */
/*---------------------------------------------------------------------*/
/*                                                                      */
             IF         COND(&INFOP = 'D') THEN(DO)
             CHGVAR     VAR(&OBJECT) VALUE(&BANE)
             CALL       PGM(SYGE99CL) PARM(&OBJECT &FINS1)
             CHGVAR     VAR(&OBJECT) VALUE(&BANES)
             CALL       PGM(SYGE99CL) PARM(&OBJECT &FINS2)
             RETURN
             ENDDO
/*                                       */
/* TESTER OM HOVEDFAKTURA FINS           */
/*                                       */
             RLSSPLF    FILE(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF3309 CPF3303 CPF3322) EXEC(DO)
             CHGVAR     VAR(&FINS1) VALUE('N')
             GOTO       CMDLBL(SPES)
             ENDDO
/*                                                              */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
             DLTSPLF    FILE(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                          ENDDO
/*                                       */
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
/*                                       */
/*                                       */
/*                                       */
             RMVLIBLE   LIB(MMAIL)
 /*                           */
 /* SAMLEFAKTURALISTE TIL PDF */
 /*                           */
 SPES:       IF         COND(&SINSAM = 'C') THEN(DO)
             RLSSPLF    FILE(&FILENS) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF3309 CPF3303 CPF3322) EXEC(DO)
             CHGVAR     VAR(&FINS2) VALUE('N')
             GOTO       CMDLBL(SLUTT)
             ENDDO
/*                                       */
/*                                       */
/* RETURNER VED KODE D                   */
/*                                       */
/*                                       */
             IF         COND(&INFOP = 'D') THEN(RETURN)
/*                                       */
/*                                       */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&FILENS) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANES) ORIENTAT(*V)
             DLTSPLF    FILE(&FILENS) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
                          ENDDO
/*                                       */
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&FILENS &QNBR &QUSER &QJOB +
                          &BANES)
                          ENDDO
/*                                       */
             RMVLIBLE   LIB(MMAIL)
/*                                       */
             ENDDO
/* SLETTER SYFA27PP HVIS FINNES          */
SLUTT:       DLTSPLF    FILE(SYFA27PP) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDPGM
