/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 12XXX * 01 YBC PTF12 ALLTID PDF                                         */
/* ********************************************************************    */
             PGM        PARM(&PRTFIL &EPOST &CVP1)
             DCL        VAR(&PRTFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
/*S01        DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*NO ') */
/*N01*/      DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)

             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)

             CALL       PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB +
                          &PRTFIL &EPOST &CVP1 &CVP2 &CVP3 &CVP4 +
                          &CVP5 &CVP6 &CVP7 &CVP8 &CVP9 &PDF)
             DLTSPLF    FILE(&PRTFIL) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)

 SLUTT:      ENDPGM
