             PGM        PARM(&AVD &OPD &STMF &BANE &VISE &INFOP)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(152)
             DCL        VAR(&VISE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&INFOP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til fakturaer. */
             DCL        VAR(&PT) TYPE(*CHAR) LEN(10) /* Papirtype til +
                          fakturaer. */
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10) /* Printernavn +
                          til merkelapp-2. */
             DCL        VAR(&PT2) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til merkelapp-2. */
             DCL        VAR(&PRANT) TYPE(*CHAR) LEN(2) /* Antall +
                          utskrifter. */
             DCL        VAR(&KOPI) TYPE(*CHAR) LEN(1) VALUE('B') /* +
                          KOPI-  utskrifter. */
             DCL        VAR(&UFAX) TYPE(*CHAR) LEN(1) VALUE('E')
             DCL        VAR(&LPP) TYPE(*DEC) LEN(3 0) VALUE(72)
             DCL        VAR(&CPI) TYPE(*DEC) LEN(2 0) VALUE(10) /* +
                          Antall tegn pr. tomm. */
             DCL        VAR(&DOC) TYPE(*DEC) LEN(3 0) VALUE(013)
             DCL        VAR(&LPI2) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
    /* */
    /* */
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
    /* */
VIDERE:      CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             CHGDTAARA  DTAARA(*LDA (22 8)) VALUE('00000000')
             CHGDTAARA  DTAARA(*LDA (30 6)) VALUE('000000')
             CHGDTAARA  DTAARA(*LDA (100 1)) VALUE('F')
             CHGDTAARA  DTAARA(*LDA (82 7)) VALUE(&OPD)
             CHGDTAARA  DTAARA(*LDA (108 30)) +
                          VALUE('000000000000000000000000000000')
             CHGDTAARA  DTAARA(*LDA (138 29)) +
                          VALUE('0000000000000000000')
             CHGDTAARA  DTAARA(*LDA (209 8)) VALUE('00000000')
             CHGDTAARA  DTAARA(*LDA (231 3)) VALUE('000')

    /* */
             CALL       PGM(GETPR2) PARM(&AVD &DOC &LASER &LPI2)

    /*                                    */
    /*                                    */
    /* START FOR PDF DOKUMENTER           */
    /*                                    */
    /* */
             IF         COND(&INFOP = 'D') THEN(DO)
             OVRPRTF    FILE(SYEX40PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) CPI(10) OVRFLW(&LPP) +
                          FRONTOVL(LOGOFAKT) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD) +
                          TOSTMF(&BANE) WSCST(*PDF)
             ENDDO
             IF         COND(&INFOP *NE 'D') THEN(DO)
             OVRPRTF    FILE(SYEX40PF) DEVTYPE(*AFPDS) PAGESIZE(&LPP +
                          80) CPI(10) OVRFLW(&LPP) +
                          FRONTOVL(LOGOFAKT) OUTQ(OUTMAIL) +
                          FORMTYPE(*STD)
             ENDDO
             OVRPRTF    FILE(MERKL2) PAGESIZE(24 50) +
                          CPI(10) OVRFLW(24) OUTQ(OUTMAIL) FORMTYPE(*STD)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYEX40) PARM(&PRANT &KOPI &AVD &OPD +
                          &UFAX)
             IF         COND(&INFOP = 'D') THEN(RETURN)
    /* */
             CHGVAR     VAR(&FILEN) VALUE('SYEX40PF')
    /* */
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE          */
/* UTEN INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'N') THEN(DO)
             CVTSPLFPDF SPLF(&FILEN) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
                          ENDDO
/*                                       */
/* LAGER PDF OG LEGGER I MAPPE           */
/* MED  INFOPRINT                        */
/*                                       */
             IF         COND(&INFOP = 'J') THEN(DO)
             CALL       PGM(INF001CL) PARM(&FILEN &QNBR &QUSER &QJOB +
                          &BANE)
                          ENDDO
             RMVLIBLE   LIB(MMAIL)
    /* */

 SLUTT:      ENDPGM
