             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             RUNQRY     QRY(QNAV2) QRYFILE((&LIB/ZADF)) +
                          OUTTYPE(*DISPLAY) RCDSLT(*YES)
             ENDPGM
