/*N02* FJERN LENKER FOR TOMCAT-LOGGER */
/*N04* FJERN LENKER FOR TOMCAT-LOGGER NYTT NAMN */
/*N05* MONMSG PÅ  FJERN LENKER FOR TOMCAT-LOGGER NYTT NAMN */
/*N06* FJERNER TMP FILER DEL OBJLNK('TMP/QACX*')           */
/*N07* IKKE TØMM  MMAIL/TEMP   MEN SLETT PÅ DAGER          */
/*N08* MERGEDE DOKUMENTER SUBMITTES                        */
/*N09* 60 DAGER I STEDET FOR 7 DAGER                       */
/*N10* CLEAR SADVAVG   *SLETTET                            */
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) /* +
                          Directory/mappe som leses inn */
/*S09        DCL        VAR(&DGR) TYPE(*CHAR) LEN(5) VALUE('00007') + */
/*N09*/      DCL        VAR(&DGR) TYPE(*CHAR) LEN(5) VALUE('00060') +
                          /*DAGER*/
/*N01*/      DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
/*N01*/      RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
/* FJERN FILER ELDRE ENN 7 DGR FRA DIVERSE IFS-MAPPER*/
/* (merk at /sysca/..=TKpdfHandler rydder seg selv.)*/
/* OBS. Det skader IKKE om en prøver på en mappe som ikke finnes */
/* MAPPER SOM ER FELLES FOR ALLE KJØRES KUN VED OPPSTART AV HOVEDFIRMA */

/*N01*/      IF         COND(&LIBF *EQ 'SYSPEDF') THEN(DO)

  CHGVAR     VAR(&DIR) VALUE('/sysca/innTKpdf/backup')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
  CHGVAR     VAR(&DIR) VALUE('/syspeddev/TKsigntmp/backup')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
  CHGVAR     VAR(&DIR) VALUE('/syspeddev/TKsigntmp/Error')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
  CHGVAR     VAR(&DIR) VALUE('/syspeddev/temp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
/*N07*/
  CHGVAR     VAR(&DIR) VALUE('/mmail/temp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
/*N02 Start*/
/*S04  CHGVAR     VAR(&DIR) VALUE('/apache/apache-tomcat-6.0.37/logs') */

/*N04*/      CHGAUT     OBJ('/APACHE/APACHE-TOMCAT-8.0.26/LOGS/*') +
                          USER(*PUBLIC) DTAAUT(*RWX) OBJAUT(*ALL)
/*N05*/      MONMSG     MSGID(CPF0000)

/*N04*/      CHGVAR     VAR(&DIR) +
                          VALUE('/apache/apache-tomcat-8.0.26/logs')
             CALL       PGM(REOIFSR2) PARM(&DIR &DGR)
/*N02 Slutt*/
/*N03 Start*/
/* S07       DEL        OBJLNK('/mmail/temp/*')  */
/* S07       MONMSG     MSGID(CPF0000)           */
/*N02 Slutt*/
/*CHGVAR     VAR(&DIR) VALUE('/tmp') - Scott Klement   mm.... */
/*           CALL       PGM(REOIFSR) PARM(&DIR &DGR)          */
/*SCOTT KLEMENT   MM.... */
             CHGVAR     VAR(&DIR) VALUE('/tmp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)
/* *N06* SLETTER TMP FILER                                    */
             DEL        OBJLNK('TMP/QACX*')
             MONMSG     MSGID(CPF0000)
             DEL        OBJLNK('TMP/JW*')
             MONMSG     MSGID(CPF0000)

/*N01*/      ENDDO
             SBMJOB     CMD(CALL PGM(REOIFSCLM)) +
             JOB(REORGMRGD) JOBQ(SYJOBQNMAX)

/* TØM/REORG DIV ORDINÆRE ARBEIDSFILER */
             CLRLIB     LIB(SYCGIUSP)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(WRKCGI)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(WRKCGISS)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(WFILEIMP)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(ARKIV)
             MONMSG     MSGID(CPF0000)
/*           CLRPFM     FILE(SADVAVG)  */
/*           MONMSG     MSGID(CPF0000) */
             RGZPFM     FILE(WFILEIMP) MBR(SADPRT)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(TVINS)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(WFILEEXP)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(ARKIV)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(SADPRT)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(TVINS)
             MONMSG     MSGID(CPF0000)

             ENDPGM
