/***********************************************************/
/*     OPPHEVER X-STATUS PÅ HEADF                          */
/*     RYDDET 04/10-2019    SH                             */
/*     CLEAR AV EDI441KP                                   */
/***********************************************************/
             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100) /* +
                          Directory/mappe som leses inn */
             DCL        VAR(&DGR) TYPE(*CHAR) LEN(5) VALUE('00007') +
                          /*DAGER*/
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
/*****************************************************/
/* KJØRING FOR HOVEDFIRMAET                          */
/*****************************************************/
             IF         COND(&LIBF *EQ 'SYSPEDF') THEN(DO)

             CHGVAR     VAR(&DIR) VALUE('/sysca/innTKpdf/backup')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             CHGVAR     VAR(&DIR) VALUE('/syspeddev/TKsigntmp/backup')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             CHGVAR     VAR(&DIR) VALUE('/syspeddev/TKsigntmp/Error')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             CHGVAR     VAR(&DIR) VALUE('/syspeddev/temp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             CHGVAR     VAR(&DIR) VALUE('/mmail/temp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             CHGAUT     OBJ('/APACHE/APACHE-TOMCAT-8.0.26/LOGS/*') +
                          USER(*PUBLIC) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&DIR) +
                          VALUE('/apache/apache-tomcat-8.0.26/logs')
             CALL       PGM(REOIFSR2) PARM(&DIR &DGR)

/*SCOTT KLEMENT   MM.... */
/*TAR BARE 4 DAGER       */
             CHGVAR     VAR(&DGR) VALUE('00004')
             CHGVAR     VAR(&DIR) VALUE('/tmp')
             CALL       PGM(REOIFSR) PARM(&DIR &DGR)

             DEL        OBJLNK('TMP/QACX*')
             MONMSG     MSGID(CPF0000)

             DEL        OBJLNK('/tmp/JW*')
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&DGR) VALUE('00007')

             ENDDO
/*****************************************************/
/* KJØRING FOR HOVEDFIRMAET  SLUTT                   */
/*****************************************************/
/*****************************************************/
/* OPPHEVER STATUS X PÅ ORDRE                        */
/*****************************************************/
             CALL       PGM(SYGE131)
/*****************************************************/
             SBMJOB     CMD(CALL PGM(REOIFSCLM)) +
             JOB(REORGMRGD) JOBQ(SYJOBQNMAX)

/* TØM/REORG DIV ORDINÆRE ARBEIDSFILER */
             CLRLIB     LIB(SYCGIUSP)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(WRKCGI)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(EDI441KP)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(WRKCGISS)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(WFILEIMP)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(ARKIV)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(SADPRT)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEIMP) MBR(TVINS)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(WFILEEXP)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(ARKIV)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(SADPRT)
             MONMSG     MSGID(CPF0000)
             RGZPFM     FILE(WFILEEXP) MBR(TVINS)
             MONMSG     MSGID(CPF0000)

             ENDPGM
