/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 12318 * 01 CB  PTF12 NY FIL FOR 21 TEGNI I FAKTURANUMMER              */
/* ********************************************************************    */
             PGM        PARM(&AVD &TDN &BEL &VAL &KURS &FLAGG &DT)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&BEL) TYPE(*DEC) LEN(13 2)
             DCL        VAR(&VAL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KURS) TYPE(*DEC) LEN(7 3)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&DT) TYPE(*CHAR) LEN(8)
             OVRDBF     FILE(SADF) TOFILE(SAEF)
/*N01*/      OVRDBF     FILE(SADFFA) TOFILE(SAEFFA)
             CALL       PGM(RUBR28) PARM(&AVD &TDN &BEL &VAL &KURS +
                          &FLAGG &DT)
             DLTOVR     FILE(SADF)
             ENDPGM
