             PGM        PARM(&TIL &FRA &L1)
             DCL        VAR(&TIL) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TILSBS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRASBS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&L1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&MAPPE2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&MAPPE3) TYPE(*CHAR) LEN(50)




             CHGVAR     VAR(&FRALIB) VALUE('SYSBS_' *CAT &FRA)
             CHGVAR     VAR(&TILLIB) VALUE('SYSBS_' *CAT &TIL)
             RNMOBJ     OBJ(&TILLIB/&FRASBS) OBJTYPE(*SBSD) +
                          NEWOBJ(&TILSBS)
             RMVAJE     SBSD(&TILLIB/&TILSBS) JOB(SY400AUTO)
             ADDAJE     SBSD(&TILLIB/&TILSBS) JOB(SY400AUTO) +
                          JOBD(&TILLIB/SY400AUTJD)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SY400JOBQ)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) +
                          JOBQ(&TILLIB/SY400JOBQ) MAXACT(1) SEQNBR(10)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQNMAX)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) +
                          JOBQ(&TILLIB/SYJOBQNMAX) MAXACT(*NOMAX) +
                          SEQNBR(20)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQPRT)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) +
                          JOBQ(&TILLIB/SYJOBQPRT) MAXACT(5) SEQNBR(30)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQAV)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQAV) +
                          MAXACT(1) SEQNBR(40)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SY400QER)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SY400QER) +
                          MAXACT(1) SEQNBR(50)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQFAX)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) +
                          JOBQ(&TILLIB/SYJOBQFAX) MAXACT(2) SEQNBR(60)
             RMVJOBQE   SBSD(&TILLIB/&TILSBS) JOBQ(&TILLIB/SYJOBQARK)
             ADDJOBQE   SBSD(&TILLIB/&TILSBS) +
                          JOBQ(&TILLIB/SYJOBQARK) MAXACT(1) SEQNBR(70)
             WRKSBSD    SBSD(&TILSBS)

/* IFS-MAPPER */
             CHGVAR     VAR(&MAPPE) VALUE('/' *CAT &TILLIB)
             MD         DIR(&MAPPE) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/EDIRE')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/TEMP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/BACKUP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/EDIRE1K')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/TEMP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/BACKUP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/EDISE')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/TEMP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/BACKUP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/EDISE1K')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/TEMP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE3) VALUE(&MAPPE2 *CAT '/BACKUP')
             MD         DIR(&MAPPE3) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/TDS')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE2) VALUE(&MAPPE *CAT '/TOLL')
             MD         DIR(&MAPPE2) DTAAUT(*RWX) OBJAUT(*ALL)
             CHGVAR     VAR(&MAPPE) VALUE('/' *CAT &TILLIB *CAT 'X')
             MD         DIR(&MAPPE) DTAAUT(*RWX) OBJAUT(*ALL)

/* ANDRE */
             UPDDTA     FILE(ASPSYSPED/SYFIRMF)
             WRKMSGF    MSGF(&TILLIB/SYMFFIRMA)

 SLUTT:      ENDPGM
