             PGM
             DCL        VAR(&BATCH) TYPE(*CHAR) LEN(1) VALUE('N')

             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SAD069P) PAGESIZE(70 120) LPI(6) +
                          CPI(15) OVRFLW(66) OUTQ(EPOSTDIR)
             CALL       PGM(SAD069R) PARM(&BATCH)

             ENDPGM
