             PGM        PARM(&AVD &OPD &KUN)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KUN) TYPE(*CHAR) LEN(8)
             SBMJOB     CMD(CALL PGM(SAD067) PARM(&AVD &OPD +
                          &KUN)) JOB(SADGEBYR) JOBD(*USRPRF) +
                          JOBQ(SYJOBQAV)
             ENDPGM
