             PGM        PARM(&UUID &STATUS &ATA &IFSFIL)
             DCL        VAR(&UUID) TYPE(*CHAR) LEN(36)
             DCL        VAR(&STATUS) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ATA) TYPE(*CHAR) LEN(30)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IFSFIL) TYPE(*CHAR) LEN(45)
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(60)
             DCL        VAR(&BAKKAT) TYPE(*CHAR) LEN(60)

             ADDLIBLE   LIB(YAJL)
             MONMSG     MSGID(CPF0000)

        /* Hent fil til /temp/..   via webservice/libhttp */
             CALL       PGM(SAD140R) PARM(&UUID &IFSFIL)

        /* Les fila(parse JSON)/ legg ut GSP-pos.. via YAJL */
             IF         COND(&IFSFIL *NE ' ') THEN(DO)
             CALL       PGM(SAD141R) PARM(&STATUS &ATA &IFSFIL)
             IF         COND(&STATUS *EQ 'COMPLETED') THEN(DO)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIBF)
             CHGVAR     VAR(&BAKKAT) VALUE('/' *TCAT &LIBF *TCAT +
                          '/EXPRESSMANIFEST/json_Inn/Backup')
             CPY        OBJ(&IFSFIL) TODIR(&BAKKAT)
             ENDDO
             DEL        OBJLNK(&IFSFIL)
             ENDDO

             RMVLIBLE   LIB(YAJL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
