             PGM
             DCL        VAR(&IN01) TYPE(*LGL) LEN(1)

             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('EKSP.MANIF')

             CALL       PGM(LOGUSR) PARM(&PGM)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('    ')
             CALL       PGM(SYFA00) PARM(&IN01)

             IF         COND(&IN01 = '0') THEN(DO)
             OVRDBF     FILE(SADEFFOPD) TOFILE(SADEFL01)
             CALL       PGM(SAD130R)
             ENDDO

             ENDPGM
