/* N01 KAN OGSÅ BESTILLES PÅ FORETAKSNUMMER */
/*S01        PGM        PARM(&WSIKNKA &WDATOF &WDATOT &WFILNAM) */
/*N01*/      PGM        PARM(&WSIKNKA &WFORET &WDATOF &WDATOT &WFILNAM)
             DCL        VAR(&WSIKNKA) TYPE(*CHAR) LEN(8)
/*N01*/      DCL        VAR(&WFORET) TYPE(*CHAR) LEN(9)
             DCL        VAR(&WDATOF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WDATOT) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WFILNAM) TYPE(*CHAR) LEN(256)
             DCL        VAR(&WFIL) TYPE(*CHAR) LEN(300)
             CHGJOB     RUNPTY(4)
             MONMSG     MSGID(CPF0000)

             DLTF       FILE(QTEMP/SAD62AW)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/SAD62BW)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/SAD62CW)
             MONMSG     MSGID(CPF0000)

             CRTDUPOBJ  OBJ(SAD62AW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(SAD62BW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(SAD62CW) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPF0000)

/*S01        CALL       PGM(SAD62R3) PARM(&WSIKNKA &WDATOF &WDATOT +
                          &WFILNAM) */
/*N01*/      CALL       PGM(SAD62R3) PARM(&WSIKNKA &WFORET &WDATOF +
                          &WDATOT &WFILNAM)
             IF         COND(&WSIKNKA *EQ '03646676') THEN(DO)
             CPY        OBJ(&WFILNAM) TOOBJ('/asp/a53/zalando.csv') +
                          REPLACE(*YES)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&WFIL) +
                          VALUE('http://aspweb.systema.no/asp/a53/zal+
                          ando.csv')

             MONMSG     MSGID(CPF0000)
             SNDPGMMSG  MSG(&WFIL)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDPGM
