             PGM
             DCL        VAR(&LIBTO) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDO')

             OVRDBF     FILE(EDIMOLD)    TOFILE(&LIBTO/EDIM)
             OVRDBF     FILE(EDISOLD)    TOFILE(&LIBTO/EDIS)
             OVRDBF     FILE(SADFOLD)    TOFILE(&LIBTO/SADF)
             OVRDBF     FILE(SADHOLD)    TOFILE(&LIBTO/SADH)
             OVRDBF     FILE(SADVOLD)    TOFILE(&LIBTO/SADV)
             OVRDBF     FILE(SADVJOLD)   TOFILE(&LIBTO/SADVJ)
             OVRDBF     FILE(SADWOLD)    TOFILE(&LIBTO/SADW)
             OVRDBF     FILE(SADHMDOLD)  TOFILE(&LIBTO/SADHMD)
             OVRDBF     FILE(SADHINOLD)  TOFILE(&LIBTO/SADHIN)
             OVRDBF     FILE(SADIUFOLD)  TOFILE(&LIBTO/SADIUF)
             OVRDBF     FILE(SADVEXTOLD) TOFILE(&LIBTO/SADVEXT)
             OVRDBF     FILE(SADVAVGOLD) TOFILE(&LIBTO/SADVAVG)
             OVRDBF     FILE(SADHOMOLD)  TOFILE(&LIBTO/SADHOM)
             OVRDBF     FILE(SADOMTOLD)  TOFILE(&LIBTO/SADOMT)
             OVRDBF     FILE(SADOMTFOLD) TOFILE(&LIBTO/SADOMTF)
             OVRDBF     FILE(SADOMTHOLD) TOFILE(&LIBTO/SADOMTH)
             OVRDBF     FILE(SADOMTVOLD) TOFILE(&LIBTO/SADOMTV)
             OVRDBF     FILE(SADOMTJOLD) TOFILE(&LIBTO/SADOMTVJ)
             OVRDBF     FILE(SADOMTWOLD) TOFILE(&LIBTO/SADOMTW)

             CRTBNDRPG  PGM(SYENDPTF/SADREI1) +
                          SRCFILE(SYENDPTF/QRPGSRC) SRCMBR(SADREI1)
             MONMSG     MSGID(RNS0000)
             DLTOVR     FILE(*ALL)

             ENDPGM
