             PGM
             DCL        VAR(&LIBTO) TYPE(*CHAR) LEN(10) +
                          VALUE('SYSPEDO')

             OVRDBF     FILE(EDIMOLD)    TOFILE(&LIBTO/EDIM)
             OVRDBF     FILE(EDISOLD)    TOFILE(&LIBTO/EDIS)
             OVRDBF     FILE(SAEFOLD)    TOFILE(&LIBTO/SAEF)
             OVRDBF     FILE(SAEHOLD)    TOFILE(&LIBTO/SAEH)
             OVRDBF     FILE(SAEVOLD)    TOFILE(&LIBTO/SAEV)
             OVRDBF     FILE(SAEHTLOLD)  TOFILE(&LIBTO/SAEHTL)
             OVRDBF     FILE(SAEHOMOLD)  TOFILE(&LIBTO/SAEHOM)
             OVRDBF     FILE(SAEOMTOLD)  TOFILE(&LIBTO/SAEOMT)
             OVRDBF     FILE(SAEOMTFOLD) TOFILE(&LIBTO/SAEOMTF)
             OVRDBF     FILE(SAEOMTHOLD) TOFILE(&LIBTO/SAEOMTH)
             OVRDBF     FILE(SAEOMTVOLD) TOFILE(&LIBTO/SAEOMTV)

             CRTBNDRPG  PGM(SYENDPTF/SADREE1) +
                          SRCFILE(SYENDPTF/QRPGSRC) SRCMBR(SADREE1)
             MONMSG     MSGID(RNS0000)
             DLTOVR     FILE(*ALL)

             ENDPGM
