/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 SADHMD                                             */
/* xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx    */
/* 12XXX * 02 YBC PTF12 FLERE NYE FILER                                    */
/* ********************************************************************    */
             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBEDI) TYPE(*CHAR) LEN(10)
             RTVDTAARA  DTAARA(FIRMDT (151 10)) RTNVAR(&LIB)
             RTVDTAARA  DTAARA(EDIDTA (181 10)) RTNVAR(&LIBEDI)
             ALCOBJ     OBJ((&LIB/SADH *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             SNDPGMMSG  MSG('SAD-import i historikk kan ikke +
                          reorganiseres pga. at noen bruker +
                          SAD-import filer.')
             GOTO       CMDLBL(SLUTT)
             ENDDO
             DLCOBJ     OBJ((&LIB/SADH *FILE *EXCL))
        /*______________________*/
        /* Reorganisere members */
        /*""""""""""""""""""""""*/
             RGZPFM     FILE(&LIBEDI/EDIM)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIBEDI/EDIS)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/SADH)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/SADV)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/SADF)
             MONMSG     MSGID(CPF2995 CPF2981)
             RGZPFM     FILE(&LIB/SADW)
             MONMSG     MSGID(CPF2995 CPF2981)
/*N01*/      RGZPFM     FILE(&LIB/SADHMD)
/*N01*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADVJ)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADVEXT)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADVAVG)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADHIN)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADIUF)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADHOM)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMT)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMTF)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMTH)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMTV)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMTVJ)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
/*N02*/      RGZPFM     FILE(&LIB/SADOMTW)
/*N02*/      MONMSG     MSGID(CPF2995 CPF2981)
 SLUTT:      ENDPGM
