             PGM
             DCL        VAR(&DATO) TYPE(*CHAR) STG(*AUTO) LEN(8)
             DCL        VAR(&TID) TYPE(*CHAR) STG(*AUTO) LEN(6)
             DCL        VAR(&TXTL) TYPE(*CHAR) LEN(40)
             DCL        VAR(&TXTLNY) TYPE(*CHAR) LEN(40)
             DCL        VAR(&TXT) TYPE(*CHAR) LEN(33) +
                          VALUE('Tulltaxan før oppdateringer dato:')
             DCL        VAR(&TXTNY) TYPE(*CHAR) LEN(33) VALUE('Ny +
                          oppdatert tulltaxa:')
             DCL        VAR(&NYLIB) TYPE(*CHAR) STG(*AUTO) LEN(10)
             CALL       PGM(SYGE15C) PARM(&DATO &TID)
/*                                      */
/* TAR VARE PÅ GAMMEL TULLTAXA BIBLIOTEK*/
/*                                      */
             CHGVAR     VAR(&NYLIB) VALUE('SV' *TCAT &DATO)
             CHGVAR     VAR(&TXTL) VALUE(&DATO *TCAT &TXT)
             CHGOBJD OBJ(QSYS/SVTTAX) OBJTYPE(*LIB) TEXT(&TXTL)
             RNMOBJ OBJ(QSYS/SVTTAX) OBJTYPE(*LIB) NEWOBJ(&NYLIB)
/*                                      */
/* LAGER NYTT BIBLIOTEK                 */
/*                                      */
             CHGVAR     VAR(&TXTLNY) VALUE(&TXTNY *TCAT &DATO)
             CRTLIB     LIB(SVTTAX) TEXT(&TXTLNY)
/* KOPIER FRA SYSPEDF TIL SVTTAX */
             CPYF       FROMFILE(SYSPEDF/SVTX01F) +
                          TOFILE(SVTTAX/SVTX01F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX02F) +
                          TOFILE(SVTTAX/SVTX02F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX03F) +
                          TOFILE(SVTTAX/SVTX03F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX04F) +
                          TOFILE(SVTTAX/SVTX04F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX05F) +
                          TOFILE(SVTTAX/SVTX05F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX06F) +
                          TOFILE(SVTTAX/SVTX06F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX07F) +
                          TOFILE(SVTTAX/SVTX07F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX08F) +
                          TOFILE(SVTTAX/SVTX08F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX08F2) +
                          TOFILE(SVTTAX/SVTX08F2) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX09F) +
                          TOFILE(SVTTAX/SVTX09F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX10F) +
                          TOFILE(SVTTAX/SVTX10F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX11F) +
                          TOFILE(SVTTAX/SVTX11F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX12F) +
                          TOFILE(SVTTAX/SVTX12F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX13F) +
                          TOFILE(SVTTAX/SVTX13F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX14F) +
                          TOFILE(SVTTAX/SVTX14F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX15F) +
                          TOFILE(SVTTAX/SVTX15F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX16F) +
                          TOFILE(SVTTAX/SVTX16F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX17F) +
                          TOFILE(SVTTAX/SVTX17F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX18F) +
                          TOFILE(SVTTAX/SVTX18F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX19F) +
                          TOFILE(SVTTAX/SVTX19F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX20F) +
                          TOFILE(SVTTAX/SVTX20F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX21F) +
                          TOFILE(SVTTAX/SVTX21F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX23F) +
                          TOFILE(SVTTAX/SVTX23F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX23F2) +
                          TOFILE(SVTTAX/SVTX23F2) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX24F) +
                          TOFILE(SVTTAX/SVTX24F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTX31F) +
                          TOFILE(SVTTAX/SVTX31F) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(SYSPEDF/SVTVK) +
                          TOFILE(SVTTAX/SVTVK) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
     /* SAVE TGTRLS 7.1 P.G.A. FORSJKELLER HOS KUNDER */
             CLRSAVF    FILE(QGPL/SVTTAX)
             SAVLIB     LIB(SVTTAX) DEV(*SAVF) SAVF(QGPL/SVTTAX) +
                          TGTRLS(*PRV)
             ENDPGM
