             PGM
             /*_____________________*/
             /* Deklarere Variabler */
             /*"""""""""""""""""""""*/
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KAT1) TYPE(*CHAR) LEN(256)
             DCL        VAR(&KAT1B) TYPE(*CHAR) LEN(256)
             DCL        VAR(&KAT2) TYPE(*CHAR) LEN(256)
             DCL        VAR(&KAT2B) TYPE(*CHAR) LEN(256)
             DCL        VAR(&KAT3) TYPE(*CHAR) LEN(256)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             MONMSG     MSGID(CPF0000)
             /*____________________________________*/
             /* Hvilket bibliotek ligger filen i ? */
             /*""""""""""""""""""""""""""""""""""""*/
             RTVJOBA    USER(&USER)
             RTVDTAARA  DTAARA(EDIDTA (171 10)) RTNVAR(&LIB)
             CHGVAR     VAR(&KAT1) VALUE('/' *CAT &LIB *TCAT +
                          '/TDS/TTAX/tot/*')
             CHGVAR     VAR(&KAT1B) VALUE('/' *CAT &LIB *TCAT +
                          '/TDS/TTAX/tot2/*')
             CHGVAR     VAR(&KAT2) VALUE('/' *CAT &LIB *TCAT +
                          '/TDS/TTAX/dif/*')
             CHGVAR     VAR(&KAT2B) VALUE('/' *CAT &LIB *TCAT +
                          '/TDS/TTAX/dif2/*')
             CHGVAR     VAR(&KAT3) VALUE('/home/' *CAT &USER)
             /*______________________________*/
             /* Slett alle filer i katalogen */
             /*""""""""""""""""""""""""""""""*/
             RMVLNK     OBJLNK(&KAT1)
             RMVLNK     OBJLNK(&KAT1B)
             RMVLNK     OBJLNK(&KAT2)
             RMVLNK     OBJLNK(&KAT2B)
             /*_______________________*/
             /* UPPRÆTTA HOME KATALOG */
             /*"""""""""""""""""""""""*/
             MD         DIR(&KAT3) DTAAUT(*RWX) OBJAUT(*ALL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
