             PGM
/*___________*/
/* VARIABLER */
/*"""""""""""*/
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0) VALUE(1)
             DCL        VAR(&OPD) TYPE(*DEC) LEN(7 0) VALUE(199999)
             DCL        VAR(&TST) TYPE(*CHAR) LEN(1)
             CALL       PGM(SYCTA02R) PARM(&AVD &OPD &TST)
SLUTT:       ENDPGM
