             PGM        PARM(&INI)
             DCL        VAR(&INI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QSPLF) TYPE(*CHAR) LEN(10) VALUE('QPDSPSBS')
             DCL        VAR(&SYFLIBP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SYSBS) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*  TØMMER OVERSIKT */
             IF         COND(&INI = 'I') THEN(DO)
             CLRPFM     FILE(SYDRSBSJN)
             ENDDO
/*  BYGG WORKFILE */
             CRTDUPOBJ  OBJ(SYDRSTAT) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SYDRSTAT)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(QTEMP/SYDRSTAT)
/*  VIS SBS OVERSIKT      */
             WRKSBS     OUTPUT(*PRINT)
             CPYSPLF    FILE(&QSPLF) TOFILE(QTEMP/SYDRSTAT) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*ADD) CTLCHAR(*PRTCTL)
             DLTSPLF    FILE(&QSPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             CALL       PGM(SYDR06)
SLUTT:       ENDPGM
