             PGM        PARM(&SBS &LIB)
             DCL        VAR(&SBS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
/*______________*/
/* END   SBS    */
/*""""""""""""""*/
             ENDSBS     SBS(&SBS) OPTION(*IMMED)
             DLYJOB     DLY(120)
/*______________*/
/* START SBS    */
/*""""""""""""""*/
             STRSBS     SBSD(&LIB/&SBS)
             ENDPGM
