/* TXTF(*NONE) -> TXTF(ARKSRC) TXTMBR(BLANKSRC) EDTMBR(*NO) */
             PGM        PARM(&MELD)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MELD) TYPE(*CHAR) LEN(70)
             DCLF       FILE(SYDRUSRF) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             ADDLIBLE MMAIL
             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)

             ADDPFM     FILE(ARKSRC) MBR(BLANKSRC)
             MONMSG     MSGID(CPF0000)
/******************************************************************/
/* SENDER TIL EPOSTADRESSE 1                                      */
/******************************************************************/
             IF         COND(&AREP1 *NE '     ') THEN(DO)
             EMLMSG     SUBJECT(&MELD) FROMNAME(&FIRMA) +
                          FROMADDR('drift@systema.no') +
                          TO(&AREP1/&ARUS1/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(BLANKSRC) EDTMBR(*NO) PREFORM(Y)
                          enddo
/******************************************************************/
/* SENDER TIL EPOSTADRESSE 2                                      */
/******************************************************************/
             IF         COND(&AREP2 *NE '     ') THEN(DO)
             EMLMSG     SUBJECT(&MELD) FROMNAME(&FIRMA) +
                          FROMADDR('drift@systema.no') +
                          TO(&AREP2/&ARUS2/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(BLANKSRC) EDTMBR(*NO) PREFORM(Y)
                          enddo
/******************************************************************/
/* SENDER TIL EPOSTADRESSE 3                                      */
/******************************************************************/
             IF         COND(&AREP3 *NE '     ') THEN(DO)
             EMLMSG     SUBJECT(&MELD) FROMNAME(&FIRMA) +
                          FROMADDR('drift@systema.no') +
                          TO(&AREP3/&ARUS3/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(BLANKSRC) EDTMBR(*NO) PREFORM(Y)
                          enddo
/******************************************************************/
/* SENDER TIL EPOSTADRESSE 4                                      */
/******************************************************************/
             IF         COND(&AREP4 *NE '     ') THEN(DO)
             EMLMSG     SUBJECT(&MELD) FROMNAME(&FIRMA) +
                          FROMADDR('drift@systema.no') +
                          TO(&AREP4/&ARUS4/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(BLANKSRC) EDTMBR(*NO) PREFORM(Y)
                          enddo
/******************************************************************/
/* SENDER TIL EPOSTADRESSE 5                                      */
/******************************************************************/
             IF         COND(&AREP5 *NE '     ') THEN(DO)
             EMLMSG     SUBJECT(&MELD) FROMNAME(&FIRMA) +
                          FROMADDR('drift@systema.no') +
                          TO(&AREP5/&ARUS5/*TO) TXTF(&LIB/ARKSRC) +
                          TXTMBR(BLANKSRC) EDTMBR(*NO) PREFORM(Y)
                          enddo
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             ENDPGM
