             PGM        PARM(&SBS &LIB &JOBN &DATO &TID)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TID) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SBS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JOBN) TYPE(*CHAR) LEN(6)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10) VALUE('QSYS')
             DCL        VAR(&SPLF) TYPE(*CHAR) LEN(10) +
                          VALUE('QPJOBLOG')
/*______________*/
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/******************************************************************/
/* SKRIVER JOBBLOGG TIL PRINT                                     */
/******************************************************************/
             DSPJOBLOG  JOB(&JOBN/&USER/&SBS) OUTPUT(*PRINT)
/******************************************************************/
/* KOPIERER SPOOLFIL TIL SYDRJBLOG                                */
/******************************************************************/
             CLRPFM     FILE(SYDRJBLOG)
             CPYSPLF    FILE(&SPLF) TOFILE(SYDRJBLOG) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          CRTDATE(*LAST) TOMBR(*FIRST) MBROPT(*ADD) +
                          CTLCHAR(*NONE)
/******************************************************************/
/* KALLER PROGRAM FOR Å HENTE DATO TID                            */
/******************************************************************/
             CALL       PGM(SYDR06DT) PARM(&SBS &LIB &DATO &TID)
             DLTSPLF    FILE(&SPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             ENDPGM
