             PGM        PARM(&SBS)
             DCL        VAR(&SBS) TYPE(*CHAR) LEN(10)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             WRKACTJOB  SBS(&SBS)
             ENDPGM
