             PGM
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QSPLF) TYPE(*CHAR) LEN(10) VALUE('QPDSPSTS')
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                         */
/*  SKJEKK SYSTEMSTATUS    */
/*                         */
             CRTDUPOBJ  OBJ(SYDRSYST) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SYDRSYST)
             MONMSG     MSGID(CPF2130) EXEC(DO)
             CLRPFM     FILE(QTEMP/SYDRSYST)
             ENDDO
             WRKSYSSTS  OUTPUT(*PRINT) RESET(*YES)
             CPYSPLF    FILE(&QSPLF) TOFILE(QTEMP/SYDRSYST) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*ADD) CTLCHAR(*PRTCTL)
             DLTSPLF    FILE(&QSPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             CALL       PGM(SYDR05)
/*                                                           */
             ENDPGM
