             PGM        PARM(&SBS &PGM &LIB &JOB &JOBQ &JOBD)
             DCL        VAR(&SBS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBD) TYPE(*CHAR) LEN(10)
/**********************************************************************/
/*   SJEKKER OM PROGRAMMET ALLEREDE KJØRER                            */
/**********************************************************************/
             ALCOBJ     OBJ((&PGM *PGM *EXCL))
             MONMSG     MSGID(CPF0000) EXEC(DO)
             GOTO       CMDLBL(SLUTT)
             ENDDO
             DLCOBJ     OBJ((&PGM *PGM *EXCL))
             SBMJOB     CMD(CALL PGM(&PGM)) JOB(&JOB) +
                          JOBD(&JOBD) JOBQ(&JOBQ)
SLUTT:       ENDPGM
