             PGM        PARM(&SYSBS)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QSPLF) TYPE(*CHAR) LEN(10) VALUE('QPDSPSBJ')
             DCL        VAR(&SYFLIBP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SYSBS) TYPE(*CHAR) LEN(10)
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRM) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*________________________________*/
/* HENT INSTALLASJONSOPPLYSNINGER */
/*""""""""""""""""""""""""""""""""*/
             IF         COND(&SYSBS = '          ') THEN(CALL +
                          PGM(GETFIRMF3) PARM(&FIFIRM &SYFLIBP &SYSBS))
             ELSE       CMD(CALL PGM(SYDRLIB) PARM(&SYSBS))
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYDR03) PARM(&SYSBS)
             ENDPGM
