             PGM
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QSPLF) TYPE(*CHAR) LEN(10) VALUE('QPRTSPLQ')
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
/*                         */
/*  SKJEKK JOBBKØSTATUS    */
/*                         */
             CRTPF      FILE(QTEMP/JOBQSTATUS) RCDLEN(512)
             MONMSG     MSGID(CPF7302) EXEC(DO)
             CLRPFM     FILE(QTEMP/JOBQSTATUS)
             ENDDO
/*                         */
/*  SKJEKK SYSTEMSTATUS    */
/*                         */
             WRKJOBQ    OUTPUT(*PRINT)
             CPYSPLF    FILE(&QSPLF) TOFILE(QTEMP/JOBQSTATUS) +
                          JOB(&QNBR/&QUSER/&QJOB) SPLNBR(*LAST) +
                          MBROPT(*ADD) CTLCHAR(*PRTCTL)
             DLTSPLF    FILE(&QSPLF) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             CALL       PGM(SYDR10)
/*                                                           */
             ENDPGM
