             PGM
             DCL        VAR(&TELLGE) TYPE(*CHAR) LEN(8) VALUE('PRIKKUBA')
             DCL        VAR(&TELLNR) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&TELLNRA) TYPE(*CHAR) LEN(7)
             DCL        VAR(&BACKUP) TYPE(*CHAR) LEN(10)
/******************************************************************/
/*  HENTE TELLER TIL BACKUPFIL MEMBERNAVN                         */
/******************************************************************/
             CALL       PGM(SYGE49A) PARM(&TELLGE &TELLNR &TELLNRA)
             CHGVAR     VAR(&BACKUP) VALUE('BAC' *CAT &TELLNRA)
             CPYF       FROMFILE(*LIBL/PRIK) TOFILE(*LIBL/PRIKBACK) +
                          TOMBR(&BACKUP) MBROPT(*ADD) CRTFILE(*NO) +
                          INCREL((*IF PKKNR *NE '    ALLE'))
             ENDPGM
