             PGM
             DCL        VAR(&WSKUNR) TYPE(*DEC) LEN(8 0) VALUE(0)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1) VALUE('L')
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRDBF     FILE(PRIK) TOFILE(PRIKB) OVRSCOPE(*JOB)
             OVRDBF     FILE(PRIK2) TOFILE(PRIKB2) OVRSCOPE(*JOB)
             CALL       PGM(SYFA09) PARM(&TYPE &WSKUNR)
             DLTOVR     FILE(*ALL) LVL(*JOB)
             MONMSG     MSGID(CPF0000)
             ENDPGM
