/* SKRIV ALLE LABELS FOR EN TUR / ET OPPDRA / ET FRAKTBREV */
/* DERSOM PRINTER / TYPE MOTTAS SOM PARAM, BRUK DET, ELLERS HENT FRA USKT 67 */
/*N01 OVERSTYRER  OGSÅ SYFA12SAP (STREKKODE PÅ AFP/LASER) */
             PGM        PARM(&AVD &OPD &FBN &TUR &PRT67 &PT67 &ALLE &KLID)
             DCL        VAR(&KLID) TYPE(*CHAR) LEN(35)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&FBN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PRT67) TYPE(*CHAR) LEN(10) /* Printernavn+
                          til ZEBRA/ELTRON-strekkodemerkelapper */
             DCL        VAR(&PT67) TYPE(*CHAR) LEN(10) /* Papirtype +
                          til ZEBRA/ELTRON strekkodemerkelapper */
             DCL        VAR(&ALLE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&NR67) TYPE(*DEC) LEN(3 0) VALUE(067)
             DCL        VAR(&LASER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPI) TYPE(*DEC) LEN(2 0) VALUE(06)

             IF         COND(&PRT67 = '          ') THEN(DO)
             CALL       PGM(GETPR3) PARM(&AVD &NR67 &PRT67 &PT67 &LASER &LPI)
             ENDDO
             OVRPRTF    FILE(ZBARC) OUTQ(&PRT67) FORMTYPE(&PT67)
             OVRPRTF    FILE(SYLA03P) OUTQ(&PRT67) +
                          FORMTYPE(&PT67)
/*N01*/      OVRPRTF    FILE(SYFA12SAP) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          80) LPI(8) CPI(10) OVRFLW(70) OUTQ(&PRT67) +
                          FORMTYPE(*STD)
    /* ----------------------------------------------------------- */
    /* SKRIVER UT LABELS */
             CALL       PGM(SYFA12L) PARM(&AVD &OPD &FBN &TUR +
                          &PRT67 &PT67 &ALLE &KLID)
    /* ----------------------------------------------------------- */
             ENDPGM
