/* syge88cl = */
/* ENKEL /LITE RESSURSKREVENDE TEST PÅ OM IFS-OBJEKT FINNES  */
/* RENAME OBJEKTET  TIL SEG SELV / SAMME NAVN - finnes -> CPCA084 (ER renamet)*/
/* MEN DERSOM FRAFILEN IKKE FINNES ER MELDINGEN CPFA0A9  */
/* OBS parameter &BANE er full path INKL- filnavn!!!     */
             PGM
/*                                                                            */
/*  test finnes (pr 2021.12.02)                                               */
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(256) +
                        VALUE('/ashnsf/a38/ZO0093341SHIPSxliBajDHa1.pdf')
             DCL        VAR(&NYOBJ) TYPE(*CHAR) LEN(50) +
                        VALUE('ZO0093341SHIPSxliBajDHa1.pdf')
/*                                                                            */
/*           DCL        VAR(&BANE) TYPE(*CHAR) LEN(256) +                     */
/*                      VALUE('/asp/a38/ZO0198325SHIPSaamlKytt7d.pdf')        */
/*           DCL        VAR(&NYOBJ) TYPE(*CHAR) LEN(50) +                     */
/*                      VALUE('ZO0198325SHIPSaamlKytt7d.pdf')                 */

             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)

             CALL       SYGE98CL PARM(&BANE &NYOBJ &FINS)
    /* */
VIDERE:      ENDPGM
