/* KONVETERER CSV TIL DB2      */
/*                         */
             PGM        PARM(&IFSINN  &FILE &LIB)
             DCL        VAR(&IFSINN) TYPE(*CHAR) LEN(90)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&UTFIL) TYPE(*CHAR) LEN(90)
/****************************************************************/
/*  LAGE NY UTFIL                                               */
/****************************************************************/
             CRTPF      FILE(&LIB/&FILE) RCDLEN(1024)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(&LIB/&FILE)
             CHGVAR     VAR(&UTFIL) VALUE('QSYS.LIB/' *TCAT &LIB +
                          *TCAT '.LIB/' *TCAT &FILE *TCAT '.FILE/' +
                          *TCAT &FILE *TCAT '.MBR')
/****************************************************************/
/*  KOPIERER IFSFIL INN TIL    LIB/FILE                         */
/****************************************************************/
             CPYFRMSTMF FROMSTMF(&IFSINN) TOMBR(&UTFIL) +
                          MBROPT(*REPLACE)
 SLUTT:      ENDPGM
