             PGM        PARM(&BANE)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(120)
             DEL        OBJLNK(&BANE)
             MONMSG     MSGID(CPF0000)
             ENDPGM
