/* *********************************************************************   */
/*       * TØMMER UTKØER                                                   */
/* ********************************************************************    */
             PGM
          /*_____________________*/
          /* DEKLARERE VARIABLER */
          /*"""""""""""""""""""""*/
             DCLF       FILE(SYOUTQF)
          /*____________________*/
          /* LES FILBESKRIVELSE */
          /*""""""""""""""""""""*/
 READ:       RCVF       RCDFMT(SYOUTQFR)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(EXIT))
          /*__________________________*/
          /* TØMM UTKØ                */
          /*""""""""""""""""""""""""""*/
             CLROUTQ    OUTQ(&BIBL/&UTKO)
             MONMSG     MSGID(CPF0000)
             GOTO       CMDLBL(READ)
                                                          /**/
 EXIT:       ENDPGM
