/* ENKEL /LITE RESSURSKREVENDE TEST PÅ OM IFS-OBJEKT FINNES  */
/* RENAME OBJEKTET  TIL SEG SELV / SAMME NAVN - finnes -> CPCA084 (ER renamet)*/
/* MEN DERSOM FRAFILEN IKKE FINNES ER MELDINGEN CPFA0A9  */
/* OBS parameter &BANE er full path INKL- filnavn!!!     */
             PGM
/*                                                                            */
/*  test finnes (pr 2021.12.02)                                               */
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(256) +
                          VALUE('/home/jovo/Invoice03.01.2024TøMT.pdf')

             DCL        VAR(&NYOBJ) TYPE(*CHAR) LEN(100) +
                          VALUE('Invoice03.01.2024TøMT.pdf')

             DCL        VAR(&FINS) TYPE(*CHAR) LEN(1)

             CALL       SYGE98CLB PARM(&BANE &NYOBJ &FINS)
    /* */
VIDERE:      ENDPGM
