/* SJEKK OM ET IFS-OBJEKT ER LÅST     */
             PGM        PARM(&IFSOBJ &UIND)
             DCL        VAR(&IFSOBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&UIND) TYPE(*CHAR) LEN(1)
/* ALLE JOBBER KJØRER I UTGANGSPUNKTET CCSID = 65535 = NO CONVERSION */
/* DETTE TAKLER IKKE SQL MOT DENNE FUNKSJONEN - IFS_OBJECT_LOCK_INFO */
/* MIDLERTIDIG SWITCH JOBBENS CCSID                                  */
             CHGJOB     CCSID(277)
             CALL       SYGE140 PARM(&IFSOBJ &UIND)
             CHGJOB     CCSID(65535)
 SLUTT:      ENDPGM
