             PGM        PARM(&BPARM)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&BPARM) TYPE(*CHAR) LEN(60)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(50)
             DCL        VAR(&UNIKF) TYPE(*CHAR) LEN(9) /* Unikkode */
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(7) /* Unikkode */
             DCL        VAR(&QRYF) TYPE(*CHAR) LEN(10) VALUE('SYIM50F')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('*LIBL')
             DCL        VAR(&SEL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&END) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SDV) TYPE(*CHAR) LEN(1) VALUE('S')
             DCL        VAR(&DFN) TYPE(*CHAR) LEN(1) VALUE('N')
             DCL        VAR(&INC) TYPE(*CHAR) LEN(1) VALUE('J')
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CVP2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP3) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP4) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP5) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP6) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP7) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP8) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP9) TYPE(*CHAR) LEN(40)
             DCL        VAR(&TMPFIL) TYPE(*CHAR) LEN(7)
             DCL        VAR(&TMPF10) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STMFIL) TYPE(*CHAR) LEN(50)
             DCL        VAR(&STMF) TYPE(*CHAR) LEN(15)
             DCL        VAR(&FLR) TYPE(*CHAR) LEN(10) VALUE(QPGMR)
             DCL        VAR(&SNDNA) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SNDAD) TYPE(*CHAR) LEN(8)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(44)
             DCL        VAR(&DFNEMNE) TYPE(*CHAR) LEN(44)
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &QNBR)
             CHGVAR     VAR(&SNDNA) VALUE(&QUSER)
             RTVNETA    SYSNAME(&SNDAD)
             CHGVAR     VAR(&UNIKF) VALUE(%SST(&BPARM 1 9))
             CHGVAR     VAR(&EPOST) VALUE(%SST(&BPARM 10 50))
/*                         */
/* HENT EGEN INTERNETTADDR */
/*                         */
/*           CALL       PGM(EPOS04E) PARM(&SNDNA &SNDAD &EPOST) */
/*           CALL       PGM(EPOS07) PARM(&QRYF &LIB &SEL &SDV &DFN +
                          &INC &EPOST &CVP1 &CVP2 &CVP3 &CVP4 &CVP5 +
                          &CVP6 &CVP7 &CVP8) */
             IF         COND(&EPOST = '          ') THEN(GOTO +
                          CMDLBL(SLUTT))
/*                         */
/* UNIKE FILNAVN           */
/*                         */
             CHGVAR     VAR(&TMPFIL) VALUE('W' *CAT &QNBR)
             IF         COND(&SDV = 'S') THEN(CHGVAR VAR(&STMF) +
                          VALUE(&TMPFIL *CAT '.csv'))
             IF         COND(&SDV = 'K') THEN(CHGVAR VAR(&STMF) +
                          VALUE(&TMPFIL *CAT '.csv'))
             IF         COND(&SDV = 'T') THEN(CHGVAR VAR(&SDV) +
                          VALUE('N'))
             IF         COND(&SDV = 'N') THEN(CHGVAR VAR(&STMF) +
                          VALUE(&TMPFIL *CAT '.TXT'))
             CHGVAR     VAR(&STMFIL) VALUE('/QDLS/QPGMR/' *CAT &STMF)
/*                        */
/* KOPIER AKTUELLE POSTER */
/*                        */
             DLTF       FILE(QTEMP/&TMPFIL)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(SYIM50FE) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(&TMPFIL)
/*                                                                           */
             CPYF       FROMFILE(&LIB/&QRYF) TOFILE(QTEMP/&TMPFIL) +
                          MBROPT(*REPLACE) CRTFILE(*YES) +
                          INCCHAR(*RCD 1 *EQ &UNIKF) FMTOPT(*MAP *DROP)
/**************************************************/
/*                                                */
/* START SDV,CSV                                  */
/*                                                */
/**************************************************/
             IF         COND(&SDV = 'N') THEN(GOTO CMDLBL(TXT))
/*                                                */
/* START UTEN FILBESKRIVELSE                      */
/*                                                */
             IF         COND(&INC = 'N') THEN(DO)
/*                                                */
/* START SEMIKOLON-SEPARERT                       */
/*                                                */
             IF         COND(&SDV = 'S') THEN(DO)
             CPYTOIMPF  FROMFILE(QTEMP/&TMPFIL) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) FLDDLM(';') DECPNT(*COMMA)
             ENDDO
/*                                                */
/* START KOMMA-SEPARERT                           */
/*                                                */
             IF         COND(&SDV = 'K') THEN(DO)
             CPYTOIMPF  FROMFILE(QTEMP/&TMPFIL) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) FLDDLM(',') DECPNT(*PERIOD)
             ENDDO
             ENDDO
/*                                                */
/* SLUTT UTEN FILBESKRIVELSE                      */
/*                                                */
/*                                                */
/* START MED  FILBESKRIVELSE                      */
/* EKSTRABEHANDLING HVIS FILBESKRIVELSE SKAL MED  */
/*                                                */
             IF         COND(&INC = 'J') THEN(DO)
             CHGVAR     VAR(&TMPF10) VALUE(&TMPFIL)
             CALL       PGM(SYGE28CL) PARM(&TMPF10)
/*                           */
/* KOPIERER PRINT TIL  FILEN */
/* FØRST HEADER              */
/*                           */
/*                                                */
/* START SEMIKOLON-SEPARERT                       */
/*                                                */
             IF         COND(&SDV = 'S') THEN(DO)
/*           CPYTOIMPF  FROMFILE(TMP1024) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*COMMA)  */

             CPYTOIMPF  FROMFILE(TMP2048) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(';') +
                          DECPNT(*COMMA)

             CPYTOIMPF  FROMFILE(&TMPFIL) TOSTMF(&STMFIL) +
                          MBROPT(*ADD) STMFCODPAG(*STMF) +
                          RCDDLM(*CRLF) FLDDLM(';') DECPNT(*COMMA)
                          ENDDO
/*                                                */
/* START KOMMA-SEPARERT                           */
/*                                                */
             IF         COND(&SDV = 'K') THEN(DO)
             CPYTOIMPF  FROMFILE(TMP1024) TOSTMF(&STMFIL) +
                          MBROPT(*REPLACE) STMFCODPAG(*PCASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(',') +
                          DECPNT(*PERIOD)

             CPYTOIMPF  FROMFILE(&TMPFIL) TOSTMF(&STMFIL) +
                          MBROPT(*ADD) STMFCODPAG(*STMF) +
                          RCDDLM(*CRLF) FLDDLM(',') DECPNT(*PERIOD)
                          ENDDO
                          ENDDO
/*                                                */
/* SLUTT MED  FILBESKRIVELSE                      */
/*                                                */
/* FIX DOC-BESKRIVEØLSE = EMNE I MAIL )           */
/*                                                */
             CHGVAR     VAR(&EMNE) VALUE('ALLE poster fra fil ' *CAT +
                          &QRYF *CAT 'til .csv-fil')
/*                                                */
/* ENDRE TEKST HVIS UTVALG ER GJORT               */
/*                                                */
             IF         COND(&SEL = '*YES') THEN(CHGVAR VAR(&EMNE) +
                          VALUE('Utvalgte poster fra fil ' *CAT +
                          &QRYF *CAT 'til .csv-fil')) /*E04*/
             CHGDOCD    DOC(&STMF) FLR(&FLR) DOCD(&EMNE) +
                          USRAUT((*PUBLIC *ALL))
/*                                     */
/* SEND FILA SOM EPOST                 */
/*                                     */
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD('FIL') +
                          MSG('Åpning av .CSV - fil:     Dersom +
                          åpning direkte ikke gir ønsket resultat +
                          (problem i eldre versjoner...)     1) +
                          Lagre filen      2)Åpne EXCEL        3) +
                          Åpne filen INNE FRA EXCEL!! (husk filtype +
                          *.csv eller <Alle filer> for å finne den +
                          ved åpning..)   .') DOC(&STMF) FLR(&FLR)
             GOTO       CMDLBL(FILDEF)
/*                                       */
/**************************************************/
/* START TXT-F I L                              */
/**************************************************/

 TXT:        CTOPCF     FIL(&TMPFIL) LIB(&LIB) STMF(&STMF) RCDLEN(1000)


/* FIX DOC-BESKRIVEØLSE = EMNE I MAIL )*/
             CHGVAR     VAR(&EMNE) VALUE('ALLE poster fra fil ' *CAT +
                          &QRYF *CAT 'til .txt-fil')
             IF         COND(&SEL = '*YES') THEN( +
             CHGVAR     VAR(&EMNE) VALUE('Utvalgte poster fra fil ' +
                           *CAT &QRYF *CAT 'til .txt-fil'))
             CHGDOCD    DOC(&STMF) FLR(&FLR) DOCD(&EMNE) +
                          USRAUT((*PUBLIC *ALL))
/* SEND FILA SOM EPSOT (TIL SEG SELV..)*/
             SNDDST     TYPE(*DOC) TOINTNET((&EPOST)) DSTD('FIL') +
                          MSG('Se vedlagt .txt-fil') DOC(&STMF) +
                          FLR(&FLR)
/*                                       */
/*                                                   */
/* FILDEFINISJONER I EGEN PDF                        */
/*                                                   */
FILDEF:      IF         COND(&DFN = 'J') THEN(DO)
             CHGVAR     VAR(&DFNEMNE) VALUE(&QRYF *CAT '- File field +
                          definitions.')
             DSPFFDC    FILE(&QRYF) LIB(&LIB)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&BANE) VALUE('/temp/' *TCAT &QUSER *TCAT +
                            '.PDF')
             CVTSPLFPDF SPLF(DSPFFDP) JOB(&QNBR/&QUSER/&QJOB) +
                          TOPDF(&BANE) ORIENTAT(*V)
/*N05*/      EMLSTMF    SUBJECT(&DFNEMNE) FROMNAME(&SNDNA) +
                          FROMADDR(&EPOST) TO(&EPOST/&SNDNA/*TO) +
                          STMF(&BANE)
             RMVLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)
             DLTSPLF    FILE(DSPFFDP) JOB(&QNBR/&QUSER/&QJOB) +
                          SPLNBR(*LAST)
             MONMSG     MSGID(CPF0000)
             ENDDO
 SLUTT:      ENDPGM
