             PGM        PARM(&BNR &FLAGG)
             DCL        VAR(&SG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&BNR) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('KOSTFØRING')
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVDTA) TYPE(*CHAR) LEN(10)
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             RTVDTAARA  DTAARA(*LDA (15 4)) RTNVAR(&AVD)
             RTVDTAARA  DTAARA(*LDA (401 10)) RTNVAR(&SAVDTA)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE('0000')
                        /*Avd. MÅ VÆRE DEFINERT I LDA FOR SYTR88 */
             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGDTAARA  DTAARA(*LDA (401 10)) VALUE(&USER)
                        /*Avd. MÅ VÆRE DEFINERT I LDA FOR SYTR88 */
             OVRDBF     FILE(KOSTBVIS) TOFILE(KOSTB)
             OVRDBF     FILE(KOSTAOPD) TOFILE(KOSTA)
             OVRDBF     FILE(KOSTBSLT) TOFILE(KOSTB)
             CALL       PGM(SYKS02) PARM(&BNR &SG &FLAGG)
             CHGDTAARA  DTAARA(*LDA (401 10)) VALUE(&SAVDTA)
             CHGDTAARA  DTAARA(*LDA (15 4)) VALUE(&AVD)
             ENDPGM
