/* LABELSKRIVER ENDRET TIL KODE 114 */
/*N01 V11 - SIKRE AT LABEL FILOVERTYRING OVERTYRER TIDLIGER (SYOP..) ...*/
             PGM
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10) +
                          VALUE('QKSUATTF')
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10) VALUE('QKSUATTF')
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(40) +
                          VALUE('Uattesterte bilag')
             RUNQRY     QRY(QKSUATT) OUTTYPE(*OUTFILE) +
                          OUTFORM(*DETAIL) RCDSLT(*YES) PRTDFN(*NO)
             CALL       PGM(SYGE55CL) PARM(&FILE &MBR)
                          ENDPGM
