/**************************************************************************/
             PGM        PARM(&MENU)
             DCL        VAR(&MENU) TYPE(*CHAR) LEN(10)
             RCLRSC
             GO         MENU(&MENU) RTNPNT(*NO)
             ENDPGM
