             PGM        PARM(&OBJ &FIL &FRAOBJ &TILBAN)
/*N03*/      DCL        VAR(&GOOGJN) TYPE(*CHAR) LEN(1)
/*N03*/      DCL        VAR(&OK) TYPE(*CHAR) LEN(1)
/*N03*/      DCL        VAR(&TMPDOC) TYPE(*CHAR) LEN(120)
/*N03*/      DCL        VAR(&DUMMY) TYPE(*CHAR) LEN(120)
             DCL        VAR(&FRABAN) TYPE(*CHAR) LEN(90)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(70)
             DCL        VAR(&FRAOBJ) TYPE(*CHAR) LEN(256)
             DCL        VAR(&TILBAN) TYPE(*CHAR) LEN(70)
             RNM        OBJ(&OBJ) NEWOBJ(&FIL)
             MONMSG     MSGID(CPF0000)
             CPY        OBJ(&FRAOBJ) TODIR(&TILBAN) TOCCSID(277)
             MONMSG     MSGID(CPF0000)
/* SETTER SAMMEN FILNAVN TIL DET SOM NORMALT DET LAGRES TIL */
             CHGVAR     VAR(&TMPDOC) VALUE(&TILBAN *TCAT '/' *TCAT &FIL)
/* SKJEKK GOOGLE LAGRING  */
/*N03*/      CALL       PGM(SYGE136) PARM(&GOOGJN &DUMMY)
 /**********************************************************************/
 /* GOOGLE LOGIKK                                                      */
 /**********************************************************************/
             IF         COND(&GOOGJN = 'J') THEN(DO)
             CHGVAR     VAR(&FRABAN) VALUE(&TMPDOC)
             CHGVAR     VAR(&TILBAN) VALUE(&TMPDOC)
             CALL       PGM(SYGE137) PARM(&FRABAN &TILBAN &OK)
             DMPCLPGM
             RETURN
             ENDDO
             ENDPGM
