/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 10XXX * 01 YBC PTF10 OPPLASTET DOK. KAN LIGGE I /SYSPEDDEV/TEMP/        */
/* 10XXX * 02 JOV PTF12 MONMSG VAR REMET - SANSYNLIG TEST/IKKE FJERNET??   */
/* ********************************************************************    */
             PGM        PARM(&AVD &OPD &USR &DOKNV &DOKNV2)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DOKNV) TYPE(*CHAR) LEN(70)
             DCL        VAR(&DOKNV2) TYPE(*CHAR) LEN(35)
             DCL        VAR(&DOKGM) TYPE(*CHAR) LEN(100)
/*N01*/      DCL        VAR(&DOKGM2) TYPE(*CHAR) LEN(100)
             DCL        VAR(&DOKNY) TYPE(*CHAR) LEN(70)
/*N01*/      DCL        VAR(&DOKNY2) TYPE(*CHAR) LEN(70)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(70)
             DCL        VAR(&DOKNVN) TYPE(*CHAR) LEN(70)
                                                          /**/
/*E01*/      CALL       PGM(SYOP23R) PARM(&AVD &OPD &USR &DOKNV +
                          &DOKNV2 &DOKGM &DOKGM2 &DOKNY &DOKNY2 +
                          &MAPPE &DOKNVN)
             RNM        OBJ(&DOKGM) NEWOBJ(&DOKNVN)
/*N01*/      MONMSG     MSGID(CPF0000) EXEC(DO)
/*N01*/      RNM        OBJ(&DOKGM2) NEWOBJ(&DOKNVN)
/*N02*/      MONMSG     MSGID(CPF0000)
/*N01*/      MOV        OBJ(&DOKNY2) TODIR(&MAPPE) TOCCSID(277)
/*N01*/      MONMSG     MSGID(CPF0000)
/*N01*/      GOTO       SLUTT
/*N01*/      ENDDO
/*E01*/      MOV        OBJ(&DOKNY) TODIR(&MAPPE) TOCCSID(277)
/*N01*/      MONMSG     MSGID(CPF0000)
                                                          /**/
 SLUTT:
             ENDPGM
