             PGM
             DCL        VAR(&MSG1) TYPE(*CHAR) LEN(7) VALUE('SHU1738')
             DCL        VAR(&MSG2) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MSG3) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KJOR) TYPE(*CHAR) LEN(1)
        /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             CALL       PGM(SYGE63) PARM(&MSG1 &MSG2 &MSG3 &KJOR)
             IF         COND(&KJOR *NE 'J') THEN(GOTO CMDLBL(EXIT))
             CLRPFM     FILE(AVFRHN)
             CLRPFM     FILE(AVFRDN)
             CLRPFM     FILE(KUPR)
EXIT:        ENDPGM
