/**************************************************************************/
             PGM        PARM(&FILE &LIB &CVP1)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILEQ) TYPE(*CHAR) LEN(10) VALUE('QRYXLS')
             DCL        VAR(&LIBQ) TYPE(*CHAR) LEN(10) VALUE('QTEMP')
             DCL        VAR(&EPOSTT) TYPE(*CHAR) LEN(70)
             DCL        VAR(&CVP1) TYPE(*CHAR) LEN(70)
             DLTF       FILE(&LIBQ/&FILEQ)
             MONMSG     MSGID(CPF0000)
             RUNQRY     QRY(&LIB/&FILE) OUTTYPE(*OUTFILE) +
                          RCDSLT(*YES) OUTFILE(&LIBQ/&FILEQ)
             CALL       PGM(SYGE55XCL) PARM(&FILEQ &FILEQ &EPOSTT &CVP1)
             ENDPGM
