             PGM        PARM(&AVD &OPD &PRO)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(AMDE) TOFILE(AMDE) FRCRATIO(*NONE)
             OVRDBF     FILE(AMGE) TOFILE(AMGE) FRCRATIO(*NONE)
             OVRDBF     FILE(AMHE) TOFILE(AMHE) FRCRATIO(*NONE)
             OVRDBF     FILE(AMSAML) TOFILE(AMSAML) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKEPO) TOFILE(ARKEPO) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKLOGH) TOFILE(ARKLOGH) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKLOGH4) TOFILE(ARKLOGH4) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKLOGD) TOFILE(ARKLOGD) FRCRATIO(*NONE)
             OVRDBF     FILE(AVSLUTGF) TOFILE(AVSLUTGF) FRCRATIO(*NONE)

             CALL       PGM(SYREO12R3) PARM(&AVD &OPD &PRO)

             ENDPGM
