             PGM
             DCL        VAR(&AUTO) TYPE(*CHAR) LEN(1) VALUE('J')

             CHGJOB     JOBMSGQFL(*WRAP)
             CALL       PGM(SYREO31R) PARM(&AUTO)

             ENDPGM
