             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(SADF) TOFILE(SADF) FRCRATIO(*NONE)
             OVRDBF     FILE(SADH) TOFILE(SADH) FRCRATIO(*NONE)
             OVRDBF     FILE(SADHMD) TOFILE(SADHMD) FRCRATIO(*NONE)
             OVRDBF     FILE(SADHIN) TOFILE(SADHIN) FRCRATIO(*NONE)
             OVRDBF     FILE(SADHAN) TOFILE(SADHAN) FRCRATIO(*NONE)
             OVRDBF     FILE(SADIUF) TOFILE(SADIUF) FRCRATIO(*NONE)
             OVRDBF     FILE(SADV) TOFILE(SADV) FRCRATIO(*NONE)
             OVRDBF     FILE(SADW) TOFILE(SADW) FRCRATIO(*NONE)
             OVRDBF     FILE(SADVJ) TOFILE(SADVJ) FRCRATIO(*NONE)
             OVRDBF     FILE(SADVEXT) TOFILE(SADVEXT) FRCRATIO(*NONE)
             OVRDBF     FILE(SADVAVG) TOFILE(SADVAVG) FRCRATIO(*NONE)
             OVRDBF     FILE(SADHOM) TOFILE(SADHOM) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMT) TOFILE(SADOMT) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMTF) TOFILE(SADOMTF) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMTH) TOFILE(SADOMTH) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMTV) TOFILE(SADOMTV) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMTVJ) TOFILE(SADOMTVJ) FRCRATIO(*NONE)
             OVRDBF     FILE(SADOMTW) TOFILE(SADOMTW) FRCRATIO(*NONE)
             OVRDBF     FILE(FPSTD) TOFILE(FPSTD) FRCRATIO(*NONE)
             OVRDBF     FILE(FPXREF) TOFILE(FPXREF) FRCRATIO(*NONE)
             OVRDBF     FILE(GODSJF) TOFILE(GODSJF) FRCRATIO(*NONE)
             OVRDBF     FILE(TVINF) TOFILE(TVINF) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)

             CALL       PGM(SYREO02R) PARM(&DTF &DTP)

             ENDPGM
