             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(LLAGJL14) TOFILE(LLAGJL14) FRCRATIO(*NONE)
             OVRDBF     FILE(LLAGFLG1) TOFILE(LLAGFLG1) FRCRATIO(*NONE)
             OVRDBF     FILE(LLAGJD01) TOFILE(LLAGJD01) FRCRATIO(*NONE)
             OVRDBF     FILE(LLAGJFE2) TOFILE(LLAGJFE2) FRCRATIO(*NONE)
             OVRDBF     FILE(LLLISF) TOFILE(LLLISF) FRCRATIO(*NONE)
             OVRDBF     FILE(LLLTLL02) TOFILE(LLLTLL02) FRCRATIO(*NONE)
             OVRDBF     FILE(LLSERL03) TOFILE(LLSERL03) FRCRATIO(*NONE)
             OVRDBF     FILE(LLMRFL01) TOFILE(LLMRFL01) FRCRATIO(*NONE)
             OVRDBF     FILE(LLBL1F) TOFILE(LLBL1F) FRCRATIO(*NONE)
             OVRDBF     FILE(LLAGJFEU) TOFILE(LLAGJFEU) FRCRATIO(*NONE)
             OVRDBF     FILE(LLLINE) TOFILE(LLLINE) FRCRATIO(*NONE)
             OVRDBF     FILE(LLLINEE1) TOFILE(LLLINEE1) FRCRATIO(*NONE)
             OVRDBF     FILE(LLSERL02) TOFILE(LLSERL02) FRCRATIO(*NONE)
             OVRDBF     FILE(LLHEAD) TOFILE(LLHEAD) FRCRATIO(*NONE)
             OVRDBF     FILE(LLHETXT) TOFILE(LLHETXT) FRCRATIO(*NONE)

             CALL       PGM(SYREO15R) PARM(&DTF &DTP)

             ENDPGM
