             PGM        PARM(&FIL)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(256)

             CHGJOB     LOGOUTPUT(*PND)
             RMVLNK     OBJLNK(&FIL)
             MONMSG     MSGID(CPF0000)

             ENDPGM
