             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIH) TOFILE(TRIH) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIHFS) TOFILE(TRIHFS) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIHPK) TOFILE(TRIHPK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIV) TOFILE(TRIV) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIVCN) TOFILE(TRIVCN) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIVFS) TOFILE(TRIVFS) FRCRATIO(*NONE)
             OVRDBF     FILE(TRIL) TOFILE(TRIL) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILCN) TOFILE(TRILCN) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILDK) TOFILE(TRILDK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILKL) TOFILE(TRILKL) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILMN) TOFILE(TRILMN) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILPK) TOFILE(TRILPK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRILVT) TOFILE(TRILVT) FRCRATIO(*NONE)
             OVRDBF     FILE(GODSJF) TOFILE(GODSJF) FRCRATIO(*NONE)
             OVRDBF     FILE(TVINF) TOFILE(TVINF) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKTXT) TOFILE(ARKTXT) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKEXT) TOFILE(ARKEXT) FRCRATIO(*NONE)
             OVRDBF     FILE(FIRMARC) TOFILE(FIRMARC) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)

             CALL       PGM(SYREO04R) PARM(&DTF &DTP)

             ENDPGM
