             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL19) TOFILE(ARKIVL19) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISKK) TOFILE(FRISKK) FRCRATIO(*NONE)
             OVRDBF     FILE(KOSTA) TOFILE(KOSTA) FRCRATIO(*NONE)
             OVRDBF     FILE(KOSTB) TOFILE(KOSTB) FRCRATIO(*NONE)

             CALL       PGM(SYREO14R) PARM(&DTF &DTP)

             ENDPGM
