             PGM        PARM(&AVD &OPD &PRO)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(OMDI) TOFILE(OMDI) FRCRATIO(*NONE)
             OVRDBF     FILE(PALLD) TOFILE(PALLD) FRCRATIO(*NONE)
             OVRDBF     FILE(RUCKP) TOFILE(RUCKP) FRCRATIO(*NONE)
             OVRDBF     FILE(RUCKPU) TOFILE(RUCKPU) FRCRATIO(*NONE)
             OVRDBF     FILE(STSCLI) TOFILE(STSCLI) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFL) TOFILE(DOKUFL) FRCRATIO(*NONE)
             OVRDBF     FILE(STSFBR) TOFILE(STSFBR) FRCRATIO(*NONE)
             OVRDBF     FILE(STSOPD1) TOFILE(STSOPD1) FRCRATIO(*NONE)
             OVRDBF     FILE(STSTUR) TOFILE(STSTUR) FRCRATIO(*NONE)
             OVRDBF     FILE(UTLLOGF) TOFILE(UTLLOGF) FRCRATIO(*NONE)
             OVRDBF     FILE(VARELI) TOFILE(VARELI) FRCRATIO(*NONE)

             CALL       PGM(SYREO12R4) PARM(&AVD &OPD &PRO)

             ENDPGM
