             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(HEADDT) TOFILE(HEADDT) FRCRATIO(*NONE)
             OVRDBF     FILE(DIMM) TOFILE(DIMM) FRCRATIO(*NONE)
             OVRDBF     FILE(DISP) TOFILE(DISP) FRCRATIO(*NONE)
             OVRDBF     FILE(CARGOF) TOFILE(CARGOF) FRCRATIO(*NONE)
             OVRDBF     FILE(CARGOO) TOFILE(CARGOO) FRCRATIO(*NONE)
             OVRDBF     FILE(ENADSF) TOFILE(ENADSF) FRCRATIO(*NONE)
             OVRDBF     FILE(ESOSF1) TOFILE(ESOSF1) FRCRATIO(*NONE)
             OVRDBF     FILE(ESOSF2) TOFILE(ESOSF2) FRCRATIO(*NONE)
             OVRDBF     FILE(ESOSF3) TOFILE(ESOSF3) FRCRATIO(*NONE)
             OVRDBF     FILE(E170F) TOFILE(E170F) FRCRATIO(*NONE)
             OVRDBF     FILE(E171F) TOFILE(E171F) FRCRATIO(*NONE)
             OVRDBF     FILE(E307F) TOFILE(E307F) FRCRATIO(*NONE)
             OVRDBF     FILE(FAKT) TOFILE(FAKT) FRCRATIO(*NONE)
             OVRDBF     FILE(FAIN) TOFILE(FAIN) FRCRATIO(*NONE)
             OVRDBF     FILE(FAKTXT) TOFILE(FAKTXT) FRCRATIO(*NONE)
             OVRDBF     FILE(FAXLOG) TOFILE(FAXLOG) FRCRATIO(*NONE)
             OVRDBF     FILE(FERDF) TOFILE(FERDF) FRCRATIO(*NONE)
             OVRDBF     FILE(FERFAKT) TOFILE(FERFAKT) FRCRATIO(*NONE)
             OVRDBF     FILE(FORDEL) TOFILE(FORDEL) FRCRATIO(*NONE)
             OVRDBF     FILE(FREETUR) TOFILE(FREETUR) FRCRATIO(*NONE)
             OVRDBF     FILE(FREETXT) TOFILE(FREETXT) FRCRATIO(*NONE)
             OVRDBF     FILE(REIS) TOFILE(REIS) FRCRATIO(*NONE)
             OVRDBF     FILE(TILL) TOFILE(TILL) FRCRATIO(*NONE)
             OVRDBF     FILE(TRAVH) TOFILE(TRAVH) FRCRATIO(*NONE)
             OVRDBF     FILE(TRAVV) TOFILE(TRAVV) FRCRATIO(*NONE)
             OVRDBF     FILE(TURER) TOFILE(TURER) FRCRATIO(*NONE)
             OVRDBF     FILE(TUSTS) TOFILE(TUSTS) FRCRATIO(*NONE)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIM2) TOFILE(EDIM2) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIM8) TOFILE(EDIM8) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS1) TOFILE(EDIS1) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(FPSTD1) TOFILE(FPSTD1) FRCRATIO(*NONE)
             OVRDBF     FILE(FPXREF) TOFILE(FPXREF) FRCRATIO(*NONE)
             OVRDBF     FILE(GODSJL05) TOFILE(GODSJL05) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKL01) TOFILE(TRACKL01) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKT) TOFILE(TRACKT) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL19) TOFILE(ARKIVL19) FRCRATIO(*NONE)

             CALL       PGM(SYREO12R) PARM(&DTF &DTP)

             ENDPGM
