             PGM        PARM(&FIL &OK)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OK) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&OK) VALUE('J')
             ALCOBJ     OBJ((&FIL *FILE *EXCL))
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&OK) VALUE('N')
             GOTO       CMDLBL(SLUTT)
             ENDDO
             DLCOBJ     OBJ((&FIL *FILE *EXCL))
             RGZPFM     FILE(&FIL)
             MONMSG     MSGID(CPF0000)

 SLUTT:      ENDPGM
