             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEF) TOFILE(SVEF) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEFZ) TOFILE(SVEFZ) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEH) TOFILE(SVEH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEHE) TOFILE(SVEHE) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEHF) TOFILE(SVEHF) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEHG) TOFILE(SVEHG) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEHH) TOFILE(SVEHH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEHZ) TOFILE(SVEHZ) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEV) TOFILE(SVEV) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEVA) TOFILE(SVEVA) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEVX) TOFILE(SVEVX) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEVZ) TOFILE(SVEVZ) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEX) TOFILE(SVEX) FRCRATIO(*NONE)
             OVRDBF     FILE(SVEZ) TOFILE(SVEZ) FRCRATIO(*NONE)
             OVRDBF     FILE(TVINF) TOFILE(TVINF) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKTXT) TOFILE(ARKTXT) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKEXT) TOFILE(ARKEXT) FRCRATIO(*NONE)
             OVRDBF     FILE(FIRMARC) TOFILE(FIRMARC) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)

             CALL       PGM(SYREO33R) PARM(&DTF &DTP)

             ENDPGM
