             PGM        PARM(&AVD &OPD &PRO)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(DOKEB) TOFILE(DOKEB) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKEC) TOFILE(DOKEC) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKECE) TOFILE(DOKECE) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKECEL) TOFILE(DOKECEL) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKECET) TOFILE(DOKECET) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKEF) TOFILE(DOKEF) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKEFIM) TOFILE(DOKEFIM) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKEQ) TOFILE(DOKEQ) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKOCI) TOFILE(DOKOCI) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKOCIM1) TOFILE(DOKOCIM1) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKOTH) TOFILE(DOKOTH) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKOTHM1) TOFILE(DOKOTHM1) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUF) TOFILE(DOKUF) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFE) TOFILE(DOKUFE) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFM) TOFILE(DOKUFM) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFN) TOFILE(DOKUFN) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFT) TOFILE(DOKUFT) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFT2) TOFILE(DOKUFT2) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFV) TOFILE(DOKUFV) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFVF) TOFILE(DOKUFVF) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUFVG) TOFILE(DOKUFVG) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUI) TOFILE(DOKUI) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKULG) TOFILE(DOKULG) FRCRATIO(*NONE)
             OVRDBF     FILE(DOKUT) TOFILE(DOKUT) FRCRATIO(*NONE)
             OVRDBF     FILE(DOK29) TOFILE(DOK29) FRCRATIO(*NONE)
             OVRDBF     FILE(DOK36) TOFILE(DOK36) FRCRATIO(*NONE)
             OVRDBF     FILE(DOLAF) TOFILE(DOLAF) FRCRATIO(*NONE)
             OVRDBF     FILE(MCAWF) TOFILE(MCAWF) FRCRATIO(*NONE)
             OVRDBF     FILE(SAMCMRD) TOFILE(SAMCMRD) FRCRATIO(*NONE)
             OVRDBF     FILE(SAMCMRH) TOFILE(SAMCMRH) FRCRATIO(*NONE)

             CALL       PGM(SYREO12R2) PARM(&AVD &OPD &PRO)

             ENDPGM
