             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(MAILSP) TOFILE(MAILSP) FRCRATIO(*NONE)
             OVRDBF     FILE(SAMLA) TOFILE(SAMLA) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKK) TOFILE(TRACKK) FRCRATIO(*NONE)
             OVRDBF     FILE(FREETUR) TOFILE(FREETUR) FRCRATIO(*NONE)
             OVRDBF     FILE(REIS) TOFILE(REIS) FRCRATIO(*NONE)
             OVRDBF     FILE(TILL) TOFILE(TILL) FRCRATIO(*NONE)
             OVRDBF     FILE(TRAVH) TOFILE(TRAVH) FRCRATIO(*NONE)
             OVRDBF     FILE(TRAVV) TOFILE(TRAVV) FRCRATIO(*NONE)
             OVRDBF     FILE(TURER22) TOFILE(TURER22) FRCRATIO(*NONE)
             OVRDBF     FILE(TUSTS) TOFILE(TUSTS) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL19) TOFILE(ARKIVL19) FRCRATIO(*NONE)

             CALL       PGM(SYREO18R) PARM(&DTF &DTP)

             ENDPGM
