             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNH) TOFILE(SVNH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNHE) TOFILE(SVNHE) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNHFS) TOFILE(SVNHFS) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNHH) TOFILE(SVNHH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNHPK) TOFILE(SVNHPK) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNL) TOFILE(SVNL) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLCN) TOFILE(SVNLCN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLDK) TOFILE(SVNLDK) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLKL) TOFILE(SVNLKL) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLMN) TOFILE(SVNLMN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLPK) TOFILE(SVNLPK) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNLVT) TOFILE(SVNLVT) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNV) TOFILE(SVNV) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNVCN) TOFILE(SVNVCN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVNVFS) TOFILE(SVNVFS) FRCRATIO(*NONE)
             OVRDBF     FILE(GODSJF) TOFILE(GODSJF) FRCRATIO(*NONE)
             OVRDBF     FILE(GODSJL05) TOFILE(GODSJL05) FRCRATIO(*NONE)
             OVRDBF     FILE(TVINF) TOFILE(TVINF) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKTXT) TOFILE(ARKTXT) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKEXT) TOFILE(ARKEXT) FRCRATIO(*NONE)
             OVRDBF     FILE(FIRMARC) TOFILE(FIRMARC) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)

             CALL       PGM(SYREO34R) PARM(&DTF &DTP)

             ENDPGM
