             PGM        PARM(&DTF)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EPOH) TOFILE(EPOH) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOH07) TOFILE(EPOH07) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOK) TOFILE(EPOK) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOKLOG) TOFILE(EPOKLOG) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOL) TOFILE(EPOL) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOLT) TOFILE(EPOLT) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOPOS) TOFILE(EPOPOS) FRCRATIO(*NONE)
             OVRDBF     FILE(EPOTT) TOFILE(EPOTT) FRCRATIO(*NONE)

             CALL       PGM(SYREO13R) PARM(&DTF)

             ENDPGM
