             PGM        PARM(&AVD &OPD &PRO)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PRO) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(BILLOF) TOFILE(BILLOF) FRCRATIO(*NONE)
             OVRDBF     FILE(BLV1) TOFILE(BLV1) FRCRATIO(*NONE)
             OVRDBF     FILE(BLV1GATE) TOFILE(BLV1GATE) FRCRATIO(*NONE)
             OVRDBF     FILE(BLV2) TOFILE(BLV2) FRCRATIO(*NONE)
             OVRDBF     FILE(BLVSD2) TOFILE(BLVSD2) FRCRATIO(*NONE)
             OVRDBF     FILE(BILLOFOS) TOFILE(BILLOFOS) FRCRATIO(*NONE)
             OVRDBF     FILE(BILLOFTU) TOFILE(BILLOFTU) FRCRATIO(*NONE)
             OVRDBF     FILE(BLADRT) TOFILE(BLADRT) FRCRATIO(*NONE)
             OVRDBF     FILE(BLLOK) TOFILE(BLLOK) FRCRATIO(*NONE)
             OVRDBF     FILE(BOOKING) TOFILE(BOOKING) FRCRATIO(*NONE)
             OVRDBF     FILE(BOOKIN2) TOFILE(BOOKIN2) FRCRATIO(*NONE)
             OVRDBF     FILE(CCBLV1) TOFILE(CCBLV1) FRCRATIO(*NONE)
             OVRDBF     FILE(CCBLV2) TOFILE(CCBLV2) FRCRATIO(*NONE)

             CALL       PGM(SYREO12R1) PARM(&AVD &OPD &PRO)

             ENDPGM
