             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(EDIM) TOFILE(EDIM) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIS) TOFILE(EDIS) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE) TOFILE(EDISE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE) TOFILE(EDIRE) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISE1K) TOFILE(EDISE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDIRE1K) TOFILE(EDIRE1K) FRCRATIO(*NONE)
             OVRDBF     FILE(EDISX) TOFILE(EDISX) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCVF) TOFILE(XMLRCVF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCAF) TOFILE(XMLRCAF) FRCRATIO(*NONE)
             OVRDBF     FILE(XMLRCLF) TOFILE(XMLRCLF) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXERR) TOFILE(SVXERR) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXH) TOFILE(SVXH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHE) TOFILE(SVXHE) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHFR) TOFILE(SVXHFR) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHFS) TOFILE(SVXHFS) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHFV) TOFILE(SVXHFV) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHGB) TOFILE(SVXHGB) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHGN) TOFILE(SVXHGN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHH) TOFILE(SVXHH) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHK) TOFILE(SVXHK) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXHL) TOFILE(SVXHL) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXV) TOFILE(SVXV) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVAM) TOFILE(SVXVAM) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVCN) TOFILE(SVXVCN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVDK) TOFILE(SVXVDK) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVFS) TOFILE(SVXVFS) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVFV) TOFILE(SVXVFV) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVMN) TOFILE(SVXVMN) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVTD) TOFILE(SVXVTD) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXVVT) TOFILE(SVXVVT) FRCRATIO(*NONE)
             OVRDBF     FILE(SVXGH) TOFILE(SVXGH) FRCRATIO(*NONE)
             OVRDBF     FILE(TVINF) TOFILE(TVINF) FRCRATIO(*NONE)
             OVRDBF     FILE(FRISOK) TOFILE(FRISOK) FRCRATIO(*NONE)
             OVRDBF     FILE(TRACKF) TOFILE(TRACKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKTXT) TOFILE(ARKTXT) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKEXT) TOFILE(ARKEXT) FRCRATIO(*NONE)
             OVRDBF     FILE(FIRMARC) TOFILE(FIRMARC) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVP) TOFILE(ARKIVP) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL17) TOFILE(ARKIVL17) FRCRATIO(*NONE)

             CALL       PGM(SYREO35R) PARM(&DTF &DTP)

             ENDPGM
