             PGM        PARM(&DTF &DTP)
             DCL        VAR(&DTF) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTP) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(ISOFL8) TOFILE(ISOFL8) FRCRATIO(*NONE)
             OVRDBF     FILE(ISOINFF) TOFILE(ISOINFF) FRCRATIO(*NONE)
             OVRDBF     FILE(ISOLFL1) TOFILE(ISOLFL1) FRCRATIO(*NONE)
             OVRDBF     FILE(ISOLOGL1) TOFILE(ISOLOGL1) FRCRATIO(*NONE)
             OVRDBF     FILE(ISOSAKF) TOFILE(ISOSAKF) FRCRATIO(*NONE)
             OVRDBF     FILE(ARKIVL19) TOFILE(ARKIVL19) FRCRATIO(*NONE)

             CALL       PGM(SYREO16R) PARM(&DTF &DTP)

             ENDPGM
