/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 12137 * 02 YBC PTF12 FLERE EPOSTMOTTAKERE                               */
/*       * 03 sh  PTF12 aktivt bibliteksnavn på arksrc                     */
/* ********************************************************************    */
             PGM        PARM(&UNIK &EMNE &AVNA &AVAD &INTNA1 &INTAD1 +
                          &INTNA2 &INTAD2 &INTNA3 &INTAD3 &INTNA4 +
                          &INTAD4 &INTNA5 &INTAD5 &AV &OP &TU &KU)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
/*N01*/      DCL        VAR(&AV) TYPE(*CHAR) LEN(4)
/*N01*/      DCL        VAR(&OP) TYPE(*CHAR) LEN(7)
/*N01*/      DCL        VAR(&TU) TYPE(*CHAR) LEN(8)
/*N01*/      DCL        VAR(&KU) TYPE(*CHAR) LEN(8)
             DCL        VAR(&UNIK)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&EMNE)   TYPE(*CHAR) LEN(70)
             DCL        VAR(&AVNA)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&AVAD)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTNA1) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTAD1) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTNA2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTAD2) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTNA3) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTAD3) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTNA4) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTAD4) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTNA5) TYPE(*CHAR) LEN(50)
             DCL        VAR(&INTAD5) TYPE(*CHAR) LEN(50)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
             ADDLIBLE   LIB(MMAIL)
             MONMSG     MSGID(CPF0000)

/*                                                                       */
/* logger til epostlogg                                                  */
/*                                                                       */
             CALL       PGM(ARC006C) PARM(&INTAD1 &EMNE +
                          &AV &OP &TU &KU)
/*                                                                       */
/*                                                                       */
             EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&INTAD1/&INTNA1/*TO) +
                          TXTF(&LIB/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*N02*/      IF         COND(&INTAD2 *NE ' ') THEN(DO)
/*N02*/      EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&INTAD2/&INTNA2/*TO) +
                          TXTF(&lib/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*N02*/      ENDDO
/*N02*/      IF         COND(&INTAD3 *NE ' ') THEN(DO)
/*N02*/      EMLMSG     SUBJECT(&lib) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&INTAD3/&INTNA3/*TO) +
                          TXTF(*LIBL/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*N02*/      ENDDO
/*N02*/      IF         COND(&INTAD4 *NE ' ') THEN(DO)
/*N02*/      EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&INTAD4/&INTNA4/*TO) +
                          TXTF(&lib/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*N02*/      ENDDO
/*N02*/      IF         COND(&INTAD5 *NE ' ') THEN(DO)
/*N02*/      EMLMSG     SUBJECT(&EMNE) FROMNAME(&AVNA) +
                          FROMADDR(&AVAD) TO(&INTAD5/&INTNA5/*TO) +
                          TXTF(&lib/ARKSRC) TXTMBR(&UNIK) EDTMBR(*NO)
/*N02*/      ENDDO

             RMVLIBLE   LIB(MMAIL)

             CLRPFM     FILE(&LIB/ARKSRC) MBR(&UNIK)

             ENDPGM
