/* UTVIDET EMNE TIL 70 LANGT */
             PGM        PARM(&PARM)
             DCL        VAR(&PDF) TYPE(*CHAR) LEN(4) VALUE('*YES')
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(577)
             DCL        VAR(&AVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&OPD) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CVP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FAXNR) TYPE(*CHAR) LEN(21)
             DCL        VAR(&FILEN) TYPE(*CHAR) LEN(12)
             DCL        VAR(&PTIME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PDATE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MAPPE) TYPE(*CHAR) LEN(20)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)
             DCL        VAR(&QUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&KODE) TYPE(*CHAR) LEN(1) VALUE('O')
             DCL        VAR(&TUR) TYPE(*CHAR) LEN(8)
             DCL        VAR(&CVP01) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP02) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP03) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP04) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP05) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP06) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP07) TYPE(*CHAR) LEN(40)
             DCL        VAR(&CVP08) TYPE(*CHAR) LEN(40)
             DCL        VAR(&EPOST) TYPE(*CHAR) LEN(70)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(70) +
                          VALUE('Booking informations') /* */
             OVRMSGF    MSGF(QUSERMSG) TOMSGF(SYMSGF)
             OVRPRTF    FILE(SYSJ57P) DEVTYPE(*SCS) PAGESIZE(72 80) +
                          LPI(6) CPI(12) OVRFLW(72) +
                          OUTQ(QFAX/QFAXOUTQ) FORMTYPE(*STD)
       /* */
             CHGVAR     VAR(&AVD) VALUE(%SST(&PARM 1 4))
             CHGVAR     VAR(&OPD) VALUE(%SST(&PARM 5 7))
             CHGVAR     VAR(&NR) VALUE(%SST(&PARM 12 1))
             CHGVAR     VAR(&EPOST) VALUE(%SST(&PARM 67 70))
             CALL       PGM(SYSJ57) PARM(&AVD &OPD &NR)
    /* ----------------------------------------------------------- */

             CHGVAR     VAR(&CVP) VALUE(%SST(&PARM 16 1))
             CHGVAR     VAR(&FILEN) VALUE(%SST(&PARM 38 12))
             CHGVAR     VAR(&PTIME) VALUE(%SST(&PARM 50 8))
             CHGVAR     VAR(&PDATE) VALUE(%SST(&PARM 58 8))
             RTVJOBA    JOB(&QJOB) USER(&QUSER) NBR(&QNBR)
             CHGVAR     VAR(&MAPPE) VALUE(&QUSER)

             CHGVAR     VAR(&CVP01) VALUE(%SST(&PARM 257 40))
             CHGVAR     VAR(&CVP02) VALUE(%SST(&PARM 297 40))
             CHGVAR     VAR(&CVP03) VALUE(%SST(&PARM 337 40))
             CHGVAR     VAR(&CVP04) VALUE(%SST(&PARM 377 40))
             CHGVAR     VAR(&CVP05) VALUE(%SST(&PARM 417 40))
             CHGVAR     VAR(&CVP06) VALUE(%SST(&PARM 457 40))
             CHGVAR     VAR(&CVP07) VALUE(%SST(&PARM 497 40))
             CHGVAR     VAR(&CVP08) VALUE(%SST(&PARM 537 40))
/*           CALL       PGM(FAXEPOST) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST &EMNE &CVP01 &CVP02 &CVP03 &CVP04 +
                          &CVP05 &CVP06 &CVP07 &CVP08 &CVP)   */
             CALL     PGM(FAXEPMMCL) PARM(&QUSER &QNBR &QJOB &FILEN +
                          &EPOST &EMNE &CVP01 &CVP02 &CVP03 &CVP04 +
                          &CVP05 &CVP06 &CVP07 &CVP08 &PDF)
             CHGVAR     VAR(&FAXNR) VALUE(MAIL)

             CHGVAR     VAR(&NAVN) VALUE(%SST(&PARM 297 30))
             CALL       PGM(FAX013) PARM(&QUSER &QNBR &QJOB +
                          &FAXNR &FILEN &MAPPE &PTIME &PDATE +
                          &NAVN &AVD &OPD &TUR &KODE)
       /* */
             ENDPGM
