             PGM
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
             DCL        VAR(&PATH) TYPE(*CHAR) LEN(256) +
                          VALUE('/SYSPEDF/TOLL/tollsats.xml           -
                                                                      -
                                                                      -
                                                                      -
         ')
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) +
                          VALUE('*LIBL     ')
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(10) +
                          VALUE('*IFS      ')
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)

/* Legg post i EDISX og skap sendingsnr */
             CALL       PGM(SYTI07R1) PARM(&SN &MBR &PATH)

/* Legg ut XML-tager i databasefil med Nøkler som representerer nivå */
             ADDLIBLE   LIB(LIBHTTP) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             CALL       PGM(XMLRCVR) PARM(&PATH &SN)

/* Finn ut HVA/Fra HVEM - loggfør i EDIS sett / kall behandlingsprog*/
             CALL       PGM(XMLRCVR2) PARM(&SN &LIB &FIL &MBR &PROG +
                          &PATH)
             SBMJOB     CMD(CALL PGM(&PROG) PARM(&SN)) JOBQ(SYJOBQNMAX)

             ENDPGM
