             PGM
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) +
                          VALUE('SYTI02C1  ')

             CALL       PGM(SYTI00C) PARM(&PGM)

             ENDPGM
