             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             CALL       PGM(SYTI05R) PARM(&SN)

             ENDPGM
