             PGM        PARM(&SN)
             DCL        VAR(&SN) TYPE(*CHAR) LEN(9)

             CALL       PGM(SYTI03R) PARM(&SN)

             ENDPGM
