             PGM        PARM(&BNRA &KLBANE)
             DCL        VAR(&WS) TYPE(*CHAR) LEN(10) VALUE(TVINR)
             DCL        VAR(&LIBRARY) TYPE(*CHAR) LEN(10) /* Library */
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10) /* File    */
             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(10) /* Member  */
             DCL        VAR(&LENGTH) TYPE(*DEC) LEN(5 0) VALUE(128)
             DCL        VAR(&PRT1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT3) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DTA) TYPE(*CHAR) LEN(128)
             DCL        VAR(&IN39) TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&BNRA) TYPE(*CHAR) LEN(7)
             DCL        VAR(&KLBANE) TYPE(*CHAR) LEN(128)
             OVRPRTF    FILE(SYXMLDOP) DEVTYPE(*AFPDS) PAGESIZE(70 +
                          120) LPI(6) CPI(15) +
                          OVRFLW(66) +
                          OUTQ(OUTMAIL) FORMTYPE(*STD) +
                          TOSTMF(&KLBANE) WSCST(*PDF)
             CALL       PGM(SYXMLDOR) PARM(&BNRA)
           /*_________________________________________________*/
           /* Skriv ut Tollkvittering (TK)                    */
           /*"""""""""""""""""""""""""""""""""""""""""""""""""*/
             RTVUSRPRF  RTNUSRPRF(&USER)
             CHGVAR     VAR(&DTA) VALUE(&WS *CAT &USER *CAT &IN39 +
                          *CAT &PRT1 *CAT &PRT2 *CAT &PRT3)
             CALL       PGM(QSNDDTAQ) PARM(SAD61PQ *LIBL &LENGTH &DTA)
             ENDPGM
