             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(1)
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(9)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(10) /* Unikkode +
                          til register SORT. */
             DCL        VAR(&LIBR) TYPE(*CHAR) LEN(10)

             ADDLIBLE   LIB(LIBHTTP) POSITION(*LAST)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&LIB) +
                          VALUE('N'))

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIBR)
 RTVTIME:    RTVJOBA    USER(&AUSER) NBR(&TIME)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &TIME)
             RMVM       FILE(&LIBR/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(&LIBR/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7306) EXEC(GOTO CMDLBL(RTVTIME))
             OVRDBF     FILE(SORT) TOFILE(&LIBR/SORT) MBR(&UNIK)

             CALL       PGM(SYXML30)

             IF         COND(&LIB *NE 'N') THEN(DO)
             RMVLIBLE   LIB(LIBHTTP)
             MONMSG     MSGID(CPF0000)
             ENDDO

             DLTOVR     FILE(SORT)
             RMVM       FILE(&LIBR/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)

             ENDPGM
