             PGM
             DCL        VAR(&AUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(9)
             DCL        VAR(&UNIK) TYPE(*CHAR) LEN(10) /* Unikkode +
                          til register SORT. */
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLYJOB     RSMTIME(220000)

             RTVDTAARA  DTAARA(FIRMDT (141 10)) RTNVAR(&LIB)
 RTVTIME:    RTVJOBA    USER(&AUSER) NBR(&TIME)
             CHGVAR     VAR(&UNIK) VALUE('W' *CAT &TIME)
             RMVM       FILE(&LIB/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7310)
             ADDPFM     FILE(&LIB/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF7306) EXEC(GOTO CMDLBL(RTVTIME))
             OVRDBF     FILE(SORT) TOFILE(&LIB/SORT) MBR(&UNIK)

             CALL       PGM(SYXML30)

             DLTOVR     FILE(SORT)
             RMVM       FILE(&LIB/SORT) MBR(&UNIK)
             MONMSG     MSGID(CPF0000)

             ENDPGM
