             PGM        PARM(&EMNE &MSG &EP)
             DCL        VAR(&EMNE) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(256)
             DCL        VAR(&EP) TYPE(*CHAR) LEN(70)

             SNDDST     TYPE(*LMSG) TOINTNET((&EP)) DSTD(&EMNE) +
                          LONGMSG(&MSG) USRID(*CURRENT) SNDFMT(*NOCHG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&EP) VALUE('BING@SYSTEMA.NO')
             SNDDST     TYPE(*LMSG) TOINTNET((&EP)) DSTD(&EMNE) +
                          LONGMSG(&MSG) USRID(*CURRENT) SNDFMT(*NOCHG)
             MONMSG     MSGID(CPF0000)

             ENDPGM
