 /* BHR ENDRINGER I OUTQ */
             PGM        PARM(&SN)
 /*S01       DCL        VAR(&SN) TYPE(*CHAR) LEN(7)  */
 /*N01*/     DCL        VAR(&SN) TYPE(*CHAR) LEN(9)
 /* BHR */
             OVRPRTF    FILE(LISTE) CPI(16.7) OUTQ(OPTRA)
 /* BHR */
 /* SKRIV POSTER TIL KOSTA/KOSTB */
             CALL       PGM(SYXML25) PARM(&SN)

             ENDPGM
