/* skriv direkte til IFS/PDF  */
             PGM        PARM(&GN &PKOD &BANE)
             DCL        VAR(&BANE0) TYPE(*CHAR) LEN(11) +
                          VALUE('/tollarkiv/')
             DCL        VAR(&BANE9) TYPE(*CHAR) LEN(4) VALUE('.pdf')
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(50)
             DCL        VAR(&GN) TYPE(*CHAR) LEN(15)
             DCL        VAR(&PKOD) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&BANE) VALUE(&BANE0 *TCAT &PKOD *TCAT &GN +
                          *TCAT &BANE9)
             RMVLNK     OBJLNK(&BANE)
             MONMSG     MSGID(CPF0000)
    /*                                    */
    /* SKRIVER UT LISTE                   */
    /*                                    */
             OVRPRTF    FILE(LISTE) DEVTYPE(*AFPDS) PAGESIZE(64 160) +
                          LPI(8) CPI(15) OVRFLW(62) PAGRTT(90) +
                          FRONTOVL(SYSPED/GODSJ) OUTQ(SYCGIOUTQ) +
                          FORMTYPE(*STD) SPLFOWN(*JOB) +
                          TOSTMF(&BANE) WSCST(*PDF)

             CALL       PGM(SYTL06) PARM(&GN &PKOD)

             ENDPGM
