/* FLYTTER FRA OG TIL BIBLIOTEK                   */
             PGM        PARM(&LIBF &LIBT)
             DCL        VAR(&LIBF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIBT) TYPE(*CHAR) LEN(10)
/* VALUTAFIL  SVTVK */
             OVRDBF     FILE(SVTVKO) TOFILE(&LIBT/SVTVK)
             OVRDBF     FILE(SVTVKN) TOFILE(&LIBF/SVTVK)
             CALL TTAX01
/* FIL SVTX01F      */
             OVRDBF     FILE(SVTX01FO) TOFILE(&LIBT/SVTX01F)
             OVRDBF     FILE(SVTX01FN) TOFILE(&LIBF/SVTX01F)
             CALL TTAX02
/* FIL SVTX02F      */
             OVRDBF     FILE(SVTX02FO) TOFILE(&LIBT/SVTX02F)
             OVRDBF     FILE(SVTX02FN) TOFILE(&LIBF/SVTX02F)
             CALL TTAX03
/* FIL SVTX03F      */
             OVRDBF     FILE(SVTX03FO) TOFILE(&LIBT/SVTX03F)
             OVRDBF     FILE(SVTX03FN) TOFILE(&LIBF/SVTX03F)
             CALL TTAX04
/* FIL SVTX04F      */
             OVRDBF     FILE(SVTX04FO) TOFILE(&LIBT/SVTX04F)
             OVRDBF     FILE(SVTX04FN) TOFILE(&LIBF/SVTX04F)
             CALL TTAX05
/* FIL SVTX05F      */
             OVRDBF     FILE(SVTX05FO) TOFILE(&LIBT/SVTX05F)
             OVRDBF     FILE(SVTX05FN) TOFILE(&LIBF/SVTX05F)
             CALL TTAX06
/* FIL SVTX06F      */
             OVRDBF     FILE(SVTX06FO) TOFILE(&LIBT/SVTX06F)
             OVRDBF     FILE(SVTX06FN) TOFILE(&LIBF/SVTX06F)
             CALL TTAX07
/* FIL SVTX07F      */
             OVRDBF     FILE(SVTX07FO) TOFILE(&LIBT/SVTX07F)
             OVRDBF     FILE(SVTX07FN) TOFILE(&LIBF/SVTX07F)
             CALL TTAX08
/* FIL SVTX08F      */
             OVRDBF     FILE(SVTX08FO) TOFILE(&LIBT/SVTX08F)
             OVRDBF     FILE(SVTX08FN) TOFILE(&LIBF/SVTX08F)
             CALL TTAX09
/* FIL SVTX08F2     */
             OVRDBF     FILE(SVTX08F2O) TOFILE(&LIBT/SVTX08F2)
             OVRDBF     FILE(SVTX08F2N) TOFILE(&LIBF/SVTX08F2)
             CALL TTAX10
/* FIL SVTX09F      */
             OVRDBF     FILE(SVTX09FO) TOFILE(&LIBT/SVTX09F)
             OVRDBF     FILE(SVTX09FN) TOFILE(&LIBF/SVTX09F)
             CALL TTAX11
/* FIL SVTX10F      */
             OVRDBF     FILE(SVTX10FO) TOFILE(&LIBT/SVTX10F)
             OVRDBF     FILE(SVTX10FN) TOFILE(&LIBF/SVTX10F)
             CALL TTAX12
/* FIL SVTX11F      */
             OVRDBF     FILE(SVTX11FO) TOFILE(&LIBT/SVTX11F)
             OVRDBF     FILE(SVTX11FN) TOFILE(&LIBF/SVTX11F)
             CALL TTAX13
/* FIL SVTX12F      */
             OVRDBF     FILE(SVTX12FO) TOFILE(&LIBT/SVTX12F)
             OVRDBF     FILE(SVTX12FN) TOFILE(&LIBF/SVTX12F)
             CALL TTAX14
/* FIL SVTX13F      */
             OVRDBF     FILE(SVTX13FO) TOFILE(&LIBT/SVTX13F)
             OVRDBF     FILE(SVTX13FN) TOFILE(&LIBF/SVTX13F)
             CALL TTAX15
/* FIL SVTX14F      */
             OVRDBF     FILE(SVTX14FO) TOFILE(&LIBT/SVTX14F)
             OVRDBF     FILE(SVTX14FN) TOFILE(&LIBF/SVTX14F)
             CALL TTAX16
/* FIL SVTX15F      */
             OVRDBF     FILE(SVTX15FO) TOFILE(&LIBT/SVTX15F)
             OVRDBF     FILE(SVTX15FN) TOFILE(&LIBF/SVTX15F)
             CALL TTAX17
/* FIL SVTX16F      */
             OVRDBF     FILE(SVTX16FO) TOFILE(&LIBT/SVTX16F)
             OVRDBF     FILE(SVTX16FN) TOFILE(&LIBF/SVTX16F)
             CALL TTAX18
/* FIL SVTX17F      */
             OVRDBF     FILE(SVTX17FO) TOFILE(&LIBT/SVTX17F)
             OVRDBF     FILE(SVTX17FN) TOFILE(&LIBF/SVTX17F)
             CALL TTAX19
/* FIL SVTX18F      */
             OVRDBF     FILE(SVTX18FO) TOFILE(&LIBT/SVTX18F)
             OVRDBF     FILE(SVTX18FN) TOFILE(&LIBF/SVTX18F)
             CALL TTAX20
/* FIL SVTX19F      */
             OVRDBF     FILE(SVTX19FO) TOFILE(&LIBT/SVTX19F)
             OVRDBF     FILE(SVTX19FN) TOFILE(&LIBF/SVTX19F)
             CALL TTAX21
/* FIL SVTX20F      */
             OVRDBF     FILE(SVTX20FO) TOFILE(&LIBT/SVTX20F)
             OVRDBF     FILE(SVTX20FN) TOFILE(&LIBF/SVTX20F)
             CALL TTAX22
/* FIL SVTX21F      */
             OVRDBF     FILE(SVTX21FO) TOFILE(&LIBT/SVTX21F)
             OVRDBF     FILE(SVTX21FN) TOFILE(&LIBF/SVTX21F)
             CALL TTAX23
/* FIL SVTX23F      */
             OVRDBF     FILE(SVTX23FO) TOFILE(&LIBT/SVTX23F)
             OVRDBF     FILE(SVTX23FN) TOFILE(&LIBF/SVTX23F)
             CALL TTAX24
/* FIL SVTX23F2     */
             OVRDBF     FILE(SVTX23F2O) TOFILE(&LIBT/SVTX23F2)
             OVRDBF     FILE(SVTX23F2N) TOFILE(&LIBF/SVTX23F2)
             CALL TTAX25
/* FIL SVTX24F      */
             OVRDBF     FILE(SVTX24FO) TOFILE(&LIBT/SVTX24F)
             OVRDBF     FILE(SVTX24FN) TOFILE(&LIBF/SVTX24F)
             CALL TTAX26
/* FIL SVTX31F      */
             OVRDBF     FILE(SVTX31FO) TOFILE(&LIBT/SVTX31F)
             OVRDBF     FILE(SVTX31FN) TOFILE(&LIBF/SVTX31F)
             CALL TTAX27
             DLTOVR     FILE(*ALL)
             ENDPGM
