             PGM
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)

/* FOR Å KUNNE KJØRE FRA JOBSCDE */
             CALL       PGM(SYSPED/INLIBL)

             CRTDUPOBJ  OBJ(ARCA001F) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(ARCA001F) TOFILE(QTEMP/ARCA001F)

             CHGJOB     RUNPTY(7)
/* TULLTAXA-MAPPA                    */
             CHGVAR     VAR(&DIR) VALUE('/syspedfx/TULLTAXAN/EDIRE1K')
             CHGVAR     VAR(&PGM) VALUE('TULLTAXC2')
             CALL       PGM(ARCA001R) PARM(&DIR &PGM)

 /*          DLYJOB     DLY(120)                      */
 /*          CLRPFM     FILE(QTEMP/ARCA001F)          */
 /*          MONMSG     MSGID(CPF0000)                */
 /*                                                   */
 /*          GOTO       CMDLBL(START)                 */

 SLUTT:      ENDPGM
