             PGM        PARM(&DIR &FIL &FULLPATH)
             DCL        VAR(&DIR) TYPE(*CHAR) LEN(100)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(120)
             DCL        VAR(&FULLPATH) TYPE(*CHAR) LEN(256)
             DCL        VAR(&BACKPATH) TYPE(*CHAR) LEN(256)
             DCL        VAR(&DT)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&TM)  TYPE(*CHAR) LEN(6)

             DLTF       FILE(QTEMP/TULLTAX)
             MONMSG     MSGID(CPF0000)
             CRTPF      FILE(QTEMP/TULLTAX) RCDLEN(1024) +
                          SIZE(100000000 10000 30)
             MONMSG     MSGID(CPF0000)

             CPYFRMSTMF FROMSTMF(&FULLPATH) +
                          TOMBR('QSYS.LIB/QTEMP.LIB/TULLTAX.FILE/TULL+
                          TAX.MBR') MBROPT(*REPLACE) +
                          STMFCCSID(1208) TABEXPN(*NO)

  /* KALL HOVEDPROG FOR KONVERTERING  */
             CALL       PGM(SVT500R)

  /* FLYTT TIL BACKUPMAPPE */
             CALL       PGM(SYGE15C) PARM(&DT &TM)
             CHGVAR     VAR(&BACKPATH) VALUE(&DIR *TCAT '/BACKUP/' +
                *TCAT &DT *TCAT '-' *TCAT &TM *TCAT '-' *TCAT &FIL)
             MOV        OBJ(&FULLPATH) TOOBJ(&BACKPATH)

             ENDPGM
