/* PTF01                                                                  */
/* datafilsett endret hos toll.NO  20. februar 2023                       */
/*  tollsats  til  tollavgiftssats                                         */
/*  raavaretollsats  til  raavaretollavgiftssats                          */
             PGM
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(45)

             ADDLIBLE   LIB(LIBHTTP2)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&FIL) +
                          VALUE('landgruppe                           -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('medlemsland                          -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('valutakurs                           -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('tollavgiftssats                      -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('utfoerselsavgift                     -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('innfoerselsavgift                    -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('raavaretollavgiftssats               -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('innfoerselsreferanse                 -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

             CHGVAR     VAR(&FIL) +
                          VALUE('utfoerselsreferanse                  -
        ')
             CALL       PGM(TVGETFILC) PARM(&FIL)

/* innparameter er TYPEN som er key for oppslag i først json (TVGETFIL1)  */
/* Ulike muligheter pr oktober 2021 :                                     */
/* "https://data.toll.no/api/3/action/help_show?name=package_list"        */
/*                                                                        */
/*       "innfoerselsavgift",                                             */
/*       "innfoerselsreferanse",                                          */
/*       "innfoerselsrestriksjon",      Ikke med                          */
/*       "landgruppe",                                                    */
/*       "lettelse",                    Ikke med                          */
/*       "medlemsland",                                                   */
/*       "raavaretollavgiftssats",                                        */
/*       "tollkvote",                   Ikke med                          */
/*       "tollavgiftssats"'                                               */
/*       "tolltariffstruktur",          Ikke med                          */
/*       "utfoerselsavgift",                                              */
/*       "utfoerselsreferanse",                                           */
/*       "utfoerselsrestriksjon",       Ikke med                          */
/*       "valutakurs",                                                    */
/*       "valutakurs_historisk"         Ikke med                          */
/*                                                                        */

             ENDPGM

