/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 12XXX * 01 CB  PTF12 START/DLY VIA DATAQ                              */
/* ********************************************************************    */
             PGM
 /*___________________*/
 /* Beskriv variabler */
 /*"""""""""""""""""""*/
             DCL        VAR(&ENDTIME) TYPE(*CHAR) LEN(6) /* +
                          Avsluttning av SBS */
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(6) /* Systemtid */
/*N01*/      DCL        VAR(&QRNAME) TYPE(*CHAR) LEN(10) +
                          VALUE('TVI02CQ')
/*N01*/      DCL        VAR(&QRLIB) TYPE(*CHAR) LEN(10) VALUE('*LIBL')
/*N01*/      DCL        VAR(&QRLEN) TYPE(*DEC) LEN(5 0) VALUE(1)
/*N01*/      DCL        VAR(&QRFIEL) TYPE(*CHAR) LEN(1)
/*N01*/      DCL        VAR(&QWAIT) TYPE(*DEC) LEN(5 0) VALUE(240)
 /*__________________________*/
 /* Skal polling avsluttes ? */
 /*""""""""""""""""""""""""""*/
TAG01:       RTVDTAARA  DTAARA(EDIDTA (160 6)) RTNVAR(&ENDTIME)
             IF         COND(&ENDTIME *NE *NONE) THEN(DO)
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&QTIME)
             IF         COND(&ENDTIME *LT &QTIME) THEN(DO)
             GOTO       CMDLBL(END)
             ENDDO
             ENDDO
 /*_____________________*/
 /* Delsystem er aktivt */
 /*"""""""""""""""""""""*/
             CALL       PGM(TVI03C) /* Sendning av EDIfact-import */
             MONMSG     MSGID(CPF0001)
/*S01        DLYJOB     DLY(120)    */

             CALL       PGM(TVI93C) /* Sendning av EDIfact-eksport */
             MONMSG     MSGID(CPF0001)
/*S01        DLYJOB     DLY(120)    */
/*N01*/      CALL       PGM(QRCVDTAQ) PARM(&QRNAME &QRLIB &QRLEN +
                          &QRFIEL &QWAIT)

             GOTO       CMDLBL(TAG01)

 END:        ENDPGM
