/* 01 JOV KRESL13 FOR OCR */
             PGM
/*______________*/
/* LES FIRMAFIL */
/*""""""""""""""*/
             DCLF       FILE(FIRML1) RCDFMT(*ALL)
             RCVF       DEV(*FILE) RCDFMT(*FILE)
             ADDLIBLE   LIB(&L1STDN) POSITION(*LAST)
             IF         COND(&L1STDN = 'L1STD') THEN(ADDLIBLE +
                          LIB(L1PGM) POSITION(*LAST))
             IF         COND(&L1STDN = 'IBMDAT') THEN(ADDLIBLE +
                          LIB(IBMPGM) POSITION(*LAST))
             ADDLIBLE   LIB(IBMPGM) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             ADDLIBLE   LIB(L1PGM) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             CHGJOB     JOB(*) LOG(4 00 *SECLVL) LOGCLPGM(*YES)

             ADDLIBLE   LIB(MMAIL) POSITION(*LAST)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL01) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL02) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL03) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL04) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL05) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL06) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL07) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL08) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL09) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL10) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KUNDL11) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL01) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL02) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL03) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL04) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL05) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL06) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL07) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL08) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL09) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(LEVEL10) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KODWL01) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
             CHGLF      FILE(KHEDL01) LVLCHK(*NO)
             MONMSG     MSGID(CPF0000)
/*N01*/      CHGLF      FILE(KRESL13) LVLCHK(*NO)
/*N01*/      MONMSG     MSGID(CPF0000)
             CALL       PGM(V12CRTMRG)
             RMVLIBLE   LIB(MMAIL)
             RMVLIBLE   LIB(&L1STDN)
             RMVLIBLE   LIB(L1PGM)
             MONMSG     MSGID(CPF0000)
             RMVLIBLE   LIB(IBMPGM)
             MONMSG     MSGID(CPF0000)

             ENDPGM
