             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             DLTF       FILE(&LIB/EDIS9)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIS9) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(EDIS9) LVLCHK(*NO)

             DLTF       FILE(&LIB/EDIS10)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIS10) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(EDIS10) LVLCHK(*NO)

             DLTF       FILE(&LIB/EDIS12)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIS12) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(EDIS12) LVLCHK(*NO)

             DLTF       FILE(&LIB/EDIS964)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDIS64) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(EDIS64) LVLCHK(*NO)

             DLTF       FILE(&LIB/EDI10F6L1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/EDI10F6L1) +
                          SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(EDI10F6L1) LVLCHK(*NO)

             DLTF       FILE(&LIB/SADFNJL1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SADFNJL1) +
                          SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(SADFNJL1) LVLCHK(*NO)

             DLTF       FILE(&LIB/SADFNJL2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SADFNJL2) +
                          SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(SADFNJL2) LVLCHK(*NO)

             DLTF       FILE(&LIB/SAEFNJL1)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SAEFNJL1) +
                          SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(SAEFNJL1) LVLCHK(*NO)

             DLTF       FILE(&LIB/SAEFNJL2)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/SAEFNJL2) +
                          SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(SAEFNJL2) LVLCHK(*NO)

             DLTF       FILE(&LIB/TRUH15)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRUH15) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(TRUH15) LVLCHK(*NO)

             DLTF       FILE(&LIB/TRUV07)
             MONMSG     MSGID(CPF0000)
             CRTLF      FILE(&LIB/TRUV07) SRCFILE(SYV12_P21/QDDSSRC) +
                          SRCMBR(TRUV07) LVLCHK(*NO)

             ENDPGM
