             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V12 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V12 skal tømmes etter konvertering. */

             CALL       PGM(V12P21_C0A) PARM(&FILNV &FRALIB) /* +
                          Slett alle logiske filer i driftbibliotek. */

             CLRPFM     FILE(&FILNV) /* Tømme fil i SYV12_P21F før +
                          konvertering. */
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(&FILNV) FRCRATIO(*NONE) /* Kopiere data +
                          fra fil i driftbibliotek til fil i +
                          SYV12_P21F. */
             CPYF       FROMFILE(&FRALIB/&FILNV) TOFILE(&FILNV) +
                          MBROPT(*ADD) FROMRCD(1) FMTOPT(*MAP *DROP)
             MONMSG     MSGID(CPF0000)
             IF         COND(&TOMME = 'J') THEN(DO)
             CLRPFM     FILE(&FRALIB/&FILNV) /* Tømme data i fil i +
                          driftbibliotek. */
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALL       PGM(V12P21_C0B) PARM(&FILNV &FRALIB &TILLIB) +
                          /* Kopiere ny fil til driftbibliotek og +
                          bygge nye logiske filer i driftbibliotek. */

             ENDPGM
