             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             CPYF       FROMFILE(SYV12_P21F/SYMENUF) +
                          TOFILE(&LIB/SYMENUF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             CPYF       FROMFILE(SYV12_P21F/UTSKRS) +
                          TOFILE(&LIB/UTSKRS) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)

             ENDPGM
