             PGM        PARM(&FILNV &FRALIB &TILLIB &TOMME)
             DCL        VAR(&FILNV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* +
                          Driftbibliotek */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* +
                          Oppbevareringsbibliotek for datafiler fra +
                          V12 */
             DCL        VAR(&TOMME) TYPE(*CHAR) LEN(1) /* Om datafil +
                          fra V12 skal tømmes etter konvertering. */

             OVRDBF     FILE(KODTSNDR) TOFILE(&FRALIB/KODTSN)
             OVRDBF     FILE(KODTSNNY) TOFILE(SYV12_P21F/KODTSN)

             CALL       PGM(V12P21_R01) /* Kopier nye post inn +
                          KODTSN. */

             ENDPGM
