             PGM        PARM(&FRALIB &TILLIB)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10) /* Fra +
                          bibliotek V11 */
             DCL        VAR(&TILLIB) TYPE(*CHAR) LEN(10) /* Til +
                          bibliotek for datafiler V12 */

             CLRPFM     FILE(&TILLIB/SAEV)
             MONMSG     MSGID(CPF0000)
             CLRPFM     FILE(&TILLIB/V12RE104F)
             MONMSG     MSGID(CPF0000)
             OVRDBF     FILE(SAEV4) TOFILE(&FRALIB/SAEV4)
             OVRDBF     FILE(SAEV) TOFILE(&TILLIB/SAEV)
             CALL       PGM(V12RE104)
             DLTOVR     FILE(SAEV)
             DLTOVR     FILE(SAEV4)

             OVRDBF     FILE(ZAEVV11) TOFILE(&FRALIB/ZAEV)
             OVRDBF     FILE(ZAEV) TOFILE(&TILLIB/ZAEV)
             CALL       PGM(V12RE104Z)
             DLTOVR     FILE(ZAEV)
             DLTOVR     FILE(ZAEVV11)

             ENDPGM
