             PGM        PARM(&FRALIB &SRCLIB)
             DCL        VAR(&FRALIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCLIB) TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000)

             CHGPF      FILE(ARKEPO) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ARKEPOL3) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/BRPARL3) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(EPOKLOG) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/EPOKLOG1) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(HEADF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/HEAD49) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ISOF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ISOFL16) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/KODTLKRE) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(KOSTB) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/KOSTB8) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/LLAGJL14) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/LLHEAD24) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/LLMRFL11) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/LLMRFL12) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(SADH) FRCRATIO(*NONE)
             CHGPF      FILE(SADF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/SADFNJL1) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SADFNJL2) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SADHANL1) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(SAEH) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/SAEH14) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SAEH14B) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(SAEF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/SAEFNJL1) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SAEFNJL2) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SIDUPB6) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/SVIF3) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(TRUH) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/TRUH15) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(TRUV) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/TRUV07) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(TURER) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/TURER24) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/WSSORL08) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ZEADF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ZEADL05U) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ZOKUFM) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ZOKUFM2) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ZOKUFV) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ZOKUFV2) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ZOKUF) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ZOKUF2) SRCFILE(&SRCLIB/QDDSSRC)
             CHGPF      FILE(ZREETXT) FRCRATIO(*NONE)
             CRTLF      FILE(&FRALIB/ZREETXT2) SRCFILE(&SRCLIB/QDDSSRC)
             CRTLF      FILE(&FRALIB/STSCLI4) SRCFILE(&SRCLIB/QDDSSRC)

             ENDPGM
