             PGM        PARM(&LIB)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)

             CPYLIB     FROMLIB(SYV12XF) TOLIB(&LIB)

             ENDPGM
