/* *********************************************************************   */
/*       * RETTINGER I DETTE PROGRAM:                                      */
/* PTFnr:*Sek Sig Vers  Beskrivelse..........................              */
/* """"""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""    */
/* 12318 * 01 CB  PTF12 NY FIL FOR 21 TEGNI I FAKTURANUMMER              */
/* ********************************************************************    */
             PGM        PARM(&AVD &TDN &FLAGG)
             DCL        VAR(&AVD) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&TDN) TYPE(*DEC) LEN(7 0)
             DCL        VAR(&FLAGG) TYPE(*DEC) LEN(1 0)
             OVRDBF     FILE(SADF) TOFILE(SAEF)
/*N01*/      OVRDBF     FILE(SADFFA) TOFILE(SAEFFA)
             CALL       PGM(VISRUB28) PARM(&AVD &TDN &FLAGG)
             DLTOVR     FILE(SADF)
             ENDPGM
