             PGM        PARM(&OUTQ)
             DCL        VAR(&OUTQ)  TYPE(*CHAR) LEN(10)
             OVRPRTF    FILE(ZBARC) PRTQLTY(*NLQ) OUTQ(&OUTQ) +

             CALL       PGM(ZPL002R)

 SLUTT:      ENDPGM
