     H DECEDIT(',') debug(*yes)
      ***********************************************************
      *** PROGRAM for sjekke vedleggsdokument
      ***********************************************************
     Ffirm      IF   E           K DISK
     Ffirmarc   IF   E           K DISK
     FARKEXT    IF   E           K DISK
     FARKTXT    IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     c                   parm                    dokument         40
     c                   parm                    fins              1
      *
     C     arklagk       KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    arklag
     C*
      *
     c                   read      firm                                   33
     c                   read      firmarc                                33
     c     arinf         chain     arktxt                             33
      *
     c                   exsr      fixbane
      *
      * finnes ?
      *
     C                   eval      nyobj=dokument
     c                   call      'SYGE98CL'
     C                   PARM                    ubane
     C                   PARM                    nyobj            50
     c                   parm                    ufins             1
     c                   eval      fins=ufins
     c                   seton                                        lr
     c                   return
      **********************************************************************************
     c     fixbane       begsr
      **********************************************************************************
      * henter   avvikende bane
     C     ARKLAG        IFNE      *blanks
     c     arklagk       chain     arkext
     c                   end
     c                   move      *blanks       ubane           256
     c                   movel     '/'           ubane
     c     arcane        ifne      *blanks
     C     ubane         CAT       arcane:0      ubane
     C     ubane         CAT       '/':0         ubane
     c                   end
     C     ubane         CAT       dokument:0    ubane
     c                   endsr
