********************************************************************
      * RETTINGER I DETTE PROGRAM:
     H DECEDIT(',') debug(*yes)
      ***********************************************************
      *** PROGRAM for endre arkepo til google og laste ned fra google
      ***********************************************************
     Ffirmgoog  IF   E           K DISK
     FARKIVl11  iF   E           K DISK
     FARKEPOL2  UF   E           K DISK
     D                SDS
     D  UUSR                 254    263
      *
     c                   exsr      init
     C     google        ifeq      'J'
     c                   exsr      goog
     c                   end
     c                   seton                                        lr
     c                   return
     C***********************************************
     C     init          BEGSR
     C***********************************************
     C*
     C     *ENTRY        PLIST
     C                   PARM                    URUNDE           10
     c                   parm                    ulink            40
     C     KEY           KLIST
     C                   KFLD                    ARSTAT            1
     C                   KFLD                    ARUNDE
     c                   KFLD                    ARLINK
     C                   MOVE      'A'           ARSTAT
     C                   MOVE      URUNDE        ARUNDE
     C                   MOVE      ULINK         ARLINK
     C     KEY           CHAIN     ARKIVL11
     c                   move      uusr          epuser
     c                   READ      firmgoog                               33
     c  n33              move      'J'           google            1
     c                   endsr
      ****************************************************************************
     c     goog          begsr
      ****************************************************************************
     c     keyusr        klist
     C                   KFLD                    EPUSER
     c                   setoff                                       33
     c     keyusr        setll     arkepol2
     c     *in(33)       doweq     '0'
     c     keyusr        reade     arkepol2                               33
     c     *in(33)       ifeq      '0'
     c                   z-add     1             pos               3 0
     c                   z-add     0             str               3 0
     c                   move      *blanks       DOKFRA           60
     c                   move      *blanks       BANEFRA         100
      * finn dokumentnavn i epbane
     c                   dow       Pos<> 0
     c                   eval      Pos= %SCAN ('/' : EPBANE: Str+1)
     c                   if        Pos<> 0
     c                   eval      Str= Pos
     c                   endif
     c                   enddo
     c                   eval      DOKFRA    = %subst(EPBANE:Str+1)
     c                   moveL     DOKFRA        WRKTYP            2
     c                   eval      BANEFRA   = %subst(EPBANE:1:Str)
      * tempmappe
     c                   eval      gotmpf100=gotmpf
     c                   eval      epbane=%trim(gotmpf) + %trim(dokfra)
      * fikser eplink epline
     c                   eval      eplink=%trim(golenk) + %trim(dokfra)
     c                   eval      epline=%trim(golene) + %trim(dokfra)
     c                   eval      uNewFile=*blanks
      * last ned fil til temp
      * hoveddokument er allerede i tempmappen
     c                   call      'ARC99WSD1'
     c                   parm                    gobuid           10
     c                   parm                    gotmpf100       100
     c                   parm                    dokfra           60
     c                   parm                    uNewFile         60
     c                   parm                    uok               1
     c     uok           ifeq      'J'
     c                   update    arkepor
     c                   end
      * allerede i tmp mappen
     c                   end
     c                   enddo
     C                   endsr
