********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      * xx SH  PTF12
********************************************************************
      *
      ***********************************************************
      *** PROGRAM Som viser arkiverte dokumenter              ***
      ***********************************************************
      *
     FARKEXT    IF   E           K DISK
     FARKTXT    IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FFIRM      IF   E           K DISK
     C*
     C     arklagk       KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    arKLAG
     C     arkTXTk       KLIST
     C                   KFLD                    arINF
     c                   read      firm                                   33
     C                   READ      FIRMARC                                33
     C     ARKTXTK       CHAIN     ARKTXT                             33
      * AVVIKENDE BANE
     C     ARKLAG        IFNE      *BLANKS
     c     arklagk       chain     arkext                             33
     C                   END
     c     arcane        cat       '/*':0        ARCANE
     C                   CALL      'ARC046CL'
     C                   PARM                    ARCANE
     C                   SETON                                        LR
     C                   RETURN
