********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 sletter ved blank arkivlenke
10XXX * 02 SH  PTF11 ikke legg på pdf hvis . i lenke
10XXX * 03 SH  PTF11 spesial ve *m merged dokumenter
10XXX * 04 SH  PTF12 høyde for avvikende bane
10XXX * 05 SH  PTF12 returnere ved google
********************************************************************
      *
      ***********************************************************
      *** sletter dokumenter etter x dageer
      ***********************************************************
N05  Ffirmgoog  IF   E           K DISK
     FARKEXT    IF   E           K DISK
     Farktxt    IP   E             DISK
     Farkivl07  UF   E           K DISK
     Ffirm      IF   E           K DISK
     Ffirmarc   IF   E           K DISK
     D                 DS
     D  DSTID                  1     14  0
     D  UDATO                  1      6  0
     D  UDAG                   7      8  0
     D  UMND                   9     10  0
     D  UAAR                  11     14  0
     D                 DS
     D  tilpera                1      8
     D  tilper                 1      8s 0
     D  wsatil                 1      4s 0
     D  wsptil                 5      6s 0
     D  wsdtil                 7      8s 0
     C*
     C                   EXSR      INIT
      *
      * sletter PDF
      * hvis dager er utfyllt i tekstfile
      *
     c     arkdag        ifne      *zeros
n03  c     arTYPE        ifeq      '*m'
n03  c                   move      arkdag        arkdaga           5
n03  c                   call      'ARC054C'
n03  c                   parm                    arcane
n03  c                   parm                    arkdaga
n03  c                   else
     c                   z-add     ARKDAG        dager             5 0
     c                   EXSR      dokini
     c                   EXSR      DELPDF
n03  c                   end
     c                   end
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
n04  C     arklagk       KLIST
n04  C                   KFLD                    fifirm
n04  C                   KFLD                    arklag
     c     keypdf0       klist
     c                   kfld                    fifirm
     c                   kfld                    artype
     c                   kfld                    stdato
     c     keypdf1       klist
     c                   kfld                    fifirm
     c                   kfld                    artype
     C                   TIME                    DSTID            14 0
     c                   move      udag          wsdtil
     c                   move      umnd          wsptil
     c                   move      uaar          wsatil
     c                   move      'SUB'         funk              3
     c                   read      firm                                   33
     c                   read      firmarc                                33
N05  c     fifirm        chain     firmgoog                           44
N05  c     *in44         ifeq      '0'
N05  c                   seton                                        lr
n05  c                   return
n05  c                   end
     C*
     c                   endsr
     c*************************************************************************
     c     dokini        begsr
     c*************************************************************************
     c                   move      *blanks       bane             40
     c                   move      *blanks       umappe           15
     c                   move      *zeros        tilper
     C*
     c                   move      tilper        udatop            8 0
     c                   call      'SYGE20'
     c                   parm                    funk
     c                   parm                    udatop
     c                   parm                    nydato            8 0
     c                   parm                    dager
     C                   ENDSR
     C*
     C***********************************************
     C     DELPDF        BEGSR
     C***********************************************
     C*
     c                   setoff                                       34
     c                   move      *zeros        stdato            8 0
     c     keypdf0       setll     arkivl07
     c     *in(34)       doweq     '0'
     c     keypdf1       reade     arkivl07                               34
     c  N34ARDATE        comp      nydato                             34
     c     *in(34)       ifeq      '0'
S01  c*    arlink        andne     *blanks
     c                   delete    arkivr
     c     arlink        ifne      arlinkfo
     c     arlink        andne     *blanks
     c                   exsr      delpdf2
     c                   end
     c                   move      arlink        arlinkfo         40
     c                   end
     c                   end
     c                   endsr
     C*
     C***********************************************
     C     DELPDF2       BEGSR
     C***********************************************
     C*
N04  C     ARKLAG        IFNE      *blanks
N04  c     arklagk       chain     arkext
N04  c                   else
N04  c     fifirm        chain     firmarc                            33
N04  c                   end
     c                   move      *blanks       fradok           70
     c                   movel     arcane        fradok
     C     fradok        CAT       '/':0         fradok
     C     fradok        CAT       arlink:0      fradok
N02  C     '.'           SCAN      arlink        X                 3 0    20
N02  C     X             IFEQ      *ZEROS
     C     fradok        CAT       '.pdf':0      fradok
N02  c                   end
     c                   call      'ARC041C1'
     c                   parm                    fradok
     c                   endsr
