********************************************************************
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      * program som slår sammen PDF'er
      *
********************************************************************
      *
     FARKLOGM   IF   E           K DISK
     D                 DS
     D  data                   1   6400
     D  dta                    1   6400
     D                                     DIM(80)
     C*
     C     *ENTRY        PLIST
     c                   parm                    uunik            11
     c                   parm                    dokmrg           40
     c                   movel     uunik         uunik7            7 0
     c                   z-add     uunik7        emunik

     C     key           klist
     c                   kfld                    emunik
     c     key           setll     arklogm
     c     *in33         doweq     '0'
     c     key           reade     arklogm                                33
     c     *in33         ifeq      '0'
     c                   add       1             nr                3 0
     c                   eval      dta(nr)=embane
     c                   end
     c                   enddo
     c     nr            ifgt      1
     c                   call      'SYGE123'
     c                   PARM                    UUNIK
     C                   PARM                    DOKMRG           40
     c                   parm                    data
     c                   end
      *
     c     slutt         tag
     c                   seton                                        lr
     c                   return
      *
