      ***********************************************************
      *** sende levfakturaer for et år                        ***
      ***********************************************************
      *
     FARC047FM  CF   E             WORKSTN
     FLREHL02   IF   E           K DISK
     Ffirm      IF   E           K DISK
     FARKivl06  IF   E           K DISK
     FARKEPOW   UF A E           K DISK
     D                SDS
     D  UUSER                254    263
N04   *
     c                   exsr      init
      *
     c                   exfmt     BILDE01
      *
     c     lrekey        setll     lrehl02
     c     *in33         doweq     '0'
     c     lrekey        reade     lrehl02                                33
     C     *IN33         IFEQ      '0'
     c     ptyp          andeq     'K'
     c                   movel     'L1:'         arunde
     c                   move      bilnr         arunde
     c     arkkey        chain     arkivl06                           34
     C     *IN34         IFEQ      '0'
     c                   move      *blanks       epbane          140
     C                   EVAL      EPBANE='/asp/ass/' +
     C                             ARLINk
     c                   move      'N'           epmain
     c                   move      uuser         epuser
     c                   move      bilnr         bilnra            7
     c                   eval      eptex1='Bilag:' +  BILNRA
     c                   move      krdaar        krdaara           4
     c                   move      krdmnd        krdmnda           2
     c                   move      krddag        krddaga           2
     c                   eval      eptex2='dato:' +
     c                             krddaga + '/' + krdmnda +
     c                             '/' + krdaara
     c                   write     arkepor
     C                   END
     C                   END
     C                   ENDDO
     c                   call      'ARC004'
n12  c                   parm                    aavd              4
n12  c                   parm                    aopd              7
n12  c                   parm                    atur              8
n12  c                   parm                    akun              8
     C                   SETON                                        LR
     C                   RETURN
     C***********************************************
     C     toemm         BEGSR
     C***********************************************
     c                   setoff                                       34
     c     keyep2        setll     arkepow
     c     *in(34)       doweq     '0'
     c     keyep2        reade     arkepow                                34
     C*
     c     *in(34)       ifeq      '0'
     c                   delete    arkepor
     c                   end
     c                   end
     c                   endsr
     C***********************************************
     C     init          BEGSR
     C***********************************************
      *
      * tømmer workfil
      *
     c                   read      firm                                   40
     c                   exsr      toemm
      *
     C     arkkey        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    artype
     C                   KFLD                    arunde
     C     keyep2        KLIST
     C                   KFLD                    UUSER
     C     lrekey        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    wslnr
     C                   KFLD                    wsaar
     C                   MOVE      'ZB'          ARTYPE
     c                   z-add     0             ant               2 0
     c                   endsr
