     FARKIVP    IF   E             disk
     D pos             S              5U 0
     C                   READ      ARKIVP                                 51
     C     *IN51         DOWEQ     *OFF
     C     ARDATE        IFGE      20180101
     C     ARTYPE        IFEQ      'sd'
     C     ARTYPE        OREQ      'se'
     C     ARTYPE        OREQ      'sf'
     C     ARTYPE        OREQ      'sg'
     C     ARTYPE        OREQ      'si'
     C     ARTYPE        OREQ      'sk'
     C     ARTYPE        OREQ      'sl'
     C     ARTYPE        OREQ      's1'
     C     ARTYPE        OREQ      's2'
     C*    ARTYPE        OREQ      'ZH'
     c                   eval      Companyid = 'a49'
     c                   eval      UlocalPath= '/a49tmp/'
     c                   eval      Newfile   = *blanks
     c                   eval      Uok       = 'x'
     c                   EVAL      UarLink   = *BLANKS
     c                   MOVEL     ARLINK        Uarlink
      /free
          pos = %scan ('.' : Uarlink);
      /end-free
     C                   IF        POS=*ZEROS
     C     UARLINK       CAT(P)    '.pdf':0      UARLINK
     C                   ENDIF
     c
     c                   call      'ARC99WSD1'
     c                   parm                    Companyid        10
     c                   parm                    UlocalPath      100
     c                   parm                    uarlink          60
     c                   parm                    NewFile          60
     c                   parm                    uok               1
     C                   ENDIF
     C                   ENDIF
     C                   READ      ARKIVP                                 51
     C                   ENDDO
      *
     c                   move      *on           *inLr
     c                   return
