      * companyid=a53&filename=ZH202314240263198dl4uavj8Wp.PDF
     c                   eval      Companyid = 'sytst'
     c                   eval      UlocalPath= '/tmp/'
     c                   eval      UarLink   = 'si202400010091401aUhAumIyP2.pdf'
     c*                  eval      UarLink   = 'ZH20241155973iP93NwnhNQ.pdf'
     c*                  eval      UarLink   = 'Test_JOV.pdf'
     c*                  eval      UarLink   = 'si202114320238557pd67QN10sh.pdf'
     c*                  eval      UarLink   = 'xxxxx114320238557pd67QN10sh.pdf'
     c*                  eval      UarLink   = '1592009063820211129105126.xml'
     c*                  eval      UarLink   = 'se202115940347612WiL3Rj6Bgf.pdf'
     c                   eval      Newfile   = *blanks
     c                   eval      Uok       = 'x'
     c                   call      'ARC99WSD1X'
     c                   parm                    Companyid        10
     c                   parm                    UlocalPath      100
     c                   parm                    uarlink          60
     c                   parm                    NewFile          60
     c                   parm                    uok               1
      *
     c                   move      *on           *inLr
     c                   return
