      *
     c                   eval      url = 'http://10.11.47.61:9886/api/files?'
     C                                 + 'companyid=a53&filename='
     c                                 + 'si202114320238557pd67QN10sh.pdf'
     c                   eval      Uok       = 'x'
     c                   call      'ARC99WSE1'
     c                   parm                    url             256
     c                   parm                    uok               1
      *
     c                   move      *on           *inLr
     c                   return
