      *'/asp/a51/si2023001000462088he8GTuog5.pdf'
     c                   eval      Companyid = 'a51'
     c                   eval      UlocalPath= '/asp/a51/'
     c*                  eval      UlocalPath= '/tmp/'
     c                   eval      SrcFile   = 'si2023001000462088he8GTuog5.pdf'
     c                   eval      udelete   = 'J'
     c                   eval      uok       = 'x'
     c                   call      'ARC99WSU1'
     c                   parm                    Companyid        10
     c                   parm                    UlocalPath      100
     c                   parm                    SrcFile         120
     c                   parm                    udelete           1
     c                   parm                    NewFile          60
     c                   parm                    uok               1
      *
     c                   move      *on           *inLr
     c                   return
