      * companyid=a53&filename=ZH202314240263198dl4uavj8Wp.PDF
     c                   eval      Companyid = 'sytst'
     c                   eval      UlocalPath= '/tmp/'
     c                   eval      UarLink   = 'ZH20241155973iP93NwnhNQ.pdf'
     c                   eval      Newfile   = *blanks
     c                   eval      Uok       = 'x'
     c                   call      'ARC99WSD1G'
     c                   parm                    Companyid        10
     c                   parm                    UlocalPath      100
     c                   parm                    uarlink          60
     c                   parm                    NewFile          60
     c                   parm                    uok               1
      *
     c                   move      *on           *inLr
     c                   return
