N13  FFIRMGOOG  IF   E           K DISK
      *""""""""""""""""
     D DirName         S            100A
     D EntryName       S            120A
     D EntryPath       S            256A
      *
     C     *entry        PLIST
     C                   PARM                    DirName
     C                   PARM                    EntryName
     C                   PARM                    EntryPath
      *
     c     *loval        setll     FIRMGOOG
     c                   read      FIRMGOOG
n13  C                   if        not %eof and GOBUID <> *blanks
n13  c                   eval      Companyid = GOBUID
     c                   eval      UlocalPath= %trim(DirName) + '/'
     c                   eval      SrcFile   = EntryName
     c                   eval      NewFile   = *blanks
     c                   eval      udelete   = 'J'
     c                   eval      uok       = 'x'
     c                   call      'ARC99WSU1'
     c                   parm                    Companyid        10
     c                   parm                    UlocalPath      100
     c                   parm                    SrcFile         120
     c                   parm                    udelete           1
     c                   parm                    NewFile          60
     c                   parm                    uok               1
      *
     c                   endif
      *
     c                   move      *on           *inLr
     c                   return
