      *
      ***********************************************************
      *** PROGRAM SKAL hente inst-info om TRKpdfHandler       ***
      ***********************************************************
      *
     FFIRM      IF   E           K DISK
     FFIRMARC   IF   E           K DISK
N04  FFIRMARCSI IF   E           K DISK
     C*
     C     *entry        plist
     C                   parm                    UINSTAL           1
     C                   parm                    USERVER          40
     C                   parm                    UUSER            10
     C                   parm                    ULOGLVL           5
     C                   parm                    UROOT            30
     C                   parm                    USDEV            30
N04
     C                   move      *blanks       UINSTAL
     C                   move      *blanks       UUSER
     C                   move      *blanks       ULOGLVL
     C                   move      *blanks       UROOT
     C                   eval      USDEV ='syspeddev'
N04
N04
     c                   READ      FIRM                                   30
     C                   if        %subst(FILIBF:1:1)='A'
     C                   eval      USDEV ='aspsyspeddev'
     C                   endif
     c                   move      fifirm        arcfir                         ASSSYSPEDF->A99SYSP.
     c     arcfir        chain     firmarc                            33
N04
     c                   eval      USERVER='http://'+ARCPAD                     Server(intern IP)
N04
N05  c     'KJ'          chain     firmarcsi                          33        kjører/benyttes
N05  c  N33              movel     ASIANE        UINSTAL
N05
N05  c     'EU'          chain     firmarcsi                          33        eSped userID
N05  c  N33              movel     ASIANE        UUSER
N05   *
N05  c     'LL'          chain     firmarcsi                          33        Log Level
N05  c  N33              movel     ASIANE        ULOGLVL
N04   *
N04  c     'RO'          chain     firmarcsi                          33        Rotmappe
N04  c                   move      ASIANE        UROOT                          dft /sysca
      *
      * Ved J = Java-versjon MÅ server/user/loglvl/root være oppgitt
     C                   if        UINSTAL = 'J'
     C                   if        UUSER   = *blanks or
     C                             ULOGLVL = *blanks or
     C                             UROOT   = *blanks
     C                   eval      UINSTAL = 'N'
     C                   endif
     C                   endif
      * Ved P = PC-versjon MÅ root være oppgitt
     C                   if        UINSTAL = 'P'
     C                   if        UROOT   = *blanks
     C                   eval      UINSTAL = 'N'
     C                   endif
     C                   endif
      *
     C                   SETON                                        LR
     C                   RETURN
     C*
