     H DECEDIT(',') debug(*yes)
N19  Fedim2     IF   E           K DISK
N19  Fkodta     IF   E           K DISK
N19  Fcundl01   IF   E           K DISK
     D                 DS
     D  M0068AI                1      8  0
     D  AARS                   1      4  0
     D  MNDS                   5      6  0
     D  DAGS                   7      8  0
     D                 DS
     D  BARCOD                 1     25
     D  FORET                  1      9
     D  strek1                10     10
     D  dag                   11     12
     D  mnd                   13     14
     D  aar                   15     18
     D  strek2                19     19
     D  sekvens               20     25
     C     *entry        plist
     c                   parm                    fifirm            2
     C                   parm                    siavd             4 0
     C                   parm                    sitdn             7 0
     c                   parm                    barcodu          25
     c     key0          klist
     c                   kfld                    siavd
     c                   kfld                    sitdn
     c     key1          klist
     c                   kfld                    fasta             1
     c                   kfld                    siavd
     c     key2          klist
     c                   kfld                    fifirm
     c                   kfld                    koaknr
     c                   move      'A'           fasta
     c                   move      '-'           strek1
     c                   move      '-'           strek2
     c     key0          setgt     edim2
     c     key0          readpe    edim2                                  33
     c     *in33         ifeq      '0'
     c                   movel     m0068a        m0068ai
     c                   move      m0068b        sekvens
     c                   move      aars          aar
     c                   move      mnds          mnd
     c                   move      dags          dag
     c     key1          chain     kodta                              33
     c     *in33         ifeq      '0'
     c     key2          chain     cundl01                            33
     c     *in33         ifeq      '0'
     c                   movel     syrg          foret
     c                   move      barcod        barcodu
     c                   end
     c                   end
     c                   end
     c*                  dump
     c                   seton                                        lr
     c                   return
