********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 JOV PTF12 Oppdater også HESTL4 (P = protect tot-linje)
********************************************************************
     FHEADF     UF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4 0
     C                   PARM                    UUOPD             7 0
      *
     C                   MOVE      UUAVD         XXAVD             4 0
     C                   MOVE      UUOPD         XXOPD             7 0
     C     HeaKey        KLIST
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
     c     *like         define    HEVKT         XXVKT
     c     *like         define    HEM3          XXM3
     c     *like         define    HELM          XXLM
     c     *like         define    HEFBV         XXFBV
N01  c     *like         define    HESTL4        xxSTL4                         'P'=Protect Tot-lin
      *
     C     HeaKey        chain(N)  HEADF                              33
     C     *in33         ifeq      *off
     c                   eval      XXVKT =  HEVKT
     c                   eval      XXM3  =  HEM3
     c                   eval      XXLM  =  HELM
     c                   eval      XXFBV =  HEFBV
N01  c                   eval      XXSTL4=  HESTL4
     C     TROPD1        IFNE      0
     C                   MOVE      TRAVD1        XXAVD
     C                   MOVE      TROPD1        XXOPD
     C                   EXSR      OPDDUP
     c                   endif
     C     TROPD2        IFNE      0
     C                   MOVE      TRAVD2        XXAVD
     C                   MOVE      TROPD2        XXOPD
     C                   EXSR      OpdDup
     c                   endif
     c                   endif
      *
     C     UT            TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     OpdDup        BEGSR
     C***********************************************
      *
      *
     C     HeaKey        chain     HEADF                              33
     C     *in33         ifeq      *off
     c                   eval      HEVKT = XXVKT
     c                   eval      HEM3  = XXM3
     c                   eval      HELM  = XXLM
     c                   eval      HEFBV = XXFBV
N01  c                   eval      HESTL4= XXSTL4
     c                   update    HEADFR
     C                   endif
      *
     C                   endsr
