     FCPYF_4SIFDCF   E             WORKSTN
     FSYPTFF    IF A E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UOK               1
     C                   PARM                    WSFRA
     C                   PARM                    WSTIL
     C                   PARM                    WSLOG
      *
     C     'TVI00011'    CHAIN     SYPTFF                             33
     C                   IF        *IN33
     C                   EVAL      PTFNR  = 'TVI00011'
     C                   EVAL      PTFDT  = 20230101
     C                   EVAL      PTFTXT = '4 siffer prosedyre og '
     C                             + '2 siffer transaksjonstype'
     C                   WRITE     SYPTFR
     C                   END
      *
     C                   SELECT
     C                   WHEN      UOK = '1'
     C                   EVAL      WSFRA = 'SYSPEDF'
     C                   EVAL      WSTIL = 'SY4SIF_F'
     C                   EVAL      WSLOG = 'SY4SIF_L'
     C                   WHEN      UOK = '2'
     C                   EVAL      WSFRA = 'SYSPEDF'
     C                   EVAL      WSTIL = 'SY4SIF_FSV'
     C                   EVAL      WSLOG = 'SY4SIF_LSV'
     C                   ENDSL
     C                   EVAL      UOK   = 'N'
      *
     C     START         TAG
     C                   EXFMT     BILDE01
      *
     C   03              GOTO      SLUTT
      *
     C                   EVAL      WSJN = 'N'
     C                   EXFMT     BILDE02
     C                   IF        WSJN = 'N' OR *IN12
     C                   GOTO      START
     C                   END
      *
     C                   EVAL      UOK   = 'J'
      *
     C     SLUTT         TAG
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
