**free
CTL-OPT DFTACTGRP(*NO)
dcl-ds UUID_Template_T qualified template;
       bytesProv uns(10) inz(%size(UUID_Template_T));
       bytesAvail uns(10) inz(0);
       version uns(3) inz(0);
       *n char(7) inz(*allx'00');
       uuid char(16) inz(*allx'00');
end-ds;

    dcl-pr GENUUID_MI extproc('_GENUUID');
       template likeds(UUID_Template_T);
    end-pr;

    dcl-ds UUID_Template likeds(UUID_Template_T) inz(*LIKEDS);

    UUID_Template.version = 1;
    GENUUID_MI (UUID_Template);

     dump(a);

    UUID_Template.version = 4;
    GENUUID_MI (UUID_Template);

         dump(a);
        return;
