     FTURER     IF   E           K DISK
     C                   READ      TURER
     C                   CALL      'DIG01R'
     C                   PARM      1             TUAVD
     C                   PARM      24317164      TUPRO
     C                   PARM      'CB '         SIGN              3
     C                   EVAL      *INLR=*ON
