     FDKEA      IF   E           K DISK
     FFIRMARC   IF   E             DISK
     FDKE031FS  O  A F  512        DISK
     C     *LIKE         DEFINE    DKEA_SYAV     WAVDN
     C     *LIKE         DEFINE    DKEA_FTIP     WIP
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    WAVDA             4
     C                   PARM                    WFILE            26
     C                   PARM                    WIP
     C                   MOVE      WAVDA         WAVDN
     C     WAVDN         CHAIN     DKEA                               20
     C                   EVAL      WIP=DKEA_FTIP
     C                   READ      FIRMARC
      * USERID AND PASSWORD RECORD
N02  C                   MOVEL(P)  DKEA_US       DATA            512
     C                   CAT       DKEA_PW:1     DATA
     C                   EXCEPT    AWRK
      * bin
     C                   MOVEL(P)  'bin'         DATA
     C                   EXCEPT    AWRK
      * sendepsv 0
     C                   MOVEL(P)  'sendepsv 0'  DATA
     C                   EXCEPT    AWRK
      * NAMEFMT
     C                   MOVEL(P)  'NAMEFMT 1'   DATA
     C                   EXCEPT    AWRK
      * LCD
     C                   MOVEL(P)  'lcd /'       DATA
     C                   CAT       ARCANE:0      DATA
     C                   EXCEPT    AWRK
      * CD
     C                   MOVEL(P)  'cd /'        DATA
     C                   CAT       'qsys.lib/':0 DATA
     C                   CAT       'qgpl.lib':0  DATA
     C                   EXCEPT    AWRK
      * PUT
     C                   MOVEL(P)  'PUT'         DATA
     C                   CAT       WFILE:1       DATA
     C                   CAT       DKEA_PRTF:1   DATA
     C                   EXCEPT    AWRK
      * QUIT
     C                   MOVEL(P)  'quit'        DATA
     C                   EXCEPT    AWRK
     C                   MOVE      '1'           *INLR
     ODKE031FS  EADD         AWRK
     O                       DATA               512
