      * Merk at SKAT i DK ikke krever kontrollsigger mm (som TDS/TESS i Sverige - se SVG001R)
     FSYPARL1   UF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    TollID           13
      *
     C     SyParKey      KLIST
     C                   KFLD                    SYKUNR
     C                   KFLD                    SYPAID
     c                   eval      SYPAID = 'DKTID'
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *                                                       SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      * Hent Prefix/ neste nummer
     C     SyParKey      CHAIN     SYPARL1
     c                   if        %found(SYPARL1)
     C                   ADD       1             SYVRDN
     C                   UPDATE    SYPARFR
     C                   z-add     SYVRDN        LNR_N             8 0
     C                   move      LNR_N         LNR_A             8
     c                   eval      TollID =%trim(SYVRDA)+LNR_A
     c                   endif
      *
     C                   ENDSR
