********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 CB  PTF11 Flere segment i CUSRES
11XXX * 02 YBC PTF10 DGS-SEGMENT
11XXX * 03 YBC PTF10 MANGLE LOC-SEGMENT VED CUSRES
12274 * 04 YBC PTF12 Program er kopi av 96A. Mangle mange segment i IFCSUM.
      *              NAD 04, CTA 05 og COM 05, RFF 06 og DTM 06, RFF 16 og DTM 16,
      *              GIN 41 (etter PIA 41), SEQ 52 (etter SGP 52), CUX 54 (etter TCC 54)
12XXX * 05 YBC PTF12 Fiks IFTSTA. OBS!!!! E113r_96BA og CE11R96B2 må fikses på gruppe !!!
********************************************************************
     FEDIRE     IF   E           K DISK
     FEALC96B   O  A E             DISK
     FECNI96B   O  A E             DISK
     FECNT96B   O  A E             DISK
     FECOM96B   O  A E             DISK
     FECPI96B   O  A E             DISK
     FECST96B   O  A E             DISK
     FECTA96B   O  A E             DISK
     FECUX96B   O  A E             DISK
     FEDGS96B   O  A E             DISK
     FEDIM96B   O  A E             DISK
     FEDOC96B   O  A E             DISK
     FEDTM96B   O  A E             DISK
     FEEQA96B   O  A E             DISK
     FEEQD96B   O  A E             DISK
     FEEQN96B   O  A E             DISK
     FEERC96B   O  A E             DISK
     FEERP96B   O  A E             DISK
     FEFII96B   O  A E             DISK
     FEFTX96B   O  A E             DISK
     FEGDS96B   O  A E             DISK
     FEGID96B   O  A E             DISK
     FEGIN96B   O  A E             DISK
     FEGIR96B   O  A E             DISK
     FEGIS96B   O  A E             DISK
     FEGOR96B   O  A E             DISK
     FEHAN96B   O  A E             DISK
     FEIMD96B   O  A E             DISK
     FELIN96B   O  A E             DISK
     FELOC96B   O  A E             DISK
     FEMEA96B   O  A E             DISK
     FEMOA96B   O  A E             DISK
     FENAD96B   O  A E             DISK
     FEPAC96B   O  A E             DISK
     FEPAT96B   O  A E             DISK
     FEPCD96B   O  A E             DISK
     FEPCI96B   O  A E             DISK
     FEPIA96B   O  A E             DISK
     FEPRI96B   O  A E             DISK
     FEQTY96B   O  A E             DISK
     FERCS96B   O  A E             DISK
     FERFF96B   O  A E             DISK
     FERNG96B   O  A E             DISK
     FERTE96B   O  A E             DISK
     FESEL96B   O  A E             DISK
     FESGP96B   O  A E             DISK
     FESTS96B   O  A E             DISK
     FETAX96B   O  A E             DISK
     FETCC96B   O  A E             DISK
     FETDT96B   O  A E             DISK
     FETMD96B   O  A E             DISK
     FETMP96B   O  A E             DISK
     FETOD96B   O  A E             DISK
     FETPL96B   O  A E             DISK
     FETSR96B   O  A E             DISK
     D NU              S              1    DIM(15)
      *____________________________________________________________
      * Syntax of message
      * POS 1-6=MSGTYPE    7-9=SEGM   10-11=GROUP 12-12 LEVEL
      * 13-13=HEADING SEG OF A NEW GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
S04  D*SYN             S             13    DIM(706) CTDATA PERRCD(1)
S05  D*SYN             S             13    DIM(716) CTDATA PERRCD(1)
N05  D SYN             S             13    DIM(722) CTDATA PERRCD(1)
      *____________________________________________________________
      * Last SEG of each BREAK GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SEG             S              5    DIM(9)
      *____________________________________________________________
      * Last SEG of each level FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SE1             S              3    DIM(99)
     D SE2             S              3    DIM(99)
     D SE3             S              3    DIM(99)
     D SE4             S              3    DIM(99)
     D SE5             S              3    DIM(99)
     D SE6             S              3    DIM(99)
     D SE7             S              3    DIM(99)
     D SE8             S              3    DIM(99)
      *____________________________________________________________
      * COUNTER of each SEG, LVL FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D RE1             S              5  0 DIM(99)
     D RE2             S              5  0 DIM(99)
     D RE3             S              5  0 DIM(99)
     D RE4             S              5  0 DIM(99)
     D RE5             S              5  0 DIM(99)
     D RE6             S              5  0 DIM(99)
     D RE7             S              5  0 DIM(99)
     D RE8             S              5  0 DIM(99)
     D                 DS
     D  TVIKEY                 1      9
     D  TVIMSG                 1      6
     D  TVISEG                 7      9
     D                 DS
     D  SYNKEY                 1     13
     D  SYNKE2                 1      9
     D  SYNMSG                 1      6
     D  SYNSRP                 7     11
     D  SYNSEG                 7      9
     D  SYNGRP                10     11  0
     D  SYNLVL                12     12  0
     D  SYNBKP                13     13
     D LDADTA         UDS          1024
     D  FE                     1    256
     D                                     DIM(256)
     D  FELT                   1    256
     D  AA                   301    380
     D                                     DIM(80)
     D  AADS                 301    380
     D  AB                   401    480
     D                                     DIM(80)
     D  ABDS                 401    480
     D  U0065                501    506
     D  SEGNAM               507    509
     D  TN                   601    602  0
     D  EOF                  603    605
     D  TEGN                 606    606
     D  LOKAHE               607    607
     D  UMN                  608    616  0
     D  UMBR                 617    626
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C     SEGSTA        TAG
     C  N91              EXSR      GETSEG
     C   91              GOTO      SLUTT
     C                   EXSR      SEGSYN
     C     SEGNAM        CABEQ     'UNB'         SLUTT
     C     SEGNAM        CABEQ     'UNH'         SLUTT
     C     SEGNAM        CABEQ     'BGM'         SLUTT
     C     SEGNAM        CABEQ     'UNT'         SLUTT
     C     SEGNAM        CABEQ     'UNZ'         SLUTT
     C     SEGNAM        CABEQ     'UNS'         SEGSTA
      *
     C     SEGNAM        CASEQ     'ALC'         ALC
     C     SEGNAM        CASEQ     'CNT'         CNT
     C     SEGNAM        CASEQ     'CNI'         CNI
     C     SEGNAM        CASEQ     'COM'         COM
     C     SEGNAM        CASEQ     'CPI'         CPI
     C     SEGNAM        CASEQ     'CST'         CST
     C     SEGNAM        CASEQ     'CTA'         CTA
     C     SEGNAM        CASEQ     'CUX'         CUX
N02  C     SEGNAM        CASEQ     'DGS'         DGS
     C     SEGNAM        CASEQ     'DIM'         DIM
     C     SEGNAM        CASEQ     'DOC'         DOC
     C     SEGNAM        CASEQ     'DTM'         DTM
     C     SEGNAM        CASEQ     'EQA'         EQA
     C     SEGNAM        CASEQ     'EQD'         EQD
     C     SEGNAM        CASEQ     'EQN'         EQN
     C     SEGNAM        CASEQ     'ERC'         ERC
     C     SEGNAM        CASEQ     'ERP'         ERP
     C     SEGNAM        CASEQ     'FII'         FII
     C     SEGNAM        CASEQ     'FTX'         FTX
     C     SEGNAM        CASEQ     'GDS'         GDS
     C     SEGNAM        CASEQ     'GID'         GID
     C     SEGNAM        CASEQ     'GIN'         GIN
     C     SEGNAM        CASEQ     'GIR'         GIR
     C     SEGNAM        CASEQ     'GIS'         GIS
     C     SEGNAM        CASEQ     'HAN'         HAN
     C     SEGNAM        CASEQ     'IMD'         IMD
     C     SEGNAM        CASEQ     'LOC'         LOC
     C     SEGNAM        CASEQ     'LIN'         LIN
     C     SEGNAM        CASEQ     'MEA'         MEA
     C     SEGNAM        CASEQ     'MOA'         MOA
     C     SEGNAM        CASEQ     'NAD'         NAD
     C     SEGNAM        CASEQ     'PAC'         PAC
     C     SEGNAM        CASEQ     'PAT'         PAT
     C     SEGNAM        CASEQ     'PCD'         PCD
     C     SEGNAM        CASEQ     'PCI'         PCI
     C     SEGNAM        CASEQ     'PIA'         PIA
     C     SEGNAM        CASEQ     'PRI'         PRI
     C     SEGNAM        CASEQ     'QTY'         QTY
     C     SEGNAM        CASEQ     'RCS'         RCS
     C     SEGNAM        CASEQ     'RFF'         RFF
     C     SEGNAM        CASEQ     'RNG'         RNG
     C     SEGNAM        CASEQ     'RTE'         RTE
     C     SEGNAM        CASEQ     'SEL'         SEL
     C     SEGNAM        CASEQ     'SGP'         SGP
     C     SEGNAM        CASEQ     'STS'         STS
     C     SEGNAM        CASEQ     'TAX'         TAX
     C     SEGNAM        CASEQ     'TCC'         TCC
     C     SEGNAM        CASEQ     'TDT'         TDT
     C     SEGNAM        CASEQ     'TMD'         TMD
     C     SEGNAM        CASEQ     'TMP'         TMP
     C     SEGNAM        CASEQ     'TOD'         TOD
     C     SEGNAM        CASEQ     'TPL'         TPL
     C     SEGNAM        CASEQ     'TSR'         TSR
      *
     C                   END
     C                   GOTO      SEGSTA
     C     SLUTT         TAG
     C                   OUT       LDADTA
     C                   MOVE      *IN91         WIN91
     C                   MOVE      *IN99         WIN99
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *DTAARA       DEFINE    *LDA          LDADTA
     C                   IN        LDADTA
      * INIT AV ARBEIDSFELT
     C                   MOVE      *ZEROS        NUMVRD           15 0
     C                   MOVE      *ZEROS        NUTEGN            1 0
     C     *LIKE         DEFINE    *IN91         WIN91
     C     *LIKE         DEFINE    *IN99         WIN99
     C     *LIKE         DEFINE    SYNLVL        WL
     C                   MOVEL     'UNOC'        TABLE            10
     C                   MOVEL     '*LIBL'       LIB              10
     C                   Z-ADD     80            LEN               5 0
     C                   MOVE      *BLANKS       STRING           80
      *
      * Datafelt AB i EDIRE (80 lang) går rett inn i array AB ved READ
      * TN=81 soerger for automatisk overflyt array AB->AA ved kall av GETCH
     C                   MOVE      '0'           *IN98
      * Spesielt reserverte tegn defineres her med både grafisk verdi og
      * med en logisk verdi. Den grafiske verdien testes det mot i rutinen
      * som henter tegn. Finner denne rutinen at at tegnet er ment som en
      * spesialverdi (ikke ? foran), byttes tegnet med tilsvarende LOGISK VERDI
      * (De logiske verdiene er ikke lesbre tegn,og vil aldri forekomme i den
      * innkommende datastroemmen). '?' når brukt som opphevelse foran annet
      * spesialtegn vil bli "spist" av henterutinen (GETCH) og en vil derfor
      * kunne betrakte spoersmålstegn som grafisk tegn i resten av programmet.
      *
      * Ved andre standarder for spesialtegn er det bare å bytte verdiene til
      * de GRAFISKE tegnene her. (Programmet arbeider da med riktige verdier).
     C                   MOVE      '?'           GRASPØ            1
     C                   MOVE      '+'           GRAPLU            1
     C                   MOVE      ':'           GRAKOL            1
     C                   BITON     '123457'      GRAAPP            1
     C                   BITOFF    '06'          GRAAPP
      * Logiske verdier for spesialtegn
      * LOGAPP = slutt på segmentet. I NODI er tegnet "'".
     C                   BITON     '17'          LOGAPP            1
     C                   BITOFF    '023456'      LOGAPP
      * LOGPLU = sparasjonstegn for Tag/dataelement. I NODI er tegnet "+".
     C                   BITON     '16'          LOGPLU            1
     C                   BITOFF    '023457'      LOGPLU
      * LOGKOL = sparasjonstegn for delelement. I NODI er tegnet ":".
     C                   BITON     '167'         LOGKOL            1
     C                   BITOFF    '02345'       LOGKOL
      * LOGBLA = utenlandske måten å vise blank.
     C                   BITON     '01234567'    LOGBLA            1
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WIN91
     C                   PARM                    WIN99
     C                   MOVE      WIN91         *IN91
     C                   MOVE      WIN99         *IN99
      *____________
      * Init arrays
      *""""""""""""
     C                   MOVE      *BLANKS       SEG
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      'BGM00'       SEG(1)
     C     U0065         IFEQ      'PARTTC'
     C                   MOVE      'UNS00'       SEG(1)
     C                   ENDIF
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste tegn i datastroem             GETCH  /
      *////////////////////////////////////////////////////////////
     C     GETCH         BEGSR
      * Rutinen henter "TEGN" fra array AA. Ved slutten av AA "toemmes" AB inn
      * i AA. (AB benyttes kun for alltid å kunne ha "lookahead-tegn" - LOKAHE)
      * 91 settes når en ved "Toemming" finner at AB-arrayet er tomt.
      *
      * "?" spises av SR når "?" kun varsler grafisk betydning av spesialtegn.
      *Når tegn ved utgang av SR er ',+ eller :  er betydningen av ind. 98 :
      *    98 ON -> kun grafisk betydning (uforandret)
      *    98 OFF-> spesialtegn (Bytt tegn mot ikke lesbar logisk verdi LOG???)
     C                   MOVE      '0'           *IN98
     C     STACH         TAG
      * Må ny record hentes inn i array AA (fra AB)?????
     C     TN            IFEQ      81
     C     EOF           IFEQ      'YES'
     C                   SETON                                            91
     C                   GOTO      ENDCH
     C                   ENDIF
     C                   MOVE      ABDS          AADS
     C  N99UMBR          READE     EDIRE                                  99
     C  N99              EXSR      CVTCHR
     C  N99              MOVE      RDATA         ABDS
     C   99              MOVE      *BLANKS       ABDS
     C   99              MOVE      'YES'         EOF
     C                   Z-ADD     1             TN
     C                   ENDIF
      * Hent det tegn som TN peker på - Tegnet etter er "Lookahead"
     C                   MOVE      AA(TN)        TEGN
     C                   ADD       1             TN
     C     TN            IFLE      80
     C                   MOVE      AA(TN)        LOKAHE            1
     C                   ELSE
     C                   MOVE      AB(1)         LOKAHE
     C                   ENDIF
      * Dersom TEGN er "?" og LOKAHE er spes.tegn - "spis" spoersmålstegnet
      * Når 98 er on her betyr det at "?" foran spesialtegn alt er "spist"
      *        evt. nytt "?" er da grafisk tegn - LOKAHE skal da IKKE testes.
     C  N98TEGN          IFEQ      GRASPØ
     C     LOKAHE        COMP      GRAAPP                                 98
     C  N98LOKAHE        COMP      GRAPLU                                 98
     C  N98LOKAHE        COMP      GRAKOL                                 98
     C  N98LOKAHE        COMP      GRASPØ                                 98
     C   98              GOTO      STACH
     C                   END
      * Ved N98 og ',+ eller : i TEGN betyr det at det IKKE var opphevelsestegn
      * foran. Vi har med andre ord et LOGISK SPESIALTEN INNE
     C  N98TEGN          IFEQ      GRAAPP
     C                   MOVE      LOGAPP        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAPLU
     C                   MOVE      LOGPLU        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAKOL
     C                   MOVE      LOGKOL        TEGN
     C                   ELSE
     C     TEGN          IFEQ      LOGBLA
     C                   MOVE      ' '           TEGN
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C     ENDCH         ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste Segment                       GETSEG /
      *////////////////////////////////////////////////////////////
     C     GETSEG        BEGSR
      * "Spis tegn" til appostrof er lest
     C     TEGN          DOWNE     LOGAPP
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C* "Spis tegn" til første IKKE blanke
     C                   MOVEA     *BLANKS       FE
     C                   EXSR      GETCH
     C     TEGN          DOWEQ     ' '
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C                   MOVEA     TEGN          FE(1)
      * Har nå lest appostrof - de 3 neste vil være SEGMENTNAVN
     C     2             DO        3             NR                3 0
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   MOVEA     TEGN          FE(NR)
     C                   END
     C                   MOVEL     FELT          SEGNAM
      * La TEGN være '+' etter segmentnavnet ved utgang av SR
     C                   EXSR      GETCH
      * Segmentnavn returneres nå i variabel 'SEGNAM'
     C     ENDSEG        ENDSR
      *////////////////////////////////////////////////////////////
      * Get Data Element                                   GETDED /
      *////////////////////////////////////////////////////////////
     C     GETDED        BEGSR
     C                   MOVEA     *BLANKS       FE
     C     1             DO        256           NR                3 0
     C                   EXSR      GETCH
     C     TEGN          IFEQ      LOGAPP
     C     TEGN          OREQ      LOGPLU
     C     TEGN          OREQ      LOGKOL
     C                   GOTO      ENDDED
     C                   ENDIF
     C                   MOVEA     TEGN          FE(NR)
     C                   ENDDO
     C     ENDDED        ENDSR
      *////////////////////////////////////////////////////////////
      * CVT characters                                     CVTCHR /
      *////////////////////////////////////////////////////////////
     C     CVTCHR        BEGSR
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    RDATA
     C                   PARM                    TABLE
     C                   PARM                    LIB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * GET SYNTAX OF MSG                                  GETDED /
      *////////////////////////////////////////////////////////////
     C     SEGSYN        BEGSR
      * FIND LAST BREAK SEGMENT
     C     SEG001        TAG
      *
     C                   MOVEL     U0065         SYNMSG
     C                   MOVE      '*'           SYNBKP
     C                   Z-ADD     9             WX
     C     SEG(WX)       DOWEQ     *BLANKS
     C                   SUB       1             WX
     C     WX            COMP      0                                    2020
     C  N20              ENDDO
     C     WX            IFGT      0
     C                   MOVEL     SEG(WX)       SYNSEG
     C                   MOVE      SEG(WX)       SYNGRP
     C                   Z-ADD     WX            SYNLVL
     C                   SUB       1             SYNLVL
     C                   ENDIF
     C     SYNSEG        IFEQ      *BLANKS
     C                   MOVEL     SEGNAM        SYNSEG
     C                   Z-ADD     0             SYNGRP
     C                   Z-ADD     0             SYNLVL
     C                   ENDIF
     C                   Z-ADD     WX            YX                5 0
      * POSITION TO PREVIOUS BREAK SEGMENT
     C                   Z-ADD     1             WX                5 0
     C     SYNKEY        DOWNE     SYN(WX)
     C                   ADD       1             WX
     C                   ENDDO
      * POSITION TO *CURRENT SEGMENT
     C                   MOVE      U0065         TVIMSG
     C                   MOVE      SEGNAM        TVISEG
     C     TVIKEY        DOWNE     SYNKE2
     C                   ADD       1             WX
     C     WX            IFGT      706
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   GOTO      SEG001
     C                   ELSE
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   MOVE      SYN(WX)       SYNKEY
     C                   ENDDO
      * CHECK IF THIS IS THE RIGHT SEGMENT AT RIGHT LEVEL
     C     SYNLVL        IFGE      2
     C                   MOVE      SYNKEY        WYNKEY           13
     C                   Z-ADD     SYNLVL        WL
     C                   SUB       1             WL
     C     1             DO        706
     C                   SUB       1             WX
     C                   MOVE      SYN(WX)       SYNKEY
     C     SYNLVL        IFEQ      WL
     C     SYNBKP        ANDEQ     '*'
     C                   ADD       1             WL
     C     SYNSRP        IFNE      SEG(WL)
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   ENDIF
     C                   GOTO      SEG001
     C                   ELSE
     C                   MOVE      WYNKEY        SYNKEY
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   ENDDO
     C                   ENDIF
      * CLEAR ARRAY FOR ALL BREAK SEGMENTS AT *LE LEVEL
     C     SEG002        TAG
     C     SYNBKP        IFEQ      '*'
     C     SYNLVL        ADD       1             WX
     C     9             SUB       SYNLVL        WZ                5 0
     C     WX            DO        WZ            WY                5 0
     C                   MOVE      *BLANKS       SEG(WY)
     C                   ENDDO
      * ADD THIS SEGMENT TO ARRAY FOR BREAK
     C                   Z-ADD     SYNLVL        WX
     C                   ADD       1             WX
     C                   MOVEL     SYNSEG        SEG(WX)
     C                   MOVE      SYNGRP        SEG(WX)
     C                   ENDIF
      * CLEAR ARRAYS FOR SEGMENT AND REPETITIONS *LT LEVEL
     C     SYNBKP        IFEQ      '*'
     C                   SELECT
     C     SYNLVL        WHENEQ    0
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP0             5 0
     C                   MOVE      *ZEROS        WREP1             5 0
     C                   MOVE      *ZEROS        WREP2             5 0
     C                   MOVE      *ZEROS        WREP3             5 0
     C                   MOVE      *ZEROS        WREP4             5 0
     C                   MOVE      *ZEROS        WREP5             5 0
     C                   MOVE      *ZEROS        WREP6             5 0
     C                   MOVE      *ZEROS        WREP7             5 0
     C                   MOVE      *ZEROS        WREP8             5 0
     C     SYNLVL        WHENEQ    1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP1
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C                   ENDSL
     C                   ENDIF
     C                   SELECT
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 1
     C     SYNLVL        WHENEQ    1
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOWNE     *BLANKS
     C     SE1(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE1(WX)
     C                   Z-ADD     1             RE1(WX)
     C                   ELSE
     C                   ADD       1             RE1(WX)
     C                   ENDIF
     C                   MOVE      RE1(WX)       WREP0
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 2
     C     SYNLVL        WHENEQ    2
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOWNE     *BLANKS
     C     SE2(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE2(WX)
     C                   Z-ADD     1             RE2(WX)
     C                   ELSE
     C                   ADD       1             RE2(WX)
     C                   ENDIF
     C                   MOVE      RE2(WX)       WREP1
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 2
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(2)        WSEG              3
     C     SE1(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP0
     C                   ELSE
     C                   MOVE      RE1(WX)       WREP0
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 3
     C     SYNLVL        WHENEQ    3
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOWNE     *BLANKS
     C     SE3(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE3(WX)
     C                   Z-ADD     1             RE3(WX)
     C                   ELSE
     C                   ADD       1             RE3(WX)
     C                   ENDIF
     C                   MOVE      RE3(WX)       WREP2
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 3
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(3)        WSEG
     C     SE2(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP1
     C                   ELSE
     C                   MOVE      RE2(WX)       WREP1
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 4
     C     SYNLVL        WHENEQ    4
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOWNE     *BLANKS
     C     SE4(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE4(WX)
     C                   Z-ADD     1             RE4(WX)
     C                   ELSE
     C                   ADD       1             RE4(WX)
     C                   ENDIF
     C                   MOVE      RE4(WX)       WREP3
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 4
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(4)        WSEG
     C     SE3(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP2
     C                   ELSE
     C                   MOVE      RE3(WX)       WREP2
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 5
     C     SYNLVL        WHENEQ    5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOWNE     *BLANKS
     C     SE5(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE5(WX)
     C                   Z-ADD     1             RE5(WX)
     C                   ELSE
     C                   ADD       1             RE5(WX)
     C                   ENDIF
     C                   MOVE      RE5(WX)       WREP4
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE4(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP3
     C                   ELSE
     C                   MOVE      RE4(WX)       WREP3
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 6
     C     SYNLVL        WHENEQ    6
     C                   Z-ADD     1             WX
     C     SE6(WX)       DOWNE     *BLANKS
     C     SE6(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE6(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE6(WX)
     C                   Z-ADD     1             RE6(WX)
     C                   ELSE
     C                   ADD       1             RE6(WX)
     C                   ENDIF
     C                   MOVE      RE6(WX)       WREP5
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE5(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP4
     C                   ELSE
     C                   MOVE      RE5(WX)       WREP4
     C                   ENDIF
     C                   ENDSL
     C                   ENDSR
      /COPY QEDSRC,ALC_I_96B
      /COPY QEDSRC,CNI_I_96B
      /COPY QEDSRC,CNT_I_96B
      /COPY QEDSRC,COM_I_96B
      /COPY QEDSRC,CPI_I_96B
      /COPY QEDSRC,CST_I_96B
      /COPY QEDSRC,CTA_I_96B
      /COPY QEDSRC,CUX_I_96B
      /COPY QEDSRC,DGS_I_96B
      /COPY QEDSRC,DIM_I_96B
      /COPY QEDSRC,DOC_I_96B
      /COPY QEDSRC,DTM_I_96B
      /COPY QEDSRC,EQA_I_96B
      /COPY QEDSRC,EQD_I_96B
      /COPY QEDSRC,EQN_I_96B
      /COPY QEDSRC,ERC_I_96B
      /COPY QEDSRC,ERP_I_96B
      /COPY QEDSRC,FII_I_96B
      /COPY QEDSRC,FTX_I_96B
      /COPY QEDSRC,GDS_I_96B
      /COPY QEDSRC,GID_I_96B
      /COPY QEDSRC,GIN_I_96B
      /COPY QEDSRC,GIR_I_96B
      /COPY QEDSRC,GIS_I_96B
      /COPY QEDSRC,GOR_I_96B
      /COPY QEDSRC,HAN_I_96B
      /COPY QEDSRC,IMD_I_96B
      /COPY QEDSRC,LOC_I_96B
      /COPY QEDSRC,LIN_I_96B
      /COPY QEDSRC,MEA_I_96B
      /COPY QEDSRC,MOA_I_96B
      /COPY QEDSRC,NAD_I_96B
      /COPY QEDSRC,PAC_I_96B
      /COPY QEDSRC,PAT_I_96B
      /COPY QEDSRC,PCD_I_96B
      /COPY QEDSRC,PCI_I_96B
      /COPY QEDSRC,PIA_I_96B
      /COPY QEDSRC,PRI_I_96B
      /COPY QEDSRC,QTY_I_96B
      /COPY QEDSRC,RCS_I_96B
      /COPY QEDSRC,RFF_I_96B
      /COPY QEDSRC,RNG_I_96B
      /COPY QEDSRC,RTE_I_96B
      /COPY QEDSRC,SEL_I_96B
      /COPY QEDSRC,SGP_I_96B
      /COPY QEDSRC,STS_I_96B
      /COPY QEDSRC,TAX_I_96B
      /COPY QEDSRC,TCC_I_96B
      /COPY QEDSRC,TDT_I_96B
      /COPY QEDSRC,TMD_I_96B
      /COPY QEDSRC,TMP_I_96B
      /COPY QEDSRC,TOD_I_96B
      /COPY QEDSRC,TPL_I_96B
      /COPY QEDSRC,TSR_I_96B
** SYN
APERAKUNH000*
APERAKBGM000*
APERAKDTM000*
APERAKFTX001*
APERAKRFF011*
APERAKUNT000*
CUSDECUNH000*
CUSDECBGM000*
CUSDECLOC001*
CUSDECDTM001*
CUSDECGIS001*
CUSDECRFF011*
CUSDECNAD061*
CUSDECCTA062
CUSDECCOM062
CUSDECUNS000*
CUSDECCST301*
CUSDECFTX302
CUSDECLOC302
CUSDECMEA302
CUSDECPAC312*
CUSDECPCI323*
CUSDECRFF352*
CUSDECGIS402*
CUSDECUNS990*
CUSDECCNT001*
CUSDECUNT000*
CUSRESUNH000*
CUSRESBGM000*
CUSRESDTM001*
CUSRESLOC001*
CUSRESGIS001*
CUSRESNAD011*
CUSRESRFF031*
CUSRESERP041*
CUSRESERC042
CUSRESDOC061*
CUSRESCST102*
CUSRESFTX103
CUSRESTAX113*
CUSRESMOA114
CUSRESRFF114
CUSRESUNT000*
IFCSUMUNH000*
IFCSUMBGM000*
IFCSUMDTM001*
IFCSUMMOA001*
IFCSUMFTX001*
IFCSUMCNT001*
IFCSUMRFF011*
IFCSUMDTM012
IFCSUMGOR021*
IFCSUMDTM022
IFCSUMLOC022
IFCSUMSEL022
IFCSUMFTX022
IFCSUMDOC032*
IFCSUMDTM033
IFCSUMNAD041*
IFCSUMCTA052*
IFCSUMCOM053
IFCSUMRFF062*
IFCSUMDTM063
IFCSUMTCC071*
IFCSUMPRI072
IFCSUMEQN072
IFCSUMPCD072
IFCSUMMOA072
IFCSUMQTY072
IFCSUMLOC072
IFCSUMTDT081*
IFCSUMTSR082
IFCSUMLOC082
IFCSUMDTM082
IFCSUMSEL082
IFCSUMFTX082
IFCSUMMEA092*
IFCSUMEQN093
IFCSUMDIM102*
IFCSUMEQN103
IFCSUMCTA112*
IFCSUMCOM113
IFCSUMNAD122*
IFCSUMLOC123
IFCSUMCTA133*
IFCSUMCOM134
IFCSUMDOC143*
IFCSUMDTM144
IFCSUMTCC153*
IFCSUMPRI154
IFCSUMEQN154
IFCSUMPCD154
IFCSUMMOA154
IFCSUMQTY154
IFCSUMRFF163*
IFCSUMDTM164
IFCSUMEQD171*
IFCSUMEQN172
IFCSUMTPL172
IFCSUMTMD172
IFCSUMMEA172
IFCSUMDIM172
IFCSUMSEL172
IFCSUMNAD172
IFCSUMLOC172
IFCSUMHAN172
IFCSUMTMP172
IFCSUMFTX172
IFCSUMEQA182*
IFCSUMEQN183
IFCSUMCNI191*
IFCSUMSGP202*
IFCSUMMEA213*
IFCSUMEQN214
IFCSUMTPL222*
IFCSUMMEA233*
IFCSUMEQN234
IFCSUMCTA192
IFCSUMCOM192
IFCSUMDTM192
IFCSUMCNT192
IFCSUMTSR192
IFCSUMCUX192
IFCSUMMOA192
IFCSUMFTX192
IFCSUMLOC242*
IFCSUMDTM243
IFCSUMTOD252*
IFCSUMLOC253
IFCSUMRFF262*
IFCSUMDTM263
IFCSUMGOR272*
IFCSUMDTM273
IFCSUMLOC273
IFCSUMSEL273
IFCSUMFTX273
IFCSUMDOC283*
IFCSUMDTM284
IFCSUMCPI292*
IFCSUMRFF293
IFCSUMCUX293
IFCSUMLOC293
IFCSUMMOA293
IFCSUMTCC302*
IFCSUMLOC303
IFCSUMFTX303
IFCSUMCUX303
IFCSUMPRI303
IFCSUMEQN303
IFCSUMPCD303
IFCSUMMOA303
IFCSUMQTY303
IFCSUMTDT312*
IFCSUMDTM313
IFCSUMTSR313
IFCSUMLOC323*
IFCSUMDTM324
IFCSUMRFF333*
IFCSUMDTM334
IFCSUMNAD342*
IFCSUMLOC343
IFCSUMMOA343
IFCSUMCTA353*
IFCSUMCOM354
IFCSUMDOC363*
IFCSUMDTM364
IFCSUMTCC373*
IFCSUMPRI374
IFCSUMEQN374
IFCSUMPCD374
IFCSUMMOA374
IFCSUMQTY374
IFCSUMRFF383*
IFCSUMDTM384
IFCSUMCPI393*
IFCSUMRFF394
IFCSUMCUX394
IFCSUMLOC394
IFCSUMMOA394
IFCSUMTSR403*
IFCSUMRFF404
IFCSUMLOC404
IFCSUMTPL404
IFCSUMFTX404
IFCSUMGID412*
IFCSUMHAN413
IFCSUMTMP413
IFCSUMRNG413
IFCSUMTMD413
IFCSUMLOC413
IFCSUMMOA413
IFCSUMPIA413
IFCSUMGIN413
IFCSUMFTX413
IFCSUMNAD423*
IFCSUMDTM424
IFCSUMGDS413
IFCSUMMEA433*
IFCSUMEQN434
IFCSUMDIM443*
IFCSUMEQN444
IFCSUMRFF453*
IFCSUMDTM454
IFCSUMPCI463*
IFCSUMRFF464
IFCSUMDTM464
IFCSUMGIN464
IFCSUMDOC473*
IFCSUMDTM474
IFCSUMGOR483*
IFCSUMDTM484
IFCSUMLOC484
IFCSUMSEL484
IFCSUMFTX484
IFCSUMDOC494*
IFCSUMDTM495
IFCSUMTPL503*
IFCSUMMEA514*
IFCSUMEQN515
IFCSUMSGP523*
IFCSUMSEQ524
IFCSUMMEA534*
IFCSUMEQN535
IFCSUMTCC543*
IFCSUMCUX544
IFCSUMPRI544
IFCSUMEQN544
IFCSUMPCD544
IFCSUMMOA544
IFCSUMQTY544
IFCSUMLOC544
IFCSUMDGS553*
IFCSUMFTX554
IFCSUMCTA564*
IFCSUMCOM565
IFCSUMMEA574*
IFCSUMEQN575
IFCSUMSGP584*
IFCSUMMEA595*
IFCSUMEQN596
IFCSUMEQD602*
IFCSUMEQN603
IFCSUMTMD603
IFCSUMMEA603
IFCSUMDIM603
IFCSUMSEL603
IFCSUMTPL603
IFCSUMHAN603
IFCSUMTMP603
IFCSUMFTX603
IFCSUMTCC613*
IFCSUMPRI614
IFCSUMEQN614
IFCSUMPCD614
IFCSUMMOA614
IFCSUMQTY614
IFCSUMNAD623*
IFCSUMDTM624
IFCSUMEQA633*
IFCSUMEQN634
IFCSUMUNT000*
IFTMBFUNH000*
IFTMBFBGM000*
IFTMBFCTA000*
IFTMBFCOM001*
IFTMBFDTM001*
IFTMBFTSR001*
IFTMBFMOA001*
IFTMBFFTX001*
IFTMBFCNT001*
IFTMBFLOC011*
IFTMBFDTM012
IFTMBFTOD021*
IFTMBFLOC022
IFTMBFRFF031*
IFTMBFDTM032
IFTMBFGOR041*
IFTMBFFTX042
IFTMBFDOC052*
IFTMBFDTM053
IFTMBFTCC061*
IFTMBFLOC062
IFTMBFFTX062
IFTMBFCUX062
IFTMBFPRI062
IFTMBFEQN062
IFTMBFPCD062
IFTMBFMOA062
IFTMBFQTY062
IFTMBFTDT071*
IFTMBFDTM072
IFTMBFTSR072
IFTMBFLOC082*
IFTMBFDTM083
IFTMBFRFF092*
IFTMBFDTM093
IFTMBFNAD101*
IFTMBFLOC102
IFTMBFCTA112*
IFTMBFCOM113
IFTMBFDOC122*
IFTMBFDTM123
IFTMBFRFF132*
IFTMBFDTM133
IFTMBFCPI142*
IFTMBFRFF143
IFTMBFCUX143
IFTMBFLOC143
IFTMBFMOA143
IFTMBFTSR152*
IFTMBFRFF153
IFTMBFLOC153
IFTMBFTPL153
IFTMBFFTX153
IFTMBFGID161*
IFTMBFHAN162
IFTMBFTMP162
IFTMBFRNG162
IFTMBFTMD162
IFTMBFLOC162
IFTMBFMOA162
IFTMBFPIA162
IFTMBFFTX162
IFTMBFNAD172*
IFTMBFDTM173
IFTMBFGDS173
IFTMBFMEA182*
IFTMBFEQN183
IFTMBFDIM192*
IFTMBFEQN193
IFTMBFRFF202*
IFTMBFDTM203
IFTMBFPCI212*
IFTMBFRFF213
IFTMBFDTM213
IFTMBFGIN213
IFTMBFDOC222*
IFTMBFDTM223
IFTMBFTPL232*
IFTMBFMEA243*
IFTMBFEQN244
IFTMBFSGP252*
IFTMBFMEA263*
IFTMBFEQN264
IFTMBFDGS272*
IFTMBFFTX273
IFTMBFCTA283*
IFTMBFCOM284
IFTMBFMEA293*
IFTMBFEQN294
IFTMBFSGP303*
IFTMBFMEA314*
IFTMBFEQN315
IFTMBFEQD321*
IFTMBFEQN322
IFTMBFTMD322
IFTMBFMEA322
IFTMBFDIM322
IFTMBFTPL322
IFTMBFHAN322
IFTMBFTMP322
IFTMBFFTX322
IFTMBFNAD332*
IFTMBFDTM333
IFTMBFCTA343*
IFTMBFCOM344
IFTMBFUNT000*
IFTMINUNH000*
IFTMINBGM000*
IFTMINCTA000*
IFTMINCOM001*
IFTMINDTM001*
IFTMINTSR001*
IFTMINCUX001*
IFTMINMOA001*
IFTMINFTX001*
IFTMINCNT001*
IFTMINDOC001*
IFTMINLOC011*
IFTMINDTM012
IFTMINTOD021*
IFTMINLOC022
IFTMINRFF031*
IFTMINDTM032
IFTMINGOR041*
IFTMINDTM042
IFTMINLOC042
IFTMINSEL042
IFTMINFTX042
IFTMINDOC052*
IFTMINDTM053
IFTMINCPI061*
IFTMINCUX062
IFTMINLOC062
IFTMINMOA062
IFTMINTCC071*
IFTMINLOC072
IFTMINFTX072
IFTMINCUX072
IFTMINPRI072
IFTMINEQN072
IFTMINPCD072
IFTMINMOA072
IFTMINQTY072
IFTMINTDT081*
IFTMINDTM082
IFTMINTSR082
IFTMINLOC092*
IFTMINDTM093
IFTMINRFF102*
IFTMINDTM103
IFTMINNAD111*
IFTMINLOC112
IFTMINMOA112
IFTMINCTA122*
IFTMINCOM123
IFTMINDOC132*
IFTMINDTM133
IFTMINTCC142*
IFTMINPRI143
IFTMINEQN143
IFTMINMOA143
IFTMINQTY143
IFTMINRFF152*
IFTMINDTM153
IFTMINCPI162*
IFTMINCUX163
IFTMINLOC163
IFTMINMOA163
IFTMINTSR172*
IFTMINRFF173
IFTMINLOC173
IFTMINTPL173
IFTMINFTX173
IFTMINGID181*
IFTMINHAN182
IFTMINTMP182
IFTMINRNG182
IFTMINTMD182
IFTMINLOC182
IFTMINMOA182
IFTMINPIA182
IFTMINFTX182
IFTMINNAD192*
IFTMINDTM193
IFTMINGDS193
IFTMINMEA202*
IFTMINEQN203
IFTMINDIM212*
IFTMINEQN213
IFTMINRFF222*
IFTMINDTM223
IFTMINPCI232*
IFTMINRFF233
IFTMINDTM233
IFTMINDOC242*
IFTMINDTM243
IFTMINGOR252*
IFTMINDTM253
IFTMINLOC253
IFTMINSEL253
IFTMINFTX253
IFTMINDOC263*
IFTMINDTM264
IFTMINTPL272*
IFTMINMEA283*
IFTMINEQN284
IFTMINSGP292*
IFTMINMEA303*
IFTMINEQN304
IFTMINTCC312*
IFTMINPRI313
IFTMINEQN313
IFTMINPCD313
IFTMINMOA313
IFTMINQTY313
IFTMINLOC313
IFTMINDGS322*
IFTMINFTX323
IFTMINCTA333*
IFTMINCOM334
IFTMINMEA343*
IFTMINEQN344
IFTMINSGP353*
IFTMINMEA364*
IFTMINEQN365
IFTMINEQD371*
IFTMINEQN372
IFTMINTMD372
IFTMINMEA372
IFTMINDIM372
IFTMINSEL372
IFTMINTPL372
IFTMINHAN372
IFTMINTMP372
IFTMINFTX372
IFTMINTCC382*
IFTMINPRI383
IFTMINEQN383
IFTMINPCD383
IFTMINMOA383
IFTMINQTY383
IFTMINNAD392*
IFTMINDTM393
IFTMINCTA403*
IFTMINCOM404
IFTMINEQA412*
IFTMINEQN413
IFTMINUNT000*
IFTSTAUNH000*
IFTSTABGM000*
IFTSTADTM000*
IFTSTADTSR00*
IFTSTANAD011*
IFTSTACTA022*
IFTSTACOM023
IFTSTARFF031*
IFTSTADTM032
IFTSTALOC000*
IFTSTAFTX000*
IFTSTACNT000*
IFTSTACNI041*
IFTSTALOC042
IFTSTACNT042
IFTSTASTS052*
IFTSTARFF053
IFTSTADTM053
IFTSTADOC053
IFTSTAFTX053
IFTSTANAD053
IFTSTALOC053
IFTSTAPCI053
IFTSTATDT063*
IFTSTARFF064
IFTSTALOC064
IFTSTADTM064
IFTSTAEQD073*
IFTSTAMEA074
IFTSTADIM074
IFTSTASEL074
IFTSTATPL074
IFTSTAEQA084*
IFTSTASEL085
IFTSTAGID093*
IFTSTAHAN094
IFTSTASGP094
IFTSTADGS094
IFTSTAFTX094
IFTSTAMEA104*
IFTSTAEQN105
IFTSTADIM114*
IFTSTAEQN115
IFTSTAPCI124*
IFTSTAGIN125
IFTSTAUNT000*
ORDERSUNH000*
ORDERSBGM000*
ORDERSDTM001*
ORDERSPAI000*
ORDERSALI001*
ORDERSIMD000*
ORDERSFTX001*
ORDERSRFF011*
ORDERSDTM012
ORDERSNAD021*
ORDERSLOC022
ORDERSFII022
ORDERSRFF032*
ORDERSDTM033
ORDERSDOC042*
ORDERSDTM043
ORDERSCTA052*
ORDERSCOM053
ORDERSTAX061*
ORDERSMOA062
ORDERSLOC062
ORDERSCUX071*
ORDERSPCD072
ORDERSDTM072
ORDERSPAT081*
ORDERSDTM082
ORDERSPCD082
ORDERSMOA082
ORDERSTDT091*
ORDERSLOC102*
ORDERSDTM103
ORDERSTOD111*
ORDERSLOC112
ORDERSPAC121*
ORDERSMEA122
ORDERSPCI132*
ORDERSRFF133
ORDERSDTM133
ORDERSGIN133
ORDERSEQD141*
ORDERSHAN142
ORDERSMEA142
ORDERSFTX142
ORDERSSCC151*
ORDERSFTX152
ORDERSRFF152
ORDERSQTY162*
ORDERSDTM163
ORDERSAPI171*
ORDERSDTM172
ORDERSRNG172
ORDERSALC181*
ORDERSALI182
ORDERSDTM182
ORDERSQTY192*
ORDERSRNG193
ORDERSPCD202*
ORDERSRNG203
ORDERSMOA212*
ORDERSRNG213
ORDERSRTE222*
ORDERSRNG223
ORDERSTAX232*
ORDERSMOA233
ORDERSRCS241*
ORDERSRFF242
ORDERSDTM242
ORDERSFTX242
ORDERSLIN251*
ORDERSPIA252
ORDERSIMD252
ORDERSMEA252
ORDERSQTY252
ORDERSPCD252
ORDERSALI252
ORDERSDTM252
ORDERSMOA252
ORDERSGIN252
ORDERSGIR252
ORDERSDOC252
ORDERSPAI252
ORDERSFTX252
ORDERSPAT262*
ORDERSDTM263
ORDERSPCD263
ORDERSMOA263
ORDERSPRI272*
ORDERSCUX273
ORDERSAPI273
ORDERSRNG273
ORDERSDTM273
ORDERSRFF282*
ORDERSDTM283
ORDERSPAC292*
ORDERSMEA293
ORDERSQTY293
ORDERSDTM293
ORDERSRFF303*
ORDERSDTM304
ORDERSPCI313*
ORDERSRFF314
ORDERSDTM314
ORDERSGIN314
ORDERSLOC322*
ORDERSQTY323
ORDERSDTM323
ORDERSTAX332*
ORDERSMOA333
ORDERSLOC333
ORDERSNAD342*
ORDERSLOC343
ORDERSRFF353*
ORDERSDTM354
ORDERSDOC363*
ORDERSDTM364
ORDERSCTA373*
ORDERSCOM374
ORDERSALC382*
ORDERSALI383
ORDERSDTM383
ORDERSQTY393*
ORDERSRNG394
ORDERSPCD403*
ORDERSRNG404
ORDERSMOA413*
ORDERSRNG414
ORDERSRTE423*
ORDERSRNG424
ORDERSTAX433*
ORDERSMOA434
ORDERSTDT442*
ORDERSLOC453*
ORDERSDTM454
ORDERSTOD462*
ORDERSLOC463
ORDERSEQD472*
ORDERSHAN473
ORDERSMEA473
ORDERSFTX473
ORDERSSCC482*
ORDERSFTX483
ORDERSRFF483
ORDERSQTY493*
ORDERSDTM494
ORDERSRCS502*
ORDERSRFF503
ORDERSDTM503
ORDERSFTX503
ORDERSMOA001*
ORDERSCNT001*
ORDERSALC511*
ORDERSALI512
ORDERSMOA512
ORDERSUNT000*
PARTTCUNH000*
PARTTCUNS000*
PARTTCNAD011*
PARTTCDTM012
PARTTCFTX012
PARTTCRFF012
PARTTCCTA022*
PARTTCCOM023
PARTTCTOD032*
PARTTCDTM033
PARTTCLOC043*
PARTTCFTX044
PARTTCUNT000*
