********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 YBC PTF11 DGS-SEGMENT
12XXX * 01 YBC PTF12 Klargjør for IFCSUM
********************************************************************
     FEDIRE     IF   E           K DISK
     FEALC01B   O  A E             DISK
     FEALI01B   O  A E             DISK
     FEAPR01B   O  A E             DISK
     FECAV01B   O  A E             DISK
     FECCI01B   O  A E             DISK
     FECNI01B   O  A E             DISK
     FECNT01B   O  A E             DISK
     FECOM01B   O  A E             DISK
     FECPI01B   O  A E             DISK
     FECTA01B   O  A E             DISK
     FECUX01B   O  A E             DISK
     FEDGS01B   O  A E             DISK
     FEDIM01B   O  A E             DISK
     FEDOC01B   O  A E             DISK
     FEDTM01B   O  A E             DISK
     FEEQA01B   O  A E             DISK
     FEEQD01B   O  A E             DISK
     FEEQN01B   O  A E             DISK
     FEFII01B   O  A E             DISK
     FEFTX01B   O  A E             DISK
     FEGDS01B   O  A E             DISK
     FEGID01B   O  A E             DISK
     FEGIN01B   O  A E             DISK
     FEGIR01B   O  A E             DISK
     FEGOR01B   O  A E             DISK
     FEHAN01B   O  A E             DISK
     FEIMD01B   O  A E             DISK
     FELIN01B   O  A E             DISK
     FELOC01B   O  A E             DISK
     FEMEA01B   O  A E             DISK
     FEMOA01B   O  A E             DISK
     FENAD01B   O  A E             DISK
     FEPAC01B   O  A E             DISK
     FEPAI01B   O  A E             DISK
     FEPAT01B   O  A E             DISK
     FEPCD01B   O  A E             DISK
     FEPCI01B   O  A E             DISK
     FEPIA01B   O  A E             DISK
     FEPRI01B   O  A E             DISK
     FEQTY01B   O  A E             DISK
     FEQVR01B   O  A E             DISK
     FERCS01B   O  A E             DISK
     FERFF01B   O  A E             DISK
     FERNG01B   O  A E             DISK
     FERTE01B   O  A E             DISK
     FESCC01B   O  A E             DISK
     FESEL01B   O  A E             DISK
     FESGP01B   O  A E             DISK
     FESTG01B   O  A E             DISK
     FESTS01B   O  A E             DISK
     FETAX01B   O  A E             DISK
     FETCC01B   O  A E             DISK
     FETDT01B   O  A E             DISK
     FETMD01B   O  A E             DISK
     FETMP01B   O  A E             DISK
     FETOD01B   O  A E             DISK
     FETPL01B   O  A E             DISK
     FETSR01B   O  A E             DISK
     D NU              S              1    DIM(15)
      *____________________________________________________________
      * Syntax of message
      * POS 1-6=MSGTYPE    7-9=SEGM   10-11=GROUP 12-12 LEVEL
      * 13-13=HEADING SEG OF A NEW GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
S02  D*SYN             S             13    DIM(734) CTDATA PERRCD(1)
N02  D SYN             S             13    DIM(887) CTDATA PERRCD(1)
      *____________________________________________________________
      * Last SEG of each BREAK GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SEG             S              5    DIM(9)
      *____________________________________________________________
      * Last SEG of each level FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SE1             S              3    DIM(99)
     D SE2             S              3    DIM(99)
     D SE3             S              3    DIM(99)
     D SE4             S              3    DIM(99)
     D SE5             S              3    DIM(99)
     D SE6             S              3    DIM(99)
     D SE7             S              3    DIM(99)
     D SE8             S              3    DIM(99)
      *____________________________________________________________
      * COUNTER of each SEG, LVL FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D RE1             S              4  0 DIM(99)
     D RE2             S              4  0 DIM(99)
     D RE3             S              4  0 DIM(99)
     D RE4             S              4  0 DIM(99)
     D RE5             S              4  0 DIM(99)
     D RE6             S              4  0 DIM(99)
     D RE7             S              4  0 DIM(99)
     D RE8             S              4  0 DIM(99)
     D                 DS
     D  TVIKEY                 1      9
     D  TVIMSG                 1      6
     D  TVISEG                 7      9
     D                 DS
     D  SYNKEY                 1     13
     D  SYNKE2                 1      9
     D  SYNMSG                 1      6
     D  SYNSRP                 7     11
     D  SYNSEG                 7      9
     D  SYNGRP                10     11  0
     D  SYNLVL                12     12  0
     D  SYNBKP                13     13
     D LDADTA         UDS          1024
     D  FE                     1    256
     D                                     DIM(256)
     D  FELT                   1    256
     D  AA                   301    380
     D                                     DIM(80)
     D  AADS                 301    380
     D  AB                   401    480
     D                                     DIM(80)
     D  ABDS                 401    480
     D  U0065                501    506
     D  SEGNAM               507    509
     D  TN                   601    602  0
     D  EOF                  603    605
     D  TEGN                 606    606
     D  LOKAHE               607    607
     D  UMN                  608    616  0
     D  UMBR                 617    626
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C     SEGSTA        TAG
     C  N91              EXSR      GETSEG
     C   91              GOTO      SLUTT
     C                   EXSR      SEGSYN
     C     SEGNAM        CABEQ     'UNB'         SLUTT
     C     SEGNAM        CABEQ     'UNH'         SLUTT
     C     SEGNAM        CABEQ     'BGM'         SLUTT
     C     SEGNAM        CABEQ     'UNT'         SLUTT
     C     SEGNAM        CABEQ     'UNZ'         SLUTT
      *
     C     SEGNAM        CASEQ     'ALC'         ALC
     C     SEGNAM        CASEQ     'CNT'         CNT
     C     SEGNAM        CASEQ     'CNI'         CNI
     C     SEGNAM        CASEQ     'COM'         COM
     C     SEGNAM        CASEQ     'CPI'         CPI
     C     SEGNAM        CASEQ     'CTA'         CTA
     C     SEGNAM        CASEQ     'CUX'         CUX
N01  C     SEGNAM        CASEQ     'DGS'         DGS
     C     SEGNAM        CASEQ     'DIM'         DIM
     C     SEGNAM        CASEQ     'DOC'         DOC
     C     SEGNAM        CASEQ     'DTM'         DTM
     C     SEGNAM        CASEQ     'EQA'         EQA
     C     SEGNAM        CASEQ     'EQD'         EQD
     C     SEGNAM        CASEQ     'EQN'         EQN
     C     SEGNAM        CASEQ     'FII'         FII
     C     SEGNAM        CASEQ     'FTX'         FTX
     C     SEGNAM        CASEQ     'GDS'         GDS
     C     SEGNAM        CASEQ     'GID'         GID
     C     SEGNAM        CASEQ     'GIN'         GIN
     C     SEGNAM        CASEQ     'GIR'         GIR
     C     SEGNAM        CASEQ     'HAN'         HAN
     C     SEGNAM        CASEQ     'IMD'         IMD
     C     SEGNAM        CASEQ     'LOC'         LOC
     C     SEGNAM        CASEQ     'LIN'         LIN
     C     SEGNAM        CASEQ     'MEA'         MEA
     C     SEGNAM        CASEQ     'MOA'         MOA
     C     SEGNAM        CASEQ     'NAD'         NAD
     C     SEGNAM        CASEQ     'PAT'         PAT
     C     SEGNAM        CASEQ     'PCD'         PCD
     C     SEGNAM        CASEQ     'PCI'         PCI
     C     SEGNAM        CASEQ     'PIA'         PIA
     C     SEGNAM        CASEQ     'PRI'         PRI
     C     SEGNAM        CASEQ     'QTY'         QTY
     C     SEGNAM        CASEQ     'RCS'         RCS
     C     SEGNAM        CASEQ     'RFF'         RFF
     C     SEGNAM        CASEQ     'RNG'         RNG
     C     SEGNAM        CASEQ     'RTE'         RTE
     C     SEGNAM        CASEQ     'SEL'         SEL
     C     SEGNAM        CASEQ     'SGP'         SGP
     C     SEGNAM        CASEQ     'STS'         STS
     C     SEGNAM        CASEQ     'TAX'         TAX
     C     SEGNAM        CASEQ     'TCC'         TCC
     C     SEGNAM        CASEQ     'TDT'         TDT
     C     SEGNAM        CASEQ     'TMD'         TMD
     C     SEGNAM        CASEQ     'TMP'         TMP
     C     SEGNAM        CASEQ     'TOD'         TOD
     C     SEGNAM        CASEQ     'TPL'         TPL
     C     SEGNAM        CASEQ     'TSR'         TSR
      *
     C                   END
     C                   GOTO      SEGSTA
     C     SLUTT         TAG
     C                   OUT       LDADTA
     C                   MOVE      *IN91         WIN91
     C                   MOVE      *IN99         WIN99
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *DTAARA       DEFINE    *LDA          LDADTA
     C                   IN        LDADTA
      * INIT AV ARBEIDSFELT
     C                   MOVE      *ZEROS        NUMVRD           15 0
     C                   MOVE      *ZEROS        NUTEGN            1 0
     C     *LIKE         DEFINE    *IN91         WIN91
     C     *LIKE         DEFINE    *IN99         WIN99
     C     *LIKE         DEFINE    SYNLVL        WL
     C                   MOVEL     'UNOC'        TABLE            10
     C                   MOVEL     '*LIBL'       LIB              10
     C                   Z-ADD     80            LEN               5 0
     C                   MOVE      *BLANKS       STRING           80
      *
      * Datafelt AB i EDIRE (80 lang) går rett inn i array AB ved READ
      * TN=81 soerger for automatisk overflyt array AB->AA ved kall av GETCH
     C                   MOVE      '0'           *IN98
      * Spesielt reserverte tegn defineres her med både grafisk verdi og
      * med en logisk verdi. Den grafiske verdien testes det mot i rutinen
      * som henter tegn. Finner denne rutinen at at tegnet er ment som en
      * spesialverdi (ikke ? foran), byttes tegnet med tilsvarende LOGISK VERDI
      * (De logiske verdiene er ikke lesbre tegn,og vil aldri forekomme i den
      * innkommende datastroemmen). '?' når brukt som opphevelse foran annet
      * spesialtegn vil bli "spist" av henterutinen (GETCH) og en vil derfor
      * kunne betrakte spoersmålstegn som grafisk tegn i resten av programmet.
      *
      * Ved andre standarder for spesialtegn er det bare å bytte verdiene til
      * de GRAFISKE tegnene her. (Programmet arbeider da med riktige verdier).
     C                   MOVE      '?'           GRASPØ            1
     C                   MOVE      '+'           GRAPLU            1
     C                   MOVE      ':'           GRAKOL            1
     C                   BITON     '123457'      GRAAPP            1
     C                   BITOFF    '06'          GRAAPP
      * Logiske verdier for spesialtegn
      * LOGAPP = slutt på segmentet. I NODI er tegnet "'".
     C                   BITON     '17'          LOGAPP            1
     C                   BITOFF    '023456'      LOGAPP
      * LOGPLU = sparasjonstegn for Tag/dataelement. I NODI er tegnet "+".
     C                   BITON     '16'          LOGPLU            1
     C                   BITOFF    '023457'      LOGPLU
      * LOGKOL = sparasjonstegn for delelement. I NODI er tegnet ":".
     C                   BITON     '167'         LOGKOL            1
     C                   BITOFF    '02345'       LOGKOL
      * LOGBLA = utenlandske måten å vise blank.
     C                   BITON     '01234567'    LOGBLA            1
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WIN91
     C                   PARM                    WIN99
     C                   MOVE      WIN91         *IN91
     C                   MOVE      WIN99         *IN99
      *____________
      * Init arrays
      *""""""""""""
     C                   MOVE      *BLANKS       SEG
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      'BGM00'       SEG(1)
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste tegn i datastroem             GETCH  /
      *////////////////////////////////////////////////////////////
     C     GETCH         BEGSR
      * Rutinen henter "TEGN" fra array AA. Ved slutten av AA "toemmes" AB inn
      * i AA. (AB benyttes kun for alltid å kunne ha "lookahead-tegn" - LOKAHE)
      * 91 settes når en ved "Toemming" finner at AB-arrayet er tomt.
      *
      * "?" spises av SR når "?" kun varsler grafisk betydning av spesialtegn.
      *Når tegn ved utgang av SR er ',+ eller :  er betydningen av ind. 98 :
      *    98 ON -> kun grafisk betydning (uforandret)
      *    98 OFF-> spesialtegn (Bytt tegn mot ikke lesbar logisk verdi LOG???)
     C                   MOVE      '0'           *IN98
     C     STACH         TAG
      * Må ny record hentes inn i array AA (fra AB)?????
     C     TN            IFEQ      81
     C     EOF           IFEQ      'YES'
     C                   SETON                                            91
     C                   GOTO      ENDCH
     C                   ENDIF
     C                   MOVE      ABDS          AADS
     C  N99UMBR          READE     EDIRE                                  99
     C  N99              EXSR      CVTCHR
     C  N99              MOVE      RDATA         ABDS
     C   99              MOVE      *BLANKS       ABDS
     C   99              MOVE      'YES'         EOF
     C                   Z-ADD     1             TN
     C                   ENDIF
      * Hent det tegn som TN peker på - Tegnet etter er "Lookahead"
     C                   MOVE      AA(TN)        TEGN
     C                   ADD       1             TN
     C     TN            IFLE      80
     C                   MOVE      AA(TN)        LOKAHE            1
     C                   ELSE
     C                   MOVE      AB(1)         LOKAHE
     C                   ENDIF
      * Dersom TEGN er "?" og LOKAHE er spes.tegn - "spis" spoersmålstegnet
      * Når 98 er on her betyr det at "?" foran spesialtegn alt er "spist"
      *        evt. nytt "?" er da grafisk tegn - LOKAHE skal da IKKE testes.
     C  N98TEGN          IFEQ      GRASPØ
     C     LOKAHE        COMP      GRAAPP                                 98
     C  N98LOKAHE        COMP      GRAPLU                                 98
     C  N98LOKAHE        COMP      GRAKOL                                 98
     C  N98LOKAHE        COMP      GRASPØ                                 98
     C   98              GOTO      STACH
     C                   END
      * Ved N98 og ',+ eller : i TEGN betyr det at det IKKE var opphevelsestegn
      * foran. Vi har med andre ord et LOGISK SPESIALTEN INNE
     C  N98TEGN          IFEQ      GRAAPP
     C                   MOVE      LOGAPP        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAPLU
     C                   MOVE      LOGPLU        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAKOL
     C                   MOVE      LOGKOL        TEGN
     C                   ELSE
     C     TEGN          IFEQ      LOGBLA
     C                   MOVE      ' '           TEGN
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C     ENDCH         ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste Segment                       GETSEG /
      *////////////////////////////////////////////////////////////
     C     GETSEG        BEGSR
      * "Spis tegn" til appostrof er lest
     C     TEGN          DOWNE     LOGAPP
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C* "Spis tegn" til første IKKE blanke
     C                   MOVEA     *BLANKS       FE
     C                   EXSR      GETCH
     C     TEGN          DOWEQ     ' '
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C                   MOVEA     TEGN          FE(1)
      * Har nå lest appostrof - de 3 neste vil være SEGMENTNAVN
     C     2             DO        3             NR                3 0
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   MOVEA     TEGN          FE(NR)
     C                   END
     C                   MOVEL     FELT          SEGNAM
      * La TEGN være '+' etter segmentnavnet ved utgang av SR
     C                   EXSR      GETCH
      * Segmentnavn returneres nå i variabel 'SEGNAM'
     C     ENDSEG        ENDSR
      *////////////////////////////////////////////////////////////
      * Get Data Element                                   GETDED /
      *////////////////////////////////////////////////////////////
     C     GETDED        BEGSR
     C                   MOVEA     *BLANKS       FE
     C     1             DO        256           NR                3 0
     C                   EXSR      GETCH
     C     TEGN          IFEQ      LOGAPP
     C     TEGN          OREQ      LOGPLU
     C     TEGN          OREQ      LOGKOL
     C                   GOTO      ENDDED
     C                   ENDIF
     C                   MOVEA     TEGN          FE(NR)
     C                   ENDDO
     C     ENDDED        ENDSR
      *////////////////////////////////////////////////////////////
      * CVT characters                                     CVTCHR /
      *////////////////////////////////////////////////////////////
     C     CVTCHR        BEGSR
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    RDATA
     C                   PARM                    TABLE
     C                   PARM                    LIB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * GET SYNTAX OF MSG                                  GETDED /
      *////////////////////////////////////////////////////////////
     C     SEGSYN        BEGSR
      * FIND LAST BREAK SEGMENT
     C     SEG001        TAG
      *
     C                   MOVEL     U0065         SYNMSG
     C                   MOVE      '*'           SYNBKP
     C                   Z-ADD     9             WX
     C     SEG(WX)       DOWEQ     *BLANKS
     C                   SUB       1             WX
     C     WX            COMP      0                                    2020
     C  N20              ENDDO
     C     WX            IFGT      0
     C                   MOVEL     SEG(WX)       SYNSEG
     C                   MOVE      SEG(WX)       SYNGRP
     C                   Z-ADD     WX            SYNLVL
     C                   SUB       1             SYNLVL
     C                   ENDIF
     C     SYNSEG        IFEQ      *BLANKS
     C                   MOVEL     SEGNAM        SYNSEG
     C                   Z-ADD     0             SYNGRP
     C                   Z-ADD     0             SYNLVL
     C                   ENDIF
     C                   Z-ADD     WX            YX                3 0
      * POSITION TO PREVIOUS BREAK SEGMENT
     C                   Z-ADD     1             WX                3 0
     C     SYNKEY        DOWNE     SYN(WX)
     C                   ADD       1             WX
     C                   ENDDO
      * POSITION TO *CURRENT SEGMENT
     C                   MOVE      U0065         TVIMSG
     C                   MOVE      SEGNAM        TVISEG
     C     TVIKEY        DOWNE     SYNKE2
     C                   ADD       1             WX
     C     WX            IFGT      734
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   GOTO      SEG001
     C                   ELSE
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   MOVE      SYN(WX)       SYNKEY
     C                   ENDDO
      * CHECK IF THIS IS THE RIGHT SEGMENT AT RIGHT LEVEL
     C     SYNLVL        IFGE      2
     C                   MOVE      SYNKEY        WYNKEY           13
     C                   Z-ADD     SYNLVL        WL
     C                   SUB       1             WL
     C     1             DO        734
     C                   SUB       1             WX
     C                   MOVE      SYN(WX)       SYNKEY
     C     SYNLVL        IFEQ      WL
     C     SYNBKP        ANDEQ     '*'
     C                   ADD       1             WL
     C     SYNSRP        IFNE      SEG(WL)
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   ENDIF
     C                   GOTO      SEG001
     C                   ELSE
     C                   MOVE      WYNKEY        SYNKEY
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   ENDDO
     C                   ENDIF
      * CLEAR ARRAY FOR ALL BREAK SEGMENTS AT *LE LEVEL
     C     SEG002        TAG
     C     SYNBKP        IFEQ      '*'
     C     SYNLVL        ADD       1             WX
     C     9             SUB       SYNLVL        WZ                3 0
     C     WX            DO        WZ            WY                3 0
     C                   MOVE      *BLANKS       SEG(WY)
     C                   ENDDO
      * ADD THIS SEGMENT TO ARRAY FOR BREAK
     C                   Z-ADD     SYNLVL        WX
     C                   ADD       1             WX
     C                   MOVEL     SYNSEG        SEG(WX)
     C                   MOVE      SYNGRP        SEG(WX)
     C                   ENDIF
      * CLEAR ARRAYS FOR SEGMENT AND REPETITIONS *LT LEVEL
     C     SYNBKP        IFEQ      '*'
     C                   SELECT
     C     SYNLVL        WHENEQ    0
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP0             4 0
     C                   MOVE      *ZEROS        WREP1             4 0
     C                   MOVE      *ZEROS        WREP2             4 0
     C                   MOVE      *ZEROS        WREP3             4 0
     C                   MOVE      *ZEROS        WREP4             4 0
     C                   MOVE      *ZEROS        WREP5             4 0
     C                   MOVE      *ZEROS        WREP6             4 0
     C                   MOVE      *ZEROS        WREP7             4 0
     C                   MOVE      *ZEROS        WREP8             4 0
     C     SYNLVL        WHENEQ    1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP1
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C                   ENDSL
     C                   ENDIF
     C                   SELECT
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 1
     C     SYNLVL        WHENEQ    1
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOWNE     *BLANKS
     C     SE1(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE1(WX)
     C                   Z-ADD     1             RE1(WX)
     C                   ELSE
     C                   ADD       1             RE1(WX)
     C                   ENDIF
     C                   MOVE      RE1(WX)       WREP0
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 2
     C     SYNLVL        WHENEQ    2
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOWNE     *BLANKS
     C     SE2(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE2(WX)
     C                   Z-ADD     1             RE2(WX)
     C                   ELSE
     C                   ADD       1             RE2(WX)
     C                   ENDIF
     C                   MOVE      RE2(WX)       WREP1
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 2
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(2)        WSEG              3
     C     SE1(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP0
     C                   ELSE
     C                   MOVE      RE1(WX)       WREP0
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 3
     C     SYNLVL        WHENEQ    3
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOWNE     *BLANKS
     C     SE3(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE3(WX)
     C                   Z-ADD     1             RE3(WX)
     C                   ELSE
     C                   ADD       1             RE3(WX)
     C                   ENDIF
     C                   MOVE      RE3(WX)       WREP2
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 3
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(3)        WSEG
     C     SE2(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP1
     C                   ELSE
     C                   MOVE      RE2(WX)       WREP1
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 4
     C     SYNLVL        WHENEQ    4
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOWNE     *BLANKS
     C     SE4(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE4(WX)
     C                   Z-ADD     1             RE4(WX)
     C                   ELSE
     C                   ADD       1             RE4(WX)
     C                   ENDIF
     C                   MOVE      RE4(WX)       WREP3
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 4
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(4)        WSEG
     C     SE3(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP2
     C                   ELSE
     C                   MOVE      RE3(WX)       WREP2
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 5
     C     SYNLVL        WHENEQ    5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOWNE     *BLANKS
     C     SE5(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE5(WX)
     C                   Z-ADD     1             RE5(WX)
     C                   ELSE
     C                   ADD       1             RE5(WX)
     C                   ENDIF
     C                   MOVE      RE5(WX)       WREP4
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE4(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP3
     C                   ELSE
     C                   MOVE      RE4(WX)       WREP3
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 6
     C     SYNLVL        WHENEQ    6
     C                   Z-ADD     1             WX
     C     SE6(WX)       DOWNE     *BLANKS
     C     SE6(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE6(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE6(WX)
     C                   Z-ADD     1             RE6(WX)
     C                   ELSE
     C                   ADD       1             RE6(WX)
     C                   ENDIF
     C                   MOVE      RE6(WX)       WREP5
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE5(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP4
     C                   ELSE
     C                   MOVE      RE5(WX)       WREP4
     C                   ENDIF
     C                   ENDSL
     C                   ENDSR
      /COPY QEDSRC,ALC_I_01B
      /COPY QEDSRC,ALI_I_01B
      /COPY QEDSRC,APR_I_01B
      /COPY QEDSRC,CAV_I_01B
      /COPY QEDSRC,CCI_I_01B
      /COPY QEDSRC,CNI_I_01B
      /COPY QEDSRC,CNT_I_01B
      /COPY QEDSRC,COM_I_01B
      /COPY QEDSRC,CPI_I_01B
      /COPY QEDSRC,CTA_I_01B
      /COPY QEDSRC,CUX_I_01B
      /COPY QEDSRC,DGS_I_01B
      /COPY QEDSRC,DIM_I_01B
      /COPY QEDSRC,DOC_I_01B
      /COPY QEDSRC,DTM_I_01B
      /COPY QEDSRC,EQA_I_01B
      /COPY QEDSRC,EQD_I_01B
      /COPY QEDSRC,EQN_I_01B
      /COPY QEDSRC,FII_I_01B
      /COPY QEDSRC,FTX_I_01B
      /COPY QEDSRC,GDS_I_01B
      /COPY QEDSRC,GID_I_01B
      /COPY QEDSRC,GIN_I_01B
      /COPY QEDSRC,GIR_I_01B
      /COPY QEDSRC,GOR_I_01B
      /COPY QEDSRC,HAN_I_01B
      /COPY QEDSRC,IMD_I_01B
      /COPY QEDSRC,LOC_I_01B
      /COPY QEDSRC,LIN_I_01B
      /COPY QEDSRC,MEA_I_01B
      /COPY QEDSRC,MOA_I_01B
      /COPY QEDSRC,NAD_I_01B
      /COPY QEDSRC,PAC_I_01B
      /COPY QEDSRC,PAI_I_01B
      /COPY QEDSRC,PAT_I_01B
      /COPY QEDSRC,PCD_I_01B
      /COPY QEDSRC,PCI_I_01B
      /COPY QEDSRC,PIA_I_01B
      /COPY QEDSRC,PRI_I_01B
      /COPY QEDSRC,QTY_I_01B
      /COPY QEDSRC,QVR_I_01B
      /COPY QEDSRC,RCS_I_01B
      /COPY QEDSRC,RFF_I_01B
      /COPY QEDSRC,RNG_I_01B
      /COPY QEDSRC,RTE_I_01B
      /COPY QEDSRC,SCC_I_01B
      /COPY QEDSRC,SEL_I_01B
      /COPY QEDSRC,SGP_I_01B
      /COPY QEDSRC,STG_I_01B
      /COPY QEDSRC,STS_I_01B
      /COPY QEDSRC,TAX_I_01B
      /COPY QEDSRC,TCC_I_01B
      /COPY QEDSRC,TDT_I_01B
      /COPY QEDSRC,TMD_I_01B
      /COPY QEDSRC,TMP_I_01B
      /COPY QEDSRC,TOD_I_01B
      /COPY QEDSRC,TPL_I_01B
      /COPY QEDSRC,TSR_I_01B
** SYN
APERAKUNH000*
APERAKBGM000*
APERAKDTM000*
APERAKFTX001*
APERAKRFF011*
APERAKUNT000*
IFCSUMUNH000*
IFCSUMBGM000*
IFCSUMDTM001*
IFCSUMMOA001*
IFCSUMFTX001*
IFCSUMCNT001*
IFCSUMPCD001*
IFCSUMGDS001*
IFCSUMRFF011*
IFCSUMDTM012
IFCSUMGOR021*
IFCSUMDTM022
IFCSUMLOC022
IFCSUMSEL022
IFCSUMFTX022
IFCSUMDOC032*
IFCSUMDTM033
IFCSUMNAD041*
IFCSUMCTA052*
IFCSUMCOM053
IFCSUMREF062*
IFCSUMDTM063
IFCSUMTCC071*
IFCSUMPRI072
IFCSUMEQN072
IFCSUMPCD072
IFCSUMMOA072
IFCSUMQTY072
IFCSUMLOC072
IFCSUMICD081*
IFCSUMDTM082
IFCSUMFTX082
IFCSUMTDT091*
IFCSUMDTM092
IFCSUMTSR092
IFCSUMLOC102*
IFCSUMDTM103
IFCSUMSEL102
IFCSUMFTX102
IFCSUMMEA112*
IFCSUMEQN113
IFCSUMDIM122*
IFCSUMEQN123
IFCSUMCTA132*
IFCSUMCOM133
IFCSUMTCC142*
IFCSUMMOA143
IFCSUMPCD143
IFCSUMICD152*
IFCSUMDTM153
IFCSUMFTX153
IFCSUMNAD162*
IFCSUMLOC163
IFCSUMCTA173*
IFCSUMCOM174
IFCSUMDOC183*
IFCSUMDTM184
IFCSUMTCC193*
IFCSUMCUX194
IFCSUMPRI194
IFCSUMEQN194
IFCSUMPCD194
IFCSUMMOA194
IFCSUMQTY194
IFCSUMRFF203*
IFCSUMDTM204
IFCSUMEQD211*
IFCSUMEQN212
IFCSUMTPL212
IFCSUMTMD212
IFCSUMMEA212
IFCSUMDIM212
IFCSUMSEL212
IFCSUMNAD212
IFCSUMLOC212
IFCSUMHAN212
IFCSUMTMP212
IFCSUMFTX212
IFCSUMRFF212
IFCSUMPCD212
IFCSUMEQA222*
IFCSUMEQN223
IFCSUMDGS232*
IFCSUMFTX233
IFCSUMCTA243*
IFCSUMCOM244
IFCSUMCNI251*
IFCSUMSGP262*
IFCSUMMEA273*
IFCSUMEQN274
IFCSUMTPL282*
IFCSUMMEA293*
IFCSUMEQN294
IFCSUMCTA252
IFCSUMCOM252
IFCSUMDTM252
IFCSUMCNT252
IFCSUMTSR252
IFCSUMCUX252
IFCSUMMOA252
IFCSUMFTX252
IFCSUMDGS252
IFCSUMLOC302*
IFCSUMDTM303
IFCSUMTOD312*
IFCSUMLOC313
IFCSUMRFF322*
IFCSUMDTM323
IFCSUMGOR332*
IFCSUMDTM333
IFCSUMLOC333
IFCSUMSEL333
IFCSUMFTX333
IFCSUMDOC343*
IFCSUMDTM344
IFCSUMCPI352*
IFCSUMRFF353
IFCSUMCUX353
IFCSUMLOC353
IFCSUMMOA353
IFCSUMTCC362*
IFCSUMLOC363
IFCSUMFTX363
IFCSUMCUX363
IFCSUMPRI363
IFCSUMEQN363
IFCSUMPCD363
IFCSUMMOA363
IFCSUMQTY363
IFCSUMICD372*
IFCSUMDTM373
IFCSUMFTX373
IFCSUMTDT382*
IFCSUMDTM383
IFCSUMTSR383
IFCSUMLOC393*
IFCSUMDTM394
IFCSUMRFF403*
IFCSUMDTM404
IFCSUMTCC413*
IFCSUMMOA414
IFCSUMPCD414
IFCSUMICD423*
IFCSUMDTM424
IFCSUMFTX424
IFCSUMNAD432*
IFCSUMLOC433
IFCSUMMOA433
IFCSUMCTA443*
IFCSUMCOM444
IFCSUMDOC453*
IFCSUMDTM454
IFCSUMTCC463*
IFCSUMCUX464
IFCSUMPRI464
IFCSUMEQN464
IFCSUMPCD464
IFCSUMMOA464
IFCSUMQTY464
IFCSUMRFF473*
IFCSUMDTM474
IFCSUMCPI483*
IFCSUMRFF484
IFCSUMCUX484
IFCSUMLOC484
IFCSUMMOA484
IFCSUMTSR493*
IFCSUMRFF494
IFCSUMLOC494
IFCSUMTPL494
IFCSUMFTX494
IFCSUMGID502*
IFCSUMHAN503
IFCSUMTMP503
IFCSUMRNG503
IFCSUMTMD503
IFCSUMLOC503
IFCSUMMOA503
IFCSUMPIA503
IFCSUMGIN503
IFCSUMFTX503
IFCSUMNAD513*
IFCSUMDTM514
IFCSUMGDS503
IFCSUMMEA523*
IFCSUMEQN524
IFCSUMDIM533*
IFCSUMEQN534
IFCSUMRFF543*
IFCSUMDTM544
IFCSUMPCI553*
IFCSUMRFF554
IFCSUMDTM554
IFCSUMGIN554
IFCSUMMEA554
IFCSUMDIM554
IFCSUMFTX554
IFCSUMDOC563*
IFCSUMDTM564
IFCSUMGOR573*
IFCSUMDTM574
IFCSUMLOC574
IFCSUMSEL574
IFCSUMFTX574
IFCSUMDOC584*
IFCSUMDTM585
IFCSUMTPL593*
IFCSUMMEA604*
IFCSUMEQN605
IFCSUMSGP613*
IFCSUMSEQ614
IFCSUMMEA624*
IFCSUMEQN625
IFCSUMTCC633*
IFCSUMCUX634
IFCSUMPRI634
IFCSUMEQN634
IFCSUMPCD634
IFCSUMMOA634
IFCSUMQTY634
IFCSUMLOC634
IFCSUMICD643*
IFCSUMDTM644
IFCSUMFTX644
IFCSUMDGS653*
IFCSUMFTX654
IFCSUMCTA664*
IFCSUMCOM665
IFCSUMMEA674*
IFCSUMEQN675
IFCSUMSGP684*
IFCSUMMEA695*
IFCSUMEQN696
IFCSUMEQD702*
IFCSUMEQN703
IFCSUMTMD703
IFCSUMMEA703
IFCSUMDIM703
IFCSUMSEL703
IFCSUMTPL703
IFCSUMHAN703
IFCSUMTMP703
IFCSUMFTX703
IFCSUMPCD703
IFCSUMTCC713*
IFCSUMCUX714
IFCSUMPRI714
IFCSUMEQN714
IFCSUMPCD714
IFCSUMMOA714
IFCSUMQTY714
IFCSUMNAD723*
IFCSUMDTM724
IFCSUMEQA733*
IFCSUMEQN734
IFCSUMDGS743*
IFCSUMFTX744
IFCSUMCTA754*
IFCSUMCOM755
IFCSUMUNT000*
IFTMBFUNH000*
IFTMBFBGM000*
IFTMBFCTA000*
IFTMBFCOM001*
IFTMBFDTM001*
IFTMBFTSR001*
IFTMBFMOA001*
IFTMBFFTX001*
IFTMBFCNT001*
IFTMBFLOC011*
IFTMBFDTM012
IFTMBFTOD021*
IFTMBFLOC022
IFTMBFRFF031*
IFTMBFDTM032
IFTMBFGOR041*
IFTMBFFTX042
IFTMBFDOC052*
IFTMBFDTM053
IFTMBFTCC061*
IFTMBFLOC062
IFTMBFFTX062
IFTMBFCUX062
IFTMBFPRI062
IFTMBFEQN062
IFTMBFPCD062
IFTMBFMOA062
IFTMBFQTY062
IFTMBFTDT071*
IFTMBFDTM072
IFTMBFTSR072
IFTMBFLOC082*
IFTMBFDTM083
IFTMBFRFF092*
IFTMBFDTM093
IFTMBFNAD101*
IFTMBFLOC102
IFTMBFCTA112*
IFTMBFCOM113
IFTMBFDOC122*
IFTMBFDTM123
IFTMBFRFF132*
IFTMBFDTM133
IFTMBFCPI142*
IFTMBFRFF143
IFTMBFCUX143
IFTMBFLOC143
IFTMBFMOA143
IFTMBFTSR152*
IFTMBFRFF153
IFTMBFLOC153
IFTMBFTPL153
IFTMBFFTX153
IFTMBFGID161*
IFTMBFHAN162
IFTMBFTMP162
IFTMBFRNG162
IFTMBFTMD162
IFTMBFLOC162
IFTMBFMOA162
IFTMBFPIA162
IFTMBFFTX162
IFTMBFNAD172*
IFTMBFDTM173
IFTMBFGDS173
IFTMBFMEA182*
IFTMBFEQN183
IFTMBFDIM192*
IFTMBFEQN193
IFTMBFRFF202*
IFTMBFDTM203
IFTMBFPCI212*
IFTMBFRFF213
IFTMBFDTM213
IFTMBFGIN213
IFTMBFDOC222*
IFTMBFDTM223
IFTMBFTPL232*
IFTMBFMEA243*
IFTMBFEQN244
IFTMBFSGP252*
IFTMBFMEA263*
IFTMBFEQN264
IFTMBFDGS272*
IFTMBFFTX273
IFTMBFCTA283*
IFTMBFCOM284
IFTMBFMEA293*
IFTMBFEQN294
IFTMBFSGP303*
IFTMBFMEA314*
IFTMBFEQN315
IFTMBFEQD321*
IFTMBFEQN322
IFTMBFTMD322
IFTMBFMEA322
IFTMBFDIM322
IFTMBFTPL322
IFTMBFHAN322
IFTMBFTMP322
IFTMBFFTX322
IFTMBFNAD332*
IFTMBFDTM333
IFTMBFCTA343*
IFTMBFCOM344
IFTMBFUNT000*
IFTMINUNH000*
IFTMINBGM000*
IFTMINCTA000*
IFTMINCOM001*
IFTMINDTM001*
IFTMINTSR001*
IFTMINCUX001*
IFTMINMOA001*
IFTMINFTX001*
IFTMINCNT001*
IFTMINDOC001*
IFTMINLOC011*
IFTMINDTM012
IFTMINTOD021*
IFTMINLOC022
IFTMINRFF031*
IFTMINDTM032
IFTMINGOR041*
IFTMINDTM042
IFTMINLOC042
IFTMINSEL042
IFTMINFTX042
IFTMINDOC052*
IFTMINDTM053
IFTMINCPI061*
IFTMINCUX062
IFTMINLOC062
IFTMINMOA062
IFTMINTCC071*
IFTMINLOC072
IFTMINFTX072
IFTMINCUX072
IFTMINPRI072
IFTMINEQN072
IFTMINPCD072
IFTMINMOA072
IFTMINQTY072
IFTMINTDT081*
IFTMINDTM082
IFTMINTSR082
IFTMINLOC092*
IFTMINDTM093
IFTMINRFF102*
IFTMINDTM103
IFTMINNAD111*
IFTMINLOC112
IFTMINMOA112
IFTMINCTA122*
IFTMINCOM123
IFTMINDOC132*
IFTMINDTM133
IFTMINTCC142*
IFTMINPRI143
IFTMINEQN143
IFTMINMOA143
IFTMINQTY143
IFTMINRFF152*
IFTMINDTM153
IFTMINCPI162*
IFTMINCUX163
IFTMINLOC163
IFTMINMOA163
IFTMINTSR172*
IFTMINRFF173
IFTMINLOC173
IFTMINTPL173
IFTMINFTX173
IFTMINGID181*
IFTMINHAN182
IFTMINTMP182
IFTMINRNG182
IFTMINTMD182
IFTMINLOC182
IFTMINMOA182
IFTMINPIA182
IFTMINFTX182
IFTMINNAD192*
IFTMINDTM193
IFTMINGDS193
IFTMINMEA202*
IFTMINEQN203
IFTMINDIM212*
IFTMINEQN213
IFTMINRFF222*
IFTMINDTM223
IFTMINPCI232*
IFTMINRFF233
IFTMINDTM233
IFTMINDOC242*
IFTMINDTM243
IFTMINGOR252*
IFTMINDTM253
IFTMINLOC253
IFTMINSEL253
IFTMINFTX253
IFTMINDOC263*
IFTMINDTM264
IFTMINTPL272*
IFTMINMEA283*
IFTMINEQN284
IFTMINSGP292*
IFTMINMEA303*
IFTMINEQN304
IFTMINTCC312*
IFTMINPRI313
IFTMINEQN313
IFTMINPCD313
IFTMINMOA313
IFTMINQTY313
IFTMINLOC313
IFTMINDGS322*
IFTMINFTX323
IFTMINCTA333*
IFTMINCOM334
IFTMINMEA343*
IFTMINEQN344
IFTMINSGP353*
IFTMINMEA364*
IFTMINEQN365
IFTMINEQD371*
IFTMINEQN372
IFTMINTMD372
IFTMINMEA372
IFTMINDIM372
IFTMINSEL372
IFTMINTPL372
IFTMINHAN372
IFTMINTMP372
IFTMINFTX372
IFTMINTCC382*
IFTMINPRI383
IFTMINEQN383
IFTMINPCD383
IFTMINMOA383
IFTMINQTY383
IFTMINNAD392*
IFTMINDTM393
IFTMINCTA403*
IFTMINCOM404
IFTMINEQA412*
IFTMINEQN413
IFTMINUNT000*
IFTSTAUNH000*
IFTSTABGM000*
IFTSTADTM000*
IFTSTADTSR00*
IFTSTANAD011*
IFTSTACTA022*
IFTSTACOM023
IFTSTARFF031*
IFTSTADTM032
IFTSTALOC000*
IFTSTAFTX000*
IFTSTACNT000*
IFTSTACNI041*
IFTSTALOC042
IFTSTACNT042
IFTSTASTS052*
IFTSTARFF053
IFTSTADTM053
IFTSTAFTX053
IFTSTANAD053
IFTSTALOC053
IFTSTADTM053
IFTSTATDT063*
IFTSTARFF064
IFTSTALOC064
IFTSTADTM064
IFTSTAEQD073*
IFTSTAMEA074
IFTSTADIM074
IFTSTASEL074
IFTSTAEQA084*
IFTSTASEL085
IFTSTAGID093*
IFTSTAHAN094
IFTSTAPCI094
IFTSTAMEA104*
IFTSTAEQN105
IFTSTADIM114*
IFTSTAEQN115
IFTSTAUNT000*
ORDERSUNH000*
ORDERSBGM000*
ORDERSDTM001*
ORDERSPAI000*
ORDERSALI001*
ORDERSIMD000*
ORDERSFTX001*
ORDERSRFF011*
ORDERSDTM012
ORDERSNAD021*
ORDERSLOC022
ORDERSFII022
ORDERSRFF032*
ORDERSDTM033
ORDERSDOC042*
ORDERSDTM043
ORDERSCTA052*
ORDERSCOM053
ORDERSTAX061*
ORDERSMOA062
ORDERSLOC062
ORDERSCUX071*
ORDERSPCD072
ORDERSDTM072
ORDERSPAT081*
ORDERSDTM082
ORDERSPCD082
ORDERSMOA092*
ORDERSGIR093
ORDERSRJL093
ORDERSTDT101*
ORDERSLOC112*
ORDERSDTM113
ORDERSTOD121*
ORDERSLOC122
ORDERSPAC131*
ORDERSMEA132
ORDERSPCI142*
ORDERSRFF143
ORDERSDTM143
ORDERSGIN143
ORDERSEQD151*
ORDERSHAN152
ORDERSMEA152
ORDERSFTX152
ORDERSSCC161*
ORDERSFTX162
ORDERSRFF162
ORDERSQTY172*
ORDERSDTM173
ORDERSAPR181*
ORDERSDTM182
ORDERSRNG182
ORDERSALC191*
ORDERSALI192
ORDERSDTM192
ORDERSQTY202*
ORDERSRNG203
ORDERSPCD212*
ORDERSRNG213
ORDERSMOA222*
ORDERSRNG223
ORDERSRTE232*
ORDERSRNG233
ORDERSTAX242*
ORDERSMOA243
ORDERSRCS251*
ORDERSRFF252
ORDERSDTM252
ORDERSFTX252
ORDERSDGS261*
ORDERSFTX262
ORDERSCTA272*
ORDERSCOM273
ORDERSLIN281*
ORDERSPIA282
ORDERSIMD282
ORDERSMEA282
ORDERSQTY282
ORDERSPCD282
ORDERSALI282
ORDERSDTM282
ORDERSMOA282
ORDERSGIN282
ORDERSGIR282
ORDERSQVR282
ORDERSDOC282
ORDERSPAI282
ORDERSFTX282
ORDERSCCI292*
ORDERSCAV293
ORDERSMEA293
ORDERSPAT302*
ORDERSDTM303
ORDERSPCD303
ORDERSMOA313*
ORDERSGIR314
ORDERSPRI322*
ORDERSCUX323
ORDERSAPR323
ORDERSRNG323
ORDERSDTM323
ORDERSRFF332*
ORDERSDTM333
ORDERSPAC342*
ORDERSMEA343
ORDERSQTY343
ORDERSDTM343
ORDERSRFF353*
ORDERSDTM354
ORDERSPCI363*
ORDERSRFF364
ORDERSDTM364
ORDERSGIN364
ORDERSLOC372*
ORDERSQTY373
ORDERSDTM373
ORDERSTAX382*
ORDERSMOA383
ORDERSLOC383
ORDERSNAD392*
ORDERSLOC393
ORDERSRFF403*
ORDERSDTM404
ORDERSDOC413*
ORDERSDTM414
ORDERSCTA423*
ORDERSCOM424
ORDERSALC432*
ORDERSALI433
ORDERSDTM433
ORDERSQTY443*
ORDERSRNG444
ORDERSPCD453*
ORDERSRNG454
ORDERSMOA463*
ORDERSRNG464
ORDERSRTE473*
ORDERSRNG474
ORDERSTAX483*
ORDERSMOA484
ORDERSTDT492*
ORDERSLOC503*
ORDERSDTM504
ORDERSTOD512*
ORDERSLOC513
ORDERSEQD522*
ORDERSHAN523
ORDERSMEA523
ORDERSFTX523
ORDERSSCC532*
ORDERSFTX533
ORDERSRFF533
ORDERSQTY543*
ORDERSDTM544
ORDERSRCS552*
ORDERSRFF553
ORDERSDTM553
ORDERSFTX553
ORDERSSTG562*
ORDERSQTY573*
ORDERSMOA574
ORDERSDGS582*
ORDERSFTX583
ORDERSCTA593*
ORDERSCOM594
ORDERSUNS000*
ORDERSMOA001*
ORDERSCNT001*
ORDERSALC601*
ORDERSALI602
ORDERSMOA602
ORDERSUNT000*
