     FEJO03A    UF   E           K DISK
     FEJ203A    UF   E           K DISK
     FEJ303A    UF   E           K DISK
     FEJ403A    UF   E           K DISK
     FEJ503A    UF   E           K DISK
     D                 DS
     D  WMN                    1      9  0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    FMN
     C                   Z-ADD     FMN           WMN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJO03A
     C     WMN           READE     EJO03A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJO03A
     C     WMN           READE     EJO03A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ203A
     C     WMN           READE     EJ203A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ203A
     C     WMN           READE     EJ203A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ303A
     C     WMN           READE     EJ303A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ303A
     C     WMN           READE     EJ303A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ403A
     C     WMN           READE     EJ403A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ403A
     C     WMN           READE     EJ403A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ503A
     C     WMN           READE     EJ503A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ503A
     C     WMN           READE     EJ503A                                 51
     C  N51              ENDDO
      *
     C                   ENDSR
