      * Dette programmet er et kopi av EDI10C3R.
      * EDI85R1K er byttet med flatfil TULLTAX (hopper over mange ledd med unødig kopiering)
     FTULLTAX   IF   F 1024        DISK    BLOCK(*YES)
     FEDIC      UF   E             DISK
     FEDIRE1K   O  A E             DISK
     D                 DS
     D  WMBR                   1     10
     D  WMBRA                  1      1
     D  WMBRB                  2     10S 0
      * konv " far hex 34
     D AEF             c                   x'9E'
     D AET             c                   x'7B'
     D OEF             c                   x'E0'
     D OET             c                   x'7C'
     D AAF             c                   x'9F'
     D AAT             c                   x'5B'
     ITULLTAX   AA  01
     I                                  1 1024  FDATA
     C     *ENTRY        PLIST
     C                   PARM                    REMBR
      * Lage komponentnavn
     C     1             CHAIN     EDIC
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
     C                   EVAL      WMBRA='K'
     C                   EVAL      WMBRB=CSN
     C                   EVAL      REMBR=WMBR

     C                   READ      TULLTAX                                51
     C     *IN51         DOWEQ     '0'
     C                   EVAL      RDATA = FDATA
     C     AEF:AET       XLATE     RDATA         RDATA
     C     OEF:OET       XLATE     RDATA         RDATA
     C     AAF:AAT       XLATE     RDATA         RDATA
     C                   WRITE     EDIRER

     C                   READ      TULLTAX                                51
     C  N51              ENDDO

     C                   MOVE      '1'           *INLR
