********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 SH  PTF12 feil hvis 0 records vises
********************************************************************
     FEDII3     IF   E           K DISK
     FEDI52D    CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *____
      * Inz
      *""""
     C     *ENTRY        PLIST
     C                   PARM                    UINID
     C     *LIKE         DEFINE    INID          UINID
     C                   MOVEL     *BLANKS       UINID
     C                   MOVEL     *BLANKS       WNNA
      *______________
      * Clear Subfile
      *""""""""""""""
     C     START1        TAG
      *
     C                   MOVE      '1'           *IN93
     C                   MOVE      *BLANKS       SFNR
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WNNA          SETLL     EDII3
     C                   READ(N)   EDII3                                  94
      *
     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      EDII3                                  94
     C  N94              ENDDO
N01  C     zrecno        ifne      0
     C                   Z-ADD     1             ZRECNO
N01  c                   end
      *________________
      * Display Subfile
      *""""""""""""""""
     C     START2        TAG
      *
     C                   MOVE      *OFF          *IN51
     C                   MOVEA     '11'          *IN(91)
     C* KOMMER HIT VED TOM FIL
     C     ZRECNO        IFEQ      0
     C                   MOVE      *OFF          *IN94
     C                   ADD       1             ZRECNO
     C                   MOVE      *ON           *IN51
     C                   WRITE     SUBFIL
     C                   SETON                                        94
     C                   ENDIF
     C                   WRITE     WIND01
     C                   WRITE     BUNN
     C     STBUNN        TAG
      *
     C                   MOVEL     *BLANKS       WNNA
     C                   EXFMT     SUBCTL
      *
     C                   SETOFF                                       999830
      * FORRIGE
     C   12              GOTO      SLUTT
      *
     C     ZRECNO        IFNE      0
     C                   MOVE      *OFF          *IN98
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C                   ENDDO
     C     SFNR          IFEQ      '1'
     C                   MOVE      INID          UINID
     C                   GOTO      SLUTT
     C                   ENDIF
     C                   ENDIF
     C     WNNA          CABNE     *BLANKS       START1
     C                   GOTO      START2
      *
     C     SLUTT         TAG
      *
     C                   SETON                                        LR
     C                   RETURN
