     FEDI79F1K  IF   E             DISK
     D XLOC            C                   CONST('www.arcticgroup.se')
      *
     C     *ENTRY        PLIST
     C                   PARM                    USVKD             1
      *
     C                   EVAL      USVKD = 'N'
     C                   READ      EDI79F1K                               51
     C                   DOW       *IN51 = *OFF
     C                   ADD       1             XANTALL           1 0
     C     XLOC          SCAN      RDATA                                  33
     C                   SELECT
     C                   WHEN      *IN33
     C                   EVAL      USVKD = 'J'
     C                   LEAVE
     C                   WHEN      XANTALL >= 5
     C                   LEAVE
     C                   ENDSL
     C                   READ      EDI79F1K                               51
     C                   ENDDO
      *
     C                   MOVE      '1'           *INLR
      *
