********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 sh  PTF12 er uusrdt en brukerprofuil?
12XXX * 02 sh  PTF12 ENDRET TIL 4 LANGT SPOOLNNUMMER
     H debug(*yes)
      *_______________________
      * DS For incoming string
      *"""""""""""""""""""""""
      *
     c                   exsr      init
      *
     c     start         tag
      *
      * HENTER SPOOLFIL VERDIER
      *
     C                   CALL      'QRCVDTAQ'
     C                   PARM                    QDTAQ
     C                   PARM                    QLIB
     C                   PARM                    QRLEN
     C                   PARM                    QDATAX          128
     C                   PARM                    QWAIT
      *
      * henter USRDTA
      *
     c                   move      QDATAX        UDATA           128
     c                   CALL      'EPOSTDIR2'
     c                   PARM                    UDATA
     c                   PARM                    Uusrdt           10
     c                   parm                    unausno          26
     c                   parm                    ujobna           10
     c                   parm                    uuser            10
     c                   parm                    ujobno            6
     c                   parm                    ufile            10
s02  c*                  parm                    usplno            2
n02  c                   parm                    usplno            4
     c                   parm                    udateu            6
      *
      * oppdatering
      *
S02  C*                  MOVE      USPLNO        USPLNON           2 0
N02  C                   MOVE      USPLNO        USPLNON           4 0
N01  C                   MOVE      *BLANKS       MAILAD
n01  C                   MOVE      UUSER         UUSERM           10
N01  c     uusrdt        ifne      *blanks
N01  c                   call      'SYGE108CU'
n01  C                   PARM                    UUSRDT
N01  C                   PARM                    MAILAD           70
n01  C     MAILAD        IFNE      *BLANKS
N01  C                   MOVE      UUSRDT        UUSERM
n01  C                   END
n01  C                   END
N01  c*                  DUMP
      *CALL       PGM(SYGE108CU) PARM(&QUSER &EPOST)
     c                   CALL      'EPOSTDIRC'
     c                   parm                    ujobno            6
     c                   parm                    uuser            10
     c                   parm                    ujobna           10
     c                   parm                    ufile            10
     c                   parm                    usplnon
n01  C                   PARM                    UUSERM
     c*                  parm                    uusrdt           10
     c*                  parm                    udateu            6
     C                   GOTO      START
      *________________________________________________________
      * End of Program (never executed, this program just dump)
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C                   MOVE      '1'           *INLR
     c**********************************************************************
     c     INIT          begsr
     c**********************************************************************
      *
      *__________________________
      * Receive record from dataq
      *""""""""""""""""""""""""""
     C                   MOVEL     'EPOSTDIR'    QDTAQ            10
     C                   MOVEL     '*LIBL'       QLIB             10
     C                   Z-ADD     144           QRLEN             5 0
     C                   Z-SUB     1             QWAIT             5 0
     c                   move      *blanks       Uusrdt           10
     c                   move      *blanks       unausno          26
     c                   move      *blanks       ujobna           10
     c                   move      *blanks       uuser            10
     c                   move      *blanks       ujobno            6
     c                   move      *blanks       ufile            10
s02  c*                  move      *blanks       usplno            2
n02  c                   move      *blanks       usplno            4
     c                   move      *blanks       udateu            6
      *
     c                   endsr
