********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 sh  PTF12 ENDRET TIL 4 LANGT SPOOLNNUMMER
      *_______________________
      * DS For incoming string
      *"""""""""""""""""""""""
     D                 DS
     D  SPLFAX                 1   3800
     D  USRDTA                91    100
     D  USRDTA02              91     92
     D                 DS
     D  yDATA                  1    128
     D  Ysp                    1     10
     D  Yrecty                11     12
     D  Yjobna                13     22
     D  Yuser                 23     32
     D  yjobno                33     38
     D  ynausno               13     38
     D  yfile                 39     48
     D  ysnbr                 49     52b 0
     D  youtq                 53     62
     D  ylibl                 63     72
     D  ysyst                 73     80
     D  ydate                 81     87
     D  yres                  88     88
     D  ytime                 89     94
     D  yres2                 95    128
      *
     c                   exsr      init
      *
     C     START         TAG
      *
      *
     c                   exsr      flytt
      *
      *_____________________
      * HENTER USRDTA
      *""""""""""""""""""""
     c*    *like         define    ysnbr         usnbr
     c*                  eval      usnbr=ysnbr
     c                   call      'QUSRSPLA'
     c                   parm                    splfa          3800
     c                   parm                    splfab            4
     c                   parm                    spla0100
     c                   parm                    unausno
     c                   parm                    intjob           16
     c                   parm                    intsplf          16
     c                   parm                    ufile
     c                   parm                    ysnbr
     c                   move      splfa         splfax
     c                   move      usrdta        uusrdt
      *________________________________________________________
      * End of Program (never executed, this program just dump)
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C                   MOVE      '1'           *INLR
     c                   return
     c**********************************************************************
     c     INIT          begsr
     c**********************************************************************
      *
     c     *entry        plist
     c                   parm                    udata           128
     c                   parm                    uusrdt           10
     c                   parm                    unausno          26
     c                   parm                    ujobna           10
     c                   parm                    uuser            10
     c                   parm                    ujobno            6
     c                   parm                    ufile            10
s01  c*                  parm                    usplno            2
n01  c                   parm                    usplno            4
     c                   parm                    udateu            6
     c                   movel     'SPLA0100'    spla0100          8
     c                   move      udata         ydata
     c                   endsr
     c**********************************************************************
     c     flytt         begsr
     c**********************************************************************
     c                   move      *blanks       unausno          26
     c                   move      *blanks       ujobna           10
     c                   move      *blanks       uuser            10
     c                   move      *blanks       ujobno            6
     c                   move      *blanks       ufile            10
     c                   eval      unausno=ynausno
     c                   eval      Ujobna=yjobna
     c                   eval      Uuser=yuser
     c                   eval      Ujobno=yjobno
     c                   eval      Ufile=yfile
S01  c*                  move      *zeros        qsnbrn            2 0
N01  c                   move      *zeros        qsnbrn            4 0
     c                   z-add     ysnbr         qsnbrn
s01  c*                  move      qsnbrn        usplno            2
n01  c                   move      qsnbrn        usplno            4
     c                   move      ydate         udateu            6
     c                   endsr
