     FTRACKL01  UF   E           K DISK
     FDOKUFM    UF   E           K DISK
     FDOKUFN    UF   E           K DISK
N01  FCARGOF    UF   E           K DISK
N01  FCARGOO    UF   E           K DISK
N01  FSTSTUR    UF   E           K DISK
N01  FSTSOPD1   UF   E           K DISK
N01  FSTSFBR    UF   E           K DISK
N01  FSTSCLI    UF   E           K DISK
     c                   eval      TTAVD = 80
     c                   eval      TTopd = 1355
      *
     C     STSkey        KLIST
     C                   KFLD                    SOTYPE
     C                   KFLD                    SOPRO
     C     TRACKKEY      KLIST
     C                   KFLD                    TTAVD
     C                   KFLD                    TTOPD
      *
     C     DOKUFMK       KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    TTAVD
     C                   KFLD                    TTOPD
     C                   move      'F'           FMRI
      *
      *
     c     Start         tag
      *
     C     TRACKKEY      setll     TRACKL01
     C     TRACKKEY      reade     TRACKL01                               33
     C     *IN33         DOWEQ     *OFF
     C     TTACTI        IFeq      'TEI'
     C     TTACTI        andne     'TE2'
     C                   DELETE    TRACKFR
     C                   END
     C     TRACKKEY      reade     TRACKL01                               33
     C                   END
      *
     C     DokufmK       setll     Dokufm
     C     DokufmK       reade     Dokufm                                 33
     C     *IN33         DOWEQ     *OFF
     C                   MOVE      *zeros        FMItDt
     C                   MOVE      *zeros        FMItTm
     C                   MOVE      *blanks       FMItUs
     c                   move      *blanks       FMITER
     C                   update    DOKUFMR
     c                   exsr      delDokufn
     c                   exsr      delCARGOF
     C                   exsr      DELLNK
     C     DokufmK       reade     Dokufm                                 33
     C                   END
      *
     C     TRACKKEY      chain     CARGOO
     c                   if        %found
     c                   delete    cargooR
     c                   endif
      *
     c                   exsr      Delsts
      *
      *
     c*                  if        TTopd = 1146
     c*                  eval      TTopd = 1355
     c*                  goto      start
     c*                  endif
      *
     c*                  if        TTopd = 1355
     c*                  eval      TTopd = 1362
     c*                  goto      start
     c*                  endif
      *
     C     Slutt         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ******************************************************
     C     DelDokufn     begsr
      ******************************************************
      * DOKUFN er kolliskytinger inn/ut FREMMED terminal - fjern disse
     c                   movel     FMMRK1        FNCLID
     c     FNCLID        setll     DOKUFN
     c     FNCLID        reade     DOKUFN                                 33
     c     *in33         doweq     '0'
     c                   delete    dokufnr
     c     FNCLID        reade     DOKUFN                                 33
     c                   end
     c                   endsr
      ******************************************************
     C     DelCARGOF     begsr
      ******************************************************
      * DOKUFN er kolliskytinger inn/ut FREMMED terminal - fjern disse
     c                   eval      KOID = '00'+FMMRK1
     c     KOID          setll     cargof
     c     KOID          reade     cargof                                 33
     c     *in33         doweq     '0'
     c                   delete    cargofr
     c     KOID          reade     cargof                                 33
     c                   end
     c                   endsr
      ******************************************************
     C     DelLNK        begsr
      ******************************************************
      *   TEI_00370701550000119173.jpg
      *   TEU_00370701550000119173.jpg
      *
     c                   eval      URL='/syspeddev/clid/TEI_'+KOID+'.jpg'
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
      *
     c                   endsr
      ******************************************************
     C     DelSTS        begsr
      ******************************************************
      * hopp over utgående
     C     TRACKKEY      SETLL     STSopd1
     C     TRACKKEY      READE     STSopd1
     c                   DOW       not %eof
     c**                 if        SOTYPE <> *blanks
     c                   exsr      DELSTS2
     c                   delete    STSOPDR
     c**                 else
     c**                 update    STSOPDR                                      ikke slett utgående
     c**                 endif
     C     TRACKKEY      READE     STSopd1
     c                   enddo
      *
     c                   endsr
      ******************************************************
     C     DelSTS2       begsr
      ******************************************************
     c     STSkey        chain     STSTUR
     c                   if        %found
     c                   delete    STSTURR
     c                   endif
      *
     c     STSkey        setll     STSFBR
     c     STSkey        reade     STSFBR
     c                   DOW       not %eof
     c                   delete    STSFBRR
     c     STSkey        reade     STSFBR
     c                   enddo
      *
     c     STSkey        setll     STSCLI
     c     STSkey        reade     STSCLI
     c                   DOW       not %eof
     c                   delete    STSCLIR
     c     STSkey        reade     STSCLI
     c                   enddo
     c                   endsr
