     FTARI      UP   E             DISK
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
      *
     C     LC:UC         XLATE     TAENHE        TAENHE
      *
     C                   SELECT
     C                   WHEN      TAENHE = 'GRA' OR TAENHE = 'G  '
     C                   EVAL      TAENHE = 'G  '
     C                   WHEN      TAENHE = 'GRM'
     C                   EVAL      TAENHE = 'G  '
     C                   WHEN      TAENHE = 'LIT' OR TAENHE = 'L  '
     C                   EVAL      TAENHE = 'L  '
     c                   WHEN      TAENHE = 'LTR'
     C                   EVAL      TAENHE = 'L  '
     C                   WHEN      TAENHE = 'MWH'
     C                   EVAL      TAENHE = 'MWH'
     C                   WHEN      TAENHE = 'MTQ'
     C                   EVAL      TAENHE = 'M3 '
     C                   WHEN      TAENHE = 'MTK'
     C                   EVAL      TAENHE = 'M2 '
     C*                  WHEN      TAENHE = 'M3' OR TAENHE = 'M3F'
     C                   WHEN      TAENHE = 'M3F'
     C                   EVAL      TAENHE = 'M3F'
     C                   WHEN      TAENHE = 'NPR'
     C                   EVAL      TAENHE = 'PAR'
     C                   WHEN      TAENHE = 'NMB'
     C                   EVAL      TAENHE = 'STK'
     C                   WHEN      TAENHE = 'BLL' OR TAENHE = 'F  '
     C                   EVAL      TAENHE = 'F  '
     C                   WHEN      TAENHE = 'HE ' OR TAENHE = 'C  '
     C                   EVAL      TAENHE = 'C  '
     C                   WHEN      TAENHE = 'KGM' OR TAENHE = 'KG '
     C                   EVAL      TAENHE = 'KG '
     C                   WHEN      TAENHE = 'KSD' OR TAENHE = 'K  '
     C                   EVAL      TAENHE = 'K  '
     C                   WHEN      TAENHE = 'MTR' OR TAENHE = 'M  '
     C                   EVAL      TAENHE = 'M  '
     C                   WHEN      TAENHE = 'EUR'
     C                   EVAL      TAENHE = 'EUR'
     C                   ENDSL
      *
     C                   UPDATE    TARIR
      *
