     FTARI      UF   E           K DISK
     FTARIl05   IP   E             DISK    RENAME(TARIR:TARIR5)
     F                                     PREFIX(T5_)
      *
     C     TARIK         KLIST
     C                   KFLD                    T5_TATANR
     C                   KFLD                    T5_TATAR
     C                   KFLD                    T5_TADATO
      *
     C     TARIK         SETLL     TARI
     C     TARIK         READE     TARI                                   33
     C                   DOW       *IN33 = *OFF
     C                   IF        TADTS = 0
     C                   UPDATE    TARIR
     C                   ELSE
     C                   DELETE    TARIR
     C                   END
     C     TARIK         READE     TARI                                   33
     C                   ENDDO
      *
