     FTARI      UF   E           K DISK
      *
     C                   Z-ADD     0             X_TATANR          8 0
     C     99999999      SETLL     TARI
     C                   READP     TARI                                   33
     C                   DOW       *IN33 = *OFF
     C                   SELECT
     C                   WHEN      X_TATANR <> TATANR AND TADTS = 0
     C                   EVAL      X_TATANR = TATANR
     C                   WHEN      TATANR = X_TATANR AND TADTS = 0
     C                   EVAL      TADTS = 20220501
     C                   ENDSL
     C                   UPDATE    TARIR
     C                   READP     TARI                                   33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
