     FTARI      UP   E             DISK
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
      *
     C     LC:UC         XLATE     TAENHE        TAENHE
      *
     C                   SELECT
     C                   WHEN      TAENHE = 'GRA' OR TAENHE = 'G'
     C                   EVAL      TAENHE = 'GRA'
     C                   WHEN      TAENHE = 'LIT' OR TAENHE = 'L'
     C                   EVAL      TAENHE = 'LTR'
     C                   WHEN      TAENHE = 'MWH'
     C                   EVAL      TAENHE = 'MWH'
     C                   WHEN      TAENHE = 'M2'
     C                   EVAL      TAENHE = 'MTK'
     C                   WHEN      TAENHE = 'M3' OR TAENHE = 'M3F'
     C                   EVAL      TAENHE = 'MTQ'
     C                   WHEN      TAENHE = 'PAR'
     C                   EVAL      TAENHE = 'NPR'
     C                   WHEN      TAENHE = 'STK'
     C                   EVAL      TAENHE = 'NMB'
     C                   WHEN      TAENHE = 'BLL' OR TAENHE = 'F'
     C                   EVAL      TAENHE = 'BLL'
     C                   WHEN      TAENHE = 'HE' OR TAENHE = 'C'
     C                   EVAL      TAENHE = 'HE'
     C                   WHEN      TAENHE = 'KGM' OR TAENHE = 'KG'
     C                   EVAL      TAENHE = 'KGM'
     C                   WHEN      TAENHE = 'KSD' OR TAENHE = 'K'
     C                   EVAL      TAENHE = 'KSD'
     C                   WHEN      TAENHE = 'MTR' OR TAENHE = 'M'
     C                   EVAL      TAENHE = 'MTR'
     C                   WHEN      TAENHE = 'EUR'
     C                   EVAL      TAENHE = 'EUR'
     C                   ENDSL
      *
     C                   UPDATE    TARIR
      *
