     FXMLUFF    UP   E             DISK
     FFAIN      IF   E           K DISK
      *
     C                   IF        XFFN = 0 OR XFST = ' '
     C                   UPDATE    XMLUFFR
     C                   ELSE
     C     XFFN          CHAIN     FAIN                               33
     C                   IF        *IN33
     C                   DELETE    XMLUFFR
     C                   ELSE
     C                   UPDATE    XMLUFFR
     C                   END
     C                   END
