     H option(*NoSrcStmt) DftActGrp(*No)

     D UUIDTemplate    ds
     D   BytesProv                   10u 0 Inz(%Size(UUIDTemplate))
     D   BytesAvail                  10u 0
     D                                8a   Inz(*Allx'00')
     D   UUID                        16a
     D                 ds
     D   UA                    1     16
     D   UA01                  1      1
     D   UA02                  2      2
     D   UA03                  3      3
     D   UA04                  4      4
     D   UA05                  5      5
     D   UA06                  6      6
     D   UA07                  7      7
     D   UA08                  8      8
     D   UA09                  9      9
     D   UA10                 10     10
     D   UA11                 11     11
     D   UA12                 12     12
     D   UA13                 13     13
     D   UA14                 14     14
     D   UA15                 15     15
     D   UA16                 16     16
     D                 ds
     D   UB                    1     36
     D   UB01                  1      1
     D   UB02                  2      2
     D   UB03                  3      3
     D   UB04                  4      4
     D   UB05                  5      5
     D   UB06                  6      6
     D   UB07                  7      7
     D   UB08                  8      8
     D   UB09                  9      9
     D   UB10                 10     10
     D   UB11                 11     11
     D   UB12                 12     12
     D   UB13                 13     13
     D   UB14                 14     14
     D   UB15                 15     15
     D   UB16                 16     16
     D   UB17                 17     17
     D   UB18                 18     18
     D   UB19                 19     19
     D   UB20                 20     20
     D   UB21                 21     21
     D   UB22                 22     22
     D   UB23                 23     23
     D   UB24                 24     24
     D   UB25                 25     25
     D   UB26                 26     26
     D   UB27                 27     27
     D   UB28                 28     28
     D   UB29                 29     29
     D   UB30                 30     30
     D   UB31                 31     31
     D   UB32                 32     32
     D   UB33                 33     33
     D   UB34                 34     34
     D   UB35                 35     35
     D   UB36                 36     36

     D   A             S              1
     D   B             S              2

     D GenUuid         pr                  ExtProc('_GENUUID')
     D  Template                       *   Value

     C     *ENTRY        PLIST
     C                   PARM                    WB               36

     C                   callp     GenUuid( %Addr(UUIDTemplate))

     c                   eval      ua=uuid

     c                   eval      a=ua01
     c                   exsr      cvthex
     c                   movel     b             ub01
     c                   move      b             ub02

     c                   eval      a=ua02
     c                   exsr      cvthex
     c                   movel     b             ub03
     c                   move      b             ub04

     c                   eval      a=ua03
     c                   exsr      cvthex
     c                   movel     b             ub05
     c                   move      b             ub06

     c                   eval      a=ua04
     c                   exsr      cvthex
     c                   movel     b             ub07
     c                   move      b             ub08

     c                   eval      ub09='-'

     c                   eval      a=ua05
     c                   exsr      cvthex
     c                   movel     b             ub10
     c                   move      b             ub11

     c                   eval      a=ua06
     c                   exsr      cvthex
     c                   movel     b             ub12
     c                   move      b             ub13

     c                   eval      ub14='-'

     c                   eval      a=ua07
     c                   exsr      cvthex
     c                   movel     b             ub15
     c                   move      b             ub16

     c                   eval      a=ua08
     c                   exsr      cvthex
     c                   movel     b             ub17
     c                   move      b             ub18

     c                   eval      ub19='-'

     c                   eval      a=ua09
     c                   exsr      cvthex
     c                   movel     b             ub20
     c                   move      b             ub21

     c                   eval      a=ua10
     c                   exsr      cvthex
     c                   movel     b             ub22
     c                   move      b             ub23

     c                   eval      ub24='-'

     c                   eval      a=ua11
     c                   exsr      cvthex
     c                   movel     b             ub25
     c                   move      b             ub26

     c                   eval      a=ua12
     c                   exsr      cvthex
     c                   movel     b             ub27
     c                   move      b             ub28

     c                   eval      a=ua13
     c                   exsr      cvthex
     c                   movel     b             ub29
     c                   move      b             ub30

     c                   eval      a=ua14
     c                   exsr      cvthex
     c                   movel     b             ub31
     c                   move      b             ub32

     c                   eval      a=ua15
     c                   exsr      cvthex
     c                   movel     b             ub33
     c                   move      b             ub34

     c                   eval      a=ua16
     c                   exsr      cvthex
     c                   movel     b             ub35
     c                   move      b             ub36

     c                   eval      wb=ub

     c
     C                   eval      *inlr = *on
     C                   return
      *___________________________________________________
      * CVTHEX                                      CVTHEX
      *"""""""""""""""""""""""""""""""""""""""""""""""""""
     C     CVTHEX        BEGSR
     C                   SELECT
      * 00 - 0F
     C     A             WHENEQ    X'00'
     C                   MOVE      '00'          B
     C     A             WHENEQ    X'01'
     C                   MOVE      '01'          B
     C     A             WHENEQ    X'02'
     C                   MOVE      '02'          B
     C     A             WHENEQ    X'03'
     C                   MOVE      '03'          B
     C     A             WHENEQ    X'04'
     C                   MOVE      '04'          B
     C     A             WHENEQ    X'05'
     C                   MOVE      '05'          B
     C     A             WHENEQ    X'06'
     C                   MOVE      '06'          B
     C     A             WHENEQ    X'07'
     C                   MOVE      '07'          B
     C     A             WHENEQ    X'08'
     C                   MOVE      '08'          B
     C     A             WHENEQ    X'09'
     C                   MOVE      '09'          B
     C     A             WHENEQ    X'0A'
     C                   MOVE      '0A'          B
     C     A             WHENEQ    X'0B'
     C                   MOVE      '0B'          B
     C     A             WHENEQ    X'0C'
     C                   MOVE      '0C'          B
     C     A             WHENEQ    X'0D'
     C                   MOVE      '0D'          B
     C     A             WHENEQ    X'0E'
     C                   MOVE      '0E'          B
     C     A             WHENEQ    X'0F'
     C                   MOVE      '0F'          B
      * 10 - 1F
     C     A             WHENEQ    X'10'
     C                   MOVE      '10'          B
     C     A             WHENEQ    X'11'
     C                   MOVE      '11'          B
     C     A             WHENEQ    X'12'
     C                   MOVE      '12'          B
     C     A             WHENEQ    X'13'
     C                   MOVE      '13'          B
     C     A             WHENEQ    X'14'
     C                   MOVE      '14'          B
     C     A             WHENEQ    X'15'
     C                   MOVE      '15'          B
     C     A             WHENEQ    X'16'
     C                   MOVE      '16'          B
     C     A             WHENEQ    X'17'
     C                   MOVE      '17'          B
     C     A             WHENEQ    X'18'
     C                   MOVE      '18'          B
     C     A             WHENEQ    X'19'
     C                   MOVE      '19'          B
     C     A             WHENEQ    X'1A'
     C                   MOVE      '1A'          B
     C     A             WHENEQ    X'1B'
     C                   MOVE      '1B'          B
     C     A             WHENEQ    X'1C'
     C                   MOVE      '1C'          B
     C     A             WHENEQ    X'1D'
     C                   MOVE      '1D'          B
     C     A             WHENEQ    X'1E'
     C                   MOVE      '1E'          B
     C     A             WHENEQ    X'1F'
     C                   MOVE      '1F'          B
      * 20 - 2F
     C     A             WHENEQ    X'20'
     C                   MOVE      '20'          B
     C     A             WHENEQ    X'21'
     C                   MOVE      '21'          B
     C     A             WHENEQ    X'22'
     C                   MOVE      '22'          B
     C     A             WHENEQ    X'23'
     C                   MOVE      '23'          B
     C     A             WHENEQ    X'24'
     C                   MOVE      '24'          B
     C     A             WHENEQ    X'25'
     C                   MOVE      '25'          B
     C     A             WHENEQ    X'26'
     C                   MOVE      '26'          B
     C     A             WHENEQ    X'27'
     C                   MOVE      '27'          B
     C     A             WHENEQ    X'28'
     C                   MOVE      '28'          B
     C     A             WHENEQ    X'29'
     C                   MOVE      '29'          B
     C     A             WHENEQ    X'2A'
     C                   MOVE      '2A'          B
     C     A             WHENEQ    X'2B'
     C                   MOVE      '2B'          B
     C     A             WHENEQ    X'2C'
     C                   MOVE      '2C'          B
     C     A             WHENEQ    X'2D'
     C                   MOVE      '2D'          B
     C     A             WHENEQ    X'2E'
     C                   MOVE      '2E'          B
     C     A             WHENEQ    X'2F'
     C                   MOVE      '2F'          B
      * 30 - 3F
     C     A             WHENEQ    X'30'
     C                   MOVE      '30'          B
     C     A             WHENEQ    X'31'
     C                   MOVE      '31'          B
     C     A             WHENEQ    X'32'
     C                   MOVE      '32'          B
     C     A             WHENEQ    X'33'
     C                   MOVE      '33'          B
     C     A             WHENEQ    X'34'
     C                   MOVE      '34'          B
     C     A             WHENEQ    X'35'
     C                   MOVE      '35'          B
     C     A             WHENEQ    X'36'
     C                   MOVE      '36'          B
     C     A             WHENEQ    X'37'
     C                   MOVE      '37'          B
     C     A             WHENEQ    X'38'
     C                   MOVE      '38'          B
     C     A             WHENEQ    X'39'
     C                   MOVE      '39'          B
     C     A             WHENEQ    X'3A'
     C                   MOVE      '3A'          B
     C     A             WHENEQ    X'3B'
     C                   MOVE      '3B'          B
     C     A             WHENEQ    X'3C'
     C                   MOVE      '3C'          B
     C     A             WHENEQ    X'3D'
     C                   MOVE      '3D'          B
     C     A             WHENEQ    X'3E'
     C                   MOVE      '3E'          B
     C     A             WHENEQ    X'3F'
     C                   MOVE      '3F'          B
      * 40 - 4F
     C     A             WHENEQ    X'40'
     C                   MOVE      '40'          B
     C     A             WHENEQ    X'41'
     C                   MOVE      '41'          B
     C     A             WHENEQ    X'42'
     C                   MOVE      '42'          B
     C     A             WHENEQ    X'43'
     C                   MOVE      '43'          B
     C     A             WHENEQ    X'44'
     C                   MOVE      '44'          B
     C     A             WHENEQ    X'45'
     C                   MOVE      '45'          B
     C     A             WHENEQ    X'46'
     C                   MOVE      '46'          B
     C     A             WHENEQ    X'47'
     C                   MOVE      '47'          B
     C     A             WHENEQ    X'48'
     C                   MOVE      '48'          B
     C     A             WHENEQ    X'49'
     C                   MOVE      '49'          B
     C     A             WHENEQ    X'4A'
     C                   MOVE      '4A'          B
     C     A             WHENEQ    X'4B'
     C                   MOVE      '4B'          B
     C     A             WHENEQ    X'4C'
     C                   MOVE      '4C'          B
     C     A             WHENEQ    X'4D'
     C                   MOVE      '4D'          B
     C     A             WHENEQ    X'4E'
     C                   MOVE      '4E'          B
     C     A             WHENEQ    X'4F'
     C                   MOVE      '4F'          B
      * 50 - 5F
     C     A             WHENEQ    X'50'
     C                   MOVE      '50'          B
     C     A             WHENEQ    X'51'
     C                   MOVE      '51'          B
     C     A             WHENEQ    X'52'
     C                   MOVE      '52'          B
     C     A             WHENEQ    X'53'
     C                   MOVE      '53'          B
     C     A             WHENEQ    X'54'
     C                   MOVE      '54'          B
     C     A             WHENEQ    X'55'
     C                   MOVE      '55'          B
     C     A             WHENEQ    X'56'
     C                   MOVE      '56'          B
     C     A             WHENEQ    X'57'
     C                   MOVE      '57'          B
     C     A             WHENEQ    X'58'
     C                   MOVE      '58'          B
     C     A             WHENEQ    X'59'
     C                   MOVE      '59'          B
     C     A             WHENEQ    X'5A'
     C                   MOVE      '5A'          B
     C     A             WHENEQ    X'5B'
     C                   MOVE      '5B'          B
     C     A             WHENEQ    X'5C'
     C                   MOVE      '5C'          B
     C     A             WHENEQ    X'5D'
     C                   MOVE      '5D'          B
     C     A             WHENEQ    X'5E'
     C                   MOVE      '5E'          B
     C     A             WHENEQ    X'5F'
     C                   MOVE      '5F'          B
      * 60 - 6F
     C     A             WHENEQ    X'60'
     C                   MOVE      '60'          B
     C     A             WHENEQ    X'61'
     C                   MOVE      '61'          B
     C     A             WHENEQ    X'62'
     C                   MOVE      '62'          B
     C     A             WHENEQ    X'63'
     C                   MOVE      '63'          B
     C     A             WHENEQ    X'64'
     C                   MOVE      '64'          B
     C     A             WHENEQ    X'65'
     C                   MOVE      '65'          B
     C     A             WHENEQ    X'66'
     C                   MOVE      '66'          B
     C     A             WHENEQ    X'67'
     C                   MOVE      '67'          B
     C     A             WHENEQ    X'68'
     C                   MOVE      '68'          B
     C     A             WHENEQ    X'69'
     C                   MOVE      '69'          B
     C     A             WHENEQ    X'6A'
     C                   MOVE      '6A'          B
     C     A             WHENEQ    X'6B'
     C                   MOVE      '6B'          B
     C     A             WHENEQ    X'6C'
     C                   MOVE      '6C'          B
     C     A             WHENEQ    X'6D'
     C                   MOVE      '6D'          B
     C     A             WHENEQ    X'6E'
     C                   MOVE      '6E'          B
     C     A             WHENEQ    X'6F'
     C                   MOVE      '6F'          B
      * 70 - 7F
     C     A             WHENEQ    X'70'
     C                   MOVE      '70'          B
     C     A             WHENEQ    X'71'
     C                   MOVE      '71'          B
     C     A             WHENEQ    X'72'
     C                   MOVE      '72'          B
     C     A             WHENEQ    X'73'
     C                   MOVE      '73'          B
     C     A             WHENEQ    X'74'
     C                   MOVE      '74'          B
     C     A             WHENEQ    X'75'
     C                   MOVE      '75'          B
     C     A             WHENEQ    X'76'
     C                   MOVE      '76'          B
     C     A             WHENEQ    X'77'
     C                   MOVE      '77'          B
     C     A             WHENEQ    X'78'
     C                   MOVE      '78'          B
     C     A             WHENEQ    X'79'
     C                   MOVE      '79'          B
     C     A             WHENEQ    X'7A'
     C                   MOVE      '7A'          B
     C     A             WHENEQ    X'7B'
     C                   MOVE      '7B'          B
     C     A             WHENEQ    X'7C'
     C                   MOVE      '7C'          B
     C     A             WHENEQ    X'7D'
     C                   MOVE      '7D'          B
     C     A             WHENEQ    X'7E'
     C                   MOVE      '7E'          B
     C     A             WHENEQ    X'7F'
     C                   MOVE      '7F'          B
      * 80 - 8F
     C     A             WHENEQ    X'80'
     C                   MOVE      '80'          B
     C     A             WHENEQ    X'81'
     C                   MOVE      '81'          B
     C     A             WHENEQ    X'82'
     C                   MOVE      '82'          B
     C     A             WHENEQ    X'83'
     C                   MOVE      '83'          B
     C     A             WHENEQ    X'84'
     C                   MOVE      '84'          B
     C     A             WHENEQ    X'85'
     C                   MOVE      '85'          B
     C     A             WHENEQ    X'86'
     C                   MOVE      '86'          B
     C     A             WHENEQ    X'87'
     C                   MOVE      '87'          B
     C     A             WHENEQ    X'88'
     C                   MOVE      '88'          B
     C     A             WHENEQ    X'89'
     C                   MOVE      '89'          B
     C     A             WHENEQ    X'8A'
     C                   MOVE      '8A'          B
     C     A             WHENEQ    X'8B'
     C                   MOVE      '8B'          B
     C     A             WHENEQ    X'8C'
     C                   MOVE      '8C'          B
     C     A             WHENEQ    X'8D'
     C                   MOVE      '8D'          B
     C     A             WHENEQ    X'8E'
     C                   MOVE      '8E'          B
     C     A             WHENEQ    X'8F'
     C                   MOVE      '8F'          B
      * 90 - 9F
     C     A             WHENEQ    X'90'
     C                   MOVE      '90'          B
     C     A             WHENEQ    X'91'
     C                   MOVE      '91'          B
     C     A             WHENEQ    X'92'
     C                   MOVE      '92'          B
     C     A             WHENEQ    X'93'
     C                   MOVE      '93'          B
     C     A             WHENEQ    X'94'
     C                   MOVE      '94'          B
     C     A             WHENEQ    X'95'
     C                   MOVE      '95'          B
     C     A             WHENEQ    X'96'
     C                   MOVE      '96'          B
     C     A             WHENEQ    X'97'
     C                   MOVE      '97'          B
     C     A             WHENEQ    X'98'
     C                   MOVE      '98'          B
     C     A             WHENEQ    X'99'
     C                   MOVE      '99'          B
     C     A             WHENEQ    X'9A'
     C                   MOVE      '9A'          B
     C     A             WHENEQ    X'9B'
     C                   MOVE      '9B'          B
     C     A             WHENEQ    X'9C'
     C                   MOVE      '9C'          B
     C     A             WHENEQ    X'9D'
     C                   MOVE      '9D'          B
     C     A             WHENEQ    X'9E'
     C                   MOVE      '9E'          B
     C     A             WHENEQ    X'9F'
     C                   MOVE      '9F'          B
      * A0 - AF
     C     A             WHENEQ    X'A0'
     C                   MOVE      'A0'          B
     C     A             WHENEQ    X'A1'
     C                   MOVE      'A1'          B
     C     A             WHENEQ    X'A2'
     C                   MOVE      'A2'          B
     C     A             WHENEQ    X'A3'
     C                   MOVE      'A3'          B
     C     A             WHENEQ    X'A4'
     C                   MOVE      'A4'          B
     C     A             WHENEQ    X'A5'
     C                   MOVE      'A5'          B
     C     A             WHENEQ    X'A6'
     C                   MOVE      'A6'          B
     C     A             WHENEQ    X'A7'
     C                   MOVE      'A7'          B
     C     A             WHENEQ    X'A8'
     C                   MOVE      'A8'          B
     C     A             WHENEQ    X'A9'
     C                   MOVE      'A9'          B
     C     A             WHENEQ    X'AA'
     C                   MOVE      'AA'          B
     C     A             WHENEQ    X'AB'
     C                   MOVE      'AB'          B
     C     A             WHENEQ    X'AC'
     C                   MOVE      'AC'          B
     C     A             WHENEQ    X'AD'
     C                   MOVE      'AD'          B
     C     A             WHENEQ    X'AE'
     C                   MOVE      'AE'          B
     C     A             WHENEQ    X'AF'
     C                   MOVE      'AF'          B
      * B0 - BF
     C     A             WHENEQ    X'B0'
     C                   MOVE      'B0'          B
     C     A             WHENEQ    X'B1'
     C                   MOVE      'B1'          B
     C     A             WHENEQ    X'B2'
     C                   MOVE      'B2'          B
     C     A             WHENEQ    X'B3'
     C                   MOVE      'B3'          B
     C     A             WHENEQ    X'B4'
     C                   MOVE      'B4'          B
     C     A             WHENEQ    X'B5'
     C                   MOVE      'B5'          B
     C     A             WHENEQ    X'B6'
     C                   MOVE      'B6'          B
     C     A             WHENEQ    X'B7'
     C                   MOVE      'B7'          B
     C     A             WHENEQ    X'B8'
     C                   MOVE      'B8'          B
     C     A             WHENEQ    X'B9'
     C                   MOVE      'B9'          B
     C     A             WHENEQ    X'BA'
     C                   MOVE      'BA'          B
     C     A             WHENEQ    X'BB'
     C                   MOVE      'BB'          B
     C     A             WHENEQ    X'BC'
     C                   MOVE      'BC'          B
     C     A             WHENEQ    X'BD'
     C                   MOVE      'BD'          B
     C     A             WHENEQ    X'BE'
     C                   MOVE      'BE'          B
     C     A             WHENEQ    X'BF'
     C                   MOVE      'BF'          B
      * C0 - CF
     C     A             WHENEQ    X'C0'
     C                   MOVE      'C0'          B
     C     A             WHENEQ    X'C1'
     C                   MOVE      'C1'          B
     C     A             WHENEQ    X'C2'
     C                   MOVE      'C2'          B
     C     A             WHENEQ    X'C3'
     C                   MOVE      'C3'          B
     C     A             WHENEQ    X'C4'
     C                   MOVE      'C4'          B
     C     A             WHENEQ    X'C5'
     C                   MOVE      'C5'          B
     C     A             WHENEQ    X'C6'
     C                   MOVE      'C6'          B
     C     A             WHENEQ    X'C7'
     C                   MOVE      'C7'          B
     C     A             WHENEQ    X'C8'
     C                   MOVE      'C8'          B
     C     A             WHENEQ    X'C9'
     C                   MOVE      'C9'          B
     C     A             WHENEQ    X'CA'
     C                   MOVE      'CA'          B
     C     A             WHENEQ    X'CB'
     C                   MOVE      'CB'          B
     C     A             WHENEQ    X'CC'
     C                   MOVE      'CC'          B
     C     A             WHENEQ    X'CD'
     C                   MOVE      'CD'          B
     C     A             WHENEQ    X'CE'
     C                   MOVE      'CE'          B
     C     A             WHENEQ    X'CF'
     C                   MOVE      'CF'          B
      * D0 - DF
     C     A             WHENEQ    X'D0'
     C                   MOVE      'D0'          B
     C     A             WHENEQ    X'D1'
     C                   MOVE      'D1'          B
     C     A             WHENEQ    X'D2'
     C                   MOVE      'D2'          B
     C     A             WHENEQ    X'D3'
     C                   MOVE      'D3'          B
     C     A             WHENEQ    X'D4'
     C                   MOVE      'D4'          B
     C     A             WHENEQ    X'D5'
     C                   MOVE      'D5'          B
     C     A             WHENEQ    X'D6'
     C                   MOVE      'D6'          B
     C     A             WHENEQ    X'D7'
     C                   MOVE      'D7'          B
     C     A             WHENEQ    X'D8'
     C                   MOVE      'D8'          B
     C     A             WHENEQ    X'D9'
     C                   MOVE      'D9'          B
     C     A             WHENEQ    X'DA'
     C                   MOVE      'DA'          B
     C     A             WHENEQ    X'DB'
     C                   MOVE      'DB'          B
     C     A             WHENEQ    X'DC'
     C                   MOVE      'DC'          B
     C     A             WHENEQ    X'DD'
     C                   MOVE      'DD'          B
     C     A             WHENEQ    X'DE'
     C                   MOVE      'DE'          B
     C     A             WHENEQ    X'DF'
     C                   MOVE      'DF'          B
      * E0 - EF
     C     A             WHENEQ    X'E0'
     C                   MOVE      'E0'          B
     C     A             WHENEQ    X'E1'
     C                   MOVE      'E1'          B
     C     A             WHENEQ    X'E2'
     C                   MOVE      'E2'          B
     C     A             WHENEQ    X'E3'
     C                   MOVE      'E3'          B
     C     A             WHENEQ    X'E4'
     C                   MOVE      'E4'          B
     C     A             WHENEQ    X'E5'
     C                   MOVE      'E5'          B
     C     A             WHENEQ    X'E6'
     C                   MOVE      'E6'          B
     C     A             WHENEQ    X'E7'
     C                   MOVE      'E7'          B
     C     A             WHENEQ    X'E8'
     C                   MOVE      'E8'          B
     C     A             WHENEQ    X'E9'
     C                   MOVE      'E9'          B
     C     A             WHENEQ    X'EA'
     C                   MOVE      'EA'          B
     C     A             WHENEQ    X'EB'
     C                   MOVE      'EB'          B
     C     A             WHENEQ    X'EC'
     C                   MOVE      'EC'          B
     C     A             WHENEQ    X'ED'
     C                   MOVE      'ED'          B
     C     A             WHENEQ    X'EE'
     C                   MOVE      'EE'          B
     C     A             WHENEQ    X'EF'
     C                   MOVE      'EF'          B
      * F0 - FF
     C     A             WHENEQ    X'F0'
     C                   MOVE      'F0'          B
     C     A             WHENEQ    X'F1'
     C                   MOVE      'F1'          B
     C     A             WHENEQ    X'F2'
     C                   MOVE      'F2'          B
     C     A             WHENEQ    X'F3'
     C                   MOVE      'F3'          B
     C     A             WHENEQ    X'F4'
     C                   MOVE      'F4'          B
     C     A             WHENEQ    X'F5'
     C                   MOVE      'F5'          B
     C     A             WHENEQ    X'F6'
     C                   MOVE      'F6'          B
     C     A             WHENEQ    X'F7'
     C                   MOVE      'F7'          B
     C     A             WHENEQ    X'F8'
     C                   MOVE      'F8'          B
     C     A             WHENEQ    X'F9'
     C                   MOVE      'F9'          B
     C     A             WHENEQ    X'FA'
     C                   MOVE      'FA'          B
     C     A             WHENEQ    X'FB'
     C                   MOVE      'FB'          B
     C     A             WHENEQ    X'FC'
     C                   MOVE      'FC'          B
     C     A             WHENEQ    X'FD'
     C                   MOVE      'FD'          B
     C     A             WHENEQ    X'FE'
     C                   MOVE      'FE'          B
     C     A             WHENEQ    X'FF'
     C                   MOVE      'FF'          B
     C                   ENDSL
     C                   ENDSR
