      *
      ***************************************************************
      *** PROGRAM SKAL plukke hlb fra tur
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER        ***
      *** LEDIGE INDIKATORER 01 03-11 14-26                       ***
      *** LEDIGE INDIKATORER 27-99                                ***
********************************************************************
      * RETTINGER I DETTE PROGRAM:
      *
     FHLBFILT   O  A E           K DISK
     FHLBFIL    IF   E           K DISK
     FGSSORL21  IF   E           K DISK
     D                 DS
     D  HO                     1     51  0
     D                                     DIM(17)
     D  FIH1                   1      3  0
     D  FIH2                   4      6  0
     D  FIH3                   7      9  0
     D  FIH4                  10     12  0
     D  FIH5                  13     15  0
     D  FIH6                  16     18  0
     D  FIH7                  19     21  0
     D  FIH8                  22     24  0
     D  FIH9                  25     27  0
     D  FIH10                 28     30  0
     D  FIH11                 31     33  0
     D  FIH12                 34     36  0
     D  FIH13                 37     39  0
     D  FIH14                 40     42  0
     D  FIH15                 43     45  0
     D  FIH16                 46     48  0
     D  FIH17                 49     51  0
     D                 DS
     D  LE                     1     51  0
     D                                     DIM(17)
     D  FIL1                   1      3  0
     D  FIL2                   4      6  0
     D  FIL3                   7      9  0
     D  FIL4                  10     12  0
     D  FIL5                  13     15  0
     D  FIL6                  16     18  0
     D  FIL7                  19     21  0
     D  FIL8                  22     24  0
     D  FIL9                  25     27  0
     D  FIL10                 28     30  0
     D  FIL11                 31     33  0
     D  FIL12                 34     36  0
     D  FIL13                 37     39  0
     D  FIL14                 40     42  0
     D  FIL15                 43     45  0
     D  FIL16                 46     48  0
     D  FIL17                 49     51  0
     D                 DS
     D  BR                     1     51  0
     D                                     DIM(17)
     D  FIB1                   1      3  0
     D  FIB2                   4      6  0
     D  FIB3                   7      9  0
     D  FIB4                  10     12  0
     D  FIB5                  13     15  0
     D  FIB6                  16     18  0
     D  FIB7                  19     21  0
     D  FIB8                  22     24  0
     D  FIB9                  25     27  0
     D  FIB10                 28     30  0
     D  FIB11                 31     33  0
     D  FIB12                 34     36  0
     D  FIB13                 37     39  0
     D  FIB14                 40     42  0
     D  FIB15                 43     45  0
     D  FIB16                 46     48  0
     D  FIB17                 49     51  0
     D                 DS
     D  AN                     1     51  0
     D                                     DIM(17)
     D  FIA1                   1      3  0
     D  FIA2                   4      6  0
     D  FIA3                   7      9  0
     D  FIA4                  10     12  0
     D  FIA5                  13     15  0
     D  FIA6                  16     18  0
     D  FIA7                  19     21  0
     D  FIA8                  22     24  0
     D  FIA9                  25     27  0
     D  FIA10                 28     30  0
     D  FIA11                 31     33  0
     D  FIA12                 34     36  0
     D  FIA13                 37     39  0
     D  FIA14                 40     42  0
     D  FIA15                 43     45  0
     D  FIA16                 46     48  0
     D  FIA17                 49     51  0
     D                 DS
     D  VK                     1    119  2
     D                                     DIM(17)
     D  FIV1                   1      7  2
     D  FIV2                   8     14  2
     D  FIV3                  15     21  2
     D  FIV4                  22     28  2
     D  FIV5                  29     35  2
     D  FIV6                  36     42  2
     D  FIV7                  43     49  2
     D  FIV8                  50     56  2
     D  FIV9                  57     63  2
     D  FIV10                 64     70  2
     D  FIV11                 71     77  2
     D  FIV12                 78     84  2
     D  FIV13                 85     91  2
     D  FIV14                 92     98  2
     D  FIV15                 99    105  2
     D  FIV16                106    112  2
     D  FIV17                113    119  2
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     c     keytur        setll     gssorl21
     c     *in33         doweq     '0'
     c     keytur        reade     gssorl21                               33
     c     *in33         ifeq      '0'
     c     orono         chain     HLBFIL                             34
     c     *in34         ifeq      '0'
     c                   exsr      skriv
     C                   endif
     c                   endif
     c                   enddo
      *
     C                   SETON                                        LR
     C                   RETURN
      ***********************************************************************
     C     INIT          BEGSR
      ***********************************************************************
     C     *ENTRY        PLIST
     C                   PARM                    UTUR             11
     C                   PARM                    POST              1
     c                   move      'N'           post              1
     C     KEYTUR        KLIST
     C                   kfld                    ORTNO
     c                   move      utur          ORTNO
      *
     c                   move      *ZEROS        HO
     c                   move      *ZEROS        BR
     c                   move      *ZEROS        LE
     c                   move      *ZEROS        AN
     c                   move      *ZEROS        VK
      *
      *
     C                   MOVE      *ZEROS        WSTOTT            7 5
     C                   ENDSR
      ***********************************************************************
     C     SKRIV         BEGSR
      ***********************************************************************
     C                   Z-ADD     1             XN                2 0
     C                   DO        17
     C     HO(XN)        IFNE      0
     C                   MOVE      HO(XN)        FIHT
     C                   MOVE      LE(XN)        FILT
     C                   MOVE      BR(XN)        FIBT
     C                   MOVE      AN(XN)        FIAT
     C                   MOVE      VK(XN)        FIVT
     C                   WRITE     HLBFILTR
     c                   add       1             xn
     c                   move      'J'           post              1
     C                   end
     C                   enddo
     C                   ENDSR
