      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED KUNDEGRPPER                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 kan søke/sortere på gruppe
********************************************************************
      *
     FGSSCGL01  UF A E           K DISK
     FGSSCGF    IF   E           K DISK
     F                                     RENAME(GSSCGFR:GSSCGFRX)
N01  FGSSCGL02  IF   E           K DISK
N01  F                                     RENAME(GSSCGFR:GSSCGFRY)
     FGSSCCF    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FGSS003D   CF   E             WORKSTN
     F                                     SFILE(GSS003DA:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KNAVN                  1     30
     D  XDLT                   1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     GSS003DB
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     c
N01  c     W2CG          comp      *blanks                            5151      51 ON=via K.grp
S01  C*    W2CNO         SETLL     GSSCGF
N01  C   51W2CG          SETLL     GSSCGL02
N01  C  N51W2CNO         SETLL     GSSCGF
     C     START1        TAG
S01  C*                  READ      GSSCGF                                 94
N01  C   51              READ      GSSCGL02                               94
N01  C  N51              READ      GSSCGF                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C     CUND2K        CHAIN     CUNDL01                            33
     C   33              MOVE      *BLANKS       KNAVN
     C   33              MOVEL     '*UKJENT'     KNAVN
     C                   WRITE     GSS003DA
S01  C*                  READ      GSSCGF                                 94
N01  C   51              READ      GSSCGL02                               94
N01  C  N51              READ      GSSCGF                                 94
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     GSS003DG
     C                   ELSE
     C                   WRITE     GSS003DB
     C                   EXFMT     GSS003DC
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     11            POSNBR
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*** AVSLUTT
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
      *
      *** LAGE NY
     C     START5        TAG
     C                   EXFMT     GSS003DD
     C                   MOVEA     '00'          *IN(89)
     C                   SETOFF                                           30
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START5
     C                   END
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     GSS003DE
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     16            POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSCNO         COMP      0                                      90
     C  N90CUND1K        CHAIN     CUNDL01                            90
     C   90              MOVE      'GSS0014'     MSGNR
     C   90              SETON                                        30
     C  N90CGKEY         CHAIN(N)  GSSCGL01                           33
     C  N90
     CANN33              DO
     C                   MOVE      'JOV1289'     MSGNR
     C                   SETON                                        3090
     C                   END
     C   90              Z-ADD     22            LINNBR
     C   90              Z-ADD     11            POSNBR
     C                   END
      *
     C     WSCG          CHAIN     GSSCCF                             89
     C   89
     CANN30              MOVE      'GSS0016'     MSGNR
     C   89
     CANN30              Z-ADD     22            LINNBR
     C   89
     CANN30              Z-ADD     22            POSNBR
     C   89              SETON                                        30
      *
     C   30              GOTO      SLTB1
      *
      *** OPPDATERE PÅ REGISTER OG SUBFIL
     C     CGKEY         CHAIN     GSSCGL01                           33
     C  N33
     CANN40              UPDATE    GSSCGFR
     C  N33
     CANN40              GOTO      SLTB1
     C                   EXSR      MOVWCG
     C  N33              UPDATE    GSSCGFR
     C   33              WRITE     GSSCGFR
     C     CUND2K        CHAIN     CUNDL01                            33
     C   33              MOVE      *BLANKS       KNAVN
     C   33              MOVEL     '*UKJENT'     KNAVN
     C   40              UPDATE    GSS003DA
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     GSS003DA
     C                   WRITE     GSS003DB
     C                   EXSR      MOVB2
      *
     C     SLTB1         ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     GSS003DA                               98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGCG
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTCG
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'GSS0009'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGCG         BEGSR
     C***********************************************
     C                   EXSR      MOVCGW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     GSS003DD
     C                   MOVEA     '00'          *IN(89)
     C                   SETOFF                                         30
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      STCHG
     C                   END
     C   12              DO
     C                   UPDATE    GSS003DA
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTCG         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     GSS003DF
     C  N12              DO
     C     CGKEY2        CHAIN     GSSCGL01                           33
     C  N33              DELETE    GSSCGFR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    GSS003DA
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVWCG        BEGSR
     C***********************************************
     C                   MOVE      WSCNO         CGCNO
     C                   MOVE      WSCG          CGCG
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVCGW        BEGSR
     C***********************************************
     C                   MOVE      CGCNO         WSCNO
     C                   MOVE      CGCG          WSCG
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     22            POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        CGCNO
     C                   MOVE      *BLANKS       CGCG
     C                   MOVE      *BLANKS       KNAVN
     C                   MOVE      '*DELETE'     XDLT
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSCNO
     C                   MOVE      *BLANKS       WSCG
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKUNR        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSCNO
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG            1 0
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     11
     C     POSNBR        ANDLE     18
     C                   EXSR      SØKUNR
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     22
     C     POSNBR        ANDLE     23
     C                   CALL      'GSS002R'
     C                   PARM                    UFLAGG
     C                   PARM                    WSCG
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'GSS0013'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSCNO
     C     CUND2K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    CGCNO
      *
     C     CGKEY         KLIST
     C                   KFLD                    WSCNO
     C                   KFLD                    WSCG
     C     CGKEY2        KLIST
     C                   KFLD                    CGCNO
     C                   KFLD                    CGCG
      *
     C     *ENTRY        PLIST
     C                   PARM                    UFLAGG            1 0
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   ENDSR
      *
