     c                   eval      UUAVD  = 1
     c                   eval      UUOPD  = 155784
     c                   eval      DUPTELK= 'NO'
     c                   eval      DUPTERM= '1000'
     c                   eval      DUPFFVF= 'FF'
     c                   eval      UUUSER = 'JOVO'
     c                   eval      SIGN   = 'JOV'
     c                   eval      NYAVD  = 81
     c                   eval      NYOPD  = *zeros
     c                   eval      NYHEOT = 'SG'
     c                   eval      NYHEFR = 'S'
     c                   eval      NYFTXT = 'J'
     c                   eval      NYMODUL= ' '
     c                   eval      NYPKOD = ' '
     c                   eval      NYBNR  = *blanks
     c                   eval      NYTRAN = *zeros
     c                   eval      NYKOMM = *blanks
     c                   eval      NYBEL  = 2170
     c                   eval      NYBELK = 'A'
     c                   eval      ERRmsg = *blanks
     c                   eval      DUPIND = *blanks
      *
     C                   call      'LAGDUPNY'
     c                   parm                    UUAVD             4 0          mor-op.Avd INNparam
     c                   parm                    UUOPD             7 0          mor-op.Avd INNparam
     c                   parm                    DUPTELK           2            Dup via LK
     c                   parm                    DUPTERM           5            Dup via Stes
     c                   parm                    DUPFFVF           2            FF / VF-Dup
     c                   parm                    UUUSER           10            User som lager DUP
     c                   parm                    SIGN              3            HESG fra mor-oppdrag
     c                   parm                    NYAVD             4 0
     c                   parm                    NYOPD             7 0
     c                   parm                    NYHEOT            2            Otype
     c                   parm                    NYHEFR            3            Franka
     c                   parm                    NYFTXT            1            Kopier Fritekst
     c                   parm                    NYMODUL           1            ModulKo,Bla.=H=Trmod
     c                   parm                    NYPKOD            1            Produktkode
     c                   parm                    NYBNR            10            BILnummer, Rekvis
     c                   parm                    NYTRAN            8 0          Transpnr., Rekvis
     c                   parm                    NYKOMM           35            Kommentar, Rekvis
     c                   parm                    NYBEL            13 2          Beløp,     Rekvis
     c                   parm                    NYBELK            1            BeløpsKode Rekvis
     c                   parm                    ERRmsg          150
     c                   parm                    DUPIND            1            '0'=OK / '1'=Feilet
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
