********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 JOV PTF12 fdatafelt 80 -> 160 ...
********************************************************************
     Farklogh   O  A E             DISK
     Farklogd   O  A E             DISK
     Farklogt   UF a E           K DISK
     FEPOSTSRC  O    E             DISK
     F                                     RENAME(EPOSTSRC:EPOSTSR2)
     D                 DS
     D  XULTID                 1     14  0
     D  eptime                 1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D  XULDDMM                7     10  0
     D  XUL≈≈2                13     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  epdate                 1      8  0
     D                 DS
     D  srcdta                 1     40
s01  D* epdata                 1     80
n01  D  epdata                 1    160
     D                SDS
     D  UUSER                254    263
     C     *ENTRY        PLIST
     C                   PARM                    DATA2            40
     C                   PARM                    DATA3            40
     C                   PARM                    DATA4            40
     C                   PARM                    DATA5            40
     C                   PARM                    DATA6            40
     C                   PARM                    DATA7            40
     C                   PARM                    DATA8            40
     C                   PARM                    DATA9            40
     C                   PARM                    DATA10           70
     C                   PARM                    epcove           40
     C                   PARM                    eptil            70
     C                   PARM                    epauto            1
     C                   PARM                    uuunik            9
      *
      * henter dato klokka
      *
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     c                   move      uuser         epuser
      *
      * henter neste teller
      *
     c                   move      'A'           eptelk
     c     keytel        klist
     c                   kfld                    eptelk
     c     keytel        chain     arklogt                            33
     c                   add       1             epunik
     c  N33              update    arklogtr
     c   33              write     arklogtr
      *,
     c                   move      epunik        uuunik
      *
      * skriver f¯rste loggpost
      *
     c                   movel     epcove        srcdta
     c                   write     arkloghr
     c                   write     arklogdr
      *
     C     DATA2         IFNE      *BLANKS
     C                   MOVE      DATA2         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA3         IFNE      *BLANKS
     C                   MOVE      DATA3         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA4         IFNE      *BLANKS
     C                   MOVE      DATA4         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA5         IFNE      *BLANKS
     C                   MOVE      DATA5         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA6         IFNE      *BLANKS
     C                   MOVE      DATA6         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA7         IFNE      *BLANKS
     C                   MOVE      DATA7         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA8         IFNE      *BLANKS
     C                   MOVE      DATA8         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA9         IFNE      *BLANKS
     C                   MOVE      DATA9         SRCDTA
     C                   WRITE     EPOSTSR2
     c                   write     arklogdr
     C                   END
     C     DATA10        IFNE      *BLANKS
     C                   MOVEL     DATA10        EPDATA
     c                   write     arklogdr
     C                   END
     C                   SETON                                        LR
     C                   RETURN
