      *
      **************************************************************
      *** PROGRAM SKAL ARBEIDE MED TET-IMPORT LOSSEMERKNADER Item***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01-11 13-24
      *** LEDIGE INDIKATORER 28-32 34-99
      *** ALLE VARIABLER SOM STARTER MED 'X' ER ARBERDSVAR.      ***
      ***   OG DEFINERES I PROGRAM                               ***
      **************************************************************
      *
     FNCTSII    IF   E           K DISK
     FNCTS071D  CF   E             WORKSTN
     D                 DS
     D  TNCTX                  1    120A
     D  TNCTX_50               1     50A
     D                 DS
     D  TNPMRK                 1    120A
     D  TNPMRK_1               1    100A
     D  TNPMRK2              201    320A
     D  TNPMRK2_1            201    300A
     D  TNPMRK3              401    520A
     D  TNPMRK3_1            401    500A
     D  TNPMRK4              601    720A
     D  TNPMRK4_1            601    700A
     D  TNPMRK5              801    920A
     D  TNPMRK5_1            801    900A
     D                 DS
     D  TNAITX                 1    120A
     D  TNAITX_100             1    100A
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE
      *** F12 ---> AVBRYTT
     C   12              Z-ADD     1             UFLAGG
     C   12              GOTO      SLUTT
      *
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     NCTSIIK       KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    ULI
     C                   KFLD                    ULI2
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    ULI               5 0
     C                   PARM                    ULI2              5 0
     C     *IN27         PARM      *IN27         UIN27             1
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      UIN27         *IN27
      *
     C     NCTSIIK       CHAIN     NCTSII                             33
      *
     C                   ENDSR
      *
