      *
      ************************************************************
      *** PROGRAM SKAL ENDRE STATUS PÅ EL. TRANSITT            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 28 29 31-59 61-92                 ***
      ************************************************************
      *
     FKODTSI    IF   E           K DISK
     FNCTSEH    UF   E           K DISK
     FSTS       UF A E           K DISK
     FNCTS015D  CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTA                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  THDTA                  1      4  0
     D  THDTM                  5      6  0
     D  THDTD                  7      8  0
     D  THDT                   1      8  0
     D                 DS
     D  WSCNA                  1     22
     D  WSCNA1                 1     12
     D  WSCNA2                13     22
     D                 DS
     D  WSCANR                 1     17
     D  WSCANR1                1      6
     D  WSCANR2                7     12
     D                 DS
     D  WSEMC                  1     50
     D  WSEMC_40               1     40
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     NC015D01
     C                   SETOFF                                       999830
      *
     C   03              GOTO      SLUTT
     C     NCTSEHK       CHAIN     NCTSEH                             99
     C   99              DO
     C                   MOVE      'SPT0035'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     KODSIK        CHAIN     KODTSI                             98
     C   98              DO
     C                   UPDATE    NCTSEHR
     C                   MOVE      'SPS0001'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      THDTD         WSDTD
     C                   MOVE      THDTM         WSDTM
     C                   MOVE      THDTA         WSDTA
      *
     C                   EXFMT     NC015D02
      *
     C   05              DO
     C     START2        TAG
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           SSDT
     C                   MOVE      WTM           SSTM
     C     STSK          CHAIN     STS                                99
     C  N99              GOTO      START2
     C                   MOVE      WSAVD         SSAVD
     C                   MOVE      WSOPD         SSOPD
     C                   MOVE      WSUSER        SSUSR
     C                   MOVE      WSSG          SSSG
     C                   MOVE      'Q'           SSRTYP
     C                   MOVE      THST          SSSTG
     C                   MOVE      WSST          SSSTN
     C                   WRITE     STSR
      *
     C   05              MOVE      WSST          THST
     C                   UPDATE    NCTSEHR
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSST
     C                   SETOFF                                       99
     C                   END
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     KODSIK        KLIST
     C                   KFLD                    WSIUNI
     C                   KFLD                    WSSG
     C     NCTSEHK       KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     STSK          KLIST
     C                   KFLD                    SSDT
     C                   KFLD                    SSTM
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSUSER
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
      *
     C                   MOVE      'SI'          WSIUNI            2
      *
     C                   ENDSR
      *
