      *
     FSADH5B    IF   E           K DISK
      *
     C                   MOVEL     '2019'        X_SITLL          10
     C                   MOVE      'PRT'         XTYPE             3
     C                   MOVE      'QPRINT2   '  W3PRT1           10
     C                   MOVE      'QPRINT2   '  W3PRT2           10
     C                   MOVE      'QPRINT2   '  W3PRT3           10
     C                   MOVE      ' '           UMODE             1
      *
     C     X_SITLL       SETLL     SADH5B
     C                   READ      SADH5B                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        SIST = 'P'
     C                   CALL      'SAD061CL'
     C                   PARM      SIAVD         U_AVD             4 0
     C                   PARM      SITDN         U_TDN             7 0
     C                   PARM                    SISG
     C                   PARM                    XTYPE
     C                   PARM                    UMODE
     C                   CALL      'SAD61P01'
     C                   PARM                    W3PRT1
     C                   PARM                    W3PRT2
     C                   PARM                    W3PRT3
     C                   END
     C                   READ      SADH5B                                 33
     C                   ENDDO
      *
     C                   SETON                                        LR
     C                   RETURN
      *
