      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 opning fil feil    .....
10XXX * 02 YBC PTF10 FEIL INDIKATOR-TEST PÅ DOKEQMOLD
********************************************************************
     FSAMLA     UF   E           K DISK    USROPN
     FDOKEQM    UF   E           K DISK    USROPN
     FHEAD19    IF   E           K DISK
     FSAMLAOLD  O  A E           K DISK    USROPN
     F                                     RENAME(SAMLAR:SAMLARO)
     FDOKEQMOLD O  A E           K DISK    USROPN
     F                                     RENAME(DOKEQMR:DOKEQMRO)
     D                 DS
     D  HESAML                 1      6
     D  SMSD                   1      3
     D  SMLNR                  4      6  0
     D  DQSLD                  1      3
     D  DQSLNR                 4      6  0
      *
     C     *ENTRY        PLIST
     C                   PARM                    UDELETE           1
     C     UDELETE       COMP      'N'                                5050
      *
     C                   EXSR      OPENFILES
      *
     C                   IF        XSAMLA = 'Y'
     C     *LOVAL        SETLL     SAMLA
     C                   READ      SAMLA                                  33
     C                   DOW       *IN33 = *OFF
     C     HESAML        CHAIN     HEAD19                             33
     C                   IF        *IN33
     C  N50              WRITE     SAMLARO
     C                   DELETE    SAMLAR
     C                   ELSE
     C                   UPDATE    SAMLAR
     C                   END
     C                   READ      SAMLA                                  33
     C                   ENDDO
     C                   END
      *
     C                   IF        XDOKEQM = 'Y'
     C     *LOVAL        SETLL     DOKEQM
     C                   READ      DOKEQM                                 33
     C                   DOW       *IN33 = *OFF
     C     HESAML        CHAIN     HEAD19                             33
     C                   IF        *IN33
S02  C*                  WRITE     DOKEQMRO
S02  C* N50              DELETE    DOKEQMR
N02  C  N50              WRITE     DOKEQMRO
N02  C                   DELETE    DOKEQMR
     C                   ELSE
     C                   UPDATE    DOKEQMR
     C                   END
     C                   READ      DOKEQM                                 33
     C                   ENDDO
     C                   END
      *
     C                   EXSR      CLOSEFILES
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
     C***********************************************
     C     OPENFILES     BEGSR
     C***********************************************
     C                   OPEN      SAMLA
     C                   READ(N)   SAMLA                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XSAMLA            1
s01  C* N50              OPEN      SAMLAOLD
n01  C                   OPEN      SAMLAOLD
     C                   ELSE
     C                   CLOSE     SAMLA
     C                   END
      *
     C                   OPEN      DOKEQM
     C                   READ(N)   DOKEQM                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEQM           1
s01  C* N50              OPEN      DOKEQMOLD
n01  C                   OPEN      DOKEQMOLD
     C                   ELSE
     C                   CLOSE     DOKEQM
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     CLOSEFILES    BEGSR
     C***********************************************
     C                   IF        XSAMLA = 'Y'
s01  C* N50              CLOSE     SAMLAOLD
n01  C                   CLOSE     SAMLAOLD
     C                   CLOSE     SAMLA
     C                   END
      *
     C                   IF        XDOKEQM = 'Y'
s01  C* N50              CLOSE     DOKEQMOLD
n01  C                   CLOSE     DOKEQMOLD
     C                   CLOSE     DOKEQM
     C                   END
      *
     C                   ENDSR
      *
