      ***********************************************************
      *** reorganisering statistikk                           ***
      ***********************************************************
      *
s01  F*tatohfl3 IF   E           K DISK
s01  Fstatohl3  IF   E           K DISK
     Fstatodl1  Up   E           K DISK
     c*
     C     key           klist
     C                   kfld                    ststnr
     c*
     c     ststnr        ifne      forige
s01  c*    key           chain     statohfl3                          33
s01  c     key           chain     statohl3                           33
     c                   move      ststnr        forige           11 0
     c                   end
     c     *in(33)       ifeq      '1'
     c                   delete    statdfr
     c                   end
