     FSAD010MELDCF   E             WORKSTN
     C                   EXFMT     BILDE01
     C                   SETON                                        LR
     C                   RETURN
