      *** slette fra forenklet prosedyre                      ***
     FSADH      UF   E           K DISK
     FFPXREF    UF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
      *
      *
N10  C     KEY           KLIST
N10  C                   KFLD                    UAVD2
N10  C                   KFLD                    UOPD2
     c                   move      uavd          uavd2             4 0
     c                   move      uopd          uopd2             7 0
      *-------------------------------------------------------------------
      * først fpxref
      *-------------------------------------------------------------------
     C     key           chain     fpxref                             33
     c     *in33         ifeq      '0'
     c     fpstat        ifeq      ' '
     c     fpstat        oreq      'A'
     c                   delete    fpxrefr
     c                   end
     c                   end
      *-------------------------------------------------------------------
      * deretter sadh
      *-------------------------------------------------------------------
      *
     C     key           chain     sadh                               33
     c     *in33         ifeq      '0'
     C     key           chain     sadh                               33
N10  C                   move      ' '           sist
     c                   except    opdsadh
N10  C                   end
      *
     c                   seton                                        lr
     c                   return
     OSADHR     E            OPDSADH
     O                       SIST
