********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 SH  PTF12 ikke skriv post ved arkivering
12XXX * 02 SH  PTF12 ikke til FAKt ved beløp=0
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL LAGE GEBYR FOR SPESIFIKASJON           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-87 95-97    ***
      ***********************************************************
      *
     FHEADF     IF   E           K DISK
     FFAKT      IF A E           K DISK
     FSADHSGEB  IF   E           K DISK
N01  D                SDS
N01  D  UUSR                 254    263
      *
     C                   EXSR      INIT
      *
     C     HEADFK        CHAIN     HEADF                              33
     C                   IF        *IN33 = *OFF
     C     UKN           CHAIN     SADHSGEB                           33
     C   33SGKN          CHAIN     SADHSGEB                           33
     C                   IF        *IN33 = *OFF
      * SJEKK OM GEBYR FINNES
     C     HEADFK        SETLL     FAKT
     C     HEADFK        READE     FAKT                                   33
     C                   DOW       *IN33 = *OFF
     C                   IF        FAVK = SGGKD
     C                   GOTO      SLUTT
     C                   END
     C     HEADFK        READE     FAKT                                   33
     C                   ENDDO
      *
      * LAGE EN FAKTURALINJE
N02  C     SGBEL         IFNE      0
     C                   CLEAR                   FAKTR
     C                   CALL      'SYGE06'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    FALI
     C                   EVAL      FAAVD  = UAVD
     C                   EVAL      FAOPD  = UOPD
     C                   EVAL      FASK   = 'K'
     C                   EVAL      FAVK   = SGGKD
     C                   EVAL      FAVAL  = 'NOK'
     C                   EVAL      FABELV = SGBEL
     C                   EVAL      FABELN = SGBEL
     C                   EVAL      FAKDM  = SGMV
     C                   EVAL      FAKDA  = 'M'
     C                   EVAL      FAKUNR = UKN
     C                   WRITE     FAKTR
N06  c                   end
      *
     C                   END
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UAVDa             4
     C                   PARM                    UOPDa             7
     C                   PARM                    UKNa              8
     C                   move      UAVDa         UAVD              4 0
     C                   move      UOPDa         UOPD              7 0
     C                   move      UKNa          UKN               8 0
      *
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
      *
     C                   ENDSR
      *
