********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 Bilfortolling henter linjenr fra SADW
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL HENTE CONTAINERNR TIL TVINN/UTSKRIFT   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26
      *** LEDIGE INDIKATORER 27-32 34-99
      ***********************************************************
      *
N01  FSADW      IF   E           K DISK
     FSADV4     IF   E           K DISK
     FSADVCN    IF   E           K DISK
     D                 DS
     D  CNR50                  1    850
     D  CNR                    1    850    DIM(50)
      *
     C                   EXSR      INIT
      *
     C     SADV4K        SETLL     SADV4
     C     SADV4K        READE     SADV4                                  33
N01  C                   IF        *IN33
N01  C     SADV4K        CHAIN     SADW                               33
N01  C                   EVAL      SVLI = SWLI
N01  C                   MOVE      'J'           XBILFORT          1
N01  C                   END
     C                   DOW       *IN33 = *OFF                                 1<-B
      *
     C     SADVCNK       SETLL     SADVCN
     C     SADVCNK       READE     SADVCN                                 33     2<-B
     C                   DOW       *IN33 = *OFF
      *
     C     1             DO        50            XN                3 0            3<-B
     C                   SELECT                                                    4<-B
     C                   WHEN      CNR(XN) = *BLANKS                               4
     C                   EVAL      CNR(XN) = SVCNR
     C                   LEAVE
     C                   WHEN      CNR(XN) = SVCNR                                 4
     C                   LEAVE
     C                   ENDSL                                                     4<-E
     C                   ENDDO                                                    3<-E
N01  C                   IF        XBILFORT = 'J'                                 3<-B
N01  C                   LEAVE
N01  C                   END                                                      3<-E
      *
     C     SADVCNK       READE     SADVCN                                 33
     C                   ENDDO                                                   2<-E
      *
     C     SADV4K        READE     SADV4                                  33
     C                   ENDDO                                                  1<-E
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     SADV4K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    ULN
     C     SADVCNK       KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    SVLI

     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    ULN               5 0
     C                   PARM      CNR50         UCNR            850
      *
     C                   ENDSR
      *
