********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 OPPDATERER FRISOK/TRACK/TRACE
10172 * 02 SH  PTF10 norsk text til Track and trace
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11062 * 02 YBC PTF11 TEST PÅ GODKJENNINGSDATO
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12XXX * 03 YBC PTF12 REKORD-LÅS
********************************************************************
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TOLLVESENETS LØPENR./DATO ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-32 34-39 41-89 95-97          ***
      ***********************************************************
      *
N01  FTRACKF    O  A E           K DISK
N01  FFRISOK    UF A E           K DISK
N01  FKODFRI    IF   E           K DISK
N01  FFIRM      IF   E           K DISK
S03  F*SAEH      UF   E           K DISK
N03  FSAEH      IF   E           K DISK
     FSADH      UF   E           K DISK
     FHEAD35    IF   E           K DISK
     F                                     RENAME(HEADFR:HEADfr35)
     FHEADF     UF   E           K DISK
     FSAD006Fb  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
N01  D                SDS
N01  D  ZUSER                254    263
N01  D                 DS
N01  D  XULTID                 1     14  0
N01  D  XULTM                  1      6  0
N01  D  XULDD                  7      8  0
N01  D  XULMM                  9     10  0
N01  D  XULÅÅ                 11     14  0
N01  D                 DS
N01  D  ULÅÅ                   1      4  0
N01  D  ULMM                   5      6  0
N01  D  ULDD                   7      8  0
N01  D  ULDT                   1      8  0
N01  D                 DS
N01  D  HETLE                  1      6
N01  D  HETLL                  8     17
N01  D  HETOLL                 1     17
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  HENAK                  1     30
     D  HENAK20                1     20
     D                 DS
     D  HERFK                  1     35
     D  HERFK17                1     17
     C*
     C                   EXSR      INIT
     C                   GOTO      START6
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     headk35       SETLL     HEAD35
     C     START1        TAG
     C                   READ      HEAD35                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   move      herfk         W2EXTB           35
N01  C                   setoff                                       88
N01  C                   CLEAR                   SADHR
N01  C                   CLEAR                   SAEHR
S03  C*    HEADK         CHAIN     SADH                               33
N03  C     HEADK         CHAIN(N)  SADH                               33
N01  C  N33SIST          COMP      ' '                                8888
N01  C  N33              MOVEL     SIDTG         HEDTMO
N01  C     *IN(33)       ifeq      '1'
N01  C     HEADK         CHAIN     SAEH                               33
N01  C  N33              MOVEL     SEDTG         HEDTMO
N01  C  N33SEST          COMP      ' '                                8888
N01  C                   END
     C                   WRITE     SUBFIL
     C                   READ      HEAD35                                 94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     4             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C   12              MOVE      *ZEROS        UAVD
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C* N94HEADK35B      SETLL     HEAD35
     C  N94              READ      HEAD35                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      GETSI
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C*** TEST OM MAN HAR TASTET NOE
     C     WSDTG         COMP      *BLANKS                                90
     C   90WSTLL         COMP      *BLANKS                                90
     C   90WSTLE         COMP      *BLANKS                                90
N01   * TEST DATOFORMATO
N01  C                   IF        WSDTG <> *BLANKS
N01  C                   MOVE      *BLANKS       XAN02             2
N01  C                   IF        %SUBST(WSDTG:1:2) <> '20'
N01  C                   EVAL      *IN89 = *ON
N01  C                   ELSE
N01  C     '.'           SCAN      WSDTG                                  89
N01  C                   IF        *IN89 = *OFF
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:3:2)
N01  C                   MOVE      XAN02         UAA
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:5:2)
N01  C                   MOVE      XAN02         UMM
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:7:2)
N01  C                   MOVE      XAN02         UDD
N01  C                   CALL      'TESTDATO'
N01  C                   PARM                    UDD               2 0
N01  C                   PARM                    UMM               2 0
N01  C                   PARM                    UAA               2 0
N01  C                   PARM                    FLAGG             1 0
N01  C     FLAGG         COMP      1                                      89
N01  C                   END
N01  C                   END
N01  C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     GETSI         BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLGET
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      CHGSI
     C   12              GOTO      SLGET
     C                   END
     C                   END
     C*
     C     SLGET         TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     4             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSI         BEGSR
     C***********************************************
     C                   EXSR      MOVSIW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       90
N01  C                   MOVE      '0'           *IN89
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 90              GOTO      STCHG
N01  C  N12
N01  CAN 89              GOTO      STCHG
     C  N12              EXSR      OPDSI
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDSI         BEGSR
     C***********************************************
     C     HEADK         CHAIN     SADH                               33
     C  N33              DO
     C                   MOVEL     WSDTG         SIDTG
     C                   MOVE      WSTLL         SITLL
     C                   MOVE      WSTLE         SITLE
     C                   EXCEPT    NYSI
     C                   END
     C     HEADK         CHAIN     HEADF                              33
     C  N33              DO
     C                   MOVE      WSTLL         HETLL
     C                   MOVE      WSTLE         HETLE
     C                   MOVEL     WSDTG         HEDTMO
     C                   EXCEPT    NYHEAD
     C                   END
      *
      * EKSPEDISJONSSTED
N01  C     FRIKEY        KLIST
N01  C                   KFLD                    HEAVD
N01  C                   KFLD                    HEOPD
N01  C                   KFLD                    FSKODE            3
N01  C                   MOVE      'TLØ'         FSKODE
N01  C     FRIKE2        KLIST
N01  C                   KFLD                    HEAVD
N01  C                   KFLD                    HEOPD
N01  C                   KFLD                    FSKOD2            3
N01  C                   MOVE      'TLE'         FSKOD2
N01  C     WSTLL         IFNE      *BLANKS
N01  C     WSTLE         ANDNE     *BLANKS
N01  C     FSKOD2        CHAIN     KODFRI                             77
N01  C     FRIKE2        CHAIN     FRISOK                             77
N01  C                   MOVE      *BLANKS       FSSOK
N01  C                   MOVEL     WSTLE         FSSOK
N01  C                   MOVEL     KFSODK        FSDOKK
N01  C  N77              UPDATE    FRISOKR
N01  C   77              MOVE      HEAVD         FSAVD
N01  C   77              MOVE      HEOPD         FSOPD
N01  C   77              MOVE      FSKOD2        FSKODE
N01  C   77              MOVE      HEDTOP        FSDTOP
N01  C   77              WRITE     FRISOKR
N01   * LØPENUMMER
N01  C                   MOVE      'TLØ'         FSKODE
N01  C     FSKODE        CHAIN     KODFRI                             77
N01  C     FRIKEY        CHAIN     FRISOK                             77
N01  C                   MOVE      *BLANKS       FSSOK
N01  C                   MOVEL     WSTLL         FSSOK
N01  C                   MOVEL     KFSODK        FSDOKK
N01  C  N77              UPDATE    FRISOKR
N01  C   77              MOVE      HEAVD         FSAVD
N01  C   77              MOVE      HEOPD         FSOPD
N01  C   77              MOVE      HEDTOP        FSDTOP
N01  C   77              WRITE     FRISOKR
N01  C     FIURBL        IFEQ      'J'                                            3<-B
N01  C     HEUR          IFEQ      'A'                                             4<-B
N01  C     HEUR          OREQ      'C'                                             4<-B
N01  C     HEUR          OREQ      'F'                                             4<-B
N01  C     HEUR          OREQ      'H'                                             4<-B
N01  C                   MOVE      'ITK'         TTACTI
N01  C                   ELSE                                                      4
N01  C                   MOVE      'ETK'         TTACTI
N01  C                   END                                                       4<-E
N01  C                   EXSR      TTSR
N01  C                   END                                                      3<-E
N01  C                   END                                                      3<-E
      *
     C*
     C   40              UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSIW        BEGSR
     C***********************************************
     C                   MOVEL     HEDTMO        WSDTG
     C                   MOVE      HETLL         WSTLL
     C                   MOVE      HETLE         WSTLE
     C                   SETON                                        40
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSTLL
     C                   MOVE      *ZEROS        WSTLE
     C                   MOVE      *BLANKS       WSDTG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     HEADK         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     HEADK35       KLIST
     C                   KFLD                    W2EXT
     C     HEADK35B      KLIST
     C                   KFLD                    W2EXTB
     C*
N01  C                   READ      firm                                   33
     C*
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   WRITE     NYWRK
     C*
     C                   ENDSR
     C*
N01  C***********************************************
N01  C     TTSR          BEGSR
N01  C***********************************************
N01  C                   MOVE      HEAVD         TTAVD
N01  C                   MOVE      HEOPD         TTOPD
N01  C                   TIME                    XULTID
N01  C                   MOVE      XULDD         ULDD
N01  C                   MOVE      XULMM         ULMM
N01  C                   MOVE      XULÅÅ         ULÅÅ
N01  C                   MOVE      ULDT          TTDATE
N01  C                   MOVE      XULTM         TTTIME
N01  C                   MOVE      TTDATE        TTDATL
N01  C                   MOVE      TTTIME        TTTIML
N01  C                   MOVEL     ZUSER         TTUSER
N01  C                   MOVEL     'Accept c'    XXTEXT           16
N01  C                   MOVE      'ustoms  '    XXTEXT
N02  C                   MOVEL     'Godkjent'    XXTEXl           16
N02  C                   MOVE      ' tollnr '    XXTEXl
N01  C                   MOVEL     XXTEXT        TTTEXT
N01  C                   MOVE      HETOLL        TTTEXT
N01  C                   WRITE     TRACKFR
N01  C                   ENDSR
      *
     OHEADFR    E            NYHEAD
     O                       HETLL
     O                       HETLE
N01  O                       HEDTMO
     OSADHR     E            NYSI
     O                       SIDTG
     O                       SITLL
     O                       SITLE
