********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12248 * 44 YBC PTF12 VEKT, KOLLI ER UTVIDET.
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VISE KONVERTERT UTG. SAD-IMPORT LINJER ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      ***********************************************************
      *
     FSAEHEDI   IF   E           K DISK
     FSAEVEDI   IF   E           K DISK
     FSAD017FA  CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
N01  D                 DS
N01  D  SVVKTB                 1     11  0
N01  D  SVVKTB9                3     11  0
N01  D                 DS
N01  D  SVVKTN                 1     11  0
N01  D  SVVKTN9                3     11  0
N01  D                 DS
N01  D  SVNTM                  1     11  0
N01  D  SVNTM9                 3     11  0
N01  D                 DS
N01  D  SVNT                   1      9  0
N01  D  SVNT6                  4      9  0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SAEVEDIK      SETLL     SAEVEDI
     C     START1        TAG
     C     SAEHEDIK      READE     SAEVEDI                                94
      *
     C     START2        TAG
      *
     C                   DOW       *IN94 = *OFF
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     SAEHEDIK      READE     SAEVEDI                                94
     C  N94              END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   IF        ZRECNO > 1
     C                   Z-ADD     1             ZRECNO
     C                   END
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
      *
      ***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
      ***
      *
     C                   SETOFF                                       9830
      *
      *** F3  ---> AVSLUTTE SPØRRING
     C   03              Z-ADD     3             UFLAGG
     C   03              GOTO      SLUTT
      *** F12 ---> AVBRYT OG GÅ TILBAKE TIL DEL-1
     C   12              Z-ADD     1             UFLAGG
     C   12              GOTO      SLUTT
      *** F5  ---> VISE STARTEN AV SUBFIL
     C   05              GOTO      START
      *** F8  ---> VELGE SORTERINGSMÅTE OG START POST FOR SUBFIL
     C   08              GOTO      START7
      *
      *** SJEKKE OM BRUKER HAR VALGT OPSJONER. HIVS SÅ,T UTFØRE DISSE.
     C     ZRECNO        IFNE      0
     C                   EXSR      VLHENT
     C                   END
      *** 98 PÅ ---> BRUKER HAR IKKE VALGT OPSJON. VISE SAMME POSTER
      ***            I SUBFIL DVS. SAMME RECORDNR.
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
      *
     C     START7        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     VLHENT        BEGSR
      ***********************************************
      *** SJEKKE OM BRUKER HAR VALGT NOEN OPSJONER. HVIS IKKE, SETTER
      *** IND. 98 PÅ OG GIR FEILMELDING TIL BRUKER.
      *** OPSJON 5 ---> VISE DETALJER AV POST.
      *** LINNBR, POSNBR ---> RETUR POSISJON AV CURSOR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              SETON                                            30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       19            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     19            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '5'
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   EVAL      *IN99 = *ON
     C                   EXFMT     VAREL3
     C   12              GOTO      SLHENT
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C                   ADD       3             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     SAEHEDIK      KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C     SAEVEDIK      KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    WSLI
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    UFLAGG            1 0
      *
     C     SAEHEDIK      CHAIN     SAEHEDI                            33
      *
     C                   ENDSR
      *
