     H DFTACTGRP(*NO)
     fsaefnjl2  if   e           k disk
     fsaeh      if   e           k disk    rename(saehr:saehr0)
     f                                     prefix(S0_)
     fsad052fw  cf   e             workstn
     d                 ds
     d xdt                            6  0
     d  xdtd                          2  0 overlay(xdt)
     d  xdtm                          2  0 overlay(xdt:3)
     d  xdta                          2  0 overlay(xdt:5)
     d                 ds
     d wsfdt2                         8  0
     d  wsfdt2a                       2  0 overlay(wsfdt2:3)
     d  wsfdt2m                       2  0 overlay(wsfdt2:5)
     d  wsfdt2d                       2  0 overlay(wsfdt2:7)
     ‚*  Prototype for sad052w
     d sad052w         pr
     d uavd_                               like(uavd)
     d utdn_                               like(utdn)
     d urg_                                like(urg)
     d ufn_                                like(ufn)
     d udt_                                like(udt)
     d uflagg_                             like(uflagg)
     ‚*  *ENTRY Interface for Main Procedure
     d sad052w         pi
     d uavd                           4  0
     d utdn                           7  0
     d urg                           11
     d ufn                           17
     d udt                            6  0
     d uflagg                         1  0

     d xdt2            s              8  0
     d wsdt2           s              6  0


      /free
       uflagg = 0;
       if udt <> 999999;
       write windowsz;

       xdt = udt;
       xdt2 = 20000000 + xdta * 10000 + xdtm * 100 + xdtd - 10000;

       clear saehr;
       clear sadfr;
       setll (ufn) saefnjl2;
       reade (ufn) saefnjl2;
       dow not %eof;
           select;
           when sefif = ufn and sefid > xdt2;
             chain (seavd: setdn) saeh;
               if (seavd <> uavd or setdn <> utdn) and s0_serg = urg;
                 wsavd = seavd;
                 wstdn = setdn;
                 wsfdt2 = sefid;
                 wsfdt = wsfdt2d * 10000 + wsfdt2m * 100 + wsfdt2a;
                 wsjn = 'N';
                 exfmt bilde01;
                 if wsjn = 'N';
                   uflagg = 1;
                 endif;
                 *inlr = *on;
                 return;
               endif;
           when sftxt = ufn and sfdt > xdt2;
             chain (sfavd: sfopdn) saeh;
             if (sfavd <> uavd or sfopdn <> utdn) and s0_serg = urg;
               wsavd = sfavd;
               wstdn = sfopdn;
               wsfdt2 = sfdt;
               wsfdt = wsfdt2d * 10000 + wsfdt2m * 100 + wsfdt2a;
               wsjn = 'N';
               exfmt bilde01;
               if wsjn = 'N';
                   uflagg = 1;
               endif;
               *inlr = *on;
               return;
             endif;
           endsl;

           clear saehr0;
           clear saehr;
           clear sadfr;
           reade (ufn) saefnjl2;
       enddo;

       endif;

       *inlr = *on;
       return;

      /end-free
