      *
     FEDIM12    IF   E           K DISK
     FSADH      IF   E           K DISK
     FSAEH      IF   E           K DISK
     FTRACKF    O  A E             DISK
     FSAD072D   CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTA                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  XDTA                   1      4  0
     D  XDTM                   5      6  0
     D  XDTD                   7      8  0
     D  XDT                    1      8  0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVE      '0'           *IN99
     C                   MOVE      '0'           *IN30
      *
     C   03              GOTO      SLUTT
      *
     C                   MOVE      WSDTD         UDD               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTA         UAA               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UAA
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      99
     C   99              EVAL      *IN30 = *ON
     C   99              GOTO      START
      *
     C                   EVAL      XDT = 20000000 + WSDTA * 10000
     C                             + WSDTM * 100 + WSDTD
     C     EDIM12K       SETLL     EDIM12
     C     EDIM12K       READE     EDIM12                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        MSR = 'S'
     C                   SELECT
     C                   WHEN      M1001 = '929'
     C                   MOVE      MAVD          AAVD              4
     C                   MOVE      MTDN          ATDN              7
     C                   MOVE      'I'           TDTYP             1
     C                   CALL      'PDF001CL3'
     C                   PARM                    AAVD
     C                   PARM                    ATDN
     C                   PARM                    TDTYP
     C                   EXSR      TTSRIMP
     C                   WHEN      M1001 = '830'
     C                   MOVE      MAVD          AAVD              4
     C                   MOVE      MTDN          ATDN              7
     C                   MOVE      'E'           TDTYP             1
     C                   CALL      'PDF001CL3'
     C                   PARM                    AAVD
     C                   PARM                    ATDN
     C                   PARM                    TDTYP
     C                   EXSR      TTSREXP
     C                   ENDSL
     C                   END
     C     EDIM12K       READE     EDIM12                                 33
     C                   ENDDO
      *
     C                   EVAL      WSDT = 0
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ************************************************************
     C     TTSRIMP       begsr
      ************************************************************
     C     SADHK         CHAIN     SADH                               33
      *
     c                   clear                   trackfr
      * skriver til track & trace
     C                   eval      tttext='Re-Transferred XML of custdec to:'
     C                             + ' EMMA'
     C                   eval      tttexl='Re-Overført XML av tolldek til:'
     C                             + ' EMMA'
     C                   MOVE      'XML'         TTACTI
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      AAVD          TTAVD
     C                   MOVE      ATDN          TTOPD
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           TTDATE
     C                   MOVE      WTM           TTTIME
     C                   MOVE      WDT           TTDATL
     C                   MOVE      WTM           TTTIML
     C                   MOVEL     'SYSTEMA'     TTUSER
     C                   MOVEL     SINAK         TTNAME
     C                   WRITE     TRACKFR
      *
     C                   ENDSR
      *
      ************************************************************
     C     TTSREXP       begsr
      ************************************************************
     C     SAEHK         CHAIN     SAEH                               33
     c                   clear                   trackfr
      * skriver til track & trace
     C                   eval      tttext='Re-Transferred XML of custdec to:'
     C                             + ' EMMA'
     C                   eval      tttexl='Re-Overført XML av tolldek til:'
     C                             + ' EMMA'
     C                   MOVE      'XML'         TTACTI
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      AAVD          TTAVD
     C                   MOVE      ATDN          TTOPD
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           TTDATE
     C                   MOVE      WTM           TTTIME
     C                   MOVE      WDT           TTDATL
     C                   MOVE      WTM           TTTIML
     C                   MOVEL     'SYSTEMA'     TTUSER
     C                   MOVEL     SENAS         TTNAME
     C                   WRITE     TRACKFR
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     EDIM12K       KLIST
     C                   KFLD                    M0010
     C                   KFLD                    XDT
     C     SADHK         KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C     SAEHK         KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
      *
     C                   EVAL      M0010 = 'EMMA'
     C                   EVAL      WSDT  = 0
      *
     C                   ENDSR
      *
