      *
     c*                  eval      Utype='getHouseConsignment.do'
     c*                  eval      Ulrn ='7e49e843-1bf0-4b30-87e9-bef7f318d3a7'
     c                   eval      Utype='postHouseConsignment.do'
     C                   CALL      'SAD160SND'
     c                   parm                    UType            30
     c                   parm      '00501943'    Upro              8
     c                   parm      '0000'        Uavd              4
     c                   parm      '0000042'     Uopd              7
     c                   parm                    UMRN             18
     c                   parm                    Ulrn             36
     c                   parm                    Ufilename        45
      *
     c                   seton                                        LR
     c                   return
