      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE EKSPRESSFORT. - DEFAULT   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 07 09-14 17-24             ***
      *** LEDIGE INDIKATORER 29 31 32       52-75 78-89       ***
      ***********************************************************
      *
     FSADEFDEF  IF   E           K DISK
     FTELL      IF   E           K DISK
     FSAD138D   CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W3AVD         SETLL     SADEFDEF
     C     START1        TAG
     C                   READ      SADEFDEF                               94
      *
     C     START2        TAG
      *
     C                   DOW       *IN94 = *OFF
     C                   ADD       1             ZRECNO
     C     EFAVD         CHAIN     TELL                               33
     C  N33              MOVE      TETURN        EFPRO
     C   33              MOVE      *ZEROS        EFPRO
     C                   WRITE     SUBFIL
     C                   READ      SADEFDEF                               94
     C                   ENDDO
      *
     C                   IF        ZRECNO > 19
     C                   EVAL      ZRECNO = 1
     C                   END
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C                   WRITE     BUNN
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   EXFMT     SUBCTL
     C                   END
      *
      *** AVSLUTT
     C                   MOVE      '0'           *IN30
     C                   MOVEA     '00'          *IN(98)
     C   03              GOTO      SLUTT
     C   05              GOTO      START
     C     START4        TAG
     C   06              DO
     C                   EXSR      CRTTUR
     C                   GOTO      START
     C                   ENDDO
     C   08              DO
     C                   GOTO      START6
     C                   ENDDO
     C   12              GOTO      SLUTT
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     START6        TAG
     C                   MOVE      *ZEROS        W3AVD
     C                   EXFMT     VAREL2
      *
     C   12              GOTO      START3
     C                   GOTO      START
      *
     C     SLUTT         TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     HENT          BEGSR
      ***********************************************
     C                   MOVE      *BLANKS       MSGNR
     C                   MOVEA     '000'         *IN(90)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'                                          1<-B
     C                   READC     SUBFIL                                 98
     C     *IN98         IFEQ      '0'                                           2<-B
     C                   SELECT                                                   3<-B
     C     WSNR          WHENEQ    2                                              3
     C                   MOVE      '1'           *IN99
     C                   EXSR      CHGTUR
     C     WSNR          WHENEQ    5                                              3
     C                   MOVE      '1'           *IN99
     C                   EXSR      DSPTUR
     C                   ENDSL                                                    3<-E
     C                   END                                                     2<-E
     C                   ENDDO                                                  1<-E
      *
     C     SLHENT        TAG
     C   98
     CANN99              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   END
     C                   MOVE      '0'           *IN99
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPTUR        BEGSR
     C***********************************************
     C                   MOVE      'DSP'         XTYPE                          SPØRRING
     C                   CALL      'SAD139R'
     C                   PARM      EFAVD         U_AVD             4 0
     C                   PARM                    XTYPE             3
     C                   PARM                    UFLAGG            1 0
     C  N90              MOVE      *ZEROS        WSNR
     C  N90              UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     CHGTUR        BEGSR
     C***********************************************
     C                   MOVE      'CHG'         XTYPE             3
     C                   CALL      'SAD139R'
     C                   PARM      EFAVD         U_AVD             4 0
     C                   PARM                    XTYPE
     C                   PARM                    UFLAGG            1 0
      *
     C     EFAVD         CHAIN     SADEFDEF                           33
     C     EFAVD         CHAIN     TELL                               33
     C  N33              MOVE      TETURN        EFPRO
     C   33              MOVE      *ZEROS        EFPRO
     C  N90              MOVE      *ZEROS        WSNR
     C  N90              UPDATE    SUBFIL
      *
     C                   ENDSR
      *
      ***********************************************
     C     CRTTUR        BEGSR
      ***********************************************
     C                   MOVE      *ZEROS        U_AVD
     C                   MOVE      'CRT'         XTYPE             3
     C                   CALL      'SAD139R'
     C                   PARM                    U_AVD             4 0
     C                   PARM                    XTYPE
     C                   PARM                    UFLAGG            1 0
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C                   ENDSR
      *
