     fsadhan    uf   e             disk
     ‚*  Prototype for 'SAD62R4'
     d sadhanr1        pr                  extpgm('SADHANR1')
     d udtfra_                             like(udtfra)
     d udttil_                             like(udttil)
     d ukns_                               like(ukns)
     d uknk_                               like(uknk)
     d sadhanr2        pr                  extpgm('SADHANR2')
     d udtfra_                             like(udtfra)
     d udttil_                             like(udttil)
     d ukns_                               like(ukns)
     d uknk_                               like(uknk)
     d udtfra          s              8S 0
N02  d udttil          s              8S 0
N02  d ukns            s              8S 0
N02  d uknk            s              8S 0
      /free
       read  sadhan;
       dow not %eof;
         delete sadhanr;
       read  sadhan;
       enddo;
         udtfra=20170101;
         udttil=20171231;
         sadhanr1 ( udtfra : udttil : ukns : uknk );
         sadhanr2 ( udtfra : udttil : ukns : uknk );
       *inlr = *on;
      /end-free
