     FSTSTUR    UF   E           K DISK
     FSTSOPD    UF   E           K DISK
     FSTSFBR    UF   E           K DISK
     FSTSCLI    UF   E           K DISK
     FCARGOF    UF   E           K DISK
     FCARGOO    UF   E           K DISK
     FDOKUFN    UF   E           K DISK
     FDOKUFM    UF   E           K DISK
     FTRACKL02  UF   E           K DISK
      *
     c     *entry        plist
     c                   parm                    UTUR              8
     c                   move      UTUR          UTURN             8 0
      *
     C     TURKEY        KLIST
     C                   KFLD                    TERM5             5
     C                   KFLD                    UTURN
     C*                  MOVEL     'DRA'         TERM5             5
     C                   MOVEL     'DRAMM'       TERM5             5
     C     CargoFKey     KLIST
     C                   KFLD                    KOID
     C                   KFLD                    KOTERM
     C*                  MOVEL     'DRA'         KOTERM
     C                   MOVEL     'DRAMMEN'     KOTERM
     C     CargoOKey     KLIST
     C                   KFLD                    SOAVD
     C                   KFLD                    SOOPD
     C     TrackKey      KLIST
     C                   KFLD                    SOAVD
     C                   KFLD                    SOOPD
     C                   KFLD                    TTFBNR
     C                   KFLD                    TTACTI
     C                   move      'TEI'         TTACTI
     C     DokufmKey     KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    SOAVD
     C                   KFLD                    SOOPD
     C                   move      'F'           FMRI
      *
     C                   exsr      TØMUNDER
     C                   eval      *inlr = *on
     C                   RETURN
      *
      *
     C***********************************************
     C     TØMUNDER      BEGSR
     C***********************************************
      * TUR
     C     TURKEY        SETLL     STSTUR
     C     TURKEY        READE     STSTUR                                 33
     C     *IN33         DOWEQ     '0'                                           2<-B
     C                   DELETE    STSTURR
     C     TURKEY        READE     STSTUR                                 33
     C  N33              ENDDO                                                   2<-E
      * OPD
     C     TURKEY        SETLL     STSOPD
     C     TURKEY        READE     STSOPD                                 33
     C     *IN33         DOWEQ     '0'                                           2<-B
     C                   DELETE    STSOPDR
      *
     c     CargooKey     chain     CARGOO
     c                   if        %found
     c                   delete    CARGOOR
     c                   endif
      *
     c     TrackKey      chain     TRACKL02
     c                   if        %found
     c                   delete    TRACKFR
     c                   endif
      *
     C     DokufmKey     setll     dokufm
     C     DokufmKey     reade     dokufm
     C                   dow       not %eof
     c                   clear                   FMITER
     c                   clear                   FMItDt
     c                   clear                   FMItTm
     c                   clear                   FMItUs
     c                   update    dokufmr
     C     DokufmKey     reade     dokufm
     c                   enddo
     C     TURKEY        READE     STSOPD                                 33
     C  N33              ENDDO                                                   2<-E
      * FBR
     C     TURKEY        SETLL     STSFBR
     C     TURKEY        READE     STSFBR                                 33
     C     *IN33         DOWEQ     '0'                                           2<-B
     C                   DELETE    STSFBRR
     C     TURKEY        READE     STSFBR                                 33
     C  N33              ENDDO                                                   2<-E
      * CLI
     C     TURKEY        SETLL     STSCLI
     C     TURKEY        READE     STSCLI                                 33
     C     *IN33         DOWEQ     '0'                                           2<-B
     C                   DELETE    STSCLIR
      *
     c                   move      SCCLID        KOID
     C     CargoFKey     setll     CARGOF
     C     CargoFKey     reade     CARGOF
     C                   dow       not %eof
     c                   delete    CARGOFR
     C     CargoFKey     reade     CARGOF
     c                   enddo
      *
      *
     c                   move      SCCLID        FNCLID
     C     FNCLID        setll     dokufn
     C     FNCLID        reade     dokufn
     C                   dow       not %eof
     c                   delete    dokufnr
     C     FNCLID        reade     dokufn
     c                   enddo
      *
     C     TURKEY        READE     STSCLI                                 33
     C  N33              ENDDO                                                   2<-E
      *
      *
     C                   ENDSR
      *
