********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 JOV PTF12
********************************************************************
     FHEADF     UF   E           K DISK
     FDOKUFVF   IF   E           K DISK

     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0

     C     HeaKey        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD

     c                   move      *zeros        WSPOEN           15 0
     c     Heakey        setll     DOKUFVF
     c     Heakey        reade     DOKUFVF
     c                   dow       not %eof
     c                   add       FFPOEN        WSPOEN
     c     Heakey        reade     DOKUFVF
     c                   enddo
      * max value = 99999
     c                   if        WSPOEN >=99999
     c                   eval      WSPOEN = 99999
     c                   endif
     c     Heakey        chain     HEADF
     c                   if        %found
     c                   eval      HEPOEN = WSPOEN
     c                   update    HEADFR
     C                   endif

     C                   EVAL      *INLR=*ON
     C                   RETURN
