     H Option( *SrcStmt ) DftActGrp( *No ) BndDir( 'QC2LE' ) debug(*yes)
     FSVEH      IF   E           K DISK
     FSVEV      IF   E           K DISK
     FSVEVA     IF   E           K DISK
     FSVEF      IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FEDIC      UF   E             DISK
     FEDIM      O  A E             DISK    RENAME(EDIMR:EDIMR0)
     F                                     PREFIX(M0_)
     FEDIM4     IF   E           K DISK
     FEDIS      O  A E             DISK    RENAME(EDISR:EDISR0)
     F                                     PREFIX(S0_)
     FEDISX     O  A E             DISK    RENAME(EDISXR:EDISXR0)
     F                                     PREFIX(X0_)
     FTRACKF    O  A E             DISK
     FFIRM      IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FCUNDC01   IF   E           K DISK
     FCUNDl11   IF   E           K DISK
     FARKTXT    IF   E           K DISK
     FARKEXT    IF   E           K DISK
     FARKIVL02  IF   E           K DISK
     FARKVEDK   IF   E           K DISK
     FKODTS2    IF   E           K DISK
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZUSER                254    263
     D                 DS
     D  AVKVED                 7     66
     D  VKD                    1     66    DIM(33)
     D VEDL            S            100    DIM(100)
      *
     D EDIDTA          DS           256
     D  UELIBF               171    180
      *
     D FILE_o          s               *
     D String          s            512a
     D rc              s             10i 0
     D Data            s             80a   Varying
     D Codepage        s              5a   Varying
     D CmdLine         S            512
     D CmdLen          S             15  5
     D LF              c                   x'25'
     Dopen             Pr              *   ExtProc( '_C_IFS_fopen' )
     D                                 *   Value Options( *String )
     D                                 *   Value Options( *String )
     Dfputs            Pr            10i 0 ExtProc( '_C_IFS_fputs' )
     D                                 *   Value Options( *String )
     D                                 *   Value
     Dclose            Pr            10i 0 ExtProc( '_C_IFS_fclose' )
     D                                 *   Value
     D                 DS
     D  WMBR                   1     14
     D  WMBRA                  1      1
     D  WMBRB                  2     10  0
      *
     D                 DS
     D  XTXT801                1     80
     D  XT801                  1     80    DIM(80)
     D                 DS
     D  XTXT802                1     80
     D  XT802                  1     80    DIM(80)
     D                 DS
     D  SVEH_SYAV              1      4  0
     D  X_STREKK1              5      5
     D  SVEH_SYOP              6     12  0
     D  X_STREKK2             13     13
     D  SVEH_SYSG             14     16
     D  KUREF                  1     16
     D  XINTNR                 1     16
      *
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UVEHASYAV         4
     C                   PARM                    UVEHASYOP         7
     C                   PARM                    CALLTYP           1
     C                   MOVE      UVEHASYAV     UVEH_SYAV
     C                   MOVE      UVEHASYOP     UVEH_SYOP
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    SVEH_SYAV     UVEH_SYAV
     C     *LIKE         DEFINE    SVEH_SYOP     UVEH_SYOP
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    UVEH_SYAV
     C                   KFLD                    UVEH_SYOP
     C     KEYB          KLIST
     C                   KFLD                    UVEH_SYAV
     C                   KFLD                    UVEH_SYOP
     C                   KFLD                    SVEV_SYLI
     C     ARKEXTK       KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    ARKLAG
     C     ARKIVL02K     KLIST
     C                   KFLD                    ARSTAT
     C                   KFLD                    SVEH_SYAV
     C                   KFLD                    SVEH_SYOP
     C                   KFLD                    ARTYPE
     C                   EVAL      ARSTAT = 'A'
     C     ARKVEDKK      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    SVEH_AVKN
     C                   KFLD                    AVTYPE
     C                   EVAL      AVTYPE = 'SE'
     C     CUNDL11K      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    EORI
     C     CUNDC01K      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C                   KFLD                    CCONTA
     C                   EVAL      CCONTA = 'EMMA-XML'
     C     CUNDC01KPRO   KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C                   KFLD                    PRO_CCONTA
     C     *LIKE         DEFINE    CCONTA        PRO_CCONTA
     C                   EVAL      PRO_CCONTA = 'PROTERIA-XML'
     C     EDIM4KS       KLIST
     C                   KFLD                    X4SR_S
     C                   KFLD                    SVEH_SYAV
     C                   KFLD                    SVEH_SYOP
     C                   MOVE      'S'           X4SR_S            1
     C     FRISOKK       KLIST
     C                   KFLD                    SVEH_SYAV
     C                   KFLD                    SVEH_SYOP
     C                   KFLD                    FSKODE
     C                   EVAL      FSKODE = '*CE'
     C     KODTS2KA      KLIST
     C                   KFLD                    KS2UNI
     C                   KFLD                    SVEH_AVLK
     C                   EVAL      KS2UNI = 'S2'
     C     KODTS2KK      KLIST
     C                   KFLD                    KS2UNI
     C                   KFLD                    SVEH_MOLK
     C     KODTS2KD      KLIST
     C                   KFLD                    KS2UNI
     C                   KFLD                    SVEH_DKLK
      *_____________
      * Init av felt
      *"""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDT80             8 0
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              13
     C                   BITON     '123457'      XAPS              1
     C                   BITOFF    '06'          XAPS
     C                   MOVE      *BLANKS       XDATA           500
     C                   EVAL      X_STREKK1 = '/'
     C                   EVAL      X_STREKK2 = '/'
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     *DTAARA       DEFINE                  EDIDTA
     C                   IN        EDIDTA
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Start av file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     KEYA          CHAIN     SVEH                               33

      * Sjekk om xml skal sendes.
      * XSNDEMMA   = 'J' --> Send til Emma/Proteria
      * XTILMOTTAK = 'E' --> Emma
      * XTILMOTTAK = 'P' --> Proteria
     C                   MOVE      'N'           XSNDEMMA          1
     C                   MOVE      'E'           XTILMOTTAK        1            E=EMMA
      * Hent kundenr via EORI pga. at mange ikke registrerer kundenr på oppdrag.
     C                   EVAL      KUNDNR = 0
     C                   EVAL      EORI = SVEH_AVEO
     C     CUNDL11K      SETLL     CUNDL11
     C     FIFIRM        READE     CUNDL11                                33
     C  N33              IF        %SUBST(EORI:1:12) <> %SUBST(SVEH_AVEO:1:12)
     C                   EVAL      KUNDNR = 0
     C                   END
      *
     C     CUNDC01K      CHAIN     CUNDC01                            33
     C                   IF        *IN33                                        1<-B
     C     CUNDC01KPRO   CHAIN     CUNDC01                            33
     C  N33              MOVE      'P'           XTILMOTTAK        1            E=EMMA
     C                   END                                                    1<-E

     C                   DOW       *IN33 = *OFF                                 1<-B
     C                   IF        CTYPE = '*TDS EXPORT SE' AND CLIVE = 'X'      2<-B
     C     EDIM4KS       SETLL     EDIM4
     C     EDIM4KS       READPE    EDIM4                                  33
     C                   DOW       *IN33 = *OFF                                   3<-B
     C                   IF        M0065 = 'XMLEMA' AND M1N07 = 'SVE'              4<-B
     C                   GOTO      STPRI0
     C                   END                                                       4<-E
     C     EDIM4KS       READPE    EDIM4                                  33
     C                   ENDDO                                                    3<-E
     C   33              EVAL      XSNDEMMA = 'J'
     C                   GOTO      STPRI0
     C                   END                                                     2<-E
     C                   IF        XTILMOTTAK = 'E'                              2<-B
     C     CUNDC01K      READE     CUNDC01                                33
     C                   ELSE                                                    2
     C     CUNDC01KPRO   CHAIN     CUNDC01                            33
     C                   END                                                     2<-E
     C                   ENDDO                                                  1<-E

     C     STPRI0        TAG
     C                   IF        XSNDEMMA = 'N'                               1<-B
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END                                                    1<-E

      *_________
      * Huvudark
      *"""""""""
     C                   EXSR      SREMMA1
      *_________
      * Linje
      *"""""""""
     C                   EXSR      SREMMA5
      *_________
      * Vedlegg
      *"""""""""
     C                   EXSR      SREMMA6
      *_________
      * Bunn
      *"""""""""
     C                   EXSR      SREMMA9
      *_________
      * Oppdatering
      *"""""""""
     C                   EXSR      SROPDFIL
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SREMMA1       BEGSR
      ***************************************************************
     C     1             CHAIN     EDIC                               36
     C                   ADD       1             CSN
     C                   ADD       1             CMN
     C                   UPDATE    EDICR
     C                   EVAL      WMBRA = 'S'
     C                   EVAL      WMBRB = CSN
      * Lag fil og set codepage (pc)
     C                   MOVE      *BLANKS       WFilNam         256
     C                   EVAL      WFilNam= '/' + %TRIM(UELIBF) + 'X'
     C                             + '/EMMA/EDISE/' + %TRIM(SVEH_TUID)
     C                             + '_DEKLKODE.xml'
     C                   MOVE      *BLANKS       WFilNam2        256
     C                   EVAL      WFilNam2 = '/' + %TRIM(UELIBF) + 'X'
     C                             + '/EMMA/EDISE1K/BACKUP/' + %TRIM(SVEH_TUID)
     C                             + '_' + %TRIM(CPHONE) + '.xml'
     C                   EVAL      FILE_o = open( %TrimR( WFilNam2 )
     C                             : 'w, codepage=819' )
     C                   EVAL      rc = close( FILE_o )
     C                   EVAL      FILE_o = open( %TrimR( WFilNam2 )
     C                             : 'w' )
      *
     C                   EVAL      XDATA = '<?xml version="1.0" '
     C                             + 'encoding="ISO-8859-1" '
     C                             + 'standalone="yes"?>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<EmmaSystemsFortolling>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Fortolling>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Tollnummer>'
     C                             + %TRIM(SVEH_TUID)
     C                             + '</Tollnummer>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Unhsekvens>'
     C                             + '</Unhsekvens>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Unhversjon>'
     C                             + '</Unhversjon>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Deklarasjon1A>'
     C                             + %TRIM(SVEH_DEK1) + '</Deklarasjon1A>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Deklarasjon1B>'
     C                             + %TRIM(SVEH_DEK2) + '</Deklarasjon1B>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Avsender
     C                   EVAL      XDATA = '<Avsender>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   IF        SVEH_AVKN <> 0
     C                   EVAL      XDATA = '<Nr>'
     C                             + %TRIM(%EDITC(SVEH_AVKN:'Z')) + '</Nr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   END
     C                   EVAL      XDATA = '<Orgnr>'
     C                             + %TRIM(SVEH_AVEO) + '</Orgnr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_AVNA
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Navn>'
     C                             + %TRIM(XTXT802) + '</Navn>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_AVA1
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Gateadresse>'
     C                             + %TRIM(XTXT802) + '</Gateadresse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_AVA2
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Postadresse>'
     C                             + %TRIM(XTXT802) + '</Postadresse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_AVPN
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Postnr>'
     C                             + %TRIM(XTXT802) + '</Postnr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_AVPA
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Poststed>'
     C                             + %TRIM(XTXT802) + '</Poststed>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C     KODTS2KA      CHAIN     KODTS2                             33
     C                   EVAL      XTXT801 = KS2FTX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Land>'
     C                             + %TRIM(XTXT802) + '</Land>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Landkode>'
     C                             + %TRIM(SVEH_AVLK) + '</Landkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Avsender>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   Z-ADD     0             WRUBR5            5 0
     C                   Z-ADD     0             WTOTNETO         12 3
     C                   Z-ADD     0             WTOTAVG          15 3
     C                   Z-ADD     0             WTOTMOMS         15 3
     C                   Z-ADD     0             WTOTEKSM         12 0
     C                   Z-ADD     0             WTOTFAKT         12 0
     C                   Z-ADD     0             WJUST            12 0
     C*                  EVAL(H)   WTOTFAKT = SVEH_FABL * SVEH_VAKU
     C     KEYA          SETLL     SVEV
     C     KEYA          READE     SVEV                                   52
     C     *IN52         DOWEQ     *OFF
     C                   ADD       1             WRUBR5
     C*                  EVAL(H)   WTOTFAKT = WTOTFAKT + SVEV_FABL * SVEH_VAKU
     C                   EVAL      WTOTFAKT = WTOTFAKT + SVEV_FABL * SVEH_VAKU
     C                   EVAL      WTOTNETO = WTOTNETO + SVEV_NETO
     C     KEYA          READE     SVEV                                   52
     C                   ENDDO
     C                   EVAL      XDATA = '<Vareposter>'
     C                             + %TRIM(%EDITC(WRUBR5:'Z')) + '</Vareposter>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Antallkolli>'
     C                             + %TRIM(%EDITC(SVEH_KOTA:'Z'))
     C                             + '</Antallkolli>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<TotBruttoVekt>'
     C                             + %TRIM(%EDITC(SVEH_BRUT:'L'))
     C                             + '</TotBruttoVekt>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<TotNettoVekt>'
     C                             + %TRIM(%EDITC(WTOTNETO:'L'))
     C                             + '</TotNettoVekt>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C     FRISOKK       CHAIN     FRISOK                             33
     C                   IF        *IN33
     C                   EVAL      XDATA = '<Referanse>'
     C                             + %TRIM(KUREF) + '</Referanse>'
     C                   ELSE
     C                   EVAL      XTXT801 = FSSOK
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Referanse>'
     C                             + %TRIM(XTXT802) + '</Referanse>'
     C                   END
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Mottaker
     C                   EVAL      XDATA = '<Mottaker>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   IF        SVEH_MOKN <> 0
     C                   EVAL      XDATA = '<Nr>'
     C                             + %TRIM(%EDITC(SVEH_MOKN:'Z')) + '</Nr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   END
     C                   EVAL      XDATA = '<Orgnr>'
     C                             + %TRIM(SVEH_MOEO) + '</Orgnr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_MONA
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Navn>'
     C                             + %TRIM(XTXT802) + '</Navn>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_MOA1
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Gateadresse>'
     C                             + %TRIM(XTXT802) + '</Gateadresse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_MOA2
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Postadresse>'
     C                             + %TRIM(XTXT802) + '</Postadresse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_MOPN
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Postnr>'
     C                             + %TRIM(XTXT802) + '</Postnr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_MOPA
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Poststed>'
     C                             + %TRIM(XTXT802) + '</Poststed>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C     KODTS2KK      CHAIN     KODTS2                             33
     C                   EVAL      XTXT801 = KS2FTX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Land>'
     C                             + %TRIM(XTXT802) + '</Land>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Landkode>'
     C                             + %TRIM(SVEH_MOLK) + '</Landkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Mottaker>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Verdiopplysninger/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<VerdiopplysningerValuta/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<VerdiopplysningerKurs/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<FraktTilEU>'
     C                             + %TRIM(%EDITC(SVEH_VUFR:'L'))
     C                             + '</FraktTilEU>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<FraktTilEUValuta>'
     C                             + %TRIM(SVEH_VUVA)
     C                             + '</FraktTilEUValuta>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<FraktTilEUKurs>'
     C                             + %TRIM(%EDITC(SVEH_VUKU:'L'))
     C                             + '</FraktTilEUKurs>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Deklarant
     C                   EVAL      XTXT801 = SVEH_DKNA
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Deklarantnavn>'
     C                             + %TRIM(XTXT802) + '</Deklarantnavn>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C*                  EVAL      XTXT801 = SVEH_DKTL
     C*                  EXSR      KNVST
     C                   EVAL      XDATA = '<Deklaranttlf>'
     C*                            + %TRIM(XTXT802) + '</Deklaranttlf>'
     C                             + '</Deklaranttlf>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Landkode>'
     C                             + %TRIM(SVEH_AVUT) + '</Landkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C     KODTS2KD      CHAIN     KODTS2                             33
     C                   EVAL      XTXT801 = KS2FTX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Landtekst>'
     C                             + %TRIM(XTXT802) + '</Landtekst>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Container>'
     C                             + %TRIM(SVEH_CONT) + '</Container>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Levvilkkode/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Levvilktekst/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_TRAI
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<AktivtransportID>'
     C                             + %TRIM(XTXT802) + '</AktivtransportID>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<AktivtransportTYPE>'
     C                             + %TRIM(SVEH_TRAL) + '</AktivtransportTYPE>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Fakturabelop>'
     C                             + %TRIM(%EDITC(SVEH_FABL:'L'))
     C                             + '</Fakturabelop>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Fakturakurs>'
     C                             + %TRIM(%EDITC(SVEH_VAKU:'4'))
     C                             + '</Fakturakurs>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Transaksjonstype>'
     C                             + %TRIM(SVEH_TART)
     C                             + '</Transaksjonstype>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Transportvedgrensen>'
     C                             + %TRIM(SVEH_TRGR)
     C                             + '</Transportvedgrensen>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Betaler>'
     C                             + %TRIM(SVEH_UPPS) + '</Betaler>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Faktura
     C                   EXSR      SREMMA2
      *
     C                   EVAL      XDATA = '<Utpasseringstollstedkode>'
     C                             + %trim(sveh_utfa)
     C                             + '</Utpasseringstollstedkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Utpasseringstollstedtekst>'
     C                             + '</Utpasseringstollstedtekst>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Varenslagringsstedkode>'
     C                             + '</Varenslagringsstedkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Varenslagringsstedtekst>'
     C                             + '</Varenslagringsstedtekst>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SREMMA2       BEGSR
      ***************************************************************
      *
     C     KEYA          SETLL     SVEF
     C     KEYA          READE     SVEF                                   33
     C                   IF        *IN33 = *OFF
     C                             AND SVEF_FATY = 'N380' AND SVEF_FABL <> 0
      *
     C                   DOW       *IN33 = *OFF
     C                   IF        SVEF_FATY = 'N380' AND SVEF_FABL <> 0
     C                   EVAL      XDATA = '<Faktura>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEF_FATX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Fakturanr>'
     C                             + %TRIM(XTXT802) + '</Fakturanr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Belop>'
     C                             + %TRIM(%EDITC(SVEF_FABL:'4')) + '</Belop>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Valuta>'
     C                             + %TRIM(SVEF_VAKD) + '</Valuta>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Kurs>'
     C                             + %TRIM(%EDITC(SVEF_VAKU:'4')) + '</Kurs>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Dato>'
XXX  C                             + %TRIM(%EDITW(SVEH_SYDT:'    -  -  '))
     C                             + '</Dato>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Faktura>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   END
     C     KEYA          READE     SVEF                                   33
     C                   ENDDO
      *
     C                   ELSE
     C                   EVAL      XDATA = '<Faktura>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_FATX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Fakturanr>'
     C                             + %TRIM(XTXT802) + '</Fakturanr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Belop>'
     C                             + %TRIM(%EDITC(SVEH_FABL:'4')) + '</Belop>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Valuta>'
     C                             + %TRIM(SVEH_VAKD) + '</Valuta>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Kurs>'
     C                             + %TRIM(%EDITC(SVEH_VAKU:'4')) + '</Kurs>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Dato>'
XXX  C                             + %TRIM(%EDITW(SVEH_SYDT:'    -  -  '))
     C                             + '</Dato>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Faktura>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   END
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SREMMA5       BEGSR
      ***************************************************************
      *
     C                   EVAL      WRUBR5 = 0
     C     KEYA          SETLL     SVEV
     C     KEYA          READE     SVEV                                   33
     C                   DOW       *IN33 = *OFF
     C                   EVAL      WTOTEKSM = WTOTEKSM + SVEV_STVA
     C                   EVAL      WJUST    = SVEV_STVA - SVEV_FABL * SVEH_VAKU
      *
     C                   EVAL      XDATA = '<Varelinje>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      WRUBR5 = WRUBR5 + 1
     C                   EVAL      XDATA = '<Varepostnr>'
     C                             + %TRIM(%EDITC(WRUBR5:'4')) + '</Varepostnr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Varenummer>'
     C                             + %TRIM(SVEV_VATA) + '</Varenummer>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Prosedyre>'
     C                             + %TRIM(SVEV_EUP1) + '</Prosedyre>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Preferanse/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Verdifastsettelse/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Tollnedsettelse/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Art>'
     C                             + %TRIM(SVEV_KOSL) + '</Art>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XTXT801 = SVEV_GODM
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<MerkeogNummer>'
     C                             + %TRIM(XTXT802) + '</MerkeogNummer>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Oppfylke/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Statistiskverdi>'
     C                             + %TRIM(%EDITC(SVEV_STVA:'Z'))
     C                             + '</Statistiskverdi>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Bruttovekt>'
     C                             + %TRIM(%EDITC(SVEV_BRUT:'4'))
     C                             + '</Bruttovekt>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Nettovekt>'
     C                             + %TRIM(%EDITC(SVEV_NETO:'4'))
     C                             + '</Nettovekt>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Justering>'
     C                             + %TRIM(%EDITC(WJUST:'Z'))
     C                             + '</Justering>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Annenenhet>'
     C                             + %TRIM(%EDITC(SVEV_ANKV:'Z'))
     C                             + '</Annenenhet>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Antall>'
     C                             + %TRIM(%EDITC(SVEV_KOTA:'Z')) + '</Antall>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Opprinnelse>'
     C                             + %TRIM(SVEV_ULKD) + '</Opprinnelse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Ankomstdato/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEV_VASL
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Vareslag>'
     C                             + %TRIM(XTXT802) + '</Vareslag>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEV_VAS2
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Godsbeskrivelse1>'
     C                             + %TRIM(XTXT802) + '</Godsbeskrivelse1>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEV_VAS3
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Godsbeskrivelse2>'
     C                             + %TRIM(XTXT802) + '</Godsbeskrivelse2>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEV_VAS4
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Godsbeskrivelse3>'
     C                             + %TRIM(XTXT802) + '</Godsbeskrivelse3>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Container1>'
     C                             + %TRIM(SVEV_CO01) + '</Container1>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
xxx   * Container opptil 9 eller 20
     C                   EVAL      XDATA = '<ArtNr>'
     C                             + '</ArtNr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Fakturanr>'
     C                             + %trim(SVEV_BII1) + '</Fakturanr>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Dokument>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Kode>'
     C                             + %trim(SVEV_BIT1) + '</Kode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Tekst>'
     C                             + %trim(SVEV_BII1) + '</Tekst>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Dokument>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Avgift
      *
     C                   EVAL      XDATA = '</Varelinje>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C     KEYA          READE     SVEV                                   33
     C                   ENDDO
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SREMMA6       BEGSR
      ***************************************************************
      * VEDLEGG
     C                   MOVE      *BLANKS       VKD
     C     ARKVEDKK      CHAIN     ARKVEDK                            36
     C                   IF        AVKVED = *BLANKS
     C     'SI'          CHAIN     ARKTXT                             36
     C  N36              EVAL      AVKVED = ARKVED
     C                   END
     C                   EVAL      VKD(1) = 'SE'
     C                   EVAL      VKD(2) = 'S3'
     C                   EVAL      VKD(3) = 'S4'
      *
     C                   EVAL      ARTYPE = VKD(1)
     C                   Z-ADD     1             XN8               3 0
     C                   MOVE      *BLANKS       VEDL
     C                   MOVE      *ZEROS        XN7               3 0
     C     STEMMA61      TAG
     C     ARTYPE        CHAIN     ARKTXT                             36
     C                   IF        ARKLAG <> *BLANKS
     C     ARKEXTK       CHAIN     ARKEXT                             36
     C                   ELSE
     C     FIFIRM        CHAIN     FIRMARC                            36
     C                   END
     C     ARKIVL02K     SETLL     ARKIVL02
     C     ARKIVL02K     READE     ARKIVL02                               36
     C                   DOW       *IN36 = *OFF
     C                   ADD       1             XN7
     C     '.'           SCAN      ARLINK                                 36
     C  N36              EVAL      ARLINK = %TRIM(ARLINK) + '.pdf'
     C                   EVAL      VEDL(XN7) = '/' + %TRIM(ARCANE)
     C                             + '/' + %TRIM(ARLINK)
     C                   EVAL      XDATA = '<Vedlegg>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Filnavn>'
     C                             + %TRIM(ARLINK) + '</Filnavn>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   IF        ARRFK = *BLANKS
     C                   EVAL      ARRFK = %TRIM(ARTXT) + ' ' + %TRIM(KUREF)
     C                   END
     C                   EVAL      XDATA = '<Beskrivelse>'
     C                             + %TRIM(ARRFK) + '</Beskrivelse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</Vedlegg>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C     ARKIVL02K     READE     ARKIVL02                               36
     C                   ENDDO
     C                   ADD       1             XN8
      * Ikke sende SAD-vedlegg flere ganger
     C                   DOW       XN8>3 AND (VKD(XN8)='SE' OR VKD(XN8)='S3'
     C                             OR VKD(XN8)='S4')
     C                   ADD       1             XN8
     C                   ENDDO
      *
     C                   IF        VKD(XN8) <> *BLANKS
     C                   EVAL      ARTYPE = VKD(XN8)
     C                   GOTO      STEMMA61
     C                   END
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SREMMA9       BEGSR
      ***************************************************************
      *
     C                   EVAL      XDATA = '<Tollkontonr/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Kontrollsiffer/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Godsnr/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Posnr/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Regnskapsopplysninger1/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Regnskapsopplysninger2/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Regnskapsopplysninger3/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Regnskapsopplysninger4/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '<Sted/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Dato/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Representantensnavn/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Representantensunderskrift/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      * Tilleggsopplysninger
     C                   EVAL      XDATA = '<TilleggsOpplysninger>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Deklkode>'
     C                             + %TRIM(CPHONE) + '</Deklkode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<InternReferanse>'
     C                             + %TRIM(XINTNR)
     C                             + '</InternReferanse>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Godkjentdato>'
     C                             + %TRIM(%editw(SVEH_SYDT:'    -  -  '))
     C                             + '</Godkjentdato>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<ImportEksport>E</ImportEksport>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XTXT801 = SVEH_FATX
     C                   EXSR      KNVST
     C                   EVAL      XDATA = '<Fakturainfo>'
     C                             + %TRIM(XTXT802) + '</Fakturainfo>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<SumAvgifter/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<SumMoms/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<SumEkslMoms>'
     C                             + %TRIM(%EDITC(WTOTEKSM:'Z'))
     C                             + '</SumEkslMoms>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<SumFaktura>'
     C                             + %TRIM(%EDITC(WTOTFAKT:'Z'))
     C                             + '</SumFaktura>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<TVNStatus>'
xxx  C                             + '</TVNStatus>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<Tollnummer2/>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '<MeldindKode>' + %trim(SVEH_MTYP)
     C                             + '</MeldindKode>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '</TilleggsOpplysninger>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
      *
     C                   EVAL      XDATA = '</Fortolling>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      XDATA = '</EmmaSystemsFortolling>'
     C                   EVAL      rc = fputs(%trimr(XDATA) + LF: File_o)
     C                   EVAL      rc = close( FILE_o )
      *
     C                   ENDSR
      *
      ***************************************************************
     C     SROPDFIL      BEGSR
      ***************************************************************
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
     C                   CLEAR                   EDISR0
     C                   EVAL      S0_S0004  = CMOBIL
     C                   EVAL      S0_S0010  = CFAX
     C                   EVAL      S0_S0020  = WMBR
     C                   EVAL      S0_SSN    = CSN
     C                   EVAL      S0_SSR    = 'S'
     C                   EVAL      S0_SST    = 'A'
     C                   EVAL      S0_S0036  = 1
     C                   MOVEL     WDT           S0_SDT
     C                   MOVEL     WTM           S0_STM
     C                   EVAL      S0_SFILE  = '*IFS'
     C                   EVAL      S0_SMBR   = WMBR
     C                   EVAL      S0_SLIB   = '*LIBL'
     C                   EVAL      S0_SIFS   = WFILNAM2
     C                   WRITE     EDISR0
      *
     C                   CLEAR                   EDISXR0
     C                   EVAL      X0_SXPRODM  = WMBR
     C                   EVAL      X0_SXIFSOBJ = Wfilnam2
     C                   WRITE     EDISXR0
      *
     C                   CLEAR                   EDIMR0
     C                   EVAL      M0_M0004  = CMOBIL
     C                   EVAL      M0_M0010  = CFAX
     C                   EVAL      M0_MSN    = CSN
     C                   EVAL      M0_MMN    = CMN
     C                   EVAL      M0_MSR    = 'S'
     C                   EVAL      M0_MST    = 'C'
     C                   EVAL      M0_MAVD   = SVEH_SYAV
     C                   EVAL      M0_MTDN   = SVEH_SYOP
     C                   EVAL      M0_M0035  = M0035
     C                   EVAL      M0_M0062  = M0062
     C                   EVAL      M0_M0065  = 'XMLEMA'
     C                   EVAL      M0_M0068  = 'EMMA-' + %TRIM(KUREF)
     C                   EVAL      M0_M1001  = 'TDS'
     C                   EVAL      M0_M1004  = *BLANKS
     C                   EVAL      M0_M1225  = 'XML'
     C                   EVAL      M0_M1N07  = 'SVE'
     C                   MOVEL     WDT           M0_MDT
     C                   MOVEL     WTM           M0_MTM
     C                   WRITE     EDIMR0
      * VEDL
     C     1             DO        100           XN7
     C                   IF        VEDL(XN7) = *BLANKS
     C                   LEAVE
     C                   END
     C     1             CHAIN     EDIC                               51
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
     C                   EVAL      WMBRB = CSN
     C                   EVAL      S0_S0020  = WMBR
     C                   EVAL      S0_SSN    = CSN
     C                   EVAL      S0_SST    = 'A'
     C                   EVAL      S0_SFILE  = '*IFS'
     C                   EVAL      S0_SMBR   = WMBR
     C                   EVAL      S0_SLIB   = '*LIBL'
     C                   EVAL      S0_SIFS   = VEDL(XN7)
     C                   WRITE     EDISR0
     C                   ENDDO
      *
      * Oppdater track & trace
     C                   EVAL      TTAVD  = SVEH_SYAV
     C                   EVAL      TTOPD  = SVEH_SYOP
     C                   EVAL      TTACTI = 'EMM'
     C                   MOVEL     WDT           TTDATE
     C                   MOVEL     WTM           TTTIME
     C                   IF        M0_M0010 = 'EMMA'
     C                   EVAL      TTTEXT='Customdecl. export is sent to Emma.'
     C                   ELSE
     C                   EVAL      TTTEXT='Customdecl. export is sent to '
     C                             + 'Proteria.'
     C                   END
     C                   EVAL      TTUSER = ZUSER
     C                   EVAL      TTDATL = TTDATE
     C                   EVAL      TTTIML = TTTIME
     C                   IF        M0_M0010 = 'EMMA'
     C                   EVAL      TTTEXL = 'Tolldek. export er sendt til Emma.'
     C                   ELSE
     C                   EVAL      TTTEXL = 'Tolldek. export er sendt til '
     C                             + 'Proteria.'
     C                   END
     C                   WRITE     TRACKFR
      *
     C                   ENDSR
      *
      ***********************************************
     C     KNVST         BEGSR
      ***********************************************
     C                   Z-ADD     50            XN53              3 0
     C     XN53          SUB       4             XN54              3 0
     C     XN53          SUB       5             XN55              3 0
     C     XN53          SUB       6             XN56              3 0
     C                   Z-ADD     0             XN52              3 0
     C                   MOVE      *BLANKS       XTXT802
     C     1             DO        80            XN51              3 0
     C                   IF        (((((XT801(XN51) = '&') OR
     C                                 (XT801(XN51) = '"')) OR
     C                                 (XT801(XN51) = XAPS)) OR
     C                                 (XT801(XN51) = '<')) OR
     C                                 (XT801(XN51) = '>'))
     C                   IF        XN52 < XN53
     C                   ADD       1             XN52
     C                   SELECT
     C                   WHEN      XT801(XN51) = '&'
     C                   IF        XN51 < XN55
     C                   MOVEA     '&amp;'       XT802(XN52)
     C                   ADD       4             XN52
     C                   ELSE
     C                   SUB       1             XN52
     C                   END
     C                   WHEN      XT801(XN51) = '"'
     C                   IF        XN51 < 75
     C                   MOVEA     '&quot;'      XT802(XN52)
     C                   ADD       5             XN52
     C                   ELSE
     C                   SUB       1             XN52
     C                   END
     C                   WHEN      XT801(XN51) = XAPS
     C                   IF        XN51 < XN56
     C                   MOVEA     '&apos;'      XT802(XN52)
     C                   ADD       5             XN52
     C                   ELSE
     C                   SUB       1             XN52
     C                   END
     C                   WHEN      XT801(XN51) = '>'
     C                   IF        XN51 < XN54
     C                   MOVEA     '&gt;'        XT802(XN52)
     C                   ADD       3             XN52
     C                   ELSE
     C                   SUB       1             XN52
     C                   END
     C                   WHEN      XT801(XN51) = '<'
     C                   IF        XN51 < XN54
     C                   MOVEA     '&lt;'        XT802(XN52)
     C                   ADD       3             XN52
     C                   ELSE
     C                   SUB       1             XN52
     C                   END
     C                   ENDSL
     C                   END
     C                   ELSE
     C                   IF        XN52 < XN53
     C                   ADD       1             XN52
     C                   MOVE      XT801(XN51)   XT802(XN52)
     C                   ELSE
     C                   LEAVE
     C                   END
     C                   END
     C                   ENDDO
      *
     C                   ENDSR
      *
