     FSVTVK     UF   E             DISK

     D                 DS
     D  WDT08                  1      8
     D  WDT08D                 7      8

     C                   READ      SVTVK                                  51
     C     *IN51         DOWEQ     *OFF

     C                   IF        SVVK_DTE=99991231
     C                   MOVE      SVVK_DTS      WDT08
     C                   EVAL      WDT08D='31'
     C                   MOVE      WDT08         SVVK_DTE
     C                   UPDATE    SVTVKR
     C                   ENDIF

     C                   READ      SVTVK                                  51
     C                   ENDDO

     C                   EVAL      *INLR=*ON
