     FTULLTAX   IF   F 1024        DISK    BLOCK(*YES)
     FEDIS      O  A E             DISK

     D                 DS
     D  WMBR                   1     10
     D  WMBRA                  1      1
     D  WMBRB                  2     10S 0


     D  A01            C                   ' AdditionalCode.xsd'
     D  A02            C                   'Certificate.xsd'
     D  A03            C                   'CodeList.xsd'
     D  A04            C                   'DeclarableGoodsNomenclature.xsd'
     D  A05            C                   'DutyExpression.xsd'
     D  A06            C                   'ExportRefundNomenclature.xsd'
     D  A07            C                   'Footnote.xsd'
     D  A08            C                   'GeographicalArea.xsd'
     D  A09            C                   'GoodsNomenclatureGroup.xsd'
     D  A10            C                   'GoodsNomenclature.xsd'
     D  A11            C                   'LookupTable.xsd'
     D  A12            C                   'MeasureAction.xsd'
     D  A13            C                   'MeasureConditionCode.xsd'
     D  A14            C                   'MeasureType.xsd'
     D  A15            C                   'Measure.xsd'
     D  A16            C                   'MeasurementUnitQualifier.xsd'
     D  A17            C                   'MeasurementUnit.xsd'
     D  A18            C                   'Measurement.xsd'
     D  A19            C                   'MeursingAdditionalCode.xsd'
     D  A20            C                   'MeursingHeading.xsd'
     D  A21            C                   'MeursingSubheading.xsd'
     D  A22            C                   'MeursingTablePlan.xsd'
     D  A23            C                   'MonetaryExchangePeriod.xsd'
     D  A24            C                   'PreferenceCode.xsd'
     D  A25            C                   'QuotaBalanceEvent.xsd'
     D  A26            C                   'QuotaDefinition.xsd'
     D  A27            C                   'QuotaEvent.xsd'
     D  A28            C                   'QuotaOrderNumber.xsd'
     D  A29            C                   'Regulation.xsd'
     D  A30            C                   'ReliefCode.xsd'
     D  A31            C                   'TaxCode.xsd'
     ITULLTAX   AA  01
     I                                  1 1024  RDATA

      * typen finner en på linje 2
     C                   READ      TULLTAX
     C                   READ      TULLTAX

     C     A01           SCAN      RDATA                                  41
     C     A02           SCAN      RDATA                                  42
     C     A03           SCAN      RDATA                                  43
     C     A04           SCAN      RDATA                                  44
     C     A05           SCAN      RDATA                                  45
     C     A06           SCAN      RDATA                                  46
     C     A07           SCAN      RDATA                                  47
     C     A08           SCAN      RDATA                                  48
     C     A09           SCAN      RDATA                                  49
     C     A10           SCAN      RDATA                                  50
     C     A11           SCAN      RDATA                                  51
     C     A12           SCAN      RDATA                                  52
     C     A13           SCAN      RDATA                                  53
     C     A14           SCAN      RDATA                                  54
     C     A15           SCAN      RDATA                                  55
     C     A16           SCAN      RDATA                                  56
     C     A17           SCAN      RDATA                                  57
     C     A18           SCAN      RDATA                                  58
     C     A19           SCAN      RDATA                                  59
     C     A20           SCAN      RDATA                                  60
     C     A21           SCAN      RDATA                                  61
     C     A22           SCAN      RDATA                                  62
     C     A23           SCAN      RDATA                                  63
     C     A24           SCAN      RDATA                                  64
     C     A25           SCAN      RDATA                                  65
     C     A26           SCAN      RDATA                                  66
     C     A27           SCAN      RDATA                                  67
     C     A28           SCAN      RDATA                                  68
     C     A29           SCAN      RDATA                                  69
     C     A30           SCAN      RDATA                                  70
     C     A31           SCAN      RDATA                                  71

     C                   MOVE      *BLANKS       UPGM             10
     C                   SELECT
     C                   WHEN      *IN41
     C                   EVAL      UPGM='SVT501R'
     C                   WHEN      *IN42
     C                   EVAL      UPGM='SVT502R'
     C                   WHEN      *IN43
     C                   EVAL      UPGM='SVT503R'
     C                   WHEN      *IN44
     C                   EVAL      UPGM='SVT504R'
     C                   WHEN      *IN45
     C                   EVAL      UPGM='SVT505R'
     C                   WHEN      *IN46
     C                   EVAL      UPGM='SVT506R'
     C                   WHEN      *IN47
     C                   EVAL      UPGM='SVT507R'
     C                   WHEN      *IN48
     C                   EVAL      UPGM='SVT508R'
     C                   WHEN      *IN49
     C                   EVAL      UPGM='SVT509R'
     C                   WHEN      *IN50
     C                   EVAL      UPGM='SVT510R'
     C                   WHEN      *IN51
     C                   EVAL      UPGM='SVT511R'
     C                   WHEN      *IN52
     C                   EVAL      UPGM='SVT512R'
     C                   WHEN      *IN53
     C                   EVAL      UPGM='SVT513R'
     C                   WHEN      *IN54
     C                   EVAL      UPGM='SVT514R'
     C                   WHEN      *IN55
     C                   EVAL      UPGM='SVT515R'
     C                   WHEN      *IN56
     C                   EVAL      UPGM='SVT516R'
     C                   WHEN      *IN57
     C                   EVAL      UPGM='SVT517R'
     C                   WHEN      *IN58
     C                   EVAL      UPGM='SVT518R'
     C                   WHEN      *IN59
     C                   EVAL      UPGM='SVT519R'
     C                   WHEN      *IN60
     C                   EVAL      UPGM='SVT520R'
     C                   WHEN      *IN61
     C                   EVAL      UPGM='SVT521R'
     C                   WHEN      *IN62
     C                   EVAL      UPGM='SVT522R'
     C                   WHEN      *IN63
     C                   EVAL      UPGM='SVT523R'
     C                   WHEN      *IN64
     C                   EVAL      UPGM='SVT524R'
     C                   WHEN      *IN65
     C                   EVAL      UPGM='SVT525R'
     C                   WHEN      *IN66
     C                   EVAL      UPGM='SVT526R'
     C                   WHEN      *IN67
     C                   EVAL      UPGM='SVT527R'
     C                   WHEN      *IN68
     C                   EVAL      UPGM='SVT528R'
     C                   WHEN      *IN69
     C                   EVAL      UPGM='SVT529R'
     C                   WHEN      *IN70
     C                   EVAL      UPGM='SVT530R'
     C                   WHEN      *IN71
     C                   EVAL      UPGM='SVT531R'
     C                   ENDSL

     C                   IF        UPGM <> *BLANKS
     C                   CALL      UPGM
     C                   ENDIF

     C                   EVAL      *INLR=*ON
