     FTULLTAX   IF   F 1024        DISK    BLOCK(*YES)
     FSVTX02F   UF A E             DISK

     D  A              C                   '<certificate '
     D  B              C                   '<certificateDescriptionPeriod '
     D  C              C                   '<certificateDescription '
     D  D              C                   '</certificate>'
     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     ITULLTAX   AA  01
     I                                  1 1024  RDATA


     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C                   READ      TULLTAX                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX02R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C
     C                   WHEN      *IN44

     C                   IF        SVTX02_04=*BLANKS
     C                   EVAL      SVTX02_04='9999-12-31'
     C                   ENDIF
     C
     C                   EVAL      WDT10=SVTX02_04
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX02R
     C                   ENDIF
     C                   ENDSL

     C                   READ      TULLTAX                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les <certificate                                         XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'icateCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX02_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'icateType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX02_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX02_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX02_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les  <certificateDescriptionPeriodod                     XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR
     C                   MOVE      *BLANKS       W13              10
     C                   MOVE      *BLANKS       W14              10

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W13=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W14=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W13=*BLANKS
     C                   EVAL      W13='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W13
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      W13=*BLANKS
     C                   EVAL      W14=*BLANKS
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <certificateDescription                              XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C     W13           IFNE      *BLANKS

     C                   MOVE      *BLANKS       W21             256
     C                   MOVE      *BLANKS       W22               2

     C     'scription="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C  N21              EVAL      Y=999
     C     Y             SUB       X             Z
     C                   EVAL      W21=%SUBST(RDATA :X:Z)
     C                   EVAL      STRINGIN=*BLANKS

     C                   EVAL      STRINGIN=*BLANKS
     C                   EVAL      STRINGIN=W21
     C                   EVAL      STRINGOUT=*BLANKS
     C                   CALL      'CVTU8SE'
     C                   PARM                    STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   EVAL      W21=*BLANKS
     C                   EVAL      W21=STRINGOUT
     C                   ENDIF
     C                   ENDIF

     C     'anguageId="' SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W22=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W22='SV' OR W22='  '
     C                   EVAL      SVTX02_03=W21
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX02F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX02R
     C                   READ      SVTX02F                                51
     C                   ENDDO
     C                   ENDSR
