     FTULLTAX   IF   F 1024        DISK    BLOCK(*YES)
     FSVTX21F   UF A E             DISK

     D  A              C                   '<meursingSubheading '

     D  A01            C                   'description="'                       13
     D  A02            C                   'headingNumber="'                     15
     D  A03            C                   'meursingTablePlanId="'               21
     D  A04            C                   'rowColumnCode="'                     15
     D  A05            C                   'subheadingSequenceNumber="'          26
     D  A07            C                   'dateEnd="'                           9
     D  A08            C                   'dateStart="'                         11

     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     ITULLTAX   AA  01
     I                                  1 1024  RDATA

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C                   READ      TULLTAX                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX21R

     C                   EXSR      XML2

     C                   IF        SVTX21_07=*BLANKS
     C                   EVAL      SVTX21_07='9999-12-31'
     C                   ENDIF
     C
     C                   EVAL      WDT10=SVTX21_07
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX21R
     C                   ENDIF

     C                   ENDSL

     C                   READ      TULLTAX                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les <measurementUnitQualifier                            XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     A01           SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       13            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX21_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A02           SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       15            X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX21_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A03           SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       21            X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX21_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A04           SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       15            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX21_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A05           SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       26            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX21_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A07           SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX21_07=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     A08           SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX21_08=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX21F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX21R
     C                   READ      SVTX21F                                51
     C                   ENDDO
     C                   ENDSR
