     FTULLTAX   IF   F 1024        DISK    BLOCK(*YES)
     FSVTX15F   UF A E             DISK

     D  A              C                   '<measure '
     D  B              C                   '<measureCondition '
     D  C              C                   '<measureComponent '
     D  D              C                   '<measureFootnoteAssociation '
     D  E              C                   '<measureExcludedGeographicalArea '
     D  F              C                   '<measurePartialTemporaryStop '
     D  G              C                   '</measure>'

     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     ITULLTAX   AA  01
     I                                  1 1024  RDATA

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C                   READ      TULLTAX                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C     E             SCAN      RDATA                                  45
     C     F             SCAN      RDATA                                  46
     C     G             SCAN      RDATA                                  47

     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX15R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C                   WHEN      *IN44
     C                   EXSR      XML5
     C                   WHEN      *IN45
     C                   EXSR      XML6
     C                   WHEN      *IN46
     C                   EXSR      XML7
     C                   WHEN      *IN47
     C
     C                   EVAL      WDT10=SVTX15_10
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C     SVTX15_01     ANDNE     *BLANKS
     C                   WRITE     SVTX15R
     C                   ENDIF
     C                   ENDSL

     C                   READ      TULLTAX                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les >measure                                             XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'atureCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'calAreaId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'enclature="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'asureType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'nRoleType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ulationId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_06=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'hicalArea="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_07=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'lCodeType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_08=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'nalCodeId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_09=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX15_10=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_11=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'oppedFlag="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_12=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX15_10=*BLANKS
     C                   EVAL      SVTX15_10='9999-12-31'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >measureCondition                                    XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR
     C                   MOVE      *BLANKS       W21               2
     C                   MOVE      *BLANKS       W22               3
     C                   MOVE      *BLANKS       W23               1
     C                   MOVE      *BLANKS       W24               1
     C                   MOVE      *BLANKS       W25               1
     C                   MOVE      *BLANKS       W26               3
     C                   MOVE      *BLANKS       W27               6

     C     'ctionCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W21=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'icateCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W22=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'icateType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W23=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ionCodeId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W24=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ceNumber="'  SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       10            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W26=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX15_21A=*BLANKS
     C                   EVAL      SVTX15_21A=W21
     C                   EVAL      SVTX15_22A=W22
     C                   EVAL      SVTX15_23A=W23
     C                   EVAL      SVTX15_24A=W24
     C                   EVAL      SVTX15_26A=W26
     C                   WHEN      SVTX15_21B=*BLANKS
     C                   EVAL      SVTX15_21B=W21
     C                   EVAL      SVTX15_22B=W22
     C                   EVAL      SVTX15_23B=W23
     C                   EVAL      SVTX15_24B=W24
     C                   EVAL      SVTX15_26B=W26
     C                   WHEN      SVTX15_21C=*BLANKS
     C                   EVAL      SVTX15_21C=W21
     C                   EVAL      SVTX15_22C=W22
     C                   EVAL      SVTX15_23C=W23
     C                   EVAL      SVTX15_24C=W24
     C                   EVAL      SVTX15_26C=W26
     C                   WHEN      SVTX15_21D=*BLANKS
     C                   EVAL      SVTX15_21D=W21
     C                   EVAL      SVTX15_22D=W22
     C                   EVAL      SVTX15_23D=W23
     C                   EVAL      SVTX15_24D=W24
     C                   EVAL      SVTX15_26D=W26
     C                   WHEN      SVTX15_21E=*BLANKS
     C                   EVAL      SVTX15_21E=W21
     C                   EVAL      SVTX15_22E=W22
     C                   EVAL      SVTX15_23E=W23
     C                   EVAL      SVTX15_24E=W24
     C                   EVAL      SVTX15_26E=W26
     C                   WHEN      SVTX15_21F=*BLANKS
     C                   EVAL      SVTX15_21F=W21
     C                   EVAL      SVTX15_22F=W22
     C                   EVAL      SVTX15_23F=W23
     C                   EVAL      SVTX15_24F=W24
     C                   EVAL      SVTX15_26F=W26
     C                   WHEN      SVTX15_21G=*BLANKS
     C                   EVAL      SVTX15_21G=W21
     C                   EVAL      SVTX15_22G=W22
     C                   EVAL      SVTX15_23G=W23
     C                   EVAL      SVTX15_24G=W24
     C                   EVAL      SVTX15_26G=W26
     C                   WHEN      SVTX15_21H=*BLANKS
     C                   EVAL      SVTX15_21H=W21
     C                   EVAL      SVTX15_22H=W22
     C                   EVAL      SVTX15_23H=W23
     C                   EVAL      SVTX15_24H=W24
     C                   EVAL      SVTX15_26H=W26
     C                   WHEN      SVTX15_21I=*BLANKS
     C                   EVAL      SVTX15_21I=W21
     C                   EVAL      SVTX15_22I=W22
     C                   EVAL      SVTX15_23I=W23
     C                   EVAL      SVTX15_24I=W24
     C                   EVAL      SVTX15_26I=W26
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Les >measureCondition                                    XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C     'utyAmount="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_31=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ressionId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_32=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'tUnitCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_33=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'yUnitCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX15_34=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >measureFootnoteAssociation                          XML5
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML5          BEGSR
     C                   MOVE      *BLANKS       W41               3
     C                   MOVE      *BLANKS       W42               2
     C                   MOVE      *BLANKS       W43               1

     C     'ootnoteId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W41=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'tnoteType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W42=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX15_41A=*BLANKS
     C                   EVAL      SVTX15_41A=W41
     C                   EVAL      SVTX15_42A=W42
     C                   WHEN      SVTX15_41B=*BLANKS
     C                   EVAL      SVTX15_41B=W41
     C                   EVAL      SVTX15_42B=W42
     C                   WHEN      SVTX15_41C=*BLANKS
     C                   EVAL      SVTX15_41C=W41
     C                   EVAL      SVTX15_42C=W42
     C                   WHEN      SVTX15_41D=*BLANKS
     C                   EVAL      SVTX15_41D=W41
     C                   EVAL      SVTX15_42D=W42
     C                   WHEN      SVTX15_41E=*BLANKS
     C                   EVAL      SVTX15_41E=W41
     C                   EVAL      SVTX15_42E=W42
     C                   WHEN      SVTX15_41F=*BLANKS
     C                   EVAL      SVTX15_41F=W41
     C                   EVAL      SVTX15_42F=W42
     C                   WHEN      SVTX15_41G=*BLANKS
     C                   EVAL      SVTX15_41G=W41
     C                   EVAL      SVTX15_42G=W42
     C                   WHEN      SVTX15_41H=*BLANKS
     C                   EVAL      SVTX15_41H=W41
     C                   EVAL      SVTX15_42H=W42
     C                   WHEN      SVTX15_41I=*BLANKS
     C                   EVAL      SVTX15_41I=W41
     C                   EVAL      SVTX15_42I=W42
     C                   WHEN      SVTX15_41J=*BLANKS
     C                   EVAL      SVTX15_41J=W41
     C                   EVAL      SVTX15_42J=W42
     C                   WHEN      SVTX15_41K=*BLANKS
     C                   EVAL      SVTX15_41K=W41
     C                   EVAL      SVTX15_42K=W42
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Les >measureExcludedGeographicalArea                     XML6
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML6          BEGSR
     C                   MOVE      *BLANKS       W51               4
     C                   MOVE      *BLANKS       W52               6
     C                   MOVE      *BLANKS       W53               1

     C     'altAreaId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W51=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'icateCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W52=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX15_51A=*BLANKS
     C                   EVAL      SVTX15_51A=W51
     C                   EVAL      SVTX15_52A=W52
     C                   WHEN      SVTX15_51B=*BLANKS
     C                   EVAL      SVTX15_51B=W51
     C                   EVAL      SVTX15_52B=W52
     C                   WHEN      SVTX15_51C=*BLANKS
     C                   EVAL      SVTX15_51C=W51
     C                   EVAL      SVTX15_52C=W52
     C                   WHEN      SVTX15_51D=*BLANKS
     C                   EVAL      SVTX15_51D=W51
     C                   EVAL      SVTX15_52D=W52
     C                   WHEN      SVTX15_51E=*BLANKS
     C                   EVAL      SVTX15_51E=W51
     C                   EVAL      SVTX15_52E=W52
     C                   WHEN      SVTX15_51F=*BLANKS
     C                   EVAL      SVTX15_51F=W51
     C                   EVAL      SVTX15_52F=W52
     C                   WHEN      SVTX15_51G=*BLANKS
     C                   EVAL      SVTX15_51G=W51
     C                   EVAL      SVTX15_52G=W52
     C                   WHEN      SVTX15_51H=*BLANKS
     C                   EVAL      SVTX15_51H=W51
     C                   EVAL      SVTX15_52H=W52
     C                   WHEN      SVTX15_51I=*BLANKS
     C                   EVAL      SVTX15_51I=W51
     C                   EVAL      SVTX15_52I=W52
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Les >measurePartialTemporaryStop                         XML7
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML7          BEGSR
     C                   MOVE      *BLANKS       W61              10
     C                   MOVE      *BLANKS       W62              10
     C                   MOVE      *BLANKS       W63               8
     C                   MOVE      *BLANKS       W64               5
     C                   MOVE      *BLANKS       W65               2
     C                   MOVE      *BLANKS       W66               8
     C                   MOVE      *BLANKS       W67               5
     C                   MOVE      *BLANKS       W68               1
     C                   MOVE      *BLANKS       W69               1

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W61=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W62=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ulationId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W63=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'JournalId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W64=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'urnalPage="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   IF        W65=*BLANKS
     C                   EVAL      W65=%SUBST(RDATA :X:Z)
     C                   ELSE
     C                   EVAL      W68=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF

     C     'ulationId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W66=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'JournalId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W67=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF


     C                   IF        W62=*BLANKS
     C                   EVAL      W62='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W62
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT

     C                   SELECT
     C                   WHEN      SVTX15_61A=*BLANKS
     C                   EVAL      SVTX15_61A=W61
     C                   EVAL      SVTX15_62A=W62
     C                   EVAL      SVTX15_63A=W63
     C                   EVAL      SVTX15_64A=W64
     C                   EVAL      SVTX15_65A=W65
     C                   EVAL      SVTX15_66A=W66
     C                   EVAL      SVTX15_67A=W67
     C                   EVAL      SVTX15_68A=W68
     C                   WHEN      SVTX15_61B=*BLANKS
     C                   EVAL      SVTX15_61B=W61
     C                   EVAL      SVTX15_62B=W62
     C                   EVAL      SVTX15_63B=W63
     C                   EVAL      SVTX15_64B=W64
     C                   EVAL      SVTX15_65B=W65
     C                   EVAL      SVTX15_66B=W66
     C                   EVAL      SVTX15_67B=W67
     C                   EVAL      SVTX15_68B=W68
     C                   ENDSL
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX15F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX15R
     C                   READ      SVTX15F                                51
     C                   ENDDO
     C                   ENDSR
