********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 SH  PTF12 sikre mot doble
12XXX * 02 SH  PTF12 sikre mot doble  ytterligere
12XXX * 03 SH  PTF12 ny stategi fra ALTINN i filnavn
12XXX * 04 SH  PTF12 indikatorbytte + dummy update
********************************************************************
     H DATEDIT(*DMY)
     H DFTACTGRP(*NO)
     FALTINNF   UF A E           K DISK
      *_______________________________________________________
      * Les lenker i en katalog  og kopier dem til DB2 i SYEDI
      * Dette program fungerer kun for 1024 bytes recordlengde.
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""""
      *_____________________________
      * Prototype for API prosedyrer
      *"""""""""""""""""""""""""""""
     Dlstat            PR            10I 0 EXTPROC('lstat')
     D                                 *   VALUE
     D                                 *   VALUE

     Dopendir          PR              *   EXTPROC('opendir')
     D                                 *   VALUE

     Dreaddir          PR              *   EXTPROC('readdir')
     D                                 *   VALUE

     Dclosedir         PR            10I 0 EXTPROC('closedir')
     D                                 *   VALUE
     D SndPgmMsg       PR              N
     D Qmsgid                         7    CONST
     D Qmsgf                         20    CONST
     D Qmsg                         128    CONST
     D Qmsgtp                        10    CONST OPTIONS(*NOPASS)

      *   stat data structure fra prosedyre: lstat()
     D StatDS          DS           128
     D  st_mode                      10U 0
     D  st_ino                       10U 0
     D  st_nlink                      5U 0
     D  reserved1                     2A
     D  st_uid                       10U 0
     D  st_gid                       10U 0
     D  st_size                      10U 0
     D  st_atime                     10U 0
     D  st_mtime                     10U 0
     D  st_ctime                     10U 0
     D  st_dev                       10U 0
     D  st_blksize                   10I 0
     D  st_allocsize                 10I 0
     D  st_objtype                   10A
     D  reserved2                     2A
     D  st_codepage                   5U 0
     D  st_reserved1                 62A
     D  st_ino_gen_id                10U 0

      *   direntry data structure fra prosedyre: readdir()
     D DirEntry        DS
     D d_reserved1                   16A
     D d_fileno_genid                10U 0
     D d_fileno                      10U 0
     D d_reclen                      10U 0
     D d_reserved3                   10I 0
     D d_reservedÿ4                   6A
     D d_reserved5                    2A
     D d_ccsid                       10I 0
     D d_country_id                   2A
     D d_language_id                  3A
     D d_nls_reserved                 3A
     D d_namelen                     10U 0
     D d_name                       640A

     D Null            S              1A   Inz(X'00')
     D RETURNInt       S             10I 0
     D RETURNDir       S               *
     D PtrToEntry      S               *
     D RtnEntry        S                   BASED(PtrToEntry) Like(DirEntry)
     D EntryName       S            120A
     D EntryPath       S            256A
     D EntryPathF      S            256A
     D EntryPathT      S            256A
     D dirnamef        S            256A
     D dirnamet        S            256A
     D CmdLine         S            512
     D CmdLen          S             15  5
     D HHMMSS          S              6  0
     D DirError        C                   'Feil ved Âpning av katalog'
      *
      *   Input Parametere
      *
     D FullName        S            256A

      *
     D                 DS
     D  CMNA                   1      1    INZ('A')
     D  CMN                    2      8S 0
     D  MBR                    1      8
      *
     D ObjVar          S             90
     D ObjVarLen       S             10I 0 Inz(%size(ObjVar))
     D ObjVarFmt       S              8
     D ObjTyp          S             10

     D APIERR          DS
     D  ERRSIZ                 1      4B 0 INZ(256)
     D  ERRLEN                 5      8B 0 INZ(0)
     D  ERRMIC                 9     15
     D  ERRNBR                16     16
     D  ERRDTA                17    272
     D PSDS           SDS           512

     C                   EVAL      FullName = %trimr(DirNamef) + Null
      * ≈pne katalog
     C                   EVAL      RETURNDir = opendir(%addr(FullName))
      * Avslutt hvis feil ved Âpning av katalog
     C                   IF        RETURNDir = *Null
     C                   CALLP     SndPgmMsg('CPF9898':'QCPFMSG'
     C                                       :DirError)
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   ENDIF

     C                   DOU       PtrToEntry = *Null
      * Les neste katalog lenke
     C                   EVAL      PtrToEntry = readdir(RETURNDir)
      * Lenknavn er i feltet d_name
     C                   IF        PtrToEntry <> *Null
     C                   EVAL      DirEntry = RtnEntry
      * Hent katalog lenknavn
     C                   EVAL      EntryName = %str(%addr(d_name))
      * Vilken typ av lenke ?
     C                   EVAL      EntryPath = %trim(DirNamef)
     C                             + %trimr(EntryName) + Null
     C                   EVAL      RETURNInt = lstat(%addr(EntryPath)
     C                                         : %addr(StatDS))
      * flyttter enten .xml eller .pdf
     C                   IF        st_objtype='*STMF'
     C                   EXSR      MOVSTMF
     C                   ENDIF
     C                   ENDIF
     C                   ENDDO
      * Lukk katalog
     C                   EVAL      RETURNInt = closedir(RETURNDir)

     C                   EVAL      *INLR = *ON
      ******************************************************************
     C     MOVSTMF       BEGSR
      ******************************************************************
     c                   movel     d_name        aldato
     c     aldato        chain     altinnf                            55
n01   *
n01  c* aldri pdf f¯rst pÂ angitt dato
n01   *
n01  c     *in55         ifeq      '1'
n01  c     uexten        andeq     '.pdf'
n01  c                   goto      utsr
n01  c                   end
n02   *
n02  c* aldri dobbelbehandling
n02   *
n02  c     *in55         ifeq      '0'
      *  pdf  allerede lest gÂ ut
n02  c     uexten        ifeq      '.pdf'
n02  c     alpdf         andeq     'J'
n02  c                   eval      lest='J'
n04  c                   update    altinnfr
n02  c                   goto      utsr
n02  c                   end
      *  xml  allerede lest gÂ ut
n02  c     uexten        ifeq      '.xml'
n02  c     alxml         andeq     'J'
n02  c                   eval      lest='J'
n04  c                   update    altinnfr
n02  c                   goto      utsr
n02  c                   end
n02  c                   end
     c*
     c                   move      *blanks       franyttobj      256
     c                   move      *blanks       nyttnavn         70
     c                   move      *blanks       tilban           70
     c                   movel     'ALTINN'      kode49
     c     *in55         ifeq      '1'
     c                   call      'SYGE49'
     c                   parm                    kode49            8
     c                   parm                    verdi49           7 0
     c                   else
     c                   move      allop         verdi49
     c                   end
     c                   move      verdi49       verdi49a          7
     c                   move      verdi49       allop
     c                   setoff                                       54
      *  er det altinn pdffilen
     c     uexten        ifeq      '.pdf'
s04  C*    '(xml)'       SCAN      D_name                                 55
s04  c*    *in55         ifeq      '0'
n04  C     'xml'         SCAN      D_name                                 57
n04  c     *in57         ifeq      '0'
     C     '.pdf'        SCAN      D_name                                 54
     c     *in54         ifeq      '0'
     C     'Dagsoppgj¯r' SCAN      D_name                                 54
     c                   end
     c     *in54         ifeq      '1'
     c                   eval      nyttnavn='ALTINN'  + %trim(verdi49a)
     c                             + '.pdf'
     c                   move      'J'           alpdf
     c                   movel     d_name        alfilp
     c                   end
N03  c                   end
     c                   end
      *
      *  Start Â behandle XML filen
      *
     c     uexten        ifeq      '.xml'
      * hvis xml allerede lest gi cl beskjed om Â vente 10 minutter
      * og derettter behandle pdf
s04   *  f¯lgende test er allerede tatt h¯yde for
s04  c*    *in55         ifeq      '0'
s04  c*    alxml         andeq     'J'
s04  c*    alpdf         andne     'J'
s04  c*                  eval      lest='J'
s04  c*                  goto      utsr
s04  c*                  end
      * xml kan vÊre .xml/dokument/(xml)
     c     *in54         ifeq      '0'
     C     '.xml'        SCAN      D_name                                 54
n03  c     *in54         ifeq      '0'
n03  C     '(xml)'       SCAN      D_name                                 54
n03  c                   end
     c     *in54         ifeq      '0'
     C     'dokument'    SCAN      D_name                                 54
     c                   end
     c     *in54         ifeq      '1'
     c                   eval      nyttnavn='ALTINN'  + %trim(verdi49a)
     c                             + '.xml'
     c                   move      'J'           alxml
     c                   movel     d_name        alfilx
     c                   end
     c                   end
     c                   end
     c     *in54         ifeq      '1'
     C* opprinnelig fil
     C                   EVAL      EntryPathF = %trim(DirNameF)
     C                             + %trimr(EntryName)
     C* nytt direktory
     C                   EVAL      TILBAN = %trim(DirNameT)
     C* fra nytt obj
     C                   EVAL      franyttobj = %trim(DirNameF)
     C                             + %trim(nyttnavn)
     c*
     C                   CALL      'SYAL02CL'
     C                   PARM                    EntryPathF
     C                   PARM                    nyttnavn
     C                   PARM                    FRAnyttobj
     C                   PARM                    TILBAN
     c                   eval      lest='J'
     c  N55              update    altinnfr
     c   55              write     altinnfr

     c                   end

     C     utsr          ENDSR
      *************************************************************
     C     *INZSR        BEGSR
      *************************************************************
     c     *entry        plist
     c                   parm                    uexten            4
     c                   parm                    udirname        150
     c                   parm                    lest              1
     c                   eval      lest='N'
     c                   eval      dirnamef=%trimr(udirname)
     C     '/TEMP'       SCAN      dirnamef      nr                3 0    33
     c                   eval      dirnamet=%trimr(%SUBST(dirnamef:1:nr))
     C     Qcmdexc       PLIST
     C                   PARM                    CmdLine
     C                   PARM                    Cmdlen

     C                   TIME                    HHMMSS

      *
     C                   ENDSR
      *-------------------------------------------------------------------------
      * Send pgm message
      *-------------------------------------------------------------------------
     P SndPgmMsg       B
     D                 PI              N
     D Msgid                          7    CONST
     D MsgF                          20    CONST
     D Msgdta                       128    CONST
     D Msgtp                         10    CONST OPTIONS(*NOPASS)
      * Work variables
     D Qmsgid          S              7
     D Qmsgf           S             20
     D Qmsgdta         S            128
     D Qmsgln          S             10I 0
     D Qmsgtp          S             10
     D Qmsgq           S             10
     D Qmsgqn          S             10I 0 INZ(3)
     D Qmsgky          S              4
     D Qmsger          S             15
      * Hvis bibliotek er lik blank set in *LIBL
     C                   EVAL      Qmsgid = Msgid
     C                   EVAL      Qmsgf = Msgf
     C                   EVAL      Qmsgdta = Msgdta
     C                   IF        %subst(Qmsgf:11:10) = *blank
     C                   EVAL      %subst(Qmsgf:11:10) = '*LIBL'
     C                   ENDIF
     C                   EVAL      Qmsgln = %len(%trim(Qmsgdta))
     C                   EVAL      Qmsgq = '*'
     C                   EVAL      Qmsgtp = '*DIAG'
     C                   IF        %PARMs > 3
     C                   EVAL      Qmsgtp = Msgtp
     C                   ENDIF
     C                   IF        Qmsgtp = '*STATUS'
     C                   EVAL      Qmsgq = '*EXT'
     C                   ENDIF
      *
     C                   CALL      'QMHSNDPM'                           99
     C                   PARM                    Qmsgid
     C                   PARM                    Qmsgf
     C                   PARM                    Qmsgdta
     C                   PARM                    Qmsgln
     C                   PARM                    Qmsgtp
     C                   PARM                    Qmsgq
     C                   PARM                    Qmsgqn
     C                   PARM                    Qmsgky
     C                   PARM      *LOVAL        Qmsger
      *
     C                   RETURN    *ON
     P                 E
