     C                   CALL      'SYCTA00R'
     C                   PARM      75            UAVD              4 0
     C                   PARM      134           UUPD              7 0
     C                   PARM                    Uxxx              1
     C                   SETON                                        LR
     C                   RETURN
      *
