      *
      ***********************************************************
      *** PROGRAM sjekker startpunkt                          ***
      ***********************************************************
      *
     FSYDRJBLOG IF   E             DISK
     D                 DS
     D  DSLIB                  1     10    DIM(10)
     D  DSLIBW                 1     10
     D                 DS
     D  DSSBS                  1     10
     D  SBS3                   1      3
     D  SBS4                   1      4
     D  SBS5                   1      5
     D  SBS6                   1      6
     D  SBS7                   1      7
     D  SBS8                   1      8
     D  SBS9                   1      9
     D  SBS10                  1     10
     D                 DS
     D  udato                  1      8
     D  udag                   1      2
     D  umnd                   4      5
     D  uaar                   7      8
     D                 DS
     D  utid                   1      8
     D  uti                    1      2
     D  umi                    4      5
     D  use                    7      8
     D                 DS
     D  dsdato                 1      8
     D  daar                   1      4
     D  dmnd                   5      6
     D  ddag                   7      8
     D                 DS
     D  dstid                  1      6
     D  dti                    1      2
     D  dmi                    3      4
     D  dse                    5      6
      *
     C                   EXSR      INIT
     C*
     c                   exsr      test
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    sbs              10
     c                   parm                    lib              10
     c                   parm                    dato              8
     c                   parm                    tid               6
     C                   ENDSR
     C*
     C***********************************************
     C     test          BEGSR
     C***********************************************
     c                   setoff                                       33
     c                   move      sbs           dssbs
     C     ' '           SCAN      SBS           NRT               3 0    34
     c  N34              z-add     10            NRT
     c   34              sub       1             NRT
     c     *in33         doweq     '0'
     c                   read      SYDRJBLOG                              33
     c     *in33         ifeq      '0'
     C     'started'     SCAN      TEXT          Sp                3 0    34
     c     *in34         ifeq      '1'
     c                   move      'J'           lestdt            1
     c     sp            add       11            sp2               3 0
     c     sp            add       23            sp3               3 0
     c                   eval      udato = %subst(TEXT:Sp2:8)
     c                   eval      utid = %subst(TEXT:Sp3:8)
     c                   move      udag          ddag
     c                   move      umnd          dmnd
     c                   move      uaar          daar
     c                   movel     '20'          daar
     c                   move      uti           dti
     c                   move      umi           dmi
     c                   move      use           dse
     c                   move      dsdato        dato
     c                   move      dstid         tid
     C                   else
     c     lestdt        ifeq      'J'
     c                   z-add     0             sp
     c     nrt           ifeq      3
     C     sbs3          SCAN      TEXT          Sp                3 0    34
     c     sp            add       7             sp2               3 0
     c                   end
     c     nrt           ifeq      4
     C     sbs4          SCAN      TEXT          Sp                3 0    34
     c     sp            add       8             sp2               3 0
     c                   end
     c     nrt           ifeq      5
     C     sbs5          SCAN      TEXT          Sp                3 0    34
     c     sp            add       9             sp2               3 0
     c                   end
     c     nrt           ifeq      6
     C     sbs6          SCAN      TEXT          Sp                3 0    34
     c     sp            add       10            sp2               3 0
     c                   end
     c     nrt           ifeq      7
     C     sbs7          SCAN      TEXT          Sp                3 0    34
     c     sp            add       11            sp2               3 0
     c                   end
     c     nrt           ifeq      8
     C     sbs8          SCAN      TEXT          Sp                3 0    34
     c     sp            add       12            sp2               3 0
     c                   end
     c     nrt           ifeq      9
     C     sbs9          SCAN      TEXT          Sp                3 0    34
     c     sp            add       13            sp2               3 0
     c                   end
     c     nrt           ifeq      10
     C     sbs10         SCAN      TEXT          Sp                3 0    34
     c     sp            add       14            sp2               3 0
     c                   end
     c     *in34         ifeq      '1'
     c                   eval      dslibw = %subst(TEXT:Sp2:10)
     C     '.'           SCAN      DSLIBW        NRT               3 0    34
     c   34              movea     *blanks       DSLIB(NRT)
     c                   eval      lib=dslibw
     c                   goto      utsr
     c                   end
     c                   end
     c                   end
     c                   end
     c                   enddo
     c     utsr          endsr
