      *
      ***********************************************************
      *** PROGRAM skjekker om prestartjobber er aktive        ***
      ***********************************************************
      *
     FSYDRSBSJN UF   E           K DISK
     FSYdr07fm  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  SYTXT                  1     30
     D  XDLT                   1      4
     C*
     c     start0        tag
     c                   call      'SYDRSBSST'
     c                   parm                    ini               1
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   EXSR      INIT
     C*
     C     START         TAG
     C*                  MOVE      '1'           *IN93
     C*                  WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      sysbs         Ysbs
     C                   MOVE      syjobn        Yjob
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     keyst0        SETLL     SYDRSBSJN
     C     START1        TAG
     C                   READ(N)   SYDRSBSJN                              94
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     c                   setoff                                       70
     c     syakti        ifeq      'N'
     c                   seton                                        70
     c                   end
     C                   write     SUBFIL
     C                   READ(N)   SYDRSBSJN                              94
     C  N94              MOVE      sysbs         Ysbs
     C  N94              MOVE      syjobn        Yjob
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   SETOFF                                       9998
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START0
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94keyrol        SETLL     SYDRSBSJN
     C  N94              READ(N)   SYDRSBSJN                              94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C  N98              GOTO      START0
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE
     C     START5        TAG
     C                   GOTO      START3
     C*
     C*** SØK FRA AVDELING
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       7             LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          MULT      2             XLIN
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 02 = endre
      *
     C     WSNR          IFEQ      '2'
     c                   exsr      endre
     c                   seton                                        99
     c                   setoff                                       70
     c     syakti        ifeq      'N'
     c                   seton                                        70
     c                   end
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   GOTO      SLHENT
     C                   END
      *
      *
      * W  = arbeid med subsystem
      *
     C     WSNR          IFEQ      'W'
     c                   exsr      WRKSBS
     c                   seton                                        99
     c                   setoff                                       70
     c     syakti        ifeq      'N'
     c                   seton                                        70
     c                   end
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   GOTO      SLHENT
     C                   END
      *
      *
      * S  = starte sub system
      *
     C     WSNR          IFEQ      'S'
     c     syakti        andeq     'N'
     c                   exsr      STRSBS
     c                   seton                                        99
     c                   setoff                                       70
     c                   move      'J'           syakti
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   GOTO      SLHENT
     C                   END
      *
      *
     C                   ENDdo
      *
      *
     C*
     C     SLHENT        TAG
     C   99              SETOFF                                       98
     C                   Z-add     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     keyst0        KLIST
     C                   KFLD                    WSSBS            10
     C     keyrol        KLIST
     C                   KFLD                    ysbs             10
     C                   KFLD                    yjob              6
     C     keye          KLIST
     C                   KFLD                    sysbs            10
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     wrksbs        BEGSR
     C***********************************************
     c                   CALL      'SYDRWRKS'
     C                   PARM                    sysbs
     c                   endsr
     C***********************************************
     C     strsbs        BEGSR
     C***********************************************
     c                   CALL      'SYDRSTRS'
     C                   PARM                    sysbs
     C                   PARM                    sylib
     c                   endsr
     C***********************************************
     C     endre         BEGSR
     C***********************************************
     c                   move      systr         wsstr
     c                   move      sydag         wsdag
     c                   exfmt     vareli
     c  N12              do
     c     keye          chain     SYDRSBSJN                          33
     c                   move      wsstr         systr
     c                   move      wsdag         sydag
     c                   update    SYDRSBSJNR
     C                   END
     c                   endsr
