      *
      ***********************************************************
      *** PROGRAM skjekker jobbkøer
      ***********************************************************
      *
     H DECEDIT(',') debug(*yes)
     FJOBQSTATUSIP   e             DISK
     F                                     RENAME(jobqstatus:innr)
     D                 DS
     D  DATA                   1    512
     D  DET                    4      4
     D  JOBQ                   6     15
     D  jobq7                  6     12
     D  ANT0                  35     35
     D  ANT1                  36     36
     D  antall                34     37
     D  SUBSYS                41     50
     D  JOBQSTS               56     58
     Iinnr
     I              jobqstatus                  RDATA
      *
     c                   exsr      test
     C*
     C***********************************************
     C     test          BEGSR
     C***********************************************
     c                   move      RDATA         DATA
     c     det           ifeq      '1'
     c     det           oreq      '2'
     c     SUBSYS        ifne      *blanks
     c     ant1          andne     *blanks
     c* spesial A53
     c     subsys        ifeq      'SYSBS_A53'
     c     jobq7         andeq     'SYJOBQA'
     c                   exsr      a53
     C                   else
     c     ant1          ifgt      '1'
     c                   eval      meld=%trim(SUBSYS)
     c                             +'  jobq: '
     c                             +%trim(JOBQ)
     c                             +' Ant. jobber: '
     c                             +%trim(ANTALL)
     C     JOBQSTS       IFEQ      'HLD'
     c                   eval      meld=%trim(meld)
     c                             +' Jobq er holdt tilbake'
     c                   end
     c                   call      'SYDRSYSST'
     c                   parm                    meld             70
     c*                  dump
     c                   end
     c                   end
     c                   end
     c                   end
     c     utsr          endsr
      *******************************************************************
     c     a53           begsr
      *******************************************************************
     c* a53 rapporterer 200-999 jobber i syjobqark
     C     ANT0          ifge      '2'
     c     ant0          andle     '9'
     c                   eval      meld=%trim(SUBSYS)
     c                             +'  Problem jobq: '
     c                             +%trIm(JOBQ)
     c                             +' Antall jobber: '
     c                             +%trim(ANTALL)
     c                   call      'SYDRSYSST'
     c                   parm                    meld             70
     c                   end
     c                   endsr
