********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
      *-------------------------------------------------------------
10XXX * 02 sh  PTF11 både kunde/leverandør
10XXX * 03 sh  PTF11 feil ved lesing firma
10XXX * 04 sh  PTF12 søke på kundens avtalenummer
10XXX * 05 sh  PTF12 vise utløpsdato
10XXX * 06 sh  PTF12 slett gamle avtaler/kopier til ny dato
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE GEBYRS PRISAVT. (KUNDER)  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-40 45-97          ***
      ***********************************************************
      *
S06  F*RIK      IF   E           K DISK
N06  FPRIK      UF A E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTGE    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYFA09FM  CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
N05  D                 DS
N05  D  PKDT                   1      8  0
N05  D  PKAAR                  3      4  0
N05  D  PKMND                  5      6  0
N05  D  PKDAG                  7      8  0
N06  D                 DS
N06  D  NYDATO                 1      6  0
N06  D  NYDAG                  1      2  0
N06  D  NYMND                  3      4  0
N06  D  NYAAR                  5      6  0
N06  D                 DS
N06  D  KUNDAT                 1      6  0
N06  D  KUNDAG                 1      2  0
N06  D  KUNMND                 3      4  0
N06  D  KUNAAR                 5      6  0
N06  D                 DS
N06  D  KUNDATF                1      8  0
N06  D  KUNCCCF                1      2  0
N06  D  KUNAARF                3      4  0
N06  D  KUNMNDF                5      6  0
N06  D  KUNDAGF                7      8  0
N06  D                 DS
N06  D  NYDATOF                1      8  0
N06  D  NYCCCF                 1      2  0
N06  D  NYAARF                 3      4  0
N06  D  NYMNDF                 5      6  0
N06  D  NYDAGF                 7      8  0
N06  D                 DS
N06  D  KODATO                 1      6  0
N06  D  KODAG                  1      2  0
N06  D  KOMND                  3      4  0
N06  D  KOAAR                  5      6  0
N06  D                 DS
N06  D  KFDATO                 1      6  0
N06  D  KFDAG                  1      2  0
N06  D  KFMND                  3      4  0
N06  D  KFAAR                  5      6  0
N06  D                 DS
N06  D  KFDATOF                1      8  0
N06  D  KFCCCF                 1      2  0
N06  D  KFAARF                 3      4  0
N06  D  KFMNDF                 5      6  0
N06  D  KFDAGF                 7      8  0
N06  D                 DS
N06  D  SLDATO                 1      6  0
N06  D  SLDAG                  1      2  0
N06  D  SLMND                  3      4  0
N06  D  SLAAR                  5      6  0
N06  D                 DS
N06  D  SLDATOF                1      8  0
N06  D  SLCCCF                 1      2  0
N06  D  SLAARF                 3      4  0
N06  D  SLMNDF                 5      6  0
N06  D  SLDAGF                 7      8  0
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
s01  D*               UDS
s01  D* FIFIRM                 1      2
     C*
     C                   EXSR      INIT
     C     UKNR          IFNE      0
     C                   GOTO      TSTPA
     C                   END
     C*
     C     BG1           TAG
     C  N30
     CANN04              Z-ADD     9             LINNBR
     C  N30
     CANN04              Z-ADD     20            POSNBR
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309998
     C*
     C   03              GOTO      SLUTT
      *
n06   * sett ny dato alle avtaler
      *
n06  c     *in10         ifeq      '1'
n06  C                   exsr      nydatosr
n06  C                   goto      BG1
N06  c                   else
N06   * tastet ny dato men ikke tastet F10
n06  c     nydato        ifne      0
N06  C                   MOVE      'SHU1762'     MSGNR
N06  C                   SETON                                        3095
N06  C                   Z-ADD     21            LINNBR
N06  C                   Z-ADD     49            POSNBR
n06  C                   goto      BG1
n06  c                   end
n06  c                   end
      *
n06   * slett alle avtalelinjer med en gitt dato
      *
n06  c     *in09         ifeq      '1'
n06  C                   exsr      sldatosr
n06  C                   goto      BG1
N06  c                   else
N06   * tastet ny dato men ikke tastet F10
n06  c     sldato        ifne      0
N06  C                   MOVE      'SHU1768'     MSGNR
N06  C                   SETON                                        3095
N06  C                   Z-ADD     23            LINNBR
N06  C                   Z-ADD     49            POSNBR
n06  C                   goto      BG1
n06  c                   end
n06  c                   end
      *
n06   * kopier gamle avtaler til ny dato
      *
n06  c     *in11         ifeq      '1'
n06  C                   exsr      kodatosr
n06  C                   goto      BG1
N06  c                   else
N06   * tastet ny dato men ikke tastet F10
n06  c     kodato        ifne      0
n06  c     kfdato        orne      0
N06  C                   MOVE      'SHU1763'     MSGNR
N06  C                   SETON                                        309492
N06  C                   Z-ADD     22            LINNBR
N06  C                   Z-ADD     49            POSNBR
     c                   seton                                        30
n06  C                   goto      BG1
n06  c                   end
n06  c                   end
     C   04              DO
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   EXSR      SØKDTA
     C                   GOTO      BG1
     C                   END
     C*
     C     TSTPA         TAG
     C                   EXSR      TESTB1
     C   30              GOTO      BG1
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN43
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(43)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   EXSR      MOVBY
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     PRIK1K        SETLL     PRIK
     C     START1        TAG
s06  C*    YKNR          READE     PRIK                                   44
N06  C     YKNR          READE(N)  PRIK                                   44
     C  N44WSAVTN        COMP      PKAVTN                             4444
N06  c  N44KUNDATF       ifne      *zeros
N06  c     pkdt          andne     kundatf
N06  c                   goto      start1
N06  c                   end
      *
     C     START2        TAG
      *
     C  N44              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
N05  C                   EVAL      PKDTWS=PKAAR+PKMND*100+PKDAG*10000
N05  c                   move      *blanks       utlopt
N05  c     pkdt          ifle      utloptf
     C     PKDT          ANDNE     0
N05  c                   move      'UTLØPT'      utlopt
N06  c                   end
     C                   WRITE     SUBFIL
s06  C*    YKNR          READE     PRIK                                   44
N06  c     lesn          tag
N06  C     YKNR          READE(N)  PRIK                                   44
N06  c  N44KUNDATF       ifne      *zeros
N06  c     pkdt          andne     kundatf
N06  c                   goto      lesn
N06  c                   end
     C  N44WSAVTN        COMP      PKAVTN                             4444
     C  N44              EXSR      MOVPY
     C  N44              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(41)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C                   SETOFF                                       30
     C*
     C*** EXIT
     C   03              GOTO      SLUTT
     C*
     C*** REFRESH
     C   05              GOTO      START
     C*
     C*** CREATE
     C   06              DO
     C                   EXSR      CRTPR
     C                   GOTO      START3
     C                   END
     C*** OLJETILLEGG M.M.
     C   07              DO
     C                   CALL      'SYFA23B'
     C                   PARM                    WSKNR
     C                   GOTO      START3
     C                   END
     C*** SEARCH
     C   08              GOTO      START6
     C*** DELETE
     C   10              GOTO      START7
     C*** CANCEL
     C   12              GOTO      BG1
     C*
     C*** ROLL
     C   25              DO
     C                   SETOFF                                       2544
     C                   Z-ADD     YRECNO        ZRECNO
     C*** READ FIRST RECORD FROM FILE THAT IS NOT AT SUBFILE
     C     PRIK3K        SETLL     PRIK
s06  C*    YKNR          READE     PRIK                                   44
N06  C     YKNR          READE(N)  PRIK                                   44
     C  N44WSAVTN        COMP      PKAVTN                             4444
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
     C*
     C*** SEARCH
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C*** DELETE
     C     START7        TAG
     C                   EXFMT     DLTAVT
     C   12              GOTO      START3
     C  N05              GOTO      START7
     C                   CALL      'SYFA09C'
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   SETOFF                                       10
     C                   GOTO      BG1
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C                   MOVE      WSKNR         YKNR
     C     KUND1K        CHAIN     CUNDL01                            99
     C   99              DO
     C                   MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
N06  c                   setoff                                       93
N06  c                   move      *zeros        kundatf
N06  C  n30KUNDAT        IFNE      0
N06  C                   MOVE      KUNDAG        UDD               2 0
N06  C                   MOVE      KUNMND        UMM               2 0
N06  C                   MOVE      KUNAAR        UÅÅ               2 0
N06  C                   CALL      'TESTDATO'
N06  C                   PARM                    UDD
N06  C                   PARM                    UMM
N06  C                   PARM                    UÅÅ
N06  C                   PARM                    UFLAG2            1 0
N06  C     UFLAG2        COMP      1                                      93
N06  c     *in93         ifeq      '1'
N06  C                   MOVE      'SPD0001'     MSGNR
N06  C                   SETON                                        30
N06  C                   Z-ADD     9             LINNBR
N06  C                   Z-ADD     52            POSNBR
N06  c                   else
N06  c                   z-add     20            KUNCCCF
N06  c                   move      kundag        KUNDAGF
N06  c                   move      kunmnd        KUNMNDF
N06  c                   move      kunaar        KUNAARF
N06  C                   END
N06  C                   end
     C     WSAVTN        COMP      ' '                                    98
     C   98              DO
     C  N30              MOVE      'SPA0013'     MSGNR
     C  N30              Z-ADD     11            LINNBR
     C  N30              Z-ADD     20            POSNBR
     C                   SETON                                        30
     C                   END
     C*
     C*** WSKNRK <> 0  -->  KOPIERING AV AVTALE
     C     WSKNRK        IFNE      0
     C     PRIK4K        SETLL     PRIK
s06  C*    YKNR          READE     PRIK                                   33
N06  C     YKNR          READE(N)  PRIK                                   33
     C  N33              DO
     C     WSAVTN        COMP      PKAVTN                                 33
     C   33              DO
     C                   MOVE      'SPK0048'     MSGNR
     C                   SETON                                        9930
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
     C                   END
     C*
     C                   MOVE      WSKNRK        YKNR
     C     KUND1K        CHAIN     CUNDL01                            97
     C   97              DO
     C                   MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
     C     WSAVTK        COMP      ' '                                    96
     C   96
     CANN30              MOVE      'SPA0013'     MSGNR
     C  N96              DO
     C     PRIK4K        SETLL     PRIK
s06  C*    YKNR          READE     PRIK                                   96
N06  C     YKNR          READE(N)  PRIK                                   96
     C  N96WSAVTK        COMP      PKAVTN                             9696
     C   96
     CANN30              MOVE      'SPA0028'     MSGNR
     C                   END
     C   96              DO
     C  N30              Z-ADD     18            LINNBR
     C  N30              Z-ADD     20            POSNBR
     C                   SETON                                        30
     C                   END
     C  N30              EXSR      AVTKP
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     AVTKP         BEGSR
     C***********************************************
     C                   CALL      'SYFA09B'
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    WSKNRK
     C                   PARM                    WSAVTK
     C                   MOVE      WSKNR         YKNR
     C                   MOVE      *ZEROS        WSKNRK
     C                   MOVE      ' '           WSAVTK
     C                   MOVE      '0'           WSAVTK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(41)
     C     *IN30         DOWEQ     '0'
     C                   READC     SUBFIL                                 30
     C  N30WSNR          IFEQ      '2'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      CHGPR                                        CHANGE
     C                   GOTO      SLHENT
     C                   END
     C  N30WSNR          IFEQ      '3'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      CPYPR                                        COPY
     C                   GOTO      SLHENT
     C                   END
     C  N30WSNR          IFEQ      '4'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      DELPR                                        DELETE
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C   30              MOVE      'DIV0012'     MSGNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DELPR         BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C                   MOVE      ' '           WSNR
     C     UFLAGG        IFNE      1
     C                   MOVE      '*DL'         PKGEBY
     C                   MOVE      *BLANKS       KGENOT
     C                   MOVE      *BLANKS       PKAVTT
     C                   MOVE      *BLANKS       PKTNR
     C                   MOVE      *BLANKS       PKMVA
     C                   MOVE      *ZEROS        PKINT
     C                   MOVE      *ZEROS        PKLNR
     C                   MOVE      *ZEROS        PKBELØ
     C                   MOVE      *ZEROS        PKPPR
     C                   MOVE      *BLANKS       PKKOLL
     C                   MOVE      *BLANKS       PKTEGN
     C                   MOVE      *ZEROS        PKJUST
     C                   MOVE      *BLANKS       PKFVAL
     C                   MOVE      *BLANKS       PKSAMM
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGPR         BEGSR
     C***********************************************
     C                   Z-ADD     2             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CPYPR         BEGSR
     C***********************************************
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   Z-ADD     3             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C     UFLAGG        IFNE      1
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
     C                   WRITE     SUBFIL
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CRTPR         BEGSR
     C***********************************************
     C                   Z-ADD     9             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C     UFLAGG        IFNE      1
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
     C                   WRITE     SUBFIL
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBY         BEGSR
     C***********************************************
     C                   MOVE      W2GEBY        YGEBY
     C                   MOVE      W2AVTT        YAVTT
     C                   MOVE      W2INT         YINT
     C                   MOVE      W2LNR         YLNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVPY         BEGSR
     C***********************************************
     C                   MOVE      PKGEBY        YGEBY
     C                   MOVE      PKAVTT        YAVTT
     C                   MOVE      PKINT         YINT
     C                   MOVE      PKLNR         YLNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
S01  C*                  CALL      'SOEKUN'
S01  C*                  PARM                    FIFIRM
S01  C*                  PARM                    SOANTK
S01  C*                  PARM                    SOTXT1
S01  C*                  PARM                    WSKNR
S01  C*                  PARM                    SOTXT2
S01  C*                  PARM                    WSKNRK
S01  C*                  PARM                    SOTXT3
S01  C*                  PARM                    SOKNR3
S01  C*                  PARM                    SOTXT4
S01  C*                  PARM                    SOKNR4
S01  C*                  PARM                    SOTXT5
S01  C*                  PARM                    SOKNR5
S01  C*                  PARM                    SOTXT6
S01  C*                  PARM                    SOKNR6
S01  C*                  PARM                    SOTXT7
S01  C*                  PARM                    SOKNR7
S01  C*                  PARM                    SOTXT8
S01  C*                  PARM                    SOKNR8
S01  C*                  Z-ADD     11            LINNBR
S01  C*                  GOTO      SLSØK
N01   * Søke på den du skal vedlikehold
N01  C     LINNBR        IFEQ      9
N01  C     POSNBR        ANDGE     20
N01  C     POSNBR        ANDLE     27
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNR
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   Z-ADD     11            LINNBR
N01  C                   Z-ADD     20            POSNBR
N01  C                   GOTO      SLSØK
N01  C                   END
N04   * Søke på avtalenummer
N04   *
N04  C     LINNBR        IFEQ      11
N04  C     POSNBR        ANDEQ     20
N04  C     WSKNR         ANDNE     *ZEROS
N04  C                   MOVE      '1'           xxlagg
N04  C                   MOVE      WSKNR         UKUNDA
n04  C                   EVAL      XXSER='AVTAL'
N04  C                   CALL      'SYPR03R'
N04  C                   PARM                    UKUNDA            8
N04  C                   PARM                    UAVDA             4
N04  C                   PARM                    XXSER            10
N04  C                   PARM                    XXLAGG            1
N04  C                   movel     xxser         wsavtn
N04  C                   GOTO      SLSØK
N04  C                   END
N01   * Søke på den du skal kiere fra
s04  C*    LINNBR        IFEQ      11
N04  C     LINNBR        IFEQ      16
N01  C     POSNBR        ANDGE     20
N01  C     POSNBR        ANDLE     27
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNRK
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   Z-ADD     18            LINNBR
N01  C                   Z-ADD     20            POSNBR
N01  C                   GOTO      SLSØK
N01  C                   END
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
N02  C                   PARM                    Ukule             1
     C                   PARM                    UKNR              8 0
     C                   MOVE      UKNR          WSKNR
n02  c     ukule         comp      'L'                                282827
     C     PRIK1K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    W2GEBY
     C                   KFLD                    W2AVTT
     C                   KFLD                    W2INT
     C                   KFLD                    W2LNR
     C     PRIK2K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    PKGEBY
     C                   KFLD                    PKAVTT
     C                   KFLD                    PKINT
     C                   KFLD                    PKLNR
     C     PRIK3K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    YGEBY
     C                   KFLD                    YAVTT
     C                   KFLD                    YINT
     C                   KFLD                    YLNR
     C     PRIK4K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTK
     C                   KFLD                    YGEBY
     C                   KFLD                    YAVTT
     C                   KFLD                    YINT
     C                   KFLD                    YLNR
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNR
     C     KODGEK        KLIST
     C                   KFLD                    YGEUNI
     C                   KFLD                    PKGEBY
     C*
     C                   MOVE      '        '    YKNR              8
     C                   MOVE      '   '         YGEBY             3
     C                   MOVE      ' '           YAVTT             1
     C                   MOVE      *ZEROS        YINT              5 0
     C                   MOVE      *ZEROS        YLNR              4 0
     C                   MOVE      *ZEROS        W2LNR             4 0
N06  C                   MOVE      *ZEROS        PKDT
N06  C                   MOVE      *ZEROS        NYDATO
N06  C                   MOVE      *ZEROS        NYDATOF
N06  C                   MOVE      *ZEROS        KODATO
N06  C                   MOVE      *ZEROS        KUNDAT
N06  C                   MOVE      *ZEROS        KUNDATF
N06  C                   MOVE      *ZEROS        KFDATO
N06  C                   MOVE      *ZEROS        KFDATOF
N06  C                   MOVE      *ZEROS        SLDATO
N06  C                   MOVE      *ZEROS        SLDATOF
N06  C                   CALL      'SYGE15C'
N06  C                   PARM                    WDT               8
N06  C                   PARM                    WTM               6
N06  C                   MOVE      WDT           UTLOPTF           8 0
     C                   MOVE      'GE'          YGEUNI            2
     C*
     C                   MOVE      '0'           WSAVTK
     C                   MOVE      '0'           WSAVTN
     C*
S03  C*    FIFIRM        SETLL     FIRM
n03  C     *loval        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
S01  C*                  Z-ADD     2             SOANTK            1 0
S01  C*                  MOVE      *BLANKS       SOTXT3            8
S01  C*                  MOVE      *BLANKS       SOTXT4            8
S01  C*                  MOVE      *BLANKS       SOTXT5            8
S01  C*                  MOVE      *BLANKS       SOTXT6            8
S01  C*                  MOVE      *BLANKS       SOTXT7            8
S01  C*                  MOVE      *BLANKS       SOTXT8            8
S01  C*                  MOVE      *ZEROS        SOKNR3            8 0
S01  C*                  MOVE      *ZEROS        SOKNR4            8 0
S01  C*                  MOVE      *ZEROS        SOKNR5            8 0
S01  C*                  MOVE      *ZEROS        SOKNR6            8 0
S01  C*                  MOVE      *ZEROS        SOKNR7            8 0
S01  C*                  MOVE      *ZEROS        SOKNR8            8 0
S01  C*                  MOVE      'DIV1188'     XMSGNR            7            MELDING-ID
S01  C*                  Z-ADD     3             XLEVEL            1 0          NIVÅ
S01  C*                  Z-ADD     0             XRETUR            1 0          RETURKODE
S01  C*                  Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
S01  C*                  CALL      'SUBR23R3'
S01  C*                  PARM                    XMSGNR
S01  C*                  PARM                    SOTXT1            8
S01  C*                  PARM                    XLEVEL
S01  C*                  PARM                    XRETUR
S01  C*                  PARM                    XMSGL
S01  C*                  MOVE      SOTXT1        SOTXT2            8
     C*
     C                   ENDSR
     C*
     C*
N06  C***********************************************
N06  C     NYDATOSR      BEGSR
N06  C***********************************************
N06  c                   setoff                                       95
N06  C     NYDATO        IFEQ      0
N06  C                   seton                                        95
N06  c                   else
N06  C                   MOVE      NYDAG         UDD               2 0
N06  C                   MOVE      NYMND         UMM               2 0
N06  C                   MOVE      NYAAR         UÅÅ               2 0
N06  C                   CALL      'TESTDATO'
N06  C                   PARM                    UDD
N06  C                   PARM                    UMM
N06  C                   PARM                    UÅÅ
N06  C                   PARM                    UFLAG2            1 0
N06  C     UFLAG2        COMP      1                                      95
N06  C                   end
N06  c     *in95         ifeq      '1'
N06  C                   MOVE      'SPD0001'     MSGNR
N06  C                   SETON                                        30
N06  C                   Z-ADD     21            LINNBR
N06  C                   Z-ADD     49            POSNBR
N06  c                   else
N06  c                   exsr      NYDATOSR2
N06  C                   END
N06  C                   ENDSR
N06  C*
N06  C***********************************************
N06  C     NYDATOSR2     BEGSR
N06  C***********************************************
N06   * tar backup av filen PRIK
N06  c                   call      'SYFA09BACL'
N06   * fikser nydatof
N06  c                   z-add     20            NYCCCF            2 0
N06  C                   MOVE      NYDAG         NYDAGF            2 0
N06  C                   MOVE      NYMND         NYMNDF            2 0
N06  C                   MOVE      NYAAR         NYAARF            2 0
N06  c                   setoff                                       33
N06  c     *loval        setll     prik
N06  c     *in33         doweq     '0'
N06  c                   read      prik                                   33
N06  c     *in33         ifeq      '0'
N06  c     pkdt          andne     nydatof
N06  c     pkknr         andne     '    ALLE'
N06  c                   z-add     nydatof       pkdt
N06  c                   update    prikr
N06  c                   end
N06  c                   enddo
N06  c                   move      *zeros        nydato
N06  c                   endsr
N06  c
N06  C***********************************************
N06  C     KODATOSR      BEGSR
N06  C***********************************************
N06  c                   setoff                                       9294
N06  c                   move      *zeros        kfdatof
N06  c                   move      *zeros        nydatof
N06  C     KFDATO        IFEQ      0
N06  C                   seton                                        92
N06  c                   else
N06  C                   MOVE      KFDAG         UDD               2 0
N06  C                   MOVE      KFMND         UMM               2 0
N06  C                   MOVE      KFAAR         UÅÅ               2 0
N06  C                   CALL      'TESTDATO'
N06  C                   PARM                    UDD
N06  C                   PARM                    UMM
N06  C                   PARM                    UÅÅ
N06  C                   PARM                    UFLAG2            1 0
N06  C     UFLAG2        COMP      1                                      92
N06  C                   end
N06  c     *in92         ifeq      '1'
N06  C                   MOVE      'SPD0001'     MSGNR
N06  C                   SETON                                        30
N06  C                   Z-ADD     22            LINNBR
N06  C                   Z-ADD     49            POSNBR
N06  c                   goto      utkop
N06  c                   end
N06  C     KODATO        IFEQ      0
N06  C                   seton                                        94
N06  c                   else
N06  C                   MOVE      KODAG         UDD               2 0
N06  C                   MOVE      KOMND         UMM               2 0
N06  C                   MOVE      KOAAR         UÅÅ               2 0
N06  C                   CALL      'TESTDATO'
N06  C                   PARM                    UDD
N06  C                   PARM                    UMM
N06  C                   PARM                    UÅÅ
N06  C                   PARM                    UFLAG2            1 0
N06  C     UFLAG2        COMP      1                                      94
N06  C                   end
N06  c     *in94         ifeq      '1'
N06  C                   MOVE      'SPD0001'     MSGNR
N06  C                   SETON                                        30
N06  C                   Z-ADD     22            LINNBR
N06  C                   Z-ADD     58            POSNBR
N06  c                   goto      utkop
N06  c                   end
N06  c                   z-add     20            kfcccf
N06  c                   move      kfdag         kfdagf
N06  c                   move      kfmnd         kfmndf
N06  c                   move      kfaar         kfaarf
N06  c                   exsr      KODATOSR2
N06  C     utkop         ENDSR
N06  C*
N06  C***********************************************
N06  C     KODATOSR2     BEGSR
N06  C***********************************************
N06   * tar backup av filen PRIK
N06  c                   call      'SYFA09BACL'
N06  C                   CALL      'SYGE122'
N06   * fikser nydatof
N06  c                   z-add     20            NYCCCF            2 0
N06  C                   MOVE      KODAG         NYDAGF            2 0
N06  C                   MOVE      KOMND         NYMNDF            2 0
N06  C                   MOVE      KOAAR         NYAARF            2 0
N06  c                   setoff                                       33
N06  c     *loval        setll     prik
N06  c     *in33         doweq     '0'
N06  c                   read      prik                                   33
N06  c     *in33         ifeq      '0'
N06  c     pkdt          andne     nydatof
N06  c     pkknr         andne     '    ALLE'
N06  c     kfdatof       andeq     pkdt
N06  c                   z-add     nydatof       pkdt
      * HENT KUNDENS NESTE LINJENUMMER
     C                   CALL      'SYGE121'
     C                   PARM                    PKKNR
N06  C                   PARM                    PKAVTN
N06  C                   PARM                    PKLNR
N06  c                   write     prikr
N06  c                   end
N06  c                   enddo
N06  c                   move      *zeros        kodato
N06  c                   move      *zeros        kfdato
N06  c                   endsr
N06  c
N06  C***********************************************
N06  C     SLDATOSR      BEGSR
N06  C***********************************************
N06   * slette alle avtaler på angitt utløpsdato
N06  c                   setoff                                       91
N06  C     SLDATO        IFEQ      0
N06  C                   seton                                        91
N06  c                   else
N06  C                   MOVE      SLDAG         UDD               2 0
N06  C                   MOVE      SLMND         UMM               2 0
N06  C                   MOVE      SLAAR         UÅÅ               2 0
N06  C                   CALL      'TESTDATO'
N06  C                   PARM                    UDD
N06  C                   PARM                    UMM
N06  C                   PARM                    UÅÅ
N06  C                   PARM                    UFLAG2            1 0
N06  C     UFLAG2        COMP      1                                      91
N06  C                   end
N06  c     *in91         ifeq      '1'
N06  C                   MOVE      'SPD0001'     MSGNR
N06  C                   SETON                                        30
N06  C                   Z-ADD     21            LINNBR
N06  C                   Z-ADD     49            POSNBR
N06  c                   else
N06  c                   exsr      SLDATOSR2
N06  C                   END
N06  C                   ENDSR
N06  C*
N06  C***********************************************
N06  C     SLDATOSR2     BEGSR
N06  C***********************************************
N06   * tar backup av filen PRIK
N06  c                   call      'SYFA09BACL'
N06   * fikser sldatof
N06  c                   z-add     20            SLCCCF            2 0
N06  C                   MOVE      SLDAG         SLDAGF            2 0
N06  C                   MOVE      SLMND         SLMNDF            2 0
N06  C                   MOVE      SLAAR         SLAARF            2 0
N06  c                   setoff                                       33
N06  c     *loval        setll     prik
N06  c     *in33         doweq     '0'
N06  c                   read      prik                                   33
N06  c     *in33         ifeq      '0'
N06  c     pkdt          andeq     SLdatof
N06  c     pkknr         andne     '    ALLE'
N06  c                   delete    prikr
N06  c                   end
N06  c                   enddo
N06  c                   move      *zeros        sldato
N06  c                   move      *zeros        sldatof
N06  c                   endsr
N06  c
