      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/SYFA55SW MODULE(*LIBL/SYFA55SW *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Prototype defintions and standard system API error structure
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      *--------------------------------------------------------------------
      * Variables common to CGI programs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D WSUSER          S             10
     D AVSLUTT         s              1
     D tur             S              8
     D turN            S              8  0
     D SMS             S             15
     D SPR             S              2
      * Number of records matching search criteria
      *
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================******
      * MAIN PROCESS LINE
      *=====================================================================******
      * Parse input
     C                   exsr      Parse
      *
     C                   EXSR      INIT
      **
      * Set output skeleton html member name
     C                   exsr      SetSkl
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      * submittet med utfyllt SMS  = send / avslutt
     c                   if        SMS<>' '
     C                   MOVE      'Y'           AVSLUTT
N03  c                   move      turN          TURa              8
N03  c                   call      'SYFA55S'
     C                   PARM                    TURA
     C                   PARM                    SMS
     C                   PARM      WSUSER        UUUSER           10
     C                   PARM                    SPR
     c                   endif
     C                   callp     updHTMLvar('USER':WSUSER)
     C                   callp     updHTMLvar('AVSLUTT':AVSLUTT)
     C                   callp     updhtmlvar('TUR':
     C                             %trim(%editc(TURN:'Z')))
     C                   callp     updHtmlVar('SMS':SMS)
     C                   callp     updHtmlVar('SPR':SPR)
     C                   callp     wrtsection('all')
      *------------------                                                   ******
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
     C*
     C                   close     BRIDF
     C                   eval      *inlr = *on
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      tur     = zhbgetvar('tur')
     C                   EVAL      turN    = c2n2(tur)
     C                   EVAL      SMS  = zhbgetvar('SMS')
     C                   EVAL      SPR  = zhbgetvar('SPR')
     C                   EVAL      SPR  = uppify(SPR)
      *
      *
     C                   endsr
      *=====================================================================******
      * Set html output skeleton member before its read into memory
      *=====================================================================******
     C     SetSkl        begsr
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC'
     C                   eval      Mbr = 'SYFA55SW'
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
      *
     C                   endsr
