********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF12 EVENTUELL PERSONLIG LASER
      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE UT      ***
      ***                   LOSELISTE                          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-97                             ***
      ************************************************************
      *
n01  FSYPARL2   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTH     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FTURER     IF   E           K DISK
n01  D* Datastruktur for Å HENTE USER
n01  D                SDS
n01  D  ZUSER                254    263
     D                UDS
     D  UFIRM                  1      2
     D  KOVFIR                 3      4
     D  KOVPRO                13     13
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UDT1                  30     35  0
     D  KOWHOD                47     47
     D  KOWBBS                48     48
     D* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     D* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
     D  XBLA1                 70    256
     D  XBLA2                257    510
     D  UPRT11               821    830
     D  UPT11                831    840
     D  UPRT12               841    850
     D  UPT12                851    860
     D  BRUDDA               961    961
     I*
     C*
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPLNR
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSAVD
     C     KODTHK        KLIST
     C                   KFLD                    WSHUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UJBKØ             1
     C                   PARM                    UIN03             1
     C                   PARM                    UIN04             1
     C                   PARM                    UIN01             1
     C                   PARM                    UAVDA             4
     C                   PARM                    UPROA             8
     C                   MOVE      '0'           UIN01
     C                   MOVE      'J'           UJBKØ
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'W'           WSWUNI            1
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'H'           WSHUNI            1
     C                   MOVE      'SF'          WSFUNI            2
     C                   MOVE      UAVDA         WSAVD             4 0
     C                   MOVE      UPROA         WSPRO             8 0
     C                   MOVE      USG           WSSG              3
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C                   MOVE      *BLANKS       XBLA1
     C                   MOVE      *BLANKS       XBLA2
     C*
     C     FIFIRM        CHAIN     FIRM                               99
     C                   READ      FIRM                                   99
     C                   MOVE      FIFIRM        UFIRM
n01   * SYKUNR/SYPAID settes ved bruk i prorammmet (blir ikke 'ødelagt'  av logikken under)
N01  C     SYPARKEY2     KLIST
N01  C                   KFLD                    ZUSER
N01  C                   KFLD                    SYPAID
N01  C                   move      'PPLAS'       SYPAID
N01  C     SYPARKEY2     CHAIN     SYPARL2                            33
N01  c  N33              MOVEL     SYVRDA        wsprt            10
N01  C                   move      'PPLAB'       SYPAID
N01  C     SYPARKEY2     CHAIN     SYPARL2                            33
N01  c  N33              MOVEL     SYVRDA        wsprt2           10
     C*
     C*
     C     TUKEY         KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPRO
     C*
     C     TUKEY         CHAIN     TURER                              97
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C  N99KODTHK        CHAIN     KODTH                              99
     C  N99              Z-ADD     20            WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT11
     C  N99              MOVE      KOPTY         UPT11
     C  N99              Z-ADD     21            WSPLNR
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT12
     C  N99              MOVE      KOPTY         UPT12
     C     WSSG          IFNE      'ALL'
     C     KODSFK        CHAIN     KODTSF                             98
     C                   END
n01  c     wsprt         ifne      *blanks
n01  c                   move      wsprt         uprt11
n01  c                   move      wsprt         uprt12
n01  c                   end
     C*
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSSG          USG
     C                   MOVE      WSPRO         UPRO
     C                   MOVE      *ZEROS        UDT1
     C                   MOVE      'J'           UJBKØ
     C     KOHLS1        IFEQ      'L'                                                      TÅENDE')
     C                   MOVE      '0'           UIN03
     C                   ELSE
     C                   MOVE      '1'           UIN03
     C                   END
     C     KOH421        IFEQ      'J'
     C                   MOVE      '1'           UIN04
     C                   ELSE
     C                   MOVE      '0'           UIN04
     C                   END
     C     UPRT11        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT11
     C                   END
     C     UPT11         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT11
     C                   END
     C     UPRT12        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT12
     C                   END
     C     UPT12         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT12
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
