********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10005 * 01 YBC PTF10 TOLLSTEDSKODE ER ENDRE FRA 2.0 TIL 4.0
11XXX * 02 CB  PTF11 Ryddet i kildekoden, ikke merket
12XXX * 03 YBC PTF12 Cursor posisjon ved endring
********************************************************************

      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TOLLSTEDER (SAD)          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-87 95-97    ***
      ***********************************************************

     Fsysthlp   IF   E             DISK
     FKODTTST   UF A E           K DISK
     FKODTTSLF  IF   E           K DISK
     F                                     RENAME(KOTSTR:KOTST2R)
     FKODTTSX   UF A E           K DISK
     FSYFT04FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KTSNAV                 1     15
     D  XDLT                   1      7

     C                   EXSR      INIT

     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2NAV         YNAV             15
     C                   MOVE      *ZEROS        YPNR              4 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W2NAV         SETLL     KODTTSLF
     C     START1        TAG
     C                   READ      KODTTSLF                               94
     C  N94              MOVE      KTSPNR        YPNR
     C  N94              MOVE      KTSNAV        YNAV

     C     START2        TAG

     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C     KTSPNR        CHAIN     KODTTSX                            33
     C   33              MOVE      *ZEROS        KTXPNR
     C                   WRITE     SUBFIL
     C                   READ      KODTTSLF                               94
     C  N94              MOVE      KTSPNR        YPNR
     C  N94              MOVE      KTSNAV        YNAV
     C  N94              END
     C                   END

     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START3
     c                   end
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START3
     c                   end
     C                   END

     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END

     C                   SETOFF                                       9899

      *** AVSLUTT
     C   03              GOTO      SLUTT

      *** FRISK OPP
     C   05              GOTO      START

      *** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     10            POSNBR
     C                   MOVE      *ZEROS        WTSPNR
     C                   GOTO      START5
     C                   END
      *** SØK FRA
     C   08              GOTO      START6

      *** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94YNAV          SETLL     KODTTSLF
     C     START4        TAG
     C  N94              READ      KODTTSLF                               94
     C  N94YPNR          IFNE      KTSPNR
     C                   GOTO      START4
     C                   END
     C                   GOTO      START2
     C                   END

     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3

      *** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                       30
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START5
     c                   end
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C  N12              EXSR      OPDTST
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3

      *** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START6
     c                   end
     C   12              GOTO      START3
     C                   GOTO      START

     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************

      * TEST OM BRUKER HAR TASTET TOLLSTEDSKODE
     C     WTSPNR        COMP      0                                      90
     C   90              MOVE      'SPT0019'     MSGNR
     C  N40
     CANN90              DO
     C     KODTSK        CHAIN(N)  KODTTST                            33
     C  N33              SETON                                        90
     C  N33              MOVE      'SPT0020'     MSGNR
     C                   END
     C   90              Z-ADD     10            POSNBR
     C   90              SETON                                        30

      * TEST OM TOLLSTEDNAVN = BLANK
     C     WTSNAV        COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'SPN0012'     MSGNR
     C   89
     CANN30              Z-ADD     24            POSNBR
     C   89              SETON                                        30

     C                   ENDSR
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGTST
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTTST
     C   12              GOTO      SLHENT
     C                   END
     C                   END

     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     3             POSNBR

     C                   ENDSR
     C***********************************************
     C     DLTTST        BEGSR
     C***********************************************
     C                   SETON                                        99
     C     HELP01        TAG
     C                   MOVE      KTSPNR        WTSPNR
     C                   EXFMT     VAREL3
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      HELP01
     c                   end
     C  N12              DO
     C     KODTSK        CHAIN     KODTTST                            33
     C  N33              DELETE    KOTSTR
     C     KTSPNR        CHAIN     KODTTSX                            33
     C  N33              DELETE    KOTSXR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL

     C                   ENDSR
     C***********************************************
     C     CHGTST        BEGSR
     C***********************************************
     C                   EXSR      MOVTSW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     c   01              do
     c                   movel     'syft04'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      STCHG
     c                   end
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C  N12              EXSR      OPDTST
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END

     C                   ENDSR
     C***********************************************
     C     OPDTST        BEGSR
     C***********************************************
     C     KODTSK        CHAIN     KODTTST                            33
     C     WTSPNR        CHAIN     KODTTSX                            34
     C                   EXSR      MOVWTS
     C  N33              UPDATE    KOTSTR
     C   33              WRITE     KOTSTR
     C  N34              UPDATE    KOTSXR
     C   34              WRITE     KOTSXR

     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   EXSR      MOVB2

     C                   ENDSR
     C***********************************************
     C     MOVTSW        BEGSR
     C***********************************************
     C                   MOVE      KTSNAV        WTSNAV
     C                   MOVE      KTSPNR        WTSPNR
     C                   MOVE      KTXPNR        WTXPNR
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
N03  C                   Z-ADD     24            POSNBR

     C                   ENDSR
     C***********************************************
     C     MOVWTS        BEGSR
     C***********************************************
     C                   MOVE      YTSUNI        KTSUNI
     C                   MOVE      WTSNAV        KTSNAV
     C                   MOVE      WTSPNR        KTSPNR
     C                   MOVE      WTSPNR        KTXKOD
     C                   MOVE      WTXPNR        KTXPNR

     C                   ENDSR
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       KTSNAV
     C                   MOVEL     '*DELETE'     XDLT
     C                   MOVE      *ZEROS        KTSPNR
     C                   MOVE      *ZEROS        KTXPNR
     C                   ENDSR
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WTSNAV
     C                   MOVE      *ZEROS        WTSPNR
     C                   MOVE      *ZEROS        WTXPNR
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTSK        KLIST
     C                   KFLD                    YTSUNI
     C                   KFLD                    WTSPNR

     C                   MOVE      'TST'         YTSUNI            3

     C                   ENDSR
     C***********************************************
     C     HELPSR        BEGSR
     C***********************************************
     c
     c                   move      *blanks       pcocmd           70
     c     1             chain     systhlp                            33
     c     *in(33)       ifeq      '0'

      * intern
     c                   movel     'http://'     pcocmd
     C     pcocmd        CAT       systip:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       systba:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       hlpna:0       pcocmd
     C     pcocmd        CAT       '.htm':0      pcocmd

     c                   call      'SYGE34CL'
     c                   parm                    pcocmd
     c                   end
     C                   ENDSR
