********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12147 * 01 SH  PTF12 syge111 ENDRET TIL FLERE FELT I FIL
********************************************************************
     Finncsv    ip   e             DISK
     F                                     RENAME(inncsv:inncsvny)
     Futdb2     o    e             DISK
     D                 DS
s01  D* dtafld                 1  18000
s01  D*                                    DIM(60)
N01  D  dtafld                 1  54000
N01  D                                     DIM(180)
     D                 DS
s01  D* RDATA                  1   1024
n01  D  RDATA                  1   4096
     D  RTYP                   1      6
     D  RTYP4                  1      4
     D                 DS
     D  ZDEC                   1      7  6
     D  ZDEC6                  2      7
     D  ZHEL                  11     22  0
N05  D                 DS
N05  D  UNDER                  1     40
N05  D  UNDERT                 1      5
N05  D  UNDER1                 1      4
N05  D  UNDER2                 6     40
     D                 DS
     D  A                      1     79
     D                                     DIM(79)
     D                 DS
     D  B                      1     18
     D                                     DIM(18)
     IINNCSVNY
     I              INNCSV                      DATAINN
      *
     c                   exsr      DETSR
      *
      **************************************************************
     C     DETSR         BEGSR
      **************************************************************
      *
      * Kaller eksternt program og legger felt i array
      *
s01  C*                  MOVEL     DATAINN       UDATA          1024
s01  C*                  MOVEL     *BLANKS       UARRA         18000
n01  C                   MOVEL     DATAINN       UDATA          4096
n01  C                   MOVEL     *BLANKS       UARRA         54000
     C                   MOVE      ';'           SKILLET           1
     C                   CALL      'SYGE111'
     C                   PARM                    SKILLET
     C                   PARM                    UDATA
     C                   PARM                    UARRA
     c                   movea     uarra         dtafld
      *
      * tømmer flt i utdatafil
      *
     C                   CLEAR                   UTDB2R
      *
      *
      *
      * felt 1 numerisk
      *
     C                   MOVEA     dtafld(1)     A
     C                   EXSR      GETNUM
     C                   Z-ADD     ZNUM          FELT1
      *
      * felt 2 alfa
      *
      *
      *
     C                   EVAL      FELT2=dtafld(3)
      *skriv til utfil
     C                   WRITE     utdb2r
     C                   ENDSR
      *
     c*****************************************
     c     getnum        begsr
     c*****************************************
     C                   MOVE      *ZEROS        ZHEL
     C                   MOVE      *ZEROS        ZDEC
     C                   MOVE      *ZEROS        B
     C                   Z-ADD     1             AX                2 0
     C                   Z-ADD     1             BX                2 0
      * Get Integer
     C     A(AX)         DOWGE     '0'
     C     ZHEL          MULT      10            ZHEL
     C                   MOVE      A(AX)         ZHEL
     C                   ADD       1             AX
     C                   ENDDO
      * Decimal point ?
     C     A(AX)         IFEQ      '.'
     C     A(AX)         OREQ      ','
     C                   ADD       1             AX
     C     A(AX)         DOWGE     '0'
     C                   MOVE      A(AX)         B(BX)
     C                   ADD       1             AX
     C                   ADD       1             BX
     C                   ENDDO
     C                   MOVEA     B             ZDEC6
     C                   ENDIF
      * Concatenate
     C                   Z-ADD     ZHEL          ZNUM             18 6
     C                   ADD       ZDEC          ZNUM
     C                   ENDSR
     c
