********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 CB  PTF12 Status i EDIS
********************************************************************
     FEDIC      UF   E             DISK
     FEDIS      O  A E             DISK
     FFIRM      IF   E             DISK
     D                 DS
     D  WMBR                   1     14
     D  WMBRA                  1      1
     D  WMBRB                  2     10  0
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    *IN51         WIN51
     C     *LIKE         DEFINE    SSR           WSR
     C     *LIKE         DEFINE    SST           WST
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM      FROM          FROM             35
     C                   PARM      TO            TO               35
     C                   PARM      DOKSTI        DOKSTI           70
     C                   PARM      UUNIK         UUNIK            14
      *_____________
      * Init av felt
      *"""""""""""""
     C                   MOVE      '0'           *IN51
     C                   MOVE      'S'           WSR
     C                   MOVE      *BLANKS       WST
     C                   MOVE      'G'           WMBRA                          GENERELL
      *                                                    FLATFIL
     C* Hente dagens dato og klokkeslett.
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   READ      FIRM                                   33
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *________________________________________
      * Noe å sende.....
      *""""""""""""""""""""""""""""""""""""""""
      *________________________________________
      * Hente og oppdater neste sendningsnummer
      *""""""""""""""""""""""""""""""""""""""""
     C     1             CHAIN     EDIC                               20
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
      *_________________
      * Logge sendningen
      *"""""""""""""""""
     C                   MOVEL     FROM          S0004
     C                   MOVEL     TO            S0010
     C                   Z-ADD     CSN           WMBRB
     C                   MOVE      UUNIK         S0020
     C                   MOVE      ' '           S0035
     C                   Z-ADD     0             S0036
     C                   Z-ADD     CSN           SSN
     C                   MOVE      'S'           SSR
     C                   MOVE      'A'           SST
N01  C                   MOVE      'C'           SST
     C                   MOVEL     WDT           SDT
     C                   MOVEL     WTM           STM
     C                   MOVEL     FILIBF        SLIB
     C                   MOVE      '  '          SLIB
     C                   MOVEL     '*IFS   '     SFILE
     C                   MOVEL     WMBR          SMBR
     C                   EVAL      SIFS=DOKSTI
     C                   WRITE     EDISR
     C     SRB9          ENDSR
