     d  DateN          s              8  0
     D  DateISO        s               D
      *
     d  TimeN          s              8  0
     D  TimeISO        s               T
      *
     d  TS_N20         s             20  0
     d  TS_A26         s             26
     D  TS_ISO         s               Z
     D  NYTS_ISO       s               Z
      *
     d  DIFFtidYe      s             15  0
     d  DIFFtidMo      s             15  0
     d  DIFFtidDa      s             15  0
     d  DIFFtidHo      s             15  0
     d  DIFFtidMi      s             15  0
     d  DIFFtidSe      s             15  0
     d  DIFFtidMs      s             15  0
      *
     d  TS_N26         s             26  0
      *
      * Konv numerisk dato til ISO-dato  (= typisk '1960-09-29' )
     c                   eval      DateN = 20161019
     c                   eval      DateISO =%date(DateN)
      *
      * Konv numerisk tid  til ISO-tid   (= typisk '12.34.56'  )
     c                   eval      TimeN = 141516
     c                   eval      TimeISO =%time(TimeN)
      *
      * Konv numerisk Timestamp til ISO-timestamp (= typisk '1960-09-29-12.34.56.000000' )
     c                   eval      TS_N20= 20161019141516000000
     c                   eval      TS_ISO =%timestamp(TS_N20)
      *
      * aritmetiske operasjoner +  -   %years, %months, %days, %hours, %minutes, %seconds, %mseconds
      *                    OBS! merk at mseconds IKKE er milli- men mikro-sek. dvs milliondels !!
     c                   eval      NYTS_ISO =TS_ISO +%days(14)
      *
      * finne TID mellom 2 TIME-variable - største variabel føst = positivt svar - svar er heltall
      *       parameter 3 = *years, *months, *days, %hours, *minutes, *seconds, *mseconds
      *                    OBS! merk at mseconds IKKE er milli- men mikro-sek. dvs milliondels !!
     c                   eval      DIFFtidYe=%diff(NYTS_ISO : TS_ISO : *Years)
     c                   eval      DIFFtidMo=%diff(NYTS_ISO : TS_ISO : *Months)
     c                   eval      DIFFtidDa=%diff(NYTS_ISO : TS_ISO : *Days)
     c                   eval      DIFFtidHo=%diff(NYTS_ISO : TS_ISO : *Hours)
     c                   eval      DIFFtidMi=%diff(NYTS_ISO : TS_ISO : *Minutes)
     c                   eval      DIFFtidSe=%diff(NYTS_ISO : TS_ISO : *Seconds)
     c                   eval      DIFFtidMs=%diff(NYTS_ISO : TS_ISO :*Mseconds)
     c*
     c* Konvertere fra en date/Time-variable til numerisk  %dec.. takler date/time direkte..
     c                   eval      TS_N20= %dec(NYTS_ISO)
      * OBS!!  - pass på feltlengde - MÅ VÆRE EKSAKT LIK netto numerisk lengde på akt date/time-var.
      *        - For liten=error / for stor verdien havner høytrestilt i variabel ...
      *        - den over er fin siden netto av full TS er 20 lang,
      *        - den under får 6 foranstilte 0-er siden %dec(.. er en ren numerisk konvertering..
     c**OBS FEIL!!       eval      TS_N26 = %dec(NYTS_ISO)
      *
     c                   seton                                        lr
     c                   return
