     FDOKUFVF   if   e           k disk
N24  FADRUNNRF  IF   E           K DISK
      *
     DFFANTEA          S             11
     DSUMPOEN          S              7  0
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFBNR             3 0
     C                   PARM                    UADR           5000
     C                   PARM                    UFINS             1
      *
N24  C     HeadKey       KLIST
N24  C                   KFLD                    UAVD
N24  C                   KFLD                    UOPD
N24  C     FbreKey       KLIST
N24  C                   KFLD                    UAVD
N24  C                   KFLD                    UOPD
N24  C                   KFLD                    UFBNR
      *
      *
N24  C     UnNrKeyF      KLIST
N24  C                   KFLD                    FFUNNR
N24  C                   KFLD                    FFEMBG
N25  C                   KFLD                    FFINDX
N24   *
     C                   MOVE      *blanks       UADR
     C                   MOVE      '0'           UFINS
     C                   if        UFBNR = *zeros
N24  C     HeadKey       SETLL     DOKUFVF
N24  C     HeadKey       READE     DOKUFVF
     C                   else
N24  C     FbreKey       SETLL     DOKUFVF
N24  C     FbreKey       READE     DOKUFVF
     C                   endif
N24  C                   dow       not %eof (DOKUFVF)
      *
N24  C     UnNrKeyF      chain     ADRUNNRF
     c                   if        %found
     c*
N33  c                   eval      SUMPOEN = SUMPOEN + FFPOEN
N33  c                   eval      FFANTEA =
N33  c                                   %trimr(%editw(FFANTE:'     0 ,   '))
     c                   eval      UADR = %trim(UADR)
     c                             +' UNnr:'   +%trim(FFUNNR)
     c                             +' FareKl:' +%trim(FFSEDD)
     c                             +' Emb.Gr:' +%trim(FFEMBG)
     c                             +' Tun.Res:'+%trim(FFTRES)
     c                             +' Mengde:' +%trim(FFANTEA)
     c                             +' Enh:'    +%trim(FFENH)
     c                             +' Beskr:'  +%trim(ADTEXT)+' |'
     c*
     c                   endif
      *
     C                   if        UFBNR = *zeros
N24  C     HeadKey       READE     DOKUFVF
     C                   else
N24  C     FbreKey       READE     DOKUFVF
     C                   endif
N24  C                   enddo
      *
     c                   if        UADR <> *blanks
     C                   MOVE      '1'           UFINS
     c                   eval      UADR = '**FARLIG GODS**Sum poeng:'
     c                                  + %trim(%editc(SUMPOEN:'3'))
     c                                  + '** '+UADR
     c                   endif
      *
     C                   SETON                                        LR
     C                   RETURN
     C*
