     fprik2     if   e           k disk
     C     *ENTRY        PLIST
     C                   PARM                    UKNR              8
     C                   PARM                    UAVTN             1
     C                   PARM                    ulnr              4 0
     C                   MOVE      UKNR          PKKNR
     C                   MOVE      UAVTN         PKAVTN
      *
     C     PRIK2K        KLIST
     C                   KFLD                    pkknr
     C                   KFLD                    PKAVTN
     C                   KFLD                    PKLNR
      *
     C                   Z-ADD     9999          pklnr
     C     PRIK2K        SETLL     PRIK2
     C                   SETOFF                                       33
     C                   READP     PRIK2                                  33
     C  N33              MOVE      PKLNR         ULNR
     C                   ADD       1             ULNR
     C                   SETON                                        LR
     C                   RETURN
     C*
