      *******************************************************************************
      *  Tildel TS - returner full 26 Iso TS + "strippet" 20 lang TS (uten skilletegn)
      *******************************************************************************
12XXX * 01 JOV PTF12 Krafitig forenkllet (for gammel se SYGE94.G )
12XXX *              Kommandoene kan jo med fordel utføres i det enkeltte prog siden de er enkle
      *************************************************************
     D timedata1       s               z                                        z=Timestamfield
     d  TS20n          s             20  0
      *
     C     *ENTRY        PLIST
     C                   PARM                    TS26             26
     C                   PARM                    TS20             20
      *
     C                   time                    Timedata1
     C                   movel     timedata1     TS26             26
     c                   eval      TS20n = %dec(Timedata1)
     C                   move      TS20n         TS20
      *
     c                   seton                                        lr
     c                   return
