********************************************************************
     c                   eval      tekst='Laste dokument'
     c                   eval      espea='ESPEA'
     c                   eval      websok='&dok=ZA&bane=/home/'
     c                                          +'svein'
     C                   call      'WEBLINKR'
     C                   parm                    tekst            40
     C                   parm                    espea             5
     C                   parm                    websok           50
     C                   seton                                        lr
     C                   return
