********************************************************************
      * frigjør oppdrag med status=X
     FHEAD45    UF   E           K DISK
     FFAK11     IF   E           K DISK
     C     HHHKEY        klist
     c                   kfld                    stat
     C                   MOVE      'X'           STAT              1
     C     HHHKEY        SETLL     HEAD45
     C     *IN34         DOWEQ     '0'
     C     HHHKEY        READE     HEAD45                                 34
     c     *in34         ifeq      '0'
     c                   exsr      testx
     c                   update    headfr
     c                   endif
     C                   ENDdo
     c                   seton                                        lr
     c                   return
     c********************************************************************
     c     testx         begsr
     c********************************************************************
     c                   setoff                                       33
     c                   move      ' '           hest
     c     faktke        klist
     c                   kfld                    KODE
     c                   kfld                    HEAVD
     c                   kfld                    HEOPD
      * legger O i HEST hvis overført økonomi
     C                   MOVE      'O'           KODE              1
     c     faktke        setll     FAK11
     c     *in33         doweq     '0'
     c     faktke        reade     fak11                                  33
     c     *in33         ifeq      '0'
     C     FAKDA         IFNE      'K'
     C                   move      'O'           HEST
     c                   goto      utsr
     C                   END
     C                   ENDIF
     C                   ENDDO
      * legger F i HEST hvis fakturert idag
     C                   MOVE      'F'           KODE
     c                   setoff                                       33
     c     faktke        setll     FAK11
     c     *in33         doweq     '0'
     c     faktke        reade     fak11                                  33
     c     *in33         ifeq      '0'
     C     FAKDA         IFNE      'K'
     C                   move      'F'           HEST
     c                   goto      utsr
     C                   END
     C                   ENDIF
     C                   ENDdo
     c     utsr          endsr
