      * INPUT SKILLETEGN
      * INPUT SDV-RECORD 1024 LANG
      * OUTPUT ARRAY MED 60 FELT A 300 TEGN
      *
      *
      *________________________
      * DS for decimal handling
      *""""""""""""""""""""""""
     D                 DS
     D  ZDEC                   1      7  6
     D  ZDEC6                  2      7
     D  ZHEL                  11     22  0
     D                 DS
     D  data                   1   1024
     D  da                     1   1024
     D                                     DIM(1024)
     D                 DS
     D  felta                  1   1024
     D  fa                     1   1024
     D                                     DIM(1024)
     D                 DS
     D  dta                    1  18000
     D                                     DIM(60)
     D  dtut                   1  18000
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyz')
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZ')
      *________________________
      *gjør om på tegn som er uleselige
      *________________________
      *
      *  æ=C0 ø=6A å=D0 Æ=7B Ø=7C Å=5B
      *                                      æ æ ø ø å Æ Æ Ø Ø Å Y e e
N02  D frah            c                   x'31243B24061A0A14391B3A222A'
N02   * byttes med
N02  D tilh            c                   x'C0C06A6AD07B7B7C7C5BE88585'
      * INITIERER VARIABLE
      *
     c     *entry        plist
     c                   parm                    skillet           1
     c                   parm                    datinn         1024
     c                   parm                    datut         18000
      * konverterer særtegn
N02  c     frah:tilh     xlate     datinn        datinn                         ikke skrivbar->blank
     c                   movel     datinn        data
     c     skillet       ifeq      ' '
     c                   move      ';'           skillet
     c                   end
     c                   z-add     1             fra               4 0
     c                   z-add     1             til               4 0
     c                   z-add     0             DN                4 0
      *
      * leser til neste skilletegn
      *
     c     til           dowlt     1024
     C     da(til)       ifne      skillet
     c                   add       1             til
     c                   else
      *
      * fra og til er funnet
      *
     c                   exsr      dekod
     c                   add       1             til
     c                   z-add     til           fra
     c                   endif
     c                   enddo
      *
      * siste post
      *
     c                   move      1024          til
     c                   exsr      dekod
      *
     c                   movel     dtut          datut
     c                   seton                                        lr
     c                   return
      *
     c***************************************************************
     c     dekod         begsr
     c***************************************************************
      *
      * dekoder innlest post
      *
     c     til           sub       fra           antp              4 0
     c     antp          ifgt      0
     c                   exsr      dokoda
     c                   add       1             dn
     c                   movel     felta         dta(dn)
     C                   ELSE
     c                   add       1             dn
     c                   end
     c                   endsr
     c***************************************************************
     c     DOKODA        begsr
     c***************************************************************
     c*    dekoder  TIL FELTA
     c*
     c                   move      *blanks       felta
     c                   z-add     fra           nr                4 0
     c                   z-add     1             n2                4 0
     c                   do        antp
     c                   move      da(nr)        fa(n2)
     c                   add       1             n2
     c                   add       1             nr
     c                   enddo
     c                   endsr
      *
