     FSYGE125D  CF   E             WORKSTN
     c     start0        tag
     c                   exfmt     BILDE01
     c   03              goto      slutt
     c     mappe         cabeq     *blanks       start0
     c     start         cabeq     *blanks       start0
     c     *in10         ifeq      '1'
     c                   call      'SYGE125CLV'
     c                   goto      start0
     c                   end
     c                   call      'SYGE125CL'
     c                   parm                    mappe            50
     c                   parm                    start            10
     c                   parm                    antalla          10
     c                   move      antalla       antall
     c                   goto      start0
     c     slutt         tag
     c                   seton                                        lr
     c                   return
