     Ffirmgoog  IF   E           K DISK
     c                   z-add     1             pos               3 0
     c                   z-add     0             str               3 0
     c                   move      *blanks       DOKFRA          120
     c                   move      *blanks       BANEFRA         100
     c     *entry        plist
     c                   parm                    FRABAN           90
     c                   parm                    tilban           50
     c                   parm                    uok               1
      * finn dokumentnavn i fraban
     c                   dow       Pos<> 0
     c                   eval      Pos= %SCAN ('/' : FRABAN: Str+1)
     c                   if        Pos<> 0
     c                   eval      Str= Pos
     c                   endif
     c                   enddo
     c                   eval      DOKFRA    = %subst(FRABAN:Str+1)
     c                   eval      BANEFRA   = %subst(FRABAN:1:Str)
      * finn dokumentnavn i tilban
     c                   move      *blanks       DOKTIL          120
     c                   move      *blanks       BANETIL         100
     c                   z-add     1             pos               3 0
     c                   z-add     0             str               3 0
     c                   dow       Pos<> 0
     c                   eval      Pos= %SCAN ('/' : TILBAN: Str+1)
     c                   if        Pos<> 0
     c                   eval      Str= Pos
     c                   endif
     c                   enddo
     c                   eval      DOKTIL    = %subst(TILBAN:Str+1)
     c                   eval      BANETIL   = %subst(TILBAN:1:Str)
     c                   exsr      flytt
     C                   SETON                                        LR
     C                   RETURN
      *******************************************************************
     c     flytt         begsr
      *******************************************************************
n14   * vis google cloud benyttes - send det i skyen med en gang
n14  C                   read      FIRMGOOG
n14  C                   if        not %eof and GOBUID <> *blanks
n14  c                   eval      Companyid = GOBUID
n14  c                   eval      Uokmov    = 'N'
n13  c                   eval      Udelete   = 'J'
n14  c                   call      'ARC99WSU1'
n14  c                   parm                    Companyid        10
n14  c                   parm                    baneTIL         100
n14  c                   parm                    dokTIL          120
n13  c                   parm                    udelete           1
n13  c                   parm                    NEWDOC           60
n14  c                   parm                    uokmov            1
n14  c                   endif
     C                   ENDSR
