     Farkivl16  UP   E           K DISK
     Ffirmgoog  IF   E           K DISK
     Ffirmarc   IF   E           K DISK
     c  N99              exsr      init
     c  N99              seton                                        99
     c                   exsr      flytt
      *******************************************************************
     c     flytt         begsr
      *******************************************************************
n14   * vis google cloud benyttes - send det i skyen med en gang
n14  c                   eval      Companyid = GOBUID
n14  c                   eval      Uokmov    = 'N'
n13  c                   eval      Udelete   = 'J'
n14  c                   eval      banetil   = %trim(ARCANE)+'/'
     c                   eval      doktil    = ARLINK
n06  C     '.'           SCAN      doktil                                 44
n06  c  N44doktil        CAT       '.pdf':0      doktil
     c                   eval      newdoc=*blanks
n14  c                   call      'ARC99WSU1'
n14  c                   parm                    Companyid        10
n14  c                   parm                    banetil         100
n14  c                   parm                    dokTIL          120
n13  c                   parm                    udelete           1
n13  c                   parm                    NEWDOC           60
n14  c                   parm                    uokmov            1
     c     uokmov        ifeq      'J'
     c                   eval      ARBHIS='FLYTTET GOO9GLE'
     C                   UPDATE    ARKIVR
     C                   END
     C                   ENDSR
      *******************************************************************
     c     init          begsr
      *******************************************************************
     c                   read      firmarc                                33
n14   * vis google cloud benyttes - send det i skyen med en gang
n14  C                   read      FIRMGOOG                               33
     c     *in33         ifeq      '1'
     c                   seton                                        lr
     c                   return
     c                   end
     c                   endsr
