     F*  OBS må compileres med *CURRENT release
     F*  viser feil på linje ved editering  spiller ingen rolle
     FBRIVEN    UP   E             DISK
     F                                     RENAME(BRIVEN:BRIVENR)
     IBRIVENR
     I              BRIVEN                      RDATA
      */////////////
      * MAIN LOGIC /
      */////////////
      *
     C                   eval      RDATA = %ScanRpl(x'6615':'Å':RDATA)
     C                   eval      RDATA = %ScanRpl(x'6640':'Å':RDATA)
     C                   eval      RDATA = %ScanRpl(x'6636':'Ø':RDATA)
     C                   eval      RDATA = %ScanRpl(x'6638':'Ø':RDATA)
     C                   eval      RDATA = %ScanRpl(x'66D0':'Æ':RDATA)
     C                   eval      RDATA = %ScanRpl(x'6606':'Æ':RDATA)
     C                   update    brivenr

