     H debug(*yes)
N01  FTESTUSR   IF   E           K DISK
     C*
     C     *ENTRY        PLIST
N01  C                   PARM                    USERP            10
N01  C                   PARM                    name             50
N01  C                   PARM                    FINS              1
     C*
N01  C     KEY0          KLIST
     C                   KFLD                    USERP
     c                   eval      FINS='N'
     C                   READ      TESTUSR                                33
     c  n33UPUPRF        ifeq      USERP
     c                   eval      name=UPTEXT
     c                   eval      FINS='J'
     C                   end
     C                   SETON                                        LR
     C                   RETURN
