     C                   call      'SYGE129'
     C                   PARM      1             UAVD              4 0
     C                   PARM      155945        UOPD              7 0
     C                   PARM                    UFBNR             3 0
     C                   PARM                    UADR           5000
     C                   PARM      '0'           UFINS             1
      *
     C                   SETON                                        LR
     C                   RETURN
     C*
