      * INITIERER VARIABLE finne extension inklusive .
      *
     c     *entry        plist
     c                   parm                    fn              512
     c                   parm                    extens           10
      *
     C
     c                   z-add     1             x                 3 0
     c                   move      *blanks       extens
      *
     c     x             doueq     0
     C     '.'           SCAN      fn:x          X                 3 0
     c     x             ifne      0
     c                   z-add     x             siste             3 0
     c                   add       1             x
     C                   endif
     C                   enddo
      *
     c     siste         ifne      0
      * FN(SISTE) er '.'.
      * Hvis extension stater med nummerisk, er det timestemple. --> sett pdf som extension.
     C                   IF        %SUBST(FN:SISTE+1:1) >= '0' AND
     C                             %SUBST(FN:SISTE+1:1) <= '9'
     C                   EVAL      EXTENS = '.pdf'
     C                   ELSE
     C                   EVAL      EXTENS = %SUBST(fn:siste:10)
     C                   END
     C                   end
     c                   seton                                        lr
     c                   return
