      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE betalingsbetingelser      ***
      ***********************************************************
      *
     FFIRM      IF   E           K DISK
     FKONTL01   UF A E           K DISK
     FSYib02fm  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KONTNA                 1     30
     D  XDLT                   1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     keysok        SETLL     KONTL01
     C     START1        TAG
     C     keysok        READE(N)  KONTL01                                94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     c                   move      konto         siste
     C     KEYSOK        READE(N)  KONTL01                                94
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C     START3        TAG
     C                   SETOFF                                       9998
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   GOTO      START5
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     c     keyrol        setgt     kontl01
     C     keysok        READE(N)  KONTL01                                94
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C*
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                           30
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
      *
      *
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     c     wskey         chain(n)  KONTL01                            33
     C  N33              MOVE      'SHU1901'     MSGNR
     C  N33              SETON                                        3090
     C                   END
     C*
     C   30              GOTO      SLTB1
     C*
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     c     wskey         chain     KONTL01                            33
     C                   EXSR      MOVWCE
     C  N33              UPDATE    KONTR
     C   33              WRITE     KONTR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB1         ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGCE
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTCE
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGCE         BEGSR
     C***********************************************
     C                   EXSR      MOVCEW
     C                   SETON                                        99
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     12            POSNBR
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                         30
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTCE         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     VAREL3
     C  N12              DO
     C     keydel        CHAIN     KONTL01                            33
     C  N33              DELETE    KONTR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWCE        BEGSR
     C***********************************************
     C                   MOVE      WSNTO         KONTO
     C                   move      WSNTNA        KONTNA
     C                   move      WSAO          MVAO
N01  C                   move      WSAOK         MVAOK
N01  C                   move      WSNTY         KONTY
N01  C                   move      WSEDK         STEDK
N01  C                   move      WSRERK        BARERK
N01  C                   move      WSOSJK        PROSJK
N01  C                   move      WSTKOD        AKTKOD
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVCEW        BEGSR
     C***********************************************
     C                   MOVE      KONTO         WSNTO
     C                   MOVE      KONTNA        WSNTNA
     C                   MOVE      MVAO          WSAO
     C                   MOVE      MVAOK         WSAOK
     C                   MOVE      KONTY         WSNTY
     C                   MOVE      STEDK         WSEDK
     C                   MOVE      BARERK        WSRERK
     C                   MOVE      PROSJK        WSOSJK
     C                   MOVE      AKTKOD        WSTKOD
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     12            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *zeros        WSNTO
     C                   MOVE      *BLANKS       WSNTNA
     C                   MOVE      *BLANKS       WSAO
     C                   MOVE      *BLANKS       WSAOK
     C                   MOVE      *BLANKS       WSNTY
     C                   MOVE      *BLANKS       WSEDK
     C                   MOVE      *BLANKS       WSRERK
     C                   MOVE      *BLANKS       WSOSJK
     C                   MOVE      *BLANKS       WSTKOD
     C                   MOVEL     '*DELETE'     XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *zeros        WSNTO
     C                   MOVE      *BLANKS       WSNTNA
     C                   MOVE      *BLANKS       WSAO
     C                   MOVE      *BLANKS       WSAOK
     C                   MOVE      *BLANKS       WSNTY
     C                   MOVE      *BLANKS       WSEDK
     C                   MOVE      *BLANKS       WSRERK
     C                   MOVE      *BLANKS       WSOSJK
     C                   MOVE      *BLANKS       WSTKOD
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KEYSOK        KLIST
     C                   KFLD                    FIRMA
     C     WSKEY         KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    WSnto
     C     KEYDEL        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    konto
     C     KEYROL        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    SISTE             5 0
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     c                   move      fifirm        firma
     C*
     C                   ENDSR
     C*
