     FSADH      IF   E           K DISK
     FSAEH      IF   E           K DISK
      *_____
      * Init
      *"""""
     C                   EXSR      SRINIT
      *
     C     SADHK         CHAIN     SADH                               33
     C                   IF        *IN33 = *OFF
     C                   EVAL      UNT    = SINTK
     C                   EVAL      UVKT   = SIVKB
     C                   EVAL      UTLL   = SITLL
     C                   EVAL      UTLE   = SITLE
     C                   EVAL      UDTG   = SIDTG
     C                   EVAL      UFLAG  = 1
     C                   ELSE
     C     SADHK         CHAIN     SAEH                               33
     C                   IF        *IN33 = *OFF
     C                   EVAL      UNT    = SENTK
     C                   EVAL      UVKT   = SEVKB
     C                   EVAL      UTLL   = SETLL
     C                   EVAL      UTLE   = SETLE
     C                   EVAL      UDTG   = SEDTG
     C                   EVAL      UFLAG  = 1
     C                   END
     C                   END
      *
     C                   EVAL      *IN33 = *ON
     C                   RETURN
      *
      *___________________________________________________
      * Initiering                                  SRINIT
      *"""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRINIT        BEGSR
      * Input paramerer
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UNT               7 0
     C                   PARM                    UVKT              9 0
     C                   PARM                    UTLL             10
     C                   PARM                    UTLE              6
     C                   PARM                    UDTG             10
     C                   PARM                    UFLAG             1 0
      *
     C     SADHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    SIOPD
      *
     C                   Z-SUB     UOPD          SIOPD
     C                   EVAL      UFLAG  = 0
      *
     C                   ENDSR
      *
