     FSYMENUF   IF   E           K DISK
     FSYME01fm  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     STARTK        SETLL     SYMENUF
     C     START1        TAG
     C                   READ      SYMENUF                                94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      SYMENUF                                94
     C  N94              MOVE      MENU          YYMENU           10
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** SØK FRA LANDKODE
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94RULLK         SETLL     SYMENUF
     C  N94              READ      SYMENUF                                94
     C                   GOTO      START2
     C                   END
     c     dirmnu        IFNE      *BLANKS
     C     DIRKEY        CHAIN     SYMENUF                            70
     C     *In70         IFEQ      '0'
     C                   EVAL      MENU=DIRMNU
     C                   seton                                        lr
     C                   return
     C                   END
     C                   END
     C                   EXSR      HENT
     C   98              GOTO      START3
     c                   GOTO      START
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     c                   SETOFF                                       98
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     c*vise på skjerm
     C  N98WSNR          IFEQ      '1'
     C                   seton                                        lr
     C                   return
     C                   END
     C                   ENDDO
     C*
     C     SLHENT        ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *ENTRY        PLIST
     C                   PARM                    MENU
     C     STARTK        KLIST
     C                   KFLD                    USER
     C                   KFLD                    MENU
     C     DIRKEY        KLIST
     C                   KFLD                    USER
     C                   KFLD                    DIRMNU
     C     rullk         KLIST
     C                   KFLD                    USER
     C                   KFLD                    YYMENU
     C                   ENDSR
     C*
