********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE signaturer til attestasjon **
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-67 71-90    ***
      ***                    95-97 99                         ***
      ***********************************************************
      *
     FNAVATT    UF A E           K DISK
     FKODTSF    IF   E           K DISK
     FKODTA     IF   E           K DISK
     FSYNA12FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  KLKNVN                 1     30
     D  KLKNV4                 1      4
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODLK1        SETLL     NAVATT
     C     START1        TAG
     C                   READ      NAVATT                                 94
     C   94              MOVE      *BLANKS       KLKNVN
     C   94              MOVE      *BLANKS       WSNR
     C  N94              UPDATE    NAVATTR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     c     KODTAK0       CHAIN     KODTA                              33
     c     KODTSFK0      CHAIN     KODTSF                             33
     C                   WRITE     SUBFIL
     C                   READ      NAVATT                                 94
     C  N94              UPDATE    NAVATTR
     C  N94              MOVE      ATTAVD        YTTAVD            4 0
     C  N94              MOVE      ATTSG         YTTSG             3
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY LANDKODE
     c     *in06         ifeq      '1'
     c                   move      *blanks       koanvn
     c                   move      *blanks       ksinav
     C                   GOTO      START5
     c                   END
     C*** SØK FRA LANDKODE
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODLK3        SETLL     NAVATT
     C  N94              READ      NAVATT                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT LANDKODE
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODLK2        CHAIN     NAVATT                             33
     C  N33              DELETE    NAVATTR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DLT'        KLKNVN
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE LANDKODE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(68)
     C                   SETOFF                                       30
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
      * N40 = NY
      *
     C  N40              DO
     C     WTTAVD        COMP      *zeros                                 70
     c  n70KODTAK        CHAIN     KODTA                              70
     C   70              MOVE      'SPA0001'     MSGNR
     C   70              SETON                                        30
     C   70              GOTO      SLTB
      * FINNES FRA FØR
     C     KODLKK        CHAIN(N)  NAVATT                             33
     C  N33              SETON                                        7030
     C   70              MOVE      'SHU1742'     MSGNR
     C   70              GOTO      SLTB
      * SIGNATUR GYLDIG
     C     KODTSFK       CHAIN(N)  KODTSF                             71
     C   71              SETON                                        30
     C   71              MOVE      'SPS0001'     MSGNR
     C   71              GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODLKK        CHAIN     NAVATT                             33
     C                   EXSR      MOVWLK
     C  N33              UPDATE    NAVATTR
     C   33              WRITE     NAVATTR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     KLKNV4        COMP      '*DLT'                                 98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVLKW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     KLKNV4        COMP      '*DLT'                                 98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *zeros        ATTAVD
     C                   MOVE      *BLANKS       ATTSG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *zeros        WTTAVD
     C                   MOVE      *BLANKS       WTTSG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVLKW        BEGSR
     C***********************************************
     C                   MOVE      ATTAVD        WTTAVD
     C                   MOVE      ATTSG         WTTSG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWLK        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      WTTAVD        ATTAVD
     C                   MOVE      WTTSG         ATTSG
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODLKK        KLIST
     C                   KFLD                    WTTAVD
     C                   KFLD                    WTTSG
     C     KODTAK0       KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    ATTAVD
     C     KODTAK        KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    WTTAVD
     C                   MOVE      'A'           KOAUNI
     C     KODTSFK0      KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    ATTSG
     C     KODTSFK       KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    WTTSG
     C                   MOVE      'SF'          KOSFUN
     C     KODLK1        KLIST
     C                   KFLD                    WTTAVD
     C                   KFLD                    WTTSG
     C     KODLK2        KLIST
     C                   KFLD                    ATTAVD
     C                   KFLD                    ATTSG
     C     KODLK3        KLIST
     C                   KFLD                    YTTAVD
     C                   KFLD                    YTTSG
     C                   ENDSR
     C*
