******* firmaparametre navitro
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF12 Grenseverdi autogodkjenning
10XXX * 02 SH  PTF12 dokumenttype handelsfaktura
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE arkivlager                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FFIRM      IF   E           K DISK
     FFIRMNA    UF A E           K DISK
     FSYNA10FM  CF   E             WORKSTN
     C*
     C                   READ      FIRM                                   30
     c                   move      fifirm        nafirm
     c     nafirm        chain(n)  firmna                             33
     C                   MOVE      NASERI        WRSERI
     C                   MOVE      NADTDO        WRDTDO
N02  C                   MOVE      NADTDH        WRDTDH
     C                   MOVE      OKONTO        WRONTO
     C                   MOVE      OGEBYR        WREBYO
     C                   MOVE      OKSTED        WRSTED
     C                   MOVE      UGEBYR        WREBYR
N01  C                   MOVE      NAGRPL        WRGRPL
N01  C                   MOVE      NAGRMI        WRGRMI
     C                   EXFMT     BILDE01
     c   12              goto      slutt
     c     nafirm        chain     firmna                             33
     C                   MOVE      WRSERI        NASERI
     C                   MOVE      WRDTDO        NADTDO
N02  C                   MOVE      WRDTDH        NADTDH
     C                   MOVE      WRONTO        OKONTO
     C                   MOVE      WREBYO        OGEBYR
     C                   MOVE      WRSTED        OKSTED
     C                   MOVE      WREBYR        UGEBYR
N01  C                   MOVE      WRGRPL        NAGRPL
N01  C                   MOVE      WRGRMI        NAGRMI
     C   33              WRITE     FIRMNAR
     C  N33              UPDATE    FIRMNAR
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
