********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10015 * 01 YBC PTF10 NY FIL ZTRACKF
10XXX * 02 YBC PTF10 SLETT POSTER OGSÅ I ZADVJ, SLETT VIA UNIK-KODE
10286 * 03 YBC PTF10 VEKT ER ENDRET FRA 9.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11006 * 04 YBC PTF11 NYE FILER ZOKUDGS OG ZOKUFE
11XXX * 05 YBC PTF11 NYE FILER: ZOKUFVF OG ZOKUFVF1
11XXX * 06 YBC PTF11 NY FIL ZTRACKT
12053 * 07 YBC PTF12 FLERE FELTER ER UTVIDET.
********************************************************************
      ***********************************************************
      *** PROGRAMMET SLETTER HELE TUR                         ***
      ***********************************************************
      *
     FZADF      UF   E           K DISK
     FZADH      UF   E           K DISK
s08  F*ADV      UF   E           K DISK
N02  FZADVJ     UF   E           K DISK
     FZAEF      UF   E           K DISK
     F                                     RENAME(SADFR:SAEFR)
     FZAEH      UF   E           K DISK
s08  F*AEV      UF   E           K DISK
N03  F                                     PREFIX(ZE_)
     FZAKT      UF   E           K DISK
     FZEADF     UF   E           K DISK
     FZILLOFL4  UF   E           K DISK
     FZLV1L1    UF   E           K DISK
     FZLV2L1    UF   E           K DISK
     FZNADSF    UF   E           K DISK
     FZOKUF     UF   E           K DISK
     FZOKUFM    UF   E           K DISK
     FZOKUFV    UF   E           K DISK
N05  FZOKUFVF   UF   E           K DISK
N04  FZOKUDGS   UF   E           K DISK
N04  FZOKUFE    UF   E           K DISK
     FZOK29     UF   E           K DISK
     FZOK36     UF   E           K DISK
     FZREETXT   UF   E           K DISK
     FZRISOK    UF   E           K DISK
N01  FZTRACKF   UF   E           K DISK
N06  FZTRACKT   UF   E           K DISK
N02  FZADFL01   UF   E           K DISK    RENAME(SADFR:SADFR1)
N02  FZADHL01   UF   E           K DISK    RENAME(SADHR:SADHR1)
N02  FZADVL01   UF   E           K DISK    RENAME(SADVR:SADVR1)
N02  FZADVJL01  UF   E           K DISK    RENAME(SADVJR:SADVJR1)
N02  FZAEFL01   UF   E           K DISK    RENAME(SADFR:SAEFR1)
N02  FZAEHL01   UF   E           K DISK    RENAME(SAEHR:SAEHR1)
N02  FZAEVL01   UF   E           K DISK    RENAME(SAEVR:SAEVR1)
N03  F                                     PREFIX(ZE_)
N02  FZAKTL01   UF   E           K DISK    RENAME(FAKTR:FAKTR1)
N02  FZEADL02   UF   E           K DISK    RENAME(HEADFR:HEADFR1)
N02  FZILLOF    UF   E           K DISK    RENAME(BILLOFR:BILLOFR1)
N02  FZLV1      UF   E           K DISK    RENAME(BLV1R:BLV1R1)
N02  FZLV2      UF   E           K DISK    RENAME(BLV2R:BLV2R1)
N02  FZNADSL1   UF   E           K DISK    RENAME(NADSR:NADSR1)
N02  FZOKUFL1   UF   E           K DISK    RENAME(DOKUFR:DOKUFR1)
N02  FZOKUFM1   UF   E           K DISK    RENAME(DOKUFMR:DOKUFMR1)
N02  FZOKUFV1   UF   E           K DISK    RENAME(DOKUFVR:DOKUFVR1)
N05  FZOKUFVF1  UF   E           K DISK    RENAME(DOKUFVFR:DOKUFVFR1)
N04  FZOKUDGS1  UF   E           K DISK    RENAME(DOKUDGSR:DOKUDGSR1)
N04  FZOKUFEL1  UF   E           K DISK    RENAME(DOKUFER:DOKUFER1)
N02  FZOK29L1   UF   E           K DISK    RENAME(DOK29R:DOK29R1)
N02  FZOK36L1   UF   E           K DISK    RENAME(DOK36R:DOK36R1)
N02  FZREETXT1  UF   E           K DISK    RENAME(FREETXTR:FRTXTR1)
N02  FZRISOL01  UF   E           K DISK    RENAME(FRISOKR:FRISOKR1)
N02  FZTRACKL1  UF   E           K DISK    RENAME(TRACKFR:TRACKFR1)
N06  FZTRACKT1  UF   E           K DISK    RENAME(TRACKTR:TRACKTR1)
     FBRPARF    IF   E           K DISK
N07  ISADVR1
N07  I              SVBELT                      I_SVBELT
      *
     C     *ENTRY        PLIST
     C                   PARM                    UREFF            17
N02  C                   PARM                    UUNIK             9 0
      *
N02  C                   IF        UUNIK = 0
     C     UREFF         CHAIN     ZADF                               5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    SADFR
N08  C                   EXSR      DELZADV
     C     UREFF         READE     ZADF                                 5353
     C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZADH                               5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    SADHR
     C     UREFF         READE     ZADH                                 5353
     C  N53              ENDDO
      *
s08  C*    UREFF         CHAIN     ZADV                               5353
s08  C*    *IN53         DOWEQ     '0'
s08  C*                  DELETE    SADVR
s08  C*    UREFF         READE     ZADV                                 5353
s08  C* N53              ENDDO
N02  C     UREFF         CHAIN     ZADVJ                              5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SADVJR
N02  C     UREFF         READE     ZADVJ                                5353
N02  C  N53              ENDDO
      * SAD EKSP...
     C     UREFF         CHAIN     ZAEF                               5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    SAEFR
N08  C                   EXSR      DELZAEV
     C     UREFF         READE     ZAEF                                 5353
     C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZAEH                               5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    SAEHR
     C     UREFF         READE     ZAEH                                 5353
     C  N53              ENDDO
      *
s08  C*    UREFF         CHAIN     ZAEV                               5353
s08  C*    *IN53         DOWEQ     '0'
s08  C*                  DELETE    SAEVR
s08  C*    UREFF         READE     ZAEV                                 5353
s08  C* N53              ENDDO
      * FRAKTBREV..
     C     UREFF         CHAIN     ZOKUF                              5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    DOKUFR
     C     UREFF         READE     ZOKUF                                5353
     C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZOKUFM                             5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    DOKUFMR
     C     UREFF         READE     ZOKUFM                               5353
     C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZOKUFV                             5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    DOKUFVR
     C     UREFF         READE     ZOKUFV                               5353
     C  N53              ENDDO
N05   *
N05  C     UREFF         CHAIN     ZOKUFVF                            5353
N05  C     *IN53         DOWEQ     '0'
N05  C                   DELETE    DOKUFVFR
N05  C     UREFF         READE     ZOKUFVF                              5353
N05  C  N53              ENDDO
N04   *
N04  C     UREFF         CHAIN     ZOKUFE                             5353
N04  C     *IN53         DOWEQ     '0'
N04  C                   DELETE    DOKUFER
N04  C     UREFF         READE     ZOKUFE                               5353
N04  C  N53              ENDDO
N04   *
N04  C     UREFF         CHAIN     ZOKUDGS                            5353
N04  C     *IN53         DOWEQ     '0'
N04  C                   DELETE    DOKUDGSR
N04  C     UREFF         READE     ZOKUDGS                              5353
N04  C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZOK29                              5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    DOK29R
     C     UREFF         READE     ZOK29                                5353
     C  N53              ENDDO
      *
     C     UREFF         CHAIN     ZOK36                              5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    DOK36R
     C     UREFF         READE     ZOK36                                5353
     C  N53              ENDDO
      * NOTIS-BLOKK
     C     UREFF         CHAIN     ZREETXT                            5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    FREETXTR
     C     UREFF         READE     ZREETXT                              5353
     C  N53              ENDDO
      * FRI SØKEVEI
     C     UREFF         CHAIN(N)  ZEADF                              53
     C     UREFF         CHAIN     ZRISOK                             5353
     C     *IN53         DOWEQ     '0'
     C                   IF        FSKODE = '#VD'
     C     BRPARFK       KLIST
     C                   KFLD                    HEFILE
     C                   KFLD                    PAKUNR
     C                   KFLD                    PAID
     C                   MOVE      'OLBAN'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   EVAL      ULINK = PAVRDA
     C                   CAT       FSSOK:0       ULINK            70
     C                   CAT       FSDOKK:0      ULINK
     C                   CALL      'SYOP23C2'
     C                   PARM                    ULINK
     C                   END
     C                   DELETE    FRISOKR
     C     UREFF         READE     ZRISOK                               5353
     C  N53              ENDDO
      * FAKTURA
     C     UREFF         CHAIN     ZAKT                               5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    FAKTR
     C     UREFF         READE     ZAKT                                 5353
     C  N53              ENDDO
N01   * TRACK & TRACE
N01  C     UREFF         CHAIN     ZTRACKF                            5353
N01  C     *IN53         DOWEQ     '0'
N01  C                   DELETE    TRACKFR
N01  C     UREFF         READE     ZTRACKF                              5353
N01  C  N53              ENDDO
N06   * DATOER
N06  C     UREFF         CHAIN     ZTRACKT                            5353
N06  C     *IN53         DOWEQ     '0'
N06  C                   DELETE    TRACKTR
N06  C     UREFF         READE     ZTRACKT                              5353
N06  C  N53              ENDDO
      * ADRESSEINFO
     C     UREFF         CHAIN     ZNADSF                             5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    NADSR
     C     UREFF         READE     ZNADSF                               5353
     C  N53              ENDDO
      * OPPDRAG
     C     UREFF         CHAIN     ZEADF                              5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    HEADFR
     C     UREFF         READE     ZEADF                                5353
     C  N53              ENDDO
      * BL
     C     UREFF         CHAIN     ZILLOFL4                           5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    BILLOFR
     C     UREFF         READE     ZILLOFL4                             5353
     C  N53              ENDDO
      * BL LINJE TYPE-1
     C     UREFF         CHAIN     ZLV1L1                             5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    BLV1R
     C     UREFF         READE     ZLV1L1                               5353
     C  N53              ENDDO
      * BL LINJE TYPE-2
     C     UREFF         CHAIN     ZLV2L1                             5353
     C     *IN53         DOWEQ     '0'
     C                   DELETE    BLV2R
     C     UREFF         READE     ZLV2L1                               5353
     C  N53              ENDDO
N02   *
N02  C                   ELSE
N02  C     UUNIK         CHAIN     ZADFL01                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SADFR1
N02  C     UUNIK         READE     ZADFL01                              5353
N02  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZADHL01                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SADHR1
N02  C     UUNIK         READE     ZADHL01                              5353
N02  C  N53              ENDDO
N02   *
s08  C*    UUNIK         CHAIN     ZADVL01                            5353
s08  C*    *IN53         DOWEQ     '0'
s08  C*                  DELETE    SADVR1
s08  C*    UUNIK         READE     ZADVL01                              5353
s08  C* N53              ENDDO
N02  C     UUNIK         CHAIN     ZADVJL01                           5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SADVJR1
N02  C     UUNIK         READE     ZADVJL01                             5353
N02  C  N53              ENDDO
N02   * SAD EKSP...
N02  C     UUNIK         CHAIN     ZAEFL01                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SAEFR1
N02  C     UUNIK         READE     ZAEFL01                              5353
N02  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZAEHL01                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    SAEHR1
N02  C     UUNIK         READE     ZAEHL01                              5353
N02  C  N53              ENDDO
N02   *
s08  C*    UUNIK         CHAIN     ZAEVL01                            5353
s08  C*    *IN53         DOWEQ     '0'
s08  C*                  DELETE    SAEVR1
s08  C*    UUNIK         READE     ZAEVL01                              5353
s08  C* N53              ENDDO
N02   * FRAKTBREV..
N02  C     UUNIK         CHAIN     ZOKUFL1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    DOKUFR1
N02  C     UUNIK         READE     ZOKUFL1                              5353
N02  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZOKUFM1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    DOKUFMR1
N02  C     UUNIK         READE     ZOKUFM1                              5353
N02  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZOKUFV1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    DOKUFVR1
N02  C     UUNIK         READE     ZOKUFV1                              5353
N02  C  N53              ENDDO
N05   *
N05  C     UUNIK         CHAIN     ZOKUFVF1                           5353
N05  C     *IN53         DOWEQ     '0'
N05  C                   DELETE    DOKUFVFR1
N05  C     UUNIK         READE     ZOKUFVF1                             5353
N05  C  N53              ENDDO
N04   *
N04  C     UUNIK         CHAIN     ZOKUDGS1                           5353
N04  C     *IN53         DOWEQ     '0'
N04  C                   DELETE    DOKUDGSR1
N04  C     UUNIK         READE     ZOKUDGS1                             5353
N04  C  N53              ENDDO
N04   *
N04  C     UUNIK         CHAIN     ZOKUFEL1                           5353
N04  C     *IN53         DOWEQ     '0'
N04  C                   DELETE    DOKUFER1
N04  C     UUNIK         READE     ZOKUFEL1                             5353
N04  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZOK29L1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    DOK29R1
N02  C     UUNIK         READE     ZOK29L1                              5353
N02  C  N53              ENDDO
N02   *
N02  C     UUNIK         CHAIN     ZOK36L1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    DOK36R1
N02  C     UUNIK         READE     ZOK36L1                              5353
N02  C  N53              ENDDO
N02   * NOTIS-BLOKK
N02  C     UUNIK         CHAIN     ZREETXT1                           5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    FRTXTR1
N02  C     UUNIK         READE     ZREETXT1                             5353
N02  C  N53              ENDDO
N02   * FRI SØKEVEI
N02  C     UUNIK         CHAIN(N)  ZEADL02                            53
N02  C     UUNIK         CHAIN     ZRISOL01                           5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   IF        FSKODE = '#VD'
N02  C                   MOVE      'OLBAN'       PAID
N02  C     BRPARFK       CHAIN     BRPARF                             33
N02  C                   EVAL      ULINK = PAVRDA
N02  C                   CAT       FSSOK:0       ULINK            70
N02  C                   CAT       FSDOKK:0      ULINK
N02  C                   CALL      'SYOP23C2'
N02  C                   PARM                    ULINK
N02  C                   END
N02  C                   DELETE    FRISOKR1
N02  C     UUNIK         READE     ZRISOL01                             5353
N02  C  N53              ENDDO
N02   * FAKTURA
N02  C     UUNIK         CHAIN     ZAKTL01                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    FAKTR1
N02  C     UUNIK         READE     ZAKTL01                              5353
N02  C  N53              ENDDO
N02   * TRACK & TRACE
N02  C     UUNIK         CHAIN     ZTRACKL1                           5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    TRACKFR1
N02  C     UUNIK         READE     ZTRACKL1                             5353
N02  C  N53              ENDDO
N06   * DATOER
N06  C     UUNIK         CHAIN     ZTRACKT1                           5353
N06  C     *IN53         DOWEQ     '0'
N06  C                   DELETE    TRACKTR1
N06  C     UUNIK         READE     ZTRACKT1                             5353
N06  C  N53              ENDDO
N02   * ADRESSEINFO
N02  C     UUNIK         CHAIN     ZNADSL1                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    NADSR1
N02  C     UUNIK         READE     ZNADSL1                              5353
N02  C  N53              ENDDO
N02   * OPPDRAG
N02  C     UUNIK         CHAIN     ZEADL02                            5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    HEADFR1
N02  C     UUNIK         READE     ZEADL02                              5353
N02  C  N53              ENDDO
N02   * BL
N02  C     UUNIK         CHAIN     ZILLOF                             5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    BILLOFR1
N02  C     UUNIK         READE     ZILLOF                               5353
N02  C  N53              ENDDO
N02   * BL LINJE TYPE-1
N02  C     UUNIK         CHAIN     ZLV1                               5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    BLV1R1
N02  C     UUNIK         READE     ZLV1                                 5353
N02  C  N53              ENDDO
N02   * BL LINJE TYPE-2
N02  C     UUNIK         CHAIN     ZLV2                               5353
N02  C     *IN53         DOWEQ     '0'
N02  C                   DELETE    BLV2R1
N02  C     UUNIK         READE     ZLV2                                 5353
N02  C  N53              ENDDO
N02   *
N02  C                   END
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
N08   **************************************************************************
N08  C     DELZADV       BEGSR
N08   **************************************************************************
N08  C     SFUNIK        CHAIN     ZADVL01                            3333
N08  C     *IN33         DOWEQ     '0'
N08  C                   DELETE    SADVR1
N08  C     SFUNIK        READE     ZADVL01                              3333
N08  C  N33              ENDDO
N08  C                   ENDSR
N08   **************************************************************************
N08  C     DELZAEV       BEGSR
N08   **************************************************************************
N08  C     SFUNIK        CHAIN     ZAEVL01                            3333
N08  C     *IN33         DOWEQ     '0'
N08  C                   DELETE    SAEVR1
N08  C     SFUNIK        READE     ZAEVL01                              3333
N08  C  N33              ENDDO
N08  C                   ENDSR
