     H DFTACTGRP(*NO)
     FAMDE      UF   E           K DISK
     FAMGE      UF   E           K DISK
     FAMHE      UF   E           K DISK
     FAMSAML    UF   E           K DISK
      *
     FARKEPO    UF   E           K DISK
     FARKLOGH4  UF   E           K DISK
     F*ARKLOGD   UF   E           K DISK    prefix(d_)
     FARKLOGD   UF   E           K DISK
     FAVSLUTF   UF   E           K DISK
     FAVSLUTGF  UF   E           K DISK

     d xavd            S              4  0
     d xopd            S              7  0
     d xpro            S              8  0
      *  Prototype for syreo12r3
     d syreo12r3       pr
     d uavd_                               like(uavd)
     d uopd_                               like(uopd)
     d upro_                               like(upro)
      *  *ENTRY Interface for Main Procedure
     d syreo12r3       pi
     d uavd                           4
     d uopd                           7
     d upro                           8
      *
      /free

         exsr init;

         exec sql
         delete from amde
         where adavd = :xavd and adopd = :xopd or adtunr = :xpro and adtunr <> 0
         with NC;

         exec sql
         delete from amsaml
         where saavd = :xavd and saopd = :xopd or sapro = :xpro and sapro <> 0
         with NC;

         exec sql
         delete from amge
         where agavd = :xavd and agopd = :xopd or agtunr = :xpro and agtunr <> 0
         with NC;

         exec sql
         delete from amhe
         where ahtunr = :xpro and ahtunr <> 0
         with NC;

         exec sql
         delete from arkepo
         where epavd = :xavd and epopd = :xopd
         with NC;

         setll (xavd: xopd) arklogh4;
         reade (xavd: xopd) arklogh4;
         dow not %eof;
           exec sql
           delete from arklogd
           where epunik = :epunik
           with NC;

           delete arkloghr;
           reade (xavd: xopd) arklogh4;
         enddo;

         exec sql
         delete from dokecet
         where deavd = :xavd and deopd = :xopd
         with NC;

         exec sql
         delete from avslutf
         where avavd = :xavd and avopd = :xopd
         with NC;

         exec sql
         delete from avslutgf
         where avavd = :xavd and avopd = :xopd
         with NC;

         *inlr = *on;
         return;

      //***********************************************
       begsr init;
      //***********************************************
       xavd = %float(uavd);
       xopd = %float(uopd);
       xpro = %float(upro);

       endsr;

      /end-free
