     H DFTACTGRP(*NO)
     FEPOH07    UF   E           K DISK
     FEPOHDP    UF   E           K DISK    prefix(dp_)
     FEPOK      UF   E           K DISK
     FEPOKLOG   UF   E           K DISK
     FEPOL      UF   E           K DISK
     FEPOLT     UF   E           K DISK
     FEPOPOS    UF   E           K DISK
     FEPOTT     UF   E           K DISK

     d xdtf            S              8  0
      *  Prototype for syreo13r
     d syreo13r        pr
     d udtf_                               like(udtf)
      *  *ENTRY Interface for Main Procedure
     d syreo13r        pi
     d udtf                           8
      *
      /free

         exsr init;

         setll xdtf epoh07;
         readp epoh07;
         dow not %eof;
           if ehdato <> 0;
             exec sql
             delete from epohdp
             where dp_ehkund = :ehkund and dp_ehbes = :ehbes
             with NC;

             exec sql
             delete from epok
             where ekkund = :ehkund and ekbes = :ehbes
             with NC;

             exec sql
             delete from epoklog
             where egkund = :ehkund and egbes = :ehbes
             with NC;

             exec sql
             delete from epol
             where elkund = :ehkund and elbes = :ehbes
             with NC;

             exec sql
             delete from epolt
             where etkund = :ehkund and etbes = :ehbes
             with NC;

             exec sql
             delete from epopos
             where epkund = :ehkund and epbes = :ehbes
             with NC;

             exec sql
             delete from epott
             where etkund = :ehkund and etbes = :ehbes
             with NC;

             delete epohr;
           else;
             update epohr;
           endif;

           readp epoh07;
         enddo;

         *inlr = *on;
         return;

      //***********************************************
       begsr init;
      //***********************************************
       xdtf = %float(udtf);

       endsr;

      /end-free
