     H DFTACTGRP(*NO)
     FDOKEB     UF   E           K DISK
     FDOKEC     UF   E           K DISK
     FDOKECE    UF   E           K DISK
     FDOKECEL   UF   E           K DISK
     FDOKECET   UF   E           K DISK
     FDOKEF     UF   E           K DISK
     FDOKEFIM   UF   E           K DISK
     FDOKEQ     UF   E           K DISK
     FDOKOCI    UF   E           K DISK
     FDOKOCIM1  UF   E           K DISK    RENAME(DOKOCIR:DOKOCMR)
     FDOKOTH    UF   E           K DISK
     FDOKOTHM1  UF   E           K DISK    RENAME(DOKOTR:DOKOTMR)
     FDOKUDGS   UF   E           K DISK
     FDOKUF     UF   E           K DISK
     FDOKUFE    UF   E           K DISK
     FDOKUFM    UF   E           K DISK
     FDOKUFN    UF   E           K DISK
     FDOKUFT2   UF   E           K DISK
     FDOKUFV    UF   E           K DISK
     FDOKUFVF   UF   E           K DISK
     FDOKUFVG   UF   E           K DISK
     FDOKUI     UF   E           K DISK
     FDOKULG    UF   E           K DISK
     FDOKUT     UF   E           K DISK
     FDOK29     UF   E           K DISK
     FDOK36     UF   E           K DISK
     FDOLAF     UF   E           K DISK
     FMCAWF     UF   E           K DISK
     FSAMCMRD   UF   E           K DISK
     FSAMCMRH   UF   E           K DISK

     d xavd            S              4  0
     d xopd            S              7  0
     d xpro            S              8  0
      *  Prototype for syreo12r2
     d syreo12r2       pr
     d uavd_                               like(uavd)
     d uopd_                               like(uopd)
     d upro_                               like(upro)
      *  *ENTRY Interface for Main Procedure
     d syreo12r2       pi
     d uavd                           4
     d uopd                           7
     d upro                           8
      *
      /free

         exsr init;

         exec sql
         delete from dokeb
         where dbavd = :xavd and dbopd = :xopd
         with NC;

         exec sql
         delete from dokec
         where dcavd = :xavd and dcopd = :xopd
         with NC;

         exec sql
         delete from dokece
         where deavd = :xavd and deopd = :xopd
         with NC;

         exec sql
         delete from dokecel
         where deavd = :xavd and deopd = :xopd
         with NC;

         exec sql
         delete from dokecet
         where deavd = :xavd and deopd = :xopd
         with NC;

         exec sql
         delete from dokef
         where dfavd = :xavd and dfopd = :xopd
         with NC;

         exec sql
         delete from dokefim
         where imavd = :xavd and imopd = :xopd
         with NC;

         exec sql
         delete from dokeq
         where dqavd = :xavd and dqopd = :xopd
         with NC;

         exec sql
         delete from dokoci
         where dokociavd = :xavd and dokociopd = :xopd
         with NC;

         exec sql
         delete from dokocim1
         where dokociavd = :xavd and dokociopd = :xopd
         with NC;

         exec sql
         delete from dokoth
         where doavd = :xavd and doopd = :xopd
         with NC;

         exec sql
         delete from dokothm1
         where doavd = :xavd and doopd = :xopd
         with NC;

         exec sql
         delete from dokudgs
         where dgsavd = :xavd and dgsopd = :xopd
         with NC;

         exec sql
         delete from dokuf
         where dfavd = :xavd and dfopd = :xopd
         with NC;

         exec sql
         delete from dokufe
         where fe_dfavd = :xavd and fe_dfopd = :xopd
         with NC;

         exec sql
         delete from dokufm
         where fmavd = :xavd and fmopd = :xopd
         with NC;

         setll (xavd: xopd) dokuft2;
         reade (xavd: xopd) dokuft2;
         dow not %eof;
           if ftclid <> *blanks;
             exec sql
             delete from dokufn
             where fnclid = :ftclid
             with NC;
           endif;
           delete dokuftr;
           reade (xavd: xopd) dokuft2;
         enddo;

         exec sql
         delete from dokufv
         where fvavd = :xavd and fvopd = :xopd
         with NC;

         exec sql
         delete from dokufvf
         where ffavd = :xavd and ffopd = :xopd
         with NC;

         exec sql
         delete from dokufvg
         where fgavd = :xavd and fgopd = :xopd
         with NC;

         exec sql
         delete from dokui
         where diavd = :xavd and diopd = :xopd
         with NC;

         exec sql
         delete from dokulg
         where lgavd = :xavd and lgopd = :xopd
         with NC;

         exec sql
         delete from dokut
         where dtavd = :xavd and dtopd = :xopd
         with NC;

         exec sql
         delete from dok29
         where d29avd = :xavd and d29opd = :xopd
         with NC;

         exec sql
         delete from dok36
         where d36avd = :xavd and d36opd = :xopd
         with NC;

         exec sql
         delete from dolaf
         where laavd = :xavd and laopd = :xopd
         with NC;

         exec sql
         delete from mcawf
         where mcavd = :xavd and mcopd = :xopd
         with NC;

         exec sql
         delete from samcmrd
         where samavd = :xavd and samopd = :xopd
         with NC;

         if xpro > 0;
           exec sql
           delete from samcmrh
           where sampro = :xpro
           with NC;
         endif;

         *inlr = *on;
         return;

      //***********************************************
       begsr init;
      //***********************************************
       xavd = %float(uavd);
       xopd = %float(uopd);
       xpro = %float(upro);

       endsr;

      /end-free
