***** *test av skuff   *********************************************
     FSYSKUFFM  CF   E             WORKSTN
     FLISTE     O    F   80        PRINTER USROPN
     D UCMD            DS          1024
     D XCMD11          C                   CONST('OVRPRTF -
     D                                     FILE(LISTE) -
     D                                     OUTQ(')
     D XCMD21          C                   CONST('PAGESIZE(70 80) -
     D                                     CPI(10) -
     D                                     OVRFLW(70)')
     C                   Z-ADD     1024          UCMDL            15 5
      *
      * skjermbilde
      *
     C     START         TAG
     C                   EXFMT     BILDE01
      *
      * avslutt
      *
     C   03              GOTO      SLUTT
      *
      * skriv side
      *
     C                   MOVE      *BLANKS       UCMD
     C     XCMD11        CAT       WSPRT:0       UCMD
     C                   CAT       ')':0         UCMD
     C     UCMD          CAT       XCMD21:1      UCMD
N05  C     WSSKUF        ifne      *blanks
N05  c                   move      *blanks       FDRAW            20
N05  c                   eval      FDRAW='DRAWER('                              PDF
N05  C                   CAT       WSSKUF:0      FDRAW
N05  C                   CAT       ')':0         FDRAW
N05  C                   CAT       FDRAW:1       UCMD
N05  C                   END
N05  C     WSSKUFU       ifne      *blanks
N05  c                   move      *blanks       FDOUT            20
N05  c                   eval      FDOUT='OUTBIN('                              PDF
N05  C                   CAT       WSSKUFU:0     FDOUT
N05  C                   CAT       ')':0         FDOUT
N05  C                   CAT       FDOUT:1       UCMD
N05  C                   END
     C                   CALL      'QCMDEXC'                            33
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
     C                   OPEN      LISTE
     C                   EXCEPT    DET
     C                   SETON                                        40
     C                   CLOSE     LISTE
     C                   MOVE      WSSKUF        WSSKUG
     C                   MOVE      *BLANKS       WSSKUF
     C                   MOVE      WSSKUFU       WSSKUFUG
     C                   MOVE      *BLANKS       WSSKUFU
     C                   GOTO      START
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     OLISTE     E            DET              03
     O                                           30 'TEST AV SKUFF'
     OLISTE     E            DET              05
     O                                           20 'SKUFF NR:'
     O                       WSSKUF              25
     OLISTE     E            DET              07
     O                                           20 'Skriver :'
     O                       WSPRT               36
