********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11020 * 01 YBC PTF11 FLERE NYE LAND OG REGIONER
********************************************************************
     H DATEDIT(*DMY)
     FTARI      UP   E           K DISK
     FTARINY    IF   E           K DISK    RENAME(TARIR:TARIRNY)
     FLISTE     O    F  300        PRINTER OFLIND(*INOF)
     D                 DS
     D  DATO                   1      8  0
     D  DTÅ                    1      4  0
     D  DTM                    5      6  0
     D  DTD                    7      8  0
      *
     C     *IN99         IFEQ      *OFF
     C     TARINYK       KLIST
     C                   KFLD                    TATANR
     C                   KFLD                    TATAR
     C                   Z-ADD     1             SIDE              4 0
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           DATO
     C                   MOVE      WTM           TID               6 0
     C                   EXCEPT    PHEAD                                         1 PAGE
     C                   SETON                                        99
     C                   END
     C   OF              ADD       1             SIDE              4 0
     C   OF              EXCEPT    PHEAD
     C   OF              SETOFF                                       OF         OVERFLOW
      *
     C                   IF        TATANR > 100
     C     TARINYK       CHAIN     TARINY                             33
     C                   IF        *IN33
     C                   EXCEPT    DET1
     C                   DELETE    TARIR
     C                   ELSE
     C                   UPDATE    TARIR
     C                   END
     C                   ELSE
     C                   UPDATE    TARIR
     C                   END
      *
     OLISTE     E            PHEAD            02
     O                                           24 '** TARIFFNR SOM IKKE FIN'
     O                                           40 'NES I NEDLASTET FILEN **'
     O                                           86 'KJØRT DATO:'
     O                       UDATE         Y     96
     O                                          101 'TID:'
     O                       TID                110 '0  :  :  '
     O                                          120 'SIDE:'
     O                       SIDE          Z    125
     OLISTE     E            PHEAD            04
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O                       *PLACE              96
     O                       *PLACE             120
     O                       *PLACE             144
     O                       *PLACE             168
     OLISTE     E            PHEAD            05
     O                                           24 ' KODE   TARIFFNR ST ENH'
     O                                              ' KAP. PVA ORDINÆR  EFTA   '
E01  O                                              '  EF       EØS      SWAZIL'
     O                                              'A  TYRKIA   ISRAEL   SINGA'
     O                                              'AP. CHILE    MARKEDON SØRS'
     O                                              'OREA JORDAN   TUNISIA  MUL'
     O                                              '.LAND OU.LAND  GRØNLAND FÆ'
     O                                              'ÆRØYEN INDIA.ST MAROKKO  M'
     O                                              'EXICO   VESTGAZA LIBANON  '
     O                                              'SACU     EGYPT    CANADA'
     OLISTE     E            PHEAD            06
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O                       *PLACE              96
     O                       *PLACE             120
     O                       *PLACE             144
     O                       *PLACE             168
     OLISTE     E            DET1        2
     O                                           10 'SLETTET:'
     O                       TATANR              19
     O                       TASTK               22
     O                       TAENHE              26
     O                       TAKAP               28
     O                       TAKAPA              33
     O                       TAORDK              35
     O                       TAORDB        J     42
     O                       TAEFTB        J
     O                       TAEFB         J
     O                       TAEØSB        J
     O                       TATSJB        J
     O                       TATYRB        J
     O                       TAISRB        J
     O                       TAELLB        J
     O                       TABULB        J
     O                       TAPOLB        J
     O                       TAROMB        J
     O                       TAUNGB        J
     O                       TAMULB        J
     O                       TAOULB        J
     O                       TAGRLB        J
     O                       TAFÆRB        J
     O                       TAISTB        J
     O                       TAMARB        J
     O                       TAMEXB        J
     O                       TAVGAB        J
