********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12236 * 01 YBC PTF12 21069060, 93, 98 og 35019010, 35022090 kan ha to sats med ulike måter
12XXX * 02 YBC PTF12 IKKE SETT SLUTTDATO PÅ TARIFFNR < 100
12275 * 03 YBC PTF12 21069093 og 35022090 er ikke med 2 satser fra 2022. Men 21069094, 95 med.
********************************************************************
     FTARI      uF   E           k DISK
     c                   z-add     1             udager
     c                   move      'SUB'         ufunksjon
     c     key           klist
     c                   kfld                    tatanr
     c                   move      99999999      tatanr
     c     key           setgt     tari
     c     *in33         doweq     '0'
     c                   readp     tari                                   33
N02  C                   IF        TATANR < 100
N02  C                   GOTO      SLUTT
N02  C                   END
     c     *in33         ifeq      '0'
     c     tatanr        andeq     tatanrg
     c     tadts         andeq     0
     c                   move      tadatog       Udato1
     c                   call      'SYGE20T'
     C                   PARM                    Ufunksjon         3
     c                   parm                    UDato1            8 0
     c                   parm                    UDato2            8 0
     c                   parm                    UDager            5 0
     c                   move      udato2        tadts
     c                   update    tarir
     c                   endif
N01  C                   IF        TATANR <> TATANRG AND
S03  C*                            (TATANR = 21069060 OR TATANR = 21069093 OR
S03  C*                             TATANR = 21069098 OR TATANR = 35019010 OR
S03  C*                             TATANR = 35022090)
N03  C                             (TATANR = 21069060 OR TATANR = 21069094 OR
N03  C                              TATANR = 21069095 OR TATANR = 21069098 OR
N03  C                              TATANR = 35019010)
N01  c                   READP     TARI                                   33
N01  C                   END
     c                   move      tatanr        tatanrg           8 0
     c                   move      tadato        tadatog           8 0
     c                   enddo
N02  C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
