********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SLUTT DATO PÅ TOLLTARIFF
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11020 * 02 YBC PTF11 FLERE NYE LAND OG REGIONER
11020 * 03 SH  PTF12 FLERE NYE LAND OG REGIONER
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12236 * 04 YBC PTF12 21069060, 93, 98 og 35019010, 35022090 kan ha to sats med ulike måter
12XXX * 05 YBC PTF12 GAMLE POST I TARI KAN HA STARTDATO SOM ER STØRRE ENN NY NEDLASTET
      *              OPPDATERE SLUTT MED DAGENEDATO
12275 * 06 YBC PTF12 21069093 og 35022090 er ikke med 2 satser fra 2022. Men 21069094, 95 med.
********************************************************************
      * HVIS NY, SKRIV.. (MED BLANK TEKST, ALFASØK FRA TARIKAP )
      *
     H DATEDIT(*DMY)
     FTARINY    IP   E           K DISK    RENAME(TARIR:XXXX)
S05  F*TARI      IF A E           K DISK
N05  FTARI      UF A E           K DISK
     FLISTE     O    F  310        PRINTER OFLIND(*INOF)
     D                 DS
S02  D* NYPOST                 1    227
S03  D* NYPOST                 1    297
S06  D* NYPOST                 1    339
N06  D  NYPOST                 1    385
     D  TASTK                  1      1
     D  TAENHE                 2      4
     D  TAKAP                  5      5
     D  TAKAPA                 6      9
     D  TAORDK                10     10
     D  TAORDB                11     17  2
     D  TAEFTB                18     24  2
     D  TAEFB                 25     31  2
     D  TAEØSB                32     38  2
     D  TATSJB                39     45  2
     D  TATYRB                46     52  2
     D  TAISRB                53     59  2
     D  TAELLB                60     66  2
     D  TABULB                67     73  2
     D  TAPOLB                74     80  2
     D  TAROMB                81     87  2
     D  TAUNGB                88     94  2
     D  TASLOB                95    101  2
     D  TAMULB               102    108  2
     D  TAOULB               109    115  2
     D  TAGRLB               116    122  2
     D  TAFÆRB               123    129  2
     D  TAISTB               130    136  2
     D  TAMARB               137    143  2
     D  TAMEXB               144    150  2
     D  TAVGAB               151    157  2
     D  TAN01B               158    164  2
     D  TAN02B               165    171  2
     D  TAN03B               172    178  2
     D  TAN04B               179    185  2
     D  TAN05B               186    192  2
     D  TAN06B               193    199  2
     D  TAN07B               200    206  2
     D  TAN08B               207    213  2
     D  TAN09B               214    220  2
     D  TAN10B               221    227  2
N02  D  TAN11B               228    234  2
N02  D  TAN12B               235    241  2
N02  D  TAN13B               242    248  2
N02  D  TAN14B               249    255  2
N02  D  TAN15B               256    262  2
N02  D  TAN16B               263    269  2
N02  D  TAN17B               270    276  2
N02  D  TAN18B               277    283  2
N02  D  TAN19B               284    290  2
N02  D  TAN20B               291    297  2
N03  D  TAN21B               298    304  2
N03  D  TAN22B               305    311  2
N03  D  TAN23B               312    318  2
N03  D  TAN24B               319    325  2
N03  D  TAN25B               326    332  2
N03  D  TAN26B               333    339  2
N06  D  TAEFTK               340    340
N06  D  TAEFK                341    341
N06  D  TAEØSK               342    342
N06  D  TATSJK               343    343
N06  D  TATYRK               344    344
N06  D  TAISRK               345    345
N06  D  TAELLK               346    346
N06  D  TABULK               347    347
N06  D  TAPOLK               348    348
N06  D  TAROMK               349    349
N06  D  TAUNGK               350    350
N06  D  TASLOK               351    351
N06  D  TAMULK               352    352
N06  D  TAOULK               353    353
N06  D  TAGRLK               354    354
N06  D  TAFÆRK               355    355
N06  D  TAISTK               356    356
N06  D  TAMARK               357    357
N06  D  TAMEXK               358    358
N06  D  TAVGAK               359    359
N06  D  TAN01K               360    360
N06  D  TAN02K               361    361
N06  D  TAN03K               362    362
N06  D  TAN04K               363    363
N06  D  TAN05K               364    364
N06  D  TAN06K               365    365
N06  D  TAN07K               366    366
N06  D  TAN08K               367    367
N06  D  TAN09K               368    368
N06  D  TAN10K               369    369
N06  D  TAN11K               370    370
N06  D  TAN12K               371    371
N06  D  TAN13K               372    372
N06  D  TAN14K               373    373
N06  D  TAN15K               374    374
N06  D  TAN16K               375    375
N06  D  TAN17K               376    376
N06  D  TAN18K               377    377
N06  D  TAN19K               378    378
N06  D  TAN20K               379    379
N06  D  TAN21K               380    380
N06  D  TAN22K               381    381
N06  D  TAN23K               382    382
N06  D  TAN24K               383    383
N06  D  TAN25K               384    384
N06  D  TAN26K               385    385
      *
n03  D                 DS
S01  D* NYPOS2               201    331
N01  D  NYPOS2               301    439
     D  TATANR               301    308  0
     D  TATAR                309    311
     D  TADATO               312    319  0
     D  TATXT                320    399
     D  TAKAPN               400    401  0
     D  TAALFA               402    416
     D  TAREST               417    418
     D  TAKDAÆ               419    420
     D  TAKDSÆ               421    423
     D  TADTR                424    431  0
N01  D  TADTS                432    439  0
      *
     C     *IN99         IFEQ      *OFF
N05  C                   CALL      'SYGE15C'
N05  C                   PARM                    WDT               8
N05  C                   PARM                    WTM               6
     C                   Z-ADD     1             SIDE              4 0
     C                   TIME                    TID               6 0
     C                   EXCEPT    PHEAD                                         1 PAGE
     C                   SETON                                        99
     C                   END
     C   OF              ADD       1             SIDE              4 0
     C   OF              EXCEPT    PHEAD
     C   OF              SETOFF                                       OF         OVERFLOW
      *
S02  C*                  MOVE      NYPOST        G2POST          227
S03  C*                  MOVE      NYPOST        G2POST          297
S06  C*                  MOVE      NYPOST        G2POST          339
N06  C                   MOVE      NYPOST        G2POST          385
S01  C*                  MOVE      NYPOS2        G2POS2          123
S05  C*                  MOVE      NYPOS2        G2POS2          131
N05  C                   MOVE      NYPOS2        G2POS2          139
N04  C                   MOVE      TAORDK        G2ORDK            1
N05  C                   MOVE      TADATO        G2DATO            8 0
N05  C                   MOVE      TADTS         G2DTS             8 0
     C     TATANR        CHAIN     TARI                               33
N05  C                   DOW       *IN33 = *OFF
N05  C                   IF        TADTS = 0
N05  C                   LEAVE
N05  C                   END
N05  C     TATANR        READE     TARI                                   33
N05  C                   ENDDO
S06  C*                  IF        (TATANR = 21069060 OR TATANR = 21069093 OR
S06  C*                             TATANR = 21069098 OR TATANR = 35019010 OR
S06  C*                             TATANR = 35022090)
N06  C                   IF        (TATANR = 21069060 OR TATANR = 21069094 OR
N06  C                              TATANR = 21069095 OR TATANR = 21069098 OR
N06  C                              TATANR = 35019010)
N04  C                             AND TAORDK <> G2ORDK
N04  C     TATANR        READE     TARI                                   33
N05  C                   DOW       *IN33 = *OFF
N05  C                   IF        TADTS = 0
N05  C                   LEAVE
N05  C                   END
N05  C     TATANR        READE     TARI                                   33
N05  C                   ENDDO
N04  C                   END
N05  C  N33              IF        TADATO > G2DATO AND G2DTS = 0
N05  C                   MOVE      WDT           TADTS
N05  C                   END
N05  C  N33              UPDATE    TARIR
     C                   MOVE      G2POST        NYPOST
     C                   MOVE      G2POS2        NYPOS2
     C                   WRITE     TARIR
     C   33              EXCEPT    DET
     OLISTE     E            PHEAD            02
     O                                           24 '** HELT NYE TOLLTARIFFNR'
     O                                           40 ' **             '
     O                                           86 'KJØRT DATO:'
     O                       UDATE         Y     96
     O                                          101 'TID:'
     O                       TID                110 '0  :  :  '
     O                                          120 'SIDE:'
     O                       SIDE          Z    125
     OLISTE     E            PHEAD            04
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O                       *PLACE              96
     O                       *PLACE             120
     O                       *PLACE             144
     O                       *PLACE             168
     OLISTE     E            PHEAD            05
     O                                           24 ' KODE   TARIFFNR ST ENH'
     O                                              ' KAP. PVA ORDINÆR  EFTA   '
E02  O                                              '  EF       EØS      SWAZIL'
E02  O                                              'A  TYRKIA   ISRAEL   SINGA'
     O                                              'AP. CHILE    MARKEDON SØRS'
     O                                              'OREA JORDAN   TUNISIA  MUL'
     O                                              '.LAND OU.LAND  GRØNLAND FÆ'
     O                                              'ÆRØYEN INDIA.ST MAROKKO  M'
     O                                              'EXICO   VESTGAZA LIBANON  '
     O                                              'SACU     EGYPT    CANADA'
     OLISTE     E            PHEAD            06
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O                       *PLACE              96
     O                       *PLACE             120
     O                       *PLACE             144
     O                       *PLACE             168
     OLISTE     E            DET         1
     O                                            8 'NYTT:'
     O                       TATANR              19
     O                       TASTK               22
     O                       TAENHE              26
     O                       TAKAP               28
     O                       TAKAPA              33
     O                       TAORDK              35
     O                       TAORDB        J     42
     O                       TAEFTB        J
     O                       TAEFB         J
     O                       TAEØSB        J
     O                       TATSJB        J
     O                       TATYRB        J
     O                       TAISRB        J
     O                       TAELLB        J
     O                       TABULB        J
     O                       TAPOLB        J
     O                       TAROMB        J
     O                       TAUNGB        J
     O                       TASLOB        J
     O                       TAMULB        J
     O                       TAOULB        J
     O                       TAGRLB        J
     O                       TAFÆRB        J
     O                       TAISTB        J
     O                       TAMARB        J
     O                       TAMEXB        J
     O                       TAVGAB        J
     O                       TAN01B        J
     O                       TAN02B        J
     O                       TAN03B        J
     O                       TAN04B        J
