     H DFTACTGRP(*NO)
      *
      ***********************************************************
      *** PROGRAM SKAL SENDE valutakurs.xml til kunde         ***
      ***********************************************************
      *
     FEDIC      UF   E             DISK
     FEDIS      O  A E             DISK
     D                 ds
     D XREF                    1     10
     D XREF_A                  1      1
     D XREF_B                  2     10  0
      *
      *  Prototype for syti21r
     d syti21r         pr
     d u0010_                              like(u0010)
      *  *ENTRY Interface for Main Procedure
     d syti21r         pi
     d u0010                         35
      *  Prototype for 'SYGE15C'
     d syge15c         pr                  extpgm('SYGE15C')
     d wdt_                                like(wdt)
     d wtm_                                like(wtm)
      *----------------------------------------------------------------------
      * Stand Alone Fields - TOP
      *----------------------------------------------------------------------
     d wdt             s              8
     d wtm             s              6

      *----------------------------------------------------------------------
      /free

       exsr init;

       exsr srmld;

       *inlr = *on;
       return;

       //**********************************************
       begsr srmld;
       //**********************************************

         chain 1 edic;
         csn = csn + 1;
         update edicr;

         s0004  = 'NO005405';
         s0010  = u0010;
         s0010  = u0010;
         xref_a = 'S';
         xref_b = csn;
         s0020  = xref;
         s0026  = 'SYTI21R';
         ssn    = csn;
         ssr    = 'S';
         sst    = 'A';
         sdt    = %dec(wdt:8:0);
         stm    = %dec(wtm:6:0);
         slib   = '*LIBL';
         sfile  = '*IFS';
         smbr   = s0020;
         sifs   = '/SYSPEDF/TOLL/valutakurs.xml';
         write edisr;

         endsr;

       //**********************************************
       begsr init;
       //**********************************************

         syge15c ( wdt : wtm );

       endsr;

      /end-free
