     H DFTACTGRP(*NO)
     FXMLRCVF   UF   E           K DISK    USROPN
     FXMLRCAF   UF   E           K DISK    USROPN
     FXMLRCLF   UF   E           K DISK    USROPN

      *  Prototype for syti10r
     d syti10r         pr
     d usn_                                like(usn)
      *  *ENTRY Interface for Main Procedure
     d syti10r         pi
     d usn                            9
      *
      /free

         exsr init;

         open xmlrcvf;
         open xmlrcaf;
         open xmlrclf;

         exec sql
         delete from XMLRCVF
         where xrsn = :xrsn
         with NC;

         exec sql
         delete from XMLRCAF
         where xrsn = :xrsn
         with NC;

         exec sql
         delete from XMLRCLF
         where xrsn = :xrsn
         with NC;

         close xmlrcvf;
         close xmlrcaf;
         close xmlrclf;

         *inlr = *on;
         return;

      //***********************************************
       begsr init;
      //***********************************************
         xrsn = %float(usn);

       endsr;

      /end-free
