     H DFTACTGRP(*NO)
      *
      ***********************************************************
      *** PROGRAM SKAL KONVERTER FILER FRA TVINN              ***
      ***********************************************************
      *
     FEDIC      UF   E             DISK
     FEDIS      O  A E             DISK
     FEDISX     O  A E             DISK
      *
     D                sds
     D ZUSER                 254    263
     D                 ds
     D XMBR                    1     10
     D XKD                     1      1
     D XSN                     2     10  0
     D XSN2                    2     10
      *  Prototype for syti07r1
     d syti07r1        pr
     d usn_                                like(usn)
     d upath_                              like(upath)
      *  *ENTRY Interface for Main Procedure
     d syti07r1        pi
     d usn                            9a
     d upath                        256a
      *  Prototype for 'SYGE15C'
     d syge15c         pr                  extpgm('SYGE15C')
     d wdt_                                like(wdt)
     d wtm_                                like(wtm)
      *----------------------------------------------------------------------
      * Stand Alone Fields - TOP
      *----------------------------------------------------------------------
     d wdt             s              8
     d wtm             s              6

     D EDIDTA          DS           256    DTAARA('EDIDTA')
     D  UELIBF               171    180

      *----------------------------------------------------------------------
      /free

       exsr init;

       chain 1 edic;
       csn = csn + 1;
       update edicr;
       xkd = 'K';
       xsn = csn;

       sxprodm  = xmbr;
       sxifsobj = upath;
       write edisr;

       s0004  = 'TVINN';
       s0010  = 'SYSPED';
       s0020  = 'TOLLSATS-IMP';
       s0026  = 'TOLLSATS-IMP';
       s0036  = 1;
       sdt    = %dec(wdt:8:0);
       stm    = %dec(wtm:6:0);
       slib   = '*LIBL';
       sfile  = '*IFS';
       smbr   = xmbr;
       ssn    = csn;
       ssr    = 'R';
       sst    = 'C';
       write edisr;

       sxprodm  = xmbr;
       sxifsobj = upath;
       write edisxr;

       usn    = xsn2;

       *inlr = *on;
       return;

       //**********************************************
       begsr init;
       //**********************************************

         in edidta;
         upath = '/' + %trim(UELIBF) + '/TOLL/tollsats.xml';

         syge15c ( wdt : wtm );

       endsr;

      /end-free
