      *****************************************************************
      *  gebyr for kollimerking
      *  oppdaterer hovedoppdrag istedenfor underoppderag
      *****************************************************************
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 xxx PTF12
      *
********************************************************************
     FFirm      IF   E           K DISK
     Fheadf     IF   E           K DISK
     FFAKT      IF A E           K DISK
n01  FCUNDL01   IF   E           K DISK
     FTRACKF    O  A E             DISK
     D                 DS
     D  AUA                    1      2
     D  AUA1                   1      1
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL電                 11     14  0
     D                 DS
     D  UL電                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
N07  D                SDS
N07  D  ZUSER                254    263
      *
     C     *ENTRY        PLIST
N07  c                   PARM                    AVD               4 0
N07  c                   PARM                    OPD               7 0
     c                   PARM                    UVK               3
N07  c                   PARM                    UBEL             13 2
N07  c                   PARM                    UVT              20
      *
     c                   read      firm                                   33
      *
     c     heakey        klist
     c                   kfld                    avd
     c                   kfld                    opd
      *
N01  C     Kunkey        KLIST
N01  C                   KFLD                    FIFIRM
N01  C                   KFLD                    TRKNFA
      *
     c     heakey        chain     headf                              33
     c     *in33         ifeq      '0'
      *
      * Dersom gebyr for merking av gods allerede finnes - hopp ut.
      * (fang opp evt manglende S/K-kode
      *
     C     heakey        setll     fakt
     C     heakey        reade     fakt                                   33
     C     *in33         doweq     *off
     C     XXSK          IFEQ      ' '
     C     FALI          andeq     0
     C                   move      FASK          XXSK              1
     c                   end
     C     FAVK          CABEQ     UVK           slutt
     C     heakey        reade     fakt                                   33
     C                   end
      *
      * mangler varelinje 0
      *
     c     xxsk          ifeq      ' '
     c                   move      trkdff        XXSK
     c                   end
      *
     C                   clear                   FAKTR
      *
     C                   move      AVD           FAAVD
     C                   move      OPD           FAOPD
     c                   move      UVT           FAVT
     C                   CALL      'SYGE06'
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FALI
     C                   MOVE      XXSK          FASK
     C                   MOVE      UVK           FAVK
     C                   MOVE      'NOK'         FAVAL
     C                   Z-add     UBEL          FABELV
     c                   z-add(H)  FABELV        XXBEL0           11 0
     c                   z-add     XXBEL0        FABELN
     C                   MOVE      'J'           FAKDM
      *
N01  c     KunKey        chain     Cundl01                            33
N01  c     *in33         ifeq      '0'
N01  c     SYLAND        ANDNE     '  '
N01  c     SYLAND        ANDNE     'NO'
N01  C                   MOVE      'N'           FAKDM
N01  c                   endif
      *
     C                   MOVE      'M'           FAKDA
N06  C                   MOVE      HEKNSF        FAKUNR
N06  C                   IF        TRKDFF = 'K'
N06  C                   MOVE      HEKNKF        FAKUNR
N06  C                   ENDIF
     c                   Write     FAKTR
      *
     c                   exsr      ttsr
N05  c                   end
N05  c*
     C     slutt         tag
     C                   SETON                                        LR
     C                   RETURN
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
      *
     C                   MOVE      AVD           TTAVD
     C                   MOVE      OPD           TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL電         UL電
     C                   MOVE      'TEI'         TTACTI
     C                   MOVE      ULDT          TTDATL
     C                   MOVE      XULTM         TTTIML
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   eval      TTUSER=ZUSER
N05  C                   EVAL      TTTEXT = 'New labels prodused'
N05  C                   EVAL      TTTEXL = 'Nye labler er laget'
     C                   WRITE     TRACKFR
      *
     C                   ENDSR
