     C                   call      'SYTRSTAT'
     C                   PARM      80            TTAVD             4 0
     C                   PARM      201630        TTOPD             7 0
     C                   PARM                    UUmanu            1
     C                   PARM                    Status           15
      *
     C                   RETURN
      *
