      *eks: SPO Splitt-oppd. L 00000001
     C                   call      'SYTR88S'
     C                   PARM      '00000001'    UPRO              8
     C                   PARM      'S'           UTYPE             1             S=splittet Oppdrag
      *
     C                   SETON                                        LR
     C                   RETURN
