     FSADH      IF   E           K DISK
     FHEADF     UF A E           K DISK
      *___________
      * Initiering
      *"""""""""""
     C                   EXSR      INIT
      *____________
      * Hovedlogikk
      *""""""""""""
      * Finnes SADH-post ?
     C     KEYSADH       CHAIN     SADH
     C                   IF        NOT %FOUND
     C                   GOTO      SLUTT
     C                   ENDIF
      * Finnes HEADF-Post ?
     C     KEYSADH       CHAIN     HEADF
     C                   IF        %FOUND
     C                   GOTO      SLUTT
     C                   ENDIF
      * Skriv ny post i HEADF
     C                   CLEAR                   HEADFR

     C                   MOVE      UHEUR         HEUR
     C                   MOVE      SIAVD         HEAVD
     C                   MOVE      SITDN         HEOPD
     C                   MOVE      SISG          HESG
     C                   MOVE      SIDT          HEDTOP
     C                   MOVE      SIDT          HEDTR
     C                   MOVEL     SIGN          HEGN
     C                   MOVEL     SIPOS         HEPOS1
     C                   MOVEL     SIKNS         HEKNS
     C                   MOVEL     SINAS         HENAS
     C                   MOVEL     SIADS1        HEADS1
     C                   MOVEL     SIADS2        HEADS2
     C                   MOVEL     SIADS3        HEADS3
     C                   MOVEL     SIKNK         HEKNK
     C                   MOVEL     SINAK         HENAK
     C                   MOVEL     SIADK1        HEADK1
     C                   MOVEL     SIADK2        HEADK2
     C                   MOVEL     SIADK3        HEADK3
     C                   MOVEL     SILV          HEFR
     C                   MOVEL     SILKA         HELKA
     C                   MOVEL     SITRID        HEHAWB
     C                   Z-ADD     SITRM         HETRM
     C                   MOVE      SIKDC         HETRC
     C                   MOVE      SILKT         HETRI
     C                   Z-ADD     SIBEL1        HEFBK
ERT  c                   z-add     SIBEL1        trfrab
ERT  c                   MOVEL     SIVAL1        trfrav
ERT  C                   movel     SIKDLS        HEKDL
     C                   Z-ADD     SINTK         HENT
     C                   Z-ADD     SIVKB         HEVKT

     C                   WRITE     HEADFR
      * Slutt
     C     SLUTT         TAG
     C
     C                   EVAL      *INLR=*ON
      *______________________________________________
      * Init av pgm                              INIT
      *""""""""""""""""""""""""""""""""""""""""""""""
     C     INIT          BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    UHEUR             1
     C     KEYSADH       KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   ENDSR
