      *********************************************************************
     FXMLUFL2   uf   E           K DISK
     FFAK9      IF   E           K DISK
     FHEADF     IF   E           K DISK
      *
     C     HEADFK        klist
     C                   kfld                    FAAVD
     C                   kfld                    FAOPD

     C     *LOVAL        SETLL     XMLUFL2
     C                   READ      XMLUFL2                                55
     C     *IN55         DOWEQ     '0'
     C                   IF        XFTYPE = 'EHF'
      * finn oppdrag for utg.faktura
     C                   eval      FAKDA =  'K'
     C     XFFN          setll     FAK9
     C                   dow       not %eof
     C                   IF        FAKDA <> 'K'
     C                   leave
     C                   ENDIF
     C     XFFN          reade     FAK9
     C                   enddo
      *
     c                   IF        FAKDA <> 'K'
     C     HEADFK        CHAIN     HEADF
     c                   if        %found
     C                   EVAL      XFAVDO = heavd
     C                   EVAL      XFOPD  = heopd
     C                   EVAL      XFDTOP = HEDTOP
     C                   EVAL      XFDTFA = fadato
     C                   update    XMLUFFR
     C                   endif
     C                   ENDIF
     C                   ENDIF


     C     HOPP          TAG

     C                   READ      XMLUFL2                                55
     C                   ENDDO

     C                   SETON                                        lr
     C                   RETURN

