      *
      ***********************************************************
      *** PROGRAM SKAL SENDE UniversalEvent til CW1 (CLR/ECC) ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26                            ***
      *** LEDIGE INDIKATORER 27-99                            ***
      ***********************************************************
     H DFTACTGRP(*NO)
     FFIRM      IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FEDIC      UF A E             DISK
     FEDIS      UF A E           K DISK
     FEDIM      O  A E             DISK
     FTRACKF    O  A E             DISK
      /copy ifsio_h
     D X_S0020         S             14A
      *
     D FILE_o          s             10I 0
     D String          s            512a
     D rc              s             10i 0
     D Idx             s              5u 0
     D FILNAM          s            100A
     D XCHGAUT         s            200A
     D LF              c                   x'25'
     D RunCmd          PR                  EXTPGM('QCMDEXC')
     D  Cmd                         200A   CONST
     D  Len                          15P 5 CONST
     D                SDS
     D  ZUSER                254    263
      *
     C                   EXSR      INIT
      *
     C                   EXSR      SRSNDST
      *
     C                   EXSR      SRUNIEVT
      *
     C                   EXSR      OPDEDIM
      *
     C                   EXSR      OPDTRACK
      *
     C                   EXSR      SRCLOSE
      *
     C                   EXSR      SRSNDSL
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
      ***********************************************
     C     SRSNDST       BEGSR
      ***********************************************
      *
     C     1             CHAIN     EDIC                               33
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
      *
     C                   MOVE      *BLANKS       SDATA          1024
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
     C                   EVAL      S0004 = X0004
     C                   EVAL      S0010 = X0010
     C                   EVAL      S0020 = %TRIM(X0020) + '-' + %TRIM(UTYPE)
     C                   Z-ADD     1             S0036
     C                   EVAL      SSN   = CSN
     C                   EVAL      SSR   = 'S'
     C                   EVAL      SST   = 'X'
     C                   MOVE      WDT           SDT
     C                   MOVE      WTM           STM
     C                   EVAL      SLIB  = *BLANKS
     C                   EVAL      SFILE = '*IFS'
     C                   EVAL      SMBR  = *BLANKS
     C                   EVAL      SMBRS  = 0
      *
     C                   EVAL      FILNAM = '/' + %TRIM(FILIBF) + 'X/'
     C                             + %TRIM(S0010) + '/EDISE1K/BACKUP/'
     C                             + %TRIM(S0020) + %TRIM(WDT)
     C                             + %TRIM(WTM) + '.xml'
      * 1208 = UTF-8
     C                   eval      FILE_o = open( %TrimR( FilNam )
     C                               : O_CREAT+O_TRUNC+O_WRONLY
     C                                + O_TEXT_CREAT+O_CCSID+O_TEXTDATA
     C                               : S_IRUSR + S_IWUSR
     C                               : 1208
     C                               : 0)
      *
     C                   EVAL      SIFS   = FILNAM
     C                   WRITE     EDISR
      *
     C                   EVAL      XSSN = SSN
      *
     C                   EVAL      SDATA = '<?xml version="1.0" '
     C                             + 'encoding="UTF-8"?>'
     C                   EXSR      OPDFIL
      *
     C                   ENDSR
      *
      ***********************************************
     C     SRUNIEVT      BEGSR
      ***********************************************
      * <UniversalEvent>
     C                   EVAL      SDATA = '<UniversalEvent>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<Event>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<EventTime>' + %SUBST(WDT:1:4) + '-'
     C                             + %SUBST(WDT:5:2) +'-'+ %SUBST(WDT:7:2) +'T'
     C                             + %SUBST(WTM:1:2) +':'+ %SUBST(WTM:3:2) +':'
     C                             + %SUBST(WTM:5:2) + '</EventTime>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<EventType>' + %TRIM(UTYPE)
     C                             + '</EventType>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<DataContext>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<DataTargetCollection>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<DataTarget>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<Type>CustomsDeclaration</Type>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '<Key>' + %TRIM(X0020) +'</Key>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '</DataTarget>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '</DataTargetCollection>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '</DataContext>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '</Event>'
     C                   EXSR      OPDFIL
     C                   EVAL      SDATA = '</UniversalEvent>'
     C                   EXSR      OPDFIL
      *
     C                   ENDSR
      *
      ***********************************************
     C     SRCLOSE       BEGSR
      ***********************************************
      *
     C                   callp     close( FILE_o )
     C                   EVAL      XCHGAUT = 'CHGAUT OBJ(' + XAPS
     C                             + %TRIM(FILNAM) + XAPS
     C                             + ') USER(*PUBLIC) DTAAUT(*RWX) OBJAUT(*ALL)'
     C                   CALLP     RUNCMD(XCHGAUT:200)
      * CHGATR OBJ('home/cb/a.xml') ATR(*CCSID) VALUE(1208)
     C                   MOVE      *BLANKS       UCMD           1024
     C                   Z-ADD     1024          UCMDL            15 5
     C                   EVAL      UCMD = 'CHGATR OBJ(' + XAPS
     C                             + %TRIM(FILNAM) + XAPS + ') '
     C                             + 'ATR(*CCSID) VALUE(1208)'
     C                   CALL      'QCMDEXC'                            33
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
     C                   ENDSR
      *
      ***********************************************
     C     SRSNDSL       BEGSR
      ***********************************************
      *
     C     XSSN          CHAIN     EDIS                               33
     C  N33              MOVE      'X'           SST
     C  N33              UPDATE    EDISR
      *
     C                   ENDSR
      *
      ***********************************************
     C     OPDEDIM       BEGSR
      ***********************************************
     C     1             CHAIN     EDIC                               33
     C                   ADD       1             CMN
     C                   UPDATE    EDICR
      *
     C                   EVAL      M0004 = S0004
     C                   EVAL      M0010 = S0010
     C                   MOVEL     CMN           M0062
     C                   EVAL      M0065 = 'UNIEVT'
     C                   EVAL      M0068 = %TRIM(X0020) + '-' + %TRIM(UTYPE)
     C                   EVAL      M1001 = '929'
     C                   EVAL      M1004 = X0020
     C                   EVAL      M1225 = 'EVT'
     C                   EVAL      M1N07 = UTYPE
     C                   EVAL      MSN = SSN
     C                   EVAL      MMN = CMN
     C                   EVAL      MSR = 'S'
     C                   EVAL      MST = 'C'
     C                   MOVE      WDT           MDT
     C                   MOVE      WTM           MTM
     C                   MOVE      UAVD          MAVD
     C                   MOVE      UTDN          MTDN
     C                   WRITE     EDIMR
      *
     C                   ENDSR
      *
      ***********************************************
     C     OPDTRACK      BEGSR
      ***********************************************
      *
     C                   EVAL      TTAVD  = MAVD
     C                   EVAL      TTOPD  = MTDN
     C                   EVAL      TTACTI = 'CW1'
     C                   EVAL      TTDATE = MDT
     C                   EVAL      TTTIME = MTM
     C                   EVAL      TTUSER = ZUSER
     C                   EVAL      TTDATL = MDT
     C                   EVAL      TTTIML = MTM
     C                   EVAL      TTEDEV = 'CES'
     C                   EVAL      TTEDRE = UTYPE
     C                   EVAL      TTMANU = 'E'
     C                   EVAL      TTNAME = 'SYXML54'
     C                   EVAL      TTTEXT = 'CW1-Shipment(' + %TRIM(X0020)
     C                             + ') is cleared by customs.'
     C                   EVAL      TTTEXL = 'CW1-Shipment(' + %TRIM(X0020)
     C                             + ') er ferdigbehandlet av TVINN.'
     C                   WRITE     TRACKFR
      *
     C                   ENDSR
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C                   EVAL      SDATA=(%trimr(SDATA))+ LF
     c                   callp     write(File_o : %addr(Sdata)
     c                                : %len(%trimr(Sdata)) )
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     FRISOKK       KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UTDN              7
     C                   PARM                    UTYPE             3
     C                   PARM                    UIE               3
      *
     C     *LIKE         DEFINE    S0004         X0004
     C     *LIKE         DEFINE    S0010         X0010
     C     *LIKE         DEFINE    S0020         X0020
     C     *LIKE         DEFINE    SSN           XSSN
     C                   MOVE      X'7D'         XAPS              1
     C                   MOVE      UAVD          FSAVD
     C                   MOVE      UTDN          FSOPD
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C                   SELECT
     C                   WHEN      UIE = 'IMP'
     C                   EVAL      FSKODE = '*CR'
     C                   WHEN      UIE = 'EXP'
     C                   EVAL      FSKODE = '*CE'
     C                   ENDSL
     C     FRISOKK       CHAIN     FRISOK                             33
     C                   MOVEL     FSSOK         X0020                          CW1 ORDRE NR
     C                   EVAL      FSKODE = '*CA'
     C     FRISOKK       CHAIN     FRISOK                             33
     C                   MOVEL     FSSOK         X0010                          CW1 AVSENDER
     C                   EVAL      FSKODE = '*CM'
     C     FRISOKK       CHAIN     FRISOK                             33
     C                   MOVE      FSSOK         X0004                          CW1 MOTTAKER
      *
     C                   ENDSR
      *
