     FTACTL01   IP   e           K DISK
     FAIRLH     IF A E           K DISK
     F*IRLD     IF A E           K DISK
     FKODTFSL2  IF   E           K DISK
     D                 DS
     D  brudd                  1     13
     D  airlinw                1      3
     D  airpfrw                4      6
     D  airptow                7      9
     D  tafligw               10     13
      *
     c     key           klist
     c                   kfld                    airlin
     c                   kfld                    airpfr
     c                   kfld                    airpto
      *
     c
     c     tacar1        chain     kodtfsl2                           33
     c  N33              move      kfsfnr        airlinp
      * blank er iata-pris
     c     tacar1        ifeq      *blanks
     c                   setoff                                       33
     c                   move      *zeros        airlinp           3
     c                   end
     c     *in33         ifeq      '0'
     c                   move      airlinp       airlin
     c                   move      TASTFR        airpfr
     c                   move      TASTTI        airpto
     c                   move      TAVALU        aircur
     c                   move      airlinp       airlinw
     c                   move      TASTFR        airpfrw
     c                   move      TASTTI        airptow
     c                   move      TAFLIG        tafligw
     c     key           chain     airlh                              33
     C     *IN33         IFEQ      '1'
     c     brudd         orne      bruddf
     c     tastfr        ifeq      'OSL'
     c     tastti        andeq     'LON'
     c     airlinp       andeq     '057'
     c   33              write     airlhr
     C                   CALL      'TACT02R'
     c                   parm                    airlinp
     c                   parm                    tacar1
     c                   parm                    tastfr
     c                   parm                    tastti
     c                   parm                    taflig
     c                   end
     c                   move      brudd         bruddf           13
     c                   end
     c                   end
