      *********************************************************************
      *
      *  CRTPGM SYSPED/TDIG004R MODULE(*LIBL/TDIG004R *LIBL/INCGI)
      *        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FBRPARF    IF   E           K DISK    USROPN
     FTURER     IF   E           K DISK    USROPN
     FSADMOTL1  IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D AVD             S              4
     D AVDA            S              4
     D AVDN            S              4  0
     D TUR             S              8
     D TURA            S              8
     D TURN            S              8  0
     D WSIGN           S              3
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     d wpabrid         s                   like(pabrid)
     d wpakunr         s                   like(pakunr)
     d wpasort         s                   like(pasort)

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      * Lag digitoll
     C  N50              EXSR      SRTE
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬avd¬ : ¬'+%trim(%editc(AVDN:'Z'))+'¬, '
        +'¬tur¬ : ¬'+%trim(%editc(TURN:'M'))+'¬, '
        +'¬sign¬ : ¬'+%trim(WSIGN)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     C                   eval      JSONstring ='"crtdigitoll" : ['
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
     c                   eval      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     BRPARF
     C  N50              CLOSE     TURER
     C  N50              CLOSE     SADMOTL1

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      AVD     = zhbgetvar('AVD')
     C                   eval      AVDN    = c2n2(AVD)
     C                   MOVE      AVDN          AVDA
     C                   EVAL      TUR     = zhbgetvar('TUR')
     C                   eval      TURN    = c2n2(TUR)
     C                   MOVE      TURN          TURA
     C                   EVAL      WSIGN   = zhbgetvar('SIGN')
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C  N50BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      BRPARF
     C  N50              OPEN      TURER
     C  N50              OPEN      SADMOTL1

     C                   IF        *IN50=*OFF
     C                   EVAL      wpabrid=wsuser
     C                   EVAL      wpakunr=0
     C                   EVAL      wpasort=0
     C     TURKEY        KLIST
     C                   KFLD                    WTUAVD
     C                   KFLD                    WTUPRO
     C     *LIKE         DEFINE    TUAVD         WTUAVD
     C     *LIKE         DEFINE    TUPRO         WTUPRO
     C                   EVAL      WTUAVD=AVDN
     C                   EVAL      WTUPRO=TURN
     C     TURKEY        CHAIN     TURER                              50
     C                   IF        *IN50=*ON
     C                   EVAL      Error='Tur not found'
     C                   ENDIF
     C                   IF        *IN50=*OFF
     C     TURKEY        CHAIN     SADMOTL1                           51
     C                   IF        *IN51=*OFF
     C                   EVAL      Error='Transport level already exist'
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF

     C                   ENDSR
      *___________________________________________
      * Lag digitoll                          SRTE
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRTE          BEGSR

     C                   CALL      'DIG01R'
     C                   PARM                    AVDN
     C                   PARM                    TURN
     C                   PARM                    WSIGN

     C                   ENDSR
