     FSADMOHF   UF   E             DISK
     FSADMOMF   UF   E             DISK
     FSADMOTF   UF   E             DISK
     C                   READ      SADMOHF                                33
     C                   DOW       *IN33 = *OFF
     C                   EVAL      EHUUID_OWN=EHUUID
     C                   UPDATE    SADMOHFR
     C                   READ      SADMOHF                                33
     C                   ENDDO
     C                   READ      SADMOMF                                34
     C                   DOW       *IN34 = *OFF
     C                   EVAL      EMUUID_OWN=EMUUID
     C                   UPDATE    SADMOMFR
     C                   READ      SADMOMF                                34
     C                   ENDDO
     C                   READ      SADMOTF                                35
     C                   DOW       *IN35 = *OFF
     C                   EVAL      ETUUID_OWN=ETUUID
     C                   UPDATE    SADMOTFR
     C                   READ      SADMOTF                                35
     C                   ENDDO
     C                   EVAL      *INLR=*ON
