     FDKEH      IF   E           K DISK
     FDKTVK     IF   E           K DISK
     C                   EXSR      INIT
     C                   EXSR      AVG
     C                   EVAL      *INLR=*ON
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   Z-ADD     0             ZCIFTOT          18 4
     C     *LIKE         DEFINE    DKEH_SYAV     ZKEH_SYAV
     C     *LIKE         DEFINE    DKEH_SYOP     ZKEH_SYOP
     C     *LIKE         DEFINE    DKEH_222      ZVEH_222
     C     *LIKE         DEFINE    DKVK_KD       ZVVK_KD
     C     *LIKE         DEFINE    DKVK_DTS      ZVVK_DTS
     C     DKEHKEY       KLIST
     C                   KFLD                    ZKEH_SYAV
     C                   KFLD                    ZKEH_SYOP
     C     DKTVKKEY      KLIST
     C                   KFLD                    ZVVK_KD
     C                   KFLD                    ZVVK_DTS
      * Hæmta dagens datum och klockslag
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     c                   endsr
      *_________________________________________________
      * Avgiftsberækning                             AVG
      *"""""""""""""""""""""""""""""""""""""""""""""""""
     C     AVG           BEGSR
      * Hämta huvudupplysningar
     C     DKEHKEY       CHAIN     DKEH
      * Rækna ut totalt CIF værde
     C                   EXSR      SRCIFTOT
      * Starta med Statistiskt værde
     C                   EXSR      SRCIFDET
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Berækna CIF totalt                              SRCIFTOT /
      *////////////////////////////////////////////////////////////
     C     SRCIFTOT      BEGSR
      *__________________________________
      * Summera alla kostnader och avdrag
      *""""""""""""""""""""""""""""""""""
     C                   EVAL      ZVEH_222=*ZEROS
      * Fakturabelopp i Danska kronor
     C     DKEH_222      MULT      DKEH_221B     ZVEH_222
     C                   EVAL      ZVVK_KD=DKEH_221
     C                   MOVEL     WDT           ZVVK_DTS
     C     DKTVKKEY      SETGT     DKTVK
     C                   READP     DKTVK                                  64
     C                   IF        *IN64=*OFF
     C                   IF        DKVK_OMR > 0 and ZVEH_222 > 0
     C     ZVEH_222      DIV       DKVK_OMR      ZVEH_222
     C                   ENDIF
     C                   ENDIF
     C                   EVAL      ZCIFTOT=ZVEH_222
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Berækna CIF før varupost                        SRCIFDET /
      *////////////////////////////////////////////////////////////
     C     SRCIFDET      BEGSR
     C                   IF        DKEH_222  = ZCIFTOT
     C                   IF        DKEV_46   = *ZEROS
     C                   EVAL      DKEV_46   = DKEV_42
     C                   ENDIF
     C                   ELSE
     C                   IF        DKEH_222  > 0
     C                   IF        DKEV_42   > 0
     C     DKEV_42       DIV       DKEH_222      ZFAKTOR          18 8
     C                   ENDIF
     C                   ENDIF
     C                   IF        DKEV_46   = *ZEROS
     C     ZCIFTOT       MULT      ZFAKTOR       DKEV_46
     C                   ENDIF
     C                   ENDIF
     C                   ENDSR
