      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TDKI000R MODULE(*LIBL/TDKI000R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 Må sette bibliotekliste før bruk BRPARF
********************************************************************
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FBRPARF    IF   E           K DISK    USROPN
     FDKIH      IF   E           K DISK    USROPN
     FDKIH10    IF   E           K DISK    USROPN
     F                                     RENAME(DKIHR:DKIHR10)
     FDKIV      IF   E             DISK    USROPN
     FFRISOK    IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D AVD             S              4
     D AVDN            S              4S 0
     D SIGN            S              3
     D OPD             S              7
     D OPDN            S              7S 0
     D REFNR           S             13
     D XREF            S             35
     D DATUM           S              8
     D DATUMN          S              8S 0
     D DATUMT          S              8
     D DATUMTN         S              8S 0
     D STATUS          S              2
     D AVSNAVN         S             35
     D MOTNAVN         S             35
     D AART            S              2
     D FAKT            S             17
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     D STOPP1          S             35
     D STOPP2          S             35
     D STOPP3          S             35
     D STOPP4          S             17
     D ZB              S              1    DIM(35)
     D ZC              S              1    DIM(17)
     d udat1           s              8  0
     d udat2           s              8  0
     d udgr            s              5  0
     d ufunk           s              3
     d wpabrid         s                   like(pabrid)
     d wpakunr         s                   like(pakunr)
     d wpasort         s                   like(pasort)

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬avd¬ : ¬'+%trim(%editc(AVDN:'Z'))+'¬, '
        +'¬sign¬ : ¬'+%trim(SIGN)+'¬, '
        +'¬opd¬ : ¬'+%trim(%editc(OPDN:'Z'))+'¬, '
        +'¬refnr¬ : ¬'+%trim(REFNR)+'¬, '
        +'¬xref¬ : ¬'+%trim(XREF)+'¬, '
        +'¬datum¬ : ¬'+%trim(%editc(DATUMN:'Z'))+'¬, '
        +'¬datumt¬ : ¬'+%trim(%editc(DATUMTN:'Z'))+'¬, '
        +'¬status¬ : ¬'+%trim(STATUS)+'¬, '
        +'¬avsNavn¬ : ¬'+%trim(AVSNAVN)+'¬, '
        +'¬motNavn¬ : ¬'+%trim(MOTNAVN)+'¬, '
        +'¬aart¬ : ¬'+%trim(AART)+'¬, '
        +'¬fakt¬ : ¬'+%trim(FAKT)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"orderList" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Liste Angivelser via hovedopplysningar
      *
     c     Error         ifeq      *blanks
     c     FAKT          IFEQ      *blanks
     C     WSETGT        SETGT     DKIH10
     C                   READP     DKIH10                                 55
     C     *IN55         DOWEQ     '0'

     C                   IF        AVDN > 0
     C     DKIH_SYAV     CABNE     AVDN          HOPP
     C                   ENDIF
     C                   IF        SIGN <> *BLANKS
     C     DKIH_SYSG     CABNE     SIGN          HOPP
     C                   ENDIF
     C                   IF        OPDN > 0
     C     DKIH_SYOP     CABNE     OPDN          HOPP
     C                   ENDIF
     C                   IF        REFNR <> *BLANKS
     C     DKIH_07       CABNE     REFNR         HOPP
     C                   ENDIF
     C                   IF        DATUMN > 0
     C     DKIH_SYDT     CABLT     DATUMN        HOPP
     C                   ENDIF
     C                   IF        DATUMTN > 0
     C     DKIH_SYDT     CABGT     DATUMTN       HOPP
     C                   ENDIF
     C                   IF        STATUS <> *BLANKS
     C     STATUS        IFNE      'b '
     C     DKIH_SYST     CABNE     STATUS        HOPP
     C                   ENDIF
     C     STATUS        IFEQ      'b '
     C     DKIH_SYST     CABNE     *BLANKS       HOPP
     C                   ENDIF
     C                   ENDIF
     C     AVSNAVN       IFNE      *BLANKS
N01  C     DKIH_02B      CABLT     AVSNAVN       HOPP
N01  C     DKIH_02B      CABGT     STOPP1        HOPP
     C                   ENDIF
     C     MOTNAVN       IFNE      *BLANKS
N01  C     DKIH_08B      CABLT     MOTNAVN       HOPP
N01  C     DKIH_08B      CABGT     STOPP2        HOPP
     C                   ENDIF
     C     AART          IFNE      *BLANKS
N01  C     DKIH_AART     CABNE     AART          HOPP
     C                   ENDIF
     C     FRIKEY2       CHAIN     FRISOK                             21
     C   21              EVAL      FSSOK=*BLANKS
     C     XREF          IFNE      *BLANKS
     C*    FRIKEY        CHAIN     FRISOK                             21
N01  C*    *IN21         CABEQ     *ON           HOPP
N01  C     FSSOK         CABLT     XREF          HOPP
N01  C     FSSOK         CABGT     STOPP3        HOPP
     C                   ENDIF

     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬avd¬ : ¬'+%trim(%editc(DKIH_SYAV:'Z'))+'¬, '
          +'¬opd¬ : ¬'+%trim(%editc(DKIH_SYOP:'Z'))+'¬, '
          +'¬tst¬ : ¬'+%trim(DKIH_0035)+'¬, '
          +'¬refnr¬ : ¬'+%trim(DKIH_07)+'¬, '
          +'¬dkih_xref¬ : ¬'+%trim(FSSOK)+'¬, '
          +'¬aart¬ : ¬'+%trim(DKIH_AART)+'¬, '
          +'¬sign¬ : ¬'+%trim(DKIH_SYSG)+'¬, '
          +'¬datum¬ : ¬'+%trim(%editc(DKIH_SYDT:'Z'))+'¬, '
          +'¬status¬ : ¬'+%trim(DKIH_SYST)+'¬, '
          +'¬avsNavn¬ : ¬'+%trim(DKIH_02B)+'¬, '
          +'¬motNavn¬ : ¬'+%trim(DKIH_08B)+'¬, '
          +'¬godsnr¬ : ¬'+%trim(DKIH_49)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

     C     HOPP          TAG

     C                   READP     DKIH10                                 55
     C                   ENDDO
     c                   endif
      *
      * Liste Angivelser via vareposter
      *
     C     FAKT          IFNE      *BLANKS
     C                   EXSR      LESVARE
     c                   endif
     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C                   CLOSE     BRPARF
     C  N50              CLOSE     DKIH
     C  N50              CLOSE     DKIH10
     C  N50              CLOSE     FRISOK
     C  N50              CLOSE     DKIV

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      AVD     = zhbgetvar('AVD')
     C                   eval      AVDN    = c2n2(AVD)
     C                   EVAL      SIGN    = zhbgetvar('SIGN')
     C                   EVAL      OPD     = zhbgetvar('OPD')
     C                   EVAL      OPDN    = c2n2(OPD)
     C                   EVAL      REFNR   = zhbgetvar('REFNR')
     C                   EVAL      XREF    = zhbgetvar('XREF')
     C                   EVAL      DATUM   = zhbgetvar('DATUM')
     C                   EVAL      DATUMN  = c2n2(DATUM)
     C                   EVAL      DATUMT  = zhbgetvar('DATUMT')
     C                   EVAL      DATUMTN = c2n2(DATUMT)
     C                   EVAL      STATUS  = zhbgetvar('STATUS')
     C                   EVAL      AVSNAVN = zhbgetvar('AVSNAVN')
     C                   EVAL      MOTNAVN = zhbgetvar('MOTNAVN')
     C                   EVAL      AART    = zhbgetvar('AART')
     C                   EVAL      FAKT    = zhbgetvar('FAKT')
      * Er dato= blank eller 0, sett  da dato 14 dager tilbake
S01  C*                  OPEN      BRPARF
S01  C*                  IF        OPDN = *ZEROS
S01  C*                  IF        REFNR = *BLANKS
S01  C*                  IF        FAKT  = *BLANKS
S01  C*                  IF        DATUMN = *ZEROS
S01
S01   /free
S01
S01   //   wpabrid=wsuser;
S01   //   wpakunr=0;
S01   //   wpasort=0;
S01   //   chain (WPABRID: WPAKUNR: 'DFTDG': WPASORT) BRPARF;
S01   //   if not %found or pavrdn = 0;
S01   //      pavrdn=7;
S01   //   endif;
S01
S01   /end-free
S01
S01  C*                  CALL      'SYGE20'
S01  C*                  PARM      'SUB'         UFUNK
S01  C*                  PARM      DATUMN        UDAT1
S01  C*                  PARM                    UDAT2
S01  C*                  PARM      PAVRDN        UDGR
S01  C*                  EVAL      DATUMN=UDAT2
S01  C*                  ENDIF
S01  C*                  ENDIF
S01  C*                  ENDIF
S01  C*                  ENDIF
      * Sett stop søking alfa
     C                   MOVEA     AVSNAVN       ZB
     C     ZB(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        35            ZAX               2 0
     C     36            SUB       ZAX           WAX               2 0
     C     ZB(WAX)       CABNE     *BLANKS       SRB3
     C                   MOVE      '9'           ZB(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB3          TAG
     C                   MOVEA     ZB            STOPP1
      * Sett stop søking alfa
     C                   MOVEA     *BLANKS       ZB
     C                   MOVEA     MOTNAVN       ZB
     C     ZB(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        35            ZAX               2 0
     C     36            SUB       ZAX           WAX               2 0
     C     ZB(WAX)       CABNE     *BLANKS       SRB4
     C                   MOVE      '9'           ZB(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB4          TAG
     C                   MOVEA     ZB            STOPP2
      * Sett stop søking alfa
     C                   MOVEA     *BLANKS       ZB
     C                   MOVEA     XREF          ZB
     C     ZB(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        35            ZAX               2 0
     C     36            SUB       ZAX           WAX               2 0
     C     ZB(WAX)       CABNE     *BLANKS       SRB5
     C                   MOVE      '9'           ZB(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB5          TAG
     C                   MOVEA     ZB            STOPP3
      * Sett stop søking alfa
     C                   MOVEA     *BLANKS       ZC
     C                   MOVEA     FAKT          ZC
     C     ZC(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        17            ZAX               2 0
     C     18            SUB       ZAX           WAX               2 0
     C     ZC(WAX)       CABNE     *BLANKS       SRB6
     C                   MOVE      '9'           ZC(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB6          TAG
     C                   MOVEA     ZC            STOPP4
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C     FRIKEY        klist
     C                   kfld                    DKIH_SYAV
     C                   kfld                    DKIH_SYOP
     C                   kfld                    WFSKODE           3
     C                   kfld                    XREF
     C     FRIKEY2       klist
     C                   kfld                    DKIH_SYAV
     C                   kfld                    DKIH_SYOP
     C                   kfld                    WFSKODE
     C     DKIHKEY       klist
     C                   kfld                    DKIV_SYAV
     C                   kfld                    DKIV_SYOP
     C                   EVAL      WFSKODE='*CR'

     C     *LIKE         DEFINE    DKIH_SYDT     WSETGT
     C                   EVAL      WSETGT = 20991231

     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      DKIH
     C  N50              OPEN      DKIH10
     C  N50              OPEN      FRISOK
     C  N50              OPEN      DKIV
N01  C  N50              OPEN      BRPARF
N01   * Er dato= blank eller 0, sett  da dato 14 dager tilbake
N01  C  N50              IF        OPDN = *ZEROS
N01  C                   IF        REFNR = *BLANKS
N01  C                   IF        FAKT  = *BLANKS
N01  C                   IF        DATUMN = *ZEROS
N01
N01   /free
N01
N01        wpabrid=wsuser;
N01        wpakunr=0;
N01        wpasort=0;
N01        chain (WPABRID: WPAKUNR: 'DFTDG': WPASORT) BRPARF;
N01        if not %found or pavrdn = 0;
N01           pavrdn=7;
N01        endif;
N01
N01   /end-free
N01
N01  C                   CALL      'SYGE20'
N01  C                   PARM      'SUB'         UFUNK
N01  C                   PARM      DATUMN        UDAT1
N01  C                   PARM                    UDAT2
N01  C                   PARM      PAVRDN        UDGR
N01  C                   EVAL      DATUMN=UDAT2
N01  C                   ENDIF
N01  C                   ENDIF
N01  C                   ENDIF
N01  C                   ENDIF

     c                   endsr
      *********************************************************
     C     LESVARE       BEGSR
      *********************************************************
     C     *LIKE         DEFINE    DKIV_SYOP     WSYOP
     C                   EVAL      WSYOP=*ZEROS
     C                   READ      DKIV                                   56
     C     *IN56         DOWEQ     '0'

     C     DKIV_SYOP     CABEQ     WSYOP         HOPP2

     C     DKIHKEY       CHAIN     DKIH                               57
     C                   IF        *IN57=*OFF
     C                   IF        AVDN > 0
     C     DKIH_SYAV     CABNE     AVDN          HOPP2
     C                   ENDIF
     C                   IF        SIGN <> *BLANKS
     C     DKIH_SYSG     CABNE     SIGN          HOPP2
     C                   ENDIF
     C                   IF        OPDN > 0
     C     DKIH_SYOP     CABNE     OPDN          HOPP2
     C                   ENDIF
     C                   IF        REFNR <> *BLANKS
     C     DKIH_07       CABNE     REFNR         HOPP2
     C                   ENDIF
     C                   IF        DATUMN > 0
     C     DKIH_SYDT     CABLT     DATUMN        HOPP2
     C                   ENDIF
     C                   IF        STATUS <> *BLANKS
     C     STATUS        IFNE      'b '
     C     DKIH_SYST     CABNE     STATUS        HOPP2
     C                   ENDIF
     C     STATUS        IFEQ      'b '
     C     DKIH_SYST     CABNE     *BLANKS       HOPP2
     C                   ENDIF
     C                   ENDIF
     C     AVSNAVN       IFNE      *BLANKS
N01  C     DKIH_02B      CABLT     AVSNAVN       HOPP2
N01  C     DKIH_02B      CABGT     STOPP1        HOPP2
     C                   ENDIF
     C     MOTNAVN       IFNE      *BLANKS
N01  C     DKIH_08B      CABLT     MOTNAVN       HOPP2
N01  C     DKIH_08B      CABGT     STOPP2        HOPP2
     C                   ENDIF
N01  C     DKIV_28B      CABLT     FAKT          HOPP3
N01  C     DKIV_28B      CABGT     STOPP4        HOPP3
     C                   GOTO      HOPP4
     C     HOPP3         TAG
     C                   MOVEL     DKIV_446TA    W17              17
N01  C     W17           CABLT     FAKT          HOPP2
N01  C     W17           CABGT     STOPP4        HOPP2
     C     HOPP4         TAG
     C     AART          IFNE      *BLANKS
N01  C     DKIH_AART     CABNE     AART          HOPP2
     C                   ENDIF
     C     FRIKEY2       CHAIN     FRISOK                             21
     C   21              EVAL      FSSOK=*BLANKS
     C     XREF          IFNE      *BLANKS
N01  C     FSSOK         CABLT     XREF          HOPP2
N01  C     FSSOK         CABGT     STOPP3        HOPP2
     C                   ENDIF

     C                   EVAL      WSYOP=DKIV_SYOP
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬avd¬ : ¬'+%trim(%editc(DKIH_SYAV:'Z'))+'¬, '
          +'¬opd¬ : ¬'+%trim(%editc(DKIH_SYOP:'Z'))+'¬, '
          +'¬tst¬ : ¬'+%trim(DKIH_0035)+'¬, '
          +'¬refnr¬ : ¬'+%trim(DKIH_07)+'¬, '
          +'¬dkih_xref¬ : ¬'+%trim(FSSOK)+'¬, '
          +'¬aart¬ : ¬'+%trim(DKIH_AART)+'¬, '
          +'¬sign¬ : ¬'+%trim(DKIH_SYSG)+'¬, '
          +'¬datum¬ : ¬'+%trim(%editc(DKIH_SYDT:'Z'))+'¬, '
          +'¬status¬ : ¬'+%trim(DKIH_SYST)+'¬, '
          +'¬avsNavn¬ : ¬'+%trim(DKIH_02B)+'¬, '
          +'¬motNavn¬ : ¬'+%trim(DKIH_08B)+'¬, '
          +'¬godsnr¬ : ¬'+%trim(DKIH_49)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

     C     HOPP2         TAG

     C                   ENDIF
     C                   READ      DKIV                                   56
     C                   ENDDO
     C                   ENDSR
