********************************************************************
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      * program som slår sammen PDF'er
      *
********************************************************************
      *
     D                 DS
     D  data                   1   6400
     D  dta                    1   6400
     D                                     DIM(80)
     C*
     c                   eval      dokmrg='/home/cb/ab.pdf'
     c                   eval      dta(1)='/home/cb/a.pdf'
     c                   eval      dta(2)='/home/cb/b.pdf'
     c                   call      'SYGE123'
     c                   PARM                    UUNIK            11
     C                   PARM                    DOKMRG           40
     c                   parm                    data
     c     slutt         tag
     c                   seton                                        lr
     c                   return
      *
