     FHETRIU    IF   E           K DISK
N19  FKOSBU     IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4 0
     C                   PARM                    UUOPD             7 0          mor-oppdraget
     C                   PARM                    UUSLAG            2            FF / VF
      * RETUR-PARAMETRE
     C                   PARM                    wsBiln
     C                   PARM                    wsTran
     C                   PARM                    wsftx
     C                   PARM                    wsBel
     C                   PARM                    wsKoAE
      *
     C     TRIKEY        KLIST
     C                   KFLD                    UUAVD
     C                   KFLD                    UUOPD
     C                   KFLD                    UUSLAG
      * hent aktuell rekv.
     C     TRIKEY        CHAIN     HETRIU                             34
     C     *IN34         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN     KOSBU
     C                   if        %found
     C                   MOVE      BUBILN        wsBiln           10
     C                   MOVE      BUTNR         wsTran            8 0
     C                   z-add     BUBL          wsBel            13 2
     C                   MOVE      BUTYPE        wsKoAE            1
     C                   MOVE      BUTXT         wsftx            35
     C                   endif
     C                   endif
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      *
