N19  FHEADF     IF   E           K DISK
N19  FFAKT      IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4 0
     C                   PARM                    UUOPD             7 0
      * RETUR-PARAMETRE
     C                   PARM                    HELKA
     C                   PARM                    HESDF
     C                   PARM                    TRSDFD
     C                   PARM                    TRSDFK
     C                   PARM                    HETRI
     C                   PARM                    HESDT
     C                   PARM                    TRSDTD
     C                   PARM                    TRSDTK
     C                   PARM                    HEOT
     C                   PARM                    HEFR
     C                   PARM                    HEUR
     C                   PARM                    HEKDPL
     C                   PARM                    HEPRO
     C                   PARM                    WSbel
     C                   PARM                    WSFRAK
      *
     C     HEADFK        KLIST
     C                   KFLD                    UUAVD
     C                   KFLD                    UUOPD
      *
     C     HEADFK        CHAIN     HEADF                              31
     c                   move      TRFRAK        WSFRAK            1
      *
     C                   MOVE      *ZEROS        WSbel            13 2
     C     HEADFK        SETLL     FAKT
     C     HEADFK        READE     FAKT                                   31
     C     *IN31         DOWEQ     '0'
      * Hent alle I-linjer fra oppdraget, untatt statistiske MOT-linjer
     C     FASK          IFEQ      'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSbel
     C                   END
     C     HEADFK        READE     FAKT                                   31
     C                   ENDDO
      *
     C     HEUR          IFNE      'H'
     C                   MOVE      *ZEROS        WSbel
     C                   ENDIF
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      *
