     FSAEHEUR   IF   E           K DISK
     FKODTS2    IF   E           K DISK
     FTNOE095P  O    E             PRINTER usropn
     D AVD             S              4
     D AVDN            S              4S 0
     D OPD             S              7
     D OPDN            S              7  0
     d wcmd            s             46
N06  D RunCmd          PR                  EXTPGM('QCMDEXC')
N06  D  Cmd                         200A   CONST
N06  D  Len                          15P 5 CONST
     C                   EXSR      INIT
     C                   EXSR      SRA
     C                   EVAL      *INLR=*ON
      *________________________________________________
      * Init                                       Init
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     INIT          BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    AVD
     C                   PARM                    OPD
     C                   MOVEL     AVD           AVDN
     C                   MOVEL     OPD           OPDN
     C     SAEKEY        KLIST
     C                   KFLD                    AVDN
     C                   KFLD                    OPDN
     C     KODTS2KEY     KLIST
     C                   KFLD                    WKS2UNI
     C                   KFLD                    WKS2LK
     C     *LIKE         DEFINE    KS2UNI        WKS2UNI
     C     *LIKE         DEFINE    KS2LK         WKS2LK
     C                   EVAL      WKS2UNI='S2'
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   ENDSR
      *________________________________________________
      * Hoved                                       SRA
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
      /free
       monitor;
       wcmd = *blanks;
       wcmd = 'RMVLNK OBJLNK(' + wapstr
             + '/syspeddev/temp/eur1.pdf' +wapstr
             + ')';
       runcmd(wcmd:46);
       on-error;
       endmon;
      /end-free
     C                   open      tnoe095p
     C     SAEKEY        CHAIN     SAEHEUR
     C                   IF        EUR084A <> *BLANKS
     C                   EVAL      EUR080A = 1
     C                   ENDIF
     C                   IF        EUR084B <> *BLANKS
     C                   EVAL      EUR080B = 2
     C                   ENDIF
     C                   IF        EUR084C <> *BLANKS
     C                   EVAL      EUR080C = 3
     C                   ENDIF
     C                   IF        EUR084D <> *BLANKS
     C                   EVAL      EUR080D = 4
     C                   ENDIF
     C                   IF        EUR084E <> *BLANKS
     C                   EVAL      EUR080E = 5
     C                   ENDIF
     C                   IF        EUR084F <> *BLANKS
     C                   EVAL      EUR080F = 6
     C                   ENDIF
     C                   IF        EUR084G <> *BLANKS
     C                   EVAL      EUR080G = 7
     C                   ENDIF
     C                   IF        EUR084H <> *BLANKS
     C                   EVAL      EUR080H = 8
     C                   ENDIF
     C                   IF        EUR084I <> *BLANKS
     C                   EVAL      EUR080I = 9
     C                   ENDIF
      * Hent navn til landekoder
     C                   EVAL      WKS2LK=EUR04
     C     KODTS2KEY     CHAIN     KODTS2
     C                   IF        %FOUND(KODTS2)
     C                   MOVEL     KS2FTX        EUR04TX
     C                   ENDIF
     C                   EVAL      WKS2LK=EUR05
     C     KODTS2KEY     CHAIN     KODTS2
     C                   IF        %FOUND(KODTS2)
     C                   MOVEL     KS2FTX        EUR05TX
     C                   ENDIF
     C                   WRITE     TNOE095P1
     C                   ENDSR
