     FSAEH      IF   E           K DISK
     FSAEF      IF   E           K DISK
     FSAEV      IF   E           K DISK
     FSAEHEUR   O  A E             DISK
     C                   EXSR      INIT
     C                   EXSR      SRA
     C                   EVAL      *INLR=*ON
      *________________________________________________
      * Init                                       Init
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     INIT          BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    AVDN              4 0
     C                   PARM                    OPDN              7 0
     C     SAEKEY        KLIST
     C                   KFLD                    AVDN
     C                   KFLD                    OPDN
     C                   ENDSR
      *________________________________________________
      * Hoved                                       SRA
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
     C     SAEKEY        CHAIN     SAEH
     C                   CLEAR                   SAEHEURR
     C                   EVAL      EURAVD=SEAVD
     C                   EVAL      EURTDN=SETDN
     C                   EVAL      EUR03A=SENAS
     C                   EVAL      EUR03B=SEADS1
     C                   EVAL      EUR03C=SEADS2
     C                   EVAL      EUR03D=SEADS3
     C                   EVAL      EUR01A=SENAK
     C                   EVAL      EUR01B=SEADK1
     C                   EVAL      EUR01C=SEADK2
     C                   EVAL      EUR01D=SEADK3
     C                   EVAL      EUR04=SELKA
     C                   EVAL      EUR05=SELKB
     C                   EVAL      EUR06A=SETRM
     C                   EVAL      EUR06B=SETRID
     C                   EVAL      EUR06C=SELKT
     C                   EVAL      EUR10A=SEFIF
     C                   EVAL      EUR12A=SEDST
     C                   EVAL      EUR12B=SEDT
     C                   EVAL      EUR12C=SETARF
     C                   EXSR      SRAA
     C                   EXSR      SRAB
     C                   WRITE     SAEHEURR
     C                   ENDSR
      *________________________________________________
      * Fakturar                                   SRAA
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRAA          BEGSR
     C     SAEKEY        SETLL     SAEF
     C     SAEKEY        READE     SAEF                                   53
     C     *IN53         DOWEQ     *OFF
     C                   SELECT

     C                   WHEN      EUR10A=*BLANKS
     C                   EVAL      EUR10A=SFTXT

     C                   WHEN      EUR10B=*BLANKS
     C                   EVAL      EUR10B=SFTXT

     C                   WHEN      EUR10C=*BLANKS
     C                   EVAL      EUR10C=SFTXT

     C                   WHEN      EUR10D=*BLANKS
     C                   EVAL      EUR10D=SFTXT

     C                   WHEN      EUR10E=*BLANKS
     C                   EVAL      EUR10E=SFTXT

     C                   WHEN      EUR10F=*BLANKS
     C                   EVAL      EUR10F=SFTXT

     C                   WHEN      EUR10G=*BLANKS
     C                   EVAL      EUR10G=SFTXT

     C                   WHEN      EUR10H=*BLANKS
     C                   EVAL      EUR10H=SFTXT

     C                   WHEN      EUR10I=*BLANKS
     C                   EVAL      EUR10I=SFTXT

     C                   ENDSL
     C     SAEKEY        READE     SAEF                                   53
     C                   ENDDO
     C                   ENDSR
      *________________________________________________
      * Vareposter                                 SRAB
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRAB          BEGSR
     C     SAEKEY        SETLL     SAEV
     C     SAEKEY        READE     SAEV                                   52
     C     *IN52         DOWEQ     *OFF
     C                   SELECT

     C                   WHEN      EUR081A=*BLANKS
     C                   EVAL      EUR081A=SVFT01
     C                   EVAL      EUR082A=SVNT01
     C                   EVAL      EUR083A=SVEH01
     C                   EVAL      EUR084A=SVVT01
     C                   EVAL      EUR09A=SVVKTB

     C                   WHEN      EUR081B=*BLANKS
     C                   EVAL      EUR081B=SVFT01
     C                   EVAL      EUR082B=SVNT01
     C                   EVAL      EUR083B=SVEH01
     C                   EVAL      EUR084B=SVVT01
     C                   EVAL      EUR09B=SVVKTB

     C                   WHEN      EUR081C=*BLANKS
     C                   EVAL      EUR081C=SVFT01
     C                   EVAL      EUR082C=SVNT01
     C                   EVAL      EUR083C=SVEH01
     C                   EVAL      EUR084C=SVVT01
     C                   EVAL      EUR09C=SVVKTB

     C                   WHEN      EUR081D=*BLANKS
     C                   EVAL      EUR081D=SVFT01
     C                   EVAL      EUR082D=SVNT01
     C                   EVAL      EUR083D=SVEH01
     C                   EVAL      EUR084D=SVVT01
     C                   EVAL      EUR09D=SVVKTB

     C                   WHEN      EUR081E=*BLANKS
     C                   EVAL      EUR081E=SVFT01
     C                   EVAL      EUR082E=SVNT01
     C                   EVAL      EUR083E=SVEH01
     C                   EVAL      EUR084E=SVVT01
     C                   EVAL      EUR09E=SVVKTB

     C                   WHEN      EUR081F=*BLANKS
     C                   EVAL      EUR081F=SVFT01
     C                   EVAL      EUR082F=SVNT01
     C                   EVAL      EUR083F=SVEH01
     C                   EVAL      EUR084F=SVVT01
     C                   EVAL      EUR09F=SVVKTB

     C                   WHEN      EUR081G=*BLANKS
     C                   EVAL      EUR081G=SVFT01
     C                   EVAL      EUR082G=SVNT01
     C                   EVAL      EUR083G=SVEH01
     C                   EVAL      EUR084G=SVVT01
     C                   EVAL      EUR09G=SVVKTB

     C                   WHEN      EUR081H=*BLANKS
     C                   EVAL      EUR081H=SVFT01
     C                   EVAL      EUR082H=SVNT01
     C                   EVAL      EUR083H=SVEH01
     C                   EVAL      EUR084H=SVVT01
     C                   EVAL      EUR09H=SVVKTB

     C                   WHEN      EUR081I=*BLANKS
     C                   EVAL      EUR081I=SVFT01
     C                   EVAL      EUR082I=SVNT01
     C                   EVAL      EUR083I=SVEH01
     C                   EVAL      EUR084I=SVVT01
     C                   EVAL      EUR09I=SVVKTB
     C                   ENDSL
     C     SAEKEY        READE     SAEV                                   52
     C                   ENDDO
     C                   ENDSR
