      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TNOG006R MODULE(*LIBL/TNOG006R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FTARI      IF   E           K DISK    USROPN
     FSOKTARI2  IF   E           K DISK    USROPN
     FKODTS2    IF   E           K DISK    USROPN
     FSADAVGE   IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D WIE             S              1
     D WKOD            S              8
     D WKODN           S              8S 0
     D STOPP           S              8
     D STOPPN          S              8S 0
     D START           S              8
     D STARTN          S              8S 0
     D WSELKB          S              2
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     D ZB              S              1    DIM(10)
     D                 DS
     D  TATANR                 1      8S 0
     D  TATANRA                1      8

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¨user¨ : ¨'+%trim(WSUSER)+'¨, '
        +'¨ie¨ : ¨'+%trim(WIE)+'¨, '
        +'¨kod¨ : ¨'+%trim(WKOD)+'¨, '
        +'¨errMsg¨ : ¨'+%trim(Error)+'¨, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter Â bytte ¨->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"tariclist" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * HÊmta varukod/varukoder
      *
     c     Error         ifeq      *blanks
     C     KEY1          SETLL     TARI
     C                   READ      TARI                                   55
N01  C  N55TATANR        CABGT     STOPPN        UTLES
     C     *IN55         DOWEQ     *OFF

     C                   IF        TADTS=*ZEROS
     C                   EVAL      TADTS=99999999
     C                   ENDIF
     C     TADTS         IFGE      WDTN
     C     TADATO        ANDLE     WDTN

     C     TATANR        CHAIN     SOKTARI2                           56
     C   56              EVAL      BESKR1=*BLANKS
     C   56              EVAL      BESKR1=TAALFA
     C                   EXSR      FFAVG

     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma f¯r hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¨tatanr¨ : ¨'+%trim(TATANRA)+'¨, '
          +'¨taordk¨ : ¨'+%trim(TAORDK)+'¨, '
          +'¨taordb¨ : ¨'+%trim(%editc(TAORDB:'4'))+'¨, '
          +'¨taeftk¨ : ¨'+%trim(TAEFTK)+'¨, '
          +'¨taeftb¨ : ¨'+%trim(%editc(TAEFTB:'4'))+'¨, '
          +'¨taefk¨ : ¨'+%trim( TAEFK)+'¨, '
          +'¨taefb¨ : ¨'+%trim(%editc(TAEFB:'4'))+'¨, '
          +'¨tatxt¨ : ¨'+%trim(tatxt)+'¨, '
          +'¨taalfa¨ : ¨'+%trim(taalfa)+'¨, '
          +'¨beskr1¨ : ¨'+%trim(BESKR1)+'¨, '
          +'¨tastk¨ : ¨'+%trim(tastk)+'¨, '
          +'¨takap¨ : ¨'+%trim(takap)+'¨, '
          +'¨takapa¨ : ¨'+%trim(takapa)+'¨, '
          +'¨taenhe¨ : ¨'+%trim(taenhe)+'¨, '
          +'¨tarest¨ : ¨'+%trim(tarest)+'¨, '
          +'¨takdaa¨ : ¨'+%trim(TAKDA∆)+'¨, '
          +'¨takdsa¨ : ¨'+%trim(takds∆)+'¨, '
          +'¨taeosb¨ : ¨'+%trim(%editc(taeÿsb:'4'))+'¨, '
          +'¨taeosk¨ : ¨'+%trim(taeÿsk)+'¨, '
          +'¨tatsjb¨ : ¨'+%trim(%editc(tatsjb:'4'))+'¨, '
          +'¨tatsjk¨ : ¨'+%trim(tatsjk)+'¨, '
          +'¨tatyrb¨ : ¨'+%trim(%editc(tatyrb:'4'))+'¨, '
          +'¨tatyrk¨ : ¨'+%trim(tatyrk)+'¨, '
          +'¨taisrb¨ : ¨'+%trim(%editc(taisrb:'4'))+'¨, '
          +'¨taisrk¨ : ¨'+%trim(taisrk)+'¨, '
          +'¨taellb¨ : ¨'+%trim(%editc(taellb:'4'))+'¨, '
          +'¨taellk¨ : ¨'+%trim(taellk)+'¨, '
          +'¨tabulb¨ : ¨'+%trim(%editc(tabulb:'4'))+'¨, '
          +'¨tabulk¨ : ¨'+%trim(tabulk)+'¨, '
          +'¨tapolb¨ : ¨'+%trim(%editc(tapolb:'4'))+'¨, '
          +'¨tapolk¨ : ¨'+%trim(tapolk)+'¨, '
          +'¨taromb¨ : ¨'+%trim(%editc(taromb:'4'))+'¨, '
          +'¨taromk¨ : ¨'+%trim(taromk)+'¨, '
          +'¨taungb¨ : ¨'+%trim(%editc(taungb:'4'))+'¨, '
          +'¨taungk¨ : ¨'+%trim(taungk)+'¨, '
          +'¨taslob¨ : ¨'+%trim(%editc(taslob:'4'))+'¨, '
          +'¨taslok¨ : ¨'+%trim(taslok)+'¨, '
          +'¨tamulb¨ : ¨'+%trim(%editc(tamulb:'4'))+'¨, '
          +'¨tamulk¨ : ¨'+%trim(tamulk)+'¨, '
          +'¨taoulb¨ : ¨'+%trim(%editc(taoulb:'4'))+'¨, '
          +'¨taoulk¨ : ¨'+%trim(taoulk)+'¨, '
          +'¨tagrlb¨ : ¨'+%trim(%editc(tagrlb:'4'))+'¨, '
          +'¨tagrlk¨ : ¨'+%trim(tagrlk)+'¨, '
          +'¨tafÊrb¨ : ¨'+%trim(%editc(taf∆rb:'4'))+'¨, '
          +'¨tafÊrk¨ : ¨'+%trim(taf∆rk)+'¨, '
          +'¨taistb¨ : ¨'+%trim(%editc(taistb:'4'))+'¨, '
          +'¨taistk¨ : ¨'+%trim(taistk)+'¨, '
          +'¨tamarb¨ : ¨'+%trim(%editc(tamarb:'4'))+'¨, '
          +'¨tamark¨ : ¨'+%trim(tamark)+'¨, '
          +'¨tamexb¨ : ¨'+%trim(%editc(tamexb:'4'))+'¨, '
          +'¨tamexk¨ : ¨'+%trim(tamexk)+'¨, '
          +'¨tavgab¨ : ¨'+%trim(%editc(tavgab:'4'))+'¨, '
          +'¨tavgak¨ : ¨'+%trim(tavgak)+'¨, '
          +'¨ffsvavt¨ : ¨'+%trim(ffsvavt)+'¨, '
          +'¨ffsvavts¨ : ¨'+%trim(ffsvavts)+'¨, '
          +'¨ffsvavtp¨ : ¨'+%trim(%editc(ffsvavtp:'4'))+'¨}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

     C                   ENDIF

     C                   READ      TARI                                   55
N01  C  N55TATANR        CABGT     STOPPN        UTLES
     C                   ENDDO
     C     UTLES         TAG
     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     TARI
     C  N50              CLOSE     SOKTARI2
     C  N50              CLOSE     SADAVGE
     C  N50              CLOSE     KODTS2

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      WIE = zhbgetvar('IE')
     C                   EVAL      WKOD = zhbgetvar('KOD')
     C                   MOVEA     WKOD          ZB
     C                   EVAL      WSELKB = zhbgetvar('SELKB')
     C     ZB(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        8             ZAX               2 0
     C     9             SUB       ZAX           WAX               2 0
     C     ZB(WAX)       CABNE     ' '           SRB3
     C                   MOVE      '9'           ZB(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB3          TAG
     C                   MOVEA     ZB            STOPP
     C                   MOVE      STOPP         STOPPN
      * fix start
     C                   MOVEA     *BLANKS       ZB
     C                   MOVEA     WKOD          ZB
     C     ZB(1)         IFNE      ' '
     C                   Z-ADD     0             ZAX               2 0
     C     1             DO        8             ZAX               2 0
     C     9             SUB       ZAX           WAX               2 0
     C     ZB(WAX)       CABNE     ' '           SRB4
     C                   MOVE      '0'           ZB(WAX)
     C                   ENDDO
     C                   ENDIF
     C     SRB4          TAG
     C                   MOVEA     ZB            START
     C                   MOVE      START         STARTN
     C
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C                   MOVE      *BLANKS       FFSVAVT           1
     C                   MOVE      *BLANKS       FFSVAVTS          3
     C                   MOVE      *ZEROS        FFSVAVTP          7 3
     C     *LIKE         DEFINE    KS2UNI        WKS2UNI

     C                   EVAL      WKS2UNI='S2 '

     C     KEY1          KLIST
     C                   KFLD                    STARTN
     C     KODS2K        KLIST
     C                   KFLD                    WKS2UNI
     C                   KFLD                    WSELKB

     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      TARI
     C  N50              OPEN      SOKTARI2
     C  N50              OPEN      SADAVGE
     C  N50              OPEN      KODTS2
      *_________________________________
      * HÊmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDTN              8 0

     c                   endsr
      *_______________________________________________________
      * Fiskeavgift ?                                    FFAVG
      ********************************************************
     C     FFAVG         BEGSR

     C                   IF        WIE='E'

     C                   EVAL      FFSVAVT=*BLANKS
     C                   EVAL      FFSVAVTS=*BLANKS
     C                   EVAL      FFSVAVTP=*ZEROS

     C     KODS2K        CHAIN     KODTS2                             33
     C                   IF        *IN33=*OFF

     C     TATANR        SETLL     SADAVGE
     C     TATANR        READE     SADAVGE                                33
     C     *IN33         DOWEQ     *OFF

     C     AGAKTK        IFNE      'I'
     C     AGDTF         ANDLT     WDTN
     C     AGDTT         ANDGE     WDTN

     C                   EVAL      FFSVAVT='X'
     C                   EVAL      FFSVAVTS=AGSKV
     C                   EVAL      FFSVAVTP=AGSATS

     C     AGKD          IFEQ      KS2PRE
     C                   LEAVE
     C                   ENDIF

     C                   ENDIF

     C     TATANR        READE     SADAVGE                                33
     C                   ENDDO

     C                   ENDIF
     C                   ENDIF
     c                   ENDSR
