********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 Vis deklarantnr
      *********************************************************************
      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TNOI015R MODULE(*LIBL/TNOI015R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FEDIM2     IF   E           K DISK    USROPN
     FEDIM      IF   E           K DISK    USROPN
     F                                     RENAME(EDIMR:EDIMR0)
     FTVINF     IF   E           K DISK    USROPN
     FEDIS      IF   E           K DISK    USROPN
     FEDISX     IF   E           K DISK    USROPN
N01  FTRIH      IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D SYAVA           S              4
     D SYAV            S              4  0
     D SYOPA           S              7
     D SYOP            S              7  0
     D TYP             S              3
     D JSONstring      S          32000
     D Error           S            150
     D AntLest         S              9  0
     D WURL            S            512
     D WTXT            S            360
     D WMORE           S              1
N01  D X_DEKL          S              9

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬avd¬ : ¬'+%trim(%editc(SYAV:'Z'))+'¬, '
        +'¬opd¬ : ¬'+%trim(%editc(SYOP:'M'))+'¬, '
        +'¬typ¬ : ¬'+%trim(TYP)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"logg" : ['
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Liste Ærende
      *
     c     Error         ifeq      *blanks
     C     KEYA          SETLL     EDIM2
     C     SRB2          TAG
     C     KEYA1         READE     EDIM2                                  55
     C     *IN55         DOWEQ     '0'
     C     TYP           IFNE      *BLANKS
     C     M1N07         IFNE      TYP
     C                   GOTO      SRB2
     C                   ENDIF
     C                   ENDIF
     C                   EXSR      SRBB
     C                   EXSR      SRBC
N01  C                   EXSR      SRBD
     C                   MOVE      MTM           WMTM              6
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬mavd¬ : ¬'+%trim(%editc(MAVD:'Z'))+'¬, '
          +'¬mtdn¬ : ¬'+%trim(%editc(MTDN:'M'))+'¬, '
          +'¬msn¬ : ¬'+%trim(%editc(MSN:'Z'))+'¬, '
          +'¬mmn¬ : ¬'+%trim(%editc(MMN:'Z'))+'¬, '
          +'¬msr¬ : ¬'+%trim(MSR)+'¬, '
          +'¬m0004¬ : ¬'+%trim(M0004)+'¬, '
          +'¬m0010¬ : ¬'+%trim(M0010)+'¬, '
          +'¬mven¬ : ¬'+%trim(MVEN)+'¬, '
          +'¬m0068¬ : ¬'+%trim(M0068)+'¬, '
          +'¬m0035¬ : ¬'+%trim(M0035)+'¬, '
          +'¬m0065¬ : ¬'+%trim(M0065)+'¬, '
          +'¬m1225¬ : ¬'+%trim(M1225)+'¬, '
          +'¬m1n07¬ : ¬'+%trim(M1N07)+'¬, '
          +'¬m0068a¬ : ¬'+%trim(%editc(M0068A:'Z'))+'¬, '
          +'¬m0068b¬ : ¬'+%trim(%editc(M0068B:'Z'))+'¬, '
          +'¬m0068c¬ : ¬'+%trim(%editc(M0068C:'Z'))+'¬, '
          +'¬m3039e¬ : ¬'+%trim(%editc(M3039E:'X'))+'¬, '
          +'¬mst¬ : ¬'+%trim(MST)+'¬, '
          +'¬mdt¬ : ¬'+%trim(%editc(MDT:'Z'))+'¬, '
          +'¬mtm¬ : ¬'+%trim(WMTM)+'¬, '
N01       +'¬deklarant¬ : ¬'+%trim(X_DEKL)+'¬, '
          +'¬wtxt¬ : ¬'+%trim(WTXT)+'¬, '
          +'¬wmore¬ : ¬'+%trim(WMORE)+'¬, '
          +'¬wurl¬ : ¬'+%trim(WURL)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
     C     KEYA1         READE     EDIM2                                  55
     C                   ENDDO
      * + ev. omberegning
     C                   Z-SUB     SYOP          SYOP
     C                   EVAL      *IN55=*OFF
     C     KEYA          SETLL     EDIM2
     C     SRB2O         TAG
     C     KEYA1         READE     EDIM2                                  55
     C     *IN55         DOWEQ     '0'
     C     TYP           IFNE      *BLANKS
     C     M1N07         IFNE      TYP
     C                   GOTO      SRB2O
     C                   ENDIF
     C                   ENDIF
     C                   EXSR      SRBB
     C                   EXSR      SRBC
N01  C                   EXSR      SRBD
     C                   MOVE      MTM           WMTM              6
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬mavd¬ : ¬'+%trim(%editc(MAVD:'Z'))+'¬, '
          +'¬mtdn¬ : ¬'+%trim(%editc(MTDN:'M'))+'¬, '
          +'¬msn¬ : ¬'+%trim(%editc(MSN:'Z'))+'¬, '
          +'¬mmn¬ : ¬'+%trim(%editc(MMN:'Z'))+'¬, '
          +'¬msr¬ : ¬'+%trim(MSR)+'¬, '
          +'¬m0004¬ : ¬'+%trim(M0004)+'¬, '
          +'¬m0010¬ : ¬'+%trim(M0010)+'¬, '
          +'¬mven¬ : ¬'+%trim(MVEN)+'¬, '
          +'¬m0068¬ : ¬'+%trim(M0068)+'¬, '
          +'¬m0035¬ : ¬'+%trim(M0035)+'¬, '
          +'¬m0065¬ : ¬'+%trim(M0065)+'¬, '
          +'¬m1225¬ : ¬'+%trim(M1225)+'¬, '
          +'¬m1n07¬ : ¬'+%trim(M1N07)+'¬, '
N01       +'¬m0068a¬ : ¬'+%trim(%editc(M0068A:'Z'))+'¬, '
N01       +'¬m0068b¬ : ¬'+%trim(%editc(M0068B:'Z'))+'¬, '
N01       +'¬m0068c¬ : ¬'+%trim(%editc(M0068C:'Z'))+'¬, '
N01       +'¬m3039e¬ : ¬'+%trim(%editc(M3039E:'X'))+'¬, '
N01       +'¬mst¬ : ¬'+%trim(MST)+'¬, '
          +'¬mdt¬ : ¬'+%trim(%editc(MDT:'Z'))+'¬, '
          +'¬mtm¬ : ¬'+%trim(WMTM)+'¬, '
N01       +'¬deklarant¬ : ¬'+%trim(X_DEKL)+'¬, '
          +'¬wtxt¬ : ¬'+%trim(WTXT)+'¬, '
          +'¬wmore¬ : ¬'+%trim(WMORE)+'¬, '
          +'¬wurl¬ : ¬'+%trim(WURL)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
     C     KEYA1         READE     EDIM2                                  55
     C                   ENDDO
     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     EDIM2
     C  N50              CLOSE     EDIM
     C  N50              CLOSE     TVINF
     C  N50              CLOSE     EDIS
     C  N50              CLOSE     EDISX
N01  C  N50              CLOSE     TRIH

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      SYAVA = zhbgetvar('AVD')
     C                   EVAL      SYAV  = c2n2(SYAVA)
     C                   EVAL      SYOPA = zhbgetvar('OPD')
     C                   EVAL      SYOP  = c2n2(SYOPA)
     C                   EVAL      TYP = zhbgetvar('TYP')
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    M0068A        W0068A
     C     *LIKE         DEFINE    M0068B        W0068B
     C     *LIKE         DEFINE    M0068C        W0068C
     C     *LIKE         DEFINE    FLN           WLN
     C                   MOVE      *ZEROS        W0068A
     C                   MOVE      *ZEROS        W0068B
     C                   MOVE      *ZEROS        W0068C
     C                   MOVE      *ZEROS        WLN
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    SYAV
     C                   KFLD                    SYOP
     C                   KFLD                    W0068A
     C                   KFLD                    W0068B
     C                   KFLD                    W0068C
     C     KEYA1         KLIST
     C                   KFLD                    SYAV
     C                   KFLD                    SYOP
     C     KEYB          KLIST
     C                   KFLD                    MMN
     C                   KFLD                    WLN
     C     KEYC          KLIST
     C                   KFLD                    MSN
      *
     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      EDIM2
     C  N50              OPEN      EDIM
     C  N50              OPEN      TVINF
     C  N50              OPEN      EDIS
     C  N50              OPEN      EDISX
N01  C  N50              OPEN      TRIH

     c                   endsr
      *
      *////////////////////////////////////////////////////////////
      *  Hent ev. feiltext                                   SRBB /
      *////////////////////////////////////////////////////////////
     C     SRBB          BEGSR
     C                   EVAL      WTXT=*BLANKS
     C                   EVAL      WMORE=*BLANKS
     C                   EVAL      WLN=1
     C     KEYB          CHAIN     TVINF                              84
     C   84              ADD       1             WLN
     C   84KEYB          CHAIN     TVINF                              84
     C     *IN84         IFEQ      '0'
     C                   MOVEL     F0078A        WTXT
     C     WTXT          CAT       F0078B:1      WTXT
     C     WTXT          CAT       F0078C:0      WTXT
     C     WTXT          CAT       F0078D:0      WTXT
     C     WTXT          CAT       F0078E:0      WTXT
     C                   ADD       1             WLN
     C     MMN           READE     TVINF                                  84
     C     *IN84         IFEQ      '0'
     C                   EVAL      WMORE = 'X'
     C                   ENDIF
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Lænk til edifact                                    SRBC /
      *////////////////////////////////////////////////////////////
     C     SRBC          BEGSR
      *___________________
      * Hente sendningsref
      *"""""""""""""""""""
     C                   EVAL      WURL = *BLANKS
     C     KEYC          CHAIN     EDIS                               20
     C                   IF        SIFS <> *BLANKS
     C                   EVAL      WURL = SIFS
     C                   ELSE
     C     SMBR          CHAIN     EDISX                              20
     C  N20              EVAL      WURL = SXIFSOBJ
     C                   ENDIF
     C                   ENDSR
N01   *////////////////////////////////////////////////////////////
N01   *  Hent deklarantnr                                    SRBD /
N01   *////////////////////////////////////////////////////////////
N01  C     SRBD          BEGSR
N01   *___________________
N01   * Hente deklarantnr
N01   *"""""""""""""""""""
N01  C                   EVAL      X_DEKL = *BLANKS
N01  C                   SELECT
N01  C                   WHEN      M1001 = '929'
N01  C                   EVAL      X_DEKL = %SUBST(M0068:1:9)
N01  C                   WHEN      M1001 = 'TEI'
N01  C     KEYA1         CHAIN     TRIH                               20
N01  C  N20              EVAL      X_DEKL = %SUBST(TITIN:3:9)
N01  C                   ENDSL
N01   *
N01  C                   ENDSR
N01   *
