      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVG020R MODULE(*LIBL/TSVG020R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D WSDOKN          S            512A
     D JSONSTRING      S          32000
     D ERROR           S            150
     D TMPDIR          S            128a
     D VALIDS          S              1a
N07   *   SYEDI data area
N07  D EDIDTA          DS           256
N07  D  UELIBF               171    180

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   EXSR      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     C                   CALLP     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   CALLP     wrtsection('top')
      * Teste input og utfør
     C                   IF        ERROR=*BLANKS
     C                   EXSR      TEST
     C                   ENDIF

      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONSTRING='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬wsdokn¬ : ¬'+%trim(WSDOKN)+'¬, '
        +'¬valids¬ : ¬'+%trim(VALIDS)+'¬, '
        +'¬tmpdir¬ : ¬'+%trim(TMPDIR)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(ERROR)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     C                   CALL      'JSONFIX'
     C                   PARM                    JSONSTRING
     C                   CALLP     updHTMLvar('JSONSTRING':JSONSTRING)
     C                   CALLP     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     C                   EVAL      JSONSTRING ='"uploadcsv" : ['
     C                   CALLP     updHTMLvar('JSONSTRING':JSONSTRING)
     C                   CALLP     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     C                   EVAL      JSONSTRING =']'
     C                   CALLP     updHTMLvar('JSONSTRING':JSONSTRING)
     C                   CALLP     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     C                   EVAL      JSONSTRING ='}'
     C                   CALLP     updHTMLvar('JSONSTRING':JSONSTRING)
     C                   CALLP     wrtsection('JSONlin')
      * Quit
     C                   EXSR      Exit
      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          BEGSR
      * Lukk fil
     C                   CLOSE     BRIDF

      * Do not delete the CALL to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   CALLP     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   ENDSR
      *********************************************************
     C     Parse         BEGSR
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      WSDOKN = zhbgetvar('WSDOKN')
     C                   ENDSR
      *********************************************************
     C     INIT          BEGSR
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        IFEQ      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C                   CALL      BILIBL
     C                   end

     C   50              EVAL      ERROR = 'Invalid userID'
     C                   IF        *IN50=*OFF
     C     *DTAARA       DEFINE                  EDIDTA
     C                   IN        EDIDTA
     C                   EVAL      TMPDIR = '/' + %trim(UELIBF) + '/EDIRE1K'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________
      * TEST                                             TEST
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     TEST          BEGSR
      * Sjekk file extention for gyldighet
     C     '.csv'        SCAN      WSDOKN                                 53
     C  N53'.txt'        SCAN      WSDOKN                                 53
     C  N53'.edi'        SCAN      WSDOKN                                 53
     C                   IF        *IN53
     C                   EVAL      VALIDS='Y'
     C                   ELSE
     C                   EVAL      VALIDS='N'
     C                   EVAL      ERROR='Upload of file ' +
     C                             %trim(WSDOKN) +
     C                             ' failed: ' +
     C                             'file extention not valid.'
     C                   ENDIF
     C                   ENDSR
