      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVG011R MODULE(*LIBL/TSVG011R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     UF   E           K DISK    USROPN
     FSVTHA2    IF   E           K DISK    USROPN
     FSVTFI     IF   E             DISK    USROPN
     FTRACKF    IF A E             DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
     d CEERAN0         PR
     d seed                          10I 0
     d ranno                          8F
     d fc                            12A   options(*omit)
     d highno          s             10I 0 Inz(9000000)
     d lowno           s             10I 0 Inz(1000000)
     d seed            s             10I 0 inz(0)
     d rand            s              8F
     d range           s             10I 0
     d result          s             10I 0
     D RunCmd          PR                  EXTPGM('QCMDEXC')
     D  Cmd                         200A   CONST
     D  Len                          15P 5 CONST
      *
      * Varible for
     D WSUSER          S             10
     D WSUSR4          S             10
     D TDS             S              1
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      * Test av userid
     C     Error         ifeq      *blanks
     C                   EXSR      TEST
     C                   endif
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬usrAS400¬ : ¬'+%trim(WSUSR4)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"tdsSkapaengangskod" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Validera userid
      *
     C     Error         ifeq      *blanks

     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬smsKod¬ : ¬'+%trim(WRESULT)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

     C     NOREC         TAG

     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     SVTHA2
     C  N50              CLOSE     SVTFI
     C  N50              CLOSE     TRACKF

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('user')
     C                   EVAL      WSUSR4  = zhbgetvar('usrAS400')
     C
     c                   endsr
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C   50              eval      Error = 'Användaridentiteten och/eller'
     C                                     + ' lösenordet är fel !'
     C  N50              OPEN      SVTHA2
     C  N50              OPEN      SVTFI
     C  N50              OPEN      TRACKF
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVEL     WDT           XDATO             8 0
      * Hæmta firmaupplysningar
     C  N501             CHAIN     SVTFI

     c                   endsr
      *********************************************************
     C     TEST          Begsr
      *********************************************************
      * Finns userid ?
     C     WSUSR4        CHAIN     SVTHA2                             55
     C                   IF        *IN55
     C                   eval      Error = 'Fel TDS Användarid'
     C                   GOTO      TEST9
     C                   ENDIF
      * Skapa engångskod
      /free
         range = (highno - lowno) + 1;
         CEERAN0( seed : rand : *omit );
         result = %int(rand * range) + lowno;
      /end-free
      * Send sms
     C                   MOVE      result        WRESULT           7
     C                   MOVE      *BLANKS       WCMD            200
     C                   EVAL      WCMD='SNDDST TYPE(*LMSG) TOINTNET(('
     C                             + X'7D'
     C                             + %TRIMR(SVTH_SMS)
     C                             + '@esms.nu'
     C                             + X'7D'
     C                             + ')) DSTD('
     C                             + X'7D'
     C                             + 'TDS1gkod'
     C                             + X'7D'
     C                             + ') LONGMSG('
     C                             + X'7D'
     C                             + WRESULT
     C                             + X'7D'
     C                             + ') USRID('
     C                             + %TRIMR(SVTF_USRI)
     C                             + ' '
     C                             + %TRIMR(SVTF_USRA)
     C                             + ')'
     C                   CALLP     RUNCMD(WCMD : 200)
      * Logga SMS-trafik i TRACKF (T&T)
     C                   CLEAR                   TRACKFR
     C                   EVAL      TTACTI = 'SMS'
     C                   MOVE      WDT           TTDATE
     C                   MOVE      WTM           TTTIME
     C                   EVAL      TTTEXT = 'SMSNR=' + SVTH_SMS
     C                   EVAL      TTUSER = WSUSR4
     C                   EVAL      TTDATL = TTDATE
     C                   EVAL      TTTIML = TTTIME
     C                   EVAL      TTNAME = WSUSR4
     C                   EVAL      TTMANU = 'X'
     C                   EVAL      TTTEXL = TTTEXT
     C                   WRITE     TRACKFR
     C     TEST9         TAG
     c                   ENDSR
