     FSVTX05FO  UF A E             DISK    RENAME(SVTX05R:SVTX05RO)
     FSVTX05FN  IF   E             DISK    RENAME(SVTX05R:SVTX05RN)
      * Slett alle gamle records
     C                   READ      SVTX05FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX05RO
     C                   READ      SVTX05FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX05FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX05RO
     C                   READ      SVTX05FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
