     FSVTX15FO  UF A E             DISK    RENAME(SVTX15R:SVTX15RO)
     FSVTX15FN  IF   E             DISK    RENAME(SVTX15R:SVTX15RN)
      * Slett alle gamle records
     C                   READ      SVTX15FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX15RO
     C                   READ      SVTX15FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX15FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX15RO
     C                   READ      SVTX15FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
