     FSVTX11FO  UF A E             DISK    RENAME(SVTX11R:SVTX11RO)
     FSVTX11FN  IF   E             DISK    RENAME(SVTX11R:SVTX11RN)
      * Slett alle gamle records
     C                   READ      SVTX11FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX11RO
     C                   READ      SVTX11FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX11FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX11RO
     C                   READ      SVTX11FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
