     FSVTX16FO  UF A E             DISK    RENAME(SVTX16R:SVTX16RO)
     FSVTX16FN  IF   E             DISK    RENAME(SVTX16R:SVTX16RN)
      * Slett alle gamle records
     C                   READ      SVTX16FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX16RO
     C                   READ      SVTX16FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX16FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX16RO
     C                   READ      SVTX16FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
