     FSVTX18FO  UF A E             DISK    RENAME(SVTX18R:SVTX18RO)
     FSVTX18FN  IF   E             DISK    RENAME(SVTX18R:SVTX18RN)
      * Slett alle gamle records
     C                   READ      SVTX18FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX18RO
     C                   READ      SVTX18FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX18FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX18RO
     C                   READ      SVTX18FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
