     FSVTX08FO  UF A E             DISK    RENAME(SVTX08R:SVTX08RO)
     FSVTX08FN  IF   E             DISK    RENAME(SVTX08R:SVTX08RN)
      * Slett alle gamle records
     C                   READ      SVTX08FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX08RO
     C                   READ      SVTX08FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX08FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX08RO
     C                   READ      SVTX08FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
