     FSVTX13FO  UF A E             DISK    RENAME(SVTX13R:SVTX13RO)
     FSVTX13FN  IF   E             DISK    RENAME(SVTX13R:SVTX13RN)
      * Slett alle gamle records
     C                   READ      SVTX13FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX13RO
     C                   READ      SVTX13FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX13FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX13RO
     C                   READ      SVTX13FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
