     FSVTX24FO  UF A E             DISK    RENAME(SVTX24R:SVTX24RO)
     FSVTX24FN  IF   E             DISK    RENAME(SVTX24R:SVTX24RN)
      * Slett alle gamle records
     C                   READ      SVTX24FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX24RO
     C                   READ      SVTX24FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX24FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX24RO
     C                   READ      SVTX24FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
