     FSVTX21FO  UF A E             DISK    RENAME(SVTX21R:SVTX21RO)
     FSVTX21FN  IF   E             DISK    RENAME(SVTX21R:SVTX21RN)
      * Slett alle gamle records
     C                   READ      SVTX21FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX21RO
     C                   READ      SVTX21FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX21FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX21RO
     C                   READ      SVTX21FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
