     FSVTX10FO  UF A E             DISK    RENAME(SVTX10R:SVTX10RO)
     FSVTX10FN  IF   E             DISK    RENAME(SVTX10R:SVTX10RN)
      * Slett alle gamle records
     C                   READ      SVTX10FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX10RO
     C                   READ      SVTX10FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX10FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX10RO
     C                   READ      SVTX10FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
