     FSVTX02FO  UF A E             DISK    RENAME(SVTX02R:SVTX02RO)
     FSVTX02FN  IF   E             DISK    RENAME(SVTX02R:SVTX02RN)
      * Slett alle gamle records
     C                   READ      SVTX02FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX02RO
     C                   READ      SVTX02FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX02FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX02RO
     C                   READ      SVTX02FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
