     FSVTX19FO  UF A E             DISK    RENAME(SVTX19R:SVTX19RO)
     FSVTX19FN  IF   E             DISK    RENAME(SVTX19R:SVTX19RN)
      * Slett alle gamle records
     C                   READ      SVTX19FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX19RO
     C                   READ      SVTX19FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX19FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX19RO
     C                   READ      SVTX19FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
