     FSVTX07FO  UF A E             DISK    RENAME(SVTX07R:SVTX07RO)
     FSVTX07FN  IF   E             DISK    RENAME(SVTX07R:SVTX07RN)
      * Slett alle gamle records
     C                   READ      SVTX07FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX07RO
     C                   READ      SVTX07FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX07FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX07RO
     C                   READ      SVTX07FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
