     FSVTX04FO  UF A E             DISK    RENAME(SVTX04R:SVTX04RO)
     FSVTX04FN  IF   E             DISK    RENAME(SVTX04R:SVTX04RN)
      * Slett alle gamle records
     C                   READ      SVTX04FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX04RO
     C                   READ      SVTX04FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX04FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX04RO
     C                   READ      SVTX04FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
