     FSVTX17FO  UF A E             DISK    RENAME(SVTX17R:SVTX17RO)
     FSVTX17FN  IF   E             DISK    RENAME(SVTX17R:SVTX17RN)
      * Slett alle gamle records
     C                   READ      SVTX17FO                               51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVTX17RO
     C                   READ      SVTX17FO                               51
     C                   ENDDO
      * Legg inn nye
     C                   READ      SVTX17FN                               52
     C     *IN52         DOWEQ     *OFF
     C                   WRITE     SVTX17RO
     C                   READ      SVTX17FN                               52
     C                   ENDDO
     C                   EVAL      *INLR=*ON
