********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10006 * 01 sh  PTF10 *cr  går til *CE for eksport
11XXX * 01 SH  PTF11 brukeroversyring av printfil
11105 * 02 YBC PTF11 SEND EPOST
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
12159 * 03 YBC PTF12 Ny status N for feil sendte ny versjon uten TVINN be om
********************************************************************
      *
N01  FKODTPUSR  IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTFM    IF   E           K DISK
N02  FKODTSI    IF   E           K DISK
S03  F*SAEH      UF   E           K DISK
N03  FSAEH      UF   E           K DISK    USROPN
     FSAEH7     IF   E           K DISK    RENAME(SAEHR:SAEH7R)
     FEDIM4     IF   E           K DISK
     FTVINF     UF   E           K DISK
     FTVINME    O    E             PRINTER OFLIND(*IN51)
N01  F                                     USROPN
N01  D XCMD11          C                   CONST('OVRPRTF -
N01  D                                     FILE(TVINME) -
N01  D                                     OUTQ(')
N01  D XCMD21          C                   CONST('PAGESIZE(70 80) -
N01  D                                     CPI(10) -
N01  D                                     OVRSCOPE(*JOB) -
N01  D                                     OVRFLW(70)')
N02  D XCMD31          C                   CONST('OVRPRTF -
N02  D                                     FILE(TVINME) -
N02  D                                     PAGESIZE(72 80) -
N02  D                                     OVRFLW(66) -
N02  D                                     FORMTYPE(*STD) -
N02  D                                     HOLD(*YES) -
N02  D                                     OUTQ(OUTMAIL)')
N01  D UCMD            DS          1024
     D                 DS
     D  SISG                   1      3
     D  SESG                   1      3
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRHOVE
N01  C                   CLOSE     TVINME
     C                   SETON                                        LR
      *
      *
      *////////////////////////////////////////////////////////////
      *  Initiering                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     UAVD          PARM                    UAVD              4 0
     C     UWS           PARM                    UWS              10
N02  C                   PARM                    USLUTT            1
N02  C                   PARM                    UEP              70
N02  C                   PARM                    UEMNE            40
N02  C                   EVAL      USLUTT = 'N'
N02  C                   EVAL      UEP    = *BLANKS
N02  C                   EVAL      UEMNE  = *BLANKS
N01  C                   OPEN      TVINME
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYSH         KLIST
     C                   KFLD                    SEAVD
     C                   KFLD                    SETDN
     C     FRIKEY        KLIST
     C                   KFLD                    SEAVD
     C                   KFLD                    SETDN
     C                   KFLD                    WSKODE
s01  C*                  move      '*CR'         WSKODE            3
n01  C                   move      '*CE'         WSKODE            3
     C     KEYSH7        KLIST
     C                   KFLD                    UWS
     C                   KFLD                    WST               1
     C     KEYTM4        KLIST
     C                   KFLD                    WSR               1
     C                   KFLD                    WAVD              4 0
     C                   KFLD                    WTDN              7 0
     C                   KFLD                    W0068A            8 0
     C     KEYTF         KLIST
     C                   KFLD                    MMN
     C     KODTPK        KLIST
     C                   KFLD                    KOPUNI
     C                   KFLD                    UAVD
     C                   KFLD                    KOPLNR
     C                   MOVE      'P'           KOPUNI
     C                   Z-ADD     97            KOPLNR
N01  C     KEYUSER       KLIST
N01  C                   KFLD                    SESG
N01  C                   KFLD                    KOPLNR
N02  C     KODTSIK       KLIST
N02  C                   KFLD                    KSIUNI
N02  C                   KFLD                    SESG
N02  C                   EVAL      KSIUNI = 'SI'
      *___________________
      * Initiere faste nøkkelfelt
      *_________________
     C                   MOVE      'R'           WSR
     C                   MOVE      UAVD          WAVD
     C                   MOVE      99999999      W0068A
     C                   MOVE      'Å'           WST
     C                   MOVEA     '01'          *IN(38)
     C     KODTPK        CHAIN     KOPR                               33
     C  N33KOPFM         IFNE      *BLANKS
     C     KOPFM         SETLL     KODTFM
     C     KOPFM         READE     KODTFM                                 33
     C                   END
      *_____________
      * Sett nøkkel for å hente alle ME ('EDIRE     Å')
      *"""""""""""""
     C     KEYSH7        SETLL     SAEH7
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Behandl alle Å-oppdrag,                           SRHOVE /
      *////////////////////////////////////////////////////////////
     C     SRHOVE        BEGSR
      *___________________
      * Hent alle SAD- med EDIRE/Å. finn siste Recievemelding
      * via meldingsnr skriv  FRITEKST/ oppdater status i sadh
      *"""""""""""""""""
     C                   SETOFF                                           33
N02  C                   MOVE      'J'           XSNDEP            1
     C     FLERSH        TAG
     C     KEYSH7        READE     SAEH7                                  33
N02  C   33              EVAL      USLUTT = 'J'
     C  N33              DO
N02  C     KODTSIK       CHAIN     KODTSI                             33
N02  C                   IF        *IN33 = *ON OR KSIXXX = *BLANKS
N01  C     KEYUSER       CHAIN     KODTPUSR                           44
N01  C  N44              EXSR      OVR
N02  C                   EVAL      XSNDEP = 'N'
N02  C                   ELSE
N02  C                   IF        XSNDEP = 'N'
N02   * FORRIGE OPPDRAG SKAL IKKE SENDES PÅ MAIL. MEN DENNE SKAL SENDES PÅ MAIL.
N02   * DA AVSLUTT PROGRAM Å SKRIVE UT FORRIGE OPPDRAG FØRST.
N02  C                   GOTO      SLHOVE
N02  C                   END
N02  C                   EXSR      OVR2
N02  C                   END
     C     SEAVD         CABNE     UAVD          FLERSH
     C                   MOVE      SETDN         WTDN
     C                   SETOFF                                           34
     C                   MOVE      '1'           *IN51
     C                   MOVE      '1'           *IN52
     C     KEYTM4        SETLL     EDIM4
     C     FLEREM        TAG
     C                   READP     EDIM4                                  34
     C  N34SEAVD         COMP      MAVD                               3434
     C  N34SETDN         COMP      MTDN                               3434
     C  N34M1001         IFNE      '830'
     C                   GOTO      FLEREM
     C                   END
     C  N34              EXSR      SRSKRI
     C  N34              GOTO      FLEREM
     C     *IN52         IFEQ      '0'
     C                   WRITE     TVINMEØ
     C                   ELSE
N03  C                   OPEN      SAEH
     C     KEYSH         CHAIN     SAEH                               20
     C  N20              MOVE      ' '           SEST
     C  N20              UPDATE    SAEHR
N03  C                   CLOSE     SAEH
     C                   END
N02  C                   IF        XSNDEP = 'J'
N02  C                   EVAL      UEP = KSIXXX
N02  C                   EVAL      UEMNE = 'Melding fra TVINN: '
N02  C                             + %TRIM(%EDITC(WAVD:'Z')) + '/'
N02  C                             + %TRIM(%EDITC(WTDN:'Z'))
N02  C                   GOTO      SLHOVE
N02  C                   END
     C                   GOTO      FLERSH
     C                   END
N02   *
N02  C     SLHOVE        TAG
N02   *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Skriv en melding (en post i TVINF)                SRSKRI /
      *////////////////////////////////////////////////////////////
     C     SRSKRI        BEGSR
     C                   MOVE      '0'           *IN52
      * Oppdatere tolldeklarasjon med ny status
     C                   MOVE      *BLANKS       FSSOK
     C     FRIKEY        CHAIN     FRISOK                             20
N03  C                   OPEN      SAEH
     C     KEYSH         CHAIN     SAEH                               20
     C     SEST          IFEQ      'Å'
     C     SE0035        IFEQ      '6'                                          DOK.KONTROLL
     C                   MOVE      'D'           SEST
N03   * Slett evt. oppbevarte opprinnelig fortolling pga. ny versjon uten be om
N03  C                   MOVE      '2'           UMOD              1
N03  C                   CALL      'SAD052X'
N03  C                   PARM                    SEAVD
N03  C                   PARM                    SETDN
N03  C                   PARM                    UMOD
     C                   ELSE
     C     SE0035        IFEQ      '5'                                          VAREKONTROLL
     C                   MOVE      'V'           SEST
N03   * Slett evt. oppbevarte opprinnelig fortolling pga. ny versjon uten be om
N03  C                   MOVE      '2'           UMOD              1
N03  C                   CALL      'SAD052X'
N03  C                   PARM                    SEAVD
N03  C                   PARM                    SETDN
N03  C                   PARM                    UMOD
     C                   ELSE
     C     SE0035        IFEQ      '9'                                          TVINN INFO.
     C                   MOVE      'T'           SEST
N03   * Slett evt. oppbevarte opprinnelig fortolling pga. ny versjon uten be om
N03  C                   MOVE      '2'           UMOD              1
N03  C                   CALL      'SAD052X'
N03  C                   PARM                    SEAVD
N03  C                   PARM                    SETDN
N03  C                   PARM                    UMOD
     C                   ELSE
N03  C     SE0035        IFEQ      '7'                                          TVINN INFO.
N03   * Flytt oppbevarte opprinnelig fortolling tilbake
N03  C                   UPDATE    SAEHR
N03  C                   CLOSE     SAEH
N03  C                   MOVE      '3'           UMOD              1
N03  C                   CALL      'SAD052X'
N03  C                   PARM                    SEAVD
N03  C                   PARM                    SETDN
N03  C                   PARM                    UMOD
N03  C                   OPEN      SAEH
N03  C     KEYSH         CHAIN     SAEH                               20
N03  C                   IF        SEKDV = 'D' OR SEKDV = 'V'
N03  C                   EVAL      SEST = SEKDV
N03  C                   ELSE
N03  C                   MOVE      'N'           SEST
N03  C                   END
N03  C                   ELSE
     C                   MOVE      'M'           SEST
N03  C                   END
     C                   END
     C                   END
     C                   END
     C                   END
N03  C                   EVAL      SEKDV = ' '
     C                   MOVE      ' '           SE0035
     C                   UPDATE    SAEHR
N03  C                   CLOSE     SAEH
      * Les alle på samme meldingsnr
     C     KEYTF         SETLL     TVINF
     C     FLEREF        TAG
     C     KEYTF         READE     TVINF                                  35
     C  N35F4815         IFEQ      'JA'
      * Skriv ut melding.
     C  N35
     CAN 51              DO                                                     OVERFLOW
     C                   WRITE     TVINMEA
     C                   SETOFF                                       51
     C                   END
     C     F0078B        COMP      *BLANKS                                41
     C     F0078C        COMP      *BLANKS                                42
     C     F0078D        COMP      *BLANKS                                43
     C     F0078E        COMP      *BLANKS                                44
     C                   WRITE     TVINMEB
     C                   MOVE      'PP'          F4815
     C                   END
     C  N35              UPDATE    TVINFF
     C  N35              GOTO      FLEREF
      *
     C                   ENDSR
N01   **********************************************************************************
N01  c     ovr           begsr
N01   **********************************************************************************
N01  C                   CLOSE     TVINME
N01  C                   Z-ADD     1024          UCMDL            15 5
N01  C                   MOVE      *BLANKS       UCMD
N01  C     XCMD11        CAT       KOPNVN:0      UCMD
N01  C                   CAT       ')':0         UCMD
N01  C                   CAT       XCMD21:1      UCMD
N01  C                   CALL      'QCMDEXC'                            33
N01  C                   PARM                    UCMD
N01  C                   PARM                    UCMDL
N01  C                   OPEN      TVINME
N01  C                   ENDSR
N02   **********************************************************************************
N02  c     ovr2          begsr
N02   **********************************************************************************
N02  C                   CLOSE     TVINME
N02  C                   Z-ADD     1024          UCMDL            15 5
N02  C                   EVAL      UCMD = XCMD31
N02  C                   CALL      'QCMDEXC'                            33
N02  C                   PARM                    UCMD
N02  C                   PARM                    UCMDL
N02  C                   OPEN      TVINME
N02  C                   ENDSR
