********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 SH  PTF12 regenerer hvis finnes fra før
12XXX * 02 SH  PTF12 kaller arc002
********************************************************************
********************************************************************
      *
     FARKIVL03  UF A E           K DISK
     FSADH      IF   E           K DISK
     D                SDS
     D  ZUSER                254    263
     C     *entry        plist
     C                   PARM                    ARFIRM            2
     c                   parm                    ARAVD             4 0
     c                   parm                    AROPD             7 0
     C     ARKIVK        KLIST
     C                   KFLD                    ARTYPE
     C                   KFLD                    ARAVD
     C                   KFLD                    AROPD
     C                   EVAL      ARTYPE = 'sl'
      *
     c     key           klist
     c                   kfld                    ARAVD
     c                   kfld                    AROPD
      *
     c     key           chain     sadh                               33
     C  N33              EXSR      ARKIVSR
     C                   SETON                                        LR
     C                   RETURN
      **********************************************************************************
     C     ARKIVSR       BEGSR
      **********************************************************************************
      * Lag forhåndssendt arkivdokument ved direktefortolling
     C                   IF        %SUBST(SIGN:5:2) >= '01' AND
     C                             %SUBST(SIGN:5:2) <= '12' AND
     C                             %SUBST(SIGN:7:1) = 'D' AND
     C                             %SUBST(SIGN:8:8) = *BLANKS
     C                   EVAL      ARUSER = ZUSER
     C                   MOVE      SIKNK         ARKUND
     C     ARKIVK        CHAIN     ARKIVL03                           33
     C                   IF        *IN33
     C                   WRITE     ARKIVR
n01  c                   else
n01  c                   move      ' '           arstat
n01  c                   update    arkivr
n01  c                   move      'N'           nei
N02  C                   CALL      'ARC002CL'
N02  C                   PARM                    ARTYPE
N02  C                   PARM                    ZUSER
N02  C                   PARM                    NEI               1
     C                   END
     C                   END
      *
     C                   ENDSR
      *
