     H DFTACTGRP(*NO) ACTGRP('KLEMENT') OPTION(*SRCSTMT)
     H BNDDIR('YAJL')

      /include yajl_h

     D docNode         s                   like(yajl_val)
     D uuIdList        s                   like(yajl_val)
     D node            s                   like(yajl_val)
     D subnode         s                   like(yajl_val)
     D subnode2        s                   like(yajl_val)
     D val             s                   like(yajl_val)

     D i               s             10i 0
     D errMsg          s            500a   varying inz('')
      *
     D id              s              6s 0
     D tracker_id      s              7s 0
     D type            s              5s 0
     D lat             s              8s 6
     D lon             s              9s 6

     c     *entry        plist
     c                   parm                    UUID             36
     c                   parm                    Filename         45
      /free

         // load the example.json document into a tree.
         docNode = yajl_stmf_load_tree( %trim(Filename) : errMsg );
         if errMsg <> '';
           // handle error
           *inlr = *on;
           return;
         endif;


         node = YAJL_object_find(docNode: 'uuid');
         UUID = YAJL_get_string(node);

         yajl_tree_free(docNode);

         *inlr = *on;
         return;
