     FKODTSNDR  IF A E           K DISK
     FKODTSNNY  IP   E           K DISK    RENAME(KODTSNR:KODTSNRNY)
      *
     C     SNTANR        CHAIN     KODTSNDR                           33
     C   33              WRITE     KODTSNR
      *
