     FTRUSTD    UP   E           K DISK
      *
     C                   IF        THGBL < 10000
     C*                  EVAL      THGPR = THGBL / 100
     C                   EVAL      THGPR = THGBL
     C                   EVAL      THGBL = 0
     C                   END
     C                   UPDATE    TRUSTDR
      *
