     FADRUNNRF  IF A E           K DISK
     FADRUNNRFNYIP   E           K DISK    RENAME(ADRUNNRR:ADRUNNRRNY)
     FV12FNF    UF   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'ADRUNNRF'
     C     FNFN          CHAIN(N)  V12FNF                             33
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   MOVE      'J'           XINIT             1
     C     ADRUNNRFK     KLIST
     C                   KFLD                    ADUNNR
     C                   KFLD                    ADEMBG
     C                   KFLD                    ADINDX
     C                   END
      *
     C     ADRUNNRFK     CHAIN     ADRUNNRF                           33
     C   33              WRITE     ADRUNNRR
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V12FNF                             33
     C  N33              MOVE      'J'           FNST
     C  N33              UPDATE    V12FNFR
      *
     C                   ENDSR
      *
