     FZAEVV11   IP   E             DISK    RENAME(SAEVR:SAEVR11)
     F                                     PREFIX(V11_)
     FZAEVL03   UF   E           K DISK
      *
     C     KEY           KLIST
     C                   KFLD                    V11_SVUNIK
     C                   KFLD                    V11_SVREFF
     C                   KFLD                    V11_SVLI
      *
     C                   IF        V11_SVVT <> *BLANKS
     C                             OR V11_SVFT <> *BLANKS
     C                             OR V11_SVCREF <> *BLANKS
     C     KEY           CHAIN     ZAEVL03                            33
     C                   IF        *IN33 = *OFF
     C                   EVAL      SVVT01 = V11_SVVT
     C                   EVAL      SVFT01 = V11_SVFT
     C                   EVAL      SVCRE1 = V11_SVCREF
     C                   EVAL      SVTOP1 = V11_SVTOA
     C                   UPDATE    SAEVR
     C                   END
     C                   END
      *
