     FLANDISO   IF A E           K DISK
     FLANDISONY IP   E           K DISK    RENAME(LANDISOR:LANDISORNY)
     FV12FNF    UF   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'LANDISO'
     C     FNFN          CHAIN(N)  V12FNF                             33
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   MOVE      'J'           XINIT             1
     C     LANDISOK      KLIST
     C                   KFLD                    ISO2A
     C                   END
      *
     C     LANDISOK      CHAIN     LANDISO                            33
     C   33              WRITE     LANDISOR
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V12FNF                             33
     C  N33              MOVE      'J'           FNST
     C  N33              UPDATE    V12FNFR
      *
     C                   ENDSR
      *
