      * setter om epostkunde eller ikke I FERDF
      *
     FSYPARF    UP   E           K DISK
     FTELLGE    UF   E           K DISK
     FV12FNF    UF   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'SYPARF'
     C     FNFN          CHAIN(N)  V12FNF                             33
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   MOVE      'J'           XINIT             1
     C     key           KLIST
     C                   KFLD                    UNIK              8
     c                   movel     'SYPAR'       UNIK
     C                   END
      *
     C     syrecn        ifeq      0
     C     key           chain     tellge                             33
     c     *in33         ifeq      '0'
     C                   MOVE      GENO          SYRECN
     C                   ADD       1             GENO
     C                   UPDATE    TELLGER
     C                   UPDATE    syparfr
     C                   END
     C                   END
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V12FNF                             33
     C  N33              MOVE      'J'           FNST
     C  N33              UPDATE    V12FNFR
      *
     C                   ENDSR
      *
