     FZADVV11   IP   E             DISK    RENAME(SADVR:SADVR11)
     F                                     PREFIX(V11_)
     FZADVL02   UF   E           K DISK
      *
     C     KEY           KLIST
     C                   KFLD                    V11_SVUNIK
     C                   KFLD                    V11_SVREFF
     C                   KFLD                    V11_SVLI
      *
     C                   IF        V11_SVVT <> *BLANKS
     C                             OR V11_SVFT <> *BLANKS
     C                             OR V11_SVCREF <> *BLANKS
     C     KEY           CHAIN     ZADVL02                            33
     C                   IF        *IN33 = *OFF
     C                   EVAL      SVVT01 = V11_SVVT
     C                   EVAL      SVFT01 = V11_SVFT
     C                   EVAL      SVCRE1 = V11_SVCREF
     C                   EVAL      SVTOP1 = V11_SVTOA
     C                   UPDATE    SADVR
     C                   END
     C                   END
      *
