********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 Fjerner noen  hardkodinger fra standard
10XXX * 02 SH  PTF10 ikke tildel nytt nummer hvis den er i parameter
      * %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
      * 03 JOV PTF12 Også kunder uten løsning 1 benytter denne teknikken
      *              Hvis telleverk i TELLKU - benytt det (samordnet med WEB/espedsg )
********************************************************************
     FKUNDF     O  A E           K DISK
     FKKUNF     O  A E           K DISK
     FCUNDF     IF A E           K DISK
     F                                     RENAME(KUNDR:CUNDR)
     FSYSBL01   UF   E           K DISK
N03  FFIRKU     UF   E           K DISK
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZJOB                 244    253
     D  ZUSER                254    263
     D  ZJOBNR               264    269  0
     ICUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C     *entry        PLIST
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C*
     C     KEYF          KLIST
     C                   KFLD                    FIRMA
     C*
N02  c     kundnr        ifeq      *zeros
N03   *telleverk primært fra FIRKU (= benytter IKKE L1 / kan adde kunder i Sysped)
N03   *  = bør legges om slik at KIONDF droppes / tildele nummer i VKUND (ref f.eks TOTEN)
N03  C     FIRMA         CHAIN     FIRKU                              33
N03  C     *IN33         IFEQ      '0'
N03  C     FIKUFN        andne     *zeros
N03  C                   MOVE      FIKUFN        KUNDNR
N03  C                   ADD       1             FIKUFN
N03  C                   UPDATE    FIRKUR
N03  C                   ELSE
     C     KEYF          CHAIN     SYSBL01                            52
     C     SISKNR        IFNE      99999999
     C                   ADD       1             SISKNR
     C                   Z-ADD     SISKNR        KUNDNR
     C                   ELSE
     C                   Z-ADD     1             SISKNR
     C                   Z-ADD     1             KUNDNR
     C                   ENDIF
     C                   UPDATE    SYSBR
N03  C                   ENDIF
N02  c                   end
     C*
     c                   move      'A'           AKTKOD
s01  c*                  move      '10'          BetBet
s01  c*                  movel     'NO'          LAND
s01  c*                  movel     'J'           Sfakt
     c                   movel     'J'           PKOD
     c                   movel     'J'           KUTDR
     c                   movel     'KUN'         KHENV
     c                   z-add     1             FEKS
     c                   movel     '20'          DAOAAR
     c                   move      UYEAR         DAOAAR
     c                   move      UMONTH        DAOMND
     c                   move      UDAY          DAODAG
     C*
     C                   WRITE     KUNDR
     C                   WRITE     KKUNR
     C                   WRITE     CUNDR
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
