********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P9XXX * 01 SH  PTF9 diekteråpning i windows
********************************************************************
      ***********************************************************
      *** Vis lang URL  for web-søk                   ***
      ***********************************************************
s01  FWEBLINKD  CF   E             WORKSTN
N09  FKOFAST    IF   E           K DISK
     D                SDS
     D  ZUSER                254    263
N09  D                 DS
e01  D  LINK                   1    512
N09  D  LINK1                  1     80
N09  D  LINK2                 81    140
     C     *ENTRY        PLIST
N01  C                   PARM                    OVERSKRIFT       40
N01  C                   PARM                    TYPE              5
N01  C                   PARM                    SØKEPARAM        50
      *
N09   * key for track prefix/evt suffix
N09  C     KOFASTK1      klist
N09  C                   kfld                    KFTYP1           10
N09  C                   kfld                    TYPE
N09  C                   EVAL      KFTYP1 = 'TRACKPREFI'
N09  C     KOFASTK2      klist
N09  C                   kfld                    KFTYP2           10
N09  C                   kfld                    TYPE
N09  C                   EVAL      KFTYP2 = 'TRACKSUFFI'
      *
      *
N09  C     KOFASTK1      CHAIN     KOFAST                             30
      *
      * viser skjembilde ved feil
      *
N09  C     *in30         IFEQ      *ON
N09  C                   EVAL      LINK1 = 'Koden '+TYPE+' er ikke koblet ' +
     C                                    'til en "Traker" (søkemotor/URL).'
N09  C                   EVAL      LINK2= 'Kontakt SYSTEMA for oppsett.'
     C     STRWEB        TAG
S01  C                   EXFMT     WEBSOK
s01  c  N03              goto      strWeb
     c                   goto      slutt
N09  C                   End
      *
     C                   exsr      crtlink
      *
      *
     c     slutt         tag
     C                   SETON                                        LR
     C                   RETURN
N09  C***********************************************
N09  C     CRTLINK       BEGSR
N09  C***********************************************
N09   * Konstruer link/URL
N09  C                   EVAL      LINK = KFTXT
N09   * append linje 2 (engelsk tekst når siste tegn er A)
N09  C                   MOVE      KFTXTE        TstAppend         1
N09  C     TstAppend     IFEQ      'A'
N09  c                   move      ' '           KFTXTE
N09  C                   CAT       KFTXTE:0      LINK
N09  C                   end
N09  C                   CAT       SØKEPARAM:0   LINK
N09   * Suffix i søkestrengen..
N09  C     KOFASTK2      CHAIN     KOFAST                             33
N09  C                   IF        *IN33 = *OFF
N09  C                   CAT       KFTXT:0       LINK
N09  C                   END
     c                   call      'SYGE39CL'
     c                   parm                    link
N09  C                   ENDSR
