     Fwmltest   UF A E             DISK
     F                                     RENAME(wmltest:wmltestr)
     D data            S          32000
     Iwmltestr
     I              wmltest                     dataut
     c                   setoff                                       99
     c   99              read      wmltest
     C     *entry        plist
     c                   parm                    data          32000
     c                   parm                    stopp             1
     C                   eval      dataut=data
     c                   write     wmltestr
     c                   seton                                        lr
     c                   return
