     H debug(*yes)
      *********************************************************************
      *  Henter EDIFIL VUIA WEBSERVICE
      *********************************************************************
CRTPG+*  CRTPGM SYSPED/WSEDIFIL MODULE(*LIBL/WSEDIFIL
CRTPGM*         *LIBL/INCGI) ACTGRP(*NEW) AUT(*USE)
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     IF   E           K DISK    USROPN
     FediSE1k   IF   E           K DISK    usropn
     FFIRM      IF   E           K DISK    usropn
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
     D WSUSER          S             10
     D XMLstring       S          32000
     D melding         S            128
     D meld            S             10
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *--------------------------------------------------------------------
      *
      * Parse input
     C                   exsr      Parse
     C                   EXSR      INIT
      * Hent XML output-dok/ skriv top + linjer
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/WS_EDI.html':
     C                             '/CGITAG/')
      *
     C                   callp     wrtsection('top')
      *
      /free
        XMLstring='<?xml version="1.0" encoding="UTF-8" standalone="yes"?>';
      /end-free
     C*                  callp     updHTMLvar('XMLstring':XMLstring)
     C*                  callp     wrtsection('XMLlin')
      /free
        XMLstring='<getEdiFile>';
      /end-free
     C*                  callp     updHTMLvar('XMLstring':XMLstring)
     C*                  callp     wrtsection('XMLlin')
      *
     c                   exsr      CrtBody
      * slutt
      /free
        XMLstring='</getEdiFile>';
      /end-free
     C*                  callp     updHTMLvar('XMLstring':XMLstring)
     C*                  callp     wrtsection('XMLlin')
      *
     C     SLUTT         TAG
     C                   EXSR      EXIT
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   eval      WSUSER  = zhbgetvar('USER')
     c     WSUSER        ifeq      *blanks
     C                   eval      WSUSER  = 'NN'
     c                   endif
     C                   eval      MELD  = zhbgetvar('MELD')
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C     MELDKEY       KLIST
     C                   KFLD                    MELD
      *
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C                   OPEN      edise1k
     C                   OPEN      FIRM
     c     *loval        setll     FIRM
     c                   read      FIRM
      *
     C                   endsr
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          begsr
     C                   callp     wrtsection('*fini')
     C                   close     BRIDF
     C                   CLOSE     edise1k
     C                   CLOSE     FIRM
     C                   eval      *inlr = *on
      *
     C                   endsr
      * **************************************************
     C     CrtBody       begsr
      * **************************************************
     c                   setoff                                       33
     c                   eval      MELDING = *blanks
     c     meldkey       setll     edise1k
     c     *in33         doweq     '0'
     c     meldkey       reade     edise1k                                33
     c     *in33         ifeq      '0'
     c                   eval      melding=SDATA
      /free
        XMLstring=%trim(melding);
      /end-free
     C                   DUMP
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
     c                   endif
     c                   enddo
      *
     C                   endsr
      *
