********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 YBC PTF12 BRUK SYGE15C
12XXX * 02 sh  PTF12 GJORT OM TIL 60 DAGER
********************************************************************
     FXMLRCVF   UF   E           K DISK
     FXMLRCLF   UF   E           K DISK
     FXMLRCAF   UF   E           K DISK
     FEDIS      IF   E           K DISK
S01  D*                DS
S01  D* XULTID                 1     14  0
S01  D* XULTM                  1      6  0
S01  D* XULDD                  7      8  0
S01  D* XULMM                  9     10  0
S01  D* XUL電                 11     14  0
     D                 DS
     D  UL電                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
      *

     c                   exsr      init
     c     *in33         doweq     '0'
     C     *loval        setll     XMLRCVF
     c                   read(N)   xmlrcvf                                33
     C     *in33         IFEQ      '0'
     c     xrsn          chain     edis                               34
      * funnet i EDIS
     c     *in34         ifeq      '0'
     c     sdt           iflt      nydato
     c                   exsr      delsr
     c                   else
     c                   goto      slutt
     c                   end
     c                   else
     c                   exsr      delsr
      * slutt funnet i EDIS
     c                   endif
      * slutt filen xmlrcvf
     c                   endif
     c                   enddo
      *
     c     slutt         tag
     c                   seton                                        lr
     c                   return
      *************************************************************************
     c     init          begsr
      *************************************************************************
S01  C*                  TIME                    XULTID
S01  C*                  MOVE      XULDD         ULDD
S01  C*                  MOVE      XULMM         ULMM
S01  C*                  MOVE      XUL電         UL電
N01  C                   CALL      'SYGE15C'
N01  C                   PARM                    WDT               8
N01  C                   PARM                    WTM               6
N01  C                   MOVE      WDT           ULDT
      *
      *finner 10 dager tilbake i tid
      *
     c                   move      'SUB'         ufunksjon
S02  c*                  z-add     10            udager
N02  c                   z-add     60            udager
     c                   z-add     0             nydato
     c                   z-add     uldt          idag              8 0
     c                   CALL      'SYGE20T'
     C                   PARM                    Ufunksjon         3
     c                   parm                    IDAG              8 0
     c                   parm                    NYDATO            8 0
     c                   parm                    UDager            5 0
     c                   endsr
      *************************************************************************
     c     delsr         begsr
      *************************************************************************
     c                   setoff                                       35
     C     *loval        setll     XMLRCVF
     c     *in35         doweq     '0'
     c     xrsn          reade     xmlrcvf                                35
     c     *in35         ifeq      '0'
     c                   delete    XMLRCVFR
     c                   endif
     c                   enddo
     c                   exsr      delsr2
     c                   endsr
      *************************************************************************
     c     delsr2        begsr
      *************************************************************************
     c                   setoff                                       35
     C     *loval        setll     XMLRCAF
     c     *in35         doweq     '0'
     c     xrsn          reade     xmlrcaf                                35
     c     *in35         ifeq      '0'
     c                   delete    XMLRCAFR
     c                   endif
     c                   enddo
     c                   exsr      delsr3
     c                   endsr
      *************************************************************************
     c     delsr3        begsr
      *************************************************************************
     c                   setoff                                       35
     C     *loval        setll     XMLRCLF
     c     *in35         doweq     '0'
     c     xrsn          reade     xmlrclf                                35
     c     *in35         ifeq      '0'
     c                   delete    XMLRCLFR
     c                   endif
     c                   enddo
     c                   endsr
