     D UFILNVN         s            256a
     D USN             s              9a

     c                   eval      UFILNVN = '/home/BHR_EHF_INN/'
     c                             + 'test_1474570_20180404132104164_I_V'
     c                   eval      UFILNVN = '/home/BING/RAMBERG03.xml'
     c                   eval      USN     = '000087125'
     C                   call      'XMLRCVEHF'
     C                   PARM                    UFILNVN
     C                   PARM                    USN
     c                   seton                                        LR
     c                   return
