     FZADFL01   UF   E           K DISK
     FZADVL01   UF   E           K DISK
N02  FZADVJ     UF   E           K DISK
N05  ISADVR
N05  I              SVBELT                      I_SVBELT
      *_____
      * INIT
      *"""""
     C                   EXSR      INIT
      *___________________________________
      * Slett poster i ZADV som er plukket
      *"""""""""""""""""""""""""""""""""""
     C     *LOVAL        SETLL     ZADFL01
     C                   READ      ZADFL01                                56
     C                   DOW       *IN56 = *OFF
     C                   IF        SFAVD <> 0
     C                   IF        SFOPDN <> 0
     C                   DELETE    SADFR
     C                   ENDIF
     C                   ENDIF
     C                   READ      ZADFL01                                56
     C                   ENDDO
      *_________________________________________________
      * Slett poster i ZADV som ikke har tilhörende ZADF
      *"""""""""""""""""""""""""""""""""""""""""""""""""
     C     *LOVAL        SETLL     ZADVL01
     C                   READ      ZADVL01                                53
     C                   DOW       *IN53 = *OFF
     C     ZADFK         CHAIN     ZADFL01                            55
     C                   IF        *IN55
N02
N02  C     ZADVJK        SETLL     ZADVJ
N02  C     ZADVJK        READE     ZADVJ                                  54
N02  C                   DOW       *IN54 = *OFF
N02  C                   DELETE    SADVJR
N02  C     ZADVJK        READE     ZADVJ                                  54
N02  C                   ENDDO
N02
     C                   DELETE    SADVR
     C                   ENDIF
N02
     C                   READ      ZADVL01                                53
     C                   ENDDO

     C                   EVAL      *INLR=*ON
      *______________________________________________
     C     INIT          BEGSR
      *""""""""""""""""""""""""""""""""""""""""""""""
N02  C     ZADFK         KLIST
N02  C                   KFLD                    SVUNIK
N02  C                   KFLD                    SVREFF
N02  C     ZADVJK        KLIST
N02  C                   KFLD                    SVREFF
N02  C                   KFLD                    SVUNIK
N02  C                   KFLD                    SVLI
     C                   ENDSR
