     FZAEFL01   UF   E           K DISK
     FZAEVL01   UF   E           K DISK
N05  I*ADVR
N05  I*             SVBELT                      I_SVBELT
      *_____
      * INIT
      *"""""
     C                   EXSR      INIT
      *___________________________________
      * Slett poster i ZAEV som er plukket
      *"""""""""""""""""""""""""""""""""""
     C     *LOVAL        SETLL     ZAEFL01
     C                   READ      ZAEFL01                                56
     C                   DOW       *IN56 = *OFF
     C                   IF        SFAVD <> 0
     C                   IF        SFOPDN <> 0
     C                   DELETE    SADFR
     C                   ENDIF
     C                   ENDIF
     C                   READ      ZAEFL01                                56
     C                   ENDDO
      *_________________________________________________
      * Slett poster i ZAEV som ikke har tilhörende ZAEF
      *"""""""""""""""""""""""""""""""""""""""""""""""""
     C     *LOVAL        SETLL     ZAEVL01
     C                   READ      ZAEVL01                                53
     C                   DOW       *IN53 = *OFF
     C     ZAEFK         CHAIN     ZAEFL01                            55
     C                   IF        *IN55
N02
     C                   DELETE    SAEVR
     C                   ENDIF
N02
     C                   READ      ZAEVL01                                53
     C                   ENDDO

     C                   EVAL      *INLR=*ON
      *______________________________________________
     C     INIT          BEGSR
      *""""""""""""""""""""""""""""""""""""""""""""""
N02  C     ZAEFK         KLIST
N02  C                   KFLD                    SVUNIK
N02  C                   KFLD                    SVREFF
N02  C     ZAEVJK        KLIST
N02  C                   KFLD                    SVREFF
N02  C                   KFLD                    SVUNIK
N02  C                   KFLD                    SVLI
     C                   ENDSR
