     FZBARC     O    F   66        PRINTER
     C                   EXSR      CALIBR
     C                   SETON                                        LR
     C                   RETURN
      ********************************************************************
     C     CALIBR        BEGSR
      ********************************************************************
      * Calibrate skriver
     C*                  MOVE      *BLANKS       DATA             66
     C*                  MOVEL     '^XA'         DATA
     C*                  EXCEPT    ZBARCA
      *
     C                   MOVE      *BLANKS       DATA             66
     C                   MOVEL     '~JC'         DATA
     C                   EXCEPT    ZBARCA
      *
     C*                  MOVE      *BLANKS       DATA             66
     C*                  MOVEL     '^XZ'         DATA
     C*                  EXCEPT    ZBARCA
     C                   ENDSR
      *
     OZBARC     E            ZBARCA
     O                       DATA
