     FADRUNNRF  UP   e           K DISK
      *
     c     ',':'.'       xlate     ADSEDD        ADSEDD
      *
     c                   if        ADKLAS = *blanks
     c     '('           scan      ADSEDD        x                 3 0
     c                   if        x = 0
     c                   eval      ADKLAS = ADSEDD
     c                   else
     c                   eval      ADKLAS = %subst(ADSEDD:1:x-1)
     c                   endif
     c                   endif
      *
     c                   update    ADRUNNRR
      *
