     FARKIVP    IF   E             DISK
     FWRKIVP    UF A E             DISK
     DWRLINK           S             40
     C                   READ      ARKIVP                                 51
     C     *IN51         DOWEQ     *OFF
     C     '.'           SCAN      ARLINK        X                 2 0    20
     C                   EVAL      WRLINK=ARLINK
     C     X             IFNE      *ZEROS
     C                   SUB       1             X
     C                   EVAL      ARLINK=*BLANKS
     C     X             SUBST     WRLINK:1      ARLINK
     C                   ENDIF
     C     arlink        ifne      *blanks
     C                   WRITE     WRKIVR
     c                   end
     C                   READ      ARKIVP                                 51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
