     FARKEPO    UF   E           K DISK
     c     *entry        plist
     c                   parm                    uusr             10
     c                   move      '0'           *in(33)
     c     uusr          setll     arkepo
     c     *in(33)       doweq     '0'
     c     uusr          reade     arkepo                                 33
     c     *in(33)       ifeq      '0'
     c                   delete    arkepor
     c                   end
     c                   end
     c                   seton                                        lr
     c                   return
