********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 Ny parameter sammenslå PDF
10XXX * 02 SH  PTF11 kode for upload info dokumenter
10XXX * 03 SH  PTF11 kjøres nas
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE arkivlager                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FFIRM      IF   E           K DISK
     FFIRMARC   UF A E           K DISK
     FARC025FM  CF   E             WORKSTN
     C*
     C                   READ      FIRM                                   30
     c                   move      fifirm        arcfir
     c     arcfir        chain(n)  firmarc                            33
     C                   MOVE      ARCPAD        WRCPAD
     C                   MOVE      ARCANE        WRCANE
     C                   MOVE      ARCPAE        WRCPAE
     C                   MOVE      ARCINF        WRCINF
     C                   MOVE      ARCL1         WRCL1
N01  C                   MOVE      ARCMRG        WRCMRG
N02  C                   MOVE      ARINF         WRINF
N02  C                   MOVE      ARNAS         WRNAS
     C                   EXFMT     BILDE01
     c   12              goto      slutt
     c     arcfir        chain     firmarc                            33
     C                   MOVE      WRCPAD        ARCPAD
     C                   MOVE      WRCANE        ARCANE
     C                   MOVE      WRCPAE        ARCPAE
     C                   MOVE      WRCINF        ARCINF
     C                   MOVE      WRCL1         ARCL1
N01  C                   MOVE      WRCMRG        ARCMRG
N02  C                   MOVE      WRINF         ARINF
N03  C                   MOVE      WRNAS         ARNAS
     C   33              WRITE     FIRMARCR
     C  N33              UPDATE    FIRMARCR
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
