********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 arkivvarfiabel utvidet
10XXX0* 02 SH  PTF10 max record
10XXX0* 03 SH  PTF10 rettelse til 2
10XXX0* 04 SH  PTF10 DIV KORR
10XXX0* 05 SH  mer info ref/tur / kunde
10XXX0* 06 SH  ptf11  slasj test
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VISE ARKIVLOGG                         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
N05  FFIRM      IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FARKLOGH1  IF   E           K DISK
     FARKLOGD   IF   E           K DISK
N05  FCUNDL01   IF   E           K DISK
     FARC013FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
s01  D* epdata                 1     80
s01  D* sfdata                 1     78
s01  D* sfATTA                 1      8
     D                SDS
     D  UUSER                254    263
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     STARTK        SETll     ARKLOGD
     C     START1        TAG
      *
     C     startk        READe     ARKLOGD                                94
      *
     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C     ATT           IFEQ      'J'
n01  c                   move      *blanks       NY152           152
n06  c                   movel     epdata        slasj             1
n06  c     slasj         ifne      '/'
n06  C     uhttp         CAT       '/':0         uhttp
n06  c                   end
n01  C                   MOVEL     UHTTP         NY152
s01  C*                  MOVEL     UHTTP         NY78             78
n01  C                   MOVEL     UHTTP         NY152
n01  c                   move      epdata        sistep            1
s01  C*    NY78          CAT       SFDATA:0      NY78
n01  C     NY152         CAT       EPDATA:0      NY152
s01  C*                  MOVEL     NY78          SFDATA
n01  C                   MOVEL     NY152         SFDATA
      *
      * skjekk lang lenke
      *
n01  c     sistep        ifne      *blanks
n01  c     startk        reade     arklogd                                94
n01  C  n94SFDATA        CAT       EPDATA:0      SFDATA
n01  C                   END
n01  c                   else
N04  C                   MOVE      *BLANKS       SFDATA
n01  c                   movel     epdata        sfdata
n04  c                   move      epdata        sistep            1
N04  C     SISTEP        IFNE      *BLANKS
n04  c     startk        reade     arklogd                                94
n04  c  N94              MOVEL     epdata        sfatta            8
N04  C  N94SFATTA        IFNE      'attachme'
n04  C     SFDATA        CAT       EPDATA:0      SFDATA
N04  C                   ELSE
N04  C     STARTK        READPE    ARKLOGD
N04  C                   END
N04  C                   END
n01  C                   END
     C                   WRITE     SUBFIL
n01  c                   MOVEL     epdata        sfatta            8
     C     SFATTA        IFEQ      'attachme'
     C                   MOVE      'J'           ATT               1
     C                   END
     C
     C     startk        READe     ARKLOGD                                94
s03  C*    zrecno        comp      9000                               94
n03  C  N94zrecno        comp      9000                               94
     C  N94              END
     C*
     C                   Z-ADD     1             ZRECNO
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    uunik             9 0
     C     STARTK        KLIST
     C                   KFLD                    epunik
N05  C     KUNKEY        KLIST
N05  C                   KFLD                    fifirm
N05  c                   kfld                    epkund
     C     ROLKEY        KLIST
     C                   KFLD                    epunik
     C*
     C*
     C                   MOVE      uunik         epunik
     c     startk        chain     arklogh1                           33
     c                   read      firmarc                                33
     C                   move      *blanks       uhttp            78
     c                   movel     'http://'     uhttp
     C     uhttp         CAT       arcpad:0      uhttp
n05  c                   read      firm                                   33
n05  c     kunkey        chain     cundl01                            33
n05  c  N33              movel     knavn         navn20
     C                   ENDSR
     C*
