********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 tillegg til arkiv
10XXX * 02 SH  PTF10 epost til økt fra 50 til 70
      *----------------------------------------------------
      *      PTF  11
      *----------------------------------------------------
10XXX * 03 SH  PTF11 type P=prisforespørsel R=reklamasjon
10XXX * 04 SH  PTF11 NYE FELT I WORKFIL
10XXX * 05 SH  PTF10 user i parameter
********************************************************************
      *
     Farklogh   O  A E             DISK
     Farklogd   O  A E             DISK
     Farklogt   UF a E           K DISK
     Farksrc    O    E             DISK
     F                                     RENAME(arksrc:arcdat)
     Farkepol2  uF   E           K DISK
     D                 DS
     D  TX                     1   2160
     D                                     DIM(18)
     D  DATA1                  1    120
     D  DATA2                121    240
     D  DATA3                241    360
     D  DATA4                361    480
     D  DATA5                481    600
     D  DATA6                601    720
     D  DATA7                721    840
     D  DATA8                841    960
     D  DATA9                961   1080
     D  DATA10              1081   1200
     D  DATA11              1201   1320
     D  DATA12              1321   1440
     D  DATA13              1441   1560
     D  DATA14              1561   1680
     D  DATA15              1681   1800
     D  DATA16              1801   1920
     D  DATA17              1921   2040
     D  DATA18              2041   2160
N07  D CrLf            c                   x'0D25'
     D                 DS
     D                 DS
     D  eptext                 1     77
     D  eptex1                 1     15
     D  eptex2                16     75
     D                 DS
     D  XULTID                 1     14  0
     D  eptime                 1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D  XULDDMM                7     10  0
     D  XULÅÅ2                13     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  epdate                 1      8  0
     D                 DS
     D  srcdta                 1    160
     D  epdataa                1     80
     D  epdatab               81    160
     D  src008                 1      8
s05  D*               SDS
s05  D* UUSER                254    263
     C     *ENTRY        PLIST
s02  C*                  PARM                    eptil            50
n02  C                   PARM                    eptil            70
     C                   PARM                    epcove           80
     C                   PARM                    DATA1U          120
     C                   PARM                    DATA2U          120
     C                   PARM                    DATA3U          120
     C                   PARM                    DATA4U          120
     C                   PARM                    DATA5U          120
     C                   PARM                    DATA6U          120
     C                   PARM                    DATA7U          120
     C                   PARM                    DATA8U          120
     C                   PARM                    DATA9U          120
     C                   PARM                    DATA10U         120
     C                   PARM                    DATA11U         120
     C                   PARM                    DATA12U         120
     C                   PARM                    DATA13U         120
     C                   PARM                    DATA14U         120
     C                   PARM                    DATA15U         120
     C                   PARM                    DATA16U         120
     C                   PARM                    DATA17U         120
     C                   PARM                    DATA18U         120
n01  c                   PARM                    av                4
n01  c                   PARM                    op                7
n01  c                   PARM                    tu                8
n01  c                   PARM                    ku                8
n03  c                   PARM                    type              1
n05  c                   PARM                    uuser            10
n01  c                   move      av            EPAVD
n01  c                   move      op            EPOPD
N04  C                   MOVE      'J'           EPMAIN
n01  c                   move      tu            EPTUR
n01  c                   move      ku            EPKUND
s03  c*                  move      'M'           epauto
n03  c                   move      type          epauto
      *
     C                   MOVE      DATA1U        DATA1           120
     C                   MOVE      DATA2U        DATA2           120
     C                   MOVE      DATA3U        DATA3           120
     C                   MOVE      DATA4U        DATA4           120
     C                   MOVE      DATA5U        DATA5           120
     C                   MOVE      DATA6U        DATA6           120
     C                   MOVE      DATA7U        DATA7           120
     C                   MOVE      DATA8U        DATA8           120
     C                   MOVE      DATA9U        DATA9           120
     C                   MOVE      DATA10U       DATA10          120
     C                   MOVE      DATA11U       DATA11          120
     C                   MOVE      DATA12U       DATA12          120
     C                   MOVE      DATA13U       DATA13          120
     C                   MOVE      DATA14U       DATA14          120
     C                   MOVE      DATA15U       DATA15          120
     C                   MOVE      DATA16U       DATA16          120
     C                   MOVE      DATA17U       DATA17          120
     C                   MOVE      DATA18U       DATA18          120
      *
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     c                   move      uuser         epuser
      *
      * henter neste teller
      *
     c                   move      'A'           eptelk
     c     keytel        klist
     c                   kfld                    eptelk
     c     keytel        chain     arklogt                            33
     c                   add       1             epunik
     c  N33              update    arklogtr
     c   33              write     arklogtr
      *
      * skriver første loggpost
      *
     c                   movel     epcove        srcdta
     C                   movel     epcove        EPDATA
     c                   write     arkloghr
     c                   write     arklogdr
      *
      * skriver linjene
      *
      *
     C                   DO        18
     c                   move      *blanks       srcdta
     C                   ADD       1             NR                2 0
     C     TX(NR)        IFNE      *BLANKS
     c                   add       1             srcseq
     C                   MOVEL     TX(NR)        SRCDTA
     C                   WRITE     ARCDAT
     c                   move      epDATAa       epdata
     c                   write     ARKLOGDR
     c     epdatab       ifne      *blanks
     c                   move      epdatab       epdata
     c                   write     arklogdr
     C                   END
     C                   END
     C                   ENDDO
      *
      *
     C                   SETON                                        LR
     C                   RETURN
