     FFIRMARC   IF   E           K DISK
     c     *entry        plist
     c                   parm                    ujanei            1
     c                   move      'N'           ujanei
     c                   read      firmarc                                33
     c  N33ArcFir        ifne      *blanks
     c                   move      'J'           ujanei
     c                   end
     c                   seton                                        lr
     c                   return
