********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF10 merker klarmeldte til K
10XXX * 02 sh  PTF12 plusser på en jobb for sikkerhetsskyld
********************************************************************
      *
     H DECEDIT(',') debug(*yes)
      ***********************************************************
      *** PROGRAM test om flere fakturaer på bruker
      ***********************************************************
s01  F*RKIVL01  IF   E           K DISK
n01  FARKIVL01  UF   E           K DISK
      *
     C*
     C     *ENTRY        PLIST
     c                   parm                    utype             2
     c                   parm                    UUSER            10
     c                   parm                    antall            3 0
      *
     c                   z-add     0             antallx           3 0
      *
     c     key           klist
     c                   kfld                    XXSTAT            1
     c                   kfld                    xxUSER
     c                   kfld                    xxtype
     c                   move      utype         xxtype            2
     c                   move      UUSER         xxUSER           10
     c     key           setll     arkivl01
     c     *in33         doweq     '0'
     c     key           reade     arkivl01                               33
     c     *in33         ifeq      '0'
     c     antallx       andle     998
      * kan kalle generering
     c                   add       1             antallx
n01  c                   move      'K'           arstat
n01  c                   update    arkivr
     c                   end
     c                   end
s02  c*                  move      antallx       antall
n02  c     antallx       add       1             antall
     c                   seton                                        lr
     c                   return
