********************************************************************
      * Skriver til epostlogg
********************************************************************
      *
     Farklogh   O  A E             DISK
     Farklogd   O  A E             DISK
     Farklogt   UF a E           K DISK
     Farksrc    IP   E             DISK
     F                                     RENAME(arksrc:arksrcr)
     D                 DS
     D  srcdta                 1    160
     D  epdataa                1     80
     D  epdatab               81    160
     D  src008                 1      8
     D                 DS
     D  XULTID                 1     14  0
     D  eptime                 1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D  XULDDMM                7     10  0
     D  XUL≈≈2                13     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  epdate                 1      8  0
     D                SDS
     D  UUSER                254    263
      *
     c  n99              exsr      init
     c  n99              seton                                        99
      *
      *
      * skriver linjene
      *
      *
     c                   movel     srcdta        epdata
     c                   write     arklogdr
      *
      *
     c***********************************************************************
     c     init          begsr
     c************************************************************************
     C     *ENTRY        PLIST
     C                   PARM                    eptili           50
     C                   PARM                    epcove           70
     c                   PARM                    av                4
     c                   PARM                    op                7
     c                   PARM                    tu                8
     c                   PARM                    ku                8
     c*
     c                   eval      eptil=eptili
     c                   move      av            EPAVD
     c                   move      op            EPOPD
     c                   move      tu            EPTUR
     c                   move      ku            EPKUND
     c                   move      'P'           epauto
      *
      *
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     c                   move      uuser         epuser
      *
      * henter neste teller
      *
     c                   move      'A'           eptelk
     c     keytel        klist
     c                   kfld                    eptelk
     c     keytel        chain     arklogt                            33
     c                   add       1             epunik
     c  N33              update    arklogtr
     c   33              write     arklogtr
      *
      * skriver f¯rste loggpost head og detail
      *
     C                   movel     epcove        EPDATA
     c                   write     arkloghr
     c                   write     arklogdr
     c                   endsr
