********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8XXX * 01 SH  PTF8 test date slutt    .....
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL kopiere til cdbrenning
      ***********************************************************
      *
     Farkivl07  UF   E           K DISK
     Ffirm      IF   E           K DISK
     Ffirmarc   IF   E           K DISK
     Farktxt    IF   E           K DISK
     D                 DS
     D  DSTID                  1     14  0
     D  UDATO                  1      6  0
     D  UDAG                   7      8  0
     D  UMND                   9     10  0
     D  UAAR                  11     14  0
     C*
     C                   EXSR      INIT
     C*
      *
      * sletter PDF
      *
     c                   EXSR      DELPDF
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     keypdf0       klist
     c                   kfld                    fifirm
     c                   kfld                    aatype            2
     c                   kfld                    stdato
     c                   z-add     20080308      stdato            8 0
     c                   z-add     20080311      sldato            8 0
     c                   move      'fa'          aatype
     c     keypdf1       klist
     c                   kfld                    fifirm
     c                   kfld                    aatype
      *
     C                   TIME                    DSTID            14 0
     c                   move      *blanks       bane             40
     c                   move      *blanks       umappe           15
     C*
     c                   read      firm                                   33
     c                   read      firmarc                                33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DELPDF        BEGSR
     C***********************************************
     C*
     c                   setoff                                       34
     c     keypdf0       setll     arkivl07
     c     *in(34)       doweq     '0'
     c     keypdf1       reade     arkivl07                               34
N01  c  N34ARDATE        comp      sldato                             34
     c     *in(34)       ifeq      '0'
     c     arlink        andne     *blanks
     c                   eval      ARUSER = 'SYSTEMA'
     c                   eval      ARSTAT = ' '
     c                   update    arkivr
     c     arlink        ifne      arlinkfo
     c     arlink        andne     *blanks
     c                   exsr      delpdf2
     c                   end
     c                   move      arlink        arlinkfo         40
     c                   end
     c                   end
     c                   endsr
     C*
     C***********************************************
     C     DELPDF2       BEGSR
     C***********************************************
     C*
     c                   move      *blanks       fradok           70
     c                   movel     arcane        fradok
     C     fradok        CAT       '/':0         fradok
     C     fradok        CAT       arlink:0      fradok
     C     fradok        CAT       '.pdf':0      fradok
     c                   call      'ARC041C1'
     c                   parm                    fradok
     c                   endsr
