      *
      ***********************************************************
      *** PROGRAM SKAL PLUKKE ARKIVTYPER                ***
      ***********************************************************
     Ffirmarc   iF   E           K DISK
     FARKIVL02  UP   E           K DISK
     c  N99              read      firmarc                                33
     c  N99              seton                                        99
     c     artype        ifeq      'aw'
     C     arlink        ifeq      *blanks
     c                   delete    arkivr
     c                   end
      *
     c     arlink        ifne      *blanks
     C     aravd         andeq     aravdfo
     C     aropd         andeq     aropdfo
      *
     c                   delete    arkivr
     c                   move      *blanks       ubanesta         70
     C                   movel     '/'           ubanesta
     C     ubanesta      CAT       arcane:0      ubanesta
     C     ubanesta      CAT       '/':0         ubanesta
     C     ubanesta      cat       arlink:0      ubanesta
     c                   call      'ARCDEL'
     c                   parm                    ubanesta
     c                   end
     c                   end
     c                   move      aravd         aravdfo           4 0
     c                   move      aropd         aropdfo           7 0
