      ***********************************************************
      *** PROGRAM for arkivering
      ***********************************************************
     FFIRMARC   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FFAK3      IF   E           K DISK
     FARKIVL06  UF   E           K DISK
     D                SDS
     D  UUSR                 254    263
      *
      *
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        ARFIRM
     C                   READ      FIRMARC                                33
      *
     c     KEYARK        KLIST
     c                   kfld                    fifirm
     c                   kfld                    artype
      *
      *
     c                   exsr      singel
      *
      *
     c                   move      'sb'          artype
     c                   call      'ARC002CLB'
     c                   parm                    artype
     c                   parm                    uusr
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      ************************************************************************
     c     singel        begsr
      ************************************************************************
     c                   move      'sb'          artype
      *
     C     KEYARK        SETLL     ARKIVL06
     C                   SETOFF                                       33
      *
      *
     C     *IN(33)       DOWEQ     '0'
     C     KEYARK        READE     ARKIVL06                               33
     c     *in(33)       ifeq      '0'
      *
      *
     C                   move      *BLANKS       ubane           256
     C                   movel     '/'           ubane
     C     ubane         CAT       arcane:0      ubane
     C     ubane         CAT       '/':0         ubane
     C     ubane         CAT       ARLINK:0      ubane
     C     ubane         CAT       '.pdf':0      ubane
     c                   call      'SYGE35CL'
     c                   parm                    UBANE
     c                   parm                    fins              1
     c                   move      *blanks       ARFRI
     c     FINS          ifeq      '1'
      *
      * skjekk om faktura i det hele tatt finnes
      *
     C                   MOVE      *BLANKS       ARUSER
     c                   movel     uusr          aruser
     c                   move      ' '           arstat
     C                   MOVEL     'NEI'         ARFRI
     C                   UPDATE    ARKIVR
     C                   ELSE
     C                   MOVEL     'JA'          ARFRI
     C                   UPDATE    ARKIVR
     C                   END
     C                   ENDIF
     C                   ENDDO
     c                   endsr
