********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P9XXX * 01 YBC PTF9 LAGE POST HVIS FIL ER TOM
********************************************************************
*****F**************************************************************
      * tildeler randomverdi
"""""F*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
S01  F*charpf    UF   E           K DISK
N01  Fcharpf    UF A E           K DISK
      ***********************************************************
      *** PROGRAM for randomverdi
      ***********************************************************
     D                 DS
     D  B                      1     99
     D                                     DIM(99)                              Output string
     D  CHARP                  1     99
     D                 DS
     D  A                      1     10
     D                                     DIM(10)                              Output string
     D  RES                    1     10
     D                 DS
     D  XULTID                 1     14  0
     D  numval                 1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
      *
      *
     C     *ENTRY        PLIST
     c                   parm                    urand            10
     C                   Z-ADD     1             RUNDE             2 0
     c     'A'           chain     charpf                             33
N01  C                   IF        *IN33
N01  C                   EVAL      CHARK = 'A'
N01  C                   EVAL      CHARP = 'abcdefghijklmnopqrstuvwxyz'
N01  C                             + 'ABCDEFGHIJKLMNOPQRSTUVW'
N01  C                             + '0123456789POIUYTREWQasdfghjkl'
N01  C                             + '951364782wertyuijklmn'
N01  C                   EVAL      CHSIST = 0
N01  C                   WRITE     CHARR
N01  c     'A'           chain     charpf                             33
N01  C                   END
     c  N33              add       1             chsist
     c  N33              update    charr
     c                   time                    xultid
     C                   Z-ADD     1             N2                2 0
     C                   DIV       RUNDE         numval
     c*
     C     START         TAG
     c                   move      numval        work
     C     N2            IFNE      *ZEROS
     C                   DIV       N2            WORK             15 0
     C                   END
     C
     C                   MOVE      WORK          NR                2 0
     C                   ADD       NG            NR
     C                   ADD       chsist        NR
     C     NR            IFGT      0
     C                   MOVE      B(NR)         A(N2)
     C                   MOVE      NR            NG                2 0
     C     N2            IFEQ      10
     C                   GOTO      SLUTT
     C                   END
     C                   ADD       1             N2
     C                   END
     C                   ADD       N2            numval
     C                   GOTO      START
     c*
     C     SLUTT         TAG
     c                   movel     res           urand
      *
      *
     c                   seton                                        lr
     c                   return
