      *********************************************************************
      *
      *  CRTPGM SYSPED/ESTK11 MODULE(*LIBL/ESTK11 *LIBL/INCGI)
      *         ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
N01   * 01 JOV PTF9 ##INGEN HVIS 0 RECORDS
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FQ1024     IF   F 1024        DISK    USROPN
      *********************************************************************
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      /copy syspeds/qrpgsrcpy,variables3
      *
      * Client input variables
xxxxxD user            s             10
xxxxxD TIMN            s              3  0
xxxxxD MINN            s              2  0
xxxxxD FIL             s            100
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
     D ItemCount       s             10i 0
     D i               s             10i 0
N02  D                 DS
N02  D  ES_PATH                1    100
N02  D  ESPED                  1      5
N02  D  PATH                   6     50
N02  D  OMR                   51     60
N02  D  TIM                   61     63
N02  D  MIN                   64     65
N02  D  UNTYPE                66     69
     IQ1024     NC  01
     I                                  1 1024  Data
      /copy syspeds/qrpgsrcpy,prolog3
      *
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input / cvt to numeric
     C                   exsr      Parse
      * File open / keys
     C                   EXSR      INIT
      * Read output skeleton html member into memory
     C                   exsr      LoadHtml
      * Set section variables
     C                   exsr      SetAll
      * Quit
     C                   exsr      Exit
      *
     C                   eval      *inlr = *on
     C                   return
      *
      *
      *=====================================================================
      * Parse input / cvt to numeric
      *=====================================================================
     C     Parse         begsr
      * Parse variables from QUERY_STRING environment variable
xxxxxC                   eval      user = zhbgetvar('user')
xxxxxC                   eval      OMR  = zhbgetvar('OMR')
xxxxxC                   eval      TIM  = zhbgetvar('TIM')
     C                   eval      TIMN = c2n2(TIM)
     C                   MOVE      TIMN          TIM
xxxxxC                   eval      MIN  = zhbgetvar('MIN')
     C                   eval      MINN = c2n2(MIN)
     C                   MOVE      MINN          MIN
xxxxxC                   eval      PATH = zhbgetvar('PATH')
xxxxxC                   eval      UNTYPE= zhbgetvar('UNTYPE')
     C                   endsr
      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   CLOSE     BRIDF
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     LoadHtml      begsr
     C                   callp     gethtml('HTMLSRC':
     C                             '*LIBL':
     C                             'ESTK11':'/CGITAG/')
     C                   endsr
      *=====================================================================
      *  Set variable data for section /$top , lin , Bot
      *=====================================================================
     C     SetAll        begsr
      * Send section top
     C                   callp     wrtsection('top')
S01  C*                  callp     updHTMLvar('LINTXT':'##OK')
S01  C*                  callp     wrtsection('lin')
      *
     C****               EVAL      FIL = '*ES* '+PATH+OMR+TIM+MIN+UNTYPE
     C                   EVAL      ESPED  = '*ES* '
     c                   move      ES_PATH       FIL
     C                   CALL      'SYTK11CLE'
     C                   PARM                    FIL
      *
N01  C                   MOVE      *ZEROS        ANTREC            5 0
     C                   OPEN      Q1024
     C                   READ      Q1024                                  35
     C     *IN35         DOWEQ     *OFF
N01  C                   ADD       1             ANTREC
N01  C     ANTREC        IFEQ      1
N01  C                   callp     updHTMLvar('LINTXT':'##OK')
N01  C                   callp     wrtsection('lin')
N01  C                   END
     C                   callp     updHTMLvar('LINTXT':Data)
     C                   callp     wrtsection('lin')
     C                   READ      Q1024                                  35
     C                   END
     C                   CLOSE     Q1024
N01  C     ANTREC        IFEQ      0
N01  C                   callp     updHTMLvar('LINTXT':'##INGEN')
N01  C                   callp     wrtsection('lin')
N01  C                   END
      *
      * Send section bot
     C                   callp     wrtsection('bot')
     C
     C                   endsr
     C
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     USER          CHAIN     BRIDF                              50
      * Ugyldig userID
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C     UtInit        endsr
