     H DEBUG(*YES)
      *
      ***********************************************************
      *** PROGRAM FOR PRINTING INVOICE'S                      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-26                      ***
      *** LEDIGE INDIKATORER 27-29 31       65-69             ***
      ***                    74-78 82-87 92-96 98             ***
      ***********************************************************
      * 35 = IKKE GIRO SKRIVES
      * 50 = SAMLEFAKTURERING
      * 51 = PARAMETER UKOPI = J  NOT IF UIN05=1(FROM BORDEREAU)
      * 52 = EXPORT
      * 53 = AIR
      * 54 = PAREMETER UKOPI = J AND UIN05=1(FROM BORDEREAU)
      * 65 = VED FAX EMAIL
      * 70 = INVOICE IN ENGLISH
      * 71 = INVOICING IN OWN CURRENCY
      * 73 = CREDITNOTE
      * 79 = INVOICE IN GERMAN
      *
      *
     FXMLUFF    O  A E             DISK
     FBAGIRO    IF   E           K DISK
     FCUNDC03   IF   E           K DISK
     FARKTXT    IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FARKIVP    O  A E             DISK
     FAVFRHL01  IF   E           K DISK
     FFIRKID    UF   E           K DISK
     FKIDTRAN   UF A E           K DISK
     FTRACKF    O  A E           K DISK
     FTRACKL02  IF   E           K DISK
     F                                     RENAME(trackfr:trackf2)
     FBILLOF    IF   E           K DISK
     FBLV1LF    IF   E           K DISK
     FBLV2LF    IF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FFAKT      UF   E           K DISK
     FFAK4      IF   E           K DISK
     F                                     RENAME(FAKTR:FAKTR4)
     FFAK3      IF   E           K DISK
     F                                     RENAME(FAKTR:FAKTR3)
     FFAK9      IF   E           K DISK
     F                                     RENAME(FAKTR:FAKTR9)
     FFAKTXT    IF   E           K DISK
     FSORT      UF A E           K DISK
     FDUMBO     IF   E           K DISK
     FKODSAM    IF   E           K DISK
     FKODTFM    IF   E           K DISK
     FDISP      IF   E           K DISK
     FTURER     IF   E           K DISK
     FFREETXT2  UF   E           K DISK
     FFAIN      IF A E           K DISK
     FHEADF     UF   E           K DISK
     FFERDF     UF   E           K DISK
     FFERDL01   UF   E           K DISK
     F                                     RENAME(FERDR:FERDR2)
     FHEAD1     IF   E           K DISK
     F                                     RENAME(HEADFR:HEADFR2)
     FHEAD3     IF   E           K DISK    USROPN
     F                                     RENAME(HEADFR:HEADFR3)
     FHEAD7     IF   E           K DISK    USROPN
     F                                     RENAME(HEADFR:HEADFR7)
     FHEAD11    IF   E           K DISK    USROPN
     F                                     RENAME(HEADFR:HEADFR11)
     FMULTKODT  IF   E           K DISK
     FHODEFAX   IF   E           K DISK
     F                                     RENAME(HODER:HODERF)
     FHODE      IF   E           K DISK
     FSTED2D    IF   E           K DISK
     F                                     RENAME(STED2R:STED2R2)
     FSTED2     IF   E           K DISK
     FfIRM      IF   E           K DISK
     Ftellfa    uF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FCUSAAV    IF   E           K DISK
     FCUSAPR    IF   E           K DISK
     FCUIFAK    IF   E           K DISK
     FSAML      UF A E           K DISK
     FDOKUF     IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FKODFRI    IF   E           K DISK
     FKODWL01   IF   E           K DISK
     FSYFA20FM  CF   E             WORKSTN USROPN
     FSYFA20P   O    E             PRINTER
     FSYFA20PG  O    E             PRINTER
     FSYFA20PS  O    E             PRINTER
     FSYFA20PT  O    E             PRINTER
     FSYFA20PD  O    E             PRINTER
     FFAKTURA   O    F   80        PRINTER OFLIND(*INOF)
     F                                     FORMLEN(72)
     F                                     FORMOFL(72)
     D HO              S             80    DIM(10)
     D HE              S             80    DIM(10)
     D HT              S             80    DIM(10)
     D MN1             S             17    DIM(11)
     D MN2             S             51    DIM(11)
     D MN3             S             17    DIM(99)
     D MN4             S             51    DIM(99)
     D XS              S             37    DIM(90)
     D FTX             S             40    DIM(100)
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZUSER                254    263
     D                 DS
     D  XBRUTT                 1     13  2
     D  CBRUTT                 1     13  2
     D                 DS
     D  DFS                    1     10
     D                                     DIM(10)
     D  FSDOKK                 1     10
     D                 DS
     D  HERFA                  1     15
     D  XRFA                   1     15
     D                 DS
     D  XLBNA                  1     30
     D  XLBNA2                 1     30
     D                 DS
     D  XVHNA                  1     30
     D  XVHN2                  1     30
     D                 DS
     D  XOBNA                  1     25
     D  XOBNA2                 1     25
     D                 DS
     D  HETRCN                 1     17
     D  XTRCN                  1     17
     D                 DS
     D  XVAL                   1      3
     D  XVAL2                  1      3
     D                 DS
     D  XPFNOK                 1     13  2
     D  XPFNO2                 5     13  2
     D                 DS
     D  XPMOMS                 1     13  2
     D  XPMOM2                 6     13  2
     D                 DS
     D  XMVAGR                 1     13  2
     D  XMVAG2                 5     13  2
     D                 DS
     D  BLREIS                 1     14
     D  BLREI2                 1     14
     D                 DS
     D  BLBLNR                 1     16
     D  BLBLN2                 1     16
     D                 DS
     D  XBAK                   1      1  0
     D  ABAK                   1      1
     D  KBAK                   1      1
     D  XTOTØR                13     14  0
     D  ATOTØR                13     14
     D  ATOTØK                13     14
     D  KTOTØR                13     14  0
     D                 DS
     D  A                      1     11
     D                                     DIM(11)
     D  ATOTKR                 1     11
     D  ATOTKK                 1     11
     D                 DS
     D  FADAFÅ                 1      4  0
     D  FADAFM                 5      6  0
     D  FADAFD                 7      8  0
     D  FADAFF                 1      8  0
     D                 DS
     D  IDAGÅ                  1      4  0
     D  IDAGM                  5      6  0
     D  IDAGD                  7      8  0
     D  IDAG8                  1      8  0
     D  IDAG                   3      8  0
     D                 DS
     D  IDAGXD                 1      2  0
     D  IDAGXM                 3      4  0
     D  IDAGXÅ                 5      6  0
     D  IDAGX                  1      6  0
     D                 DS
     D  XFFDTD                 1      2  0
     D  XFFDTM                 3      4  0
     D  XFFDTÅ                 5      6  0
     D  XFFDT                  1      6  0
     D                 DS
     D  WSMMÅÅ                 1      4  0
     D  WSMÅM                  1      2  0
     D  WSMÅÅ                  3      4  0
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  XDTD                   1      2  0
     D  XDTM                   3      4  0
     D  XDTÅ                   5      6  0
     D  XDT                    1      6  0
     D                 DS
     D  TVATK                  1      1
     D  TVATK2                 1      1
     D                 DS
     D  HEFT1                  1     51
     D  HEFT1A                 1     30
     D  HEFT1B                31     45
     D                 DS
     D  WSFDAD                 1      2  0
     D  WSFDAM                 3      4  0
     D  WSFDAA                 5      6  0
     D  WSFDAT                 1      6  0
     D  FDATOK                 1      6  0
     D                 DS
     D  SOLNR                  1      3  0
     D  KG2SRT                 1      3  0
     D                 DS
     D  SOAVD                  4      7  0
     D  FAAVD                  4      7  0
     D  SOOPD                  8     14  0
     D  FAOPD                  8     14  0
     D  SOSK                  15     15
     D  FASK                  15     15
     D  SOVK                  16     18
     D  FAVK                  16     18
     D  SOVT                  19     38
     D  FAVT                  19     38
     D  XFAVT1                19     19
     D  XFAVT2                20     38
     D  SOVAL                 39     41
     D  FAVAL                 39     41
     D  SOBELV                42     54  2
     D  FABELV                42     54  2
     D  SOKDM                 55     55
     D  FAKDM                 55     55
     D  SOBELN                56     68  2
     D  FABELN                56     68  2
     D  SOSAMM                69     69
     D  FACD11                69     69
     D  SOLI                  70     74  0
     D  FALI                  70     74  0
     D                 DS
     D  HOHT1                  1     80
     D  HOHT2                 81    160
     D  HOHT3                161    240
     D  HOHT4                241    320
     D  HOHT5                321    400
     D  HOHT6                401    480
     D  HOHT7                481    560
     D  HOBT1                561    640
     D  HOBT2                641    720
     D  HOBT3                721    800
     D  HP                     1    800
     D                                     DIM(10)
     D                 DS
     D  WSOT1                  1      2
     D  WSOT2                  3      4
     D  WSOT3                  5      6
     D  WSOT4                  7      8
     D  WSOT5                  9     10
     D  WSOT6                 11     12
     D  OT                     1     12
     D                                     DIM(6)
     D                 DS
     D  WSOP1                  1      7  0
     D  WSOP2                  8     14  0
     D  WSOP3                 15     21  0
     D  WSOP4                 22     28  0
     D  WSOP5                 29     35  0
     D  WSOP6                 36     42  0
     D  WSOP7                 43     49  0
     D  WSOP8                 50     56  0
     D  WSOP9                 57     63  0
     D  WSOP10                64     70  0
     D  WSOP11                71     77  0
     D  WSOP12                78     84  0
     D  WSOP13                85     91  0
     D  WSOP14                92     98  0
     D  WSOP15                99    105  0
     D  WSOP16               106    112  0
     D  WSOP17               113    119  0
     D  WSOP18               120    126  0
     D  WSOP19               127    133  0
     D  WSOP20               134    140  0
     D  WSOP21               141    147  0
     D  WSOP22               148    154  0
     D  WSOP23               155    161  0
     D  WSOP24               162    168  0
     D  WSOP25               169    175  0
     D  WSOP26               176    182  0
     D  WSOP27               183    189  0
     D  WSOP28               190    196  0
     D  WSOP29               197    203  0
     D  WSOP30               204    210  0
     D  WSOP31               211    217  0
     D  WSOP32               218    224  0
     D  WSOP33               225    231  0
     D  WSOP34               232    238  0
     D  WSOP35               239    245  0
     D  WF                     1    245  0 DIM(35)
     D                 DS
     D  WKID                   1     19
     D  XWKID                  1     19
     D  KWKID                  1     19
     D  KUNDNR                 1      8  0
     D  TEFFNR                 9     15  0
     D  XNULL                 16     19  0
     D                 DS
     D  AF                     1    210
     D  FF                     1    210  0
     D                                     DIM(30)
     D                 DS
     D  XTOTKR                 1     11  0
     D  KTOTKR                 1     11  0
     D                 DS
     D  XFBANK                 1     15
     D  KFBANK                 1     15
     D                 DS
     D  BANKG                  1     15
     D  B1                     1     15
     D                                     DIM(15)
     D                 DS
     D  BANKGK                 1     24
     D  B2                     1     24
     D                                     DIM(24)
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  TTTEXT                 1     70
     D  TTINT1                 1      9
     D  TTINVN                11     40
     D  TTINT2                44     50
     D  TTINVR                52     57
     D  ttread                44     59
     D                 DS
     D  FSSOK                  1     35
     D  FSSOKX                 1     15
     D                 DS
     D  SYRG                   1     14
     D  SYFOR1                 1      9
     D  SYFOR2                10     11
     D                 DS
     D  WITAXD                 1      8  0
     D  MVAATW                 1      4  0
     D  MVAMTW                 5      6  0
     D  MVADTW                 7      8  0
     D  WSMVAK         S              1    DIM(11)
     D  WSMVAP         S              4  2 DIM(11)
     D  WSVAL          S              3    DIM(11)
     D  WSGRLN         S             13  2 DIM(11)
     D  WSGRLV         S             13  2 DIM(11)
     D  WSMVAN         S              8  2 DIM(11)
     D  WSMVAV         S              8  2 DIM(11)
     D                 DS
     D  XMLT1                  1     44  2 DIM(11)
     D  XFMS01                 1      4  2
     D  XFMS02                 5      8  2
     D  XFMS03                 9     12  2
     D  XFMS04                13     16  2
     D  XFMS05                17     20  2
     D  XFMS06                21     24  2
     D  XFMS07                25     28  2
     D  XFMS08                29     32  2
     D  XFMS09                33     36  2
     D  XFMS10                37     40  2
     D  XFMS11                41     44  2
     D                 DS
     D  XMLT2                  1     33    DIM(11)
     D  XFMV01                 1      3
     D  XFMV02                 4      6
     D  XFMV03                 7      9
     D  XFMV04                10     12
     D  XFMV05                13     15
     D  XFMV06                16     18
     D  XFMV07                19     21
     D  XFMV08                22     24
     D  XFMV09                25     27
     D  XFMV10                28     30
     D  XFMV11                31     33
     D                 DS
     D  XMLT3                  1    143  2 DIM(11)
     D  XFMGN1                 1     13  2
     D  XFMGN2                14     26  2
     D  XFMGN3                27     39  2
     D  XFMGN4                40     52  2
     D  XFMGN5                53     65  2
     D  XFMGN6                66     78  2
     D  XFMGN7                79     91  2
     D  XFMGN8                92    104  2
     D  XFMGN9               105    117  2
     D  XFMGNA               118    130  2
     D  XFMGNB               131    143  2
     D                 DS
     D  XMLT4                  1    143  2 DIM(11)
     D  XFMGV1                 1     13  2
     D  XFMGV2                14     26  2
     D  XFMGV3                27     39  2
     D  XFMGV4                40     52  2
     D  XFMGV5                53     65  2
     D  XFMGV6                66     78  2
     D  XFMGV7                79     91  2
     D  XFMGV8                92    104  2
     D  XFMGV9               105    117  2
     D  XFMGVA               118    130  2
     D  XFMGVB               131    143  2
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  O2                    49     60
     D                                     DIM(6)
     D  UIKKE                 63     63
     D  UDT                   64     69  0
     D  UAWB                  81     81
     D  UF                   101    310
     D  WSID                 401    410
     D  UGN                  981    995
     D EPOTXI          C                   CONST('SELEKTERING EPOST-MO-
     D                                     TTAGERE')
     IKODSAMR
     I              SANORS                      KGENOT
     I              SAENGE                      KGEENT
     I              SATYSK                      KG2TYT
     C*
     C                   EXSR      INIT
     C*
     C*** CALL FROM READYMADE INVOICES
     C     UFFAK         IFEQ      'J'
     C                   EXSR      PRINT5
     C                   GOTO      SLUTT
     C                   END
     C*
     C* COPYROUTINE  VED UKOPI='J'
     C* BUT BORDEREAU IF UIN05 = 1
     C*
     C     UKOPI         IFEQ      'J'
     C                   SETON                                        51
     C                   EXSR      KOPISR
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** CALL FROM BORDEREAU
     C     UIN05         IFEQ      '1'
     C                   EXSR      PRINT4
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** CALL FROM  MANIFEST
     C     UIN06         IFEQ      '1'
     C                   EXSR      PRINT2
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** CALL FROM CREDIROUTINE
     C     UIN07         IFEQ      '1'
     C                   EXSR      PRINT3
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** CALL FROM INVOICING ORDERTYPE
     C     UIN08         IFEQ      '1'
     C                   MOVE      O2            OT
     C                   EXSR      PRINT2
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** ONLINE INVOICING FROM SCREEN
     C*
     C                   OPEN      SYFA20FM
     C     START         TAG
     C                   MOVE      *BLANKS       UIKKE
     C                   EXSR      XDTFMT
     C                   EXFMT     BILDE
     C                   EXSR      XDTFMT
      *
     C                   SETOFF                                       3085
     C   03              GOTO      START2
     C     WSMMÅÅ        IFNE      0
     C                   MOVE      WSMÅM         YDTPM
     C                   MOVE      WSMÅÅ         YDTPÅ
     C     WSMÅÅ         IFGT      50
     C                   MOVE      '19'          YDTPC
     C                   ELSE
     C                   MOVE      '20'          YDTPC
     C                   END
     C     KODTÅK        CHAIN     KOÅR                               30
     C   30              MOVE      'SPP0001'     MSGNR
     C   30              GOTO      START
     C                   END
     C*** TEST DATO
     C     WSFDAT        IFNE      *ZEROS
     C                   MOVE      WSFDAA        UÅÅ               2 0
     C                   MOVE      WSFDAM        UMM               2 0
     C                   MOVE      WSFDAD        UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      96
     C   96
     CANN30              MOVE      'SPD0001'     MSGNR
     C   96              SETON                                        30
     C   30              GOTO      START
     C                   END
     C*
     C* ORDERING SINGLE ORDERS
     C*
     C     WSGN          IFEQ      *BLANKS
     C     WSPRO         IFEQ      *ZEROS
     C     WSAGRF        IFEQ      *BLANKS
     C                   EXSR      TESTB
     C   30              GOTO      START
     C     WSFDAT        IFNE      *ZEROS
     C                   MOVE      WSFDAT        IDAGX
     C                   MOVE      WSFDAD        IDAGD
     C                   MOVE      WSFDAM        IDAGM
     C     WSFDAA        IFGT      50
     C     WSFDAA        ADD       1900          IDAGÅ
     C                   ELSE
     C     WSFDAA        ADD       2000          IDAGÅ
     C                   END
     C                   END
     C                   EXSR      PRINT1
     C                   GOTO      START2
     C                   END
     C                   END
     C                   END
     C*
     C* ORDERING ON TRIPNUMBER/MANIFESTNUMBER
     C*
     C                   EXSR      PRINTW
     C                   MOVE      WSAGRF        WSAGCO
     C                   MOVE      WSPRO         WSPRCO
     C                   MOVE      WSGN          WSGNCO
     C                   MOVE      *BLANKS       WSAGRF
     C                   MOVE      *ZEROS        WSPRO
     C                   MOVE      *BLANKS       WSGN
     C                   GOTO      START
     C*
     C     START2        TAG
     C                   CLOSE     SYFA20FM
     C*
     C     SLUTT         TAG
     C                   MOVE      XPRANT        UPRANT
     C     FIKONT        IFEQ      'J'
     C     FIKONT        OREQ      'Y'
     C                   CALL      'SYFA35CA'
     C                   END
     C* LÅNE UKOPI SOM UTPARAMETER (FLAGG FOR Å KJØRE SENDEPROGRAM)
     C     INTEDI        IFEQ      'J'
     C                   MOVE      'I'           UKOPI
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB         BEGSR
     C***********************************************
     C                   Z-ADD     1             XN                2 0
     C*
     C     XN            DOWLE     35
     C*
     C*** START    WF,XN IFNE 0
     C     WF(XN)        IFNE      0
     C                   Z-ADD     WF(XN)        YOPD
     C     HEADFK        CHAIN(N)  HEADF                              30
     C   30              MOVE      'SPO0001'     MSGNR
     C   30              GOTO      SLTB
     C*
     C* PROSJECTNUMBER CANT BE ZERO IF KOVPRO=J
     C     KOVPRO        IFEQ      'J'
     C     HEPRO         COMP      0                                      30
     C   30              MOVE      'SPO0021'     MSGNR
     C   30              GOTO      SLTB
     C                   END
     C*
     C     WSK           IFEQ      'O'
     C     HEST          COMP      ' '                                3030
     C   30              MOVE      'SPO0022'     MSGNR
     C* KAN IKKE FAKTURERE HVIS KRAV OM KOSTNAD, MEN ENNÅ 0..
     C     *IN30         IFNE      *ON
     C     HEADFK        SETLL     FAK4
     C     HEADFK        READE     FAK4                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDUK        IFNE      ' '
     C     FAKDUK        ANDNE     'N'
     C     FABELU        ANDEQ     *ZEROS
     C                   MOVE      'JOV0377'     MSGNR
     C                   SETON                                        3085
     C                   GOTO      KOSOK
     C                   END
     C     HEADFK        READE     FAK4                                   33
     C                   END
     C                   END
     C     KOSOK         TAG
     C                   ELSE
     C     HEST          IFNE      ' '
     C     HEST          IFNE      'H'
     C     HEST          IFNE      'O'
     C     HEST          IFNE      'F'
     C                   SETON                                        30
     C     FAK2K         CHAIN     FAK4                               30
     C   30              MOVE      'SPO0023'     MSGNR
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C   30              GOTO      SLTB
     C*
     C* TEST SHIPPER            S
     C* MUST BE INVOICE LINES ON ORDER
     C     WSK           IFEQ      'S'
     C                   MOVE      WSK           YSK
     C     FAK2K         CHAIN     FAK4                               30
     C   30              MOVE      'SPO0026'     MSGNR
     C   30              GOTO      SLTB
     C* KAN IKKE FAKTURERE HVIS KRAV OM KOSTNAD, MEN ENNÅ 0..
     C     FAK2K         SETLL     FAK4
     C     FAK2K         READE     FAK4                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDUK        IFNE      ' '
     C     FAKDUK        ANDNE     'N'
     C     FABELU        ANDEQ     *ZEROS
     C                   MOVE      'JOV0377'     MSGNR
     C                   SETON                                        3085
     C                   GOTO      SLTB
     C                   END
     C     FAK2K         READE     FAK4                                   33
     C                   END
     C                   END
     C*
     C* TESTS CONSIGNEE         K
     C* THER MUST BE INVOICELINES
     C     WSK           IFEQ      'K'
     C                   MOVE      WSK           YSK
     C     FAK2K         CHAIN     FAK4                               30
     C   30              MOVE      'SPO0027'     MSGNR
     C   30              GOTO      SLTB
     C* KAN IKKE FAKTURERE HVIS KRAV OM KOSTNAD, MEN ENNÅ 0..
     C     FAK2K         SETLL     FAK4
     C     FAK2K         READE     FAK4                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDUK        IFNE      ' '
     C     FAKDUK        ANDNE     'N'
     C     FABELU        ANDEQ     *ZEROS
     C                   MOVE      'JOV0377'     MSGNR
     C                   SETON                                        3085
     C                   GOTO      SLTB
     C                   END
     C     FAK2K         READE     FAK4                                   33
     C                   END
     C                   END
     C*
     C* IMPORT IN PLANNING
     C*
     C     HEUR          IFEQ      'A'
     C     HEPLAN        ANDEQ     'X'
     C     HEPRO         ANDEQ     0
     C                   SETON                                        30
     C   30              MOVE      'SPO0024'     MSGNR
     C                   GOTO      SLTB
     C                   END
     C*
     C*
     C                   END
     C*** END PÅ   WF,XN IFNE 0
     C*
     C                   ADD       1             XN
     C                   END
     C*** END PÅ   XN DOWLE 35
     C*
     C     SLTB          TAG
     C     XN            IFNE      0
     C     XN            IFLT      36
     C   30              MOVE      WF(XN)        YOPD
     C                   END
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     OPDFIL        BEGSR
     C***********************************************
      * IKKE STATUS NÅR KUN FLYTTING TIL S.FAK-KØ (UNNTATT V.KR.NOTA)
     C     ERSAML        IFEQ      'N'
     C     HEST          OREQ      'K'
     C   80              MOVE      'F'           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K/X
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     OPDFI2        BEGSR
     C***********************************************
     C*
     C                   MOVE      HEST          HESTGG            1
     C*
     C* HELFAKTURERING
     C     WSK           IFEQ      'O'
     C     ERSAML        ANDEQ     'N'
     C   80              MOVE      'F'           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K/X
     C                   END
     C*
     C* INVOICING SHIPPER
     C*
     C     WSK           IFEQ      'S'
     C     ERSAML        IFEQ      'N'
     C   80              MOVE      'F'           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K/X
     C                   END
     C     HESTGG        IFEQ      ' '
     C     HEKDFK        ANDNE     'X'
     C     ERSAML        ANDEQ     'N'
     C   80              MOVE      ' '           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      ' '           HEST                           IKKE S/K/X
     C                   END
     C                   END
     C*
     C* FAKTUTRERING MOT KJØPER
     C     WSK           IFEQ      'K'
     C     ERSAML        IFEQ      'N'
     C   80              MOVE      'F'           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K/X
     C                   END
     C     HESTGG        IFEQ      ' '
     C     HEKDFS        ANDNE     'X'
     C     ERSAML        ANDEQ     'N'
     C   80              MOVE      ' '           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      ' '           HEST                           IKKE S/K/X
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     PRINT1        BEGSR
     C***********************************************
     C                   Z-ADD     1             XN
     C     XN            DOWLE     35
     C     WF(XN)        IFNE      0
     C                   MOVE      WF(XN)        YOPD
     C     STPT1         TAG
     C                   SETOFF                                       32
     C     HEADFK        CHAIN     HEADF                              3332
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPT1
     C                   END
     C  N33HEST          IFEQ      ' '
     C     HEST          OREQ      'H'
     C     HEST          OREQ      'O'
     C     HEST          OREQ      'F'
     C                   EXSR      PRINT
      * Ved manuell fakt av noe som er ferdigmeldt - fjern ferdigmeld ...
      * (key BURDE hær være avd/opd/kundenr..)
     C     HEADFK        CHAIN     FerdL01                            33
     C  n33              delete    Ferdr2
     C                   EXSR      OPDFI2
     C                   END
     C                   UPDATE    HEADFR
     C                   END
     C                   ADD       1             XN
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KOPISR        BEGSR
     C***********************************************
     c                   move      'J'           bekopi            1
     C*
     C* SUBRUTINE FOR PRINT OF DOKUMENT COPIES
     C*
     C                   MOVEL     UGN           UGN7              7
     C     UGN7          IFEQ      '*FRATIL'
     C                   EXSR      KOPIS2
     C                   GOTO      UTKO
     C                   END
     C                   MOVE      UF            AF
     C                   Z-ADD     1             XN
     C     XN            DOWLE     35
     C     FF(XN)        IFNE      0
     C                   MOVE      FF(XN)        FIFN
     C* ER DET SAMLEFAKTURA...
     C                   MOVE      'N'           SAMLJN            1
     C     FIFN          SETLL     FAK9
     C     FIFN          READE     FAK9                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDA         IFNE      'K'                                           IKKE KOSTN.
     C     FAKDA         IFEQ      'S'                                           SAMLEFAKT
     C                   MOVE      'J'           SAMLJN
     C                   END
     C                   GOTO      UTSJN
     C                   END
     C     FIFN          READE     FAK9                                   33
     C                   END
      *
     C     UTSJN         TAG
     C     SAMLJN        IFEQ      'J'
     C                   EXSR      KOPSAM
     C                   GOTO      NXTKO
     C                   END
     C     FIFN          SETLL     FAK9
     C     STKP1         TAG
     C     FIFN          READE     FAK9                                   33
     C  N33              DO
     C     FAKDA         CABEQ     'K'           STKP1
     C                   MOVE      FAAVD         UAVD
     C                   MOVE      FAOPD         YOPD
     C     STKOPI        TAG
     C                   SETOFF                                       32
     C     HEADFK        CHAIN     HEADF                              3332
     C  N33
     CAN 32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STKOPI
     C                   END
     C  N33              DO
     C                   EXCEPT    DUMOPD
     C                   MOVE      ' '           KOPISK            1
     C*
     C* IF COPY THE DOKUMENT CAN HAVE DIFFERENT STATUSCODES
     C*
     C                   MOVE      'O'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST1           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST1
     C                   END
     C  N33              GOTO      CONTC
     C                   MOVE      'F'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST2           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST2
     C                   END
     C  N33              GOTO      CONTC
     C                   MOVE      'G'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST3           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST3
     C                   END
     C*
     C     CONTC         TAG
     C*
     C     *IN33         IFEQ      '1'
     C                   MOVE      *ZEROS        FAKUNR
     C                   ELSE
     C*
     C* CHANGES INVOICEDATE
     C*
     C                   MOVE      FASK          KOPISK
     C                   MOVE      FADATO        IDAG8
     C                   MOVE      IDAGD         IDAGXD
     C                   MOVE      IDAGM         IDAGXM
     C                   MOVE      IDAGÅ         IDAGXÅ
     C                   MOVE      FADAFD        XFFDTD
     C                   MOVE      FADAFM        XFFDTM
     C                   MOVE      FADAFÅ        XFFDTÅ
     C                   MOVE      XFFDT         KFFDT
     C                   END
     C*
     C     KOPISK        IFNE      ' '
     C                   MOVE      FF(XN)        XFN
     C                   MOVE      FF(XN)        TEFFNR
     C                   EXSR      PRINT
     C                   END
     C*
     C                   END
     C                   END
     C                   END
     C     NXTKO         TAG
     C                   ADD       1             XN
     C                   END
     C*
     C     UTKO          ENDSR
     C*
     C*
     C***********************************************
     C     KOPIS2        BEGSR
     C***********************************************
     C*HELE RUTINEN ER NY
     C                   EXSR      AVDSR
     C                   MOVE      UF            AF
     C                   MOVE      FF(1)         FIFN
     C     FAINK         SETLL     FAIN
     C     STKO          TAG
     C                   READ      FAIN                                   33
     C  N33FF(2)         COMP      FIFN                                 33
     C   33              GOTO      UTFA2
     C     FIFN          IFEQ      GMFN
     C                   GOTO      STKO
     C                   END
     C                   MOVE      FIFN          GMFN              6 0
     C* ER DET SAMLEFAKTURA...
     C                   MOVE      'N'           SAMLJN            1
     C     FIFN          SETLL     FAK9
     C     FIFN          READE     FAK9                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDA         IFNE      'K'                                           IKKE KOSTN.
     C     FAKDA         IFEQ      'S'                                           SAMLEFAKT
     C                   MOVE      'J'           SAMLJN
     C                   END
     C                   GOTO      UTSJN2
     C                   END
     C     FIFN          READE     FAK9                                   33
     C                   END
      *
     C     UTSJN2        TAG
     C     SAMLJN        IFEQ      'J'
      * CLOSE SYFA20P FOR Å FÅ RETT REKKEFØLGE VED KJØRING FRA/TIL NR
     C                   CLOSE     SYFA20P
     C                   EXSR      KOPSAM
     C                   OPEN      SYFA20P
     C                   GOTO      STKO
     C                   END
      *
     C     FIFN          SETLL     FAK9
     C     STKP2         TAG
     C     FIFN          READE     FAK9                                   33
     C     *IN33         CABEQ     '1'           STKO
     C     FAKDA         CABEQ     'K'           STKP2
     C                   MOVE      FAAVD         UAVD
     C                   MOVE      FAOPD         YOPD
     C     HEADFK        CHAIN(N)  HEADF                              33
     C  N33              DO
     C* LAR FØRSTE FAKTURA'S HEUR GJELDE ALLE
     C     HEUR1         IFEQ      ' '
     C                   MOVE      HEUR          HEUR1             1
     C                   END
     C                   MOVE      HEUR1         HEUR
     C                   MOVE      ' '           KOPISK            1
     C*
     C* IF COPY THE DOKUMENT CAN HAVE DIFFERENT STATUSCODES
     C*
     C                   MOVE      'O'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST4           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST4
     C                   END
     C  N33              GOTO      CONTC2
     C                   MOVE      'F'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST5           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST5
     C                   END
     C  N33              GOTO      CONTC2
     C                   MOVE      'G'           GLSTAT
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C     ST6           TAG
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      ST6
     C                   END
     C*
     C     CONTC2        TAG
     C*
     C  N33              MOVE      FASK          KOPISK
     C*
     C   33              DO
     C                   MOVE      *ZEROS        FAKUNR
     C                   END
     C*
     C* CHANGES INVOICEDATE
     C*
     C                   MOVE      FADATO        IDAG8
     C                   MOVE      IDAGD         IDAGXD
     C                   MOVE      IDAGM         IDAGXM
     C                   MOVE      IDAGÅ         IDAGXÅ
     C                   MOVE      FADAFD        XFFDTD
     C                   MOVE      FADAFM        XFFDTM
     C                   MOVE      FADAFÅ        XFFDTÅ
     C                   MOVE      XFFDT         KFFDT
     C*
     C     KOPISK        IFNE      ' '
     C                   MOVE      FIFN          XFN
     C                   MOVE      FIFN          TEFFNR
     C                   EXSR      PRINT
     C                   END
     C                   END
     C*
     C                   GOTO      STKO
     C     UTFA2         ENDSR
     C*
     C***********************************************
     C     KOPSAM        BEGSR
     C***********************************************
     C* KALL PGM FOR SAMLEFAKTURA-KOPI.
     C                   MOVE      '00'          ZZPRAN            2
     C                   MOVE      '1'           ZZIN01            1             =KOPI
     C                   MOVE      FIFN          ZZFN              6 0
     C                   MOVE      'N'           ZZMA              1
     C                   CALL      'SYFA27'
     C                   PARM                    ZZPRAN
     C                   PARM                    ZZIN01
     C                   PARM                    ZZFN
     C                   PARM                    ZZMA
      *
     C                   ADD       1             XPRANT
     C                   ENDSR
     C***********************************************
     C     PRINT2        BEGSR
     C***********************************************
     C*
     C*** PRINTS INVOICE ON ORDERTYPE
     C*
     C     HEAD1K        SETLL     HEAD1
     C*
     C     STPT2         TAG
     C                   SETOFF                                       33
     C     HEAD1K        READE     HEAD1                                  33
     C   33              GOTO      SLPT2
     C*VED EDI-MOTTATTE OPPDRAG M.M. KAN OPPDR.TYPE "  " FOREKOMME
     C     HEOT          IFEQ      '  '
     C                   GOTO      STPT2
     C                   END
     C*** START    UINI06 IFEQ '0'
     C     UIN06         IFEQ      '0'
     C     OT(1)         IFNE      'AL'
     C                   Z-ADD     1             XN
     C     HEOT          DOWNE     OT(XN)
     C                   ADD       1             XN
     C     XN            IFGT      6
     C                   GOTO      STPT2
     C                   END
     C                   END
     C                   END
     C*
     C     STPT21        TAG
     C     USG           IFNE      'ALL'
     C     USG           ANDNE     HESG
     C                   GOTO      STPT2
     C                   END
     C     UPRO          IFNE      0
     C     UPRO          ANDNE     HEPRO
     C     UPRO          ANDNE     HEOPD
     C                   GOTO      STPT2
     C                   END
     C     UDT           IFNE      0
     C     UDT8          ANDGT     HEDTOP
     C                   GOTO      STPT2
     C                   END
     C                   END
     C*** SLUTT   UIN06 IFEQ '0'
     C*
     C     UGN           IFNE      *BLANKS
     C     UGN           ANDNE     HEGN
     C                   GOTO      STPT2
     C                   END
     C* KAN IKKE FAKTURERE HVIS KRAV OM KOSTNAD, MEN ENNÅ 0..
     C     HEADOK        SETLL     FAK4
     C     HEADOK        READE     FAK4                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDUK        IFNE      ' '
     C     FAKDUK        ANDNE     'N'
     C     FABELU        ANDEQ     *ZEROS
     C                   GOTO      STPT2
     C                   END
     C     HEADOK        READE     FAK4                                   33
     C                   END
     C*
     C                   MOVE      HEOPD         YOPD
     C     STPT22        TAG
     C                   SETOFF                                       32
     C     HEADFK        CHAIN     HEADF                              3332
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPT22
     C                   END
     C     HEST          IFEQ      ' '
     C     HEUR          IFEQ      'A'
     C     HEPLAN        ANDEQ     'X'
     C     HEPRO         ANDEQ     0
     C                   UPDATE    HEADFR
     C                   GOTO      STPT2
     C                   END
     C                   EXSR      PRINT
     C                   EXSR      OPDFIL
     C                   END
     C*
     C     UIN06         IFEQ      '1'
     C     HEST          ANDEQ     'H'
     C                   EXSR      PRINT
     C                   EXSR      OPDFIL
     C                   END
     C                   UPDATE    HEADFR
     C*
     C                   GOTO      STPT2
     C*
     C     SLPT2         ENDSR
     C*
     C***********************************************
     C     PRINTW        BEGSR
     C***********************************************
     C     *LIKE         DEFINE    HEKNA         XXKNA
     C     HEAD3K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSGN
     C*
     C     HEAD7K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSAGRF
     C*
     C     HEA11K        KLIST
     C                   KFLD                    WSPRO
     C*
     C* I N V O I C I N G   F R O M   S C R E E N
     C*
     C* ON TRIPNUMBER OR MANIFESTNUMBER
     C*
     C     WSPRO         IFNE      *ZEROS
     C                   OPEN      HEAD11
     C     HEA11K        SETLL     HEAD11
     C                   ELSE
     C     WSGN          IFNE      *BLANKS
     C                   OPEN      HEAD3
     C     HEAD3K        SETLL     HEAD3
     C                   ELSE
     C                   OPEN      HEAD7
     C     HEAD7K        SETLL     HEAD7
     C                   END
     C                   END
     C*
     C     STWT2         TAG
     C                   SETOFF                                       33
     C     WSPRO         IFNE      *ZEROS
     C     HEA11K        READE     HEAD11                                 33
     C   33              GOTO      SLWT2
     C                   ELSE
     C     WSGN          IFNE      *BLANKS
     C     HEAD3K        READE     HEAD3                                  33
     C   33              GOTO      SLWT2
     C                   ELSE
     C     HEAD7K        READE     HEAD7                                  33
     C   33              GOTO      SLWT2
     C                   END
     C                   END
     C*
     C*
     C* TEST TRIPNUMBER
     C*
     C     WSPRO         IFNE      0
     C     WSPRO         IFNE      HEPRO
     C                   GOTO      STWT2
     C                   END
     C                   END
     C*
     C* TEST MANIFESTNUMBER
     C*
     C     WSGN          IFNE      *BLANKS
     C     WSGN          IFNE      HEGN
     C                   GOTO      STWT2
     C                   END
     C                   END
     C*
     C* TEST AGENT REFERANSE
     C*
     C     WSAGRF        IFNE      *BLANKS
     C     WSAGRF        IFNE      HERFA
     C                   GOTO      STWT2
     C                   END
     C                   END
     C*
     C* STATUSCODE X OR M MEENS ORDER IN WORK
     C*
     C     HEST          IFEQ      'X'
     C     HEST          OREQ      'M'
     C                   GOTO      STWT2
     C                   END
     C* KAN IKKE FAKTURERE HVIS KRAV OM KOSTNAD, MEN ENNÅ 0..
     C     HEADOK        SETLL     FAK4
     C     HEADOK        READE     FAK4                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDUK        IFNE      ' '
     C     FAKDUK        ANDNE     'N'
     C     FABELU        ANDEQ     *ZEROS
     C* varsel om at minst en ikke kunne faktureres pga budsj.krav
     C                   MOVE      'JOV0378'     MSGNR
     C                   SETON                                        3085
     C                   MOVE      HEOPD         YOPD
     C                   GOTO      STWT2
     C                   END
     C     HEADOK        READE     FAK4                                   33
     C                   END
     C*
     C                   MOVE      HEOPD         YOPD
     C     STPTW         TAG
     C                   SETOFF                                       32
     C     HEADOK        CHAIN     HEADF                              3332
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPTW
     C                   END
     C                   MOVE      HEST          HESTO             1
     C                   EXSR      PRINT
     C     NBRINV        IFNE      *ZEROS
     C                   EXSR      OPDFIL
     C                   END
     C*
     C     HESTO         IFEQ      ' '
     C     WSK           ANDEQ     'O'
     C     ERSAML        ANDEQ     'N'
     C   80              MOVE      'F'           HEST                           S OG/EL. K
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K/X
     C                   END
     C*
     C                   UPDATE    HEADFR
     C*
     C                   GOTO      STWT2
     C*
     C     SLWT2         TAG
     C*
     C     WSPRO         IFNE      *ZEROS
     C                   CLOSE     HEAD11
     C                   ELSE
     C     WSGN          IFNE      *BLANKS
     C                   CLOSE     HEAD3
     C                   ELSE
     C                   CLOSE     HEAD7
     C                   END
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     PRINT3        BEGSR
     C***********************************************
     C*
     C*** PRINT CREDITNOTE FROM AUTOMATIC CREDITROUTIN
     C*
     C                   MOVE      'K'           YST
     C     HEAD1K        SETLL     HEAD1
     C*
     C     STPT3         TAG
     C                   SETOFF                                       33
     C     HEAD1K        READE     HEAD1                                  33
     C   33              GOTO      SLPT3
     C*
     C                   MOVE      HEOPD         YOPD
     C     STPT31        TAG
     C                   SETOFF                                       32
     C     HEADFK        CHAIN     HEADF                              3332
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPT31
     C                   END
     C     HEST          IFEQ      'K'
     C     HEUR          IFEQ      'A'
     C     HEPLAN        ANDEQ     'X'
     C     HEPRO         ANDEQ     0
     C                   UPDATE    HEADFR
     C                   GOTO      STPT3
     C                   END
     C*
     C                   EXSR      PRINT
     C                   EXSR      OPDFIL
     C                   END
     C                   UPDATE    HEADFR
     C*
     C                   GOTO      STPT3
     C*
     C     SLPT3         ENDSR
     C*
     C***********************************************
     C     PRINT4        BEGSR
     C***********************************************
     C*
     C*** SKRIVER UT FAKTURAER MOT KJØPER VED BORDEREAU UTSKRIFT
     C*** DET VIL SI AGENTENS BORDEREAUER
     C*
     C     DUMBOK        SETLL     DUMBO
     C*
     C     STPT4         TAG
     C                   SETOFF                                       33
     C                   READ      DUMBO                                  33
     C   33              GOTO      SLPT4
     C*
     C                   MOVE      SKAVD         UAVD
     C                   MOVE      SKOPD         YOPD
     C     STPT41        TAG
     C                   SETOFF                                       32
     C     HEADFK        CHAIN     HEADF                              3332
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPT41
     C                   END
     C     HEUR          IFEQ      'A'
     C     HEPLAN        ANDEQ     'X'
     C     HEPRO         ANDEQ     0
     C                   UPDATE    HEADFR
     C                   GOTO      STPT4
     C                   END
     C                   EXSR      PRINT
     C*
     C* SHALL NOT UPDATE ANYTHING IF UKOPI=J
     C*
     C     XKOPI         IFNE      'J'
     C     XKOPI         ANDNE     'U'
     C*
     C                   EXSR      OPDFIL
     C*
     C* HVIS IKKE HEKDFS = X SKAL FAKTURA LIGGE HALVFAKTURERT
     C*
     C     HEKDFS        IFNE      'X'
     C                   MOVE      ' '           HEST
     C                   END
     C                   UPDATE    HEADFR
     C                   ELSE
     C                   EXCEPT    DUMOPD
     C                   END
     C*
     C                   GOTO      STPT4
     C*
     C     SLPT4         ENDSR
     C*
     C***********************************************
     C     PRINT5        BEGSR
     C***********************************************
     C*
     C*** PRINTS READYMARKED INVOICES FROM A CERTAIN USER
     C*
     C     FERDKE        KLIST
     C                   KFLD                    ZUSER
     C     USG           IFNE      '0  '
     C     WSID          IFNE      *BLANKS
     C     WSID          SETGT     FERDF
     C                   MOVEL     WSID          FETSTI            2
     C                   ELSE
     C     FERDKE        SETLL     FERDF
     C                   END
     C                   ELSE
     C     UAVD          SETLL     FERDL01
     C                   END
     C*
     C     STPT5         TAG
     C                   SETOFF                                       33
     C     USG           IFNE      '0  '
     C     WSID          IFNE      *BLANKS
     C                   READP     FERDF                                  33
     C                   MOVEL     FEWS          FETST             2
     C  N33FETST         COMP      FETSTI                             3333
     C                   ELSE
     C     FERDKE        READE     FERDF                                  33
     C                   END
     C                   ELSE
     C     UAVD          READE     FERDL01                                33
     C                   END
     C   33              GOTO      SLPT5
     C*
     C                   MOVE      FEAVD         UAVD
     C                   MOVE      FEOPD         YOPD
     C     STPT52        TAG
     C                   SETOFF                                       32
     C     FERDHK        CHAIN     HEADF                              3332
     C   33              GOTO      STPT5
     C   32              DO
     C                   Z-ADD     15            USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   GOTO      STPT52
     C                   END
     C*
     C* TESTER PROSJEKTNUMMER
     C*
     C     KOVPRO        IFEQ      'J'
     C     HEPRO         ANDEQ     *ZEROS
     C                   GOTO      STPT5
     C                   END
     C*
     C* STATUSCODE MUST BE BLANK OR 'H' 'O'
     C*
     C     HEST          IFEQ      'S'
     C     HEST          OREQ      'X'
     C                   GOTO      STPT5
     C                   END
     C*
     c                   move      'N'           utelatt
     C                   EXSR      PRINT
     C     utelatt       ifeq      'N'
     C     USG           IFNE      '0  '
     C                   DELETE    FERDR
     C                   ELSE
     C                   DELETE    FERDR2
     C                   END
     C                   END
     C     ERSAML        IFEQ      'N'
     C   80              MOVE      'F'           HEST                           S/K FAKTURERT
     C  N80
     CANN81              MOVE      'F'           HEST                           IKKE S/K / X
     C                   END
     C                   UPDATE    HEADFR
     C*
     C                   GOTO      STPT5
     C*
     C     SLPT5         ENDSR
     C*
     C***********************************************
     C     PRINT         BEGSR
     C***********************************************
     C                   MOVE      XKOPI         UKOPI
     C                   SELECT
     C     UAWB          WHENEQ    'S'                                          96 SJØ-FAKT.
     C                   MOVE      'J'           XSJFAK            1
     C     HEUR          WHENEQ    'F'
     C     HEUR          OREQ      'G'
     C     BILLK         CHAIN     BILLOF                             33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'J'           XSJFAK
     C                   ELSE
     C                   MOVE      'N'           XSJFAK
     C                   END
     C                   OTHER
     C                   MOVE      'N'           XSJFAK
     C                   ENDSL
      *
     C                   MOVE      'N'           ERSAML            1
     C                   MOVEA     '00'          *IN(80)
      *
      * VARIABLE VAT
      *
     C                   MOVE      FITAX         FITAXB            4 4
     C                   MOVE      FITAX         PRITAX
     C     FITAXD        IFNE      *ZEROS
     C     FITAX2        ANDNE     *ZEROS
     C     IDAG8         ANDLT     FITAXD
     C                   MOVE      FITAX2        FITAXB            4 4
     C                   MOVE      FITAX2        PRITAX
     C                   END
     C*
     C* MOVE *ZEROS NUMBER OF INVOICES
     C*
     C                   MOVE      *ZEROS        NBRINV            2 0
     C*
     C* MAIN ROUTIN FOR PRINTING OF INVOICE
     C*
     C                   SETOFF                                       50
     C*
     C* TEST IF EXPORT
     C*
     C                   SETOFF                                       52
     C     HEUR          IFEQ      'B'
     C     HEUR          OREQ      'D'
     C     HEUR          OREQ      'E'
     C     HEUR          OREQ      'G'
     C                   SETON                                        52
     C                   END
     C*
     C* TEST IF AIR
     C*
     C                   SETOFF                                       53
     C     HEUR          IFEQ      'C'
     C     HEUR          OREQ      'D'
     C     HEUR          OREQ      'E'
     C                   SETON                                        53
     C                   END
      *
      * TRANSPORTSYSTEM  55
      *
     C     HEUR          COMP      'H'                                    55
     C   55HEADFK        CHAIN     DISP                               33
     C*
     C* TRUCKS REG.NR IS IF FILE TURER WHEN EXPORT (IMPORT IN HEADF)
     C*
     C     HEUR          IFEQ      'B'
     C     TUKEY         CHAIN     TURER                              33
     C  N33              MOVEL     TUBILN        HEHAWB
     C                   END
     C     HEUR          IFEQ      'H'
     C     TUKEY2        CHAIN     TURER                              33
     C  N33              MOVEL     TUBILN        HEHAWB
     C                   END
     C*
     C*
     C                   MOVE      *ZEROS        XSFANR            6 0
     C                   MOVE      *ZEROS        XKFANR            6 0
     C*
     C*** GETS THE DEPARTMENTS INFORMATIONS
     C* IKKE VED KOPI FRA TIL FAKTURANUMMER
     C     UGN7          IFNE      '*FRATIL'
     C     XYZAVD        ANDNE     UAVD
     C                   EXSR      AVDSR
     C                   MOVE      UAVD          XYZAVD            4 0
     C                   END
     C*
     C     HEPOS2        COMP      0                                  47
     C*
     C*** GETS TEXT TO TERMS OF DELIVERY
     C*
     C     KODFRK        CHAIN     KOFRR                              33
     C*
     C*** GETS ORDERTYPE
     C     KODOTK        CHAIN     KOOTYR                             33
     C     KODO2K        CHAIN     KOOT2R                             33
     C*
     C*** TESTS IF TEXT CASH SHALL BE WRITTEN
     C     KO2KON        COMP      'J'                                    39
     C  N39KO2KON        COMP      'T'                                    39
     C*
     C*** GETS FROM PLACE
     C     HESDFK        CHAIN     STED2D                             33
     C   33HESDF         CHAIN     STED2                              33
     C   33              MOVE      *BLANKS       XFRATX           30
     C  N33              MOVE      ST2NVN        XFRATX
     C*
     C*** GETS DESTINATION
     C     HESDTK        CHAIN     STED2D                             33
     C   33HESDT         CHAIN     STED2                              33
     C   33              MOVE      *BLANKS       XTILTX           30
     C  N33              MOVE      ST2NVN        XTILTX
     C* FLYTTET UT AV SR. FOR Å SLIPPE Å GJENTA 3 GANGER
     C     HEVS2         COMP      *BLANKS                            4949
     C  N49HEGM2         COMP      *BLANKS                            4949
     C     HELM          COMP      *ZEROS                             5858
     C   58              SETON                                        49
      *
      *** KJØPER
      *
      * INVOICES NOT CONSIGNEE FROM MANIFESTROUTINE
      *
     C     UIN06         IFEQ      '1'
     C     TUKEY         CHAIN     TURER                              33
     C                   GOTO      STSELG
     C                   END
     C*
     C*
     C* INVOICES NOT CONSIGNEE IF CODE=S
     C*
     C     WSK           IFEQ      'S'
     C                   GOTO      STSELG
     C                   END
      * Når ferdigmeldte - en post pr.1part...
      *TOTALT ENDRET
      *
     C     UFFAK         IFEQ      'J'
     C     FEKN          ANDNE     HEKNKF
     C                   GOTO      STSELG
     C                   END
      *
      * INVOICES FREE PART     IF CODE=X
      *
     C     WSK           IFEQ      'X'
     C                   GOTO      STFREE
     C                   END
      *
      * SHALL CONSIGNEE-INVOICE BE WRITTEN WHEN COPIROUTINE
      *
     C     UKOPI         IFEQ      'J'
     C     KOPISK        IFEQ      'S'
     C                   GOTO      STSELG
     C                   END
     C     KOPISK        IFEQ      'X'
     C                   GOTO      STFREE
     C                   END
     C                   END
     C                   MOVE      'K'           YSK
     C                   SETOFF                                       33
     C     UKOPI         IFNE      'J'
     C     FAK2K         SETLL     FAK4
     C     KRLOP1        TAG
     C     FAK2K         READE     FAK4                                   33
     C  N33UIN07         IFEQ      '1'
     C     FAKDA         ANDNE     'C'
     C                   GOTO      KRLOP1
     C                   END
     C                   END
     C*
     C* BORDEREAU SPECIALITIES
     C*
     C     UIN05         IFEQ      '1'
     C                   MOVE      SYLAND        YSLAND            2
     C                   MOVE      *BLANKS       KLKNVN
     C                   MOVE      HELKS         SYLAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   MOVE      KLKNVN        SLAND            30
     C                   MOVE      *BLANKS       KLKNVN
     C                   MOVE      HELKK         SYLAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   MOVE      KLKNVN        KLAND            30
     C                   MOVE      YSLAND        SYLAND            2
     C                   SETOFF                                       33
     C                   END
     C*
     C* INVOICES CONSIGNEE
     C*
     C  N33              DO
     C     UIN07         IFEQ      '1'
     C                   MOVE      HEFNGK        XKREDA
     C     FACURI        IFNE      *BLANKS
     C                   MOVE      FACURI        HEVALK
     C                   END
     C                   END
     C                   EXSR      KJØPER
     C                   MOVE      '1'           *IN80
     C                   END
      *
      * Når ferdigmeldte - en post pr. part...
      *
     C*
     C* NOT CONSIGNEE IF BORDEREAU
     C*
     C     UIN05         IFEQ      '1'
     C                   GOTO      SLPT
     C                   END
     C*
     C* SHALL SHIPPER-INVOICE BE WRITTEN WHEN COPIROUTINE
     C*
     C     UKOPI         IFEQ      'J'
     C     KOPISK        ANDEQ     'K'
     C                   GOTO      SLPT
     C                   END
     C*
     C*
     C*** S H I P P E R     INVOICING
     C*
     C     STSELG        TAG
     C*
     C* INVOICES NOT SHIPPER   IF CODE=K
     C*
     C     WSK           IFEQ      'K'
     C                   GOTO      SLPT
     C                   END
     C*
     C                   MOVE      'S'           YSK
     C                   SETOFF                                       33
     C     UKOPI         IFNE      'J'
     C     FAK2K         SETLL     FAK4
     C     KRLOP2        TAG
     C     FAK2K         READE     FAK4                                   33
     C  N33UIN07         IFEQ      '1'
     C     FAKDA         ANDNE     'C'
     C                   GOTO      KRLOP2
     C                   END
     C                   END
      *FERDIGMELDING
      *
     C     UFFAK         IFEQ      'J'
     C     FEKN          ANDNE     HEKNSF
     C                   GOTO      STFREE
     C                   END
     C*
     C* DOES INVOICING OF SHIPPER IF THERE ARE LINES
     C*
     C*
     C  N33              DO
     C     UIN07         IFEQ      '1'
     C     FACURI        IFNE      *BLANKS
     C                   MOVE      FACURI        HEVALS
     C                   END
     C                   MOVE      HEFNGS        XKREDA            7 0
     C                   END
     C                   EXSR      SELGE
     C                   MOVE      '1'           *IN80
     C                   END
     C*
     C*** FREE INVIOCING
     C*
     C     STFREE        TAG
     C*
     C* INVOICES NOT IF CODE=K/S
     C*
     C     WSK           IFEQ      'K'
     C     WSK           OREQ      'S'
     C                   GOTO      SLPT
     C                   END
     C     UKOPI         IFEQ      'J'
     C     KOPISK        ANDNE     'X'
     C                   GOTO      SLPT
     C                   END
     C*
     C* NOT INTO X IF CREDITROUTINE
     C     UIN07         IFEQ      '1'
     C                   GOTO      SLPT
     C                   END
     C*
     C                   MOVE      'X'           YSK
     C                   SETOFF                                       33
     C* Finnes det X-linjer ??
     C     UKOPI         IFNE      'J'
     C     FAK2K         SETLL     FAK4
     C     FERDI1        TAG
     C     FAK2K         READE     FAK4                                   33
      * Hvis ferdigmeldt X-part, sikre at RETT kunde er funnet
     C  N33UFFAK         IFEQ      'J'
     C     FEKN          ANDNE     FAKUNR
     C                   GOTO      FERDI1
     C                   END
     C  N33FAOPKO        IFEQ      'C'
     C                   GOTO      FERDI1
     C                   END
     C  N33FAVK          IFEQ      'AME'
     C                   GOTO      FERDI1
     C                   END
     C                   END
     C*
     C* DOES INVOICING OF FREE IF THERE ARE LINES
     C*
     C     STFRI         TAG
     C*
     C  N33              DO
     C                   MOVE      FAKUNR        FAKUGM            8 0
     C     UIN07         IFEQ      '1'
     C                   MOVE      HEFNGS        XKREDA            7 0
     C                   END
      * Ved ferdigmeldte - kun ett kundenr pr post i ferd.m.fila...
     C     UFFAK         IFEQ      'J'
     C                   EXSR      SRFREE
     C                   MOVE      '1'           *IN81
     C                   GOTO      SLPT
     C                   ELSE
     C                   EXSR      SRFREE
     C                   MOVE      '1'           *IN81
     C                   END
     C* Finnes det flere kunder med X-linjer ??
     C     UKOPI         IFNE      'J'
     C                   SETOFF                                       33
     C     FAK2K         SETLL     FAK4
     C     FERDI2        TAG
     C     FAK2K         READE     FAK4                                   33
     C  N33FAOPKO        CABEQ     'C'           FERDI2
     C  N33FAVK          CABEQ     'AME'         FERDI2
     C  N33              GOTO      STFRI
     C                   END
     C                   END
     C*
     C     SLPT          ENDSR
     C*
     C***********************************************
     C     OPDGRL        BEGSR
     C***********************************************
      * OPPDATER FAKTURANR PÅ GRUNNLAGFIL
     C                   MOVE      HEAVD         ULAVD             4
     C                   MOVE      HEOPD         ULOPD             7
     C                   MOVE      *ZEROS        ULLI              5
     C                   MOVE      IDAG8         ULFDT             8
     C                   MOVE      XFN           ULFN              7
     C     UKOPI         IFEQ      'J'
     C                   MOVE      'J'           ULKOPI            1
     C                   ELSE
     C                   MOVE      'N'           ULKOPI
     C                   END
     C                   MOVE      'O'           ULOPT             1
     C                   CALL      'LL054C'
     C                   PARM                    ULAVD
     C                   PARM                    ULOPD
     C                   PARM                    ULLI
     C                   PARM                    ULFDT
     C                   PARM                    ULFN
     C                   PARM                    ULKOPI
     C                   PARM                    ULOPT
      *
     C                   ENDSR
      *
     C***********************************************
     C     KJØPER        BEGSR
     C***********************************************
     C                   MOVE      'K'           XXSKKO
     C                   MOVE      'N'           XOPDGR            1
     C*
     C*** HENTER KUNDEOPPLYSNINGER
     C     UIN07         IFEQ      '1'
     C                   MOVE      FAKUNR        YKN
     C                   ELSE
     C                   MOVE      HEKNKF        YKN
     C     UKOPI         IFEQ      'J'
     C     FAKUNR        ANDNE     0
     C                   MOVE      FAKUNR        YKN
     C                   END
     C                   END
     C     KUND1K        CHAIN     CUNDL01                            33
      *
      * er epostmottager valgt
      *
     c                   move      'N'           utelatt           1
     C     UKOPI         IFNE      'J'
     C                   MOVE      '1'           *IN33
     c     arksnd        ifeq      'J'
     c     epokey        CHAIN     cundc03                            33
      * 33 på er prinkunde
     c     UEMAIL        IFEQ      'J'
     c   33              move      'J'           utelatt           1
     c   33              goto      SLKJØ1
     c                   end
      * N33 på er MAILKUNDE
     c     UEMAIL        IFEQ      'N'
     c  N33              move      'J'           utelatt           1
     c  N33              goto      SLKJØ
     c                   end
     c                   end
      * XML
     C     SLKJØ1        TAG
     C     *IN33         IFEQ      '1'
     C     ARKSND        ORNE      'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
      * 33 på er printkunde
     C   33UEMAIL        IFEQ      'J'
     C                   move      'J'           utelatt           1
     C                   goto      SLKJØ
     C                   end
      * N33 på er XML-KUNDE
     C  N33UEMAIL        IFEQ      'N'
     C                   move      'J'           utelatt           1
     C                   goto      SLKJØ
     C                   end
     C                   END
     c                   end
     C                   EXSR      FIXBGN                                       FIX BANKG.NR
     C     POSTNR        COMP      0                                      37
     C     SYPOGE        COMP      *BLANKS                                38
     C*
     C     DKUND         IFEQ      'D'
     C                   MOVE      HENAK         XDINV
     C                   MOVE      HEADK1        XDIAD1
     C                   MOVE      HEADK2        XDIAD2
     C                   MOVE      HEADK3        XDIAD3
     C                   END
     C*
     C*** SAMLEFAKTURA ?    IF YES  INDICATOR 50 ON
     C*
     C     UKOPI         IFNE      'J'
     C     UKOPI         ANDNE     'U'
     C     UFFAK         IFEQ      'J'                                          FERDIGMELDTE
     C                   MOVE      FESFAK        SFAKT
     C                   ELSE                                                   MANUELL(E.L.
      * AVVIK PÅ AVD.NIVÅ?
     C     CUSAAK        CHAIN     CUSAAV                             50        *AVVIK SF.KO
     C  N50              MOVE      CASFAK        SFAKT                           PÅ AVDNIVÅ?
     C                   END
     C     SFAKT         COMP      ' '                                5050
     C   50UIKKE         COMP      'X'                                5050
     C                   MOVE      YKN           SAKN
     C     HEVALK        IFEQ      FICURR
     C                   MOVE      *BLANKS       SAVAL
     C                   ELSE
     C                   MOVE      HEVALK        SAVAL
     C                   END
     C                   MOVE      HEAVD         SAAVD
     C                   MOVE      HEOPD         SAOPD
     C     SAMLK         CHAIN     SAML                               33
     C     *IN50         IFEQ      '0'
     C  N33              DELETE    SAMLR
     C                   ELSE
     C                   MOVE      HEPRO         SAPRO
     C                   MOVE      SFAKT         SAGRP
     C                   MOVE      HEDTOP        SADATO
     C                   MOVE      HEUR          SAUR
     C  N33              UPDATE    SAMLR
     C   33              WRITE     SAMLR
     C                   MOVE      'Y'           ERSAML
     C                   EXSR      CONSOL
      *
     C                   GOTO      SLKJØ
     C                   END
     C                   END
     C*
     C                   ADD       1             XPRANT
     C*
     C                   MOVE      HEVALK        XVAL
     C*
     C* GETS INVOICENUMBER
     C*
     C                   EXSR      HFAKTN
     C     UKOPI         IFNE      'J'
     C                   MOVE      XFN           XKFANR
     C                   ELSE
     C     FACURI        IFNE      *BLANKS
     C                   MOVE      FACURI        XVAL
     C                   END
     C                   END
     C*
     C     SPRAAK        COMP      'E'                                    70
     C     SPRAAK        COMP      'T'                                    79
     C                   EXSR      BETSR
     C*
     C* HENTER STRINGKODER ETC
      *
     C                   EXSR      STRING
      *
     C     KOPFM         IFEQ      *BLANKS
     C                   SETON                                        42
     C                   GOTO      ENKOP
     C                   END
     C     KOPFM         SETLL     KODTFM
     C     STFM1         TAG
     C     KOPFM         READE     KODTFM                                 42
     C   42BYTTKO        IFEQ      'J'
     C                   MOVE      ' '           UKOPI
     C                   END
     C  N42              DO                                                      2<-B
     C     ENKOP         TAG
     C     XSJFAK        IFEQ      'J'                                          1<-B
     C                   MOVE      'K'           BLSKT             1
     C     KO2KON        IFEQ      'D'                                           2<-B
      * VED 72 LINJER ER DIVERS KUNDRE PÅ SJØ = LAND
     C     UAWB          IFEQ      'S'                                            3<-B
     C                   EXSR      VALIS2
     C                   ELSE                                                     3
     C                   EXSR      VALI
     C                   END                                                      3<-E
     C                   ELSE                                                    2
      * VED 96 LINJER MED GIRO ELLER 72 LINJER UTEN GIRO KALLES VALISH
      * VED 72 LINJER MED GIRO KALLES VALIS3
     C     UAWB          IFEQ      'N'                                            3<-B
     C     UAWB          OREQ      'K'                                            3<-B
     C                   EXSR      VALIS3
     C                   ELSE                                                     3
     C                   EXSR      VALISH
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C                   EXSR      VALI
     C                   END                                                    1<-E
     C     XOPDGR        IFEQ      'J'
     C                   EXSR      OPDGRL
     C                   END
     C  N42UKOPI         IFNE      'J'
     C                   MOVE      'F'           GLSTAT
     C                   MOVE      'J'           UKOPI
     C                   MOVE      'J'           BYTTKO            1
     C                   END
     c  N42bekopi        comp      'J'                                    42
     C  N42              GOTO      STFM1
     C                   END
     C*
     C     SLKJØ         ENDSR
     C*
     C***********************************************
     C     SELGE         BEGSR
     C***********************************************
     C                   MOVE      'S'           XXSKKO
     C                   MOVE      'N'           XOPDGR            1
     C*
     C*** HENTER KUNDEOPPLYSNINGER
     C     UIN07         IFEQ      '1'
     C                   MOVE      FAKUNR        YKN
     C                   ELSE
     C                   MOVE      HEKNSF        YKN
     C     UKOPI         IFEQ      'J'
     C     FAKUNR        ANDNE     0
     C                   MOVE      FAKUNR        YKN
     C                   END
     C                   END
     C     KUND1K        CHAIN     CUNDL01                            33
      *
      * er epostmottager valgt
      *
     c                   move      'N'           utelatt           1
     C     UKOPI         IFNE      'J'
     c                   MOVE      '1'           *IN33
     c     arksnd        ifeq      'J'
     c     epokey        CHAIN     cundc03                            33
      * 33 på er prinkunde
     c     UEMAIL        IFEQ      'J'
     c   33              move      'J'           utelatt           1
     c   33              goto      SLSEL1
     c                   end
      * N33 på er MAILKUNDE
     c     UEMAIL        IFEQ      'N'
     c  N33              move      'J'           utelatt           1
     c  N33              goto      SLSEL
     c                   end
     c                   end
      * XML
     C     SLSEL1        TAG
     C     *IN33         IFEQ      '1'
     C     ARKSND        ORNE      'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
      * 33 på er printkunde
     C   33UEMAIL        IFEQ      'J'
     C                   move      'J'           utelatt           1
     C                   goto      SLSEL
     C                   end
      * N33 på er XML-KUNDE
     C  N33UEMAIL        IFEQ      'N'
     C                   move      'J'           utelatt           1
     C                   goto      SLSEL
     C                   end
     C                   END
     c                   end
     C                   EXSR      FIXBGN                                       FIX BANKG.NR
     C     POSTNR        COMP      0                                      37
     C     SYPOGE        COMP      *BLANKS                                38
     C*
     C     DKUND         IFEQ      'D'
     C                   MOVE      HENAS         XDINV
     C                   MOVE      HEADS1        XDIAD1
     C                   MOVE      HEADS2        XDIAD2
     C                   MOVE      HEADS3        XDIAD3
     C                   END
     C*
     C*** SAMLEFAKTURA ?    IF YES  INDICATOR 50 ON
     C*** IS NOT DONE IF COPYROUTINE
     C*
     C     UKOPI         IFNE      'J'
     C     UFFAK         IFEQ      'J'                                          FERDIGMELDTE
     C                   MOVE      FESFAK        SFAKT
     C                   ELSE                                                   MANUELL(E.L.
      * AVVIK PÅ AVD.NIVÅ?
     C     CUSAAK        CHAIN     CUSAAV                             50        *AVVIK SF.KO
     C  N50              MOVE      CASFAK        SFAKT                           PÅ AVDNIVÅ?
     C                   END
     C     SFAKT         COMP      ' '                                5050
     C   50UIKKE         COMP      'X'                                5050
     C                   MOVE      YKN           SAKN
     C     HEVALS        IFEQ      FICURR
     C                   MOVE      *BLANKS       SAVAL
     C                   ELSE
     C                   MOVE      HEVALS        SAVAL
     C                   END
     C                   MOVE      HEAVD         SAAVD
     C                   MOVE      HEOPD         SAOPD
     C     SAMLK         CHAIN     SAML                               33
     C     *IN50         IFEQ      '0'
     C  N33              DELETE    SAMLR
     C                   ELSE
     C                   MOVE      HEPRO         SAPRO
     C                   MOVE      SFAKT         SAGRP
     C                   MOVE      HEDTOP        SADATO
     C                   MOVE      HEUR          SAUR
     C  N33              UPDATE    SAMLR
     C   33              WRITE     SAMLR
     C                   MOVE      'Y'           ERSAML
     C                   EXSR      CONSOL
     C                   GOTO      SLSEL
     C*
     C                   END                                                    50
     C                   END                                                    UKOPI = 'J'
     C*
     C                   ADD       1             XPRANT
     C*
     C                   MOVE      HEVALS        XVAL              3
     C* GETS INVOICENUMBER
     C                   EXSR      HFAKTN
     C     UKOPI         IFNE      'J'
     C                   MOVE      XFN           XSFANR
     C                   ELSE
     C     FACURI        IFNE      *BLANKS
     C                   MOVE      FACURI        XVAL
     C                   END
     C                   END
     C*
     C     SPRAAK        COMP      'E'                                    70
     C     SPRAAK        COMP      'T'                                    79
     C                   EXSR      BETSR
     C*
     C*
     C* HENTER STRINGKODER ETC
      *
     C                   EXSR      STRING
      *
     C     KOPFM         IFEQ      *BLANKS
     C                   SETON                                        42
     C                   GOTO      ENKOP2
     C                   END
     C     KOPFM         SETLL     KODTFM
     C     STFM2         TAG
     C     KOPFM         READE     KODTFM                                 42
     C   42BYTTKO        IFEQ      'J'
     C                   MOVE      ' '           UKOPI
     C                   END
     C  N42              DO                                                      2<-B
     C     ENKOP2        TAG
     C     XSJFAK        IFEQ      'J'                                          1<-B
     C                   MOVE      'S'           BLSKT             1
     C     KO2KON        IFEQ      'D'                                           2<-B
      * VED 72 LINJER ER DIVERS KUNDRE PÅ SJØ = LAND
     C     UAWB          IFEQ      'S'                                            3<-B
     C                   EXSR      VALIS2
     C                   ELSE                                                     3
     C                   EXSR      VALI
     C                   END                                                      3<-E
     C                   ELSE                                                    2
      * VED 96 LINJER MED GIRO ELLER 72 LINJER UTEN GIRO KALLES VALISH
      * VED 72 LINJER MED GIRO KALLES VALIS3
     C     UAWB          IFEQ      'N'                                            3<-B
     C     UAWB          OREQ      'K'                                            3<-B
     C                   EXSR      VALIS3
     C                   ELSE                                                     3
     C                   EXSR      VALISH
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C                   EXSR      VALI
     C                   END                                                    1<-E
     C     XOPDGR        IFEQ      'J'
     C                   EXSR      OPDGRL
     C                   END
     C  N42UKOPI         IFNE      'J'
     C                   MOVE      'F'           GLSTAT
     C                   MOVE      'J'           UKOPI
     C                   MOVE      'J'           BYTTKO            1
     C                   END
     c  N42bekopi        comp      'J'                                    42
     C  N42              GOTO      STFM2
     C                   END
     C*
     C     SLSEL         ENDSR
     C*
     C***********************************************
     C     SRFREE        BEGSR
     C***********************************************
     C                   MOVE      'X'           XXSKKO
     C* EVT. AVVIKENDE FAKTURAVALUTA FINNES PÅ FAKT.LINJENE
     C                   MOVE      FICURR        XVAL              3
     C     FACURI        IFNE      *BLANKS
     C                   MOVE      FACURI        XVAL              3
     C                   END
     C*
     C*** HENTER KUNDEOPPLYSNINGER
     C                   MOVE      FAKUNR        YKN
     C     KUND1K        CHAIN     CUNDL01                            33
      *
      * er epostmottager valgt
      *
     c                   move      'N'           utelatt           1
     C     UKOPI         IFNE      'J'
     C                   MOVE      '1'           *IN33
     c     arksnd        ifeq      'J'
     c     epokey        CHAIN     cundc03                            33
      * 33 på er prinkunde
     c     UEMAIL        IFEQ      'J'
     c   33              move      'J'           utelatt           1
     c   33              goto      SLFRE1
     c                   end
      * N33 på er MAILKUNDE
     c     UEMAIL        IFEQ      'N'
     c  N33              move      'J'           utelatt           1
     c  N33              goto      SLFRE
     c                   end
     c                   end
      * XML
     C     SLFRE1        TAG
     C     *IN33         IFEQ      '1'
     C     ARKSND        ORNE      'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
      * 33 på er printkunde
     C   33UEMAIL        IFEQ      'J'
     C                   move      'J'           utelatt           1
     C                   goto      SLFRE
     C                   end
      * N33 på er XML-KUNDE
     C  N33UEMAIL        IFEQ      'N'
     C                   move      'J'           utelatt           1
     C                   goto      SLFRE
     C                   end
     C                   END
     c                   end
     C                   EXSR      FIXBGN                                       FIX BANKG.NR
     C     POSTNR        COMP      0                                      37
     C     SYPOGE        COMP      *BLANKS                                38
     C*
     C     DKUND         IFEQ      'D'
     C                   MOVE      HENAS         XDINV
     C                   MOVE      HEADS1        XDIAD1
     C                   MOVE      HEADS2        XDIAD2
     C                   MOVE      HEADS3        XDIAD3
     C                   END
     C*
     C*** SAMLEFAKTURA ?    IF YES  INDICATOR 50 ON
     C*** IS NOT DONE IF COPYROUTINE
     C*
     C     UKOPI         IFNE      'J'
     C     UFFAK         IFEQ      'J'                                          FERDIGMELDTE
     C                   MOVE      FESFAK        SFAKT
     C                   ELSE                                                   MANUELL(E.L.
      * AVVIK PÅ AVD.NIVÅ?
     C     CUSAAK        CHAIN     CUSAAV                             50        *AVVIK SF.KO
     C  N50              MOVE      CASFAK        SFAKT                           PÅ AVDNIVÅ?
     C                   END
     C     SFAKT         COMP      ' '                                5050
     C   50UIKKE         COMP      'X'                                5050
     C                   MOVE      YKN           SAKN
     C                   MOVE      *BLANKS       SAVAL
     C     FAKTK         CHAIN(N)  FAKT                               33
     C     *IN33         IFEQ      '0'
     C                   MOVE      FACURI        SAVAL
     C                   END
     C                   MOVE      HEAVD         SAAVD
     C                   MOVE      HEOPD         SAOPD
     C     SAMLK         CHAIN     SAML                               33
     C     *IN50         IFEQ      '0'
     C  N33              DELETE    SAMLR
     C                   ELSE
     C                   MOVE      HEPRO         SAPRO
     C                   MOVE      SFAKT         SAGRP
     C                   MOVE      HEDTOP        SADATO
     C                   MOVE      HEUR          SAUR
     C  N33              UPDATE    SAMLR
     C   33              WRITE     SAMLR
     C                   MOVE      'Y'           ERSAML
     C                   EXSR      CONSOL
     C                   GOTO      SLFRE
     C*
     C                   END                                                    50
     C                   END                                                    UKOPI NE'J'
     C*
     C                   ADD       1             XPRANT
     C*
     C* GETS INVOICENUMBER
     C                   EXSR      HFAKTN
     C*
     C     SPRAAK        COMP      'E'                                    70
     C     SPRAAK        COMP      'T'                                    79
     C                   EXSR      BETSR
     C*
     C*
     C* HENTER STRINGKODER ETC
      *
     C                   EXSR      STRING
      *
     C     KOPFM         IFEQ      *BLANKS
     C                   SETON                                        42
     C                   GOTO      ENKOP3
     C                   END
     C     KOPFM         SETLL     KODTFM
     C     STFM3         TAG
     C     KOPFM         READE     KODTFM                                 42
     C   42BYTTKO        IFEQ      'J'
     C                   MOVE      ' '           UKOPI
     C                   END
     C  N42              DO                                                      2<-B
     C     ENKOP3        TAG
     C     XSJFAK        IFEQ      'J'                                          1<-B
     C                   MOVE      ' '           BLSKT             1
      * VED 96 LINJER MED GIRO ELLER 72 LINJER UTEN GIRO KALLES VALISH
      * VED 72 LINJER MED GIRO KALLES VALIS3
     C     UAWB          IFEQ      'N'                                           2<-B
     C     UAWB          OREQ      'K'                                            3<-B
     C                   EXSR      VALIS3
     C                   ELSE                                                    2
     C                   EXSR      VALISH
     C                   END                                                     2<-E
     C                   ELSE
     C                   EXSR      VALI
     C                   END
     C  N42UKOPI         IFNE      'J'
     C                   MOVE      'F'           GLSTAT
     C                   MOVE      'J'           UKOPI
     C                   MOVE      'J'           BYTTKO            1
     C                   END
     c  N42bekopi        comp      'J'                                    42
     C  N42              GOTO      STFM3
     C                   END
     C*
     C     SLFRE         ENDSR
     C*
     C***********************************************
     C     VALI          BEGSR
     C***********************************************
     C*
     C* GETS TEXT OF COUNTRY OF INVOICERECIEVER
     C                   MOVE      *ZEROS        XANTL             2 0
     C                   MOVE      *BLANKS       KLKNVN
     C     SYLAND        IFNE      FILAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   END
     C*
     C  N70
     CANN79              MOVE      HO            HP
     C   70              MOVE      HE            HP
     C   79              MOVE      HT            HP
     C     DKUND         COMP      'D'                                    48
     C                   SETOFF                                       88
     C                   Z-ADD     2             XSIDE
     C*
     C* TESTS IF IT IS A CREDITNOTE
     C*
     C                   EXSR      KREDIT
     C*
     C  N70KO2NTX        COMP      *BLANKS                                33
     C  N70
     CAN 33              MOVE      XF2NV         KO2NTX
     C   70KO2ETX        COMP      *BLANKS                                33
     C   70
     CAN 33              MOVE      XF2NV2        KO2ETX
     C     XBRUTT        COMP      0                                    73
     C     XVAL          COMP      FICURR                             7171
     C   71XVAL          COMP      '   '                              7171
     C*
     C* SPECIAL LAYOUT  BORDEREAU
     C*
     C                   MOVE      'N'           XVALS2            1
     C     UIN05         IFEQ      '1'
     C                   EXCEPT    HEADB
     C                   EXSR      FRILIN
     C                   EXCEPT    HEAB22
     C                   ADD       1             NBRINV
     C                   ELSE
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C                   ADD       1             NBRINV
     C     KO2KON        IFNE      'D'
     C                   WRITE     KJØP
     C                   ELSE
     C                   WRITE     KJØPD
     C                   END
     C   55              WRITE     HEAT
     C     KO2KON        IFNE      'D'
     C                   WRITE     HEAD22
     C                   ELSE
     C                   WRITE     HEA222
     C                   END
     C                   EXSR      FRILIN
     C                   EXSR      KDTFM1
     C                   END
     C*
     C* END HEADING
     C* PRINT DETAIL/LINES
     C*
     C     SORTK         SETLL     SORT
     C                   MOVE      *ZEROS        XTOTAL           13 2
     C                   MOVE      *ZEROS        XMVAGR
     C*
     C     STVALI        TAG
     C                   SETOFF                                       33
     C                   READ      SORT                                   33
     C   33              GOTO      STVAL2
     C* TEST IF NEXT LINE HAVE SOME CODE AND NO TEXT
     C*
     C     SOVT          IFEQ      *BLANKS
     C                   MOVE      SOKDM         XOKDM             1
     C                   MOVE      SOSAMM        XOSAMM
     C                   MOVE      SOVK          XOVK              3
     C                   MOVE      SOVT          XOVT             20
     C                   MOVE      SOBELN        XOBELN           13 2
     C                   MOVE      SOBELV        XOBELV           13 2
     C                   EXSR      TESTEQ
     C                   ELSE
     C                   MOVE      *BLANKS       FTX
     C                   MOVE      *ZEROS        XN01
     C                   EXSR      HENTFTXT
     C                   END
     C     FAKDM         COMP      'J'                                    34
      * sjekk momskoder fra Løsning1                                      34
     C  N34              EXSR      MOMSKD
     C   34
     CANN71              ADD       FABELN        XMVAGR
     C   34
     CAN 71              ADD       FABELV        XMVAGR
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C   79KODG2K        CHAIN     KOG2R                              33
     C     SOSAMM        IFNE      *BLANK
     C     SOSAMM        CHAIN     KODSAM                             33
     C                   END
     C  N71              Z-ADD     FABELN        XPFNOK
     C   71              Z-ADD     FABELV        XPFNOK
     C                   ADD       XPFNOK        XTOTAL
     C     XPFNOK        COMP      0                                  3636
     C     XFAVT1        IFEQ      'X'
     C                   MOVEL     XFAVT2        KGENOT
     C                   MOVEL     XFAVT2        KGEENT
     C                   MOVEL     XFAVT2        KG2TYT
     C                   MOVE      ' '           KGENOT
     C                   MOVE      ' '           KGEENT
     C                   MOVE      ' '           KG2TYT
     C                   MOVE      *BLANKS       FAVT
     C                   END
     C*
     C                   MOVE      XVAL          XVALB
     C                   MOVE      XVAL          XVALC
     C* NOT BORDEREAU
     C     UIN05         IFNE      '1'                                          1<-B
     C                   MOVE      *OFF          *IN89
     C     SOFBNR        IFNE      *ZEROS                                        2<-B
     C     DOKUKI        SETLL     DOKUF                                  90
     C     *IN90         IFEQ      *ON                                            3<-B
     C     DOKUKI        READE     DOKUF                                  90
     C     *IN90         IFEQ      *OFF                                            4<-B
     C                   MOVE      *ON           *IN89
     C                   Z-ADD     DFVKT         WWVKT
     C                   ENDIF                                                     4<-E
     C                   ENDIF                                                    3<-E
     C                   ENDIF                                                   2<-E
     C                   EXSR      MVA                                           2<-E
     C                   WRITE     DET
      *
     C     1             DO        100           XN01
     C                   IF        FTX(XN01) = *BLANKS
     C                   LEAVE
     C                   END
     C                   ADD       1             XANTL
     C                   EXSR      UTHDP
     C                   MOVE      FTX(XN01)     FXVT
     C                   WRITE     DETTXT
     C                   ENDDO
      *
     C                   ELSE                                                   1
     C                   EXCEPT    BDET
     C                   END                                                    1<-E
     C                   DELETE    SORTR
      *
     C                   ADD       1             XANTL
     C                   EXSR      UTHDP
     C                   GOTO      STVALI
     C*
     C     STVAL2        TAG
     C     XMVAGR        MULT(H)   FITAXB        XMOMS            13 2
     C                   Z-ADD     XMOMS         XPMOMS
     C                   Z-ADD     XTOTAL        XBRUTT
     C     XPMOMS        COMP      0                                  7272
     C* SPESIAL BORDEREAU
     C     UIN05         IFEQ      '1'
     C                   EXCEPT    TOTØ
     C                   ELSE
     C     *IN72         IFEQ      *ON
     C                   MOVE      XVAL          XVALB
     C                   MOVE      XVAL          XVALC
     C                   Z-ADD     1             XX
     C     SKMVA         TAG
     C     WSMVAK(XX)    IFNE      ' '
     C     WSMVAK(XX)    IFEQ      'J'
     C                   MOVE      '*'           TVATK
     C                   ELSE
     C                   MOVE      WSMVAK(XX)    TVATK
     C                   ENDIF
     C                   Z-ADD     WSMVAP(XX)    PRITAX
     C     *IN71         IFEQ      *OFF
     C                   Z-ADD     WSGRLN(XX)    XMVAGR
     C                   Z-ADD     WSMVAN(XX)    XPMOMS
     C                   ELSE
     C                   Z-ADD     WSGRLV(XX)    XMVAGR
     C                   Z-ADD     WSMVAV(XX)    XPMOMS
     C                   ENDIF
     C                   ADD       XPMOMS        XBRUTT
     C                   WRITE     TOTA
     C                   ADD       1             XX
     C                   GOTO      SKMVA
     C                   ENDIF
     C                   ENDIF
     C                   MOVEL     XBRUTT        XTOTKR
     C                   MOVE      XBRUTT        XTOTØR
     C                   MOVE      HP(8)         HP8
     C                   MOVE      HP(9)         HP9
     C                   MOVE      HP(10)        HP10
      *
     C                   IF        XNYFAKT = 'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
     C  N33              EXSR      OPDXML
     C                   END
      *
     C  N35              WRITE     TOTB
     C  N35              Z-ADD     0             XBRUTT
     C   35              WRITE     TOTC
     C   35              Z-ADD     0             XBRUTT
     C                   CLEAR                   WSMVAK
     C                   CLEAR                   WSMVAP
     C                   CLEAR                   WSVAL
     C                   CLEAR                   WSGRLN
     C                   CLEAR                   WSGRLV
     C                   CLEAR                   WSMVAN
     C                   CLEAR                   WSMVAV
     C                   END
     C*
      * SEND SYSPED INTERNEDI?
     C     *IN41         IFEQ      '0'
     C                   MOVE      'F'           UUOPKO            1
     C                   MOVE      XFN           UUFAKT            7
     C                   CALL      'SYKS37'
     C                   PARM                    UUOPKO
     C                   PARM                    UUFAKT
     C                   PARM                    CISEID
     C                   PARM                    CIMOID
     C                   PARM                    UUAVRE            1
     C                   PARM                    UUKUNR            8
     C                   MOVE      'J'           INTEDI
     C                   END
      *
      * blankett med KID i bunn
      *
     C     uawb          ifeq      'K'
     C                   exsr      KIDGIR
     C                   GOTO      SLVALI
     c                   end
     C   71
     COR 73              GOTO      SLVALI
     C* SPECIAL BORDEREAU  IF NOT INVOICE
     C     UIN05         IFEQ      '1'
     C                   GOTO      SLVALI
     C                   END
     C*
     C* IF GIRO IS GOING TO BE PRINTED
     C*
     C     UBBS          IFNE      'N'
     C     UAWB          IFNE      'J'
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   EXSR      KDTFM1
     C                   WRITE     BGIR
     C                   EXSR      KDTFM1
     C                   EXSR      MOD10
     C     UBBS          IFEQ      'A'
     C                   WRITE     BGIR2A
     C                   ELSE
     C     UBBS          IFEQ      'B'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      BGIRT
     C                   END
     C                   END
     C     BGIRT         TAG
      *
     C                   WRITE     BGIR2B
     C                   ELSE
     C     UBBS          IFEQ      'C'
     C                   WRITE     BGIR2C
     C                   ELSE
     C     UBBS          IFEQ      'D'
     C                   WRITE     BGIR2D
     C                   ELSE
     C     UBBS          IFEQ      'E'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      BGIRE
     C                   END
     C                   END
     C     BGIRE         TAG
      *
     C                   WRITE     BGIR2E
     C                   ELSE
      *
     C     UBBS          IFEQ      'F'
     C                   WRITE     BGIR2F
      *
     C                   ELSE
     C                   WRITE     BGIR3
     C                   END
      *
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C* WHEN SPLIT INVOICE/GIRO
     C                   ELSE
      *
      * delt giro / kidfaktura start
      *
     C     BETMAT        IFEQ      'B'
     C                   EXSR      DELTG
     C                   END
     C                   END
     C                   END
     C*
     C     SLVALI        ENDSR
     C*
     C***********************************************
     C     VALIS2        BEGSR
     C***********************************************
     C*
     C* GETS TEXT OF COUNTRY OF INVOICERECIEVER
     C                   MOVE      *ZEROS        XANTL             2 0
     C                   MOVE      *BLANKS       KLKNVN
     C     SYLAND        IFNE      FILAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   END
     C*
     C  N70
     CANN79              MOVE      HO            HP
     C   70              MOVE      HE            HP
     C   79              MOVE      HT            HP
     C     DKUND         COMP      'D'                                    48
     C                   SETOFF                                       88
     C                   Z-ADD     2             XSIDE
     C*
     C* TESTS IF IT IS A CREDITNOTE
     C*
     C                   EXSR      KREDIT
     C*
     C  N70KO2NTX        COMP      *BLANKS                                33
     C  N70
     CAN 33              MOVE      XF2NV         KO2NTX
     C   70KO2ETX        COMP      *BLANKS                                33
     C   70
     CAN 33              MOVE      XF2NV2        KO2ETX
     C     XBRUTT        COMP      0                                    73
     C     XVAL          COMP      FICURR                             7171
     C                   MOVE      'J'           XVALS2
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C                   ADD       1             NBRINV
     C                   WRITE     SKJØPD
     C                   WRITE     SHEAD2
     C                   EXSR      FRILIN
     C                   EXSR      KDTFM1
     C*
     C* END HEADING
     C* PRINT DETAIL/LINES
     C*
     C     SORTK         SETLL     SORT
     C                   MOVE      *ZEROS        XTOTAL           13 2
     C                   MOVE      *ZEROS        XMVAGR
     C*                    MOVE *ZEROS    XANTL   20
     C*
     C     STVD          TAG
     C                   SETOFF                                       33
     C                   READ      SORT                                   33
     C   33              GOTO      STVD2
     C* TEST IF NEXT LINE HAVE SOME CODE AND NO TEXT
     C*
     C     SOVT          IFEQ      *BLANKS
     C                   MOVE      SOKDM         XOKDM             1
     C                   MOVE      SOSAMM        XOSAMM            1
     C                   MOVE      SOVK          XOVK              3
     C                   MOVE      SOVT          XOVT             20
     C                   MOVE      SOBELN        XOBELN           13 2
     C                   MOVE      SOBELV        XOBELV           13 2
     C                   EXSR      TESTEQ
     C                   END
     C     FAKDM         COMP      'J'                                    34
      * sjekk momskoder fra Løsning1                                      34
     C  N34              EXSR      MOMSKD
     C   34
     CANN71              ADD       FABELN        XMVAGR
     C   34
     CAN 71              ADD       FABELV        XMVAGR
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C   79KODG2K        CHAIN     KOG2R                              33
     C     SOSAMM        IFNE      *BLANK
     C     SOSAMM        CHAIN     KODSAM                             33
     C                   END
     C  N71              Z-ADD     FABELN        XPFNOK
     C   71              Z-ADD     FABELV        XPFNOK
     C                   ADD       XPFNOK        XTOTAL
     C     XPFNOK        COMP      0                                  3636
     C     XFAVT1        IFEQ      'X'
     C                   MOVEL     XFAVT2        KGENOT
     C                   MOVEL     XFAVT2        KGEENT
     C                   MOVEL     XFAVT2        KG2TYT
     C                   MOVE      ' '           KGENOT
     C                   MOVE      ' '           KGEENT
     C                   MOVE      ' '           KG2TYT
     C                   MOVE      *BLANKS       FAVT
     C                   END
     C*
     C                   MOVE      XVAL          XVALB
     C                   MOVE      XVAL          XVALC
     C* NOT BORDEREAU
     C                   WRITE     SDET
     C                   DELETE    SORTR
     C                   ADD       1             XANTL
     C                   EXSR      UTHDPD
     C                   GOTO      STVD
     C*
     C     STVD2         TAG
     C     XMVAGR        MULT(H)   FITAXB        XMOMS            13 2
     C                   Z-ADD     XMOMS         XPMOMS
     C     XTOTAL        ADD       XMOMS         XBRUTT
     C                   MOVEL     XBRUTT        XTOTKR
     C                   MOVE      XBRUTT        XTOTØR
     C     XPMOMS        COMP      0                                  7272
      *
     C   72              MOVE      XVAL          XVALB
     C   72              MOVE      XVAL          XVALC
     C   72              WRITE     STOTA
     C   72              Z-ADD     0             XMVAGR
     C                   MOVE      HP(8)         HP8
     C                   MOVE      HP(9)         HP9
     C                   MOVE      HP(10)        HP10
      *
     C                   IF        XNYFAKT = 'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
     C  N33              EXSR      OPDXML
     C                   END
      *
     C                   WRITE     STOTC
     C                   Z-ADD     0             XBRUTT
     C*
      *
      * blankett med KID i bunn
      *
     C     uawb          ifeq      'K'
     C                   move      'S'           sjo               1
     C                   exsr      KIDGIR
     C                   move      ' '           sjo
     C                   GOTO      SLVD
     c                   end
     C   71
     COR 73              GOTO      SLVD
     C*
     C* IF GIRO IS GOING TO BE PRINTED
     C*
     C     UBBS          IFNE      'N'
     C     UAWB          IFNE      'J'
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   EXSR      KDTFM1
     C                   WRITE     SBGIR
     C                   EXSR      KDTFM1
     C                   EXSR      MOD10
     C     UBBS          IFEQ      'A'
     C                   WRITE     SBGIR2A
     C                   ELSE
     C     UBBS          IFEQ      'B'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      SBGIRT
     C                   END
     C                   END
     C     SBGIRT        TAG
      *
     C                   WRITE     SBGIR2B
     C                   ELSE
     C     UBBS          IFEQ      'C'
     C                   WRITE     SBGIR2C
     C                   ELSE
     C     UBBS          IFEQ      'D'
     C                   WRITE     SBGIR2D
     C                   ELSE
     C     UBBS          IFEQ      'E'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      SBGIRE
     C                   END
     C                   END
     C     SBGIRE        TAG
      *
     C                   WRITE     SBGIR2E
     C                   ELSE
      *
     C     UBBS          IFEQ      'F'
     C                   WRITE     SBGIR2F
      *
     C                   ELSE
     C                   WRITE     SBGIR3
     C                   END
      *
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C* WHEN SPLIT INVOICE/GIRO
     C                   ELSE
      * delt giro / kidfaktura start
      *
     C     BETMAT        IFEQ      'B'
     C                   EXSR      DELTG
     C                   END
     C                   END
     C                   END
     C*
     C     SLVD          ENDSR
     C*
     C***********************************************
     C     VALISH        BEGSR
     C***********************************************
     C*
     C* GETS TEXT OF COUNTRY OF INVOICERECIEVER
     C                   MOVE      *BLANKS       KLKNVN
     C     SYLAND        IFNE      FILAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   END
     C*
     C  N70
     CANN79              MOVE      HO            HP
     C   70              MOVE      HE            HP
     C   79              MOVE      HT            HP
     C     DKUND         COMP      'D'                                    48
     C                   SETOFF                                       88
     C                   Z-ADD     2             XSIDE
     C*
     C     BILLK         CHAIN     BILLOF                             33
     C   33              MOVE      *BLANKS       BLREIS
     C                   MOVE      *BLANKS       XOBNA
     C                   MOVE      *BLANKS       XLBNA
     C                   MOVE      *BLANKS       XLSTN
     C                   MOVE      *BLANKS       XLOSNA
     C                   MOVE      *BLANKS       XVHNA
     C                   MOVE      *BLANKS       XLOHNA
     C                   MOVE      *BLANKS       XLSHNA
     C  N33              DO
     C     BLBLNR        IFEQ      *BLANKS
     C                   MOVE      BLBBLN        BLBLNR
     C                   END
     C     BLOB          CHAIN     CDBOAT                             33
     C  N33              MOVEL     CBNAB         XOBNA
     C     BLLB          CHAIN     CDBOAT                             33
     C  N33              MOVEL     CBNAB         XLBNA
     C     BLLSS         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLSTN
     C     BLLOS         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLOSNA
     C     BLVH          CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XVHNA
     C     BLLOH         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLOHNA
     C     BLLSH         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLSHNA
     C                   END
     C*
     C* TESTS IF IT IS A CREDITNOTE
     C*
     C                   EXSR      KREDIT
     C*
     C* HENTE FRITEKSTER
     C                   EXSR      BHENTT
     C*
     C  N70KO2NTX        COMP      *BLANKS                                33
     C  N70
     CAN 33              MOVE      XF2NV         KO2NTX
     C   70KO2ETX        COMP      *BLANKS                                33
     C   70
     CAN 33              MOVE      XF2NV2        KO2ETX
     C     XBRUTT        COMP      0                                    73
     C     XVAL          COMP      FICURR                             7171
     C   71XVAL          COMP      '   '                              7171
     C*
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C                   WRITE     BKJØP
     C*
     C* SKRIVER VARELINJER AV B/L
     C     BILLK         CHAIN     BILLOF                             33
     C   33              DO
     C                   MOVE      *BLANKS       BVMN
     C                   MOVEL     HEGM1         BVMN
     C                   MOVE      HENT          BVNT
     C                   MOVEL     HEVS1         BVVS
     C                   MOVE      HEVKT         BVVKT
     C                   MOVE      HEM3          BVM3
     C                   WRITE     BDETBL1
     C     HEGM2         IFNE      *BLANKS
     C     HEVS2         ORNE      *BLANKS
     C                   MOVE      *BLANKS       XMN
     C                   MOVEL     HEGM2         XMN
     C                   MOVE      *BLANKS       XFT
     C                   MOVEL     HEVS2         XFT
     C                   WRITE     BDETBL2
     C                   END
     C                   END
     C  N33              EXSR      BLTXT
     C*
     C* END HEADING
     C* PRINT DETAIL/LINES
     C*
     C     SORTK         SETLL     SORT
     C                   MOVE      *ZEROS        XTOTAL           13 2
     C                   MOVE      *ZEROS        XMVAGR
     C                   MOVE      *ZEROS        XANTL             2 0
     C*
     C                   WRITE     BDETBLH
     C                   Z-ADD     1             N2                2 0
     C                   SETOFF                                       3388
     C     STVA2         TAG
     C                   READ      SORT                                   33
     C  N33
     CAN 88              DO
     C                   WRITE     BKJØP1
     C                   WRITE     BKJØP
     C                   MOVE      '0'           *IN88
     C                   MOVE      *ZEROS        XANTL
     C                   ADD       1             XSIDE
     C                   WRITE     BDETBLH
     C                   END
     C     SOVT          IFEQ      *BLANKS
     C                   MOVE      SOKDM         XOKDM             1
     C                   MOVE      SOSAMM        XOSAMM            1
     C                   MOVE      SOVK          XOVK              3
     C                   MOVE      SOVT          XOVT             20
     C                   MOVE      SOBELN        XOBELN           13 2
     C                   MOVE      SOBELV        XOBELV           13 2
     C                   EXSR      TESTEQ
     C                   END
     C  N33
     CANN88              DO                                                     1<-B
     C     FAKDM         COMP      'J'                                    34
      * sjekk momskoder fra Løsning1                                      34
     C  N34              EXSR      MOMSKD
     C   34
     CANN71              ADD       FABELN        XMVAGR
     C   34
     CAN 71              ADD       FABELV        XMVAGR
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C   79KODG2K        CHAIN     KOG2R                              33
     C     SOSAMM        IFNE      *BLANK
     C     SOSAMM        CHAIN     KODSAM                             33
     C                   END
     C  N71              Z-ADD     FABELN        XPFNOK
     C   71              Z-ADD     FABELV        XPFNOK
     C                   ADD       XPFNOK        XTOTAL
     C     XPFNOK        COMP      0                                  3636
     C     FAVT          IFNE      *BLANKS
     C                   MOVEL     FAVT          KGENOT
     C                   MOVEL     FAVT          KGEENT
     C                   MOVEL     FAVT          KG2TYT
     C                   END
     C*
     C                   MOVEL     XS(N2)        XFT37
     C                   WRITE     BDETK
     C                   ADD       1             XANTL
     C                   ADD       1             N2
     C     UAWB          IFEQ      'K'
     C     XANTL         COMP      14                                 88  88
     C                   ELSE
     C     XANTL         COMP      20                                 88  88
     C                   END
     C                   DELETE    SORTR
     C                   GOTO      STVA2
     C                   END                                                    1<-E
     C*
     C     XMVAGR        MULT(H)   FITAXB        XMOMS            13 2
     C                   Z-ADD     XMOMS         XPMOMS
     C     XTOTAL        ADD       XMOMS         XBRUTT
     C                   MOVEL     XBRUTT        XTOTKR
     C                   MOVE      XBRUTT        XTOTØR
     C     XPMOMS        COMP      0                                  7272
     C   72              DO
     C                   Z-ADD     1             XX
     C     SKMVA1        TAG
     C     WSMVAK(XX)    IFNE      ' '
     C     WSMVAK(XX)    IFEQ      'J'
     C                   MOVE      '*'           TVATK
     C                   ELSE
     C                   MOVE      WSMVAK(XX)    TVATK
     C                   ENDIF
     C                   Z-ADD     WSMVAP(XX)    PRITAX
     C     *IN71         IFEQ      *OFF
     C                   Z-ADD     WSGRLN(XX)    XMVAGR
     C                   Z-ADD     WSMVAN(XX)    XPMOMS
     C                   ELSE
     C                   Z-ADD     WSGRLV(XX)    XMVAGR
     C                   Z-ADD     WSMVAV(XX)    XPMOMS
     C                   ENDIF
     C                   ADD       XPMOMS        XBRUTT
     C                   MOVEL     XS(N2)        XFT37
     C                   WRITE     BTOT1
     C                   ADD       1             XX
     C                   GOTO      SKMVA1
     C                   ENDIF
     C                   MOVEL     XBRUTT        XTOTKR
     C                   MOVE      XBRUTT        XTOTØR
     C                   MOVEL     XS(N2)        XFT37
     C                   WRITE     BTOT2
     C                   ADD       1             N2
     C                   END
     C*
     C     XSIDE         IFLE      2
     C     UAWB          IFEQ      'K'
     C                   Z-ADD     11            N3
     C                   ELSE
     C                   Z-ADD     22            N3
     C                   end
     C                   ELSE
     C     XSIDE         MULT      20            N3
     C                   SUB       20            N3
     C                   ADD       2             N3
     C                   END
     C     N2            DOWLE     N3
     C                   MOVEL     XS(N2)        XFT37
     C                   WRITE     BDETK2
     C                   ADD       1             N2
     C                   END
     C*
     C                   MOVE      HP(8)         HP8
     C                   MOVE      HP(9)         HP9
     C                   MOVE      HP(10)        HP10
      *
     C                   IF        XNYFAKT = 'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
     C  N33              EXSR      OPDXML
     C                   END
      *
     C     UAWB          IFEQ      'S'                                          1<-B
     C                   WRITE     BTOT
      * Lang sjøfaktura på laser - IKKE skriv giro
     C     KOPFM         IFNE      *BLANKS
     C                   GOTO      SLVA2
     C                   END
     C                   ELSE                                                   1
     c     UAWB          IFEQ      'K'
     C                   WRITE     BTOT72K
     C                   ELSE
     C                   WRITE     BTOT72
     C                   END
     C                   END                                                    1<-E
     C*
     C     uawb          ifeq      'K'
     C                   move      'S'           sjo
     C                   exsr      KIDGIR
     C                   move      ' '           sjo
     C                   GOTO      SLVA2
     c                   end
     C   71
     COR 73              GOTO      SLVA2
     C*
     C* IF GIRO IS GOING TO BE PRINTED
     C*
     C     UBBS          IFNE      'N'                                          1<-B
     C     UAWB          IFEQ      'S'                                           2<-B
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   EXSR      KDTFM1
     C                   WRITE     BBGIR
     C                   EXSR      KDTFM1
     C                   EXSR      MOD10
     C     UBBS          IFEQ      'A'                                            3<-B
     C                   WRITE     BBGIR2A
     C                   ELSE                                                     3
     C     UBBS          IFEQ      'B'                                             4<-B
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0              5<-B
     C     A(AX)         IFEQ      '0'                                               6<-B
     C                   MOVE      ' '           A(AX)
     C                   ELSE                                                        6
     C                   GOTO      BBGIRT
     C                   END                                                         6<-E
     C                   END                                                        5<-E
     C     BBGIRT        TAG
      *
     C                   WRITE     BBGIR2B
     C                   ELSE                                                      4
     C     UBBS          IFEQ      'C'                                              5<-B
     C                   WRITE     BBGIR2C
     C                   ELSE                                                       5
     C     UBBS          IFEQ      'D'                                               6<-B
     C                   WRITE     BBGIR2D
     C                   ELSE                                                        6
     C     UBBS          IFEQ      'E'                                                7<-B
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0                 8<-B
     C     A(AX)         IFEQ      '0'                                                  9<-B
     C                   MOVE      ' '           A(AX)
     C                   ELSE                                                           9
     C                   GOTO      BBGIRE
     C                   END                                                            9<-E
     C                   END                                                           8<-E
     C     BBGIRE        TAG
      *
     C                   WRITE     BBGIR2E
     C                   ELSE                                                         7
      *
     C     UBBS          IFEQ      'F'                                                 8<-B
     C                   WRITE     BBGIR2F
     C                   ELSE                                                          8
     C                   WRITE     BBGIR3
     C                   END                                                           8<-E
      *
     C                   END                                                          7<-E
     C                   END                                                         6<-E
     C                   END                                                        5<-E
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C* WHEN SPLIT INVOICE/GIRO
     C                   ELSE                                                    2
      * delt giro / kidfaktura start
      *
     C     BETMAT        IFEQ      'B'
     C                   EXSR      DELTG
     C                   END                                                     2<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     SLVA2         ENDSR
     C*
     C***********************************************
     C     VALIS3        BEGSR
     C***********************************************
     C*
     C* GETS TEXT OF COUNTRY OF INVOICERECIEVER
     C                   MOVE      *BLANKS       KLKNVN
     C     SYLAND        IFNE      FILAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   END
     C*
     C  N70
     CANN79              MOVE      HO            HP
     C   70              MOVE      HE            HP
     C   79              MOVE      HT            HP
     C     DKUND         COMP      'D'                                    48
     C                   SETOFF                                       88
     C                   Z-ADD     2             XSIDE
     C*
     C     BILLK         CHAIN     BILLOF                             33
     C   33              MOVE      *BLANKS       BLREIS
     C                   MOVE      *BLANKS       XOBNA
     C                   MOVE      *BLANKS       XLBNA
     C                   MOVE      *BLANKS       XLSTN
     C                   MOVE      *BLANKS       XLOSNA
     C                   MOVE      *BLANKS       XVHNA
     C                   MOVE      *BLANKS       XLOHNA
     C                   MOVE      *BLANKS       XLSHNA
     C  N33              DO
     C     BLBLNR        IFEQ      *BLANKS
     C                   MOVE      BLBBLN        BLBLNR
     C                   END
     C     BLOB          CHAIN     CDBOAT                             33
     C  N33              MOVEL     CBNAB         XOBNA
     C     BLLB          CHAIN     CDBOAT                             33
     C  N33              MOVEL     CBNAB         XLBNA
     C     BLLSS         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLSTN
     C     BLLOS         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLOSNA
     C     BLVH          CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XVHNA
     C     BLLOH         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLOHNA
     C     BLLSH         CHAIN     STED2                              33
     C  N33              MOVEL     ST2NVN        XLSHNA
     C                   END
     C*
     C* TESTS IF IT IS A CREDITNOTE
     C*
     C                   EXSR      KREDIT
     C*
     C*
     C  N70KO2NTX        COMP      *BLANKS                                33
     C  N70
     CAN 33              MOVE      XF2NV         KO2NTX
     C   70KO2ETX        COMP      *BLANKS                                33
     C   70
     CAN 33              MOVE      XF2NV2        KO2ETX
     C     XBRUTT        COMP      0                                    73
     C     XVAL          COMP      FICURR                             7171
     C   71XVAL          COMP      '   '                              7171
     C*
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C                   MOVE      '0'           *IN88
     C                   WRITE     TKJØP
     C                   WRITE     TKJØP2
     C                   MOVE      '1'           *IN88
     C*
     C* SKRIVER VARELINJER AV B/L
     C                   MOVE      *ZEROS        XANTL
     C     BILLK         CHAIN     BILLOF                             33
     C   33              DO
     C                   MOVE      *BLANKS       BVMN
     C                   MOVEL     HEGM1         BVMN
     C                   MOVE      HENT          BVNT
     C                   MOVEL     HEVS1         BVVS
     C                   MOVE      HEVKT         BVVKT
     C                   MOVE      HEM3          BVM3
     C                   ADD       1             XANTL
     C                   WRITE     TDETBL1
     C     HEGM2         IFNE      *BLANKS
     C     HEVS2         ORNE      *BLANKS
     C                   MOVE      *BLANKS       XMN
     C                   MOVEL     HEGM2         XMN
     C                   MOVE      *BLANKS       XFT
     C                   MOVEL     HEVS2         XFT
     C                   ADD       1             XANTL
     C                   WRITE     TDETBL2
     C                   END
     C                   END
      *
     C  N33              DO
     C     BLV1K         SETLL     BLV1LF                             33
     C     STVS31        TAG
     C     BLV1K         READE     BLV1LF                                 33
     C  N33              DO
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TKJØP2
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   WRITE     TDETBL1
     C  N33              GOTO      STVS31
     C                   END
     C                   EXSR      BLTXT3
     C                   END
      * MAKE A BLANK LINE
     C                   MOVE      *BLANKS       XMN
     C                   MOVE      *BLANKS       XFT
     C                   ADD       1             XANTL
     C                   WRITE     TDETBL2
      *
      * FRIE SØKEVEIER (KUN DE SOM HAR DOK.KODE LIK K/S/X  EL B)
     C                   MOVE      *BLANKS       FSFORI
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'
     C                   SORTA     DFS
     C     DFS(10)       IFNE      ' '
     C     XXSKKO        LOOKUP    DFS                                    33
     C  N33'B'           LOOKUP    DFS                                    33
     C     *IN33         IFEQ      '1'
     C     FSKODE        CHAIN     KODFRI                             33
     C     *IN33         IFEQ      '0'
     C     FSKODE        IFEQ      FSFORI
     C                   MOVE      *BLANKS       KFSOTX
     C                   END
     C                   MOVE      FSKODE        FSFORI
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETBLH
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END                                                     2<-E
     C                   ADD       1             XANTL
     C                   WRITE     TKJØPFS
     C                   END
     C                   END
     C                   END
     C*
     C     HEADFK        READE     FRISOK                                 33
     C                   END
      *
      * SKRIV  UTLEV.FORBEHOLD
     C     HEKFT1        IFEQ      *BLANKS
     C     HEFT1A        ANDNE     *BLANKS
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETBLH
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   WRITE     UFB20PT
     C                   END
      *
      * PRINT FRITEKSTER
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETBLH
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END                                                     2<-E
     C     UKOPI         IFEQ      'J'                                          1<-B
     C                   MOVE      XFN           XXFA00
     C                   ELSE                                                   1
     C                   MOVE      *ZEROS        XXFA00
     C                   END                                                    1<-E
     C     FREETK        SETLL     FREETXT2                           33
     C     STVS32        TAG
     C     FREETK        READE     FREETXT2                               33
     C  N33              DO                                                     1<-B
     C     UKOPI         IFNE      'J'                                           2<-B
     C                   MOVE      XFN           FRTFAK
     C                   END                                                     2<-E
     C                   UPDATE    FREETXTR
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETBLH
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END                                                     2<-E
     C                   ADD       1             XANTL
     C                   WRITE     TDETBLD
     C                   GOTO      STVS32
     C                   END                                                    1<-B
      *
      *** HENTE FREETEKST MED KODE B
     C                   MOVE      XXSKKO        XXSKK2            1
     C                   MOVE      'B'           XXSKKO
     C     FREETK        SETLL     FREETXT2                           33
     C     STVS33        TAG
     C     FREETK        READE     FREETXT2                               33
     C  N33              DO                                                     1<-B
     C     UKOPI         IFNE      'J'                                           2<-B
     C                   MOVE      XFN           FRTFAK
     C                   END                                                     2<-E
     C                   UPDATE    FREETXTR
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETBLH
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END                                                     2<-E
     C                   ADD       1             XANTL
     C                   WRITE     TDETBLD
     C                   GOTO      STVS33
     C                   END                                                    1<-B
     C                   MOVE      XXSKK2        XXSKKO
      *
      * PRINT DETAIL/LINES
      *
     C     SORTK         SETLL     SORT
     C                   MOVE      *ZEROS        XTOTAL           13 2
     C                   MOVE      *ZEROS        XMVAGR
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   ADD       1             XSIDE
     C                   Z-SUB     1             XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   WRITE     TDETKSH
      *
     C     STVS34        TAG
     C                   SETOFF                                       33
     C                   READ      SORT                                   33
     C   33              GOTO      STVS35
      * TEST IF NEXT LINE HAVE SOME CODE AND NO TEXT
      *
     C     SOVT          IFEQ      *BLANKS
     C                   MOVE      SOKDM         XOKDM             1
     C                   MOVE      SOSAMM        XOSAMM
     C                   MOVE      SOVK          XOVK              3
     C                   MOVE      SOVT          XOVT             20
     C                   MOVE      SOBELN        XOBELN           13 2
     C                   MOVE      SOBELV        XOBELV           13 2
     C                   EXSR      TESTEQ
     C                   ELSE
     C                   MOVE      *BLANKS       FTX
     C                   MOVE      *ZEROS        XN01
     C                   EXSR      HENTFTXT
     C                   END
     C     FAKDM         COMP      'J'                                    34
      * sjekk momskoder fra Løsning1                                      34
     C  N34              EXSR      MOMSKD
     C   34
     CANN71              ADD       FABELN        XMVAGR
     C   34
     CAN 71              ADD       FABELV        XMVAGR
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C   79KODG2K        CHAIN     KOG2R                              33
     C     SOSAMM        IFNE      *BLANK
     C     SOSAMM        CHAIN     KODSAM                             33
     C                   END
     C  N71              Z-ADD     FABELN        XPFNOK
     C   71              Z-ADD     FABELV        XPFNOK
     C                   ADD       XPFNOK        XTOTAL
     C     XPFNOK        COMP      0                                  3636
     C     XFAVT1        IFEQ      'X'
     C                   MOVEL     XFAVT2        KGENOT
     C                   MOVEL     XFAVT2        KGEENT
     C                   MOVEL     XFAVT2        KG2TYT
     C                   MOVE      ' '           KGENOT
     C                   MOVE      ' '           KGEENT
     C                   MOVE      ' '           KG2TYT
     C                   MOVE      *BLANKS       FAVT
     C                   END
      *
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETKSH
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   EXSR      MVA                                           2<-E
     C                   WRITE     TDETKSD
      *
     C     1             DO        100           XN01
     C                   IF        FTX(XN01) = *BLANKS
     C                   LEAVE
     C                   END
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETKSH
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   MOVE      FTX(XN01)     FXVT
     C                   WRITE     TDETTXT
     C                   ENDDO
      *
     C                   DELETE    SORTR
     C                   GOTO      STVS34
      *
     C     STVS35        TAG
     C     XMVAGR        MULT(H)   FITAXB        XMOMS            13 2
     C                   Z-ADD     XMOMS         XPMOMS
     C                   Z-ADD     XTOTAL        XBRUTT
     C     XPMOMS        COMP      0                                  7272
      *
     C   72XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETKSH
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
     C     *IN72         IFEQ      *ON
     C                   Z-ADD     1             XX
     C     SKMVX         TAG
     C     WSMVAK(XX)    IFNE      ' '
     C     WSMVAK(XX)    IFEQ      'J'
     C                   MOVE      '*'           TVATK
     C                   ELSE
     C                   MOVE      WSMVAK(XX)    TVATK
     C                   ENDIF
     C                   Z-ADD     WSMVAP(XX)    PRITAX
     C     *IN71         IFEQ      *OFF
     C                   Z-ADD     WSGRLN(XX)    XMVAGR
     C                   Z-ADD     WSMVAN(XX)    XPMOMS
     C                   ELSE
     C                   Z-ADD     WSGRLV(XX)    XMVAGR
     C                   Z-ADD     WSMVAV(XX)    XPMOMS
     C                   ENDIF
     C                   ADD       XPMOMS        XBRUTT
     C                   WRITE     TTOT1
     C                   ADD       1             XX
     C                   GOTO      SKMVX
     C                   ENDIF
     C                   ENDIF
     C                   MOVEL     XBRUTT        XTOTKR
     C                   MOVE      XBRUTT        XTOTØR
     C                   CLEAR                   WSMVAK
     C                   CLEAR                   WSMVAP
     C                   CLEAR                   WSVAL
     C                   CLEAR                   WSGRLN
     C                   CLEAR                   WSGRLV
     C                   CLEAR                   WSMVAN
     C                   CLEAR                   WSMVAV
      *
     C                   MOVE      HP(8)         HP8
     C                   MOVE      HP(9)         HP9
     C                   MOVE      HP(10)        HP10
     C                   EVAL      XANTL = XANTL + 4
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TDETKSH
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
      *
     C                   IF        XNYFAKT = 'J'
     C     CUNDC03K      CHAIN     CUNDC03                            33
     C  N33              EXSR      OPDXML
     C                   END
      *
     C  N35              WRITE     TTOT
     C   35              WRITE     TTOTC
      *
      * blankett med KID i bunn
      *
     C     uawb          ifeq      'K'
     C                   move      'T'           sjo               1
     C                   exsr      KIDGIR
     C                   move      ' '           sjo
     C                   GOTO      SLVS3
     c                   end
      *
     C   71
     COR 73              GOTO      SLVS3
      *
      * IF GIRO IS GOING TO BE PRINTED
      *
     C     UBBS          IFNE      'N'                                          1<-B
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   EXSR      KDTFM1
     C                   WRITE     TBGIR
     C                   EXSR      KDTFM1
     C                   EXSR      MOD10
     C     UBBS          IFEQ      'A'                                           2<-B
     C                   WRITE     TBGIR2A
     C                   ELSE                                                    2
     C     UBBS          IFEQ      'B'                                            3<-B
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0             4<-B
     C     A(AX)         IFEQ      '0'                                              5<-B
     C                   MOVE      ' '           A(AX)
     C                   ELSE                                                       5
     C                   GOTO      STVS36
     C                   END                                                        5<-E
     C                   END                                                       4<-E
     C     STVS36        TAG
      *
     C                   WRITE     TBGIR2B
     C                   ELSE                                                     3
     C     UBBS          IFEQ      'C'                                             4<-B
     C                   WRITE     TBGIR2C
     C                   ELSE                                                      4
     C     UBBS          IFEQ      'D'                                              5<-B
     C                   WRITE     TBGIR2D
     C                   ELSE                                                       5
     C     UBBS          IFEQ      'E'                                               6<-B
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0                7<-B
     C     A(AX)         IFEQ      '0'                                                 8<-B
     C                   MOVE      ' '           A(AX)
     C                   ELSE                                                          8
     C                   GOTO      STVS37
     C                   END                                                           8<-E
     C                   END                                                          7<-E
     C     STVS37        TAG
      *
     C                   WRITE     TBGIR2E
     C                   ELSE                                                        6
      *
     C     UBBS          IFEQ      'F'                                                7<-B
     C                   WRITE     TBGIR2F
     C                   ELSE                                                         7
     C                   WRITE     TBGIR3
     C                   END                                                          7<-E
      *
     C                   END                                                         6<-E
     C                   END                                                        5<-E
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C     SLVS3         ENDSR
      *
     C***********************************************
     C     DELTG         BEGSR
     C***********************************************
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   EXSR      KDTFM1
     C                   WRITE     SGIR
     C                   EXSR      KDTFM1
     C                   EXSR      MOD10
     C     UBBS          IFEQ      'A'
     C                   WRITE     SGIR2A
     C                   ELSE
     C     UBBS          IFEQ      'B'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      SGIRT
     C                   END
     C                   END
     C     SGIRT         TAG
      *
     C                   WRITE     SGIR2B
     C                   ELSE
     C     UBBS          IFEQ      'C'
     C                   WRITE     SGIR2C
     C                   ELSE
     C     UBBS          IFEQ      'D'
     C                   WRITE     SGIR2D
     C                   ELSE
     C     UBBS          IFEQ      'E'
      * FIX Z-SUPRESS FOR ALFA-FILED
     C                   MOVE      XTOTKR        ATOTKR
     C     1             DO        10            AX                2 0
     C     A(AX)         IFEQ      '0'
     C                   MOVE      ' '           A(AX)
     C                   ELSE
     C                   GOTO      SGIRE
     C                   END
     C                   END
     C     SGIRE         TAG
      *
     C                   WRITE     SGIR2E
     C                   ELSE
      *
     C     UBBS          IFEQ      'F'
     C                   WRITE     SGIR2F
      *
     C                   ELSE
     C                   WRITE     SGIR3
     C                   END
      *
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   ENDSR
     C***********************************************
     C     KREDIT        BEGSR
     C***********************************************
      * VED FLERE ENN 20 GEBYRLINJER SKAL PRGRAMMET LAGE NY FAKTURA
      * FOR DE GEBYRLINJENE ETTER 20. GEBYRLINJEN.
      * KUN FOR 96 LINJERS SJØ-FAKTURA ELLER 72 LINJERS UTEN GIRO
     C                   MOVE      *ZEROS        XANTGL            3 0
     C*
     C*
     C* TESTS IF IT IS A CREDITNOTE
     C*
     C     XVAL          COMP      FICURR                             7171
     C     UKOPI         IFEQ      'J'                                          1<-B
     C* IF COPY THE DOKUMENT CAN HAVE DIFFERENT STATUSCODES
     C                   SETOFF                                       33
     C     FAK2KC        SETLL     FAK3
     C                   ELSE                                                   1
     C     FAK2K         SETLL     FAK4
     C                   END                                                    1<-E
     C*
     C                   MOVE      *ZEROS        XTOTAL
     C                   MOVE      *ZEROS        XMVAGR
     C*
     C     STKRE         TAG
     C                   SETOFF                                       33
     C     UKOPI         IFEQ      'J'                                          1<-B
     C     FAK2KC        READE     FAK3                                   33
     C  N33FAKDA         IFEQ      'K'
     C                   GOTO      STKRE
     C                   END
     C                   ELSE                                                   1
     C     FAK2K         READE     FAK4                                   33
     C                   END                                                    1<-E
     C   33              GOTO      SLKRE
     C     FASK          IFEQ      'X'
     C     FAKUNR        IFNE      FAKUGM
     C                   GOTO      STKRE
     C                   END
     C     FAVK          IFEQ      'AME'
     C                   GOTO      STKRE
     C                   END
     C                   END
     C*
     C* WHEN FULLCREDITING AN INVOICE - READ ONLY THE OPEN INV.LINES
     C* BELONGING TO THE CREDITNOTE. (MARKED "C" IN "FAKDA")
     C     UKOPI         IFNE      'J'                                          1<-B
     C     UIN07         ANDEQ     '1'
     C     FAKDA         ANDNE     'C'
     C                   GOTO      STKRE
     C                   END                                                    1<-E
     C     FASK          IFEQ      'I'
     C                   GOTO      STKRE
     C                   END
     C* INVOICE LINES WITH AMT. ZERO:
     C     FABELN        IFEQ      0                                            1<-B
     C*
     C* SKIPP BUT DO NOT DELETE IF OTHER UNIT=D(PR DAY)
     C     FA01B         IFEQ      'D'                                           2<-B
     C                   GOTO      STKRE
     C                   END                                                     2<-E
     C* SKIPP 0-LINE TYPE "PR LINE ON SAD" - DELETE IF SAD FINISHED
     C     FA01B         IFEQ      'L'                                           2<-B
     C     HEPK1         IFEQ      'J'                                           3<-B
     C                   GOTO      STKRE                                         SAD UFERDIG
     C                   ELSE                                                     X3
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STKRE
     C                   END                                                     3<-E
     C                   END                                                     2<-E
     C*
     C* NULL-LINJE SOM KUN ER BENYTTET FOR RASKT Å LAGE BUDSJ-POST..
     C     FAJOUR        IFNE      *ZEROS
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STKRE
     C                   END                                                     3<-E
     C* UTL-LINJE SOM ER ENDRET TIL 0
     C     FAVK          IFEQ      'UTL'
     C     FAKDA         IFEQ      'M'
     C     FAKDA         OREQ      'E'
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STKRE
     C                   END                                                     3<-E
     C                   END                                                     3<-E
     C* SKIPP AND DELETE IF AUTOGENERATED LINE
     C     FAKDA         IFEQ      'A'                                           2<-B
     C     FAKDA         OREQ      'B'
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C     KGETYP        IFNE      'NUL'
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STKRE
     C                   END                                                     2<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      * VED FLERE ENN 20 GEBYRLINJER SKAL PRGRAMMET LAGE NY FAKTURA
      * FOR DE GEBYRLINJENE ETTER 20. GEBYRLINJEN.
      * KUN FOR 96 LINJERS SJØ-FAKTURA ELLER 72 LINJERS UTEN GIRO
     C     UAWB          IFEQ      'S'                                          96 SJØ-FAKT.
     C     UAWB          OREQ      'J'                                          72 UTEN GIRO
     C     XSJFAK        IFEQ      'J'                                          1<-B
     C     XANTGL        CABGE     20            SLKRE
     C                   ADD       1             XANTGL
     C                   END
     C                   END
     C*
     C     FAKDM         COMP      'J'                                    34
      * sjekk momskoder fra Løsning1                                      34
     C  N34              EXSR      MOMSKD
     C   34
     CANN71              ADD       FABELN        XMVAGR
     C   34
     CAN 71              ADD       FABELV        XMVAGR
     C  N71              ADD       FABELN        XTOTAL
     C   71              ADD       FABELV        XTOTAL
     C                   MOVE      FAVK          YVK
     C     KODGEK        CHAIN     KOGER                              33
     C     KODG2K        CHAIN     KOG2R                              33
     C                   Z-ADD     FAFRBN        SOFBNR
     C     SOSAMM        IFNE      *BLANKS
     C                   Z-SUB     1             SOLNR
     C     SOVT          IFNE      *BLANKS
     C                   Z-SUB     2             SOLNR
     C                   MOVE      *BLANKS       SOSAMM
     C                   END
     C                   END
     C                   WRITE     SORTR
     C     FAAGRN        IFNE      *ZEROS
     C     KGETYP        ANDEQ     'FRA'
     C                   EXSR      NYFVKT
     C                   END
     C*
     C* UPDATING FILE
     C*
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DO                                                     1<-B
     C                   MOVE      KUNDNR        FAKUNR
     C                   MOVE      XFN           FAFAKT
     C                   MOVE      'F'           FAOPKO
      * PERIODE.
      * PRIO.1. OVERSTYRT PERIODE I BILDET...
     C     WSMMÅÅ        IFNE      *ZEROS
     C                   MOVE      YDTPM         FAMND
     C                   MOVE      YDTPÅ         FAÅR
     C                   MOVE      YDTPC         FACC
     C                   ELSE
      * PRIO.2. "OPPDRAGETS PERIODE" (=PERIODE FRA 1. FAKTURA PÅ OPPD.)
     C     HEDTMP        IFNE      *ZEROS
     C                   MOVE      HEDTMP        FAMND
     C                   MOVE      HEDTÅP        FAÅR
     C                   MOVE      HEDTCP        FACC
     C                   ELSE
      * PRIO.3. PERIODE UTFRA OPPDRAGSDATO
     C                   MOVE      HEDTM         FAMND
     C                   MOVE      HEDTÅ         FAÅR
     C                   MOVEL     HEDTÅ         FACC
     C                   END
     C                   END
     C                   MOVE      IDAG8         FADATO
     C                   MOVE      XFFDTD        FADAFD
     C                   MOVE      XFFDTM        FADAFM
     C                   MOVE      XFFDTÅ        FADAFÅ
     C     XFFDTÅ        IFGT      50
     C                   MOVEL     '19'          FADAFÅ
     C                   ELSE
     C                   MOVEL     '20'          FADAFÅ
     C                   END
     C                   MOVE      XVAL          FACURI
     C* DONT UPDATE IF COPYROUTINE(51)
     C     UKOPI         IFEQ      'U'
     C                   EXCEPT    DUMFAK
     C                   ELSE
     C  N51UIN05         IFNE      '1'                                           2<-B
     C     UKOPI         ORNE      'J'
     C                   EXCEPT    OPDFAK
     C                   ELSE                                                    2
     C                   EXCEPT    DUMFAK
     C                   END                                                     2<-E
     C*
     C   51              EXCEPT    DUMFAK
     C                   END                                                    1<-E
     C     FACD13        IFEQ      'L'
     C                   MOVE      'J'           XOPDGR
     C                   END
     C                   END
      *
     C                   GOTO      STKRE
     C*
     C     SLKRE         TAG
     C*
     C*
     C     XMVAGR        MULT(H)   FITAXB        XMOMS
     C     XTOTAL        ADD       XMOMS         XBRUTT
     C*
     C* VED KREDIT ENDRES FORFALLSDATO PÅ ALLE POSTER
     C     XBRUTT        IFLT      *ZEROS
     C                   MOVE      IDAGX         XFFDT
     C                   MOVE      IDAGX         KFFDT             6 0
     C  N51UKOPI         IFNE      'J'
     C                   CALL      'SYFA20FF'
     C                   PARM                    FAFAKT
     C                   END
     C                   END
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     CONSOL        BEGSR
     C***********************************************
     C* MARKS RECORDS FOR CONSOLIDATION CUSTOMER
     C*
     C     FAK2K         SETLL     FAK4
     C*
     C     STCON         TAG
     C                   SETOFF                                       33
     C     FAK2K         READE     FAK4                                   33
     C   33              GOTO      SLCON
     C     FASK          IFEQ      'X'
     C     FAKUNR        ANDNE     FAKUGM
     C                   GOTO      STCON
     C                   END
     C     FAVK          IFEQ      'AME'
     C                   GOTO      STCON
     C                   END
     C*
     C* DELETE AUTO GENERATED INVOICE LINES WITH AMT. ZERO
     C* DO NOT DELETE LINES IF OTHER UNIT = D (PR DAY)/L (PR SAD-LINE)
     C     FABELN        IFEQ      0                                            B1
     C     FA01B         ANDNE     'L'
     C     FA01B         ANDNE     'D'
     C*
     C* NULL-LINJER M.BUDPOST SLETTES ALLTID
     C     FAJOUR        IFNE      *ZEROS
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STCON
     C                   END                                                     3<-E
     C* UTL-LINJE SOM ER ENDRET TIL 0 BEVARES VED SAMLEFAKTURA
     C* HELT FRAM TIL TIDSPKT FOR UTSKRIFT AV SELVE SAMLEFAKT (FOR Å
     C* HINDRE REKALT AV UTL) - SLETTES AV SYFA27
      *
      * AUTOMATSKAPTE NULL-LINJER  SLETTES ALLTID
     C     FAKDA         IFEQ      'A'                                            B2
     C     FAKDA         OREQ      'B'
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DELETE    FAKTR
     C                   GOTO      STCON
     C                   END                                                      E2
     C                   END                                                    E1
     C*
     C*
     C* UPDATING FILE
     C*
     C     FAKTK         CHAIN     FAKT                               33
     C  N33              DO
     C                   MOVE      KUNDNR        FAKUNR
     C                   MOVE      *ZEROS        FAFAKT
     C                   MOVE      'C'           FAOPKO
     C                   MOVE      *ZEROS        FAMND
     C                   MOVE      *ZEROS        FAÅR
     C                   MOVE      *ZEROS        FACC
     C                   MOVE      *ZEROS        FADATO
     C                   MOVE      *ZEROS        FADAFF
     C                   MOVE      SAVAL         FACURI
     C                   EXCEPT    OPDFAK
     C                   END
     C                   GOTO      STCON
     C*
     C     SLCON         TAG
     C*
     C* SKRIVE "KOSTNADSOVERSLAG" PÅ OPPDRAGSTIDSPUNKT......
     C     KUNDNR        CHAIN     CUSAPR                             33
     C     *IN33         IFEQ      '0'
     C     CPKO          IFEQ      'O'
     C     CPKO          OREQ      'B'
     C                   MOVE      CPKOAK        ANTKOK            1
     C                   MOVE      'O'           XTYPE             1
     C                   Z-ADD     KUNDNR        UKUNDE            8 0
     C                   MOVE      *ZEROS        NULFFD            6 0
     C     *LIKE         DEFINE    FAFAKT        YYFAKT
     C                   MOVE      *ZEROS        YYFAKT
     C                   CALL      'SYFA27B'
     C                   PARM                    UKUNDE
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
     C                   PARM                    YYFAKT
     C                   PARM                    SAVAL
     C                   PARM                    ANTKOK
     C                   PARM                    CPKOHE
     C     IDAG          PARM      IDAG          IDAG6P            6 0
     C                   PARM                    NULFFD
     C                   PARM                    XTYPE
     C                   END
     C                   END
     C*
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR2
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     BETSR         BEGSR
     C***********************************************
     C*
     C                   MOVE      *BLANKS       KLKNVN
     C     SYLAND        IFNE      FILAND
     C     LKKEY         CHAIN     KODTLKR                            33
     C                   END
     C*
     C*** FINNER BETBET OG FORFALLSDATO
     C     UKOPI         IFEQ      'J'
     C     UKOPI         OREQ      'U'
     C                   MOVE      XFFDT         FFKOPI            6 0
     C                   END
     C                   MOVE      *ZEROS        XFFDT
     C                   MOVE      *BLANKS       BETTXT
     C     WSFDAT        IFNE      *ZEROS
     C                   MOVE      WSFDAT        XFFDT
     C                   MOVE      WSFDAT        KFFDT
     C                   END
     C* OVERSTYRE BETBET
     C     OVBETB        IFNE      *BLANKS
     C                   MOVE      OVBETB        BETBET
     C                   END
     C                   CALL      'SYFA20A'
     C     XFFDT         PARM      XFFDT         UFFDT             6 0
     C                   PARM                    BETTXT
     C                   PARM                    UFIRM
     C                   PARM                    BETBET
     C                   MOVE      XFFDT         KFFDT
     C* VED KONTANT LEGGES DAGENS DATO I FORFALL
     C     KO2KON        IFEQ      'J'
     C                   MOVE      IDAGX         XFFDT
     C                   MOVE      IDAGX         KFFDT             6 0
     C                   END
     C*
     C     UKOPI         IFEQ      'J'
     C     UKOPI         OREQ      'U'
     C                   MOVE      FFKOPI        XFFDT             6 0
     C                   MOVE      FFKOPI        KFFDT
     C                   END
     C                   ENDSR
     C*
     C****************************************************************    D150
     C*       MOD10     -    UTREGNING AV MOD-10 KONTROLLFELT (WBAK)      D150
     C*---------------------------------------------------------------    D150
     C     MOD10         BEGSR                                                                 D150
     C                   MOVE      *ZEROS        UPAR21           21
     C                   MOVE      WKID          UPAR21
     C                   CALL      'SYGE09'
     C                   PARM                    UPAR21
     C                   PARM                    UMOD              1 0
     C                   MOVE      UMOD          XBAK              1 0
     C* HENTER MODULUS TIL BELØP
     C   59              MOVE      *ZEROS        UPAR21           21
     C   59              MOVE      *ZEROS        UPAR19           19
     C   59              MOVE      XTOTKR        UPAR19
     C   59              MOVEL     UPAR19        UPAR21
     C   59              MOVE      XTOTØR        UPAR21
     C   59              CALL      'SYGE09'
     C                   PARM                    UPAR21
     C                   PARM                    UMOD              1 0
     C   59              MOVE      UMOD          KNYMOD            1
      *
      * KID AV LENGDE 8
      *
     C                   MOVEL     WKID          KID20            20
     C                   MOVE      XBAK          KID20
      *
     C                   SETOFF                                       62
     C     UFIRM         CHAIN(N)  FIRKID                             33
     C  N33              SETON                                        62
     C     *IN62         IFEQ      '1'
      *
     C*FINNES FRA FØR ? VED KOPI
      *
     C     UKOPI         IFEQ      'J'
     C     KID20         CHAIN     KIDTRAN                            33
     C   33              SETOFF                                       62
     C  N33              MOVE      TRKI08        KID8              8
     C  N33              MOVE      KID8          KID8B             8
     C* ELSE IKKE KOPI
     C                   ELSE
     C     KID20         CHAIN     KIDTRAN                            33
     C  N33              MOVE      TRKI08        KID8              8
     C  N33              MOVE      KID8          KID8B             8
     C  N33              GOTO      UTKID
     C     UFIRM         CHAIN     FIRKID                             33
     C     *IN33         IFEQ      '0'
     C                   ADD       1             FIKID8
     C                   UPDATE    FIRKIDR
     C                   SUB       1             FIKID8
     C                   MOVE      *ZEROS        UPAR21           21
     C                   MOVE      FIKID8        UPAR21
     C                   CALL      'SYGE09'
     C                   PARM                    UPAR21
     C                   PARM                    UMOD              1 0
     C                   MOVEL     FIKID8        KID8              8
     C                   MOVE      UMOD          KID8
     C                   MOVE      KID8          KID8B             8
     C                   MOVE      KID8          TRKI08
     C                   MOVE      KID20         TRKI20
     C                   WRITE     KIDTRANR
     C                   END
     C                   END
     C                   END
     C*                                                                   D150
     C     UTKID         ENDSR                                                                 D150
     C******************************************                       ***
     C     FIXBGN        BEGSR
     C******************************************
     C                   MOVE      *BLANKS       BANKGK
     C     BANKG         IFNE      *BLANKS
     C                   MOVE      *ZEROS        XB1               3 0
     C     1             DO        15            XB2               3 0
     C     B1(XB2)       IFGE      '0'
     C     B1(XB2)       ANDLE     '9'
     C                   ADD       1             XB1
     C                   SELECT
     C     XB1           WHENEQ    1
     C                   MOVE      B1(XB2)       B2(1)
     C     XB1           WHENEQ    2
     C                   MOVE      B1(XB2)       B2(3)
     C     XB1           WHENEQ    3
     C                   MOVE      B1(XB2)       B2(6)
     C     XB1           WHENEQ    4
     C                   MOVE      B1(XB2)       B2(8)
     C     XB1           WHENEQ    5
     C                   MOVE      B1(XB2)       B2(10)
     C     XB1           WHENEQ    6
     C                   MOVE      B1(XB2)       B2(13)
     C     XB1           WHENEQ    7
     C                   MOVE      B1(XB2)       B2(15)
     C     XB1           WHENEQ    8
     C                   MOVE      B1(XB2)       B2(17)
     C     XB1           WHENEQ    9
     C                   MOVE      B1(XB2)       B2(20)
     C     XB1           WHENEQ    10
     C                   MOVE      B1(XB2)       B2(22)
     C     XB1           WHENEQ    11
     C                   MOVE      B1(XB2)       B2(24)
     C                   ENDSL
     C                   ENDIF
     C                   ENDDO
     C                   ENDIF
      *
      * Har kunden ORG.nr registrert (må ikke være persnr)
     C                   move      *off          *in75
     C     SYFOR1        Ifne      '000000000'
     C     SYFOR1        andne     '         '
     C     SYFOR2        andeq     *blanks
     C                   move      *on           *in75
     C                   END                                                                   D150
      *
     C                   ENDSR                                                                 D150
      *
     C********************************************************************
     C     AVDSR         BEGSR
     C******************************************
     C     KODTAK        CHAIN     KOAR                               33
     C                   MOVE      KOAKNR        YKN
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              DO
     C                   MOVE      KNAVN         XFNAVN           30
     C                   MOVE      ADR1          XFADR1           30
     C                   MOVE      ADR2          XFADR2           30
     C                   MOVE      POSTNR        XFPONR            4 0
     C                   MOVE      ADR3          XFADR3           24
     C                   MOVE      BANKG         XFBANK           15
     C                   MOVE      SYLAND        FILAND            2
     C                   END
     C*
     C*
     C   44
     COR 46              DO
     C*** 44 PÅ SKRIVER UT BUNN     46 PÅ SKRIVER UT TOPP
     C                   MOVE      ' '           YNET
     C     UHOD          IFNE      'F'
     C     HODEK         CHAIN     HODE                               33
     C                   ELSE
     C     HODEK         CHAIN     HODE                               33
     C     HODEK         CHAIN     HODEFAX                            33
     C                   END
     C  N33              MOVE      HP            HO
     C  N33              MOVE      HOSTFR        XHOSTN            2
     C                   MOVEL     'E'           YNET
     C     UHOD          IFNE      'F'
     C     HODEK         CHAIN     HODE                               33
     C                   ELSE
     C     HODEK         CHAIN     HODE                               33
     C     HODEK         CHAIN     HODEFAX                            33
     C                   END
     C  N33              MOVE      HP            HE
     C  N33              MOVE      HOSTFR        XHOSTE            2
     C                   MOVEL     'T'           YNET
     C     UHOD          IFNE      'F'
     C     HODEK         CHAIN     HODE                               33
     C                   ELSE
     C     HODEK         CHAIN     HODE                               33
     C     HODEK         CHAIN     HODEFAX                            33
     C                   END
     C  N33              MOVE      HP            HT
     C  N33              MOVE      HOSTFR        XHOSTT            2
     C*
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOMSKD        BEGSR
     C***********************************************
     C     KODWKY        CHAIN     KODWL01                            84
     C     *IN84         IFEQ      *OFF
     C     MVAAVI        ANDNE     *ZERO
     C                   MOVE      *ON           *IN34
     C                   ENDIF
     C                   ENDSR
     C*
     C***********************************************
     C     MVA           BEGSR
     C***********************************************
     C* finn momskode her
     C     FAKDM         IFNE      ' '
     C     FAKDM         ANDNE     'N'
     C                   MOVE      FITAX         FITAXB
     C                   MOVE      FITAX         PRITAX
     C     FITAXD        IFNE      *ZEROS
     C     FITAX2        ANDNE     *ZEROS
     C     IDAG8         ANDLT     FITAXD
     C                   MOVE      FITAX2        FITAXB
     C                   MOVE      FITAX2        PRITAX
     C                   END
     C     KODWKY        CHAIN     KODWL01                            84
     C     *IN84         IFEQ      *OFF
     C     MVAAVI        DIV       100           FITAXB
     C                   MOVE      FITAXB        PRITAX
     C                   ENDIF
     C                   Z-ADD     1             XX
     C     FABELN        MULT(H)   FITAXB        WSMVN             8 2
     C     FABELV        MULT(H)   FITAXB        WSMVV             8 2
     C                   Z-ADD     1             XX                2 0
     C     TMVA          TAG
     C     WSMVAK(XX)    IFEQ      ' '
     C     WSMVAK(XX)    OREQ      FAKDM
     C                   MOVEL     FAKDM         WSMVAK(XX)
     C     FITAXB        MULT      100           WSMVAP(XX)
     C                   MOVE      FAVAL         WSVAL(XX)
     C                   ADD       FABELN        WSGRLN(XX)
     C                   ADD       FABELV        WSGRLV(XX)
     C                   ADD       WSMVN         WSMVAN(XX)
     C                   ADD       WSMVV         WSMVAV(XX)
     C                   ELSE
     C                   ADD       1             XX
     C                   GOTO      TMVA
     C                   ENDIF
     C     FAKDM         IFEQ      'J'
     C                   MOVEL     '*'           XMVAK
     C                   ElSE
     C                   MOVEL     FAKDM         XMVAK
     C                   ENDIF
     C*
     C                   ADD       WSMVAN(1)     WSMVTN
     C                   ADD       WSMVAV(1)     WSMVTV
     C                   ENDIF
     C*
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C*
     C     HESDFK        KLIST
     C                   KFLD                    FILAND
     C                   KFLD                    HESDFF
     C     HESDTK        KLIST
     C                   KFLD                    HELKA
     C                   KFLD                    HESDVT
     C     SAMLK         KLIST
     C                   KFLD                    SAKN
     C                   KFLD                    SAVAL
     C                   KFLD                    SAAVD
     C                   KFLD                    SAOPD
     C     FREETK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    XXSKKO            1
     C                   KFLD                    XXFA00            7 0
     C     LKKEY         KLIST
     C                   KFLD                    YLKUNI
     C                   KFLD                    SYLAND
     C     FAKTK         KLIST
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C                   KFLD                    FALI
     C     FAK2K         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    YSK
     C     FAK2KC        KLIST
     C                   KFLD                    GLSTAT
     C                   KFLD                    FIFN
     C     FAKTXTK       KLIST
     C                   KFLD                    SOAVD
     C                   KFLD                    SOOPD
     C                   KFLD                    SOLI
     C     SORTK         KLIST
     C                   KFLD                    YSOLNR
     C                   KFLD                    YSAMM
     C                   KFLD                    YSOAVD
     C                   KFLD                    YSOOPD
     C                   KFLD                    YSOSK
     C     DUMBOK        KLIST
     C                   KFLD                    YSKKN
     C                   KFLD                    YSKPOS
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    YOPD
     C     HEADOK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     BILLK         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     BLV1K         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     BLV2K         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     FERDHK        KLIST
     C                   KFLD                    FEAVD
     C                   KFLD                    FEOPD
     C     HEAD1K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    YST
     C     KODGEK        KLIST
     C                   KFLD                    YGEUNI
     C                   KFLD                    YVK
     C     KODG2K        KLIST
     C                   KFLD                    YG2UNI
     C                   KFLD                    YVK
     C     KODOTK        KLIST
     C                   KFLD                    YOTUNI
     C                   KFLD                    HEOT
     C     KODO2K        KLIST
     C                   KFLD                    YO2UNI
     C                   KFLD                    HEOT
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    HEFR
     C     KODTAK        KLIST
     C                   KFLD                    YAUNI
     C                   KFLD                    UAVD
     C     KODTÅK        KLIST
     C                   KFLD                    YÅUNI
     C                   KFLD                    YDTPC             2 0
     C                   KFLD                    YDTPÅ             2 0
     C                   KFLD                    YDTPM             2 0
     C     HODEK         KLIST
     C                   KFLD                    YNET
     C                   KFLD                    UAVD
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    YKN
     C     CUSAAK        KLIST
     C                   KFLD                    YKN
     C                   KFLD                    HEAVD
     C     FAINK         KLIST
     C                   KFLD                    FIFN
     C     KODTVK        KLIST
     C                   KFLD                    KOVUNI
     C                   KFLD                    UAVD
     C     KODTWK        KLIST
     C                   KFLD                    KOWUNI
     C                   KFLD                    UAVD
     C     TUKEY         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    HEPRO
     C     TUKEY2        KLIST
     C                   KFLD                    DITUAV
     C                   KFLD                    DITUR
     C     DOKUKI        KLIST
     C                   KFLD                    WWRI
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C                   KFLD                    SOFBNR
     C     KODTPK        KLIST
     C                   KFLD                    KOPUNI
     C                   KFLD                    UAVD
     C                   KFLD                    KOPLNR
     C                   MOVE      'P'           KOPUNI
     C     KODWKY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WMVAKD
     C                   KFLD                    FAKDM
     C                   MOVE      *BLANKS       WMVAKD            2
     C     KONTKY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKONT            5 0
     C     EPOKEY        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    mail30
     C                   KFLD                    YKN
     C     CUNDC03K      KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    XCTYPE           30
     C                   KFLD                    YKN
     C                   EVAL      XCTYPE = '*XML FAKTURA SIN'
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UPRANT            2
     C                   PARM                    UFFAK             1
     C                   PARM                    UIN05             1
     C                   PARM                    UIN06             1
     C                   PARM                    UIN07             1
     C                   PARM                    UIN08             1
     C                   PARM                    UKOPI             1
     C                   PARM                    UEMAIL            1
     C                   PARM                    UIBRUK            1
     C     *LIKE         DEFINE    FABELN        WSMVTN
     C     *LIKE         DEFINE    FABELV        WSMVTV
      * VED FAX/EMAIL SETON 65
     C     UHOD          IFEQ      'F'
     C                   SETON                                        65
     C                   END
     C                   MOVE      UKOPI         XKOPI             1
     C                   MOVE      ' '           BLANK1            1
     C                   Z-ADD     16            LINDOK            2 0
     C*
     C     UKOPI         COMP      'J'                                    54
     C                   MOVE      'O'           GLSTAT            1
     C                   MOVE      UAVD          FIAVD
     C                   MOVE      ' '           YSK               1
     C                   MOVE      *ZEROS        YOPD              7 0
     C                   MOVE      ' '           YST               1
     C     UIN06         IFEQ      '1'
     C                   MOVE      'H'           YST               1
     C                   END
     C                   MOVE      '<'           HAKE              1
     C                   Z-SUB     2             YSOLNR            3 0
     C                   MOVE      ' '           YSAMM             1
     C                   MOVE      *ZEROS        YSOAVD            4 0
     C                   MOVE      *ZEROS        YSOOPD            7 0
     C                   MOVE      ' '           YSOSK             1
     C                   MOVE      *ZEROS        YSKKN             8 0
     C                   MOVE      *BLANKS       YSKPOS            7
     C                   MOVE      'GE'          YGEUNI            2
     C                   MOVE      *BLANKS       YVK               3
     C                   MOVE      'G2'          YG2UNI            2
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      'O2Y'         YO2UNI            3
     C                   MOVE      'FR'          YFRUNI            2
     C                   MOVEL     'LK'          YLKUNI            3
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      'Å'           YÅUNI             1
     C                   MOVE      *ZEROS        YKN               8 0
     C                   MOVE      *BLANKS       YNET              1
     C                   MOVE      *ZEROS        XPRANT            2 0
     C                   MOVE      *ZEROS        KUNDNR
     C                   MOVE      *ZEROS        TEFFNR
     C                   MOVE      *ZEROS        XNULL
     C                   MOVE      *ZEROS        SOLNR
     C                   MOVE      *ZEROS        WF
     C                   MOVEL     'I N V O '    XF2NV2           16
     C                   MOVE      'I C E   '    XF2NV2
     C                   MOVE      UDAY          IDAGD
     C                   MOVE      UMONTH        IDAGM
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          IDAGÅ
     C                   ELSE
     C     UYEAR         ADD       2000          IDAGÅ
     C                   END
     C                   MOVE      UDAY          IDAGXD
     C                   MOVE      UMONTH        IDAGXM
     C                   MOVE      UYEAR         IDAGXÅ
     C                   MOVE      *ZEROS        WSMMÅÅ
     C                   MOVE      *ZEROS        XDT
     C     UDT           IFNE      0
     C                   MOVE      UDT           UDT8              8 0
     C     UDT           IFGT      501231
     C                   MOVEL     '19'          UDT8
     C                   ELSE
     C                   MOVEL     '20'          UDT8
     C                   END
     C                   END
     C                   MOVEL     '2BD10601'    XW77             16
     C                   MOVE      '00000154'    XW77
     C                   MOVEL     '2BD10601'    XW66             16
     C                   MOVE      '00000277'    XW66
     C                   MOVE      'O'           WSK
     C                   MOVE      *ZEROS        XFFDT
     C                   MOVE      *ZEROS        WSFDAT
      *
     C                   MOVE      *ZEROS        SOAVD
     C                   MOVE      *ZEROS        SOOPD
     C                   MOVE      *BLANKS       SOSK
     C                   MOVE      *BLANKS       SOVK
     C                   MOVE      *BLANKS       SOVT
     C                   MOVE      *BLANKS       SOVAL
     C                   MOVE      *ZEROS        SOBELV
     C                   MOVE      *ZEROS        SOBELN
     C                   MOVE      *BLANKS       SOKDM
     C                   MOVE      *BLANKS       SOSAMM
      *
     C*
     C* TESTS IF GIRO SHALL BE WRITTEN INDICATOR 35
     C* ALSO WHEN SPLIT IS DEFINED
     C*
     C                   MOVE      'W'           KOWUNI
     C     KODTWK        CHAIN     KOWR                               33
     C     KOWKOM        COMP      'J'                                    59
     C     UBBS          COMP      'N'                                    35
     C  N35UAWB          COMP      'J'                                    35
     C  N35UAWB          COMP      'K'                                    35
     C   36              Z-ADD     30            LINDOK
     C*
     C     UIN07         COMP      '1'                                    57
     C*
     C     UIN05         IFEQ      '1'
     C     UIN06         OREQ      '1'
     C                   SETON                                        56
     C                   END
     C*
     C     UHOD          IFEQ      'J'
     C                   SETON                                        4446
     C                   ELSE
     C     UHOD          IFEQ      'T'
     C                   SETOFF                                       44
     C                   SETON                                        46
     C                   ELSE
     C     UHOD          IFEQ      'B'
     C                   SETON                                        44
     C                   SETOFF                                       46
     C                   END
     C                   END
     C                   END
     C*
     C*
     C     UHOD          IFEQ      'F'
     C     KOWHOD        IFEQ      'J'
     C                   SETON                                        4446
     C                   ELSE
     C     KOWHOD        IFEQ      'T'
     C                   SETOFF                                       44
     C                   SETON                                        46
     C                   ELSE
     C     KOWHOD        IFEQ      'B'
     C                   SETON                                        44
     C                   SETOFF                                       46
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C   44
     COR 46              DO
     C*** 44 PÅ SKRIVER UT BUNN     46 PÅ SKRIVER UT TOPP
     C     HODEK         CHAIN     HODE                               33
     C  N33              MOVE      HP            HO
     C                   MOVEL     'E'           YNET
     C     HODEK         CHAIN     HODE                               33
     C  N33              MOVE      HP            HE
     C                   MOVEL     'T'           YNET
     C     HODEK         CHAIN     HODE                               33
     C  N33              MOVE      HP            HT
     C*
     C                   END
     C*
     C                   MOVE      'V'           KOVUNI
     C     KODTVK        CHAIN     KOVR                               33
     C*
     C     UFIRM         CHAIN     FIRM                               33
     C*
     C* GETS HEADINGTEXTS FROM MESSAGEMEMBERS FOR BOREDRAU
     C* GENERAL
     C*
     C                   MOVE      'PRI0020'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     16            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          XF2NV            16
     C*
     C     UIN05         IFEQ      '1'
     C                   EXSR      GETMSG
     C* BORDEREAU
     C                   EXSR      GETMSB
     C                   END
     C                   MOVE      'F'           WWRI              1
     C                   Z-ADD     0             WWVKT
     C                   MOVE      *BLANKS       SYLAND            2
     C                   MOVE      *BLANKS       HELKS             2
     C                   MOVE      *BLANKS       HELKK             2
     C                   MOVE      *BLANKS       SYPOGE            9
     C                   MOVE      'N'           INTEDI            1
      *
      * fikser nøkke cundc03
      *
     C     FIFIRM        CHAIN     FIRMARC                            33
     C     *IN33         IFEQ      '0'
     C     'fa'          chain     arktxt                             33
     C     *IN33         IFEQ      '0'
     C     arkjn         andeq     'J'
     C     ARKSND        IFEQ      'J'
     C                   MOVE      ARTXT         MAIL16           16
     C                   MOVEL     '*'           MAIL16
     c                   movel     MAIL16        mail30           30
     c                   end
     c                   end
      * retur når kalles med email og ikke arkiv innstallert
     C                   else
     C     uemail        ifeq      'J'
     C                   SETON                                        LR
     C                   return
     C                   end
     c                   end
      *
     C                   ENDSR
     C*
     C***********************************************
     C     GETMSI        BEGSR
     C***********************************************
     C                   ENDSR
     C***********************************************
     C     GETMSB        BEGSR
     C***********************************************
     C* GETS MSGMEMBERS FOR PRINT OF BORDEREAU
     C*
     C                   MOVE      'DIV1687'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     80            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1687           80
     C*
     C                   MOVE      'DIV1688'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     6             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1688            6
     C*
     C                   MOVE      'DIV1689'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     6             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1689            6
     C                   ENDSR
     C*
     C***********************************************
     C     GETMSG        BEGSR
     C***********************************************
     C* GETS MSGMEMBERS GENERAL ROUTINE
     C*
     C*
     C                   MOVE      'DIV1679'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     80            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1679           80
     C*
     C                   MOVE      'DIV1680'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     30            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1680           30
     C*
     C                   MOVE      'DIV1681'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     12            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1681           12
     C*
     C                   MOVE      'DIV1682'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     16            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1682           16
     C*
     C                   MOVE      'DIV1683'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     20            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1683           20
     C*
     C                   MOVE      'DIV1684'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     24            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1684           24
     C*
     C                   MOVE      'DIV1685'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     12            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1685           12
     C*
     C                   MOVE      'DIV1651'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     13            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1651           13
     C*
     C                   MOVE      'DIV1652'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     13            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1652           13
     C*
     C                   MOVE      'DIV1661'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     13            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1661           13
     C*
     C                   MOVE      'DIV1665'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     15            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1665           15
     C*
     C                   MOVE      'DIV1667'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     15            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1667           15
     C*
     C                   MOVE      'DIV1670'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     15            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1670           15
     C*
     C                   MOVE      'DIV1663'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     13            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          TX1663           13
     C*
     C                   MOVE      'PRI0020'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     16            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      GETTXT
     C                   MOVEL     XMSG          XF2NV            16
     C*
     C                   ENDSR
     C***********************************************
     C     GETTXT        BEGSR
     C***********************************************
     C                   Z-ADD     3             XLEVEL            1 0
     C                   Z-ADD     0             XRETUR            1 0
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG            120
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM1        BEGSR
     C***********************************************
     C                   MOVE      IDAGXD        UDT1              2 0
     C                   MOVE      IDAGXM        UDT2              2 0
     C                   MOVE      IDAGXÅ        UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          IDAGXD
     C                   MOVE      UDT2          IDAGXM
     C                   MOVE      UDT3          IDAGXÅ
     C*
     C                   MOVE      XFFDTD        UDT1
     C                   MOVE      XFFDTM        UDT2
     C                   MOVE      XFFDTÅ        UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          XFFDTD
     C                   MOVE      UDT2          XFFDTM
     C                   MOVE      UDT3          XFFDTÅ
     C*
     C                   MOVE      HEDTD         UDT1
     C                   MOVE      HEDTM         UDT2
     C                   MOVE      HEDTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          XDTD
     C                   MOVE      UDT2          XDTM
     C                   MOVE      UDT3          XDTÅ
     C*
     C                   MOVE      XFFDT         KFFDT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     XDTFMT        BEGSR
     C***********************************************
     C                   MOVE      WSFDAD        UDT1              2 0
     C                   MOVE      WSFDAM        UDT2              2 0
     C                   MOVE      WSFDAA        UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSFDAD
     C                   MOVE      UDT2          WSFDAM
     C                   MOVE      UDT3          WSFDAA
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FRILIN        BEGSR
     C***********************************************
      * FRIE SØKEVEIER (KUN DE SOM HAR DOK.KODE LIK K/S/X  EL B)
     C                   MOVE      *BLANKS       FSFORI
     C     *LIKE         DEFINE    FSKODE        FSFORI
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 91
     C     *IN91         DOWEQ     '0'                                          1<-B
     C                   SORTA     DFS
     C     DFS(10)       IFNE      ' '                                           2<-B
     C     XXSKKO        LOOKUP    DFS                                    91
     C  N91'B'           LOOKUP    DFS                                    91
     C     *IN91         IFEQ      '1'                                            3<-B
     C     FSKODE        CHAIN     KODFRI                             91
     C     *IN91         IFEQ      '0'                                             4<-B
     C     FSKODE        IFEQ      FSFORI
     C                   MOVE      *BLANKS       KFSOTX
     C                   END
     C                   MOVE      FSKODE        FSFORI
     C                   ADD       1             XANTL
     C     XVALS2        IFEQ      'J'                                              5<-B
     C                   EXSR      UTHDPD
     C                   WRITE     SKJØPFS
     C                   ELSE                                                       5
     C                   EXSR      UTHDP
     C     UIN05         IFEQ      '1'                                               6<-B
     C                   EXCEPT    FSBORD
     C                   ELSE                                                        6
     C                   WRITE     KJØPFS
     C                   END                                                         6<-E
     C                   END                                                        5<-E
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*
     C     HEADFK        READE     FRISOK                                 91
     C                   END                                                    1<-E
      *
      * SKRIV  UTLEV.FORBEHOLD
     C     HEKFT1        IFEQ      *BLANKS                                      1<-B
     C     HEFT1A        ANDNE     *BLANKS
     C                   ADD       1             XANTL
     C     XVALS2        IFEQ      'J'                                           2<-B
     C                   EXSR      UTHDPD
     C                   WRITE     UFB20PD
     C                   ELSE                                                    2
     C                   EXSR      UTHDP
     C     UIN05         IFEQ      '1'                                            3<-B
     C                   EXCEPT    UFBBOR
     C                   ELSE                                                     3
     C                   WRITE     UFB20P
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C* FRIE LINJER OPPDRAG
     C*
     C* FORBERED PARAMETRE FOR HENTING AV STANDARDFRITEKST
     C                   MOVE      *BLANKS       XXSTKO            2
     C* Standardtekst for kunde = 1. prioritet
     C     SYFR03        IFNE      *BLANKS
     C                   MOVE      SYFR03        XXSTKO
     C                   END
     C* Standardtekst for avdeling = 2. prioritet
     C*          - ULIKE FELT ALT ETTER SPRAAKKODE
     C     XXSTKO        IFEQ      *BLANKS
     C                   MOVE      HOSTFR        XXSTKO
     C     SPRAAK        IFEQ      'E'
     C                   MOVE      XHOSTE        XXSTKO
     C                   ELSE
     C     SPRAAK        IFEQ      'T'
     C                   MOVE      XHOSTT        XXSTKO
     C                   ELSE
     C                   MOVE      XHOSTN        XXSTKO
     C                   END
     C                   END
     C                   END
     C* Standardtekst for firma = 3. prioritet
     C*          - ULIKE FELT ALT ETTER SPRAAKKODE
     C     XXSTKO        IFEQ      *BLANKS
     C     SPRAAK        IFEQ      'E'
     C                   MOVE      FISTFE        XXSTKO
     C                   ELSE
     C     SPRAAK        IFEQ      'T'
     C                   MOVE      FISTFE        XXSTKO
     C                   ELSE
     C                   MOVE      FISTFN        XXSTKO
     C                   END
     C                   END
     C                   END
     C*
     C     FRIST0        TAG
     C*
     C     UKOPI         IFEQ      'J'
     C                   MOVE      XFN           XXFA00
     C                   ELSE
     C                   MOVE      *ZEROS        XXFA00
     C                   END
     C     FREETK        SETLL     FREETXT2
     C     FRIST         TAG
     C     FREETK        READE     FREETXT2                               91
     C* Om ingen linjer fantes og defaultkode finnes, bruk den
     C   91UKOPI         IFNE      'J'
     C     XXSTKO        ANDNE     *BLANKS
     C     XXFAKT        ANDNE     XFN
     C                   CALL      'SYFA21'
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
     C                   PARM                    XXSTKO
     C                   PARM                    XXSKKO
     C* Tekst skal nå ligge på vanlig måte - prøv på ny
     C                   MOVE      *BLANKS       XXSTKO
     C                   GOTO      FRIST0
     C                   END
     C*
     C  N91UKOPI         IFNE      'J'
     C                   Z-ADD     XFN           XXFAKT            7 0
     C                   MOVE      XFN           FRTFAK
     C                   END
     C  N91              UPDATE    FREETXTR
     C  N91              ADD       1             XANTL
     C  N91XVALS2        IFEQ      'J'
     C                   EXSR      UTHDPD
     C                   WRITE     SFRIEL
     C                   ELSE
     C                   EXSR      UTHDP
     C     UIN05         IFEQ      '1'
     C                   EXCEPT    FRIELB
     C                   ELSE
     C                   WRITE     FRIEL
     C                   END
     C                   END
     C  N91              GOTO      FRIST
      *
     C                   ENDSR
     C*
     C***********************************************
     C     UTHDPD        BEGSR
     C***********************************************
     C     XANTL         IFGE      29                                           1<-B
     C                   MOVE      '1'           *IN88
     C                   WRITE     SKJØP1
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C                   WRITE     SKJØPD
     C                   WRITE     SHEAD2
     C                   EXSR      KDTFM1
     C                   MOVE      *ZEROS        XANTL
     C                   ADD       1             XSIDE
     C                   MOVE      '0'           *IN88
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
     C***********************************************
     C     UTHDP         BEGSR
     C***********************************************
      * 44 = bunntekst
      * 55 = TRANSPORT DISPONERING
      * 35 = IKKE GIRO
      * 59 = Har kvitteringsdel på giro
      * 60 = 8LPI
      * 61 = LASER
     C     UIN05         IFEQ      '1'                                          1<-B
     C     XANTL         COMP      25                                 88  88
     C                   ELSE                                                   1
      *
      * IKKE LASER HAR NORMALT IKKE KVITTERINGSDEL
      *
      *------------------------------------------------------------
      * NY OMSKREVETY VERSJON
      *------------------------------------------------------------
      * 44 = bunntekst
      * 55 = TRANSPORT DISPONERING
      * 35 = IKKE GIRO
      * 59 = Har kvitteringsdel på giro
      * 60 = 8LPI
      * 61 = LASER
      * utgangspunkt er laserfaktura med kvitteringsdel
     C                   z-add     11            testli            2 0
      *
      *  TRANSPORTDISPONERINGS 1 side har seks færre linjer
      *  obs telleverk er 1 foran
      *
     C   55xside         iflt      3
     C                   sub       6             testli
     C                   end
      *
      *  MOMS på OPPDRAGET TREKKER 1 LINJE
      *
     C     xmvagr        ifgt      0
     C                   sub       1             testli
     C                   end
      *
      *  UTEN KVITTERINGSDEL tillegg på 5 linjer
      *
     C  N59              add       5             testli
      *
      *
      *  IKKE LASER   PLUSSER 2 linjer
      *
     C  N61              add       2             testli
      *
      *
      *  BUNNTEKST TREKK FRA 3  linjer
      *
     C   44              sub       3             testli
      *
      *
      *  IKKE GIRO GIR 24 EKSTRA LINJER
      *
     C   35              add       20            testli
      *
      *
      *  plusser 12 linjer ved 8 lpi
      *
     C   60              add       12            testli
     C     xantl         comp      testli                             88  88
     C                   END                                                    1<-E
     C   88              DO                                                     1<-B
     c*                  dump
     C     UIN05         IFEQ      '1'                                           2<-B
     C                   EXCEPT    HEADB1
     C                   EXCEPT    HEADB
     C                   EXCEPT    HEAB22
     C                   ADD       1             NBRINV
     C                   ELSE                                                    2
     C                   WRITE     KJØP1
     C                   MOVE      ADR3          ADR3B
     C                   MOVE      ADR3          ADR3C
     C                   MOVE      HP(1)         HP1
     C                   MOVE      HP(2)         HP2
     C                   MOVE      HP(3)         HP3
     C                   MOVE      HP(4)         HP4
     C                   MOVE      HP(5)         HP5
     C                   MOVE      HP(6)         HP6
     C                   MOVE      HP(7)         HP7
     C                   EXSR      KDTFM1
     C     KO2KON        IFNE      'D'                                            3<-B
     C                   WRITE     KJØP
     C                   ELSE                                                     3
     C                   WRITE     KJØPD
     C                   END                                                      3<-E
     C     KO2KON        IFNE      'D'                                            3<-B
     C                   WRITE     HEAD22
     C                   ELSE                                                     3
     C                   WRITE     HEA222
     C                   END                                                      3<-E
     C                   EXSR      KDTFM1
     C                   END                                                     2<-E
     C                   MOVE      *ZEROS        XANTL
     C                   MOVE      *OFF          *IN88
     C                   ADD       1             XSIDE
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
     C***********************************************
     C     BHENTT        BEGSR
     C***********************************************
     C* FRIE LINJER OPPDRAG
     C*
     C*
     C     UKOPI         IFEQ      'J'                                          1<-B
     C                   MOVE      XFN           XXFA00
     C                   ELSE                                                   1
     C                   MOVE      *ZEROS        XXFA00
     C                   END                                                    1<-E
      *
      *** HENTE FREETEKST MED KODE S ELLER K
     C     FREETK        SETLL     FREETXT2                           91
     C                   MOVE      *BLANKS       XS
     C                   Z-ADD     0             N2                2 0
      * FRIE SØKEVEIER (KUN DE SOM HAR DOK.KODE LIK K/S/X  EL B)
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'                                          1<-B
     C     N2            ANDLT     90
     C                   SORTA     DFS
     C     DFS(10)       IFNE      ' '                                           2<-B
     C     XXSKKO        LOOKUP    DFS                                    33
     C  N33'B'           LOOKUP    DFS                                    33
     C     *IN33         IFEQ      '1'                                            3<-B
     C     FSKODE        CHAIN     KODFRI                             33
     C     *IN33         IFEQ      '0'                                             4<-B
     C                   ADD       1             N2
     C                   MOVEL     KFSOTX        XALF21           21
     C                   MOVE      ':'           XALF21
     C                   MOVEL     XALF21        XS(N2)
     C                   MOVE      FSSOKX        XS(N2)
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     HEADFK        READE     FRISOK                                 33
     C                   END                                                    1<-E
      *
      * UTLEVERINGSFORBEHOLD
     C     HEKFT1        IFEQ      *BLANKS
     C     HEFT1A        ANDNE     *BLANKS
     C     N2            ANDLT     90
     C                   ADD       1             N2
     C                   MOVEL     'U.FB.:'      XS(N2)
     C                   MOVE      HEFT1A        XS(N2)
     C     HEFT1B        IFNE      *BLANKS
     C     N2            ANDLT     90
     C                   ADD       1             N2
     C                   MOVE      HEFT1B        XFT1B            22
     C                   MOVEL     XFT1B         XS(N2)
     C                   END
     C                   END
      *
     C     STBH          TAG
     C     FREETK        READE     FREETXT2                               91
     C  N91              DO                                                     1<-B
     C     UKOPI         IFNE      'J'                                           2<-B
     C                   MOVE      XFN           FRTFAK
     C                   END                                                     2<-E
     C                   UPDATE    FREETXTR
     C     N2            IFLT      90                                            2<-B
     C                   ADD       1             N2
     C                   MOVEL     FRTTXT        XS(N2)
     C                   END                                                     2<-E
     C                   GOTO      STBH
     C                   END                                                    1<-B
      *
      *** HENTE FREETEKST MED KODE B
     C                   MOVE      XXSKKO        XXSKK2            1
     C                   MOVE      'B'           XXSKKO
     C     FREETK        SETLL     FREETXT2                           91
     C     STBH2         TAG
     C     FREETK        READE     FREETXT2                               91
     C  N91              DO                                                     1<-B
     C     UKOPI         IFNE      'J'                                           2<-B
     C                   MOVE      XFN           FRTFAK
     C                   END                                                     2<-E
     C                   UPDATE    FREETXTR
     C     N2            IFLT      90                                            2<-B
     C                   ADD       1             N2
     C                   MOVEL     FRTTXT        XS(N2)
     C                   END                                                     2<-E
     C                   GOTO      STBH2
     C                   END                                                    1<-E
     C                   MOVE      XXSKK2        XXSKKO
     C*
     C                   ENDSR
     C*
     C******************************************
     C     BLTXT         BEGSR
     C******************************************
     C                   Z-ADD     0             N2
      *
     C     BLV1K         SETLL     BLV1LF                             33
     C     STBLT1        TAG
     C     BLV1K         READE     BLV1LF                                 33
     C  N33              DO
     C                   WRITE     BDETBL1
     C                   ADD       1             N2
     C     N2            COMP      11                                 33  33
     C  N33              GOTO      STBLT1
     C                   END
     C*
     C                   ADD       1             N2
     C     N2            IFGT      10
     C                   GOTO      SLBLT
     C                   END
     C*
     C     BLV2K         SETLL     BLV2LF
     C                   MOVE      *BLANKS       MN1
     C                   SETOFF                                       33
     C     11            SUB       N2            N2
     C                   Z-ADD     0             N3                2 0
     C     STBLT2        TAG
     C     BLV2K         READE     BLV2LF                                 33
     C  N33BVMN          IFNE      *BLANKS
     C                   ADD       1             N3
     C                   MOVE      BVMN          MN1(N3)
     C     N3            COMP      N2                                 33  33
     C                   END
     C  N33              GOTO      STBLT2
     C*
     C     BLV2K         SETLL     BLV2LF
     C                   Z-ADD     0             GVLN              3 0
     C                   Z-ADD     0             GVTY              1 0
     C                   MOVE      *BLANKS       MN2
     C                   SETOFF                                       33
     C                   Z-ADD     0             N3
     C     STBLT3        TAG
     C     BLV2K         READE     BLV2LF                                 33
     C  N33BVKD          IFEQ      'X'
     C     BLSKT         ANDEQ     'K'
     C                   MOVE      'K'           BVKD
     C                   END
     C  N33BVKD          IFEQ      'Z'
     C     BLSKT         ANDEQ     'S'
     C                   MOVE      'S'           BVKD
     C                   END
     C  N33BVKD          IFEQ      'N'
     C                   MOVE      'T'           BVKD
     C                   END
     C  N33BVKD          IFNE      'T'
     C     BVKD          ANDNE     BLSKT
     C                   GOTO      STBLT3
     C                   END
     C  N33              DO                                                     1<-B
     C     GVLN          COMP      0                                      33
     C   33GVTY          COMP      0                                      33
     C   33              MOVE      BVLI          GVLN
     C   33              MOVE      '1'           GVTY
     C     BVLI          COMP      GVLN                                   33
     C  N33GVTY          DOWLE     4                                             2<-B
     C                   ADD       1             N3
     C     N3            IFGE      N2                                             3<-B
     C                   GOTO      STBLT4
     C                   END                                                      3<-E
     C                   ADD       1             GVTY
     C                   END                                                     2<-E
     C  N33              MOVE      BVLI          GVLN
     C  N33              MOVE      '1'           GVTY
     C     GVTY          DOWLT     BVLI2                                         2<-B
     C                   ADD       1             N3
     C     N3            IFGE      N2                                             3<-B
     C                   GOTO      STBLT4
     C                   END                                                      3<-E
     C                   ADD       1             GVTY
     C                   END                                                     2<-E
     C                   ADD       1             N3
     C                   ADD       1             GVTY
     C                   MOVE      BVFT          MN2(N3)
     C     N3            IFGE      N2                                            2<-B
     C                   GOTO      STBLT4
     C                   END                                                     2<-E
     C                   SETOFF                                       33
     C                   GOTO      STBLT3
     C                   END                                                    1<-E
     C*
     C     STBLT4        TAG
     C                   Z-ADD     1             N3
     C     N2            DOWGE     N3
     C                   MOVE      MN1(N3)       XMN
     C                   MOVE      MN2(N3)       XFT
     C                   WRITE     BDETBL2
     C                   ADD       1             N3
     C                   END
     C*
     C     SLBLT         ENDSR
     C*
     C******************************************
     C     BLTXT3        BEGSR
     C******************************************
     C     BLV2K         SETLL     BLV2LF                             33
     C                   MOVE      *BLANKS       MN3
     C                   Z-ADD     0             N3                2 0
     C     STBL31        TAG
     C     BLV2K         READE     BLV2LF                                 33
     C  N33BVMN          IFNE      *BLANKS
     C                   ADD       1             N3
     C                   MOVE      BVMN          MN3(N3)
     C                   END
     C  N33N3            IFLT      99
     C                   GOTO      STBL31
     C                   END
     C*
     C     BLV2K         SETLL     BLV2LF                             33
     C                   MOVE      *BLANKS       MN4
     C                   Z-ADD     0             N3
     C     STBL32        TAG
     C     BLV2K         READE     BLV2LF                                 33
     C  N33BVFT          IFEQ      *BLANKS
     C                   GOTO      STBL32
     C                   END
     C  N33BVKD          IFEQ      'X'
     C     BLSKT         ANDEQ     'K'
     C                   MOVE      'K'           BVKD
     C                   END
     C  N33BVKD          IFEQ      'Z'
     C     BLSKT         ANDEQ     'S'
     C                   MOVE      'S'           BVKD
     C                   END
     C  N33BVKD          IFEQ      'N'
     C                   MOVE      'T'           BVKD
     C                   END
     C  N33BVKD          IFNE      'T'
     C     BVKD          ANDNE     BLSKT
     C                   GOTO      STBL32
     C                   END
     C  N33              DO                                                     1<-B
     C                   ADD       1             N3
     C                   MOVE      BVFT          MN4(N3)
     C     N3            IFLT      99                                            2<-B
     C                   GOTO      STBL32
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C     1             DO        98            N3
     C     MN3(N3)       IFEQ      *BLANKS
     C     MN4(N3)       ANDEQ     *BLANKS
     C                   GOTO      SLBL3
     C                   END
     C                   MOVE      MN3(N3)       XMN
     C                   MOVE      MN4(N3)       XFT
     C     XANTL         IFGE      LINDOK
     C                   WRITE     TKJØP1
     C                   WRITE     TKJØP
     C                   WRITE     TKJØP2
     C                   ADD       1             XSIDE
     C                   MOVE      *ZEROS        XANTL
     C                   END
     C                   ADD       1             XANTL
     C                   WRITE     TDETBL2
     C                   END
      *
     C     SLBL3         ENDSR
      *
     C***********************************************
     C     TESTEQ        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       FTX
     C                   MOVE      *ZEROS        XN01              3 0
     C                   EXSR      HENTFTXT
     C     STEQ          TAG
     C                   READ      SORT                                   33
     C   33              DO
     C     *LOVAL        SETLL     SORT
     C                   READ      SORT                                   33
     C                   GOTO      UTEQSR
     C                   END
     C*
     C     XOKDM         IFEQ      SOKDM
     C     XOSAMM        IFNE      ' '
     C     XOSAMM        IFEQ      SOSAMM
     C                   ADD       SOBELN        XOBELN
     C                   ADD       SOBELV        XOBELV
     C                   DELETE    SORTR
     C                   EXSR      HENTFTXT
     C                   GOTO      STEQ
     C                   END
     C                   END
     C     XOVK          IFEQ      SOVK
     C     XOVT          IFEQ      SOVT
     C                   ADD       SOBELN        XOBELN
     C                   ADD       SOBELV        XOBELV
     C                   EXSR      HENTFTXT
     C                   DELETE    SORTR
     C                   GOTO      STEQ
     C                   ELSE
     C                   GOTO      UTEQ
     C                   END
     C                   ELSE
     C                   GOTO      UTEQ
     C                   END
     C                   ELSE
     C                   GOTO      UTEQ
     C                   END
     C     UTEQ          TAG
     C                   READP     SORT                                   33
     C     UTEQSR        TAG
     C                   Z-ADD     XOBELN        SOBELN
     C                   Z-ADD     XOBELV        SOBELV
     C                   ENDSR
      ***********************************************
     C     HENTFTXT      BEGSR
      ***********************************************
     C     FAKTXTK       SETLL     FAKTXT
     C     FAKTXTK       READE     FAKTXT                                 90
     C                   DOW       *IN90 = *OFF
     C                   IF        FXVT <> *BLANKS
     C                   ADD       1             XN01
     C                   MOVE      FXVT          FTX(XN01)
     C                   END
     C     FAKTXTK       READE     FAKTXT                                 90
     C                   ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     HFAKTN        BEGSR
     C***********************************************
     C* 41 ON = IKKE (INTERN-)EDI-FAKTURA, 40 OFF = SEND EDI
     C                   SETON                                        41
     C                   MOVE      'N'           XNYFAKT           1
     C*
     C* SUBRUTINE SOM HENTER FAKTURANUMMER
     C*
     C     UFIRM         CHAIN     tellfa                             33
     C*
     C* GETS INVOICENUMBER IF NOT COPIROTINE
     C*
     C  N33UKOPI         IFNE      'J'
     C     UKOPI         ANDNE     'U'
     C     KUNDNR        CHAIN     CUIFAK                             41
     C                   MOVE      FIFNR         XFN
     C                   ADD       1             FIFNR
     C                   UPDATE    tellfar
     C                   MOVE      'J'           XNYFAKT
     C                   MOVE      XFN           FIFN
     C                   MOVE      XFN           TEFFNR
     C                   MOVE      HEAVD         FIAVD
     C                   MOVE      HEOPD         FIOPD
     C                   WRITE     FAINR
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     c                   else
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   END
     C     FIFIRM        CHAIN     FIRMARC                            33
     C     *IN33         IFEQ      '0'
     C     'fa'          chain     arktxt                             33
     C     *IN33         IFEQ      '0'
     C     arkjn         andeq     'J'
      *
     C                   MOVE      FIFIRM        ARFIRM
     C                   MOVE      HEAVD         ARAVD
     C                   MOVE      HEOPD         AROPD
     C                   MOVEL     FIFN          ARUNDE
     C                   MOVE      'fa'          ARTYPE
     C                   MOVE      ZUSER         ARUSER
     C                   MOVE      ULDT          ARDATE
     C                   MOVE      XULTM         ARTIME
     C                   MOVE      KUNDNR        ARKUND
     C                   WRITE     ARKIVR
     C                   END
     C                   END
     C                   ELSE
     C                   EXCEPT    DUMFIR
     C                   END
     C                   ENDSR
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      'INV'         TTACTI
     c     UEMAIL        IFEQ      'J'
     C                   MOVE      'INM'         TTACTI
     C                   END
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      ZUSER         TTUSER
     C                   MOVE      *blanks       TTTEXT
     C                   MOVEL     'Invoiced'    TTINT1
     C                   MOVE      ':'           TTINT1
     C  N48              MOVE      KNAVN         TTINVN
     C   48              MOVE      XDINV         TTINVN
     C                   MOVE      'INVNBR:'     TTINT2
     C                   MOVE      FIFN          TTINVR
     C                   WRITE     TRACKFR
     C                   ENDSR
     C*
     C***********************************************
     C     TTSR2         BEGSR
     C***********************************************
     C     TTKEY         klist
     C                   kfld                    ttavd
     C                   kfld                    ttopd
     C                   kfld                    ttfbnr
     C                   kfld                    ttacti
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   MOVE      'INF'         TTACTI
     c     ttkey         setll     trackl02
     C     *in(33)       doweq     '0'
     c     ttkey         reade     trackl02                               33
     C     *in(33)       ifeq      '0'
     C                   movel     tttext        ttku              8 0
     c     kundnr        ifeq      ttku
     c                   goto      utttsr2
     c                   end
     c                   end
     c                   end
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      ZUSER         TTUSER
     C                   MOVE      *blanks       TTTEXT
     C                   MOVEL     kundnr        TTINT1
     C                   MOVE      ':'           TTINT1
     C  N48              MOVE      KNAVN         TTINVN
     C   48              MOVE      XDINV         TTINVN
     C                   MOVEl     'Readymarked' TTread
     C                   WRITE     TRACKFR
     C     utttsr2       ENDSR
     C*
     C*******************************************************
     C     STRING        BEGSR
     C*******************************************************
      *
      *STATNDARDLAYOUT
      *
     C                   Z-ADD     4             KOPLNR
      *
      *VED BORDEREAU ER PRINTERSTYRING NUMMER 25
      *
     C     UIN05         IFEQ      '1'
     C                   Z-ADD     25            KOPLNR
     C                   END
      *
      *VED KODE S OG DELSYSSTEM = F/G
      *
     C     UAWB          IFEQ      'S'
     C     HEUR          IFEQ      'F'
     C     HEUR          OREQ      'G'
     C                   Z-ADD     73            KOPLNR
     C                   END
     C                   END
     C*
     C     KODTPK        CHAIN     KOPR                               42
     C     KOPLPI        COMP      8                                      60
     C     KOPLAS        COMP      'J'                                    61
     C*          KOPLAS    COMP 'A'                      61
     C  N61KOPLAS        COMP      'A'                                    61
     C  N61KOPLAS        COMP      'P'                                    61
     C     KOPLAS        COMP      'A'                                    63
     C     KOPLAS        COMP      'P'                                    64
     C     UHOD          IFEQ      'F'
     C                   SETOFF                                       606163
     C                   END
     C   60
     CAN 61              Z-ADD     18            LINDOK
     C   60
     CANN61              Z-ADD     23            LINDOK
     C   60
     CAN 61
     CAN 35              Z-ADD     32            LINDOK
     C   60
     CANN61
     CAN 35              Z-ADD     41            LINDOK
     C* IKKE FLERE SIDER VED FAX(EPOST
     C     UHOD          IFEQ      'F'
     C                   MOVE      *BLANKS       KOPFM
     C                   END
      *
      * HENTER OCRSTYRING FØR OG ETTER H-LINJEN
      *
     C     KOPFM         IFNE      *BLANKS
     C     KOPFM         CHAIN     KODTFM                             42
     C  N42KFMOCR        IFNE      *BLANKS
     C     KFMOCR        CHAIN     KODTFM                             42
     C  N42              MOVE      KFMT1         OCRF             75
     C  N42              MOVE      KFMT2         OCRE             75
     C                   END
     C                   END
      *
     C                   ENDSR
     C*******************************************************
     C     NYFVKT        BEGSR
     C*******************************************************
     C*
     C* FINNER FRAKTBEREGNINGSVEKT
     C*
     C     FAAGRN        CHAIN     AVFRHL01                           33
     C     *IN33         IFEQ      '0'
      *
     C     HELM          MULT      AFOMRL        XFBV1             9 0
     C*
     C* TAR EVENTUELLT OMREGNINGSFAKTOR NUMMER 2
     C     HEVKT         IFGT      AFOMR1
     C     AFOMR2        ANDNE     0
     C     AFOMR1        ANDNE     0
     C                   Z-ADD     AFOMR2        AFOMRM
     C                   END
     C     HEM3          MULT      AFOMRM        XFBV2             9 0
     C     HEVKT         IFGE      XFBV1
     C                   Z-ADD     HEVKT         HEFBV             9 0
     C                   ELSE
     C                   Z-ADD     XFBV1         HEFBV
     C                   END
     C     HEFBV         IFLT      XFBV2
     C                   Z-ADD     XFBV2         HEFBV
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*******************************************************
     C     KIDGIR        BEGSR
     C*******************************************************
     C                   MOVE      *BLANKS       kidtxt            4
     C                   MOVE      *BLANKS       LIN20
     C                   MOVE      *BLANKS       GIRO20
     C     XVAL          CHAIN     bagiro                             33
     C     *IN(33)       IFEQ      '1'
     C                   MOVEL     'KONTONR:'    IBATXT            8
     C     KOWBBS        IFNE      ' '
     C                   EXSR      MOD10
     C                   MOVE      'KID:'        kidtxt
     C  N62              MOVEL     KWKID         LIN20
     C  N62              MOVE      KBAK          LIN20
     C   62              MOVEL     KID8          LIN20
     C                   END
     C                   MOVEL     XFBANK        GIRO20
     C                   ELSE
     C                   MOVEL     'BIC:  '      KIDTXT
     C                   MOVEL     'IBAN NO:'    IBATXT
     C                   MOVEL     BASWIF        LIN20
     C                   MOVEL     BAGIRN        GIRO20
     C                   END
     C     sjo           ifeq      'S'
     C  N73              WRITE     SKIDLI
     C   64              write     cvrpa2S
     c                   else
     c     SJO           ifeq      'T'
     C  N73              WRITE     TKIDLI
     C   64              write     cvrpa2T
     c                   else
     C  N73              WRITE     KIDLIN
     C   64              write     cvrpa2
     c                   end
     c                   end
     C                   ENDSR
     C*******************************************************
     C     OPDXML        BEGSR
     C*******************************************************
     C                   MOVE      FIFIRM        XFFIRM
     C                   MOVE      XFN           XFFN
     C                   MOVE      YKN           XFKN
     C                   IF        *IN73
     C                   MOVE      'K'           XFFK
     C                   ELSE
     C                   MOVE      'F'           XFFK
     C                   END
     C                   MOVE      UAVD          XFAVD
     C                   MOVE      'N'           XFSAML
     C                   MOVE      XVAL          XFVAL
     C                   MOVE      BETBET        XFBB
     C                   MOVE      BETTXT        XFBBT
     C                   MOVEL     XFBANK        XFKT
     C                   MOVEL     WKID          XFKID
     C                   MOVE      XBRUTT        XFTOT
     C                   MOVEA     WSMVAP        XMLT1
     C                   MOVEA     WSVAL         XMLT2
     C                   MOVEA     WSGRLN        XMLT3
     C                   MOVEA     WSGRLV        XMLT4
     C                   WRITE     XMLUFFR
      *
     C                   ENDSR
      *
     O*                                                                   D150
     O* B O R D E R E A U   L A Y O U T                                   D150
     O*                                                                   D150
     OFAKTURA   E            HEADB            01
     O                       KFMT1               75
     OFAKTURA   E       46   HEADB            01
     O                       HP(1)               80
     O          E       46   HEADB            01
     O                       HP(1)               80
     O          E       46   HEADB            02
     O                       HP(2)               80
     O          E       46   HEADB            02
     O                       HP(2)               80
     O          E       46   HEADB            03
     O                       HP(3)               80
     O          E       46   HEADB            03
     O                       HP(3)               80
     O          E       46   HEADB            04
     O                       HP(4)               80
     O          E       46   HEADB            04
     O                       HP(4)               80
     O          E       46   HEADB            05
     O                       HP(5)               80
     O          E       46   HEADB            05
     O                       HP(5)               80
     O          E       46   HEADB            06
     O                       HP(6)               80
     O          E       46   HEADB            06
     O                       HP(6)               80
     O          E       46   HEADB            07
     O                       HP(7)               80
     O          E       46   HEADB            07
     O                       HP(7)               80
     O          E            HEADB            10
     O                                           79 '***********************'
     O          E            HEADB            10
     O                                           79 '***********************'
     O          E            HEADB            11
     O              N48      KNAVN               40
     O               48      XDINV               40
     O                                           79 '*                     *'
     O          E            HEADB            11
     O                                           79 '*                     *'
     O          E            HEADB            12
     O              N48      ADR1                40
     O               48      XDIAD1              40
     O                                           79 '*  B O R D E R E A U  *'
     O               51N70                       54 'K O P I -'
     O               51 70                       54 'COPY OF '
     O          E            HEADB            12
     O                                           79 '*  B O R D E R E A U  *'
     O               51N70                       54 'K O P I -'
     O               51 70                       54 'COPY OF '
     O          E            HEADB            13
     O              N48      ADR2                40
     O               48      XDIAD2              40
     O                                           79 '*                     *'
     O          E            HEADB            13
     O                                           79 '*                     *'
     O          E            HEADB            14
     O              N48N37   POSTNR              14
     O              N48N37   ADR3                40
     O              N48N38   SYPOGE              19
     O              N48N38   ADR3                45
     O              N48 37 38ADR3                34
     O               48      XDIAD3              40
     O                                           79 '***********************'
     O               88N70N79                    79 '***  S I D E        ***'
     O               88 70                       79 '***  P A G E        ***'
     O               88    79                    79 '*** S E I T E       ***'
     O               88      XSIDE               72
     O          E            HEADB            14
     O               48      XDIAD3              40
     O                                           79 '***********************'
     O               88N70N79                    79 '***  S I D E        ***'
     O               88 70                       79 '***  P A G E        ***'
     O               88    79                    79 '*** S E I T E       ***'
     O               88      XSIDE               72
     O          E            HEADB            15
     O                       KLKNVN              40
     O          E            HEADB            16
     O              N70N79   TX1667              68
     O               70                          71 'Invoice no....:'
     O               79                          71 'Rechnung nr...:'
     O          E            HEADB            16
     O                                           68 '_______________'
     O          E            HEADB            16
     O                       XFN                 79
     O          E            HEADB            16
     O                       XFN                 79
     O          E            HEADB            19
     O              N70N79   TX1687              80
     O               70                          13 'Tripno/pos  '
     O               79                          13 'Reise nr/pos'
     O               70                          32 'Custom no   '
     O               79                          32 'Kunden nr   '
     O               70                          50 'Our ref     '
     O               79                          50 'Unsere ref  '
     O               70                          68 'Date of invo'
     O               79                          68 'Rechn.datum '
     O          E            HEADB            19
     O                                           25 '________________________'
     O                                           49 '________________________'
     O                                           73 '________________________'
     O                                           80 '_______'
     O          E            HEADB            20
     O                       HEPRO                9
     O                                           10 '/'
     O                       HEPOS1              17
     O                       KUNDNR              28
     O                       HEAVD               42
     O                                           43 '/'
     O                       HEOPD               50
     O                                           51 '/'
     O                       HESG                54
     O                       IDAGX         Y     66
     O          E            HEADB            20
     O                       IDAGX         Y     66
     O          E            HEADB            22
     O              N70      TX1661              14
     O               70                          14 'Terms of del:'
     O               79                          14 'Frankatur...:'
     O              N70N79   TX1665              71
     O               70                          71 'Date due......:'
     O               79                          71 'Verfallstag...:'
     O              N70N79   TX1670              53
     O               70                          53 'Date of disp..:'
     O               79                          53 'Auftrag vom...:'
     O          E            HEADB            22
     O                                           14 '_____________'
     O                                           53 '_______________'
     O                                           71 '_______________'
     O          E            HEADB            23
     O              N70N79   KFRNTX              29
     O               70      KFRTTX              29
     O               79      KFRTTX              29
     O                       XDT           Y     46
     O                       XFFDT         Y     64
     O          E            HEADB            23
     O                       XFFDT         Y     64
     O          E            HEADB            25
     O                                           24 ' _______________________'
     O                                           48 '________________________'
     O                                           72 '________________________'
     O                                           80 '________'
     O          E            HEADB            26
     O              N70N79   TX1651              16
     O               70                          16 'Shipper.....:'
     O               79                          16 'Absender....:'
     O                                            2 '!'
     O                                           41 '!'
     O              N70N79   TX1652              55
     O               70                          55 'Consignee...:'
     O               79                          55 'Empfanger...:'
     O                                           80 '!'
     O          E            HEADB            26
     O              N70N79   TX1651              16
     O               70                          16 'Shipper.....:'
     O               79                          16 'Absender....:'
     O                                            2 '!'
     O                                           41 '!'
     O              N70N79   TX1652              55
     O               70                          55 'Consignee...:'
     O               79                          55 'Empfanger...:'
     O                                           80 '!'
     O          E            HEADB            26
     O                                           24 ' _______________________'
     O                                           48 '________________________'
     O                                           72 '________________________'
     O                                           80 '________'
     O          E            HEADB            27
     O                                            2 '!'
     O                                           41 '!'
     O                                           80 '!'
     O          E            HEADB            28
     O                                            2 '!'
     O                       HENAS               37
     O                                           41 '!'
     O                       HENAK               77
     O                                           80 '!'
     O          E            HEADB            29
     O                                            2 '!'
     O                       HEADS1              37
     O                                           41 '!'
     O                       HEADK1              77
     O                                           80 '!'
     O          E            HEADB            30
     O                                            2 '!'
     O                       HEADS2              37
     O                                           41 '!'
     O                       HEADK2              77
     O                                           80 '!'
     O          E            HEADB            31
     O                                            2 '!'
     O                       HEADS3              37
     O                                           41 '!'
     O                       HEADK3              77
     O                                           80 '!'
     O          E            HEADB            32
     O                                            2 '!'
     O                       SLAND               37
     O                                           41 '!'
     O                       KLAND               77
     O                                           80 '!'
     O          E            HEADB            33
     O                                           24 ' -----------------------'
     O                                           48 '------------------------'
     O                                           72 '------------------------'
     O                                           80 '--------'
     O          E            HEADB            35
     O              N70N79   TX1688               7
     O               70                           7 'From.:'
     O               79                           7 'Von..:'
     O                       XFRATX              38
     O              N70N79   TX1689              46
     O               70                          46 'To...:'
     O               79                          46 'Nach.:'
     O                       XTILTX              77
     O          E            HEADB            36
     O              N70N79   TX1663              14
     O               70                          14 'Shipped pr..:'
     O               79                          14 'Mit.........:'
     O                       TUBILN              26
     O                       TUNAT               59
     O          E            HEADB            36
     O                                           14 '_____________'
     O          E            HEADB            38
     O              N70N79   TX1679              80
     O               70                          24 ' No.Pcs Desc.of goods   '
     O               70                          48 '            Weight      '
     O               70                          72 ' M3      Ch.Wei. Marks  '
     O               79                          24 ' Anzahl Warenart        '
     O               79                          48 '           Gewicht      '
     O               79                          72 ' M3      Fr.Gew. Zeichen'
     O          E            HEADB            38
     O                                           24 ' _______________________'
     O                                           48 '________________________'
     O                                           72 '________________________'
     O                                           80 '________'
     O          E            HEADB            39
     O                       HENT          Z      7
     O                       HEVS1               33
     O                       HEVKT         Z     42
     O                       HEM3                54 '   0,   '
     O                       HEFBV         Z     64
     O                       HEGM1               80
     O          E            HEADB            39 40
     O                       HENT          Z      7
     O                       HEVS1               33
     O                       HEVKT         Z     42
     O                       HEM3                54 '   0,   '
     O                       HEFBV         Z     64
     O                       HEGM1               80
     O          E    49      HEADB          0
     O                       HEVS2               33
     O               58                          46 'LM:'
     O               58      HELM                53 ' 0,  '
     O                       HEGM2               80
     O          E    49      HEADB          2
     O                       HEVS2               33
     O               58                          46 'LM:'
     O               58      HELM                53 '  .  '
     O                       HEGM2               80
     O          E            HEADB1         2
     O              N70N79                       78 '** Fortsett **'
     O               70                          79 '** Continues **'
     O                  79                       79 '* Fortsetzung *'
     O          E            FSBORD      1
     O                       KFSOTX              31
     O                                           32 ':'
     O                       FSSOKX              49
     O          E            UFBBOR      1
     O                                           25 'Utleveringsforbehold'
     O                                           32 ':'
     O                       HEFT1A              64
     O                       HEKFT1              80
     O          E            UFBBOR      0
     O                                           25 'Utleveringsforbehold'
     O                                           32 ':'
     O                       HEFT1A              64
     O                       HEKFT1              80
     O          E            FRIELB      1
     O                       FRTTXT              70
     O          E            HEAB22      2  2
     O              N70N79   TX1680              46
     O              N70N79   TX1681              80
     O               70                          45 '          D E S C R I P '
     O               70                          69 'T I O N                 '
     O               70                          80 '       AMOUNT    '
     O               79                          45 'K O S T E N B E R E C H '
     O               79                          69 'N U N G                 '
     O               79                          80 '       KOSTEN    '
     O          E            BDET        1
     O                       FAVT                37
     O              N70N79   KGENOT              58
     O               70      KGEENT              58
     O               79      KG2TYT              58
     O               36 70   XVAL                65
     O               36 79   XVALB               65
     O               36N70 79XVALB               65
     O               36      XPFNOK        J     78
     O               34 36                       79 '*'
     O          E    72      TOTØ        1
     O              N70N79   TX1682              17
     O               70                          17 'VAT of (* lines)'
     O               79                          17 'Tax von(* linen)'
     O                       XMVAGR        JB    39
     O              N70N79   TX1683              60
     O               70                          60 'VAT Domestic:      %'
     O               79                          60 'Kosten stat:       %'
     O                       PRITAX        J     59
     O               70      XVAL                65
     O               79      XVAL                65
     O              N70 71   XVAL                65
     O                       XPMOMS        JB    78
     O          E            TOTØ        2
     O              N70N73N79TX1684              25
     O               70N73N79                    25 'Terms of payment        '
     O              N70N79   TX1685              56
     O               70                          56 'Total:'
     O               79                          56 'Gesamtbetrag'
     O                       XVAL                60
     O                       XBRUTT        JB    78
     O          E            TOTØ        2
     O              N73N79N39BETTXT              31
     O              N73N79 39                     8 'Kontant'
     O                                           73 '=========               '
     O                                           80 '========================'
     O          E            TOTØ        1
     O                       KFMT2               75
     OHEADFR    E            DUMOPD
     Otellfar   E            DUMFIR
     OFAKTR     E            OPDFAK
     O                       FAOPKO
     O                       FAKUNR
     O                       FAFAKT
     O                       FACC
     O                       FAÅR
     O                       FAMND
     O                       FADATO
     O                       FADAFF
     O                       FACURI
     OFAKTR     E            DUMFAK
