     H
     FFAXUSRS   UF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    USERID            8
     C                   PARM                    FAXNBR           32
     C                   PARM                    TO               40
     C                   PARM                    TITLE            40
     C                   PARM                    COMMEN           40
     C                   PARM                    TO1              40
     C                   PARM                    TO2              40
     C                   PARM                    TO3              40
     C                   PARM                    FI                2
     C                   PARM                    KNU               8
     C                   PARM                    ALFA             10
     C                   PARM                    TELE             32
     C*
     C     USERID        CHAIN     FAXREC                             41
     C     *IN41         IFEQ      '0'
     C                   MOVE      *BLANKS       FFAXNB
     C                   MOVE      *BLANKS       FTO
     C                   MOVE      *BLANKS       FTITLE
     C                   MOVE      *BLANKS       FCOMME
     C                   MOVE      *BLANKS       FTO1
     C                   MOVE      *BLANKS       FTO2
     C                   MOVE      *BLANKS       FTO3
     C                   MOVE      *BLANKS       FFI
     C                   MOVE      *BLANKS       FKNU
     C                   MOVE      *BLANKS       FALFA
     C                   MOVE      *BLANKS       FTELE
     C                   MOVE      FAXNBR        FFAXNB
     C                   MOVE      TO            FTO
     C                   MOVE      TITLE         FTITLE
     C                   MOVE      COMMEN        FCOMME
     C                   MOVE      TO1           FTO1
     C                   MOVE      TO2           FTO2
     C                   MOVE      TO3           FTO3
     C                   MOVE      FI            FFI
     C                   MOVE      KNU           FKNU
     C                   MOVE      ALFA          FALFA
     C                   MOVE      TELE          FTELE
     C                   UPDATE    FAXREC
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
