      *_________________________
      * Array for centering text
      *"""""""""""""""""""""""""
      *______________________
      * DS for centering text
      *""""""""""""""""""""""
     D                 DS
     D  Æ                      1     20
     D                                     DIM(20)                              Input string
     D  ÆDS                    1     20
     D                 DS
     D  Å                      1     20
     D                                     DIM(20)                              Output string
     D  ÅDS                    1     20
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Init                                                 SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C                   Z-ADD     0             ÆX                3 0
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Center text                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   MOVEA     *BLANKS       Æ
     C                   MOVEA     *BLANKS       Å
     C                   Z-ADD     20            ÆX
     C                   MOVEA     'TA Z N'      Æ
      * Find rightmost character of input
     C     SRB1          TAG
     C     Æ(ÆX)         IFEQ      *BLANKS
     C                   SUB       1             ÆX
     C                   GOTO      SRB1
     C                   ENDIF
      * Calculate left positions of output
     C     20            SUB       ÆX            ÆX
     C     ÆX            IFGE      2
     C     ÆX            DIV       2             ÆX
     C                   ADD       1             ÆX
     C                   ELSE
     C                   Z-ADD     1             ÆX
     C                   ENDIF
      * Move input to output arrary
     C                   MOVEA     Æ             Å(ÆX)
      *
     C                   ENDSR
