     C     *ENTRY        PLIST
     C                   PARM                    ULIB             10
      *
     C                   MOVEL     ULIB          ULIB2            10
      *
     C     ULIB2         CAT       'QQ':0        ULIB2
     C                   MOVE      ULIB2         ULIB             10
     C                   SETON                                        LR
     C                   RETURN
