********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 KOMMANDO LENGERE
********************************************************************
     FINNMSGF   IF   F  132        DISK
     D                 DS
     D  MSGID                  1      7
     D  MNUNBR                 6      7
     IINNMSGF   NS
     I                                 15   16  MNUNBR
S01  I*                                18   67  MNUCMD
N01  I                                 18  132  MNUCMD
     C     *ENTRY        PLIST
     C                   PARM                    LIB              10
     C                   PARM                    MSGF              8
     C*
     C                   MOVEL     'USR00'       MSGID
     C                   READ      INNMSGF                                33
     C  N33              DO
     C     *IN33         DOUEQ     '1'
     C                   READ      INNMSGF                                33
     C  N33              DO
     C                   CALL      'CRTMSGC'
     C                   PARM                    MSGID             7
     C                   PARM                    MSGF
     C                   PARM                    LIB
     C                   PARM                    MNUCMD
     C                   END
     C                   END
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
     C*
     C*
