     FEDISE_    IF   E             DISK
     F                                     RENAME(EDISER:EDISER_)
     FEDISE     O  A E             DISK
     C     *ENTRY        PLIST
     C                   PARM                    SEMBR

     C                   READ      EDISE_                                 51
     C     *IN51         DOWEQ     '0'

     C                   WRITE     EDISER

     C                   READ      EDISE_                                 51
     C  N51              ENDDO

     C                   MOVE      '1'           *INLR
