     FSVTKD     UF   E             DISK
     C                   READ      SVTKD                                  51
     C     *IN51         DOWEQ     *OFF

     C                   CALL      'CVTU8SE'
     C                   PARM      SVKD_KBE      STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   MOVEL     STRINGOUT     SVKD_KBE

     C                   CALL      'CVTU8SE'
     C                   PARM      SVKD_KBS      STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   MOVEL     STRINGOUT     SVKD_KBS


     C                   CALL      'CVTU8SE'
     C                   PARM      SVKD_LBE      STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   MOVEL     STRINGOUT     SVKD_LBE

     C                   CALL      'CVTU8SE'
     C                   PARM      SVKD_LBS      STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   MOVEL     STRINGOUT     SVKD_LBS
     C                   UPDATE    SVTKDR
     C                   READ      SVTKD                                  51
     C                   ENDDO

     C                   MOVE      *ON           *INLR
