     D***************************************************
     D*          DATFM3
     D***************************************************
     D*  FIXET FOR THE INHOUSE FORMAT FROM YYMMDD
     D*
     D                 DS
     D  PDATE                  1      6  0
     D  PDATE1                 1      2  0
     D  PDATE2                 3      4  0
     D  PDATE3                 5      6  0
     D                 DS
     D  DAT                    1      6  0
     D  AAR                    1      2  0
     D  MND                    3      4  0
     D  DAG                    5      6  0
     C*
     C*
     C     *ENTRY        PLIST
     C     FIDTFM        PARM      FIDTFM        FIDTFM            1 0
     C     DATO          PARM      DATO          DATO              6 0
     C                   MOVE      DATO          DAT
     C*
     C                   MOVE      DAG           PDATE1
     C                   MOVE      MND           PDATE2
     C                   MOVE      AAR           PDATE3
SV5  C*          FIDTFM    IFEQ 2
NV5  C     FIDTFM        IFEQ      3
     C                   MOVE      DAG           PDATE3
     C                   MOVE      AAR           PDATE1
     C                   ELSE
SV5  C*          FIDTFM    IFEQ 3
NV5  C     FIDTFM        IFEQ      2
     C                   MOVE      DAG           PDATE2
     C                   MOVE      MND           PDATE1
     C                   END
     C                   END
     C                   MOVE      PDATE         DATO
     C                   RETURN
     C*
