     D***************************************************
     D*          DATFM5
     D***************************************************
     D*  FIXET FOR FROM THE INHOUSE FORMAT TO YYMMDD
     D*
     D                 DS
     D  PDATE                  1      6  0
     D  PDATE1                 1      2  0
     D  PDATE2                 3      4  0
     D  PDATE3                 5      6  0
     D                 DS
     D  DAT                    1      6  0
     D  INN1                   1      2  0
     D  INN2                   3      4  0
     D  INN3                   5      6  0
     C*
     C*
     C     *ENTRY        PLIST
     C     FIDTFM        PARM      FIDTFM        FIDTFM            1 0
     C     DATO1         PARM      DATO1         DATO1             6 0
     C*
     C                   MOVE      DATO1         DAT
     C*
     C                   MOVE      INN1          PDATE1
     C                   MOVE      INN2          PDATE2
     C                   MOVE      INN3          PDATE3
     C     FIDTFM        IFEQ      1
     C                   MOVE      INN1          PDATE3
     C                   MOVE      INN3          PDATE1
     C                   ELSE
     C     FIDTFM        IFEQ      2
     C                   MOVE      INN3          PDATE1
     C                   MOVE      INN1          PDATE2
     C                   MOVE      INN2          PDATE3
     C                   END
     C                   END
     C*
     C                   MOVE      PDATE         DATO1
     C*
     C                   RETURN
