     D***************************************************
     D*          DATFM4
     D***************************************************
     D*  FIXET FOR THE INHOUSE FORMAT FROM YYMMDD
     D*
     D                 DS
     D  PDATE                  1      6  0
     D  PDATE1                 1      2  0
     D  PDATE2                 3      4  0
     D  PDATE3                 5      6  0
     D                 DS
     D  DAT                    1      6  0
     D  AAR                    1      2  0
     D  MND                    3      4  0
     D  DAG                    5      6  0
     C*
     C*
     C     *ENTRY        PLIST
     C     FIDTFM        PARM      FIDTFM        FIDTFM            1 0
     C     DATO1         PARM      DATO1         DATO1             6 0
     C     DATO2         PARM      DATO2         DATO2             6 0
     C     DATO3         PARM      DATO3         DATO3             6 0
     C     DATO4         PARM      DATO4         DATO4             6 0
     C*
     C                   MOVE      DATO1         DAT
     C*
     C                   EXSR      DATOTE
     C                   MOVE      PDATE         DATO1
     C*
     C     DATO2         IFNE      *ZEROS
     C*
     C                   MOVE      DATO2         DAT
     C*
     C                   EXSR      DATOTE
     C                   MOVE      PDATE         DATO2
     C*
     C     DATO3         IFNE      *ZEROS
     C*
     C                   MOVE      DATO3         DAT
     C*
     C                   EXSR      DATOTE
     C                   MOVE      PDATE         DATO3
     C*
     C     DATO4         IFNE      *ZEROS
     C*
     C                   MOVE      DATO4         DAT
     C*
     C                   EXSR      DATOTE
     C                   MOVE      PDATE         DATO4
     C                   END
     C                   END
     C                   END
     C*
     C                   RETURN
     C**************************************************************************
     C     DATOTE        BEGSR
     C**************************************************************************
     C                   MOVE      DAG           PDATE1
     C                   MOVE      MND           PDATE2
     C                   MOVE      AAR           PDATE3
     C     FIDTFM        IFEQ      2
     C                   MOVE      DAG           PDATE3
     C                   MOVE      AAR           PDATE1
     C                   ELSE
     C     FIDTFM        IFEQ      3
     C                   MOVE      DAG           PDATE2
     C                   MOVE      MND           PDATE1
     C                   END
     C                   END
     C                   ENDSR
     C*
