     F*
     F***********************************************************
     F*** PROGRAM SKAL KONVERTERE DATOFORMAT                  ***
     F*** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
     F*** LEDIGE INDIKATORER 01-26                            ***
     F*** LEDIGE INDIKATORER 27-99                            ***
     F***********************************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UDT1              2 0
     C                   PARM                    UDT2              2 0
     C                   PARM                    UDT3              2 0
     C                   PARM                    UDTFM             1 0
      *
      *** UDTFM = 1   --->  NORSK FORMAT  (IKKE KONVERTERES)  DDMM≈≈
      *** UDTFM = 2   --->  AMERIKANSK FORMAT (KONVERTERES)   MMDD≈≈
      *** UDTFM = 3   --->  KINESISK FORMAT (KONVERTERES)     ≈≈MMDD
     C     UDTFM         IFEQ      2
     C                   MOVE      UDT1          XDT               2 0
     C                   MOVE      UDT2          UDT1
     C                   MOVE      XDT           UDT2
     C                   ELSE
     C     UDTFM         IFEQ      3
     C                   MOVE      UDT1          XDT
     C                   MOVE      UDT3          UDT1
     C                   MOVE      XDT           UDT3
     C                   END
     C                   END
      *
      *                    SETON                     LR
     C                   RETURN
      *
