     FQX        UF   F 1024        DISK
     IQX        AA
     I                                  1 1024  QXD
     C                   READ      QX                                     51
     C     *IN51         DOWEQ     *OFF

     C                   EVAL      XTABLE='DKCVT     '
     C                   CALL      'QDCXLATE'
     C                   PARM      1024          XLEN              5 0
     C                   PARM                    QXD            1024
     C                   PARM                    XTABLE           10
     C                   PARM      '*LIBL'       XLIB             10
     C                   EXCEPT    QXU

     C                   READ      QX                                     51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
     OQX        E            QXU
     O                       QXD               1024
