     FDKI051D   CF   E             WORKSTN
     F                                     SFILE(DKI051DA:ZRECNO)
     F                                     INFDS(FBAREA)
     FDKIA      UF A E           K DISK
     FDKIA1     IF   E           K DISK
     F                                     RENAME(DKIAR:DKIAR1)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *________________
      * Arbetsvariablar
      *""""""""""""""""
     C     *LIKE         DEFINE    ZRECNO        WRECNO
     C     *LIKE         DEFINE    DKIA_SYAV     ZKIA_SYAV
     C     *LIKE         DEFINE    DKIA_SYOP     ZKIA_SYOP
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR

     C     SRB1          TAG
      *______________
      * Tømme Subfile
      *""""""""""""""
     C                   EVAL      *IN93=*ON
     C                   WRITE     DKI051DB
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZERO         ZRECNO
     C                   Z-ADD     *ZERO         WRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     *LOVAL        SETLL     DKIA1
     C                   READ      DKIA1                                  94

     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     DKI051DA
     C                   READ      DKIA1                                  94
     C  N94              ENDDO

     C     ZRECNO        IFEQ      0
     C                   ADD       1             ZRECNO
     C                   WRITE     DKI051DA
     C                   ENDIF
     C                   EVAL      WRECNO=ZRECNO
     C                   EVAL      ZRECNO=1
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C     SRB3          TAG

     C                   MOVEA     '11'          *IN(91)
     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     DKI051DE
     C                   WRITE     DKI051DØ
     C                   WRITE     DKI051DC
     C                   EXFMT     DKI051DB

     C     *IN03         IFEQ      '0'
     C     *IN12         ANDEQ     '0'

     C                   MOVEA     '00'          *IN(91)
      *_____________
      * F5=Frisk opp
      *"""""""""""""
     C     *IN05         CABEQ     '1'           SRB1
      *___________
      * F6=Lage ny
      *"""""""""""
     C     *IN06         IFEQ      '1'
     C                   EXSR      SRBA
     C     *IN03         CABEQ     '1'           SRB9
     C                   GOTO      SRB3
     C                   ENDIF
      *_______
      * Valg ?
      *"""""""
     C                   EVAL      *IN52=*OFF
     C                   EVAL      *IN95=*OFF
     C     *IN52         DOWEQ     '0'

     C                   READC     DKI051DA                               52
     C     *IN52         IFEQ      '0'
     C     ZOP           CASEQ     '2'           SRBB                           Endre
     C     ZOP           CASEQ     '4'           SRBD                           Slette
     C                   ENDCS
     C                   ENDIF
      *
     C  N52              ENDDO

     C     *IN03         CABEQ     '1'           SRB9
     C     *IN12         CABEQ     '1'           SRB3
     C                   GOTO      SRB1

     C                   ENDIF

     C     SRB9          ENDSR
      *////////////////////////////////////////////////////////////
      *  Lage ny                                             SRBA /
      *////////////////////////////////////////////////////////////
     C     SRBA          BEGSR

     C                   CLEAR                   DKI051DD
     C                   MOVEA     '0000'        *IN(30)

     C     SRBA1         TAG

      *____________
      * Blanke felt
      *""""""""""""
     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     DKI051DØ
     C                   EXFMT     DKI051DD
     C                   MOVEA     '0000'        *IN(30)
     C     *IN03         IFEQ      '0'
     C     *IN05         ANDEQ     '0'
     C     *IN12         ANDEQ     '0'
      *_______
      * F4=Søk
      *"""""""
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     *IN04         IFEQ      '1'
     C     LINNBR        ANDEQ     23
     C                   ENDIF
      *____________
      * Teste input-1
      *""""""""""""
     C   30              GOTO      SRBA1
      *___________________
      * Adda post til  FIL
      *"""""""""""""""""""
     C                   EVAL      DKIA_SYAV=ZKIA_SYAV
     C                   EVAL      DKIA_SYOP=ZKIA_SYOP
     C                   EVAL      DKIA_14A=ZKIA_14A
     C                   EVAL      DKIA_14B=ZKIA_14B
     C                   EVAL      DKIA_14C=ZKIA_14C
     C                   EVAL      DKIA_14D=ZKIA_14D
     C                   EVAL      DKIA_14E=ZKIA_14E
     C                   EVAL      DKIA_14F=ZKIA_14F
     C                   EVAL      DKIA_0035=ZKIA_0035
     C                   WRITE     DKIAR
      *______________________
      * Adda post til  SUBFIL
      *""""""""""""""""""""""
     C                   ADD       1             WRECNO
     C                   EVAL      ZRECNO=WRECNO
     C                   WRITE     DKI051DA

     C                   GOTO      SRBA1

     C                   ENDIF

     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Endre                                               SRBB /
      *////////////////////////////////////////////////////////////
     C     SRBB          BEGSR
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ZOP
     C                   UPDATE    DKI051DA
      *____________
      * Flytte felt
      *""""""""""""
     C     DKIA_SYAV     CHAIN(N)  DKIA                               53
     C                   MOVEA     '0000'        *IN(30)
     C                   EVAL      ZKIA_SYAV=DKIA_SYAV
     C                   EVAL      ZKIA_SYOP=DKIA_SYOP
     C                   EVAL      ZKIA_14A=DKIA_14A
     C                   EVAL      ZKIA_14B=DKIA_14B
     C                   EVAL      ZKIA_14C=DKIA_14C
     C                   EVAL      ZKIA_14D=DKIA_14D
     C                   EVAL      ZKIA_14E=DKIA_14E
     C                   EVAL      ZKIA_14F=DKIA_14F
     C                   EVAL      ZKIA_0035=DKIA_0035

     C     SRBB1         TAG

     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     DKI051DØ
     C                   EXFMT     DKI051DD
     C                   MOVEA     '000'         *IN(30)
     C     *IN12         IFEQ      '0'
      *_______
      * F4=Søk
      *"""""""
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     *IN04         IFEQ      '1'
     C     LINNBR        ANDEQ     23
     C                   ENDIF
      *____________
      * Teste input
      *""""""""""""
     C   30              GOTO      SRBB1
      *______________
      * Oppdatere FIL
      *""""""""""""""
     C     ZKIA_SYAV     CHAIN     DKIA                               53
     C                   EVAL      DKIA_SYOP=ZKIA_SYOP
     C                   EVAL      DKIA_14A=ZKIA_14A
     C                   EVAL      DKIA_14B=ZKIA_14B
     C                   EVAL      DKIA_14C=ZKIA_14C
     C                   EVAL      DKIA_14D=ZKIA_14D
     C                   EVAL      DKIA_14E=ZKIA_14E
     C                   EVAL      DKIA_14F=ZKIA_14F
     C                   EVAL      DKIA_0035=ZKIA_0035
     C                   UPDATE    DKIAR

     C                   ENDIF

     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Slette                                              SRBD /
      *////////////////////////////////////////////////////////////
     C     SRBD          BEGSR
      *______________
      * Oppdatere FIL
      *""""""""""""""
     C     DKIA_SYAV     CHAIN     DKIA                               53
     C                   DELETE    DKIAR
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   CLEAR                   DKI051DA
     C                   UPDATE    DKI051DA
     C                   EVAL      *IN95=*ON

     C                   ENDSR
