     FDKIVOLD   IF   E             DISK
     F                                     RENAME(DKIVR:DKIVRO)
     F                                     PREFIX(X)
     FDKIV      UF   E           K DISK
     C     KEY           KLIST
     C                   KFLD                    XDKIV_SYAV
     C                   KFLD                    XDKIV_SYOP
     C                   KFLD                    XDKIV_SYLI
     C                   READ      DKIVOLD                                51
     C     *IN51         DOWEQ     *OFF
     C     KEY           CHAIN     DKIV                               52
     C                   IF        *IN52 = *OFF
     C                   EVAL      DKIV_446KA=XDKIV_446A
     C                   MOVEL     XDKIV_446B    DKIV_446TA
     C                   MOVEL     XDKIV_446C    DKIV_446TB
     C                   MOVEL     XDKIV_446D    DKIV_446TC
     C                   MOVEL     XDKIV_446E    DKIV_446TD
     C                   UPDATE    DKIVR
     C                   ENDIF
     C                   READ      DKIVOLD                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
