     FEDIMA     IF   E           K DISK
     FEDIC      UF   E             DISK
     FDKNSTD    IF   E           K DISK
     FEDII      IF   E           K DISK
     FDKTFI     IF   E             DISK
     FEDIS      O  A E             DISK
     D                 DS
     D  DKTF_0004T             1     35
     D  WREGSENR               1      8
     D                 DS
     D  WMBR                   1     14
     D  WMBRA                  1      1
     D  WMBRB                  2     10  0
     D  WSSNA                  2     10
      *   SYEDI data area
     D EDIDTA          DS           256
     D  UELIBF               171    180
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    MSR           WSR
     C     *LIKE         DEFINE    MST           WST
     C     *LIKE         DEFINE    *IN51         WIN51
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSR
     C                   KFLD                    WST
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM      *IN51         WIN51
     C                   PARM      SMBR          SMBR
     C                   PARM      SSN           SSN
     C                   PARM                    INNETW
      *_____________
      * Init av felt
      *"""""""""""""
     C                   MOVE      'S'           WSR
     C                   MOVE      '+'           WST
     C                   MOVE      'E'           WMBRA                          UTFØRSEL,
      *                                                    SENDNING
      * Åpne dataarea
     C     *DTAARA       DEFINE                  EDIDTA
     C                   IN        EDIDTA
      *_____________________________
      * Hente data fra firmaregister
      *"""""""""""""""""""""""""""""
     C     1             CHAIN     DKTFI                              20
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *________________________________
      * Oppdatere status i meldingslogg
      *""""""""""""""""""""""""""""""""
     C                   MOVE      '0'           *IN20
     C     KEYA          CHAIN     EDIMA                              51
     C     *IN51         DOWEQ     '0'
     C     MVEN          IFEQ      *BLANKS
     C     M0065         IFEQ      'CUSDEC'
     C     M1001         ANDEQ     'DTI'
     C     M1N07         IFEQ      '007'
     C     M1N07         OREQ      '044'
     C     M0010         CHAIN     EDII                               52
     C     *IN52         IFEQ      '0'
     C                   MOVE      '1'           *IN20
     C                   ELSE
     C                   MOVE      '0'           *IN20
     C                   ENDIF
     C                   END
     C                   END
     C                   END
     C  N20KEYA          READE     EDIMA                                  51
     C  N51
     CANN20              END
     C     *IN51         CABEQ     '1'           SRB9
      *_____________________________
      * Hente data fra avdelingsreg.
      *"""""""""""""""""""""""""""""
     C     MAVD          CHAIN     DKNSTD                             20
      *________________________________________
      * Hente og oppdater neste sendningsnummer
      *""""""""""""""""""""""""""""""""""""""""
     C     1             CHAIN     EDIC                               20
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
      *_________________
      * Logge sendningen
      *"""""""""""""""""
     C                   MOVE      M0004         S0004
     C                   MOVE      M0010         S0010
     C                   Z-ADD     CSN           WMBRB
     C                   MOVE      WMBR          S0020
     C                   MOVE      M0035         S0035
     C                   EVAL      S0026 = 'CUSDECI-TR01'
     C                   Z-ADD     0             S0036
     C                   Z-ADD     CSN           SSN
     C                   MOVE      'S'           SSR
     C                   MOVE      ' '           SST
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           SDT
     C                   MOVE      WTM           STM
     C                   MOVEL     '*LIBL   '    SLIB
     C                   MOVE      '  '          SLIB
     C                   MOVEL     '*IFS  '      SFILE
     C                   MOVEL     WMBR          SMBR
     C                   EVAL      SIFS = '/' + %trimr(UELIBF)
     C                             + '/EDISE/'
     C                             + WREGSENR
     C                             + '_'
     C                             + WDT
     C                             + '_'
     C                             + WSSNA
     C                             + '.tri'
     C                   WRITE     EDISR
     C     SRB9          ENDSR
