***** **************************************************************
      * Print File Field definition for gitt fil (basert å DSPFFD) *
***** **************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 bruk kolonneheader framfor felt-tekst
10XXX * 02 JOV PTF10 OPPDATER DSPFFDF2
********************************************************************
     FDSPFFDF   IP   E             DISK
N02  FDSPFFDF2  O  A E             DISK
     FDSPFFDP   O    E             PRINTER OFLIND(*IN98)
     D                 DS
     D  XXFTXT                 1    105
     D  WHFTX1                 1     35
     D  WHFTX2                36     70
     D  WHFTX3                71    105
     IQWHDRFFD      01
     I                                          WHFILE        L1
     I                                          WHLIB         L2
     C     *ENTRY        PLIST
     C                   PARM                    OBJTXT           50
     C                   PARM                    OBJCRT           13
     C                   PARM                    OBJCHG           13
     C                   PARM                    COLHDG            1
      *
     C   L2              WRITE     FFDP1
     C   01*IN98         IFEQ      '1'
     C                   WRITE     FFDP1
     C                   MOVE      '0'           *IN98
     C                   END
      *
     C     WHFOBO        ADD       WHFLDB        SLUPOS            5 0
     C                   SUB       1             SLUPOS
     C                   MOVE      *BLANKS       XXFTXT
s01  C*                  MOVEL     WHFTXT        XXFTXT
s01  C*    COLHDG        IFEQ      'Y'
s01  C*    COLHDG        OREQ      'J'
s01  C*                  CAT       WHCHD1:2      XXFTXT
n01  C                   MOVEL     WHCHD1        XXFTXT
     C                   CAT       WHCHD2:2      XXFTXT
     C                   CAT       WHCHD3:2      XXFTXT
s01  C*                  END
n01  C     COLHDG        IFEQ      'Y'
n01  C     WHFTXT        andne     WHCHD1
n01  C                   CAT       WHFTXT:2      XXFTXT
n01  C                   END
      * 50 ON - NUMERISK (VIS DECIMAL POSITIONS.)
     C     WHFLDD        COMP      *ZEROS                             5050
     C                   WRITE     FFDP2
     C     WHFTX2        IFNE      *BLANKS
     C                   WRITE     FFDP22
     C                   END
     C     WHFTX3        IFNE      *BLANKS
     C                   WRITE     FFDP23
     C                   END
N02  C                   WRITE     DSPFFDF2R
     CL2                 WRITE     FFDP3
