     H DEBUG(*YES)
     C                   MOVE      *BLANKS       INPUT            16
     C                   MOVE      *BLANKS       LEN               1
     C                   MOVEL     '479100991'   INPUT
     C                   CALL      'E052R'
     C                   PARM                    INPUT
     C                   PARM                    LEN
     C                   DUMP

     C                   MOVE      *BLANKS       INPUT
     C                   MOVE      *BLANKS       LEN
     C                   MOVEL     '024037101546'INPUT
     C                   CALL      'E052R'
     C                   PARM                    INPUT
     C                   PARM                    LEN
     C                   DUMP

     C                   MOVE      *BLANKS       INPUT
     C                   MOVE      *BLANKS       LEN
     C                   MOVEL     '024037221208'INPUT
     C                   CALL      'E052R'
     C                   PARM                    INPUT
     C                   PARM                    LEN
     C                   DUMP

     C                   MOVE      *BLANKS       INPUT
     C                   MOVE      *BLANKS       LEN
     C                   MOVEL     '1234567890'  INPUT
     C                   CALL      'E052R'
     C                   PARM                    INPUT
     C                   PARM                    LEN
     C                   DUMP

     C                   MOVE      *BLANKS       INPUT
     C                   MOVE      *BLANKS       LEN
     C                   MOVEL     '7221208'     INPUT
     C                   CALL      'E052R'
     C                   PARM                    INPUT
     C                   PARM                    LEN
     C                   DUMP

     C                   MOVE      *ON           *INLR
