     H DEBUG(*YES)
     D                 DS
     C                   MOVE      X'C0'         A                 1
     C                   MOVE      A             B                 1
     C                   BITOFF    '0'           B
     C                   DUMP

     C                   MOVE      *ON           *INLR
