     FEDII      IF   E           K DISK
     FEDIS      IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    SSN
     C                   PARM                    Æ002              8            Account SND
     C                   PARM                    Æ003              8            Userid SND
     C                   PARM                    Æ004              8            Password SND
     C                   PARM                    Æ005              8            Account RCV
     C                   PARM                    Æ006              8            Userid RCV
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *____________________
      * Get Interchange Log
      *""""""""""""""""""""
     C     SSN           CHAIN     EDIS                               51
      *_____________________
      * Get Interchange ID's
      *"""""""""""""""""""""
      * Sender
     C     S0004         CHAIN     EDII                               20
     C                   MOVEL     INACC         Æ002
     C                   MOVEL     INUSR         Æ003
     C                   MOVEL     INPW          Æ004
      * Receiver
     C     S0010         CHAIN     EDII                               20
     C                   MOVEL     INACC         Æ005
     C                   MOVEL     INUSR         Æ006
     C                   ENDSR
