     FEDIRE     IF   E           K DISK
     FEALC03A   O  A E             DISK
     FEALI03A   O  A E             DISK
     FEAPR03A   O  A E             DISK
     FECAV03A   O  A E             DISK
     FECCI03A   O  A E             DISK
     FECNI03A   O  A E             DISK
     FECNT03A   O  A E             DISK
     FECOM03A   O  A E             DISK
     FECPI03A   O  A E             DISK
     FECTA03A   O  A E             DISK
     FECUX03A   O  A E             DISK
     FEDGS03A   O  A E             DISK
     FEDIM03A   O  A E             DISK
     FEDOC03A   O  A E             DISK
     FEDTM03A   O  A E             DISK
     FEEQA03A   O  A E             DISK
     FEEQD03A   O  A E             DISK
     FEEQN03A   O  A E             DISK
     FEFII03A   O  A E             DISK
     FEFTX03A   O  A E             DISK
     FEGDS03A   O  A E             DISK
     FEGID03A   O  A E             DISK
     FEGIN03A   O  A E             DISK
     FEGIR03A   O  A E             DISK
     FEGOR03A   O  A E             DISK
     FEHAN03A   O  A E             DISK
     FEIMD03A   O  A E             DISK
     FELIN03A   O  A E             DISK
     FELOC03A   O  A E             DISK
     FEMEA03A   O  A E             DISK
     FEMOA03A   O  A E             DISK
     FENAD03A   O  A E             DISK
     FEPAC03A   O  A E             DISK
     FEPAI03A   O  A E             DISK
     FEPAT03A   O  A E             DISK
     FEPCD03A   O  A E             DISK
     FEPCI03A   O  A E             DISK
     FEPIA03A   O  A E             DISK
     FEPRI03A   O  A E             DISK
     FEQTY03A   O  A E             DISK
     FEQVR03A   O  A E             DISK
     FERCS03A   O  A E             DISK
     FERFF03A   O  A E             DISK
     FERNG03A   O  A E             DISK
     FERTE03A   O  A E             DISK
     FESCC03A   O  A E             DISK
     FESEL03A   O  A E             DISK
     FESGP03A   O  A E             DISK
     FESTG03A   O  A E             DISK
     FESTS03A   O  A E             DISK
     FETAX03A   O  A E             DISK
     FETCC03A   O  A E             DISK
     FETDT03A   O  A E             DISK
     FETMD03A   O  A E             DISK
     FETMP03A   O  A E             DISK
     FETOD03A   O  A E             DISK
     FETPL03A   O  A E             DISK
     FETSR03A   O  A E             DISK
     D NU              S              1    DIM(15)
      *____________________________________________________________
      * Syntax of message
      * POS 1-6=MSGTYPE    7-9=SEGM   10-11=GROUP 12-12 LEVEL
      * 13-13=HEADING SEG OF A NEW GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SYN             S             13    DIM(763) CTDATA PERRCD(1)
      *____________________________________________________________
      * Last SEG of each BREAK GROUP
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SEG             S              5    DIM(9)
      *____________________________________________________________
      * Last SEG of each level FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D SE1             S              3    DIM(99)
     D SE2             S              3    DIM(99)
     D SE3             S              3    DIM(99)
     D SE4             S              3    DIM(99)
     D SE5             S              3    DIM(99)
     D SE6             S              3    DIM(99)
     D SE7             S              3    DIM(99)
     D SE8             S              3    DIM(99)
      *____________________________________________________________
      * COUNTER of each SEG, LVL FROM 1 TO 8
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D RE1             S              4  0 DIM(99)
     D RE2             S              4  0 DIM(99)
     D RE3             S              4  0 DIM(99)
     D RE4             S              4  0 DIM(99)
     D RE5             S              4  0 DIM(99)
     D RE6             S              4  0 DIM(99)
     D RE7             S              4  0 DIM(99)
     D RE8             S              4  0 DIM(99)
     D                 DS
     D  TVIKEY                 1      9
     D  TVIMSG                 1      6
     D  TVISEG                 7      9
     D                 DS
     D  SYNKEY                 1     13
     D  SYNKE2                 1      9
     D  SYNMSG                 1      6
     D  SYNSRP                 7     11
     D  SYNSEG                 7      9
     D  SYNGRP                10     11  0
     D  SYNLVL                12     12  0
     D  SYNBKP                13     13
     D LDADTA         UDS          1024
     D  FE                     1    256
     D                                     DIM(256)
     D  FELT                   1    256
     D  AA                   301    380
     D                                     DIM(80)
     D  AADS                 301    380
     D  AB                   401    480
     D                                     DIM(80)
     D  ABDS                 401    480
     D  U0065                501    506
     D  SEGNAM               507    509
     D  TN                   601    602  0
     D  EOF                  603    605
     D  TEGN                 606    606
     D  LOKAHE               607    607
     D  UMN                  608    616  0
     D  UMBR                 617    626
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C     SEGSTA        TAG
     C  N91              EXSR      GETSEG
     C   91              GOTO      SLUTT
     C                   EXSR      SEGSYN
     C     SEGNAM        CABEQ     'UNB'         SLUTT
     C     SEGNAM        CABEQ     'UNH'         SLUTT
     C     SEGNAM        CABEQ     'BGM'         SLUTT
     C     SEGNAM        CABEQ     'UNT'         SLUTT
     C     SEGNAM        CABEQ     'UNZ'         SLUTT
      *
     C     SEGNAM        CASEQ     'ALC'         ALC
     C     SEGNAM        CASEQ     'CNT'         CNT
     C     SEGNAM        CASEQ     'CNI'         CNI
     C     SEGNAM        CASEQ     'COM'         COM
     C     SEGNAM        CASEQ     'CPI'         CPI
     C     SEGNAM        CASEQ     'CTA'         CTA
     C     SEGNAM        CASEQ     'CUX'         CUX
N01  C     SEGNAM        CASEQ     'DGS'         DGS
     C     SEGNAM        CASEQ     'DIM'         DIM
     C     SEGNAM        CASEQ     'DOC'         DOC
     C     SEGNAM        CASEQ     'DTM'         DTM
     C     SEGNAM        CASEQ     'EQA'         EQA
     C     SEGNAM        CASEQ     'EQD'         EQD
     C     SEGNAM        CASEQ     'EQN'         EQN
     C     SEGNAM        CASEQ     'FII'         FII
     C     SEGNAM        CASEQ     'FTX'         FTX
     C     SEGNAM        CASEQ     'GDS'         GDS
     C     SEGNAM        CASEQ     'GID'         GID
     C     SEGNAM        CASEQ     'GIN'         GIN
     C     SEGNAM        CASEQ     'GIR'         GIR
     C     SEGNAM        CASEQ     'HAN'         HAN
     C     SEGNAM        CASEQ     'IMD'         IMD
     C     SEGNAM        CASEQ     'LOC'         LOC
     C     SEGNAM        CASEQ     'LIN'         LIN
     C     SEGNAM        CASEQ     'MEA'         MEA
     C     SEGNAM        CASEQ     'MOA'         MOA
     C     SEGNAM        CASEQ     'NAD'         NAD
     C     SEGNAM        CASEQ     'PAT'         PAT
     C     SEGNAM        CASEQ     'PCD'         PCD
     C     SEGNAM        CASEQ     'PCI'         PCI
     C     SEGNAM        CASEQ     'PIA'         PIA
     C     SEGNAM        CASEQ     'PRI'         PRI
     C     SEGNAM        CASEQ     'QTY'         QTY
     C     SEGNAM        CASEQ     'RCS'         RCS
     C     SEGNAM        CASEQ     'RFF'         RFF
     C     SEGNAM        CASEQ     'RNG'         RNG
     C     SEGNAM        CASEQ     'RTE'         RTE
     C     SEGNAM        CASEQ     'SEL'         SEL
     C     SEGNAM        CASEQ     'SGP'         SGP
     C     SEGNAM        CASEQ     'STS'         STS
     C     SEGNAM        CASEQ     'TAX'         TAX
     C     SEGNAM        CASEQ     'TCC'         TCC
     C     SEGNAM        CASEQ     'TDT'         TDT
     C     SEGNAM        CASEQ     'TMD'         TMD
     C     SEGNAM        CASEQ     'TMP'         TMP
     C     SEGNAM        CASEQ     'TOD'         TOD
     C     SEGNAM        CASEQ     'TPL'         TPL
     C     SEGNAM        CASEQ     'TSR'         TSR
      *
     C                   END
     C                   GOTO      SEGSTA
     C     SLUTT         TAG
     C                   OUT       LDADTA
     C                   MOVE      *IN91         WIN91
     C                   MOVE      *IN99         WIN99
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *DTAARA       DEFINE    *LDA          LDADTA
     C                   IN        LDADTA
      * INIT AV ARBEIDSFELT
     C                   MOVE      *ZEROS        NUMVRD           15 0
     C                   MOVE      *ZEROS        NUTEGN            1 0
     C     *LIKE         DEFINE    *IN91         WIN91
     C     *LIKE         DEFINE    *IN99         WIN99
     C     *LIKE         DEFINE    SYNLVL        WL
     C                   MOVEL     'UNOC'        TABLE            10
     C                   MOVEL     '*LIBL'       LIB              10
     C                   Z-ADD     80            LEN               5 0
     C                   MOVE      *BLANKS       STRING           80
      *
      * Datafelt AB i EDIRE (80 lang) går rett inn i array AB ved READ
      * TN=81 soerger for automatisk overflyt array AB->AA ved kall av GETCH
     C                   MOVE      '0'           *IN98
      * Spesielt reserverte tegn defineres her med både grafisk verdi og
      * med en logisk verdi. Den grafiske verdien testes det mot i rutinen
      * som henter tegn. Finner denne rutinen at at tegnet er ment som en
      * spesialverdi (ikke ? foran), byttes tegnet med tilsvarende LOGISK VERDI
      * (De logiske verdiene er ikke lesbre tegn,og vil aldri forekomme i den
      * innkommende datastroemmen). '?' når brukt som opphevelse foran annet
      * spesialtegn vil bli "spist" av henterutinen (GETCH) og en vil derfor
      * kunne betrakte spoersmålstegn som grafisk tegn i resten av programmet.
      *
      * Ved andre standarder for spesialtegn er det bare å bytte verdiene til
      * de GRAFISKE tegnene her. (Programmet arbeider da med riktige verdier).
     C                   MOVE      '?'           GRASPØ            1
     C                   MOVE      '+'           GRAPLU            1
     C                   MOVE      ':'           GRAKOL            1
     C                   BITON     '123457'      GRAAPP            1
     C                   BITOFF    '06'          GRAAPP
      * Logiske verdier for spesialtegn
      * LOGAPP = slutt på segmentet. I NODI er tegnet "'".
     C                   BITON     '17'          LOGAPP            1
     C                   BITOFF    '023456'      LOGAPP
      * LOGPLU = sparasjonstegn for Tag/dataelement. I NODI er tegnet "+".
     C                   BITON     '16'          LOGPLU            1
     C                   BITOFF    '023457'      LOGPLU
      * LOGKOL = sparasjonstegn for delelement. I NODI er tegnet ":".
     C                   BITON     '167'         LOGKOL            1
     C                   BITOFF    '02345'       LOGKOL
      * LOGBLA = utenlandske måten å vise blank.
     C                   BITON     '01234567'    LOGBLA            1
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WIN91
     C                   PARM                    WIN99
     C                   MOVE      WIN91         *IN91
     C                   MOVE      WIN99         *IN99
      *____________
      * Init arrays
      *""""""""""""
     C                   MOVE      *BLANKS       SEG
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      'BGM00'       SEG(1)
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste tegn i datastroem             GETCH  /
      *////////////////////////////////////////////////////////////
     C     GETCH         BEGSR
      * Rutinen henter "TEGN" fra array AA. Ved slutten av AA "toemmes" AB inn
      * i AA. (AB benyttes kun for alltid å kunne ha "lookahead-tegn" - LOKAHE)
      * 91 settes når en ved "Toemming" finner at AB-arrayet er tomt.
      *
      * "?" spises av SR når "?" kun varsler grafisk betydning av spesialtegn.
      *Når tegn ved utgang av SR er ',+ eller :  er betydningen av ind. 98 :
      *    98 ON -> kun grafisk betydning (uforandret)
      *    98 OFF-> spesialtegn (Bytt tegn mot ikke lesbar logisk verdi LOG???)
     C                   MOVE      '0'           *IN98
     C     STACH         TAG
      * Må ny record hentes inn i array AA (fra AB)?????
     C     TN            IFEQ      81
     C     EOF           IFEQ      'YES'
     C                   SETON                                            91
     C                   GOTO      ENDCH
     C                   ENDIF
     C                   MOVE      ABDS          AADS
     C  N99UMBR          READE     EDIRE                                  99
     C  N99              EXSR      CVTCHR
     C  N99              MOVE      RDATA         ABDS
     C   99              MOVE      *BLANKS       ABDS
     C   99              MOVE      'YES'         EOF
     C                   Z-ADD     1             TN
     C                   ENDIF
      * Hent det tegn som TN peker på - Tegnet etter er "Lookahead"
     C                   MOVE      AA(TN)        TEGN
     C                   ADD       1             TN
     C     TN            IFLE      80
     C                   MOVE      AA(TN)        LOKAHE            1
     C                   ELSE
     C                   MOVE      AB(1)         LOKAHE
     C                   ENDIF
      * Dersom TEGN er "?" og LOKAHE er spes.tegn - "spis" spoersmålstegnet
      * Når 98 er on her betyr det at "?" foran spesialtegn alt er "spist"
      *        evt. nytt "?" er da grafisk tegn - LOKAHE skal da IKKE testes.
     C  N98TEGN          IFEQ      GRASPØ
     C     LOKAHE        COMP      GRAAPP                                 98
     C  N98LOKAHE        COMP      GRAPLU                                 98
     C  N98LOKAHE        COMP      GRAKOL                                 98
     C  N98LOKAHE        COMP      GRASPØ                                 98
     C   98              GOTO      STACH
     C                   END
      * Ved N98 og ',+ eller : i TEGN betyr det at det IKKE var opphevelsestegn
      * foran. Vi har med andre ord et LOGISK SPESIALTEN INNE
     C  N98TEGN          IFEQ      GRAAPP
     C                   MOVE      LOGAPP        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAPLU
     C                   MOVE      LOGPLU        TEGN
     C                   ELSE
     C     TEGN          IFEQ      GRAKOL
     C                   MOVE      LOGKOL        TEGN
     C                   ELSE
     C     TEGN          IFEQ      LOGBLA
     C                   MOVE      ' '           TEGN
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C     ENDCH         ENDSR
      *////////////////////////////////////////////////////////////
      * SR for å hente neste Segment                       GETSEG /
      *////////////////////////////////////////////////////////////
     C     GETSEG        BEGSR
      * "Spis tegn" til appostrof er lest
     C     TEGN          DOWNE     LOGAPP
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C* "Spis tegn" til første IKKE blanke
     C                   MOVEA     *BLANKS       FE
     C                   EXSR      GETCH
     C     TEGN          DOWEQ     ' '
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   ENDDO
     C                   MOVEA     TEGN          FE(1)
      * Har nå lest appostrof - de 3 neste vil være SEGMENTNAVN
     C     2             DO        3             NR                3 0
     C                   EXSR      GETCH
     C   91              GOTO      ENDSEG
     C                   MOVEA     TEGN          FE(NR)
     C                   END
     C                   MOVEL     FELT          SEGNAM
      * La TEGN være '+' etter segmentnavnet ved utgang av SR
     C                   EXSR      GETCH
      * Segmentnavn returneres nå i variabel 'SEGNAM'
     C     ENDSEG        ENDSR
      *////////////////////////////////////////////////////////////
      * Get Data Element                                   GETDED /
      *////////////////////////////////////////////////////////////
     C     GETDED        BEGSR
     C                   MOVEA     *BLANKS       FE
     C     1             DO        256           NR                3 0
     C                   EXSR      GETCH
     C     TEGN          IFEQ      LOGAPP
     C     TEGN          OREQ      LOGPLU
     C     TEGN          OREQ      LOGKOL
     C                   GOTO      ENDDED
     C                   ENDIF
     C                   MOVEA     TEGN          FE(NR)
     C                   ENDDO
     C     ENDDED        ENDSR
      *////////////////////////////////////////////////////////////
      * CVT characters                                     CVTCHR /
      *////////////////////////////////////////////////////////////
     C     CVTCHR        BEGSR
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    RDATA
     C                   PARM                    TABLE
     C                   PARM                    LIB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * GET SYNTAX OF MSG                                  GETDED /
      *////////////////////////////////////////////////////////////
     C     SEGSYN        BEGSR
      * FIND LAST BREAK SEGMENT
     C     SEG001        TAG
      *
     C                   MOVEL     U0065         SYNMSG
     C                   MOVE      '*'           SYNBKP
     C                   Z-ADD     9             WX
     C     SEG(WX)       DOWEQ     *BLANKS
     C                   SUB       1             WX
     C     WX            COMP      0                                    2020
     C  N20              ENDDO
     C     WX            IFGT      0
     C                   MOVEL     SEG(WX)       SYNSEG
     C                   MOVE      SEG(WX)       SYNGRP
     C                   Z-ADD     WX            SYNLVL
     C                   SUB       1             SYNLVL
     C                   ENDIF
     C     SYNSEG        IFEQ      *BLANKS
     C                   MOVEL     SEGNAM        SYNSEG
     C                   Z-ADD     0             SYNGRP
     C                   Z-ADD     0             SYNLVL
     C                   ENDIF
     C                   Z-ADD     WX            YX                3 0
      * POSITION TO PREVIOUS BREAK SEGMENT
     C                   Z-ADD     1             WX                3 0
     C     SYNKEY        DOWNE     SYN(WX)
     C                   ADD       1             WX
     C                   ENDDO
      * POSITION TO *CURRENT SEGMENT
     C                   MOVE      U0065         TVIMSG
     C                   MOVE      SEGNAM        TVISEG
     C     TVIKEY        DOWNE     SYNKE2
     C                   ADD       1             WX
     C     WX            IFGT      734
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   GOTO      SEG001
     C                   ELSE
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   MOVE      SYN(WX)       SYNKEY
     C                   ENDDO
      * CHECK IF THIS IS THE RIGHT SEGMENT AT RIGHT LEVEL
     C     SYNLVL        IFGE      2
     C                   MOVE      SYNKEY        WYNKEY           13
     C                   Z-ADD     SYNLVL        WL
     C                   SUB       1             WL
     C     1             DO        734
     C                   SUB       1             WX
     C                   MOVE      SYN(WX)       SYNKEY
     C     SYNLVL        IFEQ      WL
     C     SYNBKP        ANDEQ     '*'
     C                   ADD       1             WL
     C     SYNSRP        IFNE      SEG(WL)
     C     YX            IFGT      0
     C                   MOVE      *BLANKS       SEG(YX)
     C                   ENDIF
     C                   GOTO      SEG001
     C                   ELSE
     C                   MOVE      WYNKEY        SYNKEY
     C                   GOTO      SEG002
     C                   ENDIF
     C                   ENDIF
     C                   ENDDO
     C                   ENDIF
      * CLEAR ARRAY FOR ALL BREAK SEGMENTS AT *LE LEVEL
     C     SEG002        TAG
     C     SYNBKP        IFEQ      '*'
     C     SYNLVL        ADD       1             WX
     C     9             SUB       SYNLVL        WZ                3 0
     C     WX            DO        WZ            WY                3 0
     C                   MOVE      *BLANKS       SEG(WY)
     C                   ENDDO
      * ADD THIS SEGMENT TO ARRAY FOR BREAK
     C                   Z-ADD     SYNLVL        WX
     C                   ADD       1             WX
     C                   MOVEL     SYNSEG        SEG(WX)
     C                   MOVE      SYNGRP        SEG(WX)
     C                   ENDIF
      * CLEAR ARRAYS FOR SEGMENT AND REPETITIONS *LT LEVEL
     C     SYNBKP        IFEQ      '*'
     C                   SELECT
     C     SYNLVL        WHENEQ    0
     C                   MOVE      *BLANKS       SE1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE1
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP0             4 0
     C                   MOVE      *ZEROS        WREP1             4 0
     C                   MOVE      *ZEROS        WREP2             4 0
     C                   MOVE      *ZEROS        WREP3             4 0
     C                   MOVE      *ZEROS        WREP4             4 0
     C                   MOVE      *ZEROS        WREP5             4 0
     C                   MOVE      *ZEROS        WREP6             4 0
     C                   MOVE      *ZEROS        WREP7             4 0
     C                   MOVE      *ZEROS        WREP8             4 0
     C     SYNLVL        WHENEQ    1
     C                   MOVE      *BLANKS       SE2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE2
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP1
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    2
     C                   MOVE      *BLANKS       SE3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE3
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP2
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    3
     C                   MOVE      *BLANKS       SE4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE4
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP3
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    4
     C                   MOVE      *BLANKS       SE5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE5
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP4
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    5
     C                   MOVE      *BLANKS       SE6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE6
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP5
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    6
     C                   MOVE      *BLANKS       SE7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE7
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP6
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C     SYNLVL        WHENEQ    7
     C                   MOVE      *BLANKS       SE8
     C                   MOVE      *ZEROS        RE8
     C                   MOVE      *ZEROS        WREP7
     C                   MOVE      *ZEROS        WREP8
     C                   ENDSL
     C                   ENDIF
     C                   SELECT
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 1
     C     SYNLVL        WHENEQ    1
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOWNE     *BLANKS
     C     SE1(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE1(WX)
     C                   Z-ADD     1             RE1(WX)
     C                   ELSE
     C                   ADD       1             RE1(WX)
     C                   ENDIF
     C                   MOVE      RE1(WX)       WREP0
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 2
     C     SYNLVL        WHENEQ    2
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOWNE     *BLANKS
     C     SE2(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE2(WX)
     C                   Z-ADD     1             RE2(WX)
     C                   ELSE
     C                   ADD       1             RE2(WX)
     C                   ENDIF
     C                   MOVE      RE2(WX)       WREP1
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 2
     C                   Z-ADD     1             WX
     C     SE1(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(2)        WSEG              3
     C     SE1(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE1(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP0
     C                   ELSE
     C                   MOVE      RE1(WX)       WREP0
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 3
     C     SYNLVL        WHENEQ    3
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOWNE     *BLANKS
     C     SE3(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE3(WX)
     C                   Z-ADD     1             RE3(WX)
     C                   ELSE
     C                   ADD       1             RE3(WX)
     C                   ENDIF
     C                   MOVE      RE3(WX)       WREP2
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 3
     C                   Z-ADD     1             WX
     C     SE2(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(3)        WSEG
     C     SE2(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE2(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP1
     C                   ELSE
     C                   MOVE      RE2(WX)       WREP1
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 4
     C     SYNLVL        WHENEQ    4
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOWNE     *BLANKS
     C     SE4(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE4(WX)
     C                   Z-ADD     1             RE4(WX)
     C                   ELSE
     C                   ADD       1             RE4(WX)
     C                   ENDIF
     C                   MOVE      RE4(WX)       WREP3
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 4
     C                   Z-ADD     1             WX
     C     SE3(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(4)        WSEG
     C     SE3(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE3(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP2
     C                   ELSE
     C                   MOVE      RE3(WX)       WREP2
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 5
     C     SYNLVL        WHENEQ    5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOWNE     *BLANKS
     C     SE5(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE5(WX)
     C                   Z-ADD     1             RE5(WX)
     C                   ELSE
     C                   ADD       1             RE5(WX)
     C                   ENDIF
     C                   MOVE      RE5(WX)       WREP4
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE4(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE4(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE4(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP3
     C                   ELSE
     C                   MOVE      RE4(WX)       WREP3
     C                   ENDIF
      * ADD/UPDATE THIS SEGMENT AND REP LEVEL 6
     C     SYNLVL        WHENEQ    6
     C                   Z-ADD     1             WX
     C     SE6(WX)       DOWNE     *BLANKS
     C     SE6(WX)       COMP      SYNSEG                                 20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE6(WX)       IFEQ      *BLANKS
     C                   MOVEL     SYNSEG        SE6(WX)
     C                   Z-ADD     1             RE6(WX)
     C                   ELSE
     C                   ADD       1             RE6(WX)
     C                   ENDIF
     C                   MOVE      RE6(WX)       WREP5
      * GET NUMBER OF REP OF BREAK SEGMENT OVER THIS SEG LEVEL 5
     C                   Z-ADD     1             WX
     C     SE5(WX)       DOUEQ     *BLANKS
     C                   MOVEL     SEG(YX)       WSEG
     C     SE5(WX)       COMP      WSEG                                   20
     C  N20              ADD       1             WX
     C  N20              ENDDO
     C     SE5(WX)       IFEQ      *BLANKS
     C                   Z-ADD     1             WREP4
     C                   ELSE
     C                   MOVE      RE5(WX)       WREP4
     C                   ENDIF
     C                   ENDSL
     C                   ENDSR
      /COPY QEDSRC,ALC_I_03A
      /COPY QEDSRC,ALI_I_03A
      /COPY QEDSRC,APR_I_03A
      /COPY QEDSRC,CAV_I_03A
      /COPY QEDSRC,CCI_I_03A
      /COPY QEDSRC,CNI_I_03A
      /COPY QEDSRC,CNT_I_03A
      /COPY QEDSRC,COM_I_03A
      /COPY QEDSRC,CPI_I_03A
      /COPY QEDSRC,CTA_I_03A
      /COPY QEDSRC,CUX_I_03A
      /COPY QEDSRC,DGS_I_03A
      /COPY QEDSRC,DIM_I_03A
      /COPY QEDSRC,DOC_I_03A
      /COPY QEDSRC,DTM_I_03A
      /COPY QEDSRC,EQA_I_03A
      /COPY QEDSRC,EQD_I_03A
      /COPY QEDSRC,EQN_I_03A
      /COPY QEDSRC,FII_I_03A
      /COPY QEDSRC,FTX_I_03A
      /COPY QEDSRC,GDS_I_03A
      /COPY QEDSRC,GID_I_03A
      /COPY QEDSRC,GIN_I_03A
      /COPY QEDSRC,GIR_I_03A
      /COPY QEDSRC,GOR_I_03A
      /COPY QEDSRC,HAN_I_03A
      /COPY QEDSRC,IMD_I_03A
      /COPY QEDSRC,LOC_I_03A
      /COPY QEDSRC,LIN_I_03A
      /COPY QEDSRC,MEA_I_03A
      /COPY QEDSRC,MOA_I_03A
      /COPY QEDSRC,NAD_I_03A
      /COPY QEDSRC,PAC_I_03A
      /COPY QEDSRC,PAI_I_03A
      /COPY QEDSRC,PAT_I_03A
      /COPY QEDSRC,PCD_I_03A
      /COPY QEDSRC,PCI_I_03A
      /COPY QEDSRC,PIA_I_03A
      /COPY QEDSRC,PRI_I_03A
      /COPY QEDSRC,QTY_I_03A
      /COPY QEDSRC,QVR_I_03A
      /COPY QEDSRC,RCS_I_03A
      /COPY QEDSRC,RFF_I_03A
      /COPY QEDSRC,RNG_I_03A
      /COPY QEDSRC,RTE_I_03A
      /COPY QEDSRC,SCC_I_03A
      /COPY QEDSRC,SEL_I_03A
      /COPY QEDSRC,SGP_I_03A
      /COPY QEDSRC,STG_I_03A
      /COPY QEDSRC,STS_I_03A
      /COPY QEDSRC,TAX_I_03A
      /COPY QEDSRC,TCC_I_03A
      /COPY QEDSRC,TDT_I_03A
      /COPY QEDSRC,TMD_I_03A
      /COPY QEDSRC,TMP_I_03A
      /COPY QEDSRC,TOD_I_03A
      /COPY QEDSRC,TPL_I_03A
      /COPY QEDSRC,TSR_I_03A
** SYN
APERAKUNH000*
APERAKBGM000*
APERAKDTM000*
APERAKFTX001*
APERAKCNT001*
APERAKDOC011*
APERAKDTM012
APERAKRFF021*
APERAKDTM022
APERAKNAD031*
APERAKCTA032
APERAKCOM032
APERAKERC041*
APERAKFTX042
APERAKRFF051*
APERAKFTX052
APERAKUNT000*
IFCSUMUNH000*
IFCSUMBGM000*
IFCSUMDTM001*
IFCSUMMOA001*
IFCSUMFTX001*
IFCSUMCNT001*
IFCSUMPCD001*
IFCSUMGDS001*
IFCSUMRFF011*
IFCSUMDTM012
IFCSUMGOR021*
IFCSUMDTM022
IFCSUMLOC022
IFCSUMSEL022
IFCSUMFTX022
IFCSUMDOC032*
IFCSUMDTM033
IFCSUMTCC071*
IFCSUMPRI072
IFCSUMEQN072
IFCSUMPCD072
IFCSUMMOA072
IFCSUMQTY072
IFCSUMLOC072
IFCSUMTDT091*
IFCSUMDTM092
IFCSUMTSR092
IFCSUMMEA112*
IFCSUMEQN113
IFCSUMDIM122*
IFCSUMEQN123
IFCSUMCTA132*
IFCSUMCOM133
IFCSUMNAD172*
IFCSUMLOC173
IFCSUMCTA183*
IFCSUMCOM184
IFCSUMDOC193*
IFCSUMDTM194
IFCSUMTCC203*
IFCSUMPRI204
IFCSUMEQN204
IFCSUMPCD204
IFCSUMMOA204
IFCSUMQTY204
IFCSUMEQD221*
IFCSUMEQN222
IFCSUMTPL222
IFCSUMTMD222
IFCSUMMEA222
IFCSUMDIM222
IFCSUMSEL222
IFCSUMNAD222
IFCSUMLOC222
IFCSUMHAN222
IFCSUMTMP222
IFCSUMFTX222
IFCSUMRFF222
IFCSUMPCD222
IFCSUMEQA232*
IFCSUMEQN233
IFCSUMCNI261*
IFCSUMSGP272*
IFCSUMMEA283*
IFCSUMEQN284
IFCSUMTPL292*
IFCSUMMEA303*
IFCSUMEQN304
IFCSUMCTA304
IFCSUMCOM304
IFCSUMDTM304
IFCSUMCNT304
IFCSUMTSR304
IFCSUMCUX304
IFCSUMMOA304
IFCSUMFTX304
IFCSUMGDS304
IFCSUMLOC312*
IFCSUMDTM313
IFCSUMTOD322*
IFCSUMLOC323
IFCSUMRFF332*
IFCSUMDTM333
IFCSUMGOR342*
IFCSUMDTM343
IFCSUMLOC343
IFCSUMSEL343
IFCSUMFTX343
IFCSUMDOC353*
IFCSUMDTM354
IFCSUMCPI362*
IFCSUMRFF363
IFCSUMCUX363
IFCSUMLOC363
IFCSUMMOA363
IFCSUMTCC372*
IFCSUMLOC373
IFCSUMFTX373
IFCSUMCUX373
IFCSUMPRI373
IFCSUMEQN373
IFCSUMPCD373
IFCSUMMOA373
IFCSUMQTY373
IFCSUMTDT392*
IFCSUMDTM393
IFCSUMTSR393
IFCSUMLOC403*
IFCSUMDTM404
IFCSUMRFF413*
IFCSUMDTM414
IFCSUMNAD442*
IFCSUMLOC443
IFCSUMMOA443
IFCSUMCTA453*
IFCSUMCOM454
IFCSUMDOC463*
IFCSUMDTM464
IFCSUMTCC473*
IFCSUMPRI474
IFCSUMEQN474
IFCSUMPCD474
IFCSUMMOA474
IFCSUMQTY474
IFCSUMRFF483*
IFCSUMDTM484
IFCSUMCPI493*
IFCSUMRFF494
IFCSUMCUX494
IFCSUMLOC494
IFCSUMMOA494
IFCSUMTSR503*
IFCSUMRFF504
IFCSUMLOC504
IFCSUMTPL504
IFCSUMFTX504
IFCSUMGID512*
IFCSUMHAN513
IFCSUMTMP513
IFCSUMRNG513
IFCSUMTMD513
IFCSUMLOC513
IFCSUMMOA513
IFCSUMPIA513
IFCSUMFTX513
IFCSUMNAD523*
IFCSUMDTM524
IFCSUMGDS523
IFCSUMMEA533*
IFCSUMEQN534
IFCSUMDIM543*
IFCSUMEQN544
IFCSUMRFF553*
IFCSUMDTM554
IFCSUMPCI563*
IFCSUMRFF564
IFCSUMDTM564
IFCSUMGIN564
IFCSUMDOC573*
IFCSUMDTM574
IFCSUMGOR583*
IFCSUMDTM584
IFCSUMLOC584
IFCSUMSEL584
IFCSUMFTX584
IFCSUMDOC594*
IFCSUMDTM595
IFCSUMTPL603*
IFCSUMMEA614*
IFCSUMEQN615
IFCSUMSGP633*
IFCSUMMEA634*
IFCSUMEQN635
IFCSUMTCC643*
IFCSUMPRI644
IFCSUMEQN644
IFCSUMPCD644
IFCSUMMOA644
IFCSUMQTY644
IFCSUMLOC644
IFCSUMDGS663*
IFCSUMFTX664
IFCSUMCTA674*
IFCSUMCOM675
IFCSUMMEA684*
IFCSUMEQN685
IFCSUMSGP694*
IFCSUMMEA705*
IFCSUMEQN706
IFCSUMEQD712*
IFCSUMEQN713
IFCSUMTMD713
IFCSUMMEA713
IFCSUMDIM713
IFCSUMSEL713
IFCSUMTPL713
IFCSUMHAN713
IFCSUMTMP713
IFCSUMFTX713
IFCSUMTCC723*
IFCSUMPRI724
IFCSUMEQN724
IFCSUMPCD724
IFCSUMMOA724
IFCSUMQTY724
IFCSUMNAD733*
IFCSUMDTM734
IFCSUMEQA743*
IFCSUMEQN744
IFCSUMUNT000*
IFTMINUNH000*
IFTMINBGM000*
IFTMINCTA000*
IFTMINCOM001*
IFTMINDTM001*
IFTMINTSR001*
IFTMINCUX001*
IFTMINMOA001*
IFTMINFTX001*
IFTMINCNT001*
IFTMINDOC001*
IFTMINGDS001*
IFTMINLOC011*
IFTMINDTM012
IFTMINTOD021*
IFTMINLOC022
IFTMINRFF031*
IFTMINDTM032
IFTMINGOR041*
IFTMINDTM042
IFTMINLOC042
IFTMINSEL042
IFTMINFTX042
IFTMINDOC052*
IFTMINDTM053
IFTMINCPI061*
IFTMINRFF062
IFTMINCUX062
IFTMINLOC062
IFTMINMOA062
IFTMINTCC071*
IFTMINLOC072
IFTMINFTX072
IFTMINCUX072
IFTMINPRI072
IFTMINEQN072
IFTMINPCD072
IFTMINMOA072
IFTMINQTY072
IFTMINTDT081*
IFTMINDTM082
IFTMINTSR082
IFTMINLOC092*
IFTMINDTM093
IFTMINRFF102*
IFTMINDTM103
IFTMINNAD111*
IFTMINLOC112
IFTMINMOA112
IFTMINCTA122*
IFTMINCOM123
IFTMINDOC132*
IFTMINDTM133
IFTMINTCC142*
IFTMINPRI143
IFTMINEQN143
IFTMINPCD143
IFTMINMOA143
IFTMINQTY143
IFTMINRFF152*
IFTMINDTM153
IFTMINCPI162*
IFTMINCUX163
IFTMINLOC163
IFTMINMOA163
IFTMINTSR172*
IFTMINRFF173
IFTMINLOC173
IFTMINTPL173
IFTMINFTX173
IFTMINGID181*
IFTMINHAN182
IFTMINTMP182
IFTMINRNG182
IFTMINTMD182
IFTMINLOC182
IFTMINMOA182
IFTMINPIA182
IFTMINFTX182
IFTMINPCD182
IFTMINNAD192*
IFTMINDTM193
IFTMINLOC193
IFTMINGDS193
IFTMINMEA202*
IFTMINEQN203
IFTMINDIM212*
IFTMINEQN213
IFTMINRFF222*
IFTMINDTM223
IFTMINPCI232*
IFTMINRFF233
IFTMINDTM233
IFTMINGIN233
IFTMINDOC242*
IFTMINDTM243
IFTMINGOR252*
IFTMINDTM253
IFTMINLOC253
IFTMINSEL253
IFTMINFTX253
IFTMINDOC263*
IFTMINDTM264
IFTMINTPL272*
IFTMINMEA283*
IFTMINEQN284
IFTMINSGP292*
IFTMINMEA303*
IFTMINEQN304
IFTMINTCC312*
IFTMINPRI313
IFTMINEQN313
IFTMINPCD313
IFTMINMOA313
IFTMINQTY313
IFTMINLOC313
IFTMINDGS322*
IFTMINFTX323
IFTMINCTA333*
IFTMINCOM334
IFTMINMEA343*
IFTMINEQN344
IFTMINSGP353*
IFTMINMEA364*
IFTMINEQN365
IFTMINEQD371*
IFTMINEQN372
IFTMINTMD372
IFTMINMEA372
IFTMINDIM372
IFTMINSEL372
IFTMINTPL372
IFTMINHAN372
IFTMINTMP372
IFTMINFTX372
IFTMINTCC382*
IFTMINPRI383
IFTMINEQN383
IFTMINPCD383
IFTMINMOA383
IFTMINQTY383
IFTMINNAD392*
IFTMINDTM393
IFTMINCTA403*
IFTMINCOM404
IFTMINEQA412*
IFTMINEQN413
IFTMINUNT000*
IFTSTAUNH000*
IFTSTABGM000*
IFTSTADTM000*
IFTSTADTSR00*
IFTSTANAD011*
IFTSTACTA022*
IFTSTACOM023
IFTSTARFF031*
IFTSTADTM032
IFTSTALOC032
IFTSTAFTX032
IFTSTACNT032
IFTSTACNI041*
IFTSTALOC042
IFTSTACNT042
IFTSTASTS052*
IFTSTARFF053
IFTSTADTM053
IFTSTADOC053
IFTSTAFTX053
IFTSTANAD062*
IFTSTACTA072*
IFTSTACOM073
IFTSTALOC073
IFTSTAPCI073
IFTSTATDT083*
IFTSTADTM084
IFTSTARFF084
IFTSTALOC093*
IFTSTADTM094
IFTSTAEQD103*
IFTSTAMEA104
IFTSTADIM104
IFTSTASEL104
IFTSTAEQA124*
IFTSTASEL125
IFTSTAGID143*
IFTSTAHAN144
IFTSTASGP144
IFTSTADGS144
IFTSTAFTX144
IFTSTAMEA154*
IFTSTAEQN155
IFTSTADIM164*
IFTSTAEQN165
IFTSTAUNT000*
ORDERSUNH000*
ORDERSBGM000*
ORDERSDTM001*
ORDERSPAI000*
ORDERSALI001*
ORDERSIMD000*
ORDERSFTX001*
ORDERSGIR000*
ORDERSRFF011*
ORDERSDTM012
ORDERSNAD021*
ORDERSLOC022
ORDERSFII022
ORDERSRFF032*
ORDERSDTM033
ORDERSDOC042*
ORDERSDTM043
ORDERSCTA052*
ORDERSCOM053
ORDERSTAX061*
ORDERSMOA062
ORDERSLOC062
ORDERSCUX071*
ORDERSPCD072
ORDERSDTM072
ORDERSPAT081*
ORDERSDTM082
ORDERSPCD082
ORDERSMOA092*
ORDERSGIR093
ORDERSRJL093
ORDERSTDT101*
ORDERSLOC112*
ORDERSDTM113
ORDERSTOD121*
ORDERSLOC122
ORDERSPAC131*
ORDERSMEA132
ORDERSPCI142*
ORDERSRFF143
ORDERSDTM143
ORDERSGIN143
ORDERSEQD151*
ORDERSHAN152
ORDERSMEA152
ORDERSFTX152
ORDERSSCC161*
ORDERSFTX162
ORDERSRFF162
ORDERSQTY172*
ORDERSDTM173
ORDERSAPR181*
ORDERSDTM182
ORDERSRNG182
ORDERSALC191*
ORDERSALI192
ORDERSDTM192
ORDERSQTY202*
ORDERSRNG203
ORDERSPCD212*
ORDERSRNG213
ORDERSMOA222*
ORDERSRNG223
ORDERSRTE232*
ORDERSRNG233
ORDERSTAX242*
ORDERSMOA243
ORDERSRCS251*
ORDERSRFF252
ORDERSDTM252
ORDERSFTX252
ORDERSDGS261*
ORDERSFTX262
ORDERSCTA272*
ORDERSCOM273
ORDERSLIN281*
ORDERSPIA282
ORDERSIMD282
ORDERSMEA282
ORDERSQTY282
ORDERSPCD282
ORDERSALI282
ORDERSDTM282
ORDERSMOA282
ORDERSGIN282
ORDERSGIR282
ORDERSQVR282
ORDERSDOC282
ORDERSPAI282
ORDERSMID282
ORDERSFTX282
ORDERSCCI292*
ORDERSCAV293
ORDERSMEA293
ORDERSPAT302*
ORDERSDTM303
ORDERSPCD303
ORDERSMOA313*
ORDERSGIR314
ORDERSPRI322*
ORDERSCUX323
ORDERSAPR323
ORDERSRNG323
ORDERSDTM323
ORDERSRFF332*
ORDERSDTM333
ORDERSGEI333
ORDERSMOA333
ORDERSPAC342*
ORDERSMEA343
ORDERSQTY343
ORDERSDTM343
ORDERSRFF353*
ORDERSDTM354
ORDERSPCI363*
ORDERSRFF364
ORDERSDTM364
ORDERSGIN364
ORDERSLOC372*
ORDERSQTY373
ORDERSPCD373
ORDERSDTM373
ORDERSTAX382*
ORDERSMOA383
ORDERSLOC383
ORDERSNAD392*
ORDERSLOC393
ORDERSRFF403*
ORDERSDTM404
ORDERSDOC413*
ORDERSDTM414
ORDERSCTA423*
ORDERSCOM424
ORDERSALC432*
ORDERSALI433
ORDERSDTM433
ORDERSQTY443*
ORDERSRNG444
ORDERSPCD453*
ORDERSRNG454
ORDERSMOA463*
ORDERSRNG464
ORDERSRTE473*
ORDERSRNG474
ORDERSTAX483*
ORDERSMOA484
ORDERSTDT492*
ORDERSLOC503*
ORDERSDTM504
ORDERSTOD512*
ORDERSLOC513
ORDERSEQD522*
ORDERSHAN523
ORDERSMEA523
ORDERSFTX523
ORDERSSCC532*
ORDERSFTX533
ORDERSRFF533
ORDERSQTY543*
ORDERSDTM544
ORDERSRCS552*
ORDERSRFF553
ORDERSDTM553
ORDERSFTX553
ORDERSSTG562*
ORDERSQTY573*
ORDERSMOA574
ORDERSDGS582*
ORDERSFTX583
ORDERSCTA593*
ORDERSCOM594
ORDERSUNS000*
ORDERSMOA001*
ORDERSCNT001*
ORDERSALC601*
ORDERSALI602
ORDERSMOA602
ORDERSUNT000*
ORDRSPUNH000*
ORDRSPBGM000*
ORDRSPDTM001*
ORDRSPPAI000*
ORDRSPALI001*
ORDRSPIMD000*
ORDRSPFTX001*
ORDRSPGIR000*
ORDRSPRFF011*
ORDRSPDTM012
ORDRSPAJT021*
ORDRSPFTX022
ORDRSPNAD031*
ORDRSPLOC032
ORDRSPFII032
ORDRSPRFF042*
ORDRSPDTM043
ORDRSPDOC052*
ORDRSPDTM053
ORDRSPCTA062*
ORDRSPCOM063
ORDRSPTAX071*
ORDRSPMOA072
ORDRSPLOC072
ORDRSPCUX081*
ORDRSPPCD082
ORDRSPDTM082
ORDRSPPYT091*
ORDRSPDTM092
ORDRSPPCD092
ORDRSPMOA092
ORDRSPTDT101*
ORDRSPLOC112*
ORDRSPDTM113
ORDRSPTOD121*
ORDRSPLOC122
ORDRSPPAC131*
ORDRSPMEA132
ORDRSPPCI142*
ORDRSPRFF143
ORDRSPDTM143
ORDRSPGIN143
ORDRSPEQD151*
ORDRSPHAN152
ORDRSPMEA152
ORDRSPFTX152
ORDRSPSCC161*
ORDRSPFTX162
ORDRSPRFF162
ORDRSPQTY172*
ORDRSPDTM173
ORDRSPAPR181*
ORDRSPDTM182
ORDRSPRNG182
ORDRSPALC191*
ORDRSPALI192
ORDRSPDTM192
ORDRSPQTY202*
ORDRSPRNG203
ORDRSPPCD212*
ORDRSPRNG213
ORDRSPMOA222*
ORDRSPRNG223
ORDRSPRTE232*
ORDRSPRNG233
ORDRSPTAX242*
ORDRSPMOA243
ORDRSPRCS251*
ORDRSPRFF252
ORDRSPDTM252
ORDRSPFTX252
ORDRSPLIN261*
ORDRSPPIA262
ORDRSPIMD262
ORDRSPMEA262
ORDRSPQTY262
ORDRSPPCD262
ORDRSPALI262
ORDRSPDTM262
ORDRSPMOA262
ORDRSPGEI262
ORDRSPGIN262
ORDRSPGIR262
ORDRSPQVR262
ORDRSPDOC262
ORDRSPPAI262
ORDRSPMID262
ORDRSPFTX262
ORDRSPPYT282*
ORDRSPDTM283
ORDRSPPCD283
ORDRSPMOA283
ORDRSPPRI302*
ORDRSPCUX303
ORDRSPAPI303
ORDRSPRNG303
ORDRSPDTM303
ORDRSPRFF312*
ORDRSPDTM313
ORDRSPPAC322*
ORDRSPMEA323
ORDRSPQTY323
ORDRSPDTM323
ORDRSPRFF333*
ORDRSPDTM334
ORDRSPPCI343*
ORDRSPRFF344
ORDRSPDTM344
ORDRSPGIN344
ORDRSPLOC352*
ORDRSPQTY353
ORDRSPPCD353
ORDRSPDTM353
ORDRSPTAX362*
ORDRSPMOA363
ORDRSPLOC363
ORDRSPNAD372*
ORDRSPLOC373
ORDRSPFII373
ORDRSPRFF383*
ORDRSPDTM384
ORDRSPDOC393*
ORDRSPDTM394
ORDRSPCTA403*
ORDRSPCOM404
ORDRSPALC412*
ORDRSPALI413
ORDRSPDTM413
ORDRSPQTY423*
ORDRSPRNG424
ORDRSPPCD433*
ORDRSPRNG434
ORDRSPMOA443*
ORDRSPRNG444
ORDRSPRTE453*
ORDRSPRNG454
ORDRSPTAX463*
ORDRSPMOA464
ORDRSPTDT472*
ORDRSPLOC483*
ORDRSPDTM484
ORDRSPTOD492*
ORDRSPLOC493
ORDRSPEQD502*
ORDRSPHAN503
ORDRSPMEA503
ORDRSPFTX503
ORDRSPFTX473
ORDRSPSCC512*
ORDRSPFTX513
ORDRSPRFF513
ORDRSPQTY523*
ORDRSPDTM524
ORDRSPRCS532*
ORDRSPRFF533
ORDRSPDTM533
ORDRSPFTX533
ORDRSPUNS000*
ORDRSPMOA001*
ORDRSPCNT001*
ORDRSPALC561*
ORDRSPALI562
ORDRSPMOA562
ORDRSPUNT000*
