     FEDII2     IF   E           K DISK
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    LIB              10
      * Definiere Key
     C     EDIKEY        KLIST
     C                   KFLD                    WNEX
     C                   KFLD                    WNNETW
      * Definiere Workfelt
     C     *LIKE         DEFINE    INEX          WNEX
     C     *LIKE         DEFINE    INNETW        WNNETW
     C                   MOVE      'I'           WNEX
     C                   MOVE      '3'           WNNETW
      * READ ALL INTERCHANGE ID'S
     C     EDIKEY        SETLL     EDII2
     C                   MOVE      '0'           *IN51
     C     EDIKEY        READE     EDII2                                  51
     C     *IN51         DOWEQ     '0'
     C     INTCHN        IFEQ      'IBMFTP'
     C                   CALL      'E093C2'
     C                   PARM                    LIB
     C                   PARM                    INID
     C                   ENDIF
      *
     C     EDIKEY        READE     EDII2                                  51
     C  N51              ENDDO
      *
     C                   RETURN
