     FECNI93A   IF   E           K DISK
     FECOM93A   IF   E           K DISK
     FECNT93A   IF   E           K DISK
     FECTA93A   IF   E           K DISK
     FEDGS93A   IF   E           K DISK
     FEDTM93A   IF   E           K DISK
     FEEQD93A   IF   E           K DISK
     FEFTX93A   IF   E           K DISK
     FEGDS93A   IF   E           K DISK
     FEGID93A   IF   E           K DISK
     FELOC93A   IF   E           K DISK
     FEMEA93A   IF   E           K DISK
     FEMOA93A   IF   E           K DISK
     FENAD93A   IF   E           K DISK
     FEPCI93A   IF   E           K DISK
     FEQUA902   IF   E           K DISK
     FERFF93A   IF   E           K DISK
     FESEL93A   IF   E           K DISK
     FETDT93A   IF   E           K DISK
     FETMD93A   IF   E           K DISK
     FETOD93A   IF   E           K DISK
     FEUNH      IF   E           K DISK
     FE102P     O    E             PRINTER OFLIND(*IN62)
     F                                     USROPN
     FE102D     CF   E             WORKSTN
     F                                     SFILE(E102DB:ZRN)
     D A               S              1    DIM(79)
     D B               S             79    DIM(9999)
      */////////////
      * MAIN LOGIC /
      */////////////
      *___________
      * Initiering
      *"""""""""""
     C                   EXSR      INIT
      *______________
      * Clear Subfil
      *""""""""""""""
     C                   MOVE      '1'           *IN93
     C                   WRITE     E102DC
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     0             ZRN
     C                   MOVE      *BLANKS       B
      *_____________
      * Fyll Subfil
      *"""""""""""""
     C                   EXSR      RTVDB
      *________________
      * Display Subfil
      *""""""""""""""""
     C     ZALT          IFEQ      '5'
     C                   Z-ADD     1             ZRN
     C                   MOVEA     '1101'        *IN(91)
     C                   EXFMT     E102DC
     C                   ELSE
     C                   EXSR      PRTSR
     C                   END
     C                   RETURN
      *////////////////////////////////////////////////////////////
      *                                                      INIT /
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
     C     KEYMS0        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYQUA        KLIST
     C                   KFLD                    ZUALTA
     C                   KFLD                    ZUALCO
     C     *LIKE         DEFINE    DMN           ZMN
     C     *LIKE         DEFINE    DGN           ZGN0
     C     *LIKE         DEFINE    DGN           ZGN1
     C     *LIKE         DEFINE    DGN           ZGN2
     C     *LIKE         DEFINE    DGN           ZGN3
     C     *LIKE         DEFINE    DGN           ZGN4
     C     *LIKE         DEFINE    DGN           ZGN5
     C     *LIKE         DEFINE    DREP0         ZREPB0
     C     *LIKE         DEFINE    DREP0         ZREPC0
     C     *LIKE         DEFINE    DREP1         ZREPC1
     C     *LIKE         DEFINE    DREP0         ZREPD0
     C     *LIKE         DEFINE    DREP1         ZREPD1
     C     *LIKE         DEFINE    DREP2         ZREPD2
     C     *LIKE         DEFINE    DREP0         ZREPE0
     C     *LIKE         DEFINE    DREP1         ZREPE1
     C     *LIKE         DEFINE    DREP2         ZREPE2
     C     *LIKE         DEFINE    DREP3         ZREPE3
     C     *LIKE         DEFINE    DREP0         ZREPF0
     C     *LIKE         DEFINE    DREP1         ZREPF1
     C     *LIKE         DEFINE    DREP2         ZREPF2
     C     *LIKE         DEFINE    DREP3         ZREPF3
     C     *LIKE         DEFINE    DREP4         ZREPF4
     C     *LIKE         DEFINE    DREP0         ZREPG0
     C     *LIKE         DEFINE    DREP1         ZREPG1
     C     *LIKE         DEFINE    DREP2         ZREPG2
     C     *LIKE         DEFINE    DREP3         ZREPG3
     C     *LIKE         DEFINE    DREP4         ZREPG4
     C     *LIKE         DEFINE    DREP5         ZREPG5
     C     *LIKE         DEFINE    DREP0         ZREPH0
     C     *LIKE         DEFINE    DREP1         ZREPH1
     C     *LIKE         DEFINE    DREP2         ZREPH2
     C     *LIKE         DEFINE    DREP3         ZREPH3
     C     *LIKE         DEFINE    DREP4         ZREPH4
     C     *LIKE         DEFINE    DREP5         ZREPH5
     C     *LIKE         DEFINE    DREP6         ZREPH6
     C     *LIKE         DEFINE    DREP0         ZREPI0
     C     *LIKE         DEFINE    DREP1         ZREPI1
     C     *LIKE         DEFINE    DREP2         ZREPI2
     C     *LIKE         DEFINE    DREP3         ZREPI3
     C     *LIKE         DEFINE    DREP4         ZREPI4
     C     *LIKE         DEFINE    DREP5         ZREPI5
     C     *LIKE         DEFINE    DREP6         ZREPI6
     C     *LIKE         DEFINE    DREP7         ZREPI7
     C     *LIKE         DEFINE    DREP0         ZREPJ0
     C     *LIKE         DEFINE    DREP1         ZREPJ1
     C     *LIKE         DEFINE    DREP2         ZREPJ2
     C     *LIKE         DEFINE    DREP3         ZREPJ3
     C     *LIKE         DEFINE    DREP4         ZREPJ4
     C     *LIKE         DEFINE    DREP5         ZREPJ5
     C     *LIKE         DEFINE    DREP6         ZREPJ6
     C     *LIKE         DEFINE    DREP7         ZREPJ7
     C     *LIKE         DEFINE    DREP8         ZREPJ8
     C     *LIKE         DEFINE    QUALTA        ZUALTA
     C     *LIKE         DEFINE    QUALCO        ZUALCO
     C     *LIKE         DEFINE    ZRN           ZRN2
     C     *ENTRY        PLIST
     C                   PARM                    ZMN
     C                   PARM                    ZALT              1
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * RETREIVE INFO FROM EDIFACT DATABASE TO SFL          RTVDB /
      *////////////////////////////////////////////////////////////
     C     RTVDB         BEGSR
      *______
      * BGM00
      *""""""
     C     ZMN           CHAIN     EUNH                               51
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '_'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'INTERNAT'    A(1)
     C                   MOVEA     'IONAL FO'    A(9)
     C                   MOVEA     'RWARDING'    A(17)
     C                   MOVEA     ' AND CON'    A(25)
     C                   MOVEA     'SOLIDATI'    A(33)
     C                   MOVEA     'ON SUMMA'    A(41)
     C                   MOVEA     'RY MESSA'    A(49)
     C                   MOVEA     'GE'          A(57)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '"'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Document'    A(1)
     C                   MOVEA     '/Message'    A(9)
     C                   MOVEA     ' Number:'    A(17)
     C                   MOVEA     U1004         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *______
      * FTX00
      *""""""
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4451         A(1)
     C                   MOVEA     F4440A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4451'        ZUALTA
     C                   MOVEL     F4451         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     F4440A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440D        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440E        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS0        READE     EFTX93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *______
      * CNT00
      *""""""
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     C6069         A(1)
     C                   MOVEA     C6066         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6069'        ZUALTA
     C                   MOVEL     C6069         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     C6066         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS0        READE     ECNT93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *______
      * RFF01
      *""""""
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     R1153         A(1)
     C                   MOVEA     R1154         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '1153'        ZUALTA
     C                   MOVEL     R1153         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     R1154         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *______
      * TDT05
      *""""""
      *
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETDT93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '_'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'DETAILS '    A(1)
     C                   MOVEA     'OF TRANS'    A(9)
     C                   MOVEA     'PORT'        A(17)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '"'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Transpor'    A(1)
     C                   MOVEA     't Stage'     A(9)
     C                   MOVEA     T8051         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '8051'        ZUALTA
     C                   MOVEL     T8051         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Mode Of '    A(1)
     C                   MOVEA     'Transpor'    A(9)
     C                   MOVEA     't:'          A(17)
     C                   MOVEA     T8067         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '8067'        ZUALTA
     C                   MOVEL     T8067         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Transpor'    A(1)
     C                   MOVEA     't Means:'    A(9)
     C                   MOVEA     T8179         A(37)
     C                   MOVEA     T8178         A(47)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Carrier:'    A(1)
     C                   MOVEA     T3128         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC05
     C                   EXSR      DTM05
     C                   EXSR      FTX05
     C                   EXSR      MEA06
     C                   EXSR      NAD09
      *
     C     KEYMS0        READE     ETDT93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *______
      * EQD13
      *""""""
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     13            ZGN0
     C     KEYMS0        SETLL     EEQD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '_'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'EQUIPMEN'    A(1)
     C                   MOVEA     'T'           A(9)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '"'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Equipmen'    A(1)
     C                   MOVEA     't Qualif'    A(9)
     C                   MOVEA     't ier:'      A(17)
     C                   MOVEA     E8053         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '8053'        ZUALTA
     C                   MOVEL     E8053         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Equipmen'    A(1)
     C                   MOVEA     't id no:'    A(9)
     C                   MOVEA     E8260         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '8260'        ZUALTA
     C                   MOVEL     E8260         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Equipmen'    A(1)
     C                   MOVEA     't size &'    A(9)
     C                   MOVEA     'type:'       A(17)
     C                   MOVEA     E8154         A(37)
     C                   MOVEA     E8154         A(47)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      TMD13
     C                   EXSR      SEL13
      *
     C     KEYMS0        READE     EEQD93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *______
      * CNI15
      *""""""
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN0
     C     KEYMS0        SETLL     ECNI93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNI93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '_'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'CONSIGNE'    A(1)
     C                   MOVEA     'MENT INF'    A(9)
     C                   MOVEA     'ORMATION'    A(17)
     C                   MOVEA     'Consolid'    A(31)
     C                   MOVEA     'ation It'    A(39)
     C                   MOVEA     'em No:'      A(47)
     C                   MOVEA     C1490         A(67)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '"'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      MOA15
     C                   EXSR      FTX15
     C                   EXSR      LOC16
     C                   EXSR      TOD17
     C                   EXSR      RFF18
     C                   EXSR      NAD25
     C                   EXSR      GID31
      *
     C     KEYMS0        READE     ECNI93A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * CTA26                                               CTA26 /
      *////////////////////////////////////////////////////////////
     C     CTA26         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ECTA93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     C3139         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3139'        ZUALTA
     C                   MOVEL     C3139         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
      *
     C                   Z-ADD     26            ZGN3
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C     KEYMS3        CHAIN     ECOM93A                            20
     C     *IN20         IFEQ      '0'
     C                   MOVEA     C3155         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3155'        ZUALTA
     C                   MOVEL     C3155         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(37)
     C                   ENDIF
     C                   MOVEA     C3148         A(62)
     C                   ENDIF
      *
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS3        READE     ECTA93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * DGS44                                               DGS44 /
      *////////////////////////////////////////////////////////////
     C     DGS44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN2
     C     KEYMS2        SETLL     EDGS93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDGS93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     D8273         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '8273'        ZUALTA
     C                   MOVEL     D8273         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      FTX44
      *
     C     KEYMS2        READE     EDGS93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * DTM01                                               DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     D2005         A(1)
     C                   MOVEA     D2380         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '2005'        ZUALTA
     C                   MOVEL     D2005         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     D2380         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     EDTM93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * DTM05                                               DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EDTM93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     D2005         A(1)
     C                   MOVEA     D2380         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '2005'        ZUALTA
     C                   MOVEL     D2005         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     D2380         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     EDTM93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * RFF18                                               RFF18 /
      *////////////////////////////////////////////////////////////
     C     RFF18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ERFF93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     R1153         A(1)
     C                   MOVEA     R1154         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '1153'        ZUALTA
     C                   MOVEL     R1153         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     R1154         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS1        READE     ERFF93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * LOC05                                               LOC05 /
      *////////////////////////////////////////////////////////////
     C     LOC05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ELOC93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     L3227         A(1)
     C                   MOVEA     L3224         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3227'        ZUALTA
     C                   MOVEL     L3227         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     L3224         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     ELOC93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * LOC16                                               LOC16 /
      *////////////////////////////////////////////////////////////
     C     LOC16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     ELOC93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     L3227         A(1)
     C                   MOVEA     L3224         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3227'        ZUALTA
     C                   MOVEL     L3227         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     L3224         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     ELOC93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * FTX05                                               FTX05 /
      *////////////////////////////////////////////////////////////
     C     FTX05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4451         A(1)
     C                   MOVEA     F4440A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4451'        ZUALTA
     C                   MOVEL     F4451         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     F4440A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440D        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440E        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS1        READE     EFTX93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * FTX15                                               FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Free Tex'    A(1)
     C                   MOVEA     't'           A(9)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4451         A(1)
     C                   MOVEA     F4440A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4451'        ZUALTA
     C                   MOVEL     F4451         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     F4440A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440D        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440E        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS1        READE     EFTX93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * FTX33                                               FTX33 /
      *////////////////////////////////////////////////////////////
     C     FTX33         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX93A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4451         A(1)
     C                   MOVEA     F4440A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4451'        ZUALTA
     C                   MOVEL     F4451         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     F4440A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440D        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440E        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS3        READE     EFTX93A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * TMD13                                               TMD13 /
      *////////////////////////////////////////////////////////////
     C     TMD13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ETMD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Movement'    A(1)
     C                   MOVEA     ' type, c'    A(9)
     C                   MOVEA     'oded:'       A(17)
     C                   MOVEA     T8335         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     ETMD93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SEL13                                               SEL13 /
      *////////////////////////////////////////////////////////////
     C     SEL13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ESEL93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Seal num'    A(1)
     C                   MOVEA     'ber:'        A(9)
     C                   MOVEA     S9308         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     ESEL93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * FTX44                                               FTX44 /
      *////////////////////////////////////////////////////////////
     C     FTX44         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX93A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Free Tex'    A(1)
     C                   MOVEA     't'           A(9)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4451         A(1)
     C                   MOVEA     F4440A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4451'        ZUALTA
     C                   MOVEL     F4451         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     F4440A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440D        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     F4440E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     F4440E        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS3        READE     EFTX93A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * GDS33                                               GDS33 /
      *////////////////////////////////////////////////////////////
     C     GDS33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EGDS93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGDS93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     G1131         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '1131'        ZUALTA
     C                   MOVEL     G1131A        ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
      *
     C                   Z-ADD     GREP0         ZREPD0
     C                   Z-ADD     GREP1         ZREPD1
     C                   Z-ADD     GREP2         ZREPD2
     C                   EXSR      FTX33
      *
     C     KEYMS2        READE     EGDS93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * LOC17                                               LOC17 /
      *////////////////////////////////////////////////////////////
     C     LOC17         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     ELOC93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     L3227         A(1)
     C                   MOVEA     L3224         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3227'        ZUALTA
     C                   MOVEL     L3227         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     L3224         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS2        READE     ELOC93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * GID31                                               GID31 /
      *////////////////////////////////////////////////////////////
     C     GID31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     EGID93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGID93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Goods It'    A(1)
     C                   MOVEA     'em Numbe'    A(9)
     C                   MOVEA     'r:'          A(17)
     C                   MOVEA     G1496         A(20)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVE      '"'           A
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Number O'    A(1)
     C                   MOVEA     'f Packag'    A(9)
     C                   MOVEA     'es'          A(17)
     C     G7224A        IFNE      *BLANKS
     C                   MOVEA     G7224A        A(37)
     C                   MOVEA     G7064A        A(46)
     C                   ENDIF
     C     G7224B        IFNE      *BLANKS
     C                   MOVEA     G7224B        A(37)
     C                   MOVEA     G7064B        A(46)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      GDS33
     C                   EXSR      MEA34
     C                   EXSR      PCI37
     C                   EXSR      DGS44
      *
     C     KEYMS1        READE     EGID93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * MEA06                                               MEA06 /
      *////////////////////////////////////////////////////////////
     C     MEA06         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMEA93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     M6311         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6311'        ZUALTA
     C                   MOVEL     M6311         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     M6313         A(1)
     C                   MOVEA     M6411         A(56)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6313'        ZUALTA
     C                   MOVEL     M6313         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6411'        ZUALTA
     C                   MOVEL     M6411         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(56)
     C                   ENDIF
     C                   MOVEA     M6314         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     EMEA93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * MEA34                                               MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EMEA93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     M6311         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6311'        ZUALTA
     C                   MOVEL     M6311         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     M6313         A(1)
     C                   MOVEA     M6314         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6313'        ZUALTA
     C                   MOVEL     M6313         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     M6314         A(37)
     C                   ENDIF
     C                   MOVEA     M6411         A(56)
     C                   MOVEA     M6314         A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '6411'        ZUALTA
     C                   MOVEL     M6411         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(56)
     C                   MOVEA     M6314         A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS2        READE     EMEA93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * MOA15                                               MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EMOA93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     M5025         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '5025'        ZUALTA
     C                   MOVEL     M5025         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     M5004         A(37)
     C                   MOVEA     M6345         A(56)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     KEYMS1        READE     EMOA93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * NAD09                                               NAD09 /
      *////////////////////////////////////////////////////////////
     C     NAD09         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ENAD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3035         A(1)
     C                   MOVEA     N3036A        A(37)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3035'        ZUALTA
     C                   MOVEL     N3035         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   MOVEA     N3036A        A(37)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     N3042A        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042A        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3042B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042B        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3042C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042C        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3164         IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3164         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3251         IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3251         A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS1        READE     ENAD93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * NAD25                                               NAD25 /
      *////////////////////////////////////////////////////////////
     C     NAD25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     ENAD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3035         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '3035'        ZUALTA
     C                   MOVEL     N3035         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     N3124A        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3124A        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3124B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3124B        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3124C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3124C        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3124D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3124D        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3124E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3124E        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3036A        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3036A        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3042A        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042A        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3042B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042B        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3042C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3042C        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3164         IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3164         A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     N3251         IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     N3251         A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      CTA26
      *
     C     KEYMS1        READE     ENAD93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * TOD17                                               TOD17 /
      *////////////////////////////////////////////////////////////
     C     TOD17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ETOD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD93A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Terms of'    A(1)
     C                   MOVEA     ' Deliver'    A(9)
     C                   MOVEA     'y'           A(17)
     C                   MOVEA     T4053         A(37)
     C                   MOVEA     T4052         A(43)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC17
      *
      *
     C     KEYMS1        READE     ETOD93A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * PCI37                                               PCI37 /
      *////////////////////////////////////////////////////////////
     C     PCI37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EPCI93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI93A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     'Package '    A(1)
     C                   MOVEA     'identifi'    A(9)
     C                   MOVEA     'cation'      A(17)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '1'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P4233         A(1)
     C                   MOVE      *BLANKS       ZUALTA
     C                   MOVE      *BLANKS       ZUALCO
     C                   MOVEL     '4233'        ZUALTA
     C                   MOVEL     P4233         ZUALCO
     C     KEYQUA        CHAIN     EQUA902                            52
     C     *IN52         IFEQ      '0'
     C                   MOVEA     QUALTX        A(1)
     C                   ENDIF
     C                   MOVEA     P7102A        A(37)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
      *
     C     P7102B        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102B        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102C        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102C        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102D        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102D        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102E        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102E        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102F        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102F        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102G        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102G        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102H        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102H        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     P7102I        IFNE      *BLANKS
     C                   MOVE      *BLANKS       A
     C                   MOVEA     P7102I        A(1)
     C                   MOVEA     A             ZDATA
     C                   ADD       1             ZRN
     C                   MOVE      '0'           *IN41
     C                   WRITE     E102DB
     C                   MOVE      ZDATA         B(ZRN)
     C                   ENDIF
      *
     C     KEYMS2        READE     EPCI93A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * PRTSR                                               PRTSR /
      *////////////////////////////////////////////////////////////
     C     PRTSR         BEGSR
      *
     C                   MOVE      '1'           *IN62
     C                   OPEN      E102P
     C                   Z-ADD     0             ZRN2
     C     1             DO        ZRN           ZRN2
      *
     C     *IN62         IFEQ      '1'
     C                   MOVE      '0'           *IN62
     C                   WRITE     E102PA
     C                   ENDIF
     C                   MOVEA     B(ZRN2)       ZDATA
     C                   WRITE     E102PB
      *
     C                   ENDDO
     C                   WRITE     E102PC
     C                   CLOSE     E102P
      *
     C                   ENDSR
