BHRRI * BHR/RIKS - HARKODEDE avdelingsvalg
      *****************************************************************
      * MOTTAK AV IFCSUM FRA GEMSYS KUNDELÿSNING                      *
      * N≈R KODE FOR DIREKTEKJÿRING(20) ER SATT (KALLT FRA E113R_93A6)*
      * LEGGES RETT I HEADF M.M. MEN MED DISP-STATUS "E"              *
      *****************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 oppslag i NOPNR for postnr - div BHR-merking fjernet
10172 * 02 SH  PTF10 norsk text til Track and trace
      *%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
10172 * 03 JOV PTF10 SENDNR TIL FEIL FELT (= HAR IKKE V∆RT I BRUK AV BHR I LAAANG TID)
********************************************************************
     H DATEDIT(*YMD)
     FSYPROD    IF   E           K DISK
     FEDIS      IF   E           K DISK
     FEDIM      IF   E           K DISK
     FEUNB      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FETDT93A   IF   E           K DISK
     FERFF93A   IF   E           K DISK
     FECNI93A   IF   E           K DISK
     FENAD93A   IF   E           K DISK
     FETOD93A   IF   E           K DISK
     FEGID93A   IF   E           K DISK
     FEFTX93A   IF   E           K DISK
     FEMEA93A   IF   E           K DISK
     FEPCI93A   IF   E           K DISK
     FETSR93A   IF   E           K DISK
     FEEQD93A   IF   E           K DISK
     FEEQN93A   IF   E           K DISK
     FKODTRI    IF   E           K DISK
N01  FNOPNR     IF   E           K DISK
     FTELL      UF   E           K DISK
     FHEAD39    IF   E           K DISK
     F                                     RENAME(HEADFR:HEAD39R)
     FHEADF     O  A E             DISK
     FDISP      O  A E             DISK
     FDOKUFM    O  A E             DISK
     FFRISOK    O  A E             DISK
     FFREETXT   O  A E             DISK
     FDOK29     O  A E             DISK
     FTRACKF    O  A E             DISK
     FHENOP     UF A E           K DISK
     FHENOS01   UF   E           K DISK
     FHENOF01   UF   E           K DISK
     FKUNKO2    IF   E           K DISK
     D A               S              1    DIM(79)
     D B               S              1    DIM(18)
      *________________________
      * DS for decimal handling
      *""""""""""""""""""""""""
     D                 DS
     D  ZDEC                   1      7  6
     D  ZDEC6                  2      7
     D  ZHEL                  11     22  0
     D                 DS
     D  WMN2                   1      9  0
     D                 DS
     D  WPOS1                  1      3  0
     D  WPOS1A                 1      3
     D                 DS
     D  HSds                   1     30
     D  XXDATE                 1      8
     D  XXTIME                 9     14
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  DSSOK                  1     15
     D  TILTX                  1      4
     D  DSTIL                  5      7
     D  FRATX                  8     11
     D  DSFRA                 12     14
      * Track/Trace-tekster
     D TTXED1          C                   CONST('Incoming EDI prepar-
     D                                     ed from sender      ')
n02  D TTXED1L         C                   CONST('Inkommende EDI klar-
n02  D                                     gjort av avsender   ')
      *
     D TTXED2          C                   CONST('Incoming EDI reciev-
     D                                     ed                  ')
n02  D TTXED2L         C                   CONST('Inkommende EDI er -
n02  D                                     mottatt             ')
      *
     D TTXSTR          C                   CONST('Order entered (proc-
     D                                     essed from EDI-data)')
     D TTXSTRL         C                   CONST('Ordre opprettet (beha-
     D                                     ndlet fra EDI-data)')
      *
      * Tabell for konverter til store
     DupNO             c                   'ABCDEFGHIJKLMNOPQRSTUVWXYZ∆ÿ≈'
     DlowNO            c                   'abcdefghijklmnopqrstuvwxyzÊ¯Â'
      */////////////
      * MAIN LOGIC /
      */////////////
      *___________
      * Initiering
      *"""""""""""
     C                   EXSR      INIT
      *________
      * CONVERT
      *""""""""
     C                   EXSR      RTVD
      *
     C                   MOVE      '1'           *INLR
      *
      *////////////////////////////////////////////////////////////
      *                                                      INIT /
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
     C     KEYMS0        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    ZMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KUNKOK        KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    KUINTN
      *
     C     *LIKE         DEFINE    NMN           ZMN
     C     *LIKE         DEFINE    NGN           ZGN0
     C     *LIKE         DEFINE    NGN           ZGN1
     C     *LIKE         DEFINE    NREP0         ZREPB0
     C     *LIKE         DEFINE    HEVKT         HXVKT
     C     *LIKE         DEFINE    HEFBV         HXFBV
     C     *LIKE         DEFINE    HEM3          HXM3
     C     *LIKE         DEFINE    HELM          HXLM
      * INIT WORKFIELDS
      *
     C     *ENTRY        PLIST
     C                   PARM                    WMN1              9
     C                   MOVEL     WMN1          WMN2
     C                   Z-ADD     WMN2          ZMN
      * Get msg and interchange values
     C     ZMN           CHAIN     EDIM                               51
     C     MSN           CHAIN     EDIS                               51
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   MOVE      'N'           PALLJN            1
     C                   MOVEL     'SYPALL  '    PRODNA           15
     C     PRODNA        CHAIN     SYPROD                             33
     C  N33PRINST        IFEQ      'J'
     C                   MOVE      'J'           PALLJN            1
     C                   END
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * RETREIVE INFO FROM EDIFACT DATABASE TO SYSPED400     RTVD /
      *////////////////////////////////////////////////////////////
     C     RTVD          BEGSR
      *_______________________
      * READ ALL MAIN SEGMENTS
      *"""""""""""""""""""""""
      * TDT05 - TRANSPORT DETAILS
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETDT93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVEL     T8212         XXBILN           10
      *
     C  N51KEYMS0        READE     ETDT93A                                51
     C  N51              END
     C                   END
      *
      * RFF01 - FF = TURNR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     01            ZGN0
     C     KEYMS0        SETLL     ERFF93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C     R1153         IFEQ      'FF '
     C                   MOVEL     R1154         XXREFF            8
     C                   MOVE      '1'           *IN51
     C                   END
      *
     C  N51KEYMS0        READE     ERFF93A                                51
     C  N51              END
     C                   END
      *
      * DTM05 - TRANSP.DATO - HVIS INGENTING -> DAGENS DATO(MELDINGENS)
     C                   Z-ADD     MDT           XXDT              8 0
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
      *
      * NAD09 - HER BÿR!!! EN HA INN ET NAD-SEGMENT P≈ HVEM SOM ER AVS.
      * N≈ - HENTE-OPPDR.HEADER SKRIVES N≈R FÿRSTE LINJE-NAD ER LEST
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     9             ZGN0
      *
      *___________________
      * READ CONSIGNEMENTS  = LINJER
      *"""""""""""""""""""
     C                   MOVE      *ZEROS        WSLNR2            3 0
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN0
     C     KEYMS0        SETLL     ECNI93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNI93A                                51
     C     *IN51         DOWEQ     '0'
      * FINNES SENDINGEN ALLEREDE...
     C                   movel     C1004         Sndnr20          20
     C     Sndnr20       chain     Head39                             33
     C     *IN33         CABEQ     '0'           NXTCNI
      *
     C                   EXSR      RTVDB
     C                   EXSR      DELPRE
      *
     C     NXTCNI        TAG
     C     KEYMS0        READE     ECNI93A                                51
     C  N51              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
     C     DELPRE        BEGSR
      *////////////////////////////////////////////////////////////
     C                   MOVE      *zeros        XXDATE
     C                   MOVE      *zeros        XXTIME
      *__________________
      * DELETE PREADVICES
      *""""""""""""""""""
      * HEADER ER OPPDRAGSGIVER MED NEG. FORTEGN
     C                   Z-SUB     TRKNFA        XXLNR             7 0          NEGATIVT FOR
     C                   MOVEL     HXSNDN        TSTSND           20
      * Fjern Sending / tell ned(/fjern)i header -  fra Preadv.
     C     TSTSND        SETLL     HENOS01
     C     TSTSND        READE     HENOS01                                33
     C     *IN33         DOWEQ     '0'
     C     HSLNR         IFNE      XXLNR
     C                   UPDATE    HENOSR
     C                   ELSE
     C                   DELETE    HENOSR
     C* Dato / tid da preadviseet kom inn=tidspkt web-booket           3
     C                   TESTN                   XXDATE               33
     C  N33              MOVE      *zeros        XXDATE
     C                   TESTN                   XXTIME               33
     C  N33              MOVE      *zeros        XXTIME
      *
     C     HSLNR         CHAIN     HENOP                              33
     C     *IN33         IFEQ      '0'
     C                   SUB       1             HOMINT                          *ANT SND
     C                   SUB       HSANT         HOMINK                          *ANT KLL
     C                   SUB       HSVKT         HOVKT
     C                   SUB       HSM3          HOM3
     C                   SUB       HSLM          HOLM
     C     HOMINT        IFGT      0
     C                   UPDATE    HENOPR
     C                   ELSE
     C                   DELETE    HENOPR
     C                   END
     C                   END
     C                   END
     C     TSTSND        READE     HENOS01                                33
     C                   END
      *
      * Fjern Fritekster fra Preadv.
     c     HenofKey      KLIST
     c                   KFLD                    XXLNR
     c                   KFLD                    TSTSND
     C     HenofKey      SETLL     HENOF01
     C     HenofKey      READE     HENOF01                                33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    HENOFR
     C     HenofKey      READE     HENOF01                                33
     C                   END
      *
     C     UTDEL         ENDSR
      *////////////////////////////////////////////////////////////
      * RETREIVE INFO FROM EDIFACT DATABASE TO SYSPED400    RTVDB /
      *////////////////////////////////////////////////////////////
     C     RTVDB         BEGSR
      *__________________
      * INIT. DATAFELTER
      *""""""""""""""""""
     C                   CLEAR                   HEADFR
      * INNTIL VIDERE - SKRIV FRAKTBREV VED EDI-MOTTATTE OPPDRAG.
     C                   MOVE      'J'           HEPK1
      * Edi-kode... (K=Kundel¯sning, I=InternEDI, E=Ekstern EDI)
     C                   MOVE      'K'           HXEDIK
     C                   MOVE      'H'           HEUR
     C                   MOVE      'EDI'         HESG
     C                   MOVE      'HO'          TRSLAG
     C                   MOVEL     C1004         SNDN             20
S03  C*                  MOVEL     SNDN          HERFK
N03  C                   MOVEL     SNDN          HXSNDN
     C                   MOVEL     XXBILN        HEHAWB
     C                   MOVE      XXDT          HEDTR
     C                   MOVE      XXDT          HEDTOP
     C                   MOVE      XXDT          TRSDFD
     C                   MOVE      XXDT          TRSDTD
     C                   MOVE      HESG          DISIGN
     C                   MOVE      XXDT          DIDATF
     C                   MOVE      XXDT          DIDATT
     C                   MOVE      'E'           DISTA1
      *__________________
      * READ ALL SEGMENTS
      *""""""""""""""""""
     C                   Z-ADD     CREP0         ZREPB0
      * NAD25 TILDELER AVD/OPPDR.NR - DERFOR FÿRST.
     C                   EXSR      NAD25
     C                   EXSR      TSR15
     C                   EXSR      FTX15
     C                   EXSR      TOD17
     C                   EXSR      RFF18
     C                   EXSR      GID31
     C                   EXSR      FTX31
     C                   EXSR      MEA34
     C                   EXSR      PCI37
     C     PALLJN        IFEQ      'J'
     C                   EXSR      EQD13
     C                   END
      *___________________
      * WRITE TO HEADF/DISP
      *"""""""""""""""""""
     C                   WRITE     HEADFR
      *
     C                   MOVEL     'NO'          DISONF
     C                   MOVE      HESDF         DISTEF
     C                   MOVEL     'NO'          DISONT
     C                   MOVE      HESDT         DISTET
     C                   WRITE     DISPR
      *
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
      *
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * EQD13                                               EQD13 /
      *////////////////////////////////////////////////////////////
     C     EQD13         BEGSR
     C                   Z-ADD     0             ANTEQN            3 0
     C                   Z-ADD     0             EQN1              5 0
     C                   Z-ADD     0             EQN2              5 0
     C                   Z-ADD     13            ZGN0
     C                   Z-ADD     13            ZGN1
      *
     C     KEYMS0        SETLL     EEQD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD93A                                51
     C     *IN51         DOWEQ     '0'
      *
      * ETT ELLER 2 SEGMENT...
     C     E8053         IFEQ      'EFP'
     C                   Z-ADD     EREP0         ZREPB0
     C                   ADD       1             ANTEQN
     C     KEYMS1        CHAIN     EEQN93A                            33
     C     *IN33         IFEQ      '0'
     C     E6350         ANDNE     *BLANKS
     C                   CLEAR                   A
     C                   MOVEA     E6350         A
     C                   EXSR      GETNUM
      * FÿRSTE ER TIL -> TRANSP FRA KUNDE(VAREN ST≈R P≈ PALL V/HENTING)
     C     ANTEQN        IFEQ      1
     C                   Z-ADD     ZNUM          EQN1
     C                   END
      * ANDRE  ER FRA TRANSP -> KUNDE (HENTEBIL HADDE MED UT...)
     C     ANTEQN        IFEQ      2
     C                   Z-ADD     ZNUM          EQN2
     C                   END
     C                   END
     C                   END
      *
     C  N51KEYMS0        READE     EEQD93A                                51
     C  N51              END
     C                   END
     C                   MOVE      HEAVD         FSAVD
     C                   MOVE      HEOPD         FSOPD
     C                   MOVE      'DIR'         FSKODE
     C                   MOVEL     M1004         TMP402           20
     C                   MOVE      TMP402        TMP15            15
     C                   MOVEL     TMP15         FSSOK
     C                   WRITE     FRISOKR
      *
     C                   MOVE      'DIP'         FSKODE
     C                   MOVE      'TIL:'        TILTX
     C                   MOVE      'FRA:'        FRATX
     C                   MOVE      EQN1          DSTIL                             TIL TRANS
     C                   MOVE      EQN2          DSFRA                             FRA TRANS
     C                   MOVEL     DSSOK         FSSOK
     C                   WRITE     FRISOKR
      * PALLER LIGGER P≈ HEADER-NIV≈ (SUM ALLE OPPDRAG)
      * NORMALT ER DET KUN ETT OPPDRAG P≈ EN DIREKTE-KJÿRING
      * ALLE PALLENE HEKTES P≈ DET FÿRSTE OPPDRAGET, SETTER DERETTER AV
      * PALL-FLAGG JUST IN CASE DET ER FLERE OPPDRAG I MELDINGEN
     C                   MOVE      EQN1          HXPALL
     C                   MOVE      'N'           PALLJN            1
     C                   ENDSR
      *
      *
      *////////////////////////////////////////////////////////////
      * TSR15                                               TSR15 /
      *////////////////////////////////////////////////////////////
     C     TSR15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ETSR93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR93A                                52
     C     *IN52         DOWEQ     '0'
      * RMD=FARLIG (-> ADR-MERKING)  ZHO=VARME (-> IMD-MERKING)
     C                   SELECT
     C     T7085         WHENEQ    'RMD'
     C     T4065         OREQ      'RMD'
     C                   MOVEL     'X'           TRFA21                         *FARLIG
     C     T7085         WHENEQ    'ZHO'
     C     T4065         OREQ      'ZHO'
     C                   MOVEL     'X'           TRFA11                         *VARME
     C     T7085         WHENEQ    'ZPL'
     C     T4065         OREQ      'ZPL'
     C                   MOVEL     'P'           HEKDPL                         *PALL PRISET
     C     T7085         WHENEQ    'ZHP'
     C     T4065         OREQ      'ZHP'
     C                   MOVEL     'H'           HEKDPL                         *Halv-PALL PRISET
     C     T7085         WHENEQ    'ZKL'
     C     T4065         OREQ      'ZKL'
     C                   MOVEL     'K'           HEKDPL                         *KOLLIPRISET
     C     T7085         WHENEQ    'ZPG'
     C     T4065         OREQ      'ZPG'
     C                   MOVEL     'D'           HEKDPL                         *partigods/direkte
     C                   ENDSL
     C     KEYMS1        READE     ETSR93A                                52
     C                   ENDDO
      *
     C                   ENDIF
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * TOD17                                               TOD17 /
      *////////////////////////////////////////////////////////////
     C     TOD17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ETOD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD93A                                52
     C     *IN52         IFEQ      '0'
      *
     C                   SELECT
     C     T4215         WHENEQ    'CC'
     C                   MOVEL     'M'           HEFR
     C     T4215         WHENEQ    'TP'
     C                   MOVEL     'A'           HEFR
     C                   OTHER
     C                   MOVEL     'S'           HEFR
     C                   END
      *
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * RFF18                                               RFF18 /
      *////////////////////////////////////////////////////////////
     C     RFF18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ERFF93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   SELECT
      * FF     FREIGHT FORWARDERS REF
     C     R1153         WHENEQ    'FF '
     C                   MOVE      HEAVD         FSAVD
     C                   MOVE      HEOPD         FSOPD
     C                   MOVE      'FFR'         FSKODE
     C                   MOVEL     R1154         FSSOK
     C                   WRITE     FRISOKR
      * CU     CONSIGNOR'S REFERENCE NUMBER         (SENDERS REF)
     C     R1153         WHENEQ    'CU '
     C                   MOVEL     R1154         HERFA
      * AAO    CONSIGNEE'S SHIPMENT REFERENCE NUMBER(MOTTAKERS REF)
     C     R1153         WHENEQ    'AAO'
     C     HEFR          ANDEQ     'M  '
     C                   MOVEL     R1154         HERFA
     C                   ENDSL
      *
     C  N52KEYMS1        READE     ERFF93A                                52
     C  N52              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * NAD25                                               NAD25 /
      *////////////////////////////////////////////////////////////
     C     NAD25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     ENAD93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   SELECT
     C     N3035         WHENEQ    'CZ'                                         GODSAVSENDER
      * NAD
     C                   MOVEA     N3039         A
     C                   EXSR      GETNUM
     C                   MOVEL     'S'           TRKDAK
     C                   MOVEL     'X'           HEKDFK
     C                   MOVEL     'S'           TRKDFF
     C                   Z-ADD     ZNUM          TRKNFA
     C                   Z-ADD     TRKNFA        KUKUN1
     C     HEFR          IFEQ      'S  '
     C                   Z-ADD     ZNUM          HEKNSF
     C                   MOVEL     N3036A        HENASF
     C     lowNO:upNO    xlate     HENASF        HENASF
     C                   END
     C                   Z-ADD     ZNUM          HEKNS
     C                   MOVEL     N3036A        HENAS
     C     lowNO:upNO    xlate     HENAS         HENAS
     C                   MOVEL     N3036A        HENAA
     C     lowNO:upNO    xlate     HENAA         HENAA
     C                   MOVEL     N3042A        HEADS1
     C     lowNO:upNO    xlate     HEADS1        HEADS1
     C                   MOVEL     N3251         HEADS3
     C                   MOVEL     N3164         XXST25           25
     C                   MOVE      XXST25        HEADS3
     C     lowNO:upNO    xlate     HEADS3        HEADS3
     C                   MOVE      'NO'          HELKA
     C                   MOVEL     N3251         HESDF
      *
     C     N3035         WHENEQ    'CN'                                         GODSMOTTAKER
     C     N3055         IFEQ      '87'
     C                   MOVEA     N3039         A
     C                   EXSR      GETNUM
     C                   Z-ADD     ZNUM          HEKNK
     C                   ELSE
     C                   MOVEL     N3039         KUINTN
     C     KUNKOK        CHAIN     KUNKO2                             33
     C  N33              MOVE      KUKUN2        HEKNK
     C                   END
     C                   MOVEL     N3036A        HENAK
     C     HEFR          IFEQ      'M  '
     C                   Z-ADD     HEKNK         HEKNKF
     C                   MOVEL     'X'           HEKDFS
     C                   MOVEL     'K'           TRKDFF
     C                   MOVEL     N3036A        HENAKF
     C                   END
     C                   MOVEL     N3036A        HENAK
     C     lowNO:upNO    xlate     HENAK         HENAK
     C                   MOVEL     N3042A        HEADK1
     C     lowNO:upNO    xlate     HEADK1        HEADK1
     C                   MOVEL     N3251         HEADK3
     C                   MOVEL     N3164         XXST25
     C                   MOVE      XXST25        HEADK3
     C     lowNO:upNO    xlate     HEADK3        HEADK3
     C                   MOVE      'NO'          HETRI
     C                   MOVEL     N3251         HESDT
     C                   MOVEL     N3251         PNRTA             4
     C                   TESTN                   PNRTA                34
     C     *IN34         IFEQ      '1'
     C                   MOVEL     N3251         PNRT              4 0
     C                   ELSE
     C                   MOVE      *ZEROS        PNRT
     C                   END
      * ANNEN FAK.BET
     C     N3035         WHENEQ    'IV'                                         F.MOT V. ANN
     C     HEFR          IFEQ      'A  '
     C     N3055         IFEQ      '87'
     C                   MOVEA     N3039         A
     C                   EXSR      GETNUM
     C                   Z-ADD     ZNUM          HEKNSF
     C                   ELSE
     C                   MOVEL     N3039         KUINTN
     C     KUNKOK        CHAIN     KUNKO2                             33
     C  N33              MOVE      KUKUN2        HEKNSF
     C                   END
     C                   MOVEL     N3036A        HENASF
     C     lowNO:upNO    xlate     HENASF        HENASF
     C                   END
     C*
     C                   ENDSL
      *
     C     KEYMS1        READE     ENAD93A                                52
     C  N52              ENDDO
     C                   ENDIF
      *
      * ANTAR AT SENDINGER SOM SENDES OVER FRA F.EKS DRM ->OSL ER
      * UTG≈ENDE          FINN AVDELING
     C     KODRIK        KLIST
     C                   KFLD                    RITERM
     C                   KFLD                    PNRT
BHRRIC                   MOVEL     M0010         TXT08             8
BHRRIC     TXT08         IFEQ      'RIKSGODS'
BHRRIC                   MOVE      1000          RITERM                         OSLO
BHRRIC                   ELSE
BHRRIC                   MOVE      3000          RITERM                         DRAMMEN
BHRRIC                   END
      *
     C                   MOVE      *ZEROS        HEAVD
     C     PNRT          IFNE      *ZEROS
N01  C     KODRIK        CHAIN     NOPNR                              33
N01  C     *IN33         IFEQ      *OFF
N01  C     NOAVDU        ANDNE     *ZEROS
N01  C                   MOVE      NOAVDU        RIAVDU
N01  C                   MOVE      NOAVDI        RIAVDI
N01  C                   MOVE      NOAVDH        RIAVDH
N01  C                   goto      AvdOK
N01  C                   END
     C     KODRIK        SETGT     KODTRI
     C     RITERM        READPE    KODTRI                                 33
     C  N33PNRT          IFGE      RIPNRF
     C     PNRT          ANDLE     RIPNRT
N01  C     AvdOk         Tag
     C                   MOVE      RIAVDU        HEAVD
     C                   ENDIF
     C                   ENDIF
     C     HEAVD         IFEQ      *ZEROS
BHRRIC     TXT08         IFEQ      'RIKSGODS'
BHRRIC                   Z-ADD     8101          HEAVD
BHRRIC                   ELSE
BHRRIC                   Z-ADD     101           HEAVD
BHRRIC                   END
BHRRIC                   MOVEL     'OBS AVD!'    HESDL
     C                   ENDIF
      * OPPDRAG MED 00000 SKAPER KAOS - BEDRE MED 1 V/FEIL...
     C     HEAVD         CHAIN     TELL                               33
     C   33              Z-ADD     1             TEOPDN
     C                   MOVE      TEOPDN        HEOPD
     C                   ADD       1             TEOPDN
     C  N33              UPDATE    TELLR
     C                   MOVE      HEAVD         DIAVD
     C                   MOVE      HEOPD         DIOPD
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * GID31                                               GID31 /
      *////////////////////////////////////////////////////////////
     C     GID31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     EGID93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGID93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C     G1496         IFEQ      '99999'
     C                   MOVEA     G7224A        A
     C                   EXSR      GETNUM
     C                   ADD       ZNUM          HENT
     C                   MOVEL     G7065A        HEVS1
     C     HEVS1         IFEQ      *BLANKS
     C     HEVS1         OREQ      'KLI'
     C                   MOVEL     'KLL'         HEVS1
     C     HEKDPL        IFEQ      'P'
     C                   MOVEL     'PALLER'      HEVS1
     C                   END
     C                   ENDIF
     C                   ENDIF
      *
     C     KEYMS1        READE     EGID93A                                52
     C  N52              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *
      *
      *
      *////////////////////////////////////////////////////////////
      * MEA34                                               MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     EMEA93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   MOVEA     M6314         A
     C                   EXSR      GETNUM
     C                   SELECT
     C     M6311         WHENEQ    'WT '
     C                   Z-ADD     ZNUM          HEVKT
     C                   ADD       HEVKT         HXVKT
     C                   ADD       HEVKT         HXFBV
     C     M6311         WHENEQ    'LMT'
     C                   Z-ADD     ZNUM          HELM
     C                   ADD       HELM          HXLM
     C     M6311         WHENEQ    'VOL'
     C     M6411         IFEQ      'DMQ'
     C     ZNUM          DIV(H)    1000          HEM3
     C                   ELSE
     C                   Z-ADD     ZNUM          HEM3
     C                   END
     C                   ADD       HEM3          HXM3
     C                   ENDSL
      *
     C     KEYMS1        READE     EMEA93A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * PCI37                                               PCI37 /
      *////////////////////////////////////////////////////////////
     C     PCI37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C                   MOVE      *ZEROS        FMMKNR
     C     KEYMS1        SETLL     EPCI93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCI93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   MOVE      'F'           FMRI
     C                   MOVE      HEAVD         FMAVD
     C                   MOVE      HEOPD         FMOPD
     C                   Z-ADD     1             FMFBNR
     C                   MOVE      'I'           FMST
     C     P7102A        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102A        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102B        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102B        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102C        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102C        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102D        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102D        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102E        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102E        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102F        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102F        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102G        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102G        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102H        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102H        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102I        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102I        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
     C     P7102J        IFNE      *BLANKS
     C                   ADD       1             FMMKNR
     C                   MOVEL     P7102J        FMMRK1
     C                   WRITE     DOKUFMR
     C                   END
      *
     C     KEYMS1        READE     EPCI93A                                52
     C  N52              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * FTX15                                               FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   CLEAR                   FREETXTR
     C                   MOVE      HEAVD         FRTAVD
     C                   MOVE      HEOPD         FRTOPD
     C                   Z-ADD     MDT           FRTDT
     C                   CLEAR                   DOK29R
     C                   MOVE      HEAVD         D29AVD
     C                   MOVE      HEOPD         D29OPD
     C                   Z-ADD     1             D29FNR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EFTX93A                                20
     C     KEYMS1        READE     EFTX93A                                51
     C     *IN51         DOWEQ     '0'
      *
     C     F4451         IFEQ      'SIC'
     C                   MOVE      'G'           FRTKOD
      *
     C                   ADD       1             FRTLI
     C                   MOVEL     F4440A        FRTTXT
     C                   WRITE     FREETXTR
      *
     C     F4440B        IFNE      *BLANKS
     C                   ADD       1             FRTLI
     C                   MOVEL     F4440B        FRTTXT
     C                   WRITE     FREETXTR
     C                   ENDIF
     C     F4440C        IFNE      *BLANKS
     C                   ADD       1             FRTLI
     C                   MOVEL     F4440C        FRTTXT
     C                   WRITE     FREETXTR
     C                   ENDIF
     C     F4440D        IFNE      *BLANKS
     C                   ADD       1             FRTLI
     C                   MOVEL     F4440D        FRTTXT
     C                   WRITE     FREETXTR
     C                   ENDIF
     C     F4440E        IFNE      *BLANKS
     C                   ADD       1             FRTLI
     C                   MOVEL     F4440E        FRTTXT
     C                   WRITE     FREETXTR
     C                   ENDIF
     C                   ENDIF
      *
      **UNDERRETNING TIL KUNDE LEGGES RETT UT I RUBR38-FIL FOR FR.BREV
      * ALL FRITEKT P≈ DETT NIV≈ - RETT UT I RUBR38-FIL FOR FR.BREV
     C                   MOVEL     F4440A        D29TXT
     C                   WRITE     DOK29R
      *
     C     F4440B        IFNE      *BLANKS
     C                   MOVEL     F4440B        D29TXT
     C                   WRITE     DOK29R
     C                   ENDIF
     C     F4440C        IFNE      *BLANKS
     C                   MOVEL     F4440C        D29TXT
     C                   WRITE     DOK29R
     C                   ENDIF
     C     F4440D        IFNE      *BLANKS
     C                   MOVEL     F4440D        D29TXT
     C                   WRITE     DOK29R
     C                   ENDIF
     C     F4440E        IFNE      *BLANKS
     C                   MOVEL     F4440E        D29TXT
     C                   WRITE     DOK29R
     C                   ENDIF
      *
      *
     C     KEYMS1        READE     EFTX93A                                51
     C  N51              ENDDO
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * FTX31                                               FTX31 /
      *////////////////////////////////////////////////////////////
     C     FTX31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     EFTX93A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX93A                                52
     C     *IN52         DOWEQ     '0'
      *
     C     F4451         IFEQ      'AAA'
     C     HEVS1         CAT       F4440A:1      HEVS1
     C                   ENDIF
      *
     C  N52KEYMS1        READE     EFTX93A                                52
     C  N52              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Get numerical value                               GETNUM /
      *////////////////////////////////////////////////////////////
     C     GETNUM        BEGSR
     C                   MOVE      *ZEROS        ZHEL
     C                   MOVE      *ZEROS        ZDEC
     C                   MOVE      *ZEROS        B
     C                   Z-ADD     1             AX                2 0
     C                   Z-ADD     1             BX                2 0
      * Get Integer
     C     A(AX)         DOWGE     '0'
     C     ZHEL          MULT      10            ZHEL
     C                   MOVE      A(AX)         ZHEL
     C                   ADD       1             AX
     C                   ENDDO
      * Decimal point ?
     C     A(AX)         IFEQ      '.'
     C     A(AX)         OREQ      ','
     C                   ADD       1             AX
     C     A(AX)         DOWGE     '0'
     C                   MOVE      A(AX)         B(BX)
     C                   ADD       1             AX
     C                   ADD       1             BX
     C                   ENDDO
     C                   MOVEA     B             ZDEC6
     C                   ENDIF
      * Concatenate
     C                   Z-ADD     ZHEL          ZNUM             18 6
     C                   ADD       ZDEC          ZNUM
     C                   ENDSR
      *
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
      * EDI-FIL klargjort hos avsender (hentet fra EUNB)
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C     MSN           CHAIN     EUNB                               33
     C   33              MOVE      *ZEROS        U0017
     C   33              MOVE      *ZEROS        U0019
     C   33              MOVE      *ZEROS        TTDATE
     C                   MOVE      'ED1'         TTACTI
     C                   MOVEL     U0017         TST≈R             2
     C  N33TST≈R         IFGT      '43'
     C                   MOVEL     '19'          TTDATE
     C                   ELSE
     C                   MOVEL     '20'          TTDATE
     C                   END
     C                   MOVE      U0017         TTDATE
     C                   MOVEL     U0019         TTTIME
     C                   MOVE      '00'          TTTIME
     c     XXDATE        IFNE      *ZEROS
     C                   MOVE      XXDATE        TTDATE
     C                   MOVE      XXTIME        TTTIME
     c                   end
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     C                   MOVE      ULDT          TTDATL                          *LOGGFÿRING
     C                   MOVE      XULTM         TTTIML
     C                   MOVEL     U0004         TTUSER
     C                   MOVEL     TTXED1        TTTEXT
n02  C                   MOVEL     TTXED1L       TTTEXL
     C                   WRITE     TRACKFR
      * EDI-fil mottatt og logget i SYSPED/SYEDI (hentet fra EDIS)
     C                   MOVE      'ED2'         TTACTI
     C                   MOVEL     SDT           TTDATE
     C                   MOVEL     STM           TTTIME
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     C                   MOVE      ULDT          TTDATL                          *LOGGFÿRING
     C                   MOVE      XULTM         TTTIML
     C                   MOVE      *BLANKS       TTUSER
     C                   MOVEL     'SY400USR'    TTUSER
     C                   MOVEL     TTXED2        TTTEXT
n02  C                   MOVEL     TTXED2L       TTTEXL
     C                   WRITE     TRACKFR
      * Registrert (SKREVET TIL HEADF...)
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     C                   MOVE      'STR'         TTACTI
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVEL     'SY400USR'    TTUSER
     C                   MOVEL     TTXSTR        TTTEXT
N02  C                   MOVEL     TTXSTRL       TTTEXL
     C                   WRITE     TRACKFR
     C                   ENDSR
