     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FECNI921   IF   E           K DISK
     FECNT921   IF   E           K DISK
     FECOM921   IF   E           K DISK
     FECPI921   IF   E           K DISK
     FECTA921   IF   E           K DISK
     FECUX921   IF   E           K DISK
     FEDGS921   IF   E           K DISK
     FEDIM921   IF   E           K DISK
     FEDOC921   IF   E           K DISK
     FEDTM921   IF   E           K DISK
     FEEQA921   IF   E           K DISK
     FEEQD921   IF   E           K DISK
     FEEQN921   IF   E           K DISK
     FEFTX921   IF   E           K DISK
     FEGDS921   IF   E           K DISK
     FEGID921   IF   E           K DISK
     FEGOR921   IF   E           K DISK
     FEHAN921   IF   E           K DISK
     FELOC921   IF   E           K DISK
     FEMEA921   IF   E           K DISK
     FEMOA921   IF   E           K DISK
     FENAD921   IF   E           K DISK
     FEPCD921   IF   E           K DISK
     FEPCI921   IF   E           K DISK
     FEPIA921   IF   E           K DISK
     FEPRI921   IF   E           K DISK
     FEQTY921   IF   E           K DISK
     FERFF921   IF   E           K DISK
     FERNG921   IF   E           K DISK
     FESEL921   IF   E           K DISK
     FESGP921   IF   E           K DISK
     FETCC921   IF   E           K DISK
     FETDT921   IF   E           K DISK
     FETMD921   IF   E           K DISK
     FETMP921   IF   E           K DISK
     FETOD921   IF   E           K DISK
     FETPL921   IF   E           K DISK
     FETSR921   IF   E           K DISK
     FEDISE     O  A E             DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
     D TABA            S              1    DIM(32) CTDATA PERRCD(1) ASCEND
     D TABB            S              1    DIM(32) ALT(TABA)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    DMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'IFCSUM'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      MOA00
     C                   EXSR      FTX00
     C                   EXSR      CNT00
     C                   EXSR      RFF01
     C                   EXSR      GOR02
     C                   EXSR      TCC04
     C                   EXSR      TDT05
     C                   EXSR      EQD13
     C                   EXSR      CNI15
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNI GROUP:15                                       CNI15 /
      *////////////////////////////////////////////////////////////
     C     CNI15         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN0
     C     KEYMS0        SETLL     ECNI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNI921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNI
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      SGP15
     C                   EXSR      CTA15
     C                   EXSR      COM15
     C                   EXSR      DTM15
     C                   EXSR      TSR15
     C                   EXSR      CUX15
     C                   EXSR      MOA15
     C                   EXSR      FTX15
     C                   EXSR      LOC16
     C                   EXSR      TOD17
     C                   EXSR      RFF18
     C                   EXSR      GOR19
     C                   EXSR      CPI21
     C                   EXSR      TCC22
     C                   EXSR      TDT23
     C                   EXSR      NAD25
     C                   EXSR      GID31
     C                   EXSR      EQD49
      *
     C     KEYMS0        READE     ECNI921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00                                       CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:08                                       COM08 /
      *////////////////////////////////////////////////////////////
     C     COM08         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     8             ZGN2
     C     KEYMS2        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:10                                       COM10 /
      *////////////////////////////////////////////////////////////
     C     COM10         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     10            ZGN3
     C     KEYMS3        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:15                                       COM15 /
      *////////////////////////////////////////////////////////////
     C     COM15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECOM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS1        READE     ECOM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:26                                       COM26 /
      *////////////////////////////////////////////////////////////
     C     COM26         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     26            ZGN3
     C     KEYMS3        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:45                                       COM45 /
      *////////////////////////////////////////////////////////////
     C     COM45         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     45            ZGN4
     C     KEYMS4        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECOM921                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS4        READE     ECOM921                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:21                                       CPI21 /
      *////////////////////////////////////////////////////////////
     C     CPI21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     ECPI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECPI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      CUX21
     C                   EXSR      LOC21
     C                   EXSR      MOA21
      *
     C     KEYMS1        READE     ECPI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:30                                       CPI30 /
      *////////////////////////////////////////////////////////////
     C     CPI30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ECPI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECPI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      CUX30
     C                   EXSR      LOC30
     C                   EXSR      MOA30
      *
     C     KEYMS2        READE     ECPI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:08                                       CTA08 /
      *////////////////////////////////////////////////////////////
     C     CTA08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM08
      *
     C     KEYMS1        READE     ECTA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:10                                       CTA10 /
      *////////////////////////////////////////////////////////////
     C     CTA10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM10
      *
     C     KEYMS2        READE     ECTA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:15                                       CTA15 /
      *////////////////////////////////////////////////////////////
     C     CTA15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
      *
     C     KEYMS1        READE     ECTA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:26                                       CTA26 /
      *////////////////////////////////////////////////////////////
     C     CTA26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM26
      *
     C     KEYMS2        READE     ECTA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:45                                       CTA45 /
      *////////////////////////////////////////////////////////////
     C     CTA45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECTA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPE0
     C                   Z-ADD     CREP1         ZREPE1
     C                   Z-ADD     CREP2         ZREPE2
     C                   Z-ADD     CREP3         ZREPE3
     C                   EXSR      COM45
      *
     C     KEYMS3        READE     ECTA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:15                                       CUX15 /
      *////////////////////////////////////////////////////////////
     C     CUX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS1        READE     ECUX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:21                                       CUX21 /
      *////////////////////////////////////////////////////////////
     C     CUX21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:22                                       CUX22 /
      *////////////////////////////////////////////////////////////
     C     CUX22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:30                                       CUX30 /
      *////////////////////////////////////////////////////////////
     C     CUX30         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     30            ZGN3
     C     KEYMS3        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:44                                       DGS44 /
      *////////////////////////////////////////////////////////////
     C     DGS44         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     44            ZGN2
     C     KEYMS2        SETLL     EDGS921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDGS921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DGS
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      FTX44
     C                   EXSR      CTA45
     C                   EXSR      MEA46
     C                   EXSR      SGP47
      *
     C     KEYMS2        READE     EDGS921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:13                                       DIM13 /
      *////////////////////////////////////////////////////////////
     C     DIM13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EDIM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
      *
     C     KEYMS1        READE     EDIM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:07                                       DIM07 /
      *////////////////////////////////////////////////////////////
     C     DIM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDIM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      EQN07
      *
     C     KEYMS1        READE     EDIM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:35                                       DIM35 /
      *////////////////////////////////////////////////////////////
     C     DIM35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     EDIM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      EQN35
      *
     C     KEYMS2        READE     EDIM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:49                                       DIM49 /
      *////////////////////////////////////////////////////////////
     C     DIM49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EDIM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
      *
     C     KEYMS2        READE     EDIM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:03                                       DOC03 /
      *////////////////////////////////////////////////////////////
     C     DOC03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     EDOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:11                                       DOC11 /
      *////////////////////////////////////////////////////////////
     C     DOC11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM11
      *
     C     KEYMS2        READE     EDOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:20                                       DOC20 /
      *////////////////////////////////////////////////////////////
     C     DOC20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM20
      *
     C     KEYMS2        READE     EDOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:27                                       DOC27 /
      *////////////////////////////////////////////////////////////
     C     DOC27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM27
      *
     C     KEYMS2        READE     EDOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:38                                       DOC38 /
      *////////////////////////////////////////////////////////////
     C     DOC38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM38
      *
     C     KEYMS2        READE     EDOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:02                                       DTM02 /
      *////////////////////////////////////////////////////////////
     C     DTM02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:05                                       DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:11                                       DTM11 /
      *////////////////////////////////////////////////////////////
     C     DTM11         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     11            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:15                                       DTM15 /
      *////////////////////////////////////////////////////////////
     C     DTM15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:16                                       DTM16 /
      *////////////////////////////////////////////////////////////
     C     DTM16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:18                                       DTM18 /
      *////////////////////////////////////////////////////////////
     C     DTM18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:20                                       DTM20 /
      *////////////////////////////////////////////////////////////
     C     DTM20         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     20            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:23                                       DTM23 /
      *////////////////////////////////////////////////////////////
     C     DTM23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:24                                       DTM24 /
      *////////////////////////////////////////////////////////////
     C     DTM24         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     24            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:27                                       DTM27 /
      *////////////////////////////////////////////////////////////
     C     DTM27         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     27            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:29                                       DTM29 /
      *////////////////////////////////////////////////////////////
     C     DTM29         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     29            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:32                                       DTM32 /
      *////////////////////////////////////////////////////////////
     C     DTM32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     31            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:37                                       DTM37 /
      *////////////////////////////////////////////////////////////
     C     DTM37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:51                                       DTM51 /
      *////////////////////////////////////////////////////////////
     C     DTM51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:14                                       EQA14 /
      *////////////////////////////////////////////////////////////
     C     EQA14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EEQA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN14
      *
     C     KEYMS1        READE     EEQA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:52                                       EQA52 /
      *////////////////////////////////////////////////////////////
     C     EQA52         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     53            ZGN2
     C     KEYMS2        SETLL     EEQA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPD0
     C                   Z-ADD     EREP1         ZREPD1
     C                   Z-ADD     EREP2         ZREPD2
     C                   EXSR      EQN52
      *
     C     KEYMS2        READE     EEQA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:13                                       EQD13 /
      *////////////////////////////////////////////////////////////
     C     EQD13         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     13            ZGN0
     C     KEYMS0        SETLL     EEQD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      EQN13
     C                   EXSR      TMD13
     C                   EXSR      MEA13
     C                   EXSR      DIM13
     C                   EXSR      SEL13
     C                   EXSR      NAD13
     C                   EXSR      LOC13
     C                   EXSR      FTX13
     C                   EXSR      EQA14
      *
     C     KEYMS0        READE     EEQD921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:49                                       EQD49 /
      *////////////////////////////////////////////////////////////
     C     EQD49         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     49            ZGN1
     C     KEYMS1        SETLL     EEQD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN49
     C                   EXSR      TMD49
     C                   EXSR      MEA49
     C                   EXSR      DIM49
     C                   EXSR      SEL49
     C                   EXSR      TPL49
     C                   EXSR      FTX49
     C                   EXSR      TCC50
     C                   EXSR      NAD51
     C                   EXSR      EQA52
      *
     C     KEYMS1        READE     EEQD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:04                                       EQN04 /
      *////////////////////////////////////////////////////////////
     C     EQN04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:06                                       EQN06 /
      *////////////////////////////////////////////////////////////
     C     EQN06         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     6             ZGN2
     C     KEYMS2        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:07                                       EQN07 /
      *////////////////////////////////////////////////////////////
     C     EQN07         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     7             ZGN2
     C     KEYMS2        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:12                                       EQN12 /
      *////////////////////////////////////////////////////////////
     C     EQN12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:13                                       EQN13 /
      *////////////////////////////////////////////////////////////
     C     EQN13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:14                                       EQN14 /
      *////////////////////////////////////////////////////////////
     C     EQN14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:22                                       EQN22 /
      *////////////////////////////////////////////////////////////
     C     EQN22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:28                                       EQN28 /
      *////////////////////////////////////////////////////////////
     C     EQN28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:34                                       EQN34 /
      *////////////////////////////////////////////////////////////
     C     EQN34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:35                                       EQN35 /
      *////////////////////////////////////////////////////////////
     C     EQN35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:40                                       EQN40 /
      *////////////////////////////////////////////////////////////
     C     EQN40         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     40            ZGN4
     C     KEYMS4        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN921                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN921                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:42                                       EQN42 /
      *////////////////////////////////////////////////////////////
     C     EQN42         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     42            ZGN4
     C     KEYMS4        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN921                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN921                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:43                                       EQN43 /
      *////////////////////////////////////////////////////////////
     C     EQN43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:46                                       EQN46 /
      *////////////////////////////////////////////////////////////
     C     EQN46         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     46            ZGN4
     C     KEYMS4        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN921                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN921                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:48                                       EQN48 /
      *////////////////////////////////////////////////////////////
     C     EQN48         BEGSR
     C                   MOVE      '0'           *IN56
     C                   Z-ADD     48            ZGN5
     C     KEYMS5        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS5        READE     EEQN921                                56
     C     *IN56         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS5        READE     EEQN921                                56
     C  N56              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:49                                       EQN49 /
      *////////////////////////////////////////////////////////////
     C     EQN49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:50                                       EQN50 /
      *////////////////////////////////////////////////////////////
     C     EQN50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:52                                       EQN52 /
      *////////////////////////////////////////////////////////////
     C     EQN52         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     52            ZGN3
     C     KEYMS3        SETLL     EEQN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:05                                       FTX05 /
      *////////////////////////////////////////////////////////////
     C     FTX05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:13                                       FTX13 /
      *////////////////////////////////////////////////////////////
     C     FTX13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:15                                       FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:22                                       FTX22 /
      *////////////////////////////////////////////////////////////
     C     FTX22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:31                                       FTX31 /
      *////////////////////////////////////////////////////////////
     C     FTX31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:33                                       FTX33 /
      *////////////////////////////////////////////////////////////
     C     FTX33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:44                                       FTX44 /
      *////////////////////////////////////////////////////////////
     C     FTX44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:49                                       FTX49 /
      *////////////////////////////////////////////////////////////
     C     FTX49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GDS GROUP:33                                       GDS33 /
      *////////////////////////////////////////////////////////////
     C     GDS33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EGDS921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGDS921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GDS
     C                   Z-ADD     GREP0         ZREPD0
     C                   Z-ADD     GREP1         ZREPD1
     C                   Z-ADD     GREP2         ZREPD2
     C                   EXSR      FTX33
      *
     C     KEYMS2        READE     EGDS921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GID GROUP:31                                       GID31 /
      *////////////////////////////////////////////////////////////
     C     GID31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     EGID921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGID921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GID
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      HAN31
     C                   EXSR      TMP31
     C                   EXSR      RNG31
     C                   EXSR      TMD31
     C                   EXSR      LOC31
     C                   EXSR      MOA31
     C                   EXSR      PIA31
     C                   EXSR      FTX31
     C                   EXSR      NAD32
     C                   EXSR      GDS33
     C                   EXSR      MEA34
     C                   EXSR      DIM35
     C                   EXSR      RFF36
     C                   EXSR      PCI37
     C                   EXSR      DOC38
     C                   EXSR      TPL39
     C                   EXSR      SGP41
     C                   EXSR      TCC43
     C                   EXSR      DGS44
      *
     C     KEYMS1        READE     EGID921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:02                                       GOR02 /
      *////////////////////////////////////////////////////////////
     C     GOR02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     EGOR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGOR921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPB0
     C                   EXSR      DTM02
     C                   EXSR      LOC02
     C                   EXSR      SEL02
     C                   EXSR      DOC03
      *
     C     KEYMS0        READE     EGOR921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:19                                       GOR19 /
      *////////////////////////////////////////////////////////////
     C     GOR19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EGOR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGOR921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      DOC20
      *
     C     KEYMS1        READE     EGOR921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:31                                       HAN31 /
      *////////////////////////////////////////////////////////////
     C     HAN31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EHAN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:04                                       LOC04 /
      *////////////////////////////////////////////////////////////
     C     LOC04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:05                                       LOC05 /
      *////////////////////////////////////////////////////////////
     C     LOC05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:09                                       LOC09 /
      *////////////////////////////////////////////////////////////
     C     LOC09         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     9             ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:13                                       LOC13 /
      *////////////////////////////////////////////////////////////
     C     LOC13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:16                                       LOC16 /
      *////////////////////////////////////////////////////////////
     C     LOC16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM16
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:17                                       LOC17 /
      *////////////////////////////////////////////////////////////
     C     LOC17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:21                                       LOC21 /
      *////////////////////////////////////////////////////////////
     C     LOC21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:22                                       LOC22 /
      *////////////////////////////////////////////////////////////
     C     LOC22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:23                                       LOC23 /
      *////////////////////////////////////////////////////////////
     C     LOC23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:25                                       LOC25 /
      *////////////////////////////////////////////////////////////
     C     LOC25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:30                                       LOC30 /
      *////////////////////////////////////////////////////////////
     C     LOC30         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     30            ZGN3
     C     KEYMS3        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:31                                       LOC31 /
      *////////////////////////////////////////////////////////////
     C     LOC31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:43                                       LOC43 /
      *////////////////////////////////////////////////////////////
     C     LOC43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:06                                       MEA06 /
      *////////////////////////////////////////////////////////////
     C     MEA06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      EQN06
      *
     C     KEYMS1        READE     EMEA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:13                                       MEA13 /
      *////////////////////////////////////////////////////////////
     C     MEA13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:34                                       MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN34
      *
     C     KEYMS2        READE     EMEA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:40                                       MEA40 /
      *////////////////////////////////////////////////////////////
     C     MEA40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN40
      *
     C     KEYMS3        READE     EMEA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:42                                       MEA42 /
      *////////////////////////////////////////////////////////////
     C     MEA42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN42
      *
     C     KEYMS3        READE     EMEA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:46                                       MEA46 /
      *////////////////////////////////////////////////////////////
     C     MEA46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN46
      *
     C     KEYMS3        READE     EMEA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:48                                       MEA48 /
      *////////////////////////////////////////////////////////////
     C     MEA48         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     48            ZGN4
     C     KEYMS4        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMEA921                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPF0
     C                   Z-ADD     MREP1         ZREPF1
     C                   Z-ADD     MREP2         ZREPF2
     C                   Z-ADD     MREP3         ZREPF3
     C                   Z-ADD     MREP4         ZREPF4
     C                   EXSR      EQN48
      *
     C     KEYMS4        READE     EMEA921                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:49                                       MEA49 /
      *////////////////////////////////////////////////////////////
     C     MEA49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
      *
     C     KEYMS2        READE     EMEA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:00                                       MOA00 /
      *////////////////////////////////////////////////////////////
     C     MOA00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS0        READE     EMOA921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:04                                       MOA04 /
      *////////////////////////////////////////////////////////////
     C     MOA04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:12                                       MOA12 /
      *////////////////////////////////////////////////////////////
     C     MOA12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:15                                       MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:21                                       MOA21 /
      *////////////////////////////////////////////////////////////
     C     MOA21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:22                                       MOA22 /
      *////////////////////////////////////////////////////////////
     C     MOA22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:25                                       MOA25 /
      *////////////////////////////////////////////////////////////
     C     MOA25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:28                                       MOA28 /
      *////////////////////////////////////////////////////////////
     C     MOA28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:30                                       MOA30 /
      *////////////////////////////////////////////////////////////
     C     MOA30         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     30            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:31                                       MOA31 /
      *////////////////////////////////////////////////////////////
     C     MOA31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:43                                       MOA43 /
      *////////////////////////////////////////////////////////////
     C     MOA43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:50                                       MOA50 /
      *////////////////////////////////////////////////////////////
     C     MOA50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:09                                       NAD09 /
      *////////////////////////////////////////////////////////////
     C     NAD09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC09
     C                   EXSR      CTA10
     C                   EXSR      DOC11
     C                   EXSR      TCC12
      *
     C     KEYMS1        READE     ENAD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:13                                       NAD13 /
      *////////////////////////////////////////////////////////////
     C     NAD13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
      *
     C     KEYMS1        READE     ENAD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:25                                       NAD25 /
      *////////////////////////////////////////////////////////////
     C     NAD25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC25
     C                   EXSR      MOA25
     C                   EXSR      CTA26
     C                   EXSR      DOC27
     C                   EXSR      TCC28
     C                   EXSR      RFF29
     C                   EXSR      CPI30
      *
     C     KEYMS1        READE     ENAD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:32                                       NAD32 /
      *////////////////////////////////////////////////////////////
     C     NAD32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM32
      *
     C     KEYMS2        READE     ENAD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:51                                       NAD51 /
      *////////////////////////////////////////////////////////////
     C     NAD51         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     51            ZGN2
     C     KEYMS2        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM51
      *
     C     KEYMS2        READE     ENAD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:04                                       PCD04 /
      *////////////////////////////////////////////////////////////
     C     PCD04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:12                                       PCD12 /
      *////////////////////////////////////////////////////////////
     C     PCD12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:22                                       PCD22 /
      *////////////////////////////////////////////////////////////
     C     PCD22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:28                                       PCD28 /
      *////////////////////////////////////////////////////////////
     C     PCD28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:43                                       PCD43 /
      *////////////////////////////////////////////////////////////
     C     PCD43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:50                                       PCD50 /
      *////////////////////////////////////////////////////////////
     C     PCD50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:37                                       PCI37 /
      *////////////////////////////////////////////////////////////
     C     PCI37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EPCI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      RFF37
     C                   EXSR      DTM37
      *
     C     KEYMS2        READE     EPCI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:31                                       PIA31 /
      *////////////////////////////////////////////////////////////
     C     PIA31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EPIA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:04                                       PRI04 /
      *////////////////////////////////////////////////////////////
     C     PRI04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS1        READE     EPRI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:12                                       PRI12 /
      *////////////////////////////////////////////////////////////
     C     PRI12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:22                                       PRI22 /
      *////////////////////////////////////////////////////////////
     C     PRI22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:28                                       PRI28 /
      *////////////////////////////////////////////////////////////
     C     PRI28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:43                                       PRI43 /
      *////////////////////////////////////////////////////////////
     C     PRI43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:50                                       PRI50 /
      *////////////////////////////////////////////////////////////
     C     PRI50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:04                                       QTY04 /
      *////////////////////////////////////////////////////////////
     C     QTY04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:12                                       QTY12 /
      *////////////////////////////////////////////////////////////
     C     QTY12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:22                                       QTY22 /
      *////////////////////////////////////////////////////////////
     C     QTY22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:28                                       QTY28 /
      *////////////////////////////////////////////////////////////
     C     QTY28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:43                                       QTY43 /
      *////////////////////////////////////////////////////////////
     C     QTY43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:50                                       QTY50 /
      *////////////////////////////////////////////////////////////
     C     QTY50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:18                                       RFF18 /
      *////////////////////////////////////////////////////////////
     C     RFF18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM18
      *
     C     KEYMS1        READE     ERFF921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:24                                       RFF24 /
      *////////////////////////////////////////////////////////////
     C     RFF24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM24
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:29                                       RFF29 /
      *////////////////////////////////////////////////////////////
     C     RFF29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM29
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:33                                       RFF33 /
      *////////////////////////////////////////////////////////////
     C     RFF33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:36                                       RFF36 /
      *////////////////////////////////////////////////////////////
     C     RFF36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM36
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:37                                       RFF37 /
      *////////////////////////////////////////////////////////////
     C     RFF37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:31                                       RNG31 /
      *////////////////////////////////////////////////////////////
     C     RNG31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:02                                       SEL02 /
      *////////////////////////////////////////////////////////////
     C     SEL02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ESEL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:05                                       SEL05 /
      *////////////////////////////////////////////////////////////
     C     SEL05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ESEL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:13                                       SEL13 /
      *////////////////////////////////////////////////////////////
     C     SEL13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ESEL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:49                                       SEL49 /
      *////////////////////////////////////////////////////////////
     C     SEL49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ESEL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESEL921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS2        READE     ESEL921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:15                                       SGP15 /
      *////////////////////////////////////////////////////////////
     C     SGP15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ESGP921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESGP921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SGP
      *
     C     KEYMS1        READE     ESGP921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:41                                       SGP41 /
      *////////////////////////////////////////////////////////////
     C     SGP41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ESGP921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESGP921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA42
      *
     C     KEYMS2        READE     ESGP921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:47                                       SGP47 /
      *////////////////////////////////////////////////////////////
     C     SGP47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     ESGP921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ESGP921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPE0
     C                   Z-ADD     SREP1         ZREPE1
     C                   Z-ADD     SREP2         ZREPE2
     C                   Z-ADD     SREP3         ZREPE3
     C                   EXSR      MEA48
      *
     C     KEYMS3        READE     ESGP921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:04                                       TCC04 /
      *////////////////////////////////////////////////////////////
     C     TCC04         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     4             ZGN0
     C     KEYMS0        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETCC921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      PRI04
     C                   EXSR      EQN04
     C                   EXSR      PCD04
     C                   EXSR      MOA04
     C                   EXSR      QTY04
     C                   EXSR      LOC04
      *
     C     KEYMS0        READE     ETCC921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:12                                       TCC12 /
      *////////////////////////////////////////////////////////////
     C     TCC12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI12
     C                   EXSR      EQN12
     C                   EXSR      PCD12
     C                   EXSR      MOA12
     C                   EXSR      QTY12
      *
     C     KEYMS2        READE     ETCC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:22                                       TCC22 /
      *////////////////////////////////////////////////////////////
     C     TCC22         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     22            ZGN1
     C     KEYMS1        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC22
     C                   EXSR      FTX22
     C                   EXSR      CUX22
     C                   EXSR      PRI22
     C                   EXSR      EQN22
     C                   EXSR      PCD22
     C                   EXSR      MOA22
     C                   EXSR      QTY22
      *
     C     KEYMS1        READE     ETCC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:28                                       TCC28 /
      *////////////////////////////////////////////////////////////
     C     TCC28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI28
     C                   EXSR      EQN28
     C                   EXSR      PCD28
     C                   EXSR      MOA28
     C                   EXSR      QTY28
      *
     C     KEYMS2        READE     ETCC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:43                                       TCC43 /
      *////////////////////////////////////////////////////////////
     C     TCC43         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     43            ZGN2
     C     KEYMS2        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI43
     C                   EXSR      EQN43
     C                   EXSR      PCD43
     C                   EXSR      MOA43
     C                   EXSR      QTY43
     C                   EXSR      LOC43
      *
     C     KEYMS2        READE     ETCC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:50                                       TCC50 /
      *////////////////////////////////////////////////////////////
     C     TCC50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     ETCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI50
     C                   EXSR      EQN50
     C                   EXSR      PCD50
     C                   EXSR      MOA50
     C                   EXSR      QTY50
      *
     C     KEYMS2        READE     ETCC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:05                                       TDT05 /
      *////////////////////////////////////////////////////////////
     C     TDT05         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETDT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      TSR05
     C                   EXSR      LOC05
     C                   EXSR      DTM05
     C                   EXSR      SEL05
     C                   EXSR      FTX05
     C                   EXSR      MEA06
     C                   EXSR      DIM07
     C                   EXSR      CTA08
     C                   EXSR      NAD09
      *
     C     KEYMS0        READE     ETDT921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:23                                       TDT23 /
      *////////////////////////////////////////////////////////////
     C     TDT23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     ETDT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      DTM23
     C                   EXSR      TSR23
     C                   EXSR      LOC23
     C                   EXSR      RFF24
      *
     C     KEYMS1        READE     ETDT921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:13                                       TMD92 /
      *////////////////////////////////////////////////////////////
     C     TMD13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ETMD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS1        READE     ETMD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:31                                       TMD31 /
      *////////////////////////////////////////////////////////////
     C     TMD31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ETMD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:49                                       TMD49 /
      *////////////////////////////////////////////////////////////
     C     TMD49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ETMD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:31                                       TMP31 /
      *////////////////////////////////////////////////////////////
     C     TMP31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ETMP921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMP921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETMP921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:17                                       TOD17 /
      *////////////////////////////////////////////////////////////
     C     TOD17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ETOD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC17
      *
     C     KEYMS1        READE     ETOD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:39                                       TPL39 /
      *////////////////////////////////////////////////////////////
     C     TPL39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     ETPL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MEA40
      *
     C     KEYMS2        READE     ETPL921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:49                                       TPL49 /
      *////////////////////////////////////////////////////////////
     C     TPL49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ETPL921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
      *
     C     KEYMS2        READE     ETPL921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:05                                       TSR05 /
      *////////////////////////////////////////////////////////////
     C     TSR05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ETSR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:15                                       TSR15 /
      *////////////////////////////////////////////////////////////
     C     TSR15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ETSR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:23                                       TSR23 /
      *////////////////////////////////////////////////////////////
     C     TSR23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     ETSR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETSR921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS2        READE     ETSR921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Convert character                                                I
     C     WCHAR         LOOKUP    TABA          TABB                     83
     C     *IN83         IFEQ      '1'
     C                   MOVE      TABB          WCHAR
     C                   ENDIF
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
      /COPY QEDSRC,CNI_O_921
      /COPY QEDSRC,CNT_O_921
      /COPY QEDSRC,COM_O_921
      /COPY QEDSRC,CPI_O_921
      /COPY QEDSRC,CTA_O_921
      /COPY QEDSRC,CUX_O_921
      /COPY QEDSRC,DGS_O_921
      /COPY QEDSRC,DIM_O_921
      /COPY QEDSRC,DOC_O_921
      /COPY QEDSRC,DTM_O_921
      /COPY QEDSRC,EQA_O_921
      /COPY QEDSRC,EQD_O_921
      /COPY QEDSRC,EQN_O_921
      /COPY QEDSRC,FTX_O_921
      /COPY QEDSRC,GDS_O_921
      /COPY QEDSRC,GID_O_921
      /COPY QEDSRC,GOR_O_921
      /COPY QEDSRC,HAN_O_921
      /COPY QEDSRC,LOC_O_921
      /COPY QEDSRC,MEA_O_921
      /COPY QEDSRC,MOA_O_921
      /COPY QEDSRC,NAD_O_921
      /COPY QEDSRC,PCD_O_921
      /COPY QEDSRC,PCI_O_921
      /COPY QEDSRC,PIA_O_921
      /COPY QEDSRC,PRI_O_921
      /COPY QEDSRC,QTY_O_921
      /COPY QEDSRC,RFF_O_921
      /COPY QEDSRC,RNG_O_921
      /COPY QEDSRC,SEL_O_921
      /COPY QEDSRC,SGP_O_921
      /COPY QEDSRC,TCC_O_921
      /COPY QEDSRC,TDT_O_921
      /COPY QEDSRC,TMD_O_921
      /COPY QEDSRC,TMP_O_921
      /COPY QEDSRC,TOD_O_921
      /COPY QEDSRC,TPL_O_921
      /COPY QEDSRC,TSR_O_921
** TABA/TABB
ÅA
øO
ÆE
ØO
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
æE
åA
