     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FECNI94B   IF   E           K DISK
     FECNT94B   IF   E           K DISK
     FECOM94B   IF   E           K DISK
     FECPI94B   IF   E           K DISK
     FECTA94B   IF   E           K DISK
     FECUX94B   IF   E           K DISK
     FEDGS94B   IF   E           K DISK
     FEDIM94B   IF   E           K DISK
     FEDOC94B   IF   E           K DISK
     FEDTM94B   IF   E           K DISK
     FEEQA94B   IF   E           K DISK
     FEEQD94B   IF   E           K DISK
     FEEQN94B   IF   E           K DISK
     FEFTX94B   IF   E           K DISK
     FEGDS94B   IF   E           K DISK
     FEGID94B   IF   E           K DISK
     FEGOR94B   IF   E           K DISK
     FEHAN94B   IF   E           K DISK
     FELOC94B   IF   E           K DISK
     FEMEA94B   IF   E           K DISK
     FEMOA94B   IF   E           K DISK
     FENAD94B   IF   E           K DISK
     FEPCD94B   IF   E           K DISK
     FEPCI94B   IF   E           K DISK
     FEPIA94B   IF   E           K DISK
     FEPRI94B   IF   E           K DISK
     FEQTY94B   IF   E           K DISK
     FERFF94B   IF   E           K DISK
     FERNG94B   IF   E           K DISK
     FESEL94B   IF   E           K DISK
     FESGP94B   IF   E           K DISK
     FETCC94B   IF   E           K DISK
     FETDT94B   IF   E           K DISK
     FETMD94B   IF   E           K DISK
     FETMP94B   IF   E           K DISK
     FETOD94B   IF   E           K DISK
     FETPL94B   IF   E           K DISK
     FETSR94B   IF   E           K DISK
     FEDISE     O  A E             DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
     D TABA            S              1    DIM(32) CTDATA PERRCD(1) ASCEND
     D TABB            S              1    DIM(32) ALT(TABA)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    DMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'IFCSUM'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      MOA00
     C                   EXSR      FTX00
     C                   EXSR      CNT00
     C                   EXSR      RFF01
     C                   EXSR      GOR02
     C                   EXSR      TCC04
     C                   EXSR      TDT05
     C                   EXSR      EQD13
     C                   EXSR      CNI15
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNI GROUP:15                                       CNI15 /
      *////////////////////////////////////////////////////////////
     C     CNI15         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN0
     C     KEYMS0        SETLL     ECNI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNI94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNI
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      SGP16
     C                   EXSR      CTA15
     C                   EXSR      COM15
     C                   EXSR      DTM15
     C                   EXSR      TSR15
     C                   EXSR      CUX15
     C                   EXSR      MOA15
     C                   EXSR      FTX15
     C                   EXSR      LOC20
     C                   EXSR      TOD21
     C                   EXSR      RFF22
     C                   EXSR      GOR23
     C                   EXSR      CPI25
     C                   EXSR      TCC26
     C                   EXSR      TDT27
     C                   EXSR      NAD30
     C                   EXSR      GID37
     C                   EXSR      EQD56
      *
     C     KEYMS0        READE     ECNI94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00                                       CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:08                                       COM08 /
      *////////////////////////////////////////////////////////////
     C     COM08         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     8             ZGN2
     C     KEYMS2        SETLL     ECOM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:10                                       COM10 /
      *////////////////////////////////////////////////////////////
     C     COM10         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     10            ZGN3
     C     KEYMS3        SETLL     ECOM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:15                                       COM15 /
      *////////////////////////////////////////////////////////////
     C     COM15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECOM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECOM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS1        READE     ECOM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:31                                       COM31 /
      *////////////////////////////////////////////////////////////
     C     COM31         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     31            ZGN3
     C     KEYMS3        SETLL     ECOM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:52                                       COM52 /
      *////////////////////////////////////////////////////////////
     C     COM52         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     52            ZGN4
     C     KEYMS4        SETLL     ECOM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECOM94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS4        READE     ECOM94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:25                                       CPI25 /
      *////////////////////////////////////////////////////////////
     C     CPI25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     ECPI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECPI94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      CUX25
     C                   EXSR      LOC25
     C                   EXSR      MOA25
      *
     C     KEYMS1        READE     ECPI94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:35                                       CPI35 /
      *////////////////////////////////////////////////////////////
     C     CPI35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ECPI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECPI94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      CUX35
     C                   EXSR      LOC35
     C                   EXSR      MOA35
      *
     C     KEYMS2        READE     ECPI94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:08                                       CTA08 /
      *////////////////////////////////////////////////////////////
     C     CTA08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ECTA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM08
      *
     C     KEYMS1        READE     ECTA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:10                                       CTA10 /
      *////////////////////////////////////////////////////////////
     C     CTA10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     ECTA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM10
      *
     C     KEYMS2        READE     ECTA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:15                                       CTA15 /
      *////////////////////////////////////////////////////////////
     C     CTA15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECTA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
      *
     C     KEYMS1        READE     ECTA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:31                                       CTA31 /
      *////////////////////////////////////////////////////////////
     C     CTA31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ECTA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM31
      *
     C     KEYMS2        READE     ECTA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:52                                       CTA52 /
      *////////////////////////////////////////////////////////////
     C     CTA52         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     52            ZGN3
     C     KEYMS3        SETLL     ECTA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECTA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPE0
     C                   Z-ADD     CREP1         ZREPE1
     C                   Z-ADD     CREP2         ZREPE2
     C                   Z-ADD     CREP3         ZREPE3
     C                   EXSR      COM52
      *
     C     KEYMS3        READE     ECTA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:15                                       CUX15 /
      *////////////////////////////////////////////////////////////
     C     CUX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ECUX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS1        READE     ECUX94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:25                                       CUX25 /
      *////////////////////////////////////////////////////////////
     C     CUX25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ECUX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:26                                       CUX26 /
      *////////////////////////////////////////////////////////////
     C     CUX26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ECUX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:35                                       CUX35 /
      *////////////////////////////////////////////////////////////
     C     CUX35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     ECUX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:51                                       DGS51 /
      *////////////////////////////////////////////////////////////
     C     DGS51         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     51            ZGN2
     C     KEYMS2        SETLL     EDGS94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDGS94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DGS
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      FTX51
     C                   EXSR      CTA52
     C                   EXSR      MEA53
     C                   EXSR      SGP54
      *
     C     KEYMS2        READE     EDGS94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:13                                       DIM13 /
      *////////////////////////////////////////////////////////////
     C     DIM13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EDIM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
      *
     C     KEYMS1        READE     EDIM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:07                                       DIM07 /
      *////////////////////////////////////////////////////////////
     C     DIM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDIM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      EQN07
      *
     C     KEYMS1        READE     EDIM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:40                                       DIM40 /
      *////////////////////////////////////////////////////////////
     C     DIM40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     EDIM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      EQN40
      *
     C     KEYMS2        READE     EDIM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:56                                       DIM56 /
      *////////////////////////////////////////////////////////////
     C     DIM56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EDIM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
      *
     C     KEYMS2        READE     EDIM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:03                                       DOC03 /
      *////////////////////////////////////////////////////////////
     C     DOC03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     EDOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:11                                       DOC11 /
      *////////////////////////////////////////////////////////////
     C     DOC11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM11
      *
     C     KEYMS2        READE     EDOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:24                                       DOC24 /
      *////////////////////////////////////////////////////////////
     C     DOC24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM24
      *
     C     KEYMS2        READE     EDOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:32                                       DOC32 /
      *////////////////////////////////////////////////////////////
     C     DOC32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM32
      *
     C     KEYMS2        READE     EDOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:43                                       DOC43 /
      *////////////////////////////////////////////////////////////
     C     DOC43         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     43            ZGN2
     C     KEYMS2        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM43
      *
     C     KEYMS2        READE     EDOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:45                                       DOC45 /
      *////////////////////////////////////////////////////////////
     C     DOC45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EDOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDOC94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPE0
     C                   Z-ADD     DREP1         ZREPE1
     C                   Z-ADD     DREP2         ZREPE2
     C                   Z-ADD     DREP3         ZREPE3
     C                   EXSR      DTM45
      *
     C     KEYMS3        READE     EDOC94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:02                                       DTM02 /
      *////////////////////////////////////////////////////////////
     C     DTM02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:05                                       DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:11                                       DTM11 /
      *////////////////////////////////////////////////////////////
     C     DTM11         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     11            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:15                                       DTM15 /
      *////////////////////////////////////////////////////////////
     C     DTM15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:20                                       DTM20 /
      *////////////////////////////////////////////////////////////
     C     DTM20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:22                                       DTM22 /
      *////////////////////////////////////////////////////////////
     C     DTM22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:24                                       DTM24 /
      *////////////////////////////////////////////////////////////
     C     DTM24         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     24            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:27                                       DTM27 /
      *////////////////////////////////////////////////////////////
     C     DTM27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:29                                       DTM29 /
      *////////////////////////////////////////////////////////////
     C     DTM29         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     29            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:32                                       DTM32 /
      *////////////////////////////////////////////////////////////
     C     DTM32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     32            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:34                                       DTM34 /
      *////////////////////////////////////////////////////////////
     C     DTM34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:41                                       DTM41 /
      *////////////////////////////////////////////////////////////
     C     DTM41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:42                                       DTM42 /
      *////////////////////////////////////////////////////////////
     C     DTM42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:43                                       DTM43 /
      *////////////////////////////////////////////////////////////
     C     DTM43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:44                                       DTM44 /
      *////////////////////////////////////////////////////////////
     C     DTM44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:45                                       DTM45 /
      *////////////////////////////////////////////////////////////
     C     DTM45         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     45            ZGN4
     C     KEYMS4        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EDTM94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS4        READE     EDTM94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:58                                       DTM58 /
      *////////////////////////////////////////////////////////////
     C     DTM58         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     58            ZGN3
     C     KEYMS3        SETLL     EDTM94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:14                                       EQA14 /
      *////////////////////////////////////////////////////////////
     C     EQA14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EEQA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN14
      *
     C     KEYMS1        READE     EEQA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:59                                       EQA59 /
      *////////////////////////////////////////////////////////////
     C     EQA59         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     59            ZGN2
     C     KEYMS2        SETLL     EEQA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPD0
     C                   Z-ADD     EREP1         ZREPD1
     C                   Z-ADD     EREP2         ZREPD2
     C                   EXSR      EQN59
      *
     C     KEYMS2        READE     EEQA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:13                                       EQD13 /
      *////////////////////////////////////////////////////////////
     C     EQD13         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     13            ZGN0
     C     KEYMS0        SETLL     EEQD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      EQN13
     C                   EXSR      TMD13
     C                   EXSR      MEA13
     C                   EXSR      DIM13
     C                   EXSR      SEL13
     C                   EXSR      NAD13
     C                   EXSR      LOC13
     C                   EXSR      FTX13
     C                   EXSR      EQA14
      *
     C     KEYMS0        READE     EEQD94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:56                                       EQD56 /
      *////////////////////////////////////////////////////////////
     C     EQD56         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     56            ZGN1
     C     KEYMS1        SETLL     EEQD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN56
     C                   EXSR      TMD56
     C                   EXSR      MEA56
     C                   EXSR      DIM56
     C                   EXSR      SEL56
     C                   EXSR      TPL56
     C                   EXSR      HAN56
     C                   EXSR      TMP56
     C                   EXSR      FTX56
     C                   EXSR      TCC57
     C                   EXSR      NAD58
     C                   EXSR      EQA59
      *
     C     KEYMS1        READE     EEQD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:04                                       EQN04 /
      *////////////////////////////////////////////////////////////
     C     EQN04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:06                                       EQN06 /
      *////////////////////////////////////////////////////////////
     C     EQN06         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     6             ZGN2
     C     KEYMS2        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:07                                       EQN07 /
      *////////////////////////////////////////////////////////////
     C     EQN07         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     7             ZGN2
     C     KEYMS2        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:12                                       EQN12 /
      *////////////////////////////////////////////////////////////
     C     EQN12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:13                                       EQN13 /
      *////////////////////////////////////////////////////////////
     C     EQN13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:14                                       EQN14 /
      *////////////////////////////////////////////////////////////
     C     EQN14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:17                                       EQN17 /
      *////////////////////////////////////////////////////////////
     C     EQN17         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     17            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:26                                       EQN26 /
      *////////////////////////////////////////////////////////////
     C     EQN26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:33                                       EQN33 /
      *////////////////////////////////////////////////////////////
     C     EQN33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:39                                       EQN39 /
      *////////////////////////////////////////////////////////////
     C     EQN39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:40                                       EQN40 /
      *////////////////////////////////////////////////////////////
     C     EQN40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:47                                       EQN47 /
      *////////////////////////////////////////////////////////////
     C     EQN47         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     47            ZGN4
     C     KEYMS4        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:49                                       EQN49 /
      *////////////////////////////////////////////////////////////
     C     EQN49         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     49            ZGN4
     C     KEYMS4        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:50                                       EQN50 /
      *////////////////////////////////////////////////////////////
     C     EQN50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:53                                       EQN53 /
      *////////////////////////////////////////////////////////////
     C     EQN53         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     53            ZGN4
     C     KEYMS4        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:55                                       EQN55 /
      *////////////////////////////////////////////////////////////
     C     EQN55         BEGSR
     C                   MOVE      '0'           *IN56
     C                   Z-ADD     55            ZGN5
     C     KEYMS5        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS5        READE     EEQN94B                                56
     C     *IN56         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS5        READE     EEQN94B                                56
     C  N56              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:56                                       EQN56 /
      *////////////////////////////////////////////////////////////
     C     EQN56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:57                                       EQN57 /
      *////////////////////////////////////////////////////////////
     C     EQN57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:59                                       EQN59 /
      *////////////////////////////////////////////////////////////
     C     EQN59         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     59            ZGN3
     C     KEYMS3        SETLL     EEQN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:05                                       FTX05 /
      *////////////////////////////////////////////////////////////
     C     FTX05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:13                                       FTX13 /
      *////////////////////////////////////////////////////////////
     C     FTX13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:15                                       FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:26                                       FTX26 /
      *////////////////////////////////////////////////////////////
     C     FTX26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:36                                       FTX36 /
      *////////////////////////////////////////////////////////////
     C     FTX36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:37                                       FTX37 /
      *////////////////////////////////////////////////////////////
     C     FTX37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:44                                       FTX44 /
      *////////////////////////////////////////////////////////////
     C     FTX44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:51                                       FTX51 /
      *////////////////////////////////////////////////////////////
     C     FTX51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:56                                       FTX56 /
      *////////////////////////////////////////////////////////////
     C     FTX56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EFTX94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GDS GROUP:37                                       GDS37 /
      *////////////////////////////////////////////////////////////
     C     GDS37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EGDS94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGDS94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GDS
     C                   Z-ADD     GREP0         ZREPD0
     C                   Z-ADD     GREP1         ZREPD1
     C                   Z-ADD     GREP2         ZREPD2
      *
     C     KEYMS2        READE     EGDS94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GID GROUP:37                                       GID37 /
      *////////////////////////////////////////////////////////////
     C     GID37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EGID94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGID94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GID
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      HAN37
     C                   EXSR      TMP37
     C                   EXSR      RNG37
     C                   EXSR      TMD37
     C                   EXSR      LOC37
     C                   EXSR      MOA37
     C                   EXSR      PIA37
     C                   EXSR      FTX37
     C                   EXSR      NAD38
     C                   EXSR      GDS37
     C                   EXSR      MEA39
     C                   EXSR      DIM40
     C                   EXSR      RFF41
     C                   EXSR      PCI42
     C                   EXSR      DOC43
     C                   EXSR      GOR44
     C                   EXSR      TPL46
     C                   EXSR      SGP48
     C                   EXSR      TCC50
     C                   EXSR      DGS51
      *
     C     KEYMS1        READE     EGID94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:02                                       GOR02 /
      *////////////////////////////////////////////////////////////
     C     GOR02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     EGOR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGOR94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPB0
     C                   EXSR      DTM02
     C                   EXSR      LOC02
     C                   EXSR      SEL02
     C                   EXSR      DOC03
      *
     C     KEYMS0        READE     EGOR94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:23                                       GOR23 /
      *////////////////////////////////////////////////////////////
     C     GOR23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     EGOR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGOR94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      DOC24
      *
     C     KEYMS1        READE     EGOR94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:44                                       GOR44 /
      *////////////////////////////////////////////////////////////
     C     GOR44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EGOR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EGOR94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPE0
     C                   Z-ADD     GREP1         ZREPE1
     C                   Z-ADD     GREP2         ZREPE2
     C                   Z-ADD     GREP3         ZREPE3
     C                   EXSR      DTM44
     C                   EXSR      LOC44
     C                   EXSR      SEL44
     C                   EXSR      FTX44
     C                   EXSR      DOC45
      *
     C     KEYMS3        READE     EGOR94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:37                                       HAN37 /
      *////////////////////////////////////////////////////////////
     C     HAN37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EHAN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:56                                       HAN56 /
      *////////////////////////////////////////////////////////////
     C     HAN56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EHAN94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:04                                       LOC04 /
      *////////////////////////////////////////////////////////////
     C     LOC04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:05                                       LOC05 /
      *////////////////////////////////////////////////////////////
     C     LOC05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:09                                       LOC09 /
      *////////////////////////////////////////////////////////////
     C     LOC09         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     9             ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:13                                       LOC13 /
      *////////////////////////////////////////////////////////////
     C     LOC13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:20                                       LOC20 /
      *////////////////////////////////////////////////////////////
     C     LOC20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM20
      *
     C     KEYMS1        READE     ELOC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:21                                       LOC21 /
      *////////////////////////////////////////////////////////////
     C     LOC21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:25                                       LOC25 /
      *////////////////////////////////////////////////////////////
     C     LOC25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:26                                       LOC26 /
      *////////////////////////////////////////////////////////////
     C     LOC26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:28                                       LOC28 /
      *////////////////////////////////////////////////////////////
     C     LOC28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:30                                       LOC30 /
      *////////////////////////////////////////////////////////////
     C     LOC30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:35                                       LOC35 /
      *////////////////////////////////////////////////////////////
     C     LOC35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:36                                       LOC36 /
      *////////////////////////////////////////////////////////////
     C     LOC36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:37                                       LOC37 /
      *////////////////////////////////////////////////////////////
     C     LOC37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:44                                       LOC44 /
      *////////////////////////////////////////////////////////////
     C     LOC44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:50                                       LOC50 /
      *////////////////////////////////////////////////////////////
     C     LOC50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     ELOC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:06                                       MEA06 /
      *////////////////////////////////////////////////////////////
     C     MEA06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      EQN06
      *
     C     KEYMS1        READE     EMEA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:13                                       MEA13 /
      *////////////////////////////////////////////////////////////
     C     MEA13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:17                                       MEA17 /
      *////////////////////////////////////////////////////////////
     C     MEA17         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     17            ZGN3
     C     KEYMS3        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN17
      *
     C     KEYMS3        READE     EMEA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:39                                       MEA39 /
      *////////////////////////////////////////////////////////////
     C     MEA39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN39
      *
     C     KEYMS2        READE     EMEA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:47                                       MEA47 /
      *////////////////////////////////////////////////////////////
     C     MEA47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN47
      *
     C     KEYMS3        READE     EMEA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:49                                       MEA49 /
      *////////////////////////////////////////////////////////////
     C     MEA49         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     49            ZGN3
     C     KEYMS3        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN49
      *
     C     KEYMS3        READE     EMEA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:53                                       MEA53 /
      *////////////////////////////////////////////////////////////
     C     MEA53         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     53            ZGN3
     C     KEYMS3        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN53
      *
     C     KEYMS3        READE     EMEA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:55                                       MEA55 /
      *////////////////////////////////////////////////////////////
     C     MEA55         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     55            ZGN4
     C     KEYMS4        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMEA94B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPF0
     C                   Z-ADD     MREP1         ZREPF1
     C                   Z-ADD     MREP2         ZREPF2
     C                   Z-ADD     MREP3         ZREPF3
     C                   Z-ADD     MREP4         ZREPF4
     C                   EXSR      EQN55
      *
     C     KEYMS4        READE     EMEA94B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:56                                       MEA56 /
      *////////////////////////////////////////////////////////////
     C     MEA56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EMEA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
      *
     C     KEYMS2        READE     EMEA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:00                                       MOA00 /
      *////////////////////////////////////////////////////////////
     C     MOA00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS0        READE     EMOA94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:04                                       MOA04 /
      *////////////////////////////////////////////////////////////
     C     MOA04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:12                                       MOA12 /
      *////////////////////////////////////////////////////////////
     C     MOA12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:15                                       MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:25                                       MOA25 /
      *////////////////////////////////////////////////////////////
     C     MOA25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA94B                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:26                                       MOA26 /
      *////////////////////////////////////////////////////////////
     C     MOA26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA94B                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:30                                       MOA30 /
      *////////////////////////////////////////////////////////////
     C     MOA30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:33                                       MOA33 /
      *////////////////////////////////////////////////////////////
     C     MOA33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:35                                       MOA35 /
      *////////////////////////////////////////////////////////////
     C     MOA35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:37                                       MOA37 /
      *////////////////////////////////////////////////////////////
     C     MOA37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA94B                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:50                                       MOA50 /
      *////////////////////////////////////////////////////////////
     C     MOA50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:57                                       MOA57 /
      *////////////////////////////////////////////////////////////
     C     MOA57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EMOA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:09                                       NAD09 /
      *////////////////////////////////////////////////////////////
     C     NAD09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ENAD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC09
     C                   EXSR      CTA10
     C                   EXSR      DOC11
     C                   EXSR      TCC12
      *
     C     KEYMS1        READE     ENAD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:13                                       NAD13 /
      *////////////////////////////////////////////////////////////
     C     NAD13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ENAD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
      *
     C     KEYMS1        READE     ENAD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:30                                       NAD30 /
      *////////////////////////////////////////////////////////////
     C     NAD30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     ENAD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC30
     C                   EXSR      MOA30
     C                   EXSR      CTA31
     C                   EXSR      DOC32
     C                   EXSR      TCC33
     C                   EXSR      RFF34
     C                   EXSR      CPI35
     C                   EXSR      TSR36
      *
     C     KEYMS1        READE     ENAD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:38                                       NAD38 /
      *////////////////////////////////////////////////////////////
     C     NAD38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     ENAD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM38
      *
     C     KEYMS2        READE     ENAD94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:58                                       NAD58 /
      *////////////////////////////////////////////////////////////
     C     NAD58         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     58            ZGN2
     C     KEYMS2        SETLL     ENAD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM58
      *
     C     KEYMS2        READE     ENAD94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:04                                       PCD04 /
      *////////////////////////////////////////////////////////////
     C     PCD04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:12                                       PCD12 /
      *////////////////////////////////////////////////////////////
     C     PCD12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:26                                       PCD26 /
      *////////////////////////////////////////////////////////////
     C     PCD26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:33                                       PCD33 /
      *////////////////////////////////////////////////////////////
     C     PCD33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:50                                       PCD50 /
      *////////////////////////////////////////////////////////////
     C     PCD50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:57                                       PCD57 /
      *////////////////////////////////////////////////////////////
     C     PCD57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EPCD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:42                                       PCI42 /
      *////////////////////////////////////////////////////////////
     C     PCI42         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     42            ZGN2
     C     KEYMS2        SETLL     EPCI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      RFF42
     C                   EXSR      DTM42
      *
     C     KEYMS2        READE     EPCI94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:37                                       PIA37 /
      *////////////////////////////////////////////////////////////
     C     PIA37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EPIA94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:04                                       PRI04 /
      *////////////////////////////////////////////////////////////
     C     PRI04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS1        READE     EPRI94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:12                                       PRI12 /
      *////////////////////////////////////////////////////////////
     C     PRI12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:26                                       PRI26 /
      *////////////////////////////////////////////////////////////
     C     PRI26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:33                                       PRI33 /
      *////////////////////////////////////////////////////////////
     C     PRI33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:50                                       PRI50 /
      *////////////////////////////////////////////////////////////
     C     PRI50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:57                                       PRI57 /
      *////////////////////////////////////////////////////////////
     C     PRI57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EPRI94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:04                                       QTY04 /
      *////////////////////////////////////////////////////////////
     C     QTY04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:12                                       QTY12 /
      *////////////////////////////////////////////////////////////
     C     QTY12         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     12            ZGN3
     C     KEYMS3        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:26                                       QTY26 /
      *////////////////////////////////////////////////////////////
     C     QTY26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:33                                       QTY33 /
      *////////////////////////////////////////////////////////////
     C     QTY33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:50                                       QTY50 /
      *////////////////////////////////////////////////////////////
     C     QTY50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:57                                       QTY57 /
      *////////////////////////////////////////////////////////////
     C     QTY57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EQTY94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:22                                       RFF22 /
      *////////////////////////////////////////////////////////////
     C     RFF22         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     22            ZGN1
     C     KEYMS1        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM22
      *
     C     KEYMS1        READE     ERFF94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:29                                       RFF29 /
      *////////////////////////////////////////////////////////////
     C     RFF29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM29
      *
     C     KEYMS2        READE     ERFF94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:33                                       RFF33 /
      *////////////////////////////////////////////////////////////
     C     RFF33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:34                                       RFF34 /
      *////////////////////////////////////////////////////////////
     C     RFF34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM34
      *
     C     KEYMS2        READE     ERFF94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:36                                       RFF36 /
      *////////////////////////////////////////////////////////////
     C     RFF36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:41                                       RFF41 /
      *////////////////////////////////////////////////////////////
     C     RFF41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM41
      *
     C     KEYMS2        READE     ERFF94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:42                                       RFF42 /
      *////////////////////////////////////////////////////////////
     C     RFF42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     ERFF94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:37                                       RNG37 /
      *////////////////////////////////////////////////////////////
     C     RNG37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ERNG94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:02                                       SEL02 /
      *////////////////////////////////////////////////////////////
     C     SEL02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ESEL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:05                                       SEL05 /
      *////////////////////////////////////////////////////////////
     C     SEL05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ESEL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:13                                       SEL13 /
      *////////////////////////////////////////////////////////////
     C     SEL13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ESEL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:44                                       SEL44 /
      *////////////////////////////////////////////////////////////
     C     SEL44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     ESEL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ESEL94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS3        READE     ESEL94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:56                                       SEL56 /
      *////////////////////////////////////////////////////////////
     C     SEL56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     ESEL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESEL94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS2        READE     ESEL94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:16                                       SGP16 /
      *////////////////////////////////////////////////////////////
     C     SGP16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS1        SETLL     ESGP94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESGP94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA17
      *
     C     KEYMS1        READE     ESGP94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:48                                       SGP48 /
      *////////////////////////////////////////////////////////////
     C     SGP48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     ESGP94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESGP94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA49
      *
     C     KEYMS2        READE     ESGP94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:54                                       SGP54 /
      *////////////////////////////////////////////////////////////
     C     SGP54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     ESGP94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ESGP94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPE0
     C                   Z-ADD     SREP1         ZREPE1
     C                   Z-ADD     SREP2         ZREPE2
     C                   Z-ADD     SREP3         ZREPE3
     C                   EXSR      MEA55
      *
     C     KEYMS3        READE     ESGP94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:04                                       TCC04 /
      *////////////////////////////////////////////////////////////
     C     TCC04         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     4             ZGN0
     C     KEYMS0        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETCC94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      PRI04
     C                   EXSR      EQN04
     C                   EXSR      PCD04
     C                   EXSR      MOA04
     C                   EXSR      QTY04
     C                   EXSR      LOC04
      *
     C     KEYMS0        READE     ETCC94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:12                                       TCC12 /
      *////////////////////////////////////////////////////////////
     C     TCC12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI12
     C                   EXSR      EQN12
     C                   EXSR      PCD12
     C                   EXSR      MOA12
     C                   EXSR      QTY12
      *
     C     KEYMS2        READE     ETCC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:26                                       TCC26 /
      *////////////////////////////////////////////////////////////
     C     TCC26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC26
     C                   EXSR      FTX26
     C                   EXSR      CUX26
     C                   EXSR      PRI26
     C                   EXSR      EQN26
     C                   EXSR      PCD26
     C                   EXSR      MOA26
     C                   EXSR      QTY26
      *
     C     KEYMS1        READE     ETCC94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:33                                       TCC33 /
      *////////////////////////////////////////////////////////////
     C     TCC33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI33
     C                   EXSR      EQN33
     C                   EXSR      PCD33
     C                   EXSR      MOA33
     C                   EXSR      QTY33
      *
     C     KEYMS2        READE     ETCC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:50                                       TCC50 /
      *////////////////////////////////////////////////////////////
     C     TCC50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI50
     C                   EXSR      EQN50
     C                   EXSR      PCD50
     C                   EXSR      MOA50
     C                   EXSR      QTY50
     C                   EXSR      LOC50
      *
     C     KEYMS2        READE     ETCC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:57                                       TCC57 /
      *////////////////////////////////////////////////////////////
     C     TCC57         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     57            ZGN2
     C     KEYMS2        SETLL     ETCC94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI57
     C                   EXSR      EQN57
     C                   EXSR      PCD57
     C                   EXSR      MOA57
     C                   EXSR      QTY57
      *
     C     KEYMS2        READE     ETCC94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:05                                       TDT05 /
      *////////////////////////////////////////////////////////////
     C     TDT05         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETDT94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT94B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      TSR05
     C                   EXSR      LOC05
     C                   EXSR      DTM05
     C                   EXSR      SEL05
     C                   EXSR      FTX05
     C                   EXSR      MEA06
     C                   EXSR      DIM07
     C                   EXSR      CTA08
     C                   EXSR      NAD09
      *
     C     KEYMS0        READE     ETDT94B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:27                                       TDT27 /
      *////////////////////////////////////////////////////////////
     C     TDT27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     ETDT94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      DTM27
     C                   EXSR      TSR27
     C                   EXSR      LOC28
     C                   EXSR      RFF29
      *
     C     KEYMS1        READE     ETDT94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:13                                       TMD92 /
      *////////////////////////////////////////////////////////////
     C     TMD13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ETMD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS1        READE     ETMD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:37                                       TMD37 /
      *////////////////////////////////////////////////////////////
     C     TMD37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ETMD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:56                                       TMD56 /
      *////////////////////////////////////////////////////////////
     C     TMD56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     ETMD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:37                                       TMP37 /
      *////////////////////////////////////////////////////////////
     C     TMP37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ETMP94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMP94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETMP94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:56                                       TMP56 /
      *////////////////////////////////////////////////////////////
     C     TMP56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     ETMP94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMP94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETMP94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:21                                       TOD21 /
      *////////////////////////////////////////////////////////////
     C     TOD21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     ETOD94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC21
      *
     C     KEYMS1        READE     ETOD94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:36                                       TPL36 /
      *////////////////////////////////////////////////////////////
     C     TPL36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     ETPL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ETPL94B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      TPL
      *
     C     KEYMS3        READE     ETPL94B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:46                                       TPL46 /
      *////////////////////////////////////////////////////////////
     C     TPL46         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     46            ZGN2
     C     KEYMS2        SETLL     ETPL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MEA47
      *
     C     KEYMS2        READE     ETPL94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:56                                       TPL56 /
      *////////////////////////////////////////////////////////////
     C     TPL56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     ETPL94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
      *
     C     KEYMS2        READE     ETPL94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:05                                       TSR05 /
      *////////////////////////////////////////////////////////////
     C     TSR05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ETSR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:15                                       TSR15 /
      *////////////////////////////////////////////////////////////
     C     TSR15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ETSR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR94B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR94B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:27                                       TSR27 /
      *////////////////////////////////////////////////////////////
     C     TSR27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ETSR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETSR94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS2        READE     ETSR94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:36                                       TSR36 /
      *////////////////////////////////////////////////////////////
     C     TSR36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ETSR94B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETSR94B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TSR
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      RFF36
     C                   EXSR      LOC36
     C                   EXSR      TPL36
     C                   EXSR      FTX36
      *
     C     KEYMS2        READE     ETSR94B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Convert character                                                I
     C     WCHAR         LOOKUP    TABA          TABB                     83
     C     *IN83         IFEQ      '1'
     C                   MOVE      TABB          WCHAR
     C                   ENDIF
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
      /COPY QEDSRC,CNI_O_94B
      /COPY QEDSRC,CNT_O_94B
      /COPY QEDSRC,COM_O_94B
      /COPY QEDSRC,CPI_O_94B
      /COPY QEDSRC,CTA_O_94B
      /COPY QEDSRC,CUX_O_94B
      /COPY QEDSRC,DGS_O_94B
      /COPY QEDSRC,DIM_O_94B
      /COPY QEDSRC,DOC_O_94B
      /COPY QEDSRC,DTM_O_94B
      /COPY QEDSRC,EQA_O_94B
      /COPY QEDSRC,EQD_O_94B
      /COPY QEDSRC,EQN_O_94B
      /COPY QEDSRC,FTX_O_94B
      /COPY QEDSRC,GDS_O_94B
      /COPY QEDSRC,GID_O_94B
      /COPY QEDSRC,GOR_O_94B
      /COPY QEDSRC,HAN_O_94B
      /COPY QEDSRC,LOC_O_94B
      /COPY QEDSRC,MEA_O_94B
      /COPY QEDSRC,MOA_O_94B
      /COPY QEDSRC,NAD_O_94B
      /COPY QEDSRC,PCD_O_94B
      /COPY QEDSRC,PCI_O_94B
      /COPY QEDSRC,PIA_O_94B
      /COPY QEDSRC,PRI_O_94B
      /COPY QEDSRC,QTY_O_94B
      /COPY QEDSRC,RFF_O_94B
      /COPY QEDSRC,RNG_O_94B
      /COPY QEDSRC,SEL_O_94B
      /COPY QEDSRC,SGP_O_94B
      /COPY QEDSRC,TCC_O_94B
      /COPY QEDSRC,TDT_O_94B
      /COPY QEDSRC,TMD_O_94B
      /COPY QEDSRC,TMP_O_94B
      /COPY QEDSRC,TOD_O_94B
      /COPY QEDSRC,TPL_O_94B
      /COPY QEDSRC,TSR_O_94B
** TABA/TABB
ÅA
øO
ÆE
ØO
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
æE
åA
