     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FECNI98A   IF   E           K DISK
     FECNT98A   IF   E           K DISK
     FECOM98A   IF   E           K DISK
     FECPI98A   IF   E           K DISK
     FECTA98A   IF   E           K DISK
     FECUX98A   IF   E           K DISK
     FEDGS98A   IF   E           K DISK
     FEDIM98A   IF   E           K DISK
     FEDOC98A   IF   E           K DISK
     FEDTM98A   IF   E           K DISK
     FEEQA98A   IF   E           K DISK
     FEEQD98A   IF   E           K DISK
     FEEQN98A   IF   E           K DISK
     FEFTX98A   IF   E           K DISK
     FEGDS98A   IF   E           K DISK
     FEGID98A   IF   E           K DISK
     FEGIN98A   IF   E           K DISK
     FEGOR98A   IF   E           K DISK
     FEHAN98A   IF   E           K DISK
     FELOC98A   IF   E           K DISK
     FEMEA98A   IF   E           K DISK
     FEMOA98A   IF   E           K DISK
     FENAD98A   IF   E           K DISK
     FEPCD98A   IF   E           K DISK
     FEPCI98A   IF   E           K DISK
     FEPIA98A   IF   E           K DISK
     FEPRI98A   IF   E           K DISK
     FEQTY98A   IF   E           K DISK
     FERFF98A   IF   E           K DISK
     FERNG98A   IF   E           K DISK
     FESEL98A   IF   E           K DISK
     FESGP98A   IF   E           K DISK
     FETCC98A   IF   E           K DISK
     FETDT98A   IF   E           K DISK
     FETMD98A   IF   E           K DISK
     FETMP98A   IF   E           K DISK
     FETOD98A   IF   E           K DISK
     FETPL98A   IF   E           K DISK
     FETSR98A   IF   E           K DISK
     FEDISE     O  A E             DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
     D TABA            S              1    DIM(32) CTDATA PERRCD(1) ASCEND
     D TABB            S              1    DIM(32) ALT(TABA)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    DMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'IFCSUM'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      DTM00
     C                   EXSR      MOA00
     C                   EXSR      FTX00
     C                   EXSR      CNT00
     C                   EXSR      RFF01
     C                   EXSR      GOR02
     C                   EXSR      TCC07
     C                   EXSR      TDT08
     C                   EXSR      EQD17
     C                   EXSR      CNI19
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNI GROUP:19                                       CNI19 /
      *////////////////////////////////////////////////////////////
     C     CNI19         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     19            ZGN0
     C     KEYMS0        SETLL     ECNI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNI98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNI
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      SGP20
     C                   EXSR      CTA19
     C                   EXSR      COM19
     C                   EXSR      DTM19
     C                   EXSR      CNT19
     C                   EXSR      TSR19
     C                   EXSR      CUX19
     C                   EXSR      MOA19
     C                   EXSR      FTX19
     C                   EXSR      LOC24
     C                   EXSR      TOD25
     C                   EXSR      RFF26
     C                   EXSR      GOR27
     C                   EXSR      CPI29
     C                   EXSR      TCC30
     C                   EXSR      TDT31
     C                   EXSR      NAD34
     C                   EXSR      GID41
     C                   EXSR      EQD60
      *
     C     KEYMS0        READE     ECNI98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00                                       CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:19                                       CNT19 /
      *////////////////////////////////////////////////////////////
     C     CNT19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ECNT98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECNT98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS1        READE     ECNT98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:11                                       COM11 /
      *////////////////////////////////////////////////////////////
     C     COM11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     ECOM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:13                                       COM13 /
      *////////////////////////////////////////////////////////////
     C     COM13         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     13            ZGN3
     C     KEYMS3        SETLL     ECOM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:19                                       COM19 /
      *////////////////////////////////////////////////////////////
     C     COM19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ECOM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECOM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS1        READE     ECOM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:35                                       COM35 /
      *////////////////////////////////////////////////////////////
     C     COM35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     ECOM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:56                                       COM56 /
      *////////////////////////////////////////////////////////////
     C     COM56         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     56            ZGN4
     C     KEYMS4        SETLL     ECOM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECOM98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS4        READE     ECOM98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:29                                       CPI29 /
      *////////////////////////////////////////////////////////////
     C     CPI29         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     29            ZGN1
     C     KEYMS1        SETLL     ECPI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECPI98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      RFF29
     C                   EXSR      CUX29
     C                   EXSR      LOC29
     C                   EXSR      MOA29
      *
     C     KEYMS1        READE     ECPI98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:39                                       CPI39 /
      *////////////////////////////////////////////////////////////
     C     CPI39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     ECPI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECPI98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      RFF39
     C                   EXSR      CUX39
     C                   EXSR      LOC39
     C                   EXSR      MOA39
      *
     C     KEYMS2        READE     ECPI98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:11                                       CTA11 /
      *////////////////////////////////////////////////////////////
     C     CTA11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     ECTA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM11
      *
     C     KEYMS1        READE     ECTA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:13                                       CTA13 /
      *////////////////////////////////////////////////////////////
     C     CTA13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     ECTA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM13
      *
     C     KEYMS2        READE     ECTA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:19                                       CTA19 /
      *////////////////////////////////////////////////////////////
     C     CTA19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ECTA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
      *
     C     KEYMS1        READE     ECTA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:35                                       CTA35 /
      *////////////////////////////////////////////////////////////
     C     CTA35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ECTA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM35
      *
     C     KEYMS2        READE     ECTA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:56                                       CTA56 /
      *////////////////////////////////////////////////////////////
     C     CTA56         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     56            ZGN3
     C     KEYMS3        SETLL     ECTA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECTA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPE0
     C                   Z-ADD     CREP1         ZREPE1
     C                   Z-ADD     CREP2         ZREPE2
     C                   Z-ADD     CREP3         ZREPE3
     C                   EXSR      COM56
      *
     C     KEYMS3        READE     ECTA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:19                                       CUX19 /
      *////////////////////////////////////////////////////////////
     C     CUX19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ECUX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS1        READE     ECUX98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:29                                       CUX29 /
      *////////////////////////////////////////////////////////////
     C     CUX29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ECUX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:30                                       CUX30 /
      *////////////////////////////////////////////////////////////
     C     CUX30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ECUX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:39                                       CUX39 /
      *////////////////////////////////////////////////////////////
     C     CUX39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     ECUX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:55                                       DGS55 /
      *////////////////////////////////////////////////////////////
     C     DGS55         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     55            ZGN2
     C     KEYMS2        SETLL     EDGS98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDGS98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DGS
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      FTX55
     C                   EXSR      CTA56
     C                   EXSR      MEA57
     C                   EXSR      SGP58
      *
     C     KEYMS2        READE     EDGS98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:10                                       DIM10 /
      *////////////////////////////////////////////////////////////
     C     DIM10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     EDIM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      EQN07
      *
     C     KEYMS1        READE     EDIM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:17                                       DIM17 /
      *////////////////////////////////////////////////////////////
     C     DIM17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EDIM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
      *
     C     KEYMS1        READE     EDIM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:44                                       DIM44 /
      *////////////////////////////////////////////////////////////
     C     DIM44         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     44            ZGN2
     C     KEYMS2        SETLL     EDIM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      EQN44
      *
     C     KEYMS2        READE     EDIM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:60                                       DIM60 /
      *////////////////////////////////////////////////////////////
     C     DIM60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     EDIM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDIM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
      *
     C     KEYMS2        READE     EDIM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:03                                       DOC03 /
      *////////////////////////////////////////////////////////////
     C     DOC03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     EDOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:14                                       DOC14 /
      *////////////////////////////////////////////////////////////
     C     DOC14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM14
      *
     C     KEYMS2        READE     EDOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:28                                       DOC28 /
      *////////////////////////////////////////////////////////////
     C     DOC28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM28
      *
     C     KEYMS2        READE     EDOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:36                                       DOC36 /
      *////////////////////////////////////////////////////////////
     C     DOC36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM36
      *
     C     KEYMS2        READE     EDOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:47                                       DOC47 /
      *////////////////////////////////////////////////////////////
     C     DOC47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM47
      *
     C     KEYMS2        READE     EDOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:49                                       DOC49 /
      *////////////////////////////////////////////////////////////
     C     DOC49         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     49            ZGN3
     C     KEYMS3        SETLL     EDOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDOC98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPE0
     C                   Z-ADD     DREP1         ZREPE1
     C                   Z-ADD     DREP2         ZREPE2
     C                   Z-ADD     DREP3         ZREPE3
     C                   EXSR      DTM49
      *
     C     KEYMS3        READE     EDOC98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:02                                       DTM02 /
      *////////////////////////////////////////////////////////////
     C     DTM02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:08                                       DTM08 /
      *////////////////////////////////////////////////////////////
     C     DTM08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:14                                       DTM14 /
      *////////////////////////////////////////////////////////////
     C     DTM14         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     14            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:19                                       DTM19 /
      *////////////////////////////////////////////////////////////
     C     DTM19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:24                                       DTM24 /
      *////////////////////////////////////////////////////////////
     C     DTM24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:26                                       DTM26 /
      *////////////////////////////////////////////////////////////
     C     DTM26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:28                                       DTM28 /
      *////////////////////////////////////////////////////////////
     C     DTM28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:31                                       DTM31 /
      *////////////////////////////////////////////////////////////
     C     DTM31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:33                                       DTM33 /
      *////////////////////////////////////////////////////////////
     C     DTM33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:42                                       DTM42 /
      *////////////////////////////////////////////////////////////
     C     DTM42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:45                                       DTM45 /
      *////////////////////////////////////////////////////////////
     C     DTM45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:46                                       DTM46 /
      *////////////////////////////////////////////////////////////
     C     DTM46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:47                                       DTM47 /
      *////////////////////////////////////////////////////////////
     C     DTM47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:48                                       DTM48 /
      *////////////////////////////////////////////////////////////
     C     DTM48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:49                                       DTM49 /
      *////////////////////////////////////////////////////////////
     C     DTM49         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     49            ZGN4
     C     KEYMS4        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EDTM98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS4        READE     EDTM98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:62                                       DTM62 /
      *////////////////////////////////////////////////////////////
     C     DTM62         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     62            ZGN3
     C     KEYMS3        SETLL     EDTM98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:18                                       EQA18 /
      *////////////////////////////////////////////////////////////
     C     EQA18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EEQA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN18
      *
     C     KEYMS1        READE     EEQA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:63                                       EQA63 /
      *////////////////////////////////////////////////////////////
     C     EQA63         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     63            ZGN2
     C     KEYMS2        SETLL     EEQA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPD0
     C                   Z-ADD     EREP1         ZREPD1
     C                   Z-ADD     EREP2         ZREPD2
     C                   EXSR      EQN63
      *
     C     KEYMS2        READE     EEQA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:17                                       EQD17 /
      *////////////////////////////////////////////////////////////
     C     EQD17         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     17            ZGN0
     C     KEYMS0        SETLL     EEQD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      EQN17
     C                   EXSR      TMD17
     C                   EXSR      MEA17
     C                   EXSR      DIM17
     C                   EXSR      SEL17
     C                   EXSR      NAD17
     C                   EXSR      LOC17
     C                   EXSR      FTX17
     C                   EXSR      EQA18
      *
     C     KEYMS0        READE     EEQD98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:60                                       EQD60 /
      *////////////////////////////////////////////////////////////
     C     EQD60         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     60            ZGN1
     C     KEYMS1        SETLL     EEQD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN60
     C                   EXSR      TMD60
     C                   EXSR      MEA60
     C                   EXSR      DIM60
     C                   EXSR      SEL60
     C                   EXSR      TPL60
     C                   EXSR      HAN60
     C                   EXSR      TMP60
     C                   EXSR      FTX60
     C                   EXSR      TCC61
     C                   EXSR      NAD62
     C                   EXSR      EQA63
      *
     C     KEYMS1        READE     EEQD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:07                                       EQN07 /
      *////////////////////////////////////////////////////////////
     C     EQN07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:09                                       EQN09 /
      *////////////////////////////////////////////////////////////
     C     EQN09         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     9             ZGN2
     C     KEYMS2        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:10                                       EQN10 /
      *////////////////////////////////////////////////////////////
     C     EQN10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:15                                       EQN15 /
      *////////////////////////////////////////////////////////////
     C     EQN15         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     15            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:17                                       EQN17 /
      *////////////////////////////////////////////////////////////
     C     EQN17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:18                                       EQN18 /
      *////////////////////////////////////////////////////////////
     C     EQN18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:21                                       EQN21 /
      *////////////////////////////////////////////////////////////
     C     EQN21         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     21            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:30                                       EQN30 /
      *////////////////////////////////////////////////////////////
     C     EQN30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:37                                       EQN37 /
      *////////////////////////////////////////////////////////////
     C     EQN37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:43                                       EQN43 /
      *////////////////////////////////////////////////////////////
     C     EQN43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:44                                       EQN44 /
      *////////////////////////////////////////////////////////////
     C     EQN44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:51                                       EQN51 /
      *////////////////////////////////////////////////////////////
     C     EQN51         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     51            ZGN4
     C     KEYMS4        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:53                                       EQN53 /
      *////////////////////////////////////////////////////////////
     C     EQN53         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     53            ZGN4
     C     KEYMS4        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:54                                       EQN54 /
      *////////////////////////////////////////////////////////////
     C     EQN54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:57                                       EQN57 /
      *////////////////////////////////////////////////////////////
     C     EQN57         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     57            ZGN4
     C     KEYMS4        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:59                                       EQN59 /
      *////////////////////////////////////////////////////////////
     C     EQN59         BEGSR
     C                   MOVE      '0'           *IN56
     C                   Z-ADD     59            ZGN5
     C     KEYMS5        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS5        READE     EEQN98A                                56
     C     *IN56         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS5        READE     EEQN98A                                56
     C  N56              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:60                                       EQN60 /
      *////////////////////////////////////////////////////////////
     C     EQN60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:61                                       EQN61 /
      *////////////////////////////////////////////////////////////
     C     EQN61         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     61            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:63                                       EQN63 /
      *////////////////////////////////////////////////////////////
     C     EQN63         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     63            ZGN3
     C     KEYMS3        SETLL     EEQN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:08                                       FTX08 /
      *////////////////////////////////////////////////////////////
     C     FTX08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:17                                       FTX17 /
      *////////////////////////////////////////////////////////////
     C     FTX17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:19                                       FTX19 /
      *////////////////////////////////////////////////////////////
     C     FTX19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:30                                       FTX30 /
      *////////////////////////////////////////////////////////////
     C     FTX30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:40                                       FTX40 /
      *////////////////////////////////////////////////////////////
     C     FTX40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:41                                       FTX41 /
      *////////////////////////////////////////////////////////////
     C     FTX41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:48                                       FTX48 /
      *////////////////////////////////////////////////////////////
     C     FTX48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:55                                       FTX55 /
      *////////////////////////////////////////////////////////////
     C     FTX55         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     55            ZGN3
     C     KEYMS3        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:60                                       FTX60 /
      *////////////////////////////////////////////////////////////
     C     FTX60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     EFTX98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GDS GROUP:41                                       GDS41 /
      *////////////////////////////////////////////////////////////
     C     GDS41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EGDS98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGDS98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GDS
     C                   Z-ADD     GREP0         ZREPD0
     C                   Z-ADD     GREP1         ZREPD1
     C                   Z-ADD     GREP2         ZREPD2
      *
     C     KEYMS2        READE     EGDS98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GID GROUP:41                                       GID41 /
      *////////////////////////////////////////////////////////////
     C     GID41         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     41            ZGN1
     C     KEYMS1        SETLL     EGID98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGID98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GID
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      HAN41
     C                   EXSR      TMP41
     C                   EXSR      RNG41
     C                   EXSR      TMD41
     C                   EXSR      LOC41
     C                   EXSR      MOA41
     C                   EXSR      PIA41
     C                   EXSR      FTX41
     C                   EXSR      NAD42
     C                   EXSR      GDS41
     C                   EXSR      MEA43
     C                   EXSR      DIM44
     C                   EXSR      RFF45
     C                   EXSR      PCI46
     C                   EXSR      DOC47
     C                   EXSR      GOR48
     C                   EXSR      TPL50
     C                   EXSR      SGP52
     C                   EXSR      TCC54
     C                   EXSR      DGS55
      *
     C     KEYMS1        READE     EGID98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:46                                       GIN46 /
      *////////////////////////////////////////////////////////////
     C     GIN46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     EGIN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EGIN98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS3        READE     EGIN98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:02                                       GOR02 /
      *////////////////////////////////////////////////////////////
     C     GOR02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     EGOR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGOR98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPB0
     C                   EXSR      DTM02
     C                   EXSR      LOC02
     C                   EXSR      SEL02
     C                   EXSR      DOC03
      *
     C     KEYMS0        READE     EGOR98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:27                                       GOR27 /
      *////////////////////////////////////////////////////////////
     C     GOR27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     EGOR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGOR98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      DOC28
      *
     C     KEYMS1        READE     EGOR98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:48                                       GOR48 /
      *////////////////////////////////////////////////////////////
     C     GOR48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EGOR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EGOR98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPE0
     C                   Z-ADD     GREP1         ZREPE1
     C                   Z-ADD     GREP2         ZREPE2
     C                   Z-ADD     GREP3         ZREPE3
     C                   EXSR      DTM48
     C                   EXSR      LOC48
     C                   EXSR      SEL48
     C                   EXSR      FTX48
     C                   EXSR      DOC49
      *
     C     KEYMS3        READE     EGOR98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:41                                       HAN41 /
      *////////////////////////////////////////////////////////////
     C     HAN41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EHAN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:60                                       HAN60 /
      *////////////////////////////////////////////////////////////
     C     HAN60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     EHAN98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:07                                       LOC07 /
      *////////////////////////////////////////////////////////////
     C     LOC07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:08                                       LOC08 /
      *////////////////////////////////////////////////////////////
     C     LOC08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:12                                       LOC12 /
      *////////////////////////////////////////////////////////////
     C     LOC12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:17                                       LOC17 /
      *////////////////////////////////////////////////////////////
     C     LOC17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:24                                       LOC24 /
      *////////////////////////////////////////////////////////////
     C     LOC24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM24
      *
     C     KEYMS1        READE     ELOC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:25                                       LOC25 /
      *////////////////////////////////////////////////////////////
     C     LOC25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:29                                       LOC29 /
      *////////////////////////////////////////////////////////////
     C     LOC29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:30                                       LOC30 /
      *////////////////////////////////////////////////////////////
     C     LOC30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:32                                       LOC32 /
      *////////////////////////////////////////////////////////////
     C     LOC32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     32            ZGN3
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:34                                       LOC30 /
      *////////////////////////////////////////////////////////////
     C     LOC34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:39                                       LOC39 /
      *////////////////////////////////////////////////////////////
     C     LOC39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:40                                       LOC40 /
      *////////////////////////////////////////////////////////////
     C     LOC40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:41                                       LOC41 /
      *////////////////////////////////////////////////////////////
     C     LOC41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:48                                       LOC48 /
      *////////////////////////////////////////////////////////////
     C     LOC48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:54                                       LOC54 /
      *////////////////////////////////////////////////////////////
     C     LOC54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     ELOC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:09                                       MEA09 /
      *////////////////////////////////////////////////////////////
     C     MEA09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      EQN09
      *
     C     KEYMS1        READE     EMEA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:17                                       MEA17 /
      *////////////////////////////////////////////////////////////
     C     MEA17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:21                                       MEA21 /
      *////////////////////////////////////////////////////////////
     C     MEA21         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     21            ZGN3
     C     KEYMS3        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN21
      *
     C     KEYMS3        READE     EMEA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:43                                       MEA43 /
      *////////////////////////////////////////////////////////////
     C     MEA43         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     43            ZGN2
     C     KEYMS2        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN43
      *
     C     KEYMS2        READE     EMEA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:51                                       MEA51 /
      *////////////////////////////////////////////////////////////
     C     MEA51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN51
      *
     C     KEYMS3        READE     EMEA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:53                                       MEA53 /
      *////////////////////////////////////////////////////////////
     C     MEA53         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     53            ZGN3
     C     KEYMS3        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN53
      *
     C     KEYMS3        READE     EMEA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:57                                       MEA57 /
      *////////////////////////////////////////////////////////////
     C     MEA57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN57
      *
     C     KEYMS3        READE     EMEA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:59                                       MEA59 /
      *////////////////////////////////////////////////////////////
     C     MEA59         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     59            ZGN4
     C     KEYMS4        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMEA98A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPF0
     C                   Z-ADD     MREP1         ZREPF1
     C                   Z-ADD     MREP2         ZREPF2
     C                   Z-ADD     MREP3         ZREPF3
     C                   Z-ADD     MREP4         ZREPF4
     C                   EXSR      EQN59
      *
     C     KEYMS4        READE     EMEA98A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:60                                       MEA60 /
      *////////////////////////////////////////////////////////////
     C     MEA60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     EMEA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
      *
     C     KEYMS2        READE     EMEA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:00                                       MOA00 /
      *////////////////////////////////////////////////////////////
     C     MOA00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS0        READE     EMOA98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:07                                       MOA07 /
      *////////////////////////////////////////////////////////////
     C     MOA07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:15                                       MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     15            ZGN3
     C     KEYMS3        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:19                                       MOA19 /
      *////////////////////////////////////////////////////////////
     C     MOA19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:29                                       MOA29 /
      *////////////////////////////////////////////////////////////
     C     MOA29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA98A                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:30                                       MOA30 /
      *////////////////////////////////////////////////////////////
     C     MOA30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA98A                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:34                                       MOA34 /
      *////////////////////////////////////////////////////////////
     C     MOA34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:37                                       MOA37 /
      *////////////////////////////////////////////////////////////
     C     MOA37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:39                                       MOA39 /
      *////////////////////////////////////////////////////////////
     C     MOA39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:41                                       MOA41 /
      *////////////////////////////////////////////////////////////
     C     MOA41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA98A                                53
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:54                                       MOA54 /
      *////////////////////////////////////////////////////////////
     C     MOA54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:61                                       MOA61 /
      *////////////////////////////////////////////////////////////
     C     MOA61         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     61            ZGN3
     C     KEYMS3        SETLL     EMOA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:12                                       NAD12 /
      *////////////////////////////////////////////////////////////
     C     NAD12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     ENAD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC12
     C                   EXSR      CTA13
     C                   EXSR      DOC14
     C                   EXSR      TCC15
      *
     C     KEYMS1        READE     ENAD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:17                                       NAD17 /
      *////////////////////////////////////////////////////////////
     C     NAD17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ENAD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
      *
     C     KEYMS1        READE     ENAD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:34                                       NAD34 /
      *////////////////////////////////////////////////////////////
     C     NAD34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     ENAD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC34
     C                   EXSR      MOA34
     C                   EXSR      CTA35
     C                   EXSR      DOC36
     C                   EXSR      TCC37
     C                   EXSR      RFF38
     C                   EXSR      CPI39
     C                   EXSR      TSR40
      *
     C     KEYMS1        READE     ENAD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:42                                       NAD42 /
      *////////////////////////////////////////////////////////////
     C     NAD42         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     42            ZGN2
     C     KEYMS2        SETLL     ENAD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM42
      *
     C     KEYMS2        READE     ENAD98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:62                                       NAD62 /
      *////////////////////////////////////////////////////////////
     C     NAD62         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     62            ZGN2
     C     KEYMS2        SETLL     ENAD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      DTM62
      *
     C     KEYMS2        READE     ENAD98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:07                                       PCD07 /
      *////////////////////////////////////////////////////////////
     C     PCD07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:15                                       PCD15 /
      *////////////////////////////////////////////////////////////
     C     PCD15         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     15            ZGN3
     C     KEYMS3        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:30                                       PCD30 /
      *////////////////////////////////////////////////////////////
     C     PCD30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:37                                       PCD37 /
      *////////////////////////////////////////////////////////////
     C     PCD37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:54                                       PCD54 /
      *////////////////////////////////////////////////////////////
     C     PCD54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:61                                       PCD61 /
      *////////////////////////////////////////////////////////////
     C     PCD61         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     61            ZGN3
     C     KEYMS3        SETLL     EPCD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:46                                       PCI46 /
      *////////////////////////////////////////////////////////////
     C     PCI46         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     46            ZGN2
     C     KEYMS2        SETLL     EPCI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      RFF46
     C                   EXSR      DTM46
     C                   EXSR      GIN46
      *
     C     KEYMS2        READE     EPCI98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:41                                       PIA41 /
      *////////////////////////////////////////////////////////////
     C     PIA41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EPIA98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:07                                       PRI07 /
      *////////////////////////////////////////////////////////////
     C     PRI07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS1        READE     EPRI98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:15                                       PRI15 /
      *////////////////////////////////////////////////////////////
     C     PRI15         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     15            ZGN3
     C     KEYMS3        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:30                                       PRI30 /
      *////////////////////////////////////////////////////////////
     C     PRI30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:37                                       PRI37 /
      *////////////////////////////////////////////////////////////
     C     PRI37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:54                                       PRI54 /
      *////////////////////////////////////////////////////////////
     C     PRI54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:61                                       PRI61 /
      *////////////////////////////////////////////////////////////
     C     PRI61         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     61            ZGN3
     C     KEYMS3        SETLL     EPRI98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPRI98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS3        READE     EPRI98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:07                                       QTY07 /
      *////////////////////////////////////////////////////////////
     C     QTY07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:15                                       QTY15 /
      *////////////////////////////////////////////////////////////
     C     QTY15         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     15            ZGN3
     C     KEYMS3        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:30                                       QTY30 /
      *////////////////////////////////////////////////////////////
     C     QTY30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:37                                       QTY37 /
      *////////////////////////////////////////////////////////////
     C     QTY37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:54                                       QTY54 /
      *////////////////////////////////////////////////////////////
     C     QTY54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:61                                       QTY61 /
      *////////////////////////////////////////////////////////////
     C     QTY61         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     61            ZGN3
     C     KEYMS3        SETLL     EQTY98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:26                                       RFF26 /
      *////////////////////////////////////////////////////////////
     C     RFF26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM26
      *
     C     KEYMS1        READE     ERFF98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:29                                       RFF29 /
      *////////////////////////////////////////////////////////////
     C     RFF29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:33                                       RFF33 /
      *////////////////////////////////////////////////////////////
     C     RFF33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM33
      *
     C     KEYMS2        READE     ERFF98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:37                                       RFF37 /
      *////////////////////////////////////////////////////////////
     C     RFF37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:38                                       RFF38 /
      *////////////////////////////////////////////////////////////
     C     RFF38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM38
      *
     C     KEYMS2        READE     ERFF98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:39                                       RFF39 /
      *////////////////////////////////////////////////////////////
     C     RFF39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:40                                       RFF40 /
      *////////////////////////////////////////////////////////////
     C     RFF40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:45                                       RFF45 /
      *////////////////////////////////////////////////////////////
     C     RFF45         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     45            ZGN2
     C     KEYMS2        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM45
      *
     C     KEYMS2        READE     ERFF98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:46                                       RFF46 /
      *////////////////////////////////////////////////////////////
     C     RFF46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     ERFF98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:41                                       RNG41 /
      *////////////////////////////////////////////////////////////
     C     RNG41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ERNG98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:02                                       SEL02 /
      *////////////////////////////////////////////////////////////
     C     SEL02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ESEL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:08                                       SEL08 /
      *////////////////////////////////////////////////////////////
     C     SEL08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ESEL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:17                                       SEL17 /
      *////////////////////////////////////////////////////////////
     C     SEL17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ESEL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:48                                       SEL48 /
      *////////////////////////////////////////////////////////////
     C     SEL48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     ESEL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ESEL98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS3        READE     ESEL98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:60                                       SEL60 /
      *////////////////////////////////////////////////////////////
     C     SEL60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     ESEL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESEL98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS2        READE     ESEL98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:20                                       SGP20 /
      *////////////////////////////////////////////////////////////
     C     SGP20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     ESGP98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESGP98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA21
      *
     C     KEYMS1        READE     ESGP98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:52                                       SGP52 /
      *////////////////////////////////////////////////////////////
     C     SGP52         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     52            ZGN2
     C     KEYMS2        SETLL     ESGP98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESGP98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA53
      *
     C     KEYMS2        READE     ESGP98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:58                                       SGP58 /
      *////////////////////////////////////////////////////////////
     C     SGP58         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     58            ZGN3
     C     KEYMS3        SETLL     ESGP98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ESGP98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPE0
     C                   Z-ADD     SREP1         ZREPE1
     C                   Z-ADD     SREP2         ZREPE2
     C                   Z-ADD     SREP3         ZREPE3
     C                   EXSR      MEA59
      *
     C     KEYMS3        READE     ESGP98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:07                                       TCC07 /
      *////////////////////////////////////////////////////////////
     C     TCC07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETCC98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      PRI07
     C                   EXSR      EQN07
     C                   EXSR      PCD07
     C                   EXSR      MOA07
     C                   EXSR      QTY07
     C                   EXSR      LOC07
      *
     C     KEYMS0        READE     ETCC98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:15                                       TCC15 /
      *////////////////////////////////////////////////////////////
     C     TCC15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI15
     C                   EXSR      EQN15
     C                   EXSR      PCD15
     C                   EXSR      MOA15
     C                   EXSR      QTY15
      *
     C     KEYMS2        READE     ETCC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:30                                       TCC30 /
      *////////////////////////////////////////////////////////////
     C     TCC30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC30
     C                   EXSR      FTX30
     C                   EXSR      CUX30
     C                   EXSR      PRI30
     C                   EXSR      EQN30
     C                   EXSR      PCD30
     C                   EXSR      MOA30
     C                   EXSR      QTY30
      *
     C     KEYMS1        READE     ETCC98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:37                                       TCC37 /
      *////////////////////////////////////////////////////////////
     C     TCC37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI37
     C                   EXSR      EQN37
     C                   EXSR      PCD37
     C                   EXSR      MOA37
     C                   EXSR      QTY37
      *
     C     KEYMS2        READE     ETCC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:54                                       TCC54 /
      *////////////////////////////////////////////////////////////
     C     TCC54         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     54            ZGN2
     C     KEYMS2        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI54
     C                   EXSR      EQN54
     C                   EXSR      PCD54
     C                   EXSR      MOA54
     C                   EXSR      QTY54
     C                   EXSR      LOC54
      *
     C     KEYMS2        READE     ETCC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:61                                       TCC61 /
      *////////////////////////////////////////////////////////////
     C     TCC61         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     61            ZGN2
     C     KEYMS2        SETLL     ETCC98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETCC98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      PRI61
     C                   EXSR      EQN61
     C                   EXSR      PCD61
     C                   EXSR      MOA61
     C                   EXSR      QTY61
      *
     C     KEYMS2        READE     ETCC98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:08                                       TDT08 /
      *////////////////////////////////////////////////////////////
     C     TDT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     ETDT98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT98A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      TSR08
     C                   EXSR      LOC08
     C                   EXSR      DTM08
     C                   EXSR      SEL08
     C                   EXSR      FTX08
     C                   EXSR      MEA09
     C                   EXSR      DIM10
     C                   EXSR      CTA11
     C                   EXSR      NAD12
      *
     C     KEYMS0        READE     ETDT98A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:31                                       TDT31 /
      *////////////////////////////////////////////////////////////
     C     TDT31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     ETDT98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      DTM31
     C                   EXSR      TSR31
     C                   EXSR      LOC32
     C                   EXSR      RFF33
      *
     C     KEYMS1        READE     ETDT98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:17                                       TMD17 /
      *////////////////////////////////////////////////////////////
     C     TMD17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ETMD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS1        READE     ETMD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:41                                       TMD41 /
      *////////////////////////////////////////////////////////////
     C     TMD41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ETMD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:60                                       TMD60 /
      *////////////////////////////////////////////////////////////
     C     TMD60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     ETMD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMD98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS2        READE     ETMD98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:41                                       TMP41 /
      *////////////////////////////////////////////////////////////
     C     TMP41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     ETMP98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMP98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETMP98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:60                                       TMP60 /
      *////////////////////////////////////////////////////////////
     C     TMP60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     ETMP98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETMP98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETMP98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:25                                       TOD25 /
      *////////////////////////////////////////////////////////////
     C     TOD25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     ETOD98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC25
      *
     C     KEYMS1        READE     ETOD98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:40                                       TPL40 /
      *////////////////////////////////////////////////////////////
     C     TPL40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ETPL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ETPL98A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      TPL
      *
     C     KEYMS3        READE     ETPL98A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:50                                       TPL50 /
      *////////////////////////////////////////////////////////////
     C     TPL50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     ETPL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MEA51
      *
     C     KEYMS2        READE     ETPL98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:60                                       TPL60 /
      *////////////////////////////////////////////////////////////
     C     TPL60         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     60            ZGN2
     C     KEYMS2        SETLL     ETPL98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
      *
     C     KEYMS2        READE     ETPL98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:08                                       TSR08 /
      *////////////////////////////////////////////////////////////
     C     TSR08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ETSR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:19                                       TSR19 /
      *////////////////////////////////////////////////////////////
     C     TSR19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ETSR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR98A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR98A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:31                                       TSR31 /
      *////////////////////////////////////////////////////////////
     C     TSR31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ETSR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETSR98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS2        READE     ETSR98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:40                                       TSR40 /
      *////////////////////////////////////////////////////////////
     C     TSR40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     ETSR98A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETSR98A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TSR
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      RFF40
     C                   EXSR      LOC40
     C                   EXSR      TPL40
     C                   EXSR      FTX40
      *
     C     KEYMS2        READE     ETSR98A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Convert character                                                I
     C     WCHAR         LOOKUP    TABA          TABB                     83
     C     *IN83         IFEQ      '1'
     C                   MOVE      TABB          WCHAR
     C                   ENDIF
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
      /COPY QEDSRC,CNI_O_98A
      /COPY QEDSRC,CNT_O_98A
      /COPY QEDSRC,COM_O_98A
      /COPY QEDSRC,CPI_O_98A
      /COPY QEDSRC,CTA_O_98A
      /COPY QEDSRC,CUX_O_98A
      /COPY QEDSRC,DGS_O_98A
      /COPY QEDSRC,DIM_O_98A
      /COPY QEDSRC,DOC_O_98A
      /COPY QEDSRC,DTM_O_98A
      /COPY QEDSRC,EQA_O_98A
      /COPY QEDSRC,EQD_O_98A
      /COPY QEDSRC,EQN_O_98A
      /COPY QEDSRC,FTX_O_98A
      /COPY QEDSRC,GDS_O_98A
      /COPY QEDSRC,GID_O_98A
      /COPY QEDSRC,GIN_O_98A
      /COPY QEDSRC,GOR_O_98A
      /COPY QEDSRC,HAN_O_98A
      /COPY QEDSRC,LOC_O_98A
      /COPY QEDSRC,MEA_O_98A
      /COPY QEDSRC,MOA_O_98A
      /COPY QEDSRC,NAD_O_98A
      /COPY QEDSRC,PCD_O_98A
      /COPY QEDSRC,PCI_O_98A
      /COPY QEDSRC,PIA_O_98A
      /COPY QEDSRC,PRI_O_98A
      /COPY QEDSRC,QTY_O_98A
      /COPY QEDSRC,RFF_O_98A
      /COPY QEDSRC,RNG_O_98A
      /COPY QEDSRC,SEL_O_98A
      /COPY QEDSRC,SGP_O_98A
      /COPY QEDSRC,TCC_O_98A
      /COPY QEDSRC,TDT_O_98A
      /COPY QEDSRC,TMD_O_98A
      /COPY QEDSRC,TMP_O_98A
      /COPY QEDSRC,TOD_O_98A
      /COPY QEDSRC,TPL_O_98A
      /COPY QEDSRC,TSR_O_98A
** TABA/TABB
ÅA
øO
ÆE
ØO
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
æE
åA
