     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FEUNS      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FEDISE     O  A E             DISK
     FEAJT01B   IF   E           K DISK
     FEALC01B   IF   E           K DISK
     FEALI01B   IF   E           K DISK
     FEAPR01B   IF   E           K DISK
     FECNT01B   IF   E           K DISK
     FECOM01B   IF   E           K DISK
     FECTA01B   IF   E           K DISK
     FECUX01B   IF   E           K DISK
     FEDGS01B   IF   E           K DISK
     FEDOC01B   IF   E           K DISK
     FEDTM01B   IF   E           K DISK
     FEEQD01B   IF   E           K DISK
     FEFII01B   IF   E           K DISK
     FEFTX01B   IF   E           K DISK
     FEGIN01B   IF   E           K DISK
     FEGIR01B   IF   E           K DISK
     FEGIS01B   IF   E           K DISK
     FEIMD01B   IF   E           K DISK
     FEINP01B   IF   E           K DISK
     FELIN01B   IF   E           K DISK
     FELOC01B   IF   E           K DISK
     FEMEA01B   IF   E           K DISK
     FEMOA01B   IF   E           K DISK
     FENAD01B   IF   E           K DISK
     FEPAC01B   IF   E           K DISK
     FEPAI01B   IF   E           K DISK
     FEPAT01B   IF   E           K DISK
     FEPCD01B   IF   E           K DISK
     FEPCI01B   IF   E           K DISK
     FEPGI01B   IF   E           K DISK
     FEPIA01B   IF   E           K DISK
     FEPRI01B   IF   E           K DISK
     FEQTY01B   IF   E           K DISK
     FEQVR01B   IF   E           K DISK
     FERCS01B   IF   E           K DISK
     FERFF01B   IF   E           K DISK
     FERNG01B   IF   E           K DISK
     FERTE01B   IF   E           K DISK
     FESEL01B   IF   E           K DISK
     FETAX01B   IF   E           K DISK
     FETDT01B   IF   E           K DISK
     FETOD01B   IF   E           K DISK
     FETSR01B   IF   E           K DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  AJT GROUP:24                                       AJT24 /
      *////////////////////////////////////////////////////////////
     C     AJT24         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     24            ZGN0
     C     KEYMS0        SETLL     EAJT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EAJT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      AJT
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      FTX24
      *
     C     KEYMS0        READE     EAJT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:16                                       ALC16 /
      *////////////////////////////////////////////////////////////
     C     ALC16         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     16            ZGN0
     C     KEYMS0        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI16
     C                   EXSR      FTX16
     C                   EXSR      RFF17
     C                   EXSR      QTY18
     C                   EXSR      PCD19
     C                   EXSR      MOA20
     C                   EXSR      RTE21
     C                   EXSR      TAX22
      *
     C     KEYMS0        READE     EALC01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:39                                       ALC39 /
      *////////////////////////////////////////////////////////////
     C     ALC39         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     39            ZGN1
     C     KEYMS1        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPC0
     C                   Z-ADD     AREP1         ZREPC1
     C                   EXSR      ALI39
     C                   EXSR      DTM39
     C                   EXSR      FTX39
     C                   EXSR      QTY40
     C                   EXSR      PCD41
     C                   EXSR      MOA42
     C                   EXSR      RTE43
     C                   EXSR      TAX44
      *
     C     KEYMS1        READE     EALC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:53                                       ALC53 /
      *////////////////////////////////////////////////////////////
     C     ALC53         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     53            ZGN0
     C     KEYMS0        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI53
     C                   EXSR      MOA53
     C                   EXSR      FTX53
      *
     C     KEYMS0        READE     EALC01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:00                                       ALI00 /
      *////////////////////////////////////////////////////////////
     C     ALI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALI01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS0        READE     EALI01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:16                                       ALI16 /
      *////////////////////////////////////////////////////////////
     C     ALI16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:26                                       ALI26 /
      *////////////////////////////////////////////////////////////
     C     ALI26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:39                                       ALI39 /
      *////////////////////////////////////////////////////////////
     C     ALI39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:53                                       ALI53 /
      *////////////////////////////////////////////////////////////
     C     ALI53         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     53            ZGN1
     C     KEYMS1        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  APR GROUP:29                                       APR29 /
      *////////////////////////////////////////////////////////////
     C     APR29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EAPR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EAPR01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      APR
      *
     C     KEYMS2        READE     EAPR01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00.                                      CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:05                                       COM05 /
      *////////////////////////////////////////////////////////////
     C     COM05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN2
     C     KEYMS2        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:38                                       COM38 /
      *////////////////////////////////////////////////////////////
     C     COM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:05                                       CTA05 /
      *////////////////////////////////////////////////////////////
     C     CTA05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ECTA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM05
      *
     C     KEYMS1        READE     ECTA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:38                                       CTA38 /
      *////////////////////////////////////////////////////////////
     C     CTA38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     ECTA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM38
      *
     C     KEYMS2        READE     ECTA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:07                                       CUX07 /
      *////////////////////////////////////////////////////////////
     C     CUX07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECUX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      DTM07
      *
     C     KEYMS0        READE     ECUX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:20                                       CUX20 /
      *////////////////////////////////////////////////////////////
     C     CUX20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:27                                       CUX27 /
      *////////////////////////////////////////////////////////////
     C     CUX27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:29                                       CUX29 /
      *////////////////////////////////////////////////////////////
     C     CUX29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:42                                       CUX42 /
      *////////////////////////////////////////////////////////////
     C     CUX42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:00                                       DGS00 /
      *////////////////////////////////////////////////////////////
     C     DGS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDGS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDGS01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DGS
      *
     C     KEYMS0        READE     EDGS01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:26                                       DGS26 /
      *////////////////////////////////////////////////////////////
     C     DGS26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EDGS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDGS01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DGS
      *
     C     KEYMS1        READE     EDGS01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:04                                       DOC04 /
      *////////////////////////////////////////////////////////////
     C     DOC04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EDOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM04
      *
     C     KEYMS1        READE     EDOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:37                                       DOC37 /
      *////////////////////////////////////////////////////////////
     C     DOC37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EDOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM37
      *
     C     KEYMS2        READE     EDOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:04                                       DTM04 /
      *////////////////////////////////////////////////////////////
     C     DTM04         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     4             ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:07                                       DTM07 /
      *////////////////////////////////////////////////////////////
     C     DTM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:08                                       DTM08 /
      *////////////////////////////////////////////////////////////
     C     DTM08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:10                                       DTM10 /
      *////////////////////////////////////////////////////////////
     C     DTM10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:11                                       DTM11 /
      *////////////////////////////////////////////////////////////
     C     DTM11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:15                                       DTM15 /
      *////////////////////////////////////////////////////////////
     C     DTM15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:17                                       DTM17 /
      *////////////////////////////////////////////////////////////
     C     DTM17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:20                                       DTM20 /
      *////////////////////////////////////////////////////////////
     C     DTM20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:23                                       DTM23 /
      *////////////////////////////////////////////////////////////
     C     DTM23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:26                                       DTM26 /
      *////////////////////////////////////////////////////////////
     C     DTM26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:28                                       DTM28 /
      *////////////////////////////////////////////////////////////
     C     DTM28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:29                                       DTM29 /
      *////////////////////////////////////////////////////////////
     C     DTM29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:30                                       DTM30 /
      *////////////////////////////////////////////////////////////
     C     DTM30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:32                                       DTM32 /
      *////////////////////////////////////////////////////////////
     C     DTM32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     32            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:33                                       DTM33 /
      *////////////////////////////////////////////////////////////
     C     DTM33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:37                                       DTM37 /
      *////////////////////////////////////////////////////////////
     C     DTM37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:39                                       DTM39 /
      *////////////////////////////////////////////////////////////
     C     DTM39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:42                                       DTM42 /
      *////////////////////////////////////////////////////////////
     C     DTM42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:46                                       DTM46 /
      *////////////////////////////////////////////////////////////
     C     DTM46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:48                                       DTM48 /
      *////////////////////////////////////////////////////////////
     C     DTM48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:49                                       DTM49 /
      *////////////////////////////////////////////////////////////
     C     DTM49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:51                                       DTM51 /
      *////////////////////////////////////////////////////////////
     C     DTM51         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     51            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:13                                       EQD13 /
      *////////////////////////////////////////////////////////////
     C     EQD13         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     13            ZGN0
     C     KEYMS0        SETLL     EEQD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      SEL13
      *
     C     KEYMS0        READE     EEQD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:14                                       EQD14 /
      *////////////////////////////////////////////////////////////
     C     EQD14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EEQD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
      *
     C     KEYMS1        READE     EEQD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:26                                       EQD26 /
      *////////////////////////////////////////////////////////////
     C     EQD26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EEQD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
      *
     C     KEYMS1        READE     EEQD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:31                                       EQD31 /
      *////////////////////////////////////////////////////////////
     C     EQD31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EEQD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQD
      *
     C     KEYMS2        READE     EEQD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FII GROUP:02                                       FII02 /
      *////////////////////////////////////////////////////////////
     C     FII02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EFII01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFII01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FII
      *
     C     KEYMS1        READE     EFII01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FII GROUP:08                                       FII08 /
      *////////////////////////////////////////////////////////////
     C     FII08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EFII01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFII01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FII
      *
     C     KEYMS1        READE     EFII01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FII GROUP:35                                       FII35 /
      *////////////////////////////////////////////////////////////
     C     FII35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     EFII01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFII01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FII
      *
     C     KEYMS2        READE     EFII01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:01                                       FTX01 /
      *////////////////////////////////////////////////////////////
     C     FTX01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:16                                       FTX16 /
      *////////////////////////////////////////////////////////////
     C     FTX16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:23                                       FTX23 /
      *////////////////////////////////////////////////////////////
     C     FTX23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:24                                       FTX24 /
      *////////////////////////////////////////////////////////////
     C     FTX24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:25                                       FTX25 /
      *////////////////////////////////////////////////////////////
     C     FTX25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:26                                       FTX26 /
      *////////////////////////////////////////////////////////////
     C     FTX26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:39                                       FTX39 /
      *////////////////////////////////////////////////////////////
     C     FTX39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:48                                       FTX48 /
      *////////////////////////////////////////////////////////////
     C     FTX48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:49                                       FTX49 /
      *////////////////////////////////////////////////////////////
     C     FTX49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:53                                       FTX53 /
      *////////////////////////////////////////////////////////////
     C     FTX53         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     53            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:15                                       GIN15 /
      *////////////////////////////////////////////////////////////
     C     GIN15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EGIN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGIN01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS2        READE     EGIN01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:26                                       GIN26 /
      *////////////////////////////////////////////////////////////
     C     GIN26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EGIN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIN01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS1        READE     EGIN01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:32                                       GIN32 /
      *////////////////////////////////////////////////////////////
     C     GIN32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     32            ZGN3
     C     KEYMS3        SETLL     EGIN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EGIN01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS3        READE     EGIN01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIR GROUP:00                                       GIR00 /
      *////////////////////////////////////////////////////////////
     C     GIR00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EGIR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGIR01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GIR
      *
     C     KEYMS0        READE     EGIR01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIR GROUP:01                                       GIR01 /
      *////////////////////////////////////////////////////////////
     C     GIR01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EGIR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIR01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIR
      *
     C     KEYMS1        READE     EGIR01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIR GROUP:26                                       GIR26 /
      *////////////////////////////////////////////////////////////
     C     GIR26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EGIR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIR01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIR
      *
     C     KEYMS1        READE     EGIR01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIR GROUP:49                                       GIR49 /
      *////////////////////////////////////////////////////////////
     C     GIR49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EGIR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGIR01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GIR
      *
     C     KEYMS2        READE     EGIR01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIS GROUP:00                                       GIS00 /
      *////////////////////////////////////////////////////////////
     C     GIS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EGIS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGIS01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GIS
      *
     C     KEYMS0        READE     EGIS01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIS GROUP:49                                       GIS49 /
      *////////////////////////////////////////////////////////////
     C     GIS49         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     49            ZGN1
     C     KEYMS1        SETLL     EGIS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIS01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIS
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      RFF49
     C                   EXSR      DTM49
     C                   EXSR      GIR49
     C                   EXSR      LOC49
     C                   EXSR      MEA49
     C                   EXSR      QTY49
     C                   EXSR      FTX49
     C                   EXSR      MOA49
      *
     C     KEYMS1        READE     EGIS01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:00                                       IMD00 /
      *////////////////////////////////////////////////////////////
     C     IMD00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EIMD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EIMD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS0        READE     EIMD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:26                                       IMD26 /
      *////////////////////////////////////////////////////////////
     C     IMD26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EIMD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EIMD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS1        READE     EIMD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  INP GROUP:25                                       INP25 /
      *////////////////////////////////////////////////////////////
     C     INP25         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     25            ZGN0
     C     KEYMS0        SETLL     EINP01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EINP01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      INP
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      FTX25
      *
     C     KEYMS0        READE     EINP01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LIN GROUP:26                                       LIN26 /
      *////////////////////////////////////////////////////////////
     C     LIN26         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     26            ZGN0
     C     KEYMS0        SETLL     ELIN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ELIN01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      LIN
     C                   Z-ADD     LREP0         ZREPB0
     C                   EXSR      PIA26
     C                   EXSR      PGI26
     C                   EXSR      IMD26
     C                   EXSR      MEA26
     C                   EXSR      QTY26
     C                   EXSR      PCD26
     C                   EXSR      ALI26
     C                   EXSR      DTM26
     C                   EXSR      GIN26
     C                   EXSR      GIR26
     C                   EXSR      QVR26
     C                   EXSR      EQD26
     C                   EXSR      FTX26
     C                   EXSR      DGS26
     C                   EXSR      MOA27
     C                   EXSR      PAT28
     C                   EXSR      PRI29
     C                   EXSR      RFF30
     C                   EXSR      PAC31
     C                   EXSR      LOC33
     C                   EXSR      TAX34
     C                   EXSR      NAD35
     C                   EXSR      ALC39
     C                   EXSR      TDT45
     C                   EXSR      TOD47
     C                   EXSR      RCS48
     C                   EXSR      GIS49
      *
     C     KEYMS0        READE     ELIN01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:00                                       LOC00 /
      *////////////////////////////////////////////////////////////
     C     LOC00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ELOC01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS0        READE     ELOC01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:01                                       LOC01 /
      *////////////////////////////////////////////////////////////
     C     LOC01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:06                                       LOC06 /
      *////////////////////////////////////////////////////////////
     C     LOC06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:10                                       LOC10 /
      *////////////////////////////////////////////////////////////
     C     LOC10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM10
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:12                                       LOC12 /
      *////////////////////////////////////////////////////////////
     C     LOC12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:33                                       LOC33 /
      *////////////////////////////////////////////////////////////
     C     LOC33         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     33            ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      QTY33
     C                   EXSR      DTM33
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:34                                       LOC34 /
      *////////////////////////////////////////////////////////////
     C     LOC34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:35                                       LOC35 /
      *////////////////////////////////////////////////////////////
     C     LOC35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:46                                       LOC46 /
      *////////////////////////////////////////////////////////////
     C     LOC46         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     46            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPD0
     C                   Z-ADD     LREP1         ZREPD1
     C                   Z-ADD     LREP2         ZREPD2
     C                   EXSR      DTM46
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:47                                       LOC47 /
      *////////////////////////////////////////////////////////////
     C     LOC47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:49                                       LOC49 /
      *////////////////////////////////////////////////////////////
     C     LOC49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:01                                       MEA01 /
      *////////////////////////////////////////////////////////////
     C     MEA01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:14                                       MEA14 /
      *////////////////////////////////////////////////////////////
     C     MEA14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:26                                       MEA26 /
      *////////////////////////////////////////////////////////////
     C     MEA26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:31                                       MEA31 /
      *////////////////////////////////////////////////////////////
     C     MEA31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:49                                       MEA49 /
      *////////////////////////////////////////////////////////////
     C     MEA49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:01                                       MOA01 /
      *////////////////////////////////////////////////////////////
     C     MOA01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:02                                       MOA02 /
      *////////////////////////////////////////////////////////////
     C     MOA02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:06                                       MOA06 /
      *////////////////////////////////////////////////////////////
     C     MOA06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:08                                       MOA08 /
      *////////////////////////////////////////////////////////////
     C     MOA08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:20                                       MOA20 /
      *////////////////////////////////////////////////////////////
     C     MOA20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      RNG20
     C                   EXSR      CUX20
     C                   EXSR      DTM20
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:22                                       MOA22 /
      *////////////////////////////////////////////////////////////
     C     MOA22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:27                                       MOA27 /
      *////////////////////////////////////////////////////////////
     C     MOA27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      CUX27
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:28                                       MOA28 /
      *////////////////////////////////////////////////////////////
     C     MOA28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:34                                       MOA34 /
      *////////////////////////////////////////////////////////////
     C     MOA34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:42                                       MOA42 /
      *////////////////////////////////////////////////////////////
     C     MOA42         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     42            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      RNG42
     C                   EXSR      CUX42
     C                   EXSR      DTM42
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:44                                       MOA44 /
      *////////////////////////////////////////////////////////////
     C     MOA44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:49                                       MOA49 /
      *////////////////////////////////////////////////////////////
     C     MOA49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:50                                       MOA50 /
      *////////////////////////////////////////////////////////////
     C     MOA50         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     50            ZGN0
     C     KEYMS0        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPD0
     C                   EXSR      RFF51
      *
     C     KEYMS0        READE     EMOA01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:52                                       MOA52 /
      *////////////////////////////////////////////////////////////
     C     MOA52         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     52            ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:53                                       MOA53 /
      *////////////////////////////////////////////////////////////
     C     MOA53         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     53            ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:02                                       NAD02 /
      *////////////////////////////////////////////////////////////
     C     NAD02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ENAD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPB0
     C                   EXSR      LOC02
     C                   EXSR      FII02
     C                   EXSR      MOA02
     C                   EXSR      RFF03
     C                   EXSR      DOC04
     C                   EXSR      CTA05
      *
     C     KEYMS0        READE     ENAD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:35                                       NAD35 /
      *////////////////////////////////////////////////////////////
     C     NAD35         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     35            ZGN1
     C     KEYMS1        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC35
     C                   EXSR      FII35
     C                   EXSR      RFF36
     C                   EXSR      DOC37
     C                   EXSR      CTA38
      *
     C     KEYMS1        READE     ENAD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:14                                       PAC14 /
      *////////////////////////////////////////////////////////////
     C     PAC14         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     14            ZGN0
     C     KEYMS0        SETLL     EPAC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAC01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      MEA14
     C                   EXSR      EQD14
     C                   EXSR      PCI15
      *
     C     KEYMS0        READE     EPAC01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:31                                       PAC31 /
      *////////////////////////////////////////////////////////////
     C     PAC31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     EPAC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      MEA31
     C                   EXSR      EQD31
     C                   EXSR      PCI32
      *
     C     KEYMS1        READE     EPAC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAI GROUP:00                                       PAI00 /
      *////////////////////////////////////////////////////////////
     C     PAI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EPAI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAI01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAI
      *
     C     KEYMS0        READE     EPAI01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAI GROUP:08                                       PAI08 /
      *////////////////////////////////////////////////////////////
     C     PAI08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EPAI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAI
      *
     C     KEYMS1        READE     EPAI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:08                                       PAT08 /
      *////////////////////////////////////////////////////////////
     C     PAT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     EPAT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM08
     C                   EXSR      PCD08
     C                   EXSR      MOA08
     C                   EXSR      PAI08
     C                   EXSR      FII08
      *
     C     KEYMS0        READE     EPAT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:27                                       PAT28 /
      *////////////////////////////////////////////////////////////
     C     PAT28         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     28            ZGN1
     C     KEYMS1        SETLL     EPAT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAT01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      DTM28
     C                   EXSR      PCD28
     C                   EXSR      MOA28
      *
     C     KEYMS1        READE     EPAT01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:08                                       PCD08 /
      *////////////////////////////////////////////////////////////
     C     PCD08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:19                                       PCD19 /
      *////////////////////////////////////////////////////////////
     C     PCD19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RNG19
      *
     C     KEYMS1        READE     EPCD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:26                                       PCD26 /
      *////////////////////////////////////////////////////////////
     C     PCD26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:28                                       PCD28 /
      *////////////////////////////////////////////////////////////
     C     PCD28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:41                                       PCD41 /
      *////////////////////////////////////////////////////////////
     C     PCD41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RNG41
      *
     C     KEYMS2        READE     EPCD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:15                                       PCI15 /
      *////////////////////////////////////////////////////////////
     C     PCI15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EPCI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RFF15
     C                   EXSR      DTM15
     C                   EXSR      GIN15
      *
     C     KEYMS1        READE     EPCI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:32                                       PCI32 /
      *////////////////////////////////////////////////////////////
     C     PCI32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EPCI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RFF32
     C                   EXSR      DTM32
     C                   EXSR      GIN32
      *
     C     KEYMS2        READE     EPCI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PGI GROUP:26                                       PGI26 /
      *////////////////////////////////////////////////////////////
     C     PGI26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EPGI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPGI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PGI
      *
     C     KEYMS1        READE     EPGI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:26                                       PIA26 /
      *////////////////////////////////////////////////////////////
     C     PIA26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EPIA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPIA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS1        READE     EPIA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:29                                       PRI29 /
      *////////////////////////////////////////////////////////////
     C     PRI29         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     29            ZGN1
     C     KEYMS1        SETLL     EPRI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      CUX29
     C                   EXSR      APR29
     C                   EXSR      RNG29
     C                   EXSR      DTM29
      *
     C     KEYMS1        READE     EPRI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:01                                       QTY01 /
      *////////////////////////////////////////////////////////////
     C     QTY01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:18                                       QTY18 /
      *////////////////////////////////////////////////////////////
     C     QTY18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPC0
     C                   Z-ADD     QREP1         ZREPC1
     C                   EXSR      RNG18
      *
     C     KEYMS1        READE     EQTY01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:26                                       QTY26 /
      *////////////////////////////////////////////////////////////
     C     QTY26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:33                                       QTY33 /
      *////////////////////////////////////////////////////////////
     C     QTY33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:40                                       QTY40 /
      *////////////////////////////////////////////////////////////
     C     QTY40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPD0
     C                   Z-ADD     QREP1         ZREPD1
     C                   Z-ADD     QREP2         ZREPD2
     C                   EXSR      RNG40
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:49                                       QTY49 /
      *////////////////////////////////////////////////////////////
     C     QTY49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QVR GROUP:26                                       QVR26 /
      *////////////////////////////////////////////////////////////
     C     QVR26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EQVR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQVR01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QVR
      *
     C     KEYMS1        READE     EQVR01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RCS GROUP:23                                       RCS23 /
      *////////////////////////////////////////////////////////////
     C     RCS23         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     23            ZGN0
     C     KEYMS0        SETLL     ERCS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERCS01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RCS
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      RFF23
     C                   EXSR      DTM23
     C                   EXSR      FTX23
      *
     C     KEYMS0        READE     ERCS01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RCS GROUP:48                                       RCS48 /
      *////////////////////////////////////////////////////////////
     C     RCS48         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     48            ZGN1
     C     KEYMS1        SETLL     ERCS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERCS01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RCS
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RFF48
     C                   EXSR      DTM48
     C                   EXSR      FTX48
      *
     C     KEYMS1        READE     ERCS01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
     C                   EXSR      GIR01
     C                   EXSR      LOC01
     C                   EXSR      MEA01
     C                   EXSR      QTY01
     C                   EXSR      FTX01
     C                   EXSR      MOA01
     C                   EXSR      RTE01
      *
     C     KEYMS0        READE     ERFF01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:03                                       RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:11                                       RFF11 /
      *////////////////////////////////////////////////////////////
     C     RFF11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM11
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:15                                       RFF15 /
      *////////////////////////////////////////////////////////////
     C     RFF15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:17                                       RFF17 /
      *////////////////////////////////////////////////////////////
     C     RFF17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM17
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:23                                       RFF23 /
      *////////////////////////////////////////////////////////////
     C     RFF23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:30                                       RFF30 /
      *////////////////////////////////////////////////////////////
     C     RFF30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM30
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:32                                       RFF32 /
      *////////////////////////////////////////////////////////////
     C     RFF32         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     32            ZGN3
     C     KEYMS3        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:36                                       RFF36 /
      *////////////////////////////////////////////////////////////
     C     RFF36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM36
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:48                                       RFF48 /
      *////////////////////////////////////////////////////////////
     C     RFF48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:49                                       RFF49 /
      *////////////////////////////////////////////////////////////
     C     RFF49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:51                                       RFF51 /
      *////////////////////////////////////////////////////////////
     C     RFF51         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     51            ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM51
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:18                                       RNG18 /
      *////////////////////////////////////////////////////////////
     C     RNG18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:19                                       RNG19 /
      *////////////////////////////////////////////////////////////
     C     RNG19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:20                                       RNG20 /
      *////////////////////////////////////////////////////////////
     C     RNG20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:21                                       RNG21 /
      *////////////////////////////////////////////////////////////
     C     RNG21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:29                                       RNG29 /
      *////////////////////////////////////////////////////////////
     C     RNG29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:40                                       RNG40 /
      *////////////////////////////////////////////////////////////
     C     RNG40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:41                                       RNG41 /
      *////////////////////////////////////////////////////////////
     C     RNG41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:42                                       RNG42 /
      *////////////////////////////////////////////////////////////
     C     RNG42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:43                                       RNG43 /
      *////////////////////////////////////////////////////////////
     C     RNG43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:01                                       RTE01 /
      *////////////////////////////////////////////////////////////
     C     RTE01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERTE01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RTE
      *
     C     KEYMS1        READE     ERTE01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:21                                       RTE21 /
      *////////////////////////////////////////////////////////////
     C     RTE21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERTE01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RNG21
      *
     C     KEYMS1        READE     ERTE01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:43                                       RTE43 /
      *////////////////////////////////////////////////////////////
     C     RTE43         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     43            ZGN2
     C     KEYMS2        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERTE01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      RNG43
      *
     C     KEYMS2        READE     ERTE01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:13                                       SEL13 /
      *////////////////////////////////////////////////////////////
     C     SEL13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     ESEL01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    UMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'INVOIC'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      DTM00
     C                   EXSR      PAI00
     C                   EXSR      ALI00
     C                   EXSR      IMD00
     C                   EXSR      FTX00
     C                   EXSR      LOC00
     C                   EXSR      GIS00
     C                   EXSR      DGS00
     C                   EXSR      GIR00
     C                   EXSR      RFF01
     C                   EXSR      NAD02
     C                   EXSR      TAX06
     C                   EXSR      CUX07
     C                   EXSR      PAT08
     C                   EXSR      TDT09
     C                   EXSR      TOD12
     C                   EXSR      EQD13
     C                   EXSR      PAC14
     C                   EXSR      ALC16
     C                   EXSR      RCS23
     C                   EXSR      AJT24
     C                   EXSR      INP25
     C                   EXSR      LIN26
     C                   EXSR      UNS00
     C                   EXSR      CNT00
     C                   EXSR      MOA49
     C                   EXSR      TAX52
     C                   EXSR      ALC53
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
N01  C     WCHAR         IFEQ      ';'
N01  C                   MOVE      ':'           WCHAR
N01  C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:06                                       TAX06 /
      *////////////////////////////////////////////////////////////
     C     TAX06         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     6             ZGN0
     C     KEYMS0        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETAX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      MOA06
     C                   EXSR      LOC06
      *
     C     KEYMS0        READE     ETAX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:22                                       TAX22 /
      *////////////////////////////////////////////////////////////
     C     TAX22         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     22            ZGN1
     C     KEYMS1        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA22
      *
     C     KEYMS1        READE     ETAX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:34                                       TAX34 /
      *////////////////////////////////////////////////////////////
     C     TAX34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA34
     C                   EXSR      LOC34
      *
     C     KEYMS1        READE     ETAX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:44                                       TAX44 /
      *////////////////////////////////////////////////////////////
     C     TAX44         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     44            ZGN2
     C     KEYMS2        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA44
      *
     C     KEYMS2        READE     ETAX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:52                                       TAX52 /
      *////////////////////////////////////////////////////////////
     C     TAX52         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     52            ZGN0
     C     KEYMS0        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETAX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      MOA52
      *
     C     KEYMS0        READE     ETAX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:09                                       TDT09 /
      *////////////////////////////////////////////////////////////
     C     TDT09         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     9             ZGN0
     C     KEYMS0        SETLL     ETDT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC10
     C                   EXSR      RFF11
      *
     C     KEYMS0        READE     ETDT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:45                                       TDT45 /
      *////////////////////////////////////////////////////////////
     C     TDT45         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     45            ZGN1
     C     KEYMS1        SETLL     ETDT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC46
      *
     C     KEYMS1        READE     ETDT01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:12                                       TOD12 /
      *////////////////////////////////////////////////////////////
     C     TOD12         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     12            ZGN0
     C     KEYMS0        SETLL     ETOD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETOD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC12
      *
     C     KEYMS0        READE     ETOD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:47                                       TOD47 /
      *////////////////////////////////////////////////////////////
     C     TOD47         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     47            ZGN1
     C     KEYMS1        SETLL     ETOD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC47
      *
     C     KEYMS1        READE     ETOD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  UNS GROUP:00. FORTLØPENDE NUMMERERING              UNS00 /
      *////////////////////////////////////////////////////////////
     C     UNS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     50            ZGN0
     C     KEYMS0        SETLL     EUNS                                   20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EUNS                                   51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      UNS
      *
     C     KEYMS0        READE     EUNS                                   51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      /COPY QEDSRC,AJT_O_01B
      /COPY QEDSRC,ALC_O_01B
      /COPY QEDSRC,ALI_O_01B
      /COPY QEDSRC,APR_O_01B
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,CNT_O_01B
      /COPY QEDSRC,COM_O_01B
      /COPY QEDSRC,CTA_O_01B
      /COPY QEDSRC,CUX_O_01B
      /COPY QEDSRC,DGS_O_01B
      /COPY QEDSRC,DOC_O_01B
      /COPY QEDSRC,DTM_O_01B
      /COPY QEDSRC,EQD_O_01B
      /COPY QEDSRC,FII_O_01B
      /COPY QEDSRC,FTX_O_01B
      /COPY QEDSRC,GIN_O_01B
      /COPY QEDSRC,GIR_O_01B
      /COPY QEDSRC,GIS_O_01B
      /COPY QEDSRC,IMD_O_01B
      /COPY QEDSRC,INP_O_01B
      /COPY QEDSRC,LIN_O_01B
      /COPY QEDSRC,LOC_O_01B
      /COPY QEDSRC,MEA_O_01B
      /COPY QEDSRC,MOA_O_01B
      /COPY QEDSRC,NAD_O_01B
      /COPY QEDSRC,PAC_O_01B
      /COPY QEDSRC,PAI_O_01B
      /COPY QEDSRC,PAT_O_01B
      /COPY QEDSRC,PCD_O_01B
      /COPY QEDSRC,PCI_O_01B
      /COPY QEDSRC,PGI_O_01B
      /COPY QEDSRC,PIA_O_01B
      /COPY QEDSRC,PRI_O_01B
      /COPY QEDSRC,QTY_O_01B
      /COPY QEDSRC,QVR_O_01B
      /COPY QEDSRC,RCS_O_01B
      /COPY QEDSRC,RFF_O_01B
      /COPY QEDSRC,RNG_O_01B
      /COPY QEDSRC,RTE_O_01B
      /COPY QEDSRC,SEL_O_01B
      /COPY QEDSRC,TAX_O_01B
      /COPY QEDSRC,TDT_O_01B
      /COPY QEDSRC,TOD_O_01B
      /COPY QEDSRC,TSR_O_01B
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNS_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
