     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FECNT95A   IF   E           K DISK
     FECOM95A   IF   E           K DISK
     FECPI95A   IF   E           K DISK
     FECTA95A   IF   E           K DISK
     FECUX95A   IF   E           K DISK
     FEDGS95A   IF   E           K DISK
     FEDIM95A   IF   E           K DISK
     FEDOC95A   IF   E           K DISK
     FEDTM95A   IF   E           K DISK
     FEEQA95A   IF   E           K DISK
     FEEQD95A   IF   E           K DISK
     FEEQN95A   IF   E           K DISK
     FEFTX95A   IF   E           K DISK
     FEGDS95A   IF   E           K DISK
     FEGID95A   IF   E           K DISK
     FEGOR95A   IF   E           K DISK
     FEHAN95A   IF   E           K DISK
     FELOC95A   IF   E           K DISK
     FEMEA95A   IF   E           K DISK
     FEMOA95A   IF   E           K DISK
     FENAD95A   IF   E           K DISK
     FEPCD95A   IF   E           K DISK
     FEPCI95A   IF   E           K DISK
     FEPIA95A   IF   E           K DISK
     FEPRI95A   IF   E           K DISK
     FEQTY95A   IF   E           K DISK
     FERFF95A   IF   E           K DISK
     FERNG95A   IF   E           K DISK
     FESEL95A   IF   E           K DISK
     FESGP95A   IF   E           K DISK
     FETCC95A   IF   E           K DISK
     FETDT95A   IF   E           K DISK
     FETMD95A   IF   E           K DISK
     FETMP95A   IF   E           K DISK
     FETOD95A   IF   E           K DISK
     FETPL95A   IF   E           K DISK
     FETSR95A   IF   E           K DISK
     FEDISE     O  A E             DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
      *________________________________________
      * Renaming av felt
      *""""""""""""""""""""""""""""""""""""""""
     IEDIMR
     I              M5004D                      M500ØØ
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00                                       CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:00                                       COM00 /
      *////////////////////////////////////////////////////////////
     C     COM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECOM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECOM95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS0        READE     ECOM95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:12                                       COM12 /
      *////////////////////////////////////////////////////////////
     C     COM12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ECOM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:33                                       COM33 /
      *////////////////////////////////////////////////////////////
     C     COM33         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     33            ZGN3
     C     KEYMS2        SETLL     ECOM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:40                                       COM40 /
      *////////////////////////////////////////////////////////////
     C     COM40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS2        SETLL     ECOM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:06                                       CPI06 /
      *////////////////////////////////////////////////////////////
     C     CPI06         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     6             ZGN0
     C     KEYMS0        SETLL     ECPI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECPI95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      CUX06
     C                   EXSR      LOC06
     C                   EXSR      MOA06
      *
     C     KEYMS0        READE     ECPI95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CPI GROUP:16                                       CPI16 /
      *////////////////////////////////////////////////////////////
     C     CPI16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     ECPI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECPI95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CPI
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      CUX16
     C                   EXSR      LOC16
     C                   EXSR      MOA16
      *
     C     KEYMS1        READE     ECPI95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:00                                       CTA00 /
      *////////////////////////////////////////////////////////////
     C     CTA00         BEGSR
     C                   Z-ADD     0             ZGN0
     C                   Z-ADD     CREP1         ZREPC1
     C     KEYMS0        CHAIN     ECTA95A                            51
     C     *IN51         IFEQ      '0'
      *
     C                   EXSR      CTA
      *
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:08                                       CTA08 /
      *////////////////////////////////////////////////////////////
     C     CTA08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ECTA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
      *
     C     KEYMS1        READE     ECTA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:12                                       CTA12 /
      *////////////////////////////////////////////////////////////
     C     CTA12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     ECTA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM12
      *
     C     KEYMS1        READE     ECTA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:33                                       CTA33 /
      *////////////////////////////////////////////////////////////
     C     CTA33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ECTA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM33
      *
     C     KEYMS2        READE     ECTA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:40                                       CTA40 /
      *////////////////////////////////////////////////////////////
     C     CTA40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     ECTA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM40
      *
     C     KEYMS2        READE     ECTA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:00                                       CUX00 /
      *////////////////////////////////////////////////////////////
     C     CUX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECUX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECUX95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS0        READE     ECUX95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:06                                       CUX06 /
      *////////////////////////////////////////////////////////////
     C     CUX06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     ECUX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS1        READE     ECUX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:07                                       CUX07 /
      *////////////////////////////////////////////////////////////
     C     CUX07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     ECUX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS1        READE     ECUX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:16                                       CUX16 /
      *////////////////////////////////////////////////////////////
     C     CUX16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     ECUX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:31                                       CUX31 /
      *////////////////////////////////////////////////////////////
     C     CUX31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ECUX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:32                                       DGS32 /
      *////////////////////////////////////////////////////////////
     C     DGS32         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     32            ZGN1
     C     KEYMS1        SETLL     EDGS95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDGS95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DGS
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      FTX32
     C                   EXSR      CTA33
     C                   EXSR      MEA34
     C                   EXSR      SGP35
      *
     C     KEYMS1        READE     EDGS95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:15                                       DIM15 /
      *////////////////////////////////////////////////////////////
     C     DIM15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EDIM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
      *
     C     KEYMS1        READE     EDIM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:21                                       DIM21 /
      *////////////////////////////////////////////////////////////
     C     DIM21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     EDIM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      EQN21
      *
     C     KEYMS1        READE     EDIM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DIM GROUP:37                                       DIM37 /
      *////////////////////////////////////////////////////////////
     C     DIM37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EDIM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDIM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DIM
      *
     C     KEYMS1        READE     EDIM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:00                                       DOC00 /
      *////////////////////////////////////////////////////////////
     C     DOC00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDOC95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DOC
      *
     C     KEYMS0        READE     EDOC95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:05                                       DOC05 /
      *////////////////////////////////////////////////////////////
     C     DOC05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EDOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM05
      *
     C     KEYMS1        READE     EDOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:13                                       DOC13 /
      *////////////////////////////////////////////////////////////
     C     DOC13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EDOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM13
      *
     C     KEYMS1        READE     EDOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:24                                       DOC24 /
      *////////////////////////////////////////////////////////////
     C     DOC24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     EDOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM24
      *
     C     KEYMS1        READE     EDOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:26                                       DOC26 /
      *////////////////////////////////////////////////////////////
     C     DOC26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EDOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      DTM26
      *
     C     KEYMS2        READE     EDOC95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:04                                       DTM04 /
      *////////////////////////////////////////////////////////////
     C     DTM04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:05                                       DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:08                                       DTM08 /
      *////////////////////////////////////////////////////////////
     C     DTM08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:09                                       DTM09 /
      *////////////////////////////////////////////////////////////
     C     DTM09         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     9             ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:10                                       DTM10 /
      *////////////////////////////////////////////////////////////
     C     DTM10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:13                                       DTM13 /
      *////////////////////////////////////////////////////////////
     C     DTM13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:15                                       DTM15 /
      *////////////////////////////////////////////////////////////
     C     DTM15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:19                                       DTM19 /
      *////////////////////////////////////////////////////////////
     C     DTM19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:22                                       DTM22 /
      *////////////////////////////////////////////////////////////
     C     DTM22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:23                                       DTM23 /
      *////////////////////////////////////////////////////////////
     C     DTM23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:24                                       DTM24 /
      *////////////////////////////////////////////////////////////
     C     DTM24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:25                                       DTM25 /
      *////////////////////////////////////////////////////////////
     C     DTM25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:26                                       DTM26 /
      *////////////////////////////////////////////////////////////
     C     DTM26         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     26            ZGN3
     C     KEYMS3        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:39                                       DTM39 /
      *////////////////////////////////////////////////////////////
     C     DTM39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EDTM95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQA GROUP:41                                       EQA41 /
      *////////////////////////////////////////////////////////////
     C     EQA41         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     41            ZGN1
     C     KEYMS1        SETLL     EEQA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQA
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      EQN41
      *
     C     KEYMS1        READE     EEQA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:37                                       EQD37 /
      *////////////////////////////////////////////////////////////
     C     EQD37         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     37            ZGN0
     C     KEYMS0        SETLL     EEQD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      EQN37
     C                   EXSR      TMD37
     C                   EXSR      MEA37
     C                   EXSR      DIM37
     C                   EXSR      SEL37
     C                   EXSR      TPL37
     C                   EXSR      HAN37
     C                   EXSR      TMP37
     C                   EXSR      FTX37
     C                   EXSR      TCC38
     C                   EXSR      NAD39
     C                   EXSR      EQA41
      *
     C     KEYMS0        READE     EEQD95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:07                                       EQN07 /
      *////////////////////////////////////////////////////////////
     C     EQN07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:14                                       EQN14 /
      *////////////////////////////////////////////////////////////
     C     EQN14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:20                                       EQN20 /
      *////////////////////////////////////////////////////////////
     C     EQN20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:21                                       EQN21 /
      *////////////////////////////////////////////////////////////
     C     EQN21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:28                                       EQN28 /
      *////////////////////////////////////////////////////////////
     C     EQN28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:30                                       EQN30 /
      *////////////////////////////////////////////////////////////
     C     EQN30         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     30            ZGN3
     C     KEYMS3        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:31                                       EQN31 /
      *////////////////////////////////////////////////////////////
     C     EQN31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:34                                       EQN34 /
      *////////////////////////////////////////////////////////////
     C     EQN34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN3
     C     KEYMS3        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EEQN95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS3        READE     EEQN95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:36                                       EQN36 /
      *////////////////////////////////////////////////////////////
     C     EQN36         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     36            ZGN4
     C     KEYMS4        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EEQN95A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS4        READE     EEQN95A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:37                                       EQN37 /
      *////////////////////////////////////////////////////////////
     C     EQN37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQN95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS1        READE     EEQN95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:38                                       EQN38 /
      *////////////////////////////////////////////////////////////
     C     EQN38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQN GROUP:41                                       EQN41 /
      *////////////////////////////////////////////////////////////
     C     EQN41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EEQN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEQN95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EQN
      *
     C     KEYMS2        READE     EEQN95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:04                                       FTX04 /
      *////////////////////////////////////////////////////////////
     C     FTX04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:07                                       FTX07 /
      *////////////////////////////////////////////////////////////
     C     FTX07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:17                                       FTX17 /
      *////////////////////////////////////////////////////////////
     C     FTX17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:18                                       FTX18 /
      *////////////////////////////////////////////////////////////
     C     FTX18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:25                                       FTX25 /
      *////////////////////////////////////////////////////////////
     C     FTX25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:32                                       FTX32 /
      *////////////////////////////////////////////////////////////
     C     FTX32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:37                                       FTX37 /
      *////////////////////////////////////////////////////////////
     C     FTX37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EFTX95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GDS GROUP:19                                       GDS19 /
      *////////////////////////////////////////////////////////////
     C     GDS19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EGDS95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGDS95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GDS
      *
     C     KEYMS1        READE     EGDS95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GID GROUP:18                                       GID18 /
      *////////////////////////////////////////////////////////////
     C     GID18         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     18            ZGN0
     C     KEYMS0        SETLL     EGID95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGID95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GID
     C                   Z-ADD     GREP0         ZREPB0
     C                   EXSR      HAN18
     C                   EXSR      TMP18
     C                   EXSR      RNG18
     C                   EXSR      TMD18
     C                   EXSR      LOC18
     C                   EXSR      MOA18
     C                   EXSR      PIA18
     C                   EXSR      FTX18
     C                   EXSR      NAD19
     C                   EXSR      GDS19
     C                   EXSR      MEA20
     C                   EXSR      DIM21
     C                   EXSR      RFF22
     C                   EXSR      PCI23
     C                   EXSR      DOC24
     C                   EXSR      GOR25
     C                   EXSR      TPL27
     C                   EXSR      SGP29
     C                   EXSR      TCC31
     C                   EXSR      DGS32
      *
     C     KEYMS0        READE     EGID95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:04                                       GOR04 /
      *////////////////////////////////////////////////////////////
     C     GOR04         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     4             ZGN0
     C     KEYMS0        SETLL     EGOR95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EGOR95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPB0
     C                   EXSR      DTM04
     C                   EXSR      LOC04
     C                   EXSR      SEL04
     C                   EXSR      FTX04
     C                   EXSR      DOC05
      *
     C     KEYMS0        READE     EGOR95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GOR GROUP:25                                       GOR25 /
      *////////////////////////////////////////////////////////////
     C     GOR25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EGOR95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGOR95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GOR
     C                   Z-ADD     GREP0         ZREPC0
     C                   Z-ADD     GREP1         ZREPC1
     C                   EXSR      DTM25
     C                   EXSR      LOC25
     C                   EXSR      SEL25
     C                   EXSR      FTX25
     C                   EXSR      DOC26
      *
     C     KEYMS1        READE     EGOR95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:18                                       HAN18 /
      *////////////////////////////////////////////////////////////
     C     HAN18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EHAN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EHAN95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS1        READE     EHAN95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:37                                       HAN37 /
      *////////////////////////////////////////////////////////////
     C     HAN37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EHAN95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EHAN95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS1        READE     EHAN95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:01                                       LOC01 /
      *////////////////////////////////////////////////////////////
     C     LOC01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ELOC95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ELOC95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:04                                       LOC04 /
      *////////////////////////////////////////////////////////////
     C     LOC04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:06                                       LOC06 /
      *////////////////////////////////////////////////////////////
     C     LOC06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:07                                       LOC07 /
      *////////////////////////////////////////////////////////////
     C     LOC07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:09                                       LOC09 /
      *////////////////////////////////////////////////////////////
     C     LOC09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM09
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:11                                       LOC11 /
      *////////////////////////////////////////////////////////////
     C     LOC11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:16                                       LOC16 /
      *////////////////////////////////////////////////////////////
     C     LOC16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:17                                       LOC17 /
      *////////////////////////////////////////////////////////////
     C     LOC17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:18                                       LOC18 /
      *////////////////////////////////////////////////////////////
     C     LOC18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:25                                       LOC25 /
      *////////////////////////////////////////////////////////////
     C     LOC25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:31                                       LOC31 /
      *////////////////////////////////////////////////////////////
     C     LOC31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ELOC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:14                                       MEA14 /
      *////////////////////////////////////////////////////////////
     C     MEA14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:20                                       MEA20 /
      *////////////////////////////////////////////////////////////
     C     MEA20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      EQN20
      *
     C     KEYMS1        READE     EMEA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:28                                       MEA28 /
      *////////////////////////////////////////////////////////////
     C     MEA28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA95A                                52
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN28
      *
     C     KEYMS2        READE     EMEA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:30                                       MEA30 /
      *////////////////////////////////////////////////////////////
     C     MEA30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA95A                                52
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN30
      *
     C     KEYMS2        READE     EMEA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:34                                       MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      EQN34
      *
     C     KEYMS2        READE     EMEA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:36                                       MEA36 /
      *////////////////////////////////////////////////////////////
     C     MEA36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA95A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      EQN36
      *
     C     KEYMS3        READE     EMEA95A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:37                                       MEA37 /
      *////////////////////////////////////////////////////////////
     C     MEA37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     EMEA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:00                                       MOA00 /
      *////////////////////////////////////////////////////////////
     C     MOA00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS0        READE     EMOA95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:06                                       MOA06 /
      *////////////////////////////////////////////////////////////
     C     MOA06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:07                                       MOA07 /
      *////////////////////////////////////////////////////////////
     C     MOA07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:11                                       MOA11 /
      *////////////////////////////////////////////////////////////
     C     MOA11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:14                                       MOA14 /
      *////////////////////////////////////////////////////////////
     C     MOA14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:16                                       MOA16 /
      *////////////////////////////////////////////////////////////
     C     MOA16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:18                                       MOA18 /
      *////////////////////////////////////////////////////////////
     C     MOA18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:31                                       MOA31 /
      *////////////////////////////////////////////////////////////
     C     MOA31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:38                                       MOA38 /
      *////////////////////////////////////////////////////////////
     C     MOA38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EMOA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:11                                       NAD11 /
      *////////////////////////////////////////////////////////////
     C     NAD11         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     11            ZGN0
     C     KEYMS0        SETLL     ENAD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ENAD95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPB0
     C                   EXSR      LOC11
     C                   EXSR      MOA11
     C                   EXSR      CTA12
     C                   EXSR      DOC13
     C                   EXSR      TCC14
     C                   EXSR      RFF15
     C                   EXSR      CPI16
     C                   EXSR      TSR17
      *
     C     KEYMS0        READE     ENAD95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:19                                       NAD19 /
      *////////////////////////////////////////////////////////////
     C     NAD19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ENAD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      DTM19
      *
     C     KEYMS1        READE     ENAD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:39                                       NAD39 /
      *////////////////////////////////////////////////////////////
     C     NAD39         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     39            ZGN1
     C     KEYMS1        SETLL     ENAD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      DTM39
     C                   EXSR      CTA40
      *
     C     KEYMS1        READE     ENAD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:07                                       PCD07 /
      *////////////////////////////////////////////////////////////
     C     PCD07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPCD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:14                                       PCD14 /
      *////////////////////////////////////////////////////////////
     C     PCD14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EPCD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:31                                       PCD31 /
      *////////////////////////////////////////////////////////////
     C     PCD31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EPCD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:38                                       PCD38 /
      *////////////////////////////////////////////////////////////
     C     PCD38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EPCD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:23                                       PCI23 /
      *////////////////////////////////////////////////////////////
     C     PCI23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     EPCI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCI95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RFF23
     C                   EXSR      DTM23
      *
     C     KEYMS1        READE     EPCI95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:18                                       PIA18 /
      *////////////////////////////////////////////////////////////
     C     PIA18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EPIA95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPIA95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS1        READE     EPIA95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:07                                       PRI07 /
      *////////////////////////////////////////////////////////////
     C     PRI07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPRI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS1        READE     EPRI95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:14                                       PRI14 /
      *////////////////////////////////////////////////////////////
     C     PRI14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EPRI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:31                                       PRI31 /
      *////////////////////////////////////////////////////////////
     C     PRI31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EPRI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:38                                       PRI38 /
      *////////////////////////////////////////////////////////////
     C     PRI38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EPRI95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
      *
     C     KEYMS2        READE     EPRI95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:07                                       QTY07 /
      *////////////////////////////////////////////////////////////
     C     QTY07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EQTY95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:14                                       QTY14 /
      *////////////////////////////////////////////////////////////
     C     QTY14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     EQTY95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:31                                       QTY31 /
      *////////////////////////////////////////////////////////////
     C     QTY31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EQTY95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:38                                       QTY38 /
      *////////////////////////////////////////////////////////////
     C     QTY38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EQTY95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:03                                       RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     3             ZGN0
     C     KEYMS0        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM03
      *
     C     KEYMS0        READE     ERFF95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:10                                       RFF10 /
      *////////////////////////////////////////////////////////////
     C     RFF10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM10
      *
     C     KEYMS1        READE     ERFF95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:15                                       RFF15 /
      *////////////////////////////////////////////////////////////
     C     RFF15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM15
      *
     C     KEYMS1        READE     ERFF95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:17                                       RFF17 /
      *////////////////////////////////////////////////////////////
     C     RFF17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:22                                       RFF22 /
      *////////////////////////////////////////////////////////////
     C     RFF22         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     22            ZGN1
     C     KEYMS1        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM22
      *
     C     KEYMS1        READE     ERFF95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:23                                       RFF23 /
      *////////////////////////////////////////////////////////////
     C     RFF23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     ERFF95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:18                                       RNG18 /
      *////////////////////////////////////////////////////////////
     C     RNG18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ERNG95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERNG95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS1        READE     ERNG95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:04                                       SEL04 /
      *////////////////////////////////////////////////////////////
     C     SEL04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ESEL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:25                                       SEL25 /
      *////////////////////////////////////////////////////////////
     C     SEL25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ESEL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESEL95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS2        READE     ESEL95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SEL GROUP:37                                       SEL37 /
      *////////////////////////////////////////////////////////////
     C     SEL37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     ESEL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESEL95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SEL
      *
     C     KEYMS1        READE     ESEL95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:29                                       SGP29 /
      *////////////////////////////////////////////////////////////
     C     SGP29         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     29            ZGN1
     C     KEYMS1        SETLL     ESGP95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESGP95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPC0
     C                   Z-ADD     SREP1         ZREPC1
     C                   EXSR      MEA28
      *
     C     KEYMS1        READE     ESGP95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SGP GROUP:35                                       SGP35 /
      *////////////////////////////////////////////////////////////
     C     SGP35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ESGP95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ESGP95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      SGP
     C                   Z-ADD     SREP0         ZREPD0
     C                   Z-ADD     SREP1         ZREPD1
     C                   Z-ADD     SREP2         ZREPD2
     C                   EXSR      MEA36
      *
     C     KEYMS1        READE     ESGP95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C                   Z-ADD     80            LEN               5 0
     C                   MOVEL     'EUNOAO  '    TABLE            10
     C                   MOVEL     '*LIBL   '    LIB              10
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     MMN           WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'IFTMIN'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     MMN           WUMN
     C  N81              END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      CTA00
     C                   EXSR      COM00
     C                   EXSR      DTM00
     C                   EXSR      TSR00
     C                   EXSR      CUX00
     C                   EXSR      MOA00
     C                   EXSR      FTX00
     C                   EXSR      CNT00
     C                   EXSR      DOC00
     C                   EXSR      LOC01
     C                   EXSR      TOD02
     C                   EXSR      RFF03
     C                   EXSR      GOR04
     C                   EXSR      CPI06
     C                   EXSR      TCC07
     C                   EXSR      TDT08
     C                   EXSR      NAD11
     C                   EXSR      GID18
     C                   EXSR      EQD37
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
      *                    MOVELW0036     U0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    SDATA
     C                   PARM                    TABLE
     C                   PARM                    LIB
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    SDATA
     C                   PARM                    TABLE
     C                   PARM                    LIB
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:07                                       TCC07 /
      *////////////////////////////////////////////////////////////
     C     TCC07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     ETCC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETCC95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC07
     C                   EXSR      FTX07
     C                   EXSR      CUX07
     C                   EXSR      PRI07
     C                   EXSR      EQN07
     C                   EXSR      PCD07
     C                   EXSR      MOA07
     C                   EXSR      QTY07
      *
     C     KEYMS0        READE     ETCC95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:14                                       TCC14 /
      *////////////////////////////////////////////////////////////
     C     TCC14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     ETCC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      PRI14
     C                   EXSR      EQN14
     C                   EXSR      PCD14
     C                   EXSR      MOA14
     C                   EXSR      QTY14
      *
     C     KEYMS1        READE     ETCC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:31                                       TCC31 /
      *////////////////////////////////////////////////////////////
     C     TCC31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     ETCC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      CUX31
     C                   EXSR      PRI31
     C                   EXSR      EQN31
     C                   EXSR      PCD31
     C                   EXSR      MOA31
     C                   EXSR      QTY31
     C                   EXSR      LOC31
      *
     C     KEYMS1        READE     ETCC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TCC GROUP:38                                       TCC38 /
      *////////////////////////////////////////////////////////////
     C     TCC38         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     38            ZGN1
     C     KEYMS1        SETLL     ETCC95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETCC95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TCC
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      PRI38
     C                   EXSR      EQN38
     C                   EXSR      PCD38
     C                   EXSR      MOA38
     C                   EXSR      QTY38
      *
     C     KEYMS1        READE     ETCC95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:08                                       TDT08 /
      *////////////////////////////////////////////////////////////
     C     TDT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     ETDT95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      DTM08
     C                   EXSR      TSR08
     C                   EXSR      LOC09
     C                   EXSR      RFF10
      *
     C     KEYMS0        READE     ETDT95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:18                                       TMD18 /
      *////////////////////////////////////////////////////////////
     C     TMD18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ETMD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS1        READE     ETMD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:37                                       TMD37 /
      *////////////////////////////////////////////////////////////
     C     TMD37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     ETMD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMD
      *
     C     KEYMS1        READE     ETMD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:11                                       TMP11 /
      *////////////////////////////////////////////////////////////
     C     TMP11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     35            ZGN1
     C     KEYMS1        SETLL     ETMP95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMP95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS1        READE     ETMP95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMP GROUP:18                                       TMP18 /
      *////////////////////////////////////////////////////////////
     C     TMP18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ETMP95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMP95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS1        READE     ETMP95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TMD GROUP:37                                       TMP37 /
      *////////////////////////////////////////////////////////////
     C     TMP37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     ETMD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETMD95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS1        READE     ETMD95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:02                                       TOD02 /
      *////////////////////////////////////////////////////////////
     C     TOD02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     ETOD95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETOD95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC02
      *
     C     KEYMS0        READE     ETOD95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:17                                       TPL17 /
      *////////////////////////////////////////////////////////////
     C     TPL17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     ETPL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETPL95A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TMP
      *
     C     KEYMS2        READE     ETPL95A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:27                                       TPL27 /
      *////////////////////////////////////////////////////////////
     C     TPL27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     ETPL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETPL95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TPL
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MEA28
      *
     C     KEYMS1        READE     ETPL95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TPL GROUP:37                                       TPL37 /
      *////////////////////////////////////////////////////////////
     C     TPL37         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     37            ZGN1
     C     KEYMS1        SETLL     ETPL95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETPL95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TPL
      *
     C     KEYMS1        READE     ETPL95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:00                                       TSR00 /
      *////////////////////////////////////////////////////////////
     C     TSR00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ETSR95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETSR95A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS0        READE     ETSR95A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:08                                       TSR08 /
      *////////////////////////////////////////////////////////////
     C     TSR08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ETSR95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
      *
     C     KEYMS1        READE     ETSR95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TSR GROUP:17                                       TSR17 /
      *////////////////////////////////////////////////////////////
     C     TSR17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ETSR95A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETSR95A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TSR
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      RFF17
     C                   EXSR      LOC17
     C                   EXSR      TPL17
     C                   EXSR      FTX17
      *
     C     KEYMS1        READE     ETSR95A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      /COPY QEDSRC,BGM_O_95A
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
      /COPY QEDSRC,CNT_O_95A
      /COPY QEDSRC,COM_O_95A
      /COPY QEDSRC,CPI_O_95A
      /COPY QEDSRC,CTA_O_95A
      /COPY QEDSRC,CUX_O_95A
      /COPY QEDSRC,DGS_O_95A
      /COPY QEDSRC,DIM_O_95A
      /COPY QEDSRC,DOC_O_95A
      /COPY QEDSRC,DTM_O_95A
      /COPY QEDSRC,EQA_O_95A
      /COPY QEDSRC,EQD_O_95A
      /COPY QEDSRC,EQN_O_95A
      /COPY QEDSRC,FTX_O_95A
      /COPY QEDSRC,GDS_O_95A
      /COPY QEDSRC,GID_O_95A
      /COPY QEDSRC,GOR_O_95A
      /COPY QEDSRC,HAN_O_95A
      /COPY QEDSRC,LOC_O_95A
      /COPY QEDSRC,MEA_O_95A
      /COPY QEDSRC,MOA_O_95A
      /COPY QEDSRC,NAD_O_95A
      /COPY QEDSRC,PCD_O_95A
      /COPY QEDSRC,PCI_O_95A
      /COPY QEDSRC,PIA_O_95A
      /COPY QEDSRC,PRI_O_95A
      /COPY QEDSRC,QTY_O_95A
      /COPY QEDSRC,RFF_O_95A
      /COPY QEDSRC,RNG_O_95A
      /COPY QEDSRC,SEL_O_95A
      /COPY QEDSRC,SGP_O_95A
      /COPY QEDSRC,TCC_O_95A
      /COPY QEDSRC,TDT_O_95A
      /COPY QEDSRC,TMD_O_95A
      /COPY QEDSRC,TMP_O_95A
      /COPY QEDSRC,TOD_O_95A
      /COPY QEDSRC,TPL_O_95A
      /COPY QEDSRC,TSR_O_95A
