     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FEUNS      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FEDISE     O  A E             DISK
     FEALC921   IF   E           K DISK
     FEALI921   IF   E           K DISK
     FEAPI921   IF   E           K DISK
     FECNT921   IF   E           K DISK
     FECOM921   IF   E           K DISK
     FECTA921   IF   E           K DISK
     FECUX921   IF   E           K DISK
     FEDOC921   IF   E           K DISK
     FEDTM921   IF   E           K DISK
     FEEQD921   IF   E           K DISK
     FEFII921   IF   E           K DISK
     FEFTX921   IF   E           K DISK
     FEGIN921   IF   E           K DISK
     FEGIR921   IF   E           K DISK
     FEHAN921   IF   E           K DISK
     FEIMD921   IF   E           K DISK
     FELIN921   IF   E           K DISK
     FELOC921   IF   E           K DISK
     FEMEA921   IF   E           K DISK
     FEMOA921   IF   E           K DISK
     FENAD921   IF   E           K DISK
     FEPAC921   IF   E           K DISK
     FEPAI921   IF   E           K DISK
     FEPAT921   IF   E           K DISK
     FEPCD921   IF   E           K DISK
     FEPCI921   IF   E           K DISK
     FEPIA921   IF   E           K DISK
     FEPRI921   IF   E           K DISK
     FEQTY921   IF   E           K DISK
     FEQVA921   IF   E           K DISK
     FERCS921   IF   E           K DISK
     FERFF921   IF   E           K DISK
     FERNG921   IF   E           K DISK
     FERTE921   IF   E           K DISK
     FESCC921   IF   E           K DISK
     FETAX921   IF   E           K DISK
     FETDT921   IF   E           K DISK
     FETOD921   IF   E           K DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:18                                       ALC18 /
      *////////////////////////////////////////////////////////////
     C     ALC18         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     18            ZGN0
     C     KEYMS0        SETLL     EALC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI18
     C                   EXSR      DTM18
     C                   EXSR      QTY19
     C                   EXSR      PCD20
     C                   EXSR      MOA21
     C                   EXSR      RTE22
     C                   EXSR      TAX23
      *
     C     KEYMS0        READE     EALC921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:38                                       ALC38 /
      *////////////////////////////////////////////////////////////
     C     ALC38         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     38            ZGN1
     C     KEYMS1        SETLL     EALC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPC0
     C                   Z-ADD     AREP1         ZREPC1
     C                   EXSR      ALI38
     C                   EXSR      DTM38
     C                   EXSR      QTY39
     C                   EXSR      PCD40
     C                   EXSR      MOA41
     C                   EXSR      RTE42
     C                   EXSR      TAX43
      *
     C     KEYMS1        READE     EALC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:51                                       ALC51 /
      *////////////////////////////////////////////////////////////
     C     ALC51         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     51            ZGN0
     C     KEYMS0        SETLL     EALC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI51
     C                   EXSR      MOA51
      *
     C     KEYMS0        READE     EALC921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:00                                       ALI00 /
      *////////////////////////////////////////////////////////////
     C     ALI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EALI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALI921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS0        READE     EALI921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:18                                       ALI18 /
      *////////////////////////////////////////////////////////////
     C     ALI18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EALI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:25                                       ALI25 /
      *////////////////////////////////////////////////////////////
     C     ALI25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EALI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:38                                       ALI38 /
      *////////////////////////////////////////////////////////////
     C     ALI38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EALI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:51                                       ALI51 /
      *////////////////////////////////////////////////////////////
     C     ALI51         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     51            ZGN1
     C     KEYMS1        SETLL     EALI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  API GROUP:17                                       API17 /
      *////////////////////////////////////////////////////////////
     C     API17         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     17            ZGN0
     C     KEYMS0        SETLL     EAPI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EAPI921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      API
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      DTM17
     C                   EXSR      RNG17
      *
     C     KEYMS0        READE     EAPI921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  API GROUP:27                                       API27 /
      *////////////////////////////////////////////////////////////
     C     API27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     EAPI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EAPI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      API
      *
     C     KEYMS2        READE     EAPI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CNT GROUP:00.                                      CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     ECNT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECNT921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CNT
      *
     C     KEYMS0        READE     ECNT921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:05                                       COM05 /
      *////////////////////////////////////////////////////////////
     C     COM05         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     5             ZGN2
     C     KEYMS2        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:37                                       COM37 /
      *////////////////////////////////////////////////////////////
     C     COM37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ECOM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:05                                       CTA05 /
      *////////////////////////////////////////////////////////////
     C     CTA05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM05
      *
     C     KEYMS1        READE     ECTA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:37                                       CTA37 /
      *////////////////////////////////////////////////////////////
     C     CTA37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ECTA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM37
      *
     C     KEYMS2        READE     ECTA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:07                                       CUX07 /
      *////////////////////////////////////////////////////////////
     C     CUX07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECUX921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      PCD07
     C                   EXSR      DTM07
      *
     C     KEYMS0        READE     ECUX921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:27                                       CUX27 /
      *////////////////////////////////////////////////////////////
     C     CUX27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ECUX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:04                                       DOC04 /
      *////////////////////////////////////////////////////////////
     C     DOC04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     DREP0         ZREPC0
     C                   Z-ADD     DREP1         ZREPC1
     C                   EXSR      DTM04
      *
     C     KEYMS1        READE     EDOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:25                                       DOC25 /
      *////////////////////////////////////////////////////////////
     C     DOC25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DOC
      *
     C     KEYMS1        READE     EDOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:36                                       DOC36 /
      *////////////////////////////////////////////////////////////
     C     DOC36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EDOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM36
      *
     C     KEYMS2        READE     EDOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:04                                       DTM04 /
      *////////////////////////////////////////////////////////////
     C     DTM04         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     4             ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:07                                       DTM07 /
      *////////////////////////////////////////////////////////////
     C     DTM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:08                                       DTM08 /
      *////////////////////////////////////////////////////////////
     C     DTM08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:10                                       DTM10 /
      *////////////////////////////////////////////////////////////
     C     DTM10         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     10            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:13                                       DTM13 /
      *////////////////////////////////////////////////////////////
     C     DTM13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:16                                       DTM16 /
      *////////////////////////////////////////////////////////////
     C     DTM16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:17                                       DTM17 /
      *////////////////////////////////////////////////////////////
     C     DTM17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:18                                       DTM18 /
      *////////////////////////////////////////////////////////////
     C     DTM18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:24                                       DTM24 /
      *////////////////////////////////////////////////////////////
     C     DTM24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:25                                       DTM25 /
      *////////////////////////////////////////////////////////////
     C     DTM25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:26                                       DTM26 /
      *////////////////////////////////////////////////////////////
     C     DTM26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:27                                       DTM27 /
      *////////////////////////////////////////////////////////////
     C     DTM27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:28                                       DTM28 /
      *////////////////////////////////////////////////////////////
     C     DTM28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:29                                       DTM29 /
      *////////////////////////////////////////////////////////////
     C     DTM29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:30                                       DTM30 /
      *////////////////////////////////////////////////////////////
     C     DTM30         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     30            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:31                                       DTM31 /
      *////////////////////////////////////////////////////////////
     C     DTM31         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     31            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:32                                       DTM32 /
      *////////////////////////////////////////////////////////////
     C     DTM32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:35                                       DTM35 /
      *////////////////////////////////////////////////////////////
     C     DTM35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:45                                       DTM45 /
      *////////////////////////////////////////////////////////////
     C     DTM45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:49                                       DTM49 /
      *////////////////////////////////////////////////////////////
     C     DTM49         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     49            ZGN3
     C     KEYMS3        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:50                                       DTM50 /
      *////////////////////////////////////////////////////////////
     C     DTM50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     EDTM921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:14                                       EQD14 /
      *////////////////////////////////////////////////////////////
     C     EQD14         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     14            ZGN0
     C     KEYMS0        SETLL     EEQD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EEQD921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPB0
     C                   EXSR      HAN14
     C                   EXSR      MEA14
     C                   EXSR      FTX14
      *
     C     KEYMS0        READE     EEQD921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EQD GROUP:47                                       EQD47 /
      *////////////////////////////////////////////////////////////
     C     EQD47         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     47            ZGN1
     C     KEYMS1        SETLL     EEQD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEQD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EQD
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      HAN47
     C                   EXSR      MEA47
     C                   EXSR      FTX47
      *
     C     KEYMS1        READE     EEQD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:14                                       FTX14 /
      *////////////////////////////////////////////////////////////
     C     FTX14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:15                                       FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:24                                       FTX24 /
      *////////////////////////////////////////////////////////////
     C     FTX24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:25                                       FTX25 /
      *////////////////////////////////////////////////////////////
     C     FTX25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:47                                       FTX47 /
      *////////////////////////////////////////////////////////////
     C     FTX47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:48                                       FTX48 /
      *////////////////////////////////////////////////////////////
     C     FTX48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:50                                       FTX50 /
      *////////////////////////////////////////////////////////////
     C     FTX50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     EFTX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FII GROUP:02                                       FII02 /
      *////////////////////////////////////////////////////////////
     C     FII02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     EFII921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFII921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FII
      *
     C     KEYMS1        READE     EFII921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:13                                       GIN13 /
      *////////////////////////////////////////////////////////////
     C     GIN13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     EGIN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EGIN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS2        READE     EGIN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:25                                       GIN25 /
      *////////////////////////////////////////////////////////////
     C     GIN25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EGIN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIN921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS1        READE     EGIN921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIN GROUP:31                                       GIN31 /
      *////////////////////////////////////////////////////////////
     C     GIN31         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     31            ZGN3
     C     KEYMS3        SETLL     EGIN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EGIN921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      GIN
      *
     C     KEYMS3        READE     EGIN921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  GIR GROUP:25                                       GIR25 /
      *////////////////////////////////////////////////////////////
     C     GIR25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EGIR921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EGIR921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      GIR
      *
     C     KEYMS1        READE     EGIR921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:14                                       HAN14 /
      *////////////////////////////////////////////////////////////
     C     HAN14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EHAN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EHAN921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS1        READE     EHAN921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:47                                       HAN47 /
      *////////////////////////////////////////////////////////////
     C     HAN47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     EHAN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:00                                       IMD00 /
      *////////////////////////////////////////////////////////////
     C     IMD00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EIMD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EIMD921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS0        READE     EIMD921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:25                                       IMD25 /
      *////////////////////////////////////////////////////////////
     C     IMD25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EIMD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EIMD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS1        READE     EIMD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LIN GROUP:25                                       LIN25 /
      *////////////////////////////////////////////////////////////
     C     LIN25         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     25            ZGN0
     C     KEYMS0        SETLL     ELIN921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ELIN921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      LIN
     C                   Z-ADD     LREP0         ZREPB0
     C                   EXSR      PIA25
     C                   EXSR      IMD25
     C                   EXSR      MEA25
     C                   EXSR      QTY25
     C                   EXSR      PCD25
     C                   EXSR      ALI25
     C                   EXSR      DTM25
     C                   EXSR      MOA25
     C                   EXSR      GIN25
     C                   EXSR      GIR25
     C                   EXSR      QVA25
     C                   EXSR      DOC25
     C                   EXSR      PAI25
     C                   EXSR      FTX25
     C                   EXSR      PAT26
     C                   EXSR      PRI27
     C                   EXSR      RFF28
     C                   EXSR      PAC29
     C                   EXSR      LOC32
     C                   EXSR      TAX33
     C                   EXSR      NAD34
     C                   EXSR      ALC38
     C                   EXSR      TDT44
     C                   EXSR      TOD46
     C                   EXSR      EQD47
     C                   EXSR      SCC48
     C                   EXSR      RCS50
      *
     C     KEYMS0        READE     ELIN921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:06                                       LOC06 /
      *////////////////////////////////////////////////////////////
     C     LOC06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:10                                       LOC10 /
      *////////////////////////////////////////////////////////////
     C     LOC10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      DTM10
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:11                                       LOC11 /
      *////////////////////////////////////////////////////////////
     C     LOC11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:32                                       LOC32 /
      *////////////////////////////////////////////////////////////
     C     LOC32         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     32            ZGN1
     C     KEYMS1        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      QTY32
     C                   EXSR      DTM32
      *
     C     KEYMS1        READE     ELOC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:33                                       LOC33 /
      *////////////////////////////////////////////////////////////
     C     LOC33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:34                                       LOC34 /
      *////////////////////////////////////////////////////////////
     C     LOC34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:45                                       LOC45 /
      *////////////////////////////////////////////////////////////
     C     LOC45         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     45            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
     C                   Z-ADD     LREP0         ZREPD0
     C                   Z-ADD     LREP1         ZREPD1
     C                   Z-ADD     LREP2         ZREPD2
     C                   EXSR      DTM45
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:46                                       LOC46 /
      *////////////////////////////////////////////////////////////
     C     LOC46         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     46            ZGN2
     C     KEYMS2        SETLL     ELOC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:12                                       MEA12 /
      *////////////////////////////////////////////////////////////
     C     MEA12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:14                                       MEA14 /
      *////////////////////////////////////////////////////////////
     C     MEA14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:25                                       MEA25 /
      *////////////////////////////////////////////////////////////
     C     MEA25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMEA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS1        READE     EMEA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:29                                       MEA29 /
      *////////////////////////////////////////////////////////////
     C     MEA29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:47                                       MEA47 /
      *////////////////////////////////////////////////////////////
     C     MEA47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     EMEA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:00                                       MOA00 /
      *////////////////////////////////////////////////////////////
     C     MOA00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EMOA921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS0        READE     EMOA921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:06                                       MOA06 /
      *////////////////////////////////////////////////////////////
     C     MOA06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:08                                       MOA08 /
      *////////////////////////////////////////////////////////////
     C     MOA08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:21                                       MOA21 /
      *////////////////////////////////////////////////////////////
     C     MOA21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      RNG21
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:23                                       MOA23 /
      *////////////////////////////////////////////////////////////
     C     MOA23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:25                                       MOA25 /
      *////////////////////////////////////////////////////////////
     C     MOA25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:26                                       MOA26 /
      *////////////////////////////////////////////////////////////
     C     MOA26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:33                                       MOA33 /
      *////////////////////////////////////////////////////////////
     C     MOA33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:41                                       PCD41 /
      *////////////////////////////////////////////////////////////
     C     MOA41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RNG41
      *
     C     KEYMS2        READE     EMOA921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:43                                       MOA43 /
      *////////////////////////////////////////////////////////////
     C     MOA43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:51                                       MOA51 /
      *////////////////////////////////////////////////////////////
     C     MOA51         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     51            ZGN1
     C     KEYMS1        SETLL     EMOA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:02                                       NAD02 /
      *////////////////////////////////////////////////////////////
     C     NAD02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ENAD921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPB0
     C                   EXSR      LOC02
     C                   EXSR      FII02
     C                   EXSR      RFF03
     C                   EXSR      DOC04
     C                   EXSR      CTA05
      *
     C     KEYMS0        READE     ENAD921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:34                                       NAD34 /
      *////////////////////////////////////////////////////////////
     C     NAD34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     ENAD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC34
     C                   EXSR      RFF35
     C                   EXSR      DOC36
     C                   EXSR      CTA37
      *
     C     KEYMS1        READE     ENAD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:12                                       PAC12 /
      *////////////////////////////////////////////////////////////
     C     PAC12         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     12            ZGN0
     C     KEYMS0        SETLL     EPAC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAC921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      MEA12
     C                   EXSR      PCI13
      *
     C     KEYMS0        READE     EPAC921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:29                                       PAC29 /
      *////////////////////////////////////////////////////////////
     C     PAC29         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     29            ZGN1
     C     KEYMS1        SETLL     EPAC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      MEA29
     C                   EXSR      QTY29
     C                   EXSR      DTM29
     C                   EXSR      RFF30
     C                   EXSR      PCI31
      *
     C     KEYMS1        READE     EPAC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAI GROUP:00                                       PAI00 /
      *////////////////////////////////////////////////////////////
     C     PAI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EPAI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAI921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAI
      *
     C     KEYMS0        READE     EPAI921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAI GROUP:25                                       PAI25 /
      *////////////////////////////////////////////////////////////
     C     PAI25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EPAI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAI
      *
     C     KEYMS1        READE     EPAI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:08                                       PAT08 /
      *////////////////////////////////////////////////////////////
     C     PAT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     EPAT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAT921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM08
     C                   EXSR      PCD08
     C                   EXSR      MOA08
      *
     C     KEYMS0        READE     EPAT921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:26                                       PAT26 /
      *////////////////////////////////////////////////////////////
     C     PAT26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     EPAT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAT921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      DTM26
     C                   EXSR      PCD26
     C                   EXSR      MOA26
      *
     C     KEYMS1        READE     EPAT921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:07                                       PCD07 /
      *////////////////////////////////////////////////////////////
     C     PCD07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:08                                       PCD08 /
      *////////////////////////////////////////////////////////////
     C     PCD08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:20                                       PCD20 /
      *////////////////////////////////////////////////////////////
     C     PCD20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RNG20
      *
     C     KEYMS1        READE     EPCD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:25                                       PCD25 /
      *////////////////////////////////////////////////////////////
     C     PCD25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:26                                       PCD26 /
      *////////////////////////////////////////////////////////////
     C     PCD26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:40                                       PCD40 /
      *////////////////////////////////////////////////////////////
     C     PCD40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     EPCD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RNG40
      *
     C     KEYMS2        READE     EPCD921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:13                                       PCI13 /
      *////////////////////////////////////////////////////////////
     C     PCI13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EPCI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RFF13
     C                   EXSR      DTM13
     C                   EXSR      GIN13
      *
     C     KEYMS1        READE     EPCI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCI GROUP:31                                       PCI31 /
      *////////////////////////////////////////////////////////////
     C     PCI31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     EPCI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCI921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RFF31
     C                   EXSR      DTM31
     C                   EXSR      GIN31
      *
     C     KEYMS2        READE     EPCI921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:25                                       PIA25 /
      *////////////////////////////////////////////////////////////
     C     PIA25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EPIA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPIA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS1        READE     EPIA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:27                                       PRI27 /
      *////////////////////////////////////////////////////////////
     C     PRI27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     EPRI921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      CUX27
     C                   EXSR      API27
     C                   EXSR      RNG27
     C                   EXSR      DTM27
      *
     C     KEYMS1        READE     EPRI921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:16                                       QTY16 /
      *////////////////////////////////////////////////////////////
     C     QTY16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPC0
     C                   Z-ADD     QREP1         ZREPC1
     C                   EXSR      DTM16
      *
     C     KEYMS1        READE     EQTY921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:19                                       QTY19 /
      *////////////////////////////////////////////////////////////
     C     QTY19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPC0
     C                   Z-ADD     QREP1         ZREPC1
     C                   EXSR      RNG19
      *
     C     KEYMS1        READE     EQTY921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:25                                       QTY25 /
      *////////////////////////////////////////////////////////////
     C     QTY25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:29                                       QTY29 /
      *////////////////////////////////////////////////////////////
     C     QTY29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:32                                       QTY32 /
      *////////////////////////////////////////////////////////////
     C     QTY32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:39                                       QTY39 /
      *////////////////////////////////////////////////////////////
     C     QTY39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPD0
     C                   Z-ADD     QREP1         ZREPD1
     C                   Z-ADD     QREP2         ZREPD2
     C                   EXSR      RNG39
      *
     C     KEYMS2        READE     EQTY921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:49                                       QTY49 /
      *////////////////////////////////////////////////////////////
     C     QTY49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     EQTY921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPD0
     C                   Z-ADD     QREP1         ZREPD1
     C                   Z-ADD     QREP2         ZREPD2
     C                   EXSR      DTM49
      *
     C     KEYMS2        READE     EQTY921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QVA GROUP:25                                       QVA25 /
      *////////////////////////////////////////////////////////////
     C     QVA25         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     25            ZGN1
     C     KEYMS1        SETLL     EQVA921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQVA921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QVA
      *
     C     KEYMS1        READE     EQVA921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RCS GROUP:24                                       RCS24 /
      *////////////////////////////////////////////////////////////
     C     RCS24         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     24            ZGN0
     C     KEYMS0        SETLL     ERCS921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERCS921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RCS
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      RFF24
     C                   EXSR      DTM24
     C                   EXSR      FTX24
      *
     C     KEYMS0        READE     ERCS921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RCS GROUP:50                                       RCS50 /
      *////////////////////////////////////////////////////////////
     C     RCS50         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     50            ZGN1
     C     KEYMS1        SETLL     ERCS921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERCS921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RCS
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RFF50
     C                   EXSR      DTM50
     C                   EXSR      FTX50
      *
     C     KEYMS1        READE     ERCS921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:03                                       RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     ERFF921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:13                                       RFF13 /
      *////////////////////////////////////////////////////////////
     C     RFF13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:15                                       RFF15 /
      *////////////////////////////////////////////////////////////
     C     RFF15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS1        READE     ERFF921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:24                                       RFF24 /
      *////////////////////////////////////////////////////////////
     C     RFF24         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     24            ZGN1
     C     KEYMS1        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS1        READE     ERFF921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:28                                       RFF28 /
      *////////////////////////////////////////////////////////////
     C     RFF28         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     28            ZGN1
     C     KEYMS1        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM28
      *
     C     KEYMS1        READE     ERFF921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:30                                       RFF30 /
      *////////////////////////////////////////////////////////////
     C     RFF30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM30
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:31                                       RFF31 /
      *////////////////////////////////////////////////////////////
     C     RFF31         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     31            ZGN3
     C     KEYMS3        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:35                                       RFF35 /
      *////////////////////////////////////////////////////////////
     C     RFF35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM35
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:48                                       RFF48 /
      *////////////////////////////////////////////////////////////
     C     RFF48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:50                                       RFF50 /
      *////////////////////////////////////////////////////////////
     C     RFF50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     ERFF921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:17                                       RNG17 /
      *////////////////////////////////////////////////////////////
     C     RNG17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERNG921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS1        READE     ERNG921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:19                                       RNG19 /
      *////////////////////////////////////////////////////////////
     C     RNG19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:20                                       RNG20 /
      *////////////////////////////////////////////////////////////
     C     RNG20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:21                                       RNG21 /
      *////////////////////////////////////////////////////////////
     C     RNG21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:22                                       RNG22 /
      *////////////////////////////////////////////////////////////
     C     RNG22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:27                                       RNG27 /
      *////////////////////////////////////////////////////////////
     C     RNG27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:39                                       RNG39 /
      *////////////////////////////////////////////////////////////
     C     RNG39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:40                                       RNG40 /
      *////////////////////////////////////////////////////////////
     C     RNG40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:41                                       RNG41 /
      *////////////////////////////////////////////////////////////
     C     RNG41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:42                                       RNG42 /
      *////////////////////////////////////////////////////////////
     C     RNG42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     ERNG921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG921                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG921                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:22                                       RTE22 /
      *////////////////////////////////////////////////////////////
     C     RTE22         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     22            ZGN1
     C     KEYMS1        SETLL     ERTE921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERTE921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RNG22
      *
     C     KEYMS1        READE     ERTE921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:42                                       RTE42 /
      *////////////////////////////////////////////////////////////
     C     RTE42         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     42            ZGN2
     C     KEYMS2        SETLL     ERTE921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERTE921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      RNG42
      *
     C     KEYMS2        READE     ERTE921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SCC GROUP:15                                       SCC15 /
      *////////////////////////////////////////////////////////////
     C     SCC15         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     15            ZGN0
     C     KEYMS0        SETLL     ESCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ESCC921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      SCC
     C                   Z-ADD     SREP0         ZREPB0
     C                   EXSR      FTX15
     C                   EXSR      RFF15
     C                   EXSR      QTY16
      *
     C     KEYMS0        READE     ESCC921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SCC GROUP:48                                       SCC48 /
      *////////////////////////////////////////////////////////////
     C     SCC48         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     48            ZGN1
     C     KEYMS1        SETLL     ESCC921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ESCC921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      SCC
     C                   Z-ADD     SREP0         ZREPC0
     C                   Z-ADD     SREP1         ZREPC1
     C                   EXSR      FTX48
     C                   EXSR      RFF48
     C                   EXSR      QTY49
      *
     C     KEYMS1        READE     ESCC921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    UMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'ORDERS'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   Z-ADD     WDT           MDT
     C                   Z-ADD     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      DTM00
     C                   EXSR      PAI00
     C                   EXSR      ALI00
     C                   EXSR      IMD00
     C                   EXSR      FTX00
     C                   EXSR      RFF01
     C                   EXSR      NAD02
     C                   EXSR      TAX06
     C                   EXSR      CUX07
     C                   EXSR      PAT08
     C                   EXSR      TDT09
     C                   EXSR      TOD11
     C                   EXSR      PAC12
     C                   EXSR      EQD14
     C                   EXSR      SCC15
     C                   EXSR      API17
     C                   EXSR      ALC18
     C                   EXSR      RCS24
     C                   EXSR      LIN25
     C                   EXSR      UNS00
     C                   EXSR      MOA00
     C                   EXSR      CNT00
     C                   EXSR      ALC51
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:06                                       TAX06 /
      *////////////////////////////////////////////////////////////
     C     TAX06         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     6             ZGN0
     C     KEYMS0        SETLL     ETAX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETAX921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      MOA06
     C                   EXSR      LOC06
      *
     C     KEYMS0        READE     ETAX921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:23                                       TAX23 /
      *////////////////////////////////////////////////////////////
     C     TAX23         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     23            ZGN1
     C     KEYMS1        SETLL     ETAX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA23
      *
     C     KEYMS1        READE     ETAX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:33                                       TAX33 /
      *////////////////////////////////////////////////////////////
     C     TAX33         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     33            ZGN1
     C     KEYMS1        SETLL     ETAX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA33
     C                   EXSR      LOC33
      *
     C     KEYMS1        READE     ETAX921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:43                                       TAX43 /
      *////////////////////////////////////////////////////////////
     C     TAX43         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     43            ZGN2
     C     KEYMS2        SETLL     ETAX921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX921                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA43
      *
     C     KEYMS2        READE     ETAX921                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:09                                       TDT09 /
      *////////////////////////////////////////////////////////////
     C     TDT09         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     9             ZGN0
     C     KEYMS0        SETLL     ETDT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC10
      *
     C     KEYMS0        READE     ETDT921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:44                                       TDT44 /
      *////////////////////////////////////////////////////////////
     C     TDT44         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     44            ZGN1
     C     KEYMS1        SETLL     ETDT921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC45
      *
     C     KEYMS1        READE     ETDT921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:11                                       TOD11 /
      *////////////////////////////////////////////////////////////
     C     TOD11         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     11            ZGN0
     C     KEYMS0        SETLL     ETOD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETOD921                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC11
      *
     C     KEYMS0        READE     ETOD921                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:46                                       TOD46 /
      *////////////////////////////////////////////////////////////
     C     TOD46         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     46            ZGN1
     C     KEYMS1        SETLL     ETOD921                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD921                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC46
      *
     C     KEYMS1        READE     ETOD921                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  UNS GROUP:00. FORTLØPENDE NUMMERERING              UNS00 /
      *////////////////////////////////////////////////////////////
     C     UNS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     50            ZGN0
     C     KEYMS0        SETLL     EUNS                                   20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EUNS                                   51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      UNS
      *
     C     KEYMS0        READE     EUNS                                   51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      /COPY QEDSRC,BGM_O_921
      /COPY QEDSRC,ALC_O_921
      /COPY QEDSRC,ALI_O_921
      /COPY QEDSRC,API_O_921
      /COPY QEDSRC,CNT_O_921
      /COPY QEDSRC,COM_O_921
      /COPY QEDSRC,CTA_O_921
      /COPY QEDSRC,CUX_O_921
      /COPY QEDSRC,DOC_O_921
      /COPY QEDSRC,DTM_O_921
      /COPY QEDSRC,EQD_O_921
      /COPY QEDSRC,FII_O_921
      /COPY QEDSRC,FTX_O_921
      /COPY QEDSRC,GIN_O_921
      /COPY QEDSRC,GIR_O_921
      /COPY QEDSRC,HAN_O_921
      /COPY QEDSRC,IMD_O_921
      /COPY QEDSRC,LIN_O_921
      /COPY QEDSRC,LOC_O_921
      /COPY QEDSRC,MEA_O_921
      /COPY QEDSRC,MOA_O_921
      /COPY QEDSRC,NAD_O_921
      /COPY QEDSRC,PAC_O_921
      /COPY QEDSRC,PAI_O_921
      /COPY QEDSRC,PAT_O_921
      /COPY QEDSRC,PCD_O_921
      /COPY QEDSRC,PCI_O_921
      /COPY QEDSRC,PIA_O_921
      /COPY QEDSRC,PRI_O_921
      /COPY QEDSRC,QTY_O_921
      /COPY QEDSRC,QVA_O_921
      /COPY QEDSRC,RCS_O_921
      /COPY QEDSRC,RFF_O_921
      /COPY QEDSRC,RNG_O_921
      /COPY QEDSRC,RTE_O_921
      /COPY QEDSRC,SCC_O_921
      /COPY QEDSRC,TAX_O_921
      /COPY QEDSRC,TDT_O_921
      /COPY QEDSRC,TOD_O_921
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNS_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
