     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FEUNS      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FEDISE     O  A E             DISK
     FEALC01B   IF   E           K DISK
     FEALI01B   IF   E           K DISK
     FEAPR01B   IF   E           K DISK
     FECAV01B   IF   E           K DISK
     FECCI01B   IF   E           K DISK
     FECED01B   IF   E           K DISK
     FECOM01B   IF   E           K DISK
     FECTA01B   IF   E           K DISK
     FECUX01B   IF   E           K DISK
     FEDGS01B   IF   E           K DISK
     FEDOC01B   IF   E           K DISK
     FEDTM01B   IF   E           K DISK
     FEEFI01B   IF   E           K DISK
     FEFTX01B   IF   E           K DISK
     FEHAN01B   IF   E           K DISK
     FEHYN01B   IF   E           K DISK
     FEIMD01B   IF   E           K DISK
     FELIN01B   IF   E           K DISK
     FELOC01B   IF   E           K DISK
     FEMEA01B   IF   E           K DISK
     FEMOA01B   IF   E           K DISK
     FENAD01B   IF   E           K DISK
     FEPAC01B   IF   E           K DISK
     FEPAT01B   IF   E           K DISK
     FEPCD01B   IF   E           K DISK
     FEPCI01B   IF   E           K DISK
     FEPGI01B   IF   E           K DISK
     FEPIA01B   IF   E           K DISK
     FEPRI01B   IF   E           K DISK
     FEPTY01B   IF   E           K DISK
     FEQTY01B   IF   E           K DISK
     FERFF01B   IF   E           K DISK
     FERNG01B   IF   E           K DISK
     FERTE01B   IF   E           K DISK
     FETAX01B   IF   E           K DISK
     FETDT01B   IF   E           K DISK
     FETOD01B   IF   E           K DISK
     FETRU01B   IF   E           K DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:10                                       ALC10 /
      *////////////////////////////////////////////////////////////
     C     ALC10         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     10            ZGN0
     C     KEYMS0        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI10
     C                   EXSR      DTM10
     C                   EXSR      QTY11
     C                   EXSR      PCD12
     C                   EXSR      MOA13
     C                   EXSR      RTE14
     C                   EXSR      TAX15
     C                   EXSR      TRU16
      *
     C     KEYMS0        READE     EALC01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:21                                       ALC21 /
      *////////////////////////////////////////////////////////////
     C     ALC21         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     21            ZGN1
     C     KEYMS1        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPC0
     C                   Z-ADD     AREP1         ZREPC1
     C                   EXSR      ALI21
     C                   EXSR      QTY22
     C                   EXSR      PCD23
     C                   EXSR      MOA24
     C                   EXSR      RTE25
     C                   EXSR      TAX26
      *
     C     KEYMS1        READE     EALC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:41                                       ALC41 /
      *////////////////////////////////////////////////////////////
     C     ALC41         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     41            ZGN2
     C     KEYMS2        SETLL     EALC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPD0
     C                   Z-ADD     AREP1         ZREPD1
     C                   Z-ADD     AREP2         ZREPD2
     C                   EXSR      ALI41
     C                   EXSR      DTM41
     C                   EXSR      QTY42
     C                   EXSR      PCD43
     C                   EXSR      MOA44
     C                   EXSR      RTE45
     C                   EXSR      TAX46
      *
     C     KEYMS2        READE     EALC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:00                                       ALI00 /
      *////////////////////////////////////////////////////////////
     C     ALI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALI01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS0        READE     EALI01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:10                                       ALI10 /
      *////////////////////////////////////////////////////////////
     C     ALI10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:17                                       ALI17 /
      *////////////////////////////////////////////////////////////
     C     ALI17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:21                                       ALI21 /
      *////////////////////////////////////////////////////////////
     C     ALI21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:36                                       ALI36 /
      *////////////////////////////////////////////////////////////
     C     ALI36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:41                                       ALI41 /
      *////////////////////////////////////////////////////////////
     C     ALI41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     EALI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EALI01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS3        READE     EALI01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  APR GROUP:19                                       APR19 /
      *////////////////////////////////////////////////////////////
     C     APR19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     EAPR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EAPR01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      APR
      *
     C     KEYMS2        READE     EAPR01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  APR GROUP:40                                       APR40 /
      *////////////////////////////////////////////////////////////
     C     APR40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EAPR01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EAPR01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS3        READE     EAPR01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CAV GROUP:37                                       CAV37 /
      *////////////////////////////////////////////////////////////
     C     CAV37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ECAV01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECAV01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CAV
      *
     C     KEYMS3        READE     ECAV01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CAV GROUP:58                                       CAV58 /
      *////////////////////////////////////////////////////////////
     C     CAV58         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     58            ZGN4
     C     KEYMS4        SETLL     ECAV01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECAV01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      CAV
      *
     C     KEYMS4        READE     ECAV01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CAV GROUP:60                                       CAV60 /
      *////////////////////////////////////////////////////////////
     C     CAV60         BEGSR
     C                   MOVE      '0'           *IN56
     C                   Z-ADD     60            ZGN5
     C     KEYMS5        SETLL     ECAV01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS5        READE     ECAV01B                                56
     C     *IN56         DOWEQ     '0'
      *
     C                   EXSR      CAV
      *
     C     KEYMS5        READE     ECAV01B                                56
     C  N56              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CCI GROUP:37                                       CCI37 /
      *////////////////////////////////////////////////////////////
     C     CCI37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     ECCI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECCI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CCI
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      CAV37
     C                   EXSR      MEA37
      *
     C     KEYMS2        READE     ECCI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CCI GROUP:58                                       CCI58 /
      *////////////////////////////////////////////////////////////
     C     CCI58         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     58            ZGN3
     C     KEYMS3        SETLL     ECCI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECCI01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CCI
     C                   Z-ADD     CREP0         ZREPE0
     C                   Z-ADD     CREP1         ZREPE1
     C                   Z-ADD     CREP2         ZREPE2
     C                   Z-ADD     CREP3         ZREPE3
     C                   EXSR      CAV58
     C                   EXSR      MEA58
      *
     C     KEYMS3        READE     ECCI01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CCI GROUP:60                                       CCI60 /
      *////////////////////////////////////////////////////////////
     C     CCI60         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     60            ZGN4
     C     KEYMS4        SETLL     ECCI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECCI01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      CCI
     C                   Z-ADD     CREP0         ZREPF0
     C                   Z-ADD     CREP1         ZREPF1
     C                   Z-ADD     CREP2         ZREPF2
     C                   Z-ADD     CREP3         ZREPF3
     C                   Z-ADD     CREP4         ZREPF4
     C                   EXSR      CAV60
     C                   EXSR      MEA60
      *
     C     KEYMS4        READE     ECCI01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CED GROUP:34                                       CED34 /
      *////////////////////////////////////////////////////////////
     C     CED34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ECED01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECED01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CED
      *
     C     KEYMS2        READE     ECED01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CED GROUP:51                                       CED51 /
      *////////////////////////////////////////////////////////////
     C     CED51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     ECED01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECED01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CED
      *
     C     KEYMS3        READE     ECED01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:04                                       COM04 /
      *////////////////////////////////////////////////////////////
     C     COM04         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     4             ZGN2
     C     KEYMS2        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:29                                       COM29 /
      *////////////////////////////////////////////////////////////
     C     COM29         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     29            ZGN3
     C     KEYMS3        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:34                                       COM34 /
      *////////////////////////////////////////////////////////////
     C     COM34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:51                                       COM51 /
      *////////////////////////////////////////////////////////////
     C     COM51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:53                                       COM53 /
      *////////////////////////////////////////////////////////////
     C     COM53         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     53            ZGN4
     C     KEYMS4        SETLL     ECOM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ECOM01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS4        READE     ECOM01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:04                                       CTA04 /
      *////////////////////////////////////////////////////////////
     C     CTA04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ECTA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM04
      *
     C     KEYMS1        READE     ECTA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:29                                       CTA29 /
      *////////////////////////////////////////////////////////////
     C     CTA29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     ECTA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM29
      *
     C     KEYMS2        READE     ECTA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:53                                       CTA53 /
      *////////////////////////////////////////////////////////////
     C     CTA53         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     53            ZGN3
     C     KEYMS3        SETLL     ECTA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECTA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPE0
     C                   Z-ADD     CREP1         ZREPE1
     C                   Z-ADD     CREP2         ZREPE2
     C                   EXSR      COM53
      *
     C     KEYMS3        READE     ECTA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:06                                       CUX06 /
      *////////////////////////////////////////////////////////////
     C     CUX06         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     6             ZGN0
     C     KEYMS0        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECUX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      DTM06
      *
     C     KEYMS0        READE     ECUX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:18                                       CUX18 /
      *////////////////////////////////////////////////////////////
     C     CUX18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      DTM18
      *
     C     KEYMS1        READE     ECUX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:19                                       CUX19 /
      *////////////////////////////////////////////////////////////
     C     CUX19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:39                                       CUX39 /
      *////////////////////////////////////////////////////////////
     C     CUX39         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     39            ZGN2
     C     KEYMS2        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      DTM39
      *
     C     KEYMS2        READE     ECUX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:40                                       CUX40 /
      *////////////////////////////////////////////////////////////
     C     CUX40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ECUX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DGS GROUP:55                                       DGS55 /
      *////////////////////////////////////////////////////////////
     C     DGS55         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     55            ZGN2
     C     KEYMS2        SETLL     EDGS01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDGS01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DGS
     C                   Z-ADD     DREP0         ZREPD0
     C                   Z-ADD     DREP1         ZREPD1
     C                   Z-ADD     DREP2         ZREPD2
     C                   EXSR      QTY55
     C                   EXSR      FTX55
      *
     C     KEYMS2        READE     EDGS01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:36                                       DOC36 /
      *////////////////////////////////////////////////////////////
     C     DOC36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EDOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
      *
     C     KEYMS2        READE     EDOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:05                                       DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:06                                       DTM06 /
      *////////////////////////////////////////////////////////////
     C     DTM06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:07                                       DTM07 /
      *////////////////////////////////////////////////////////////

     C     DTM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:10                                       DTM10 /
      *////////////////////////////////////////////////////////////

     C     DTM10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:15                                       DTM15 /
      *////////////////////////////////////////////////////////////
     C     DTM15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:17                                       DTM17 /
      *////////////////////////////////////////////////////////////

     C     DTM17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:16                                       DTM16 /
      *////////////////////////////////////////////////////////////
     C     DTM16         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     16            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:18                                       DTM18 /
      *////////////////////////////////////////////////////////////
     C     DTM18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:19                                       DTM19 /
      *////////////////////////////////////////////////////////////
     C     DTM19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:20                                       DTM20 /
      *////////////////////////////////////////////////////////////
     C     DTM20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:26                                       DTM26 /
      *////////////////////////////////////////////////////////////
     C     DTM26         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     26            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:28                                       DTM28 /
      *////////////////////////////////////////////////////////////
     C     DTM28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:30                                       DTM30 /
      *////////////////////////////////////////////////////////////
     C     DTM30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:34                                       DTM34 /
      *////////////////////////////////////////////////////////////
     C     DTM34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:35                                       DTM35 /
      *////////////////////////////////////////////////////////////
     C     DTM35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:39                                       DTM39 /
      *////////////////////////////////////////////////////////////
     C     DTM39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:40                                       DTM40 /
      *////////////////////////////////////////////////////////////
     C     DTM40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:41                                       DTM41 /
      *////////////////////////////////////////////////////////////
     C     DTM41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:46                                       DTM46 /
      *////////////////////////////////////////////////////////////
     C     DTM46         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     46            ZGN4
     C     KEYMS4        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EDTM01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS4        READE     EDTM01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:48                                       DTM48 /
      *////////////////////////////////////////////////////////////
     C     DTM48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:51                                       DTM51 /
      *////////////////////////////////////////////////////////////
     C     DTM51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:54                                       DTM54 /
      *////////////////////////////////////////////////////////////
     C     DTM54         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     54            ZGN3
     C     KEYMS3        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:57                                       DTM57 /
      *////////////////////////////////////////////////////////////
     C     DTM57         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     57            ZGN4
     C     KEYMS4        SETLL     EDTM01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EDTM01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS4        READE     EDTM01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EFI GROUP:34                                       EFI34 /
      *////////////////////////////////////////////////////////////
     C     EFI34         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     34            ZGN1
     C     KEYMS1        SETLL     EEFI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EEFI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      EFI
     C                   Z-ADD     EREP0         ZREPC0
     C                   Z-ADD     EREP1         ZREPC1
     C                   EXSR      CED34
     C                   EXSR      COM34
     C                   EXSR      RFF34
     C                   EXSR      DTM34
     C                   EXSR      QTY34
      *
     C     KEYMS1        READE     EEFI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  EFI GROUP:51                                       EFI51 /
      *////////////////////////////////////////////////////////////
     C     EFI51         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     51            ZGN2
     C     KEYMS2        SETLL     EEFI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EEFI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      EFI
     C                   Z-ADD     EREP0         ZREPD0
     C                   Z-ADD     EREP1         ZREPD1
     C                   Z-ADD     EREP2         ZREPD2
     C                   EXSR      CED51
     C                   EXSR      COM51
     C                   EXSR      RFF51
     C                   EXSR      DTM51
     C                   EXSR      QTY51
      *
     C     KEYMS2        READE     EEFI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:17                                       FTX17 /
      *////////////////////////////////////////////////////////////
     C     FTX17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:36                                       FTX36 /
      *////////////////////////////////////////////////////////////
     C     FTX36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:55                                       FTX55 /
      *////////////////////////////////////////////////////////////
     C     FTX55         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     55            ZGN3
     C     KEYMS3        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:56                                       FTX56 /
      *////////////////////////////////////////////////////////////
     C     FTX56         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     56            ZGN3
     C     KEYMS3        SETLL     EFTX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EFTX01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS3        READE     EFTX01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:33                                       HAN33 /
      *////////////////////////////////////////////////////////////
     C     HAN33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EHAN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:36                                       HAN36 /
      *////////////////////////////////////////////////////////////
     C     HAN36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EHAN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:47                                       HAN47 /
      *////////////////////////////////////////////////////////////
     C     HAN47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     EHAN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EHAN01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS3        READE     EHAN01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HYN GROUP:56                                       HYN56 /
      *////////////////////////////////////////////////////////////
     C     HYN56         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     56            ZGN2
     C     KEYMS2        SETLL     EHYN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHYN01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HYN
     C                   Z-ADD     HREP0         ZREPD0
     C                   Z-ADD     HREP1         ZREPD1
     C                   Z-ADD     HREP2         ZREPD2
     C                   EXSR      PIA56
     C                   EXSR      QTY56
     C                   EXSR      FTX56
     C                   EXSR      RFF57
     C                   EXSR      CCI58
     C                   EXSR      NAD59
      *
     C     KEYMS2        READE     EHYN01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:36                                       IMD36 /
      *////////////////////////////////////////////////////////////
     C     IMD36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EIMD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EIMD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS2        READE     EIMD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LIN GROUP:36                                       LIN36 /
      *////////////////////////////////////////////////////////////
     C     LIN36         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     36            ZGN1
     C     KEYMS1        SETLL     ELIN01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELIN01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LIN
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      PIA36
     C                   EXSR      IMD36
     C                   EXSR      MEA36
     C                   EXSR      QTY36
     C                   EXSR      HAN36
     C                   EXSR      ALI36
     C                   EXSR      DTM36
     C                   EXSR      RFF36
     C                   EXSR      LOC36
     C                   EXSR      DOC36
     C                   EXSR      PTY36
     C                   EXSR      FTX36
     C                   EXSR      CCI37
     C                   EXSR      TAX38
     C                   EXSR      CUX39
     C                   EXSR      PRI40
     C                   EXSR      ALC41
     C                   EXSR      PAC47
     C                   EXSR      PAT48
     C                   EXSR      TDT49
     C                   EXSR      TOD50
     C                   EXSR      EFI51
     C                   EXSR      NAD52
     C                   EXSR      TRU54
     C                   EXSR      DGS55
     C                   EXSR      HYN56
      *
     C     KEYMS1        READE     ELIN01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:08                                       LOC08 /
      *////////////////////////////////////////////////////////////
     C     LOC08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:09                                       LOC09 /
      *////////////////////////////////////////////////////////////
     C     LOC09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:27                                       LOC27 /
      *////////////////////////////////////////////////////////////
     C     LOC27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:31                                       LOC31 /
      *////////////////////////////////////////////////////////////
     C     LOC31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:32                                       LOC32 /
      *////////////////////////////////////////////////////////////
     C     LOC32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:36                                       LOC36 /
      *////////////////////////////////////////////////////////////
     C     LOC36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:40                                       LOC40 /
      *////////////////////////////////////////////////////////////
     C     LOC40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:49                                       LOC49 /
      *////////////////////////////////////////////////////////////
     C     LOC49         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     49            ZGN3
     C     KEYMS3        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:50                                       LOC50 /
      *////////////////////////////////////////////////////////////
     C     LOC50         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     50            ZGN3
     C     KEYMS3        SETLL     ELOC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:33                                       MEA33 /
      *////////////////////////////////////////////////////////////
     C     MEA33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:36                                       MEA36 /
      *////////////////////////////////////////////////////////////
     C     MEA36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:37                                       MEA37 /
      *////////////////////////////////////////////////////////////
     C     MEA37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS3        READE     EMEA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:47                                       MEA47 /
      *////////////////////////////////////////////////////////////
     C     MEA47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS3        READE     EMEA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:58                                       MEA58 /
      *////////////////////////////////////////////////////////////
     C     MEA58         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     58            ZGN4
     C     KEYMS4        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMEA01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS4        READE     EMEA01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:60                                       MEA60 /
      *////////////////////////////////////////////////////////////
     C     MEA60         BEGSR
     C                   MOVE      '0'           *IN56
     C                   Z-ADD     60            ZGN5
     C     KEYMS5        SETLL     EMEA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS5        READE     EMEA01B                                56
     C     *IN56         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS5        READE     EMEA01B                                56
     C  N56              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:05                                       MOA05 /
      *////////////////////////////////////////////////////////////
     C     MOA05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:07                                       MOA07 /
      *////////////////////////////////////////////////////////////
     C     MOA07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:13                                       MOA13 /
      *////////////////////////////////////////////////////////////
     C     MOA13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      RNG13
      *
     C     KEYMS1        READE     EMOA01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:15                                       MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:20                                       MOA20 /
      *////////////////////////////////////////////////////////////
     C     MOA20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:24                                       MOA24 /
      *////////////////////////////////////////////////////////////
     C     MOA24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      RNG24
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:26                                       MOA26 /
      *////////////////////////////////////////////////////////////
     C     MOA26         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     26            ZGN3
     C     KEYMS3        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:30                                       MOA30 /
      *////////////////////////////////////////////////////////////
     C     MOA30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:38                                       MOA38 /
      *////////////////////////////////////////////////////////////
     C     MOA38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:44                                       MOA44 /
      *////////////////////////////////////////////////////////////
     C     MOA44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      RNG44
      *
     C     KEYMS3        READE     EMOA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:46                                       MOA46 /
      *////////////////////////////////////////////////////////////
     C     MOA46         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     46            ZGN4
     C     KEYMS4        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMOA01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS4        READE     EMOA01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:48                                       MOA48 /
      *////////////////////////////////////////////////////////////
     C     MOA48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EMOA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:02                                       NAD02 /
      *////////////////////////////////////////////////////////////
     C     NAD02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ENAD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPB0
     C                   EXSR      LOC02
     C                   EXSR      RFF03
     C                   EXSR      CTA04
      *
     C     KEYMS0        READE     ENAD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:27                                       NAD27 /
      *////////////////////////////////////////////////////////////
     C     NAD27         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     27            ZGN1
     C     KEYMS1        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC27
     C                   EXSR      RFF28
     C                   EXSR      CTA29
      *
     C     KEYMS1        READE     ENAD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:52                                       NAD52 /
      *////////////////////////////////////////////////////////////
     C     NAD52         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     52            ZGN2
     C     KEYMS2        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPD0
     C                   Z-ADD     NREP1         ZREPD1
     C                   Z-ADD     NREP2         ZREPD2
     C                   EXSR      CTA53
      *
     C     KEYMS2        READE     ENAD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:59                                       NAD59 /
      *////////////////////////////////////////////////////////////
     C     NAD59         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     59            ZGN3
     C     KEYMS3        SETLL     ENAD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ENAD01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPE0
     C                   Z-ADD     NREP1         ZREPE1
     C                   Z-ADD     NREP2         ZREPE2
     C                   Z-ADD     NREP3         ZREPE3
     C                   EXSR      PIA59
     C                   EXSR      QTY59
     C                   EXSR      CCI60
      *
     C     KEYMS3        READE     ENAD01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:33                                       PAC33 /
      *////////////////////////////////////////////////////////////
     C     PAC33         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     33            ZGN1
     C     KEYMS1        SETLL     EPAC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAC01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      MEA33
     C                   EXSR      HAN33
      *
     C     KEYMS1        READE     EPAC01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:47                                       PAC47 /
      *////////////////////////////////////////////////////////////
     C     PAC47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     EPAC01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPAC01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      MEA47
     C                   EXSR      QTY47
     C                   EXSR      HAN47
      *
     C     KEYMS2        READE     EPAC01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:07                                       PAT07 /
      *////////////////////////////////////////////////////////////
     C     PAT07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     EPAT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM07
     C                   EXSR      PCD07
     C                   EXSR      MOA07
      *
     C     KEYMS0        READE     EPAT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:30                                       PAT30 /
      *////////////////////////////////////////////////////////////
     C     PAT30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     EPAT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAT01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      DTM30
     C                   EXSR      PCD30
     C                   EXSR      MOA30
      *
     C     KEYMS1        READE     EPAT01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:48                                       PAT48 /
      *////////////////////////////////////////////////////////////
     C     PAT48         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     48            ZGN2
     C     KEYMS2        SETLL     EPAT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPAT01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      DTM48
     C                   EXSR      PCD48
     C                   EXSR      MOA48
      *
     C     KEYMS2        READE     EPAT01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:07                                       PCD07 /
      *////////////////////////////////////////////////////////////
     C     PCD07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:12                                       PCD12 /
      *////////////////////////////////////////////////////////////
     C     PCD12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RNG12
      *
     C     KEYMS1        READE     EPCD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:23                                       PCD23 /
      *////////////////////////////////////////////////////////////
     C     PCD23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RNG23
      *
     C     KEYMS2        READE     EPCD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:30                                       PCD30 /
      *////////////////////////////////////////////////////////////
     C     PCD30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:40                                       PCD40 /
      *////////////////////////////////////////////////////////////
     C     PCD40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:43                                       PCD43 /
      *////////////////////////////////////////////////////////////
     C     PCD43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPE0
     C                   Z-ADD     PREP1         ZREPE1
     C                   Z-ADD     PREP2         ZREPE2
     C                   Z-ADD     PREP3         ZREPE3
     C                   EXSR      RNG43
      *
     C     KEYMS3        READE     EPCD01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:48                                       PCD48 /
      *////////////////////////////////////////////////////////////
     C     PCD48         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     48            ZGN3
     C     KEYMS3        SETLL     EPCD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PGI GROUP:17                                       PGI17 /
      *////////////////////////////////////////////////////////////
     C     PGI17         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     17            ZGN0
     C     KEYMS0        SETLL     EPGI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPGI01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PGI
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM17
     C                   EXSR      QTY17
     C                   EXSR      ALI17
     C                   EXSR      FTX17
     C                   EXSR      CUX18
     C                   EXSR      PRI19
     C                   EXSR      TAX20
     C                   EXSR      ALC21
     C                   EXSR      NAD27
     C                   EXSR      PAT30
     C                   EXSR      TDT31
     C                   EXSR      TOD32
     C                   EXSR      PAC33
     C                   EXSR      EFI34
     C                   EXSR      TRU35
     C                   EXSR      LIN36
      *
     C     KEYMS0        READE     EPGI01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:36                                       PIA36 /
      *////////////////////////////////////////////////////////////
     C     PIA36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EPIA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:56                                       PIA56 /
      *////////////////////////////////////////////////////////////
     C     PIA56         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     56            ZGN3
     C     KEYMS3        SETLL     EPIA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPIA01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS3        READE     EPIA01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:59                                       PIA59 /
      *////////////////////////////////////////////////////////////
     C     PIA59         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     59            ZGN4
     C     KEYMS4        SETLL     EPIA01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EPIA01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS4        READE     EPIA01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:19                                       PRI19 /
      *////////////////////////////////////////////////////////////
     C     PRI19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     EPRI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      CUX19
     C                   EXSR      APR19
     C                   EXSR      RNG19
     C                   EXSR      DTM19
      *
     C     KEYMS1        READE     EPRI01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:40                                       PRI40 /
      *////////////////////////////////////////////////////////////
     C     PRI40         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     40            ZGN2
     C     KEYMS2        SETLL     EPRI01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      CUX40
     C                   EXSR      APR40
     C                   EXSR      RNG40
     C                   EXSR      DTM40
     C                   EXSR      PCD40
     C                   EXSR      LOC40
      *
     C     KEYMS2        READE     EPRI01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PTY GROUP:36                                       PTY36 /
      *////////////////////////////////////////////////////////////
     C     PTY36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EPTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PTY
      *
     C     KEYMS2        READE     EPTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:11                                       QTY11 /
      *////////////////////////////////////////////////////////////
     C     QTY11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPC0
     C                   Z-ADD     QREP1         ZREPC1
     C                   EXSR      RNG11
      *
     C     KEYMS1        READE     EQTY01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:17                                       QTY17 /
      *////////////////////////////////////////////////////////////
     C     QTY17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:22                                       QTY22 /
      *////////////////////////////////////////////////////////////
     C     QTY22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPD0
     C                   Z-ADD     QREP1         ZREPD1
     C                   Z-ADD     QREP2         ZREPD2
     C                   EXSR      RNG22
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:34                                       QTY34 /
      *////////////////////////////////////////////////////////////
     C     QTY34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:36                                       QTY36 /
      *////////////////////////////////////////////////////////////
     C     QTY36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:42                                       QTY42 /
      *////////////////////////////////////////////////////////////
     C     QTY42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPE0
     C                   Z-ADD     QREP1         ZREPE1
     C                   Z-ADD     QREP2         ZREPE2
     C                   Z-ADD     QREP3         ZREPE3
     C                   EXSR      RNG42
      *
     C     KEYMS3        READE     EQTY01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:47                                       QTY47 /
      *////////////////////////////////////////////////////////////
     C     QTY47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:51                                       QTY51 /
      *////////////////////////////////////////////////////////////
     C     QTY51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:55                                       QTY55 /
      *////////////////////////////////////////////////////////////
     C     QTY55         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     55            ZGN3
     C     KEYMS3        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:56                                       QTY56 /
      *////////////////////////////////////////////////////////////
     C     QTY56         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     56            ZGN3
     C     KEYMS3        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS3        READE     EQTY01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:59                                       QTY59 /
      *////////////////////////////////////////////////////////////
     C     QTY59         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     59            ZGN4
     C     KEYMS4        SETLL     EQTY01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EQTY01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS4        READE     EQTY01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:03                                       RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     ERFF01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:28                                       RFF28 /
      *////////////////////////////////////////////////////////////
     C     RFF28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM28
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:34                                       RFF34 /
      *////////////////////////////////////////////////////////////
     C     RFF34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:36                                       RFF36 /
      *////////////////////////////////////////////////////////////
     C     RFF36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:51                                       RFF51 /
      *////////////////////////////////////////////////////////////
     C     RFF51         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     51            ZGN3
     C     KEYMS3        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS3        READE     ERFF01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:57                                       RFF57 /
      *////////////////////////////////////////////////////////////
     C     RFF57         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     57            ZGN3
     C     KEYMS3        SETLL     ERFF01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERFF01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPE0
     C                   Z-ADD     RREP1         ZREPE1
     C                   Z-ADD     RREP2         ZREPE2
     C                   Z-ADD     RREP3         ZREPE3
     C                   EXSR      DTM57
      *
     C     KEYMS3        READE     ERFF01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:11                                       RNG11 /
      *////////////////////////////////////////////////////////////
     C     RNG11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:12                                       RNG12 /
      *////////////////////////////////////////////////////////////
     C     RNG12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:13                                       RNG13 /
      *////////////////////////////////////////////////////////////
     C     RNG13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:14                                       RNG14 /
      *////////////////////////////////////////////////////////////
     C     RNG14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:19                                       RNG19 /
      *////////////////////////////////////////////////////////////
     C     RNG19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:22                                       RNG22 /
      *////////////////////////////////////////////////////////////
     C     RNG22         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     22            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:23                                       RNG23 /
      *////////////////////////////////////////////////////////////
     C     RNG23         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     23            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:24                                       RNG24 /
      *////////////////////////////////////////////////////////////
     C     RNG24         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     24            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:25                                       RNG25 /
      *////////////////////////////////////////////////////////////
     C     RNG25         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     25            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:40                                       RNG40 /
      *////////////////////////////////////////////////////////////
     C     RNG40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:42                                       RNG42 /
      *////////////////////////////////////////////////////////////
     C     RNG42         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     42            ZGN4
     C     KEYMS4        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:43                                       RNG43 /
      *////////////////////////////////////////////////////////////
     C     RNG43         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     43            ZGN4
     C     KEYMS4        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:44                                       RNG44 /
      *////////////////////////////////////////////////////////////
     C     RNG44         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     44            ZGN4
     C     KEYMS4        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:45                                       RNG45 /
      *////////////////////////////////////////////////////////////
     C     RNG45         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     45            ZGN4
     C     KEYMS4        SETLL     ERNG01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG01B                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG01B                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:14                                       RTE14 /
      *////////////////////////////////////////////////////////////
     C     RTE14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERTE01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RNG14
      *
     C     KEYMS1        READE     ERTE01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:25                                       RTE25 /
      *////////////////////////////////////////////////////////////
     C     RTE25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERTE01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      RNG25
      *
     C     KEYMS2        READE     ERTE01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:45                                       RTE45 /
      *////////////////////////////////////////////////////////////
     C     RTE45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     ERTE01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERTE01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPE0
     C                   Z-ADD     RREP1         ZREPE1
     C                   Z-ADD     RREP2         ZREPE2
     C                   Z-ADD     RREP3         ZREPE3
     C                   EXSR      RNG45
      *
     C     KEYMS3        READE     ERTE01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    UMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'PRICAT'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   MOVEL     WDT           MDT
     C                   MOVEL     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      DTM00
     C                   EXSR      ALI00
     C                   EXSR      FTX00
     C                   EXSR      RFF01
     C                   EXSR      NAD02
     C                   EXSR      TAX05
     C                   EXSR      CUX06
     C                   EXSR      PAT07
     C                   EXSR      TDT08
     C                   EXSR      TOD09
     C                   EXSR      ALC10
     C                   EXSR      PGI17
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:05                                       TAX05 /
      *////////////////////////////////////////////////////////////
     C     TAX05         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETAX01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      MOA05
     C                   EXSR      DTM05
      *
     C     KEYMS0        READE     ETAX01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:15                                       TAX15 /
      *////////////////////////////////////////////////////////////
     C     TAX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA15
     C                   EXSR      DTM15
      *
     C     KEYMS1        READE     ETAX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:20                                       TAX20 /
      *////////////////////////////////////////////////////////////
     C     TAX20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA20
     C                   EXSR      DTM20
      *
     C     KEYMS1        READE     ETAX01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:26                                       TAX26 /
      *////////////////////////////////////////////////////////////
     C     TAX26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA26
     C                   EXSR      DTM26
      *
     C     KEYMS2        READE     ETAX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:38                                       TAX38 /
      *////////////////////////////////////////////////////////////
     C     TAX38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA38
     C                   EXSR      DTM38
      *
     C     KEYMS2        READE     ETAX01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:46                                       TAX46 /
      *////////////////////////////////////////////////////////////
     C     TAX46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     ETAX01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ETAX01B                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPE0
     C                   Z-ADD     TREP1         ZREPE1
     C                   Z-ADD     TREP2         ZREPE2
     C                   Z-ADD     TREP3         ZREPE3
     C                   EXSR      MOA46
     C                   EXSR      DTM46
      *
     C     KEYMS3        READE     ETAX01B                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:08                                       TDT08 /
      *////////////////////////////////////////////////////////////
     C     TDT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     ETDT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC08
      *
     C     KEYMS0        READE     ETDT01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:31                                       TDT31 /
      *////////////////////////////////////////////////////////////
     C     TDT31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     ETDT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC31
      *
     C     KEYMS1        READE     ETDT01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:49                                       TDT49 /
      *////////////////////////////////////////////////////////////
     C     TDT49         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     49            ZGN2
     C     KEYMS2        SETLL     ETDT01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETDT01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      LOC49
      *
     C     KEYMS2        READE     ETDT01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:09                                       TOD09 /
      *////////////////////////////////////////////////////////////
     C     TOD09         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     9             ZGN0
     C     KEYMS0        SETLL     ETOD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETOD01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC09
      *
     C     KEYMS0        READE     ETOD01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:32                                       TOD32 /
      *////////////////////////////////////////////////////////////
     C     TOD32         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     32            ZGN1
     C     KEYMS1        SETLL     ETOD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC32
      *
     C     KEYMS1        READE     ETOD01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:50                                       TOD50 /
      *////////////////////////////////////////////////////////////
     C     TOD50         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     50            ZGN2
     C     KEYMS2        SETLL     ETOD01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETOD01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      LOC50
      *
     C     KEYMS2        READE     ETOD01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TRU GROUP:16                                       TRU16 /
      *////////////////////////////////////////////////////////////
     C     TRU16         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     16            ZGN0
     C     KEYMS0        SETLL     ETRU01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETRU01B                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TRU
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      DTM16
      *
     C     KEYMS0        READE     ETRU01B                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TRU GROUP:35                                       TRU35 /
      *////////////////////////////////////////////////////////////
     C     TRU35         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     35            ZGN1
     C     KEYMS1        SETLL     ETRU01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETRU01B                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TRU
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      DTM35
      *
     C     KEYMS1        READE     ETRU01B                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TRU GROUP:54                                       TRU54 /
      *////////////////////////////////////////////////////////////
     C     TRU54         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     54            ZGN2
     C     KEYMS2        SETLL     ETRU01B                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETRU01B                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TRU
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      DTM54
      *
     C     KEYMS2        READE     ETRU01B                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  UNS GROUP:00. FORTLØPENDE NUMMERERING              UNS00 /
      *////////////////////////////////////////////////////////////
     C     UNS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     50            ZGN0
     C     KEYMS0        SETLL     EUNS                                   20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EUNS                                   51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      UNS
      *
     C     KEYMS0        READE     EUNS                                   51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      /COPY QEDSRC,ALC_O_01B
      /COPY QEDSRC,ALI_O_01B
      /COPY QEDSRC,APR_O_01B
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,CAV_O_01B
      /COPY QEDSRC,CCI_O_01B
      /COPY QEDSRC,CED_O_01B
      /COPY QEDSRC,COM_O_01B
      /COPY QEDSRC,CTA_O_01B
      /COPY QEDSRC,CUX_O_01B
      /COPY QEDSRC,DGS_O_01B
      /COPY QEDSRC,DOC_O_01B
      /COPY QEDSRC,DTM_O_01B
      /COPY QEDSRC,EFI_O_01B
      /COPY QEDSRC,FTX_O_01B
      /COPY QEDSRC,HAN_O_01B
      /COPY QEDSRC,HYN_O_01B
      /COPY QEDSRC,IMD_O_01B
      /COPY QEDSRC,LIN_O_01B
      /COPY QEDSRC,LOC_O_01B
      /COPY QEDSRC,MEA_O_01B
      /COPY QEDSRC,MOA_O_01B
      /COPY QEDSRC,NAD_O_01B
      /COPY QEDSRC,PAC_O_01B
      /COPY QEDSRC,PAT_O_01B
      /COPY QEDSRC,PCD_O_01B
      /COPY QEDSRC,PGI_O_01B
      /COPY QEDSRC,PIA_O_01B
      /COPY QEDSRC,PRI_O_01B
      /COPY QEDSRC,PTY_O_01B
      /COPY QEDSRC,QTY_O_01B
      /COPY QEDSRC,RFF_O_01B
      /COPY QEDSRC,RNG_O_01B
      /COPY QEDSRC,RTE_O_01B
      /COPY QEDSRC,TAX_O_01B
      /COPY QEDSRC,TDT_O_01B
      /COPY QEDSRC,TOD_O_01B
      /COPY QEDSRC,TRU_O_01B
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNS_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
