     FEDIS      UF   E           K DISK
     FEUNB      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FEUNH      UF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FEDII      IF   E           K DISK
     FEUNS      IF   E           K DISK
     FECMSG1    IF   E           K DISK
     FEDISE     O  A E             DISK
     FEALC96A   IF   E           K DISK
     FEALI96A   IF   E           K DISK
     FEAPR96A   IF   E           K DISK
     FECAV96A   IF   E           K DISK
     FECCI96A   IF   E           K DISK
     FECOM96A   IF   E           K DISK
     FECTA96A   IF   E           K DISK
     FECUX96A   IF   E           K DISK
     FEDOC96A   IF   E           K DISK
     FEDTM96A   IF   E           K DISK
     FEFTX96A   IF   E           K DISK
     FEHAN96A   IF   E           K DISK
     FEIMD96A   IF   E           K DISK
     FELIN96A   IF   E           K DISK
     FELOC96A   IF   E           K DISK
     FEMEA96A   IF   E           K DISK
     FEMOA96A   IF   E           K DISK
     FENAD96A   IF   E           K DISK
     FEPAC96A   IF   E           K DISK
     FEPAT96A   IF   E           K DISK
     FEPCD96A   IF   E           K DISK
     FEPCI96A   IF   E           K DISK
     FEPGI96A   IF   E           K DISK
     FEPIA96A   IF   E           K DISK
     FEPRI96A   IF   E           K DISK
     FEQTY96A   IF   E           K DISK
     FERFF96A   IF   E           K DISK
     FERNG96A   IF   E           K DISK
     FERTE96A   IF   E           K DISK
     FETAX96A   IF   E           K DISK
     FETDT96A   IF   E           K DISK
     FETOD96A   IF   E           K DISK
     D A               S              1    DIM(70)
     D B               S              1    DIM(80)
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *____________
      * DS for Dato
      *""""""""""""
     D                 DS
     D  WUMN                   1      9  0
     D  ZGN0                  10     11  0
     D  ZGN1                  12     13  0
     D  ZGN2                  14     15  0
     D  ZGN3                  16     17  0
     D  ZGN4                  18     19  0
     D  ZGN5                  20     21  0
     D  ZGN6                  22     23  0
     D  ZGN7                  24     25  0
     D  ZGN8                  26     27  0
     D  ZREPB0                28     31  0
     D  ZREPC0                32     35  0
     D  ZREPD0                36     39  0
     D  ZREPE0                40     43  0
     D  ZREPF0                44     47  0
     D  ZREPG0                48     51  0
     D  ZREPH0                52     55  0
     D  ZREPI0                56     59  0
     D  ZREPC1                60     63  0
     D  ZREPD1                64     67  0
     D  ZREPE1                68     71  0
     D  ZREPF1                72     75  0
     D  ZREPG1                76     79  0
     D  ZREPH1                80     83  0
     D  ZREPI1                84     87  0
     D  ZREPD2                88     91  0
     D  ZREPE2                92     95  0
     D  ZREPF2                96     99  0
     D  ZREPG2               100    103  0
     D  ZREPH2               104    107  0
     D  ZREPI2               108    111  0
     D  ZREPE3               112    115  0
     D  ZREPF3               116    119  0
     D  ZREPG3               120    123  0
     D  ZREPH3               124    127  0
     D  ZREPI3               128    131  0
     D  ZREPF4               132    135  0
     D  ZREPG4               136    139  0
     D  ZREPH4               140    143  0
     D  ZREPI4               144    147  0
     D  ZREPG5               148    151  0
     D  ZREPH5               152    155  0
     D  ZREPI5               156    159  0
     D  ZREPH6               160    163  0
     D  ZREPI6               164    167  0
     D  ZREPI7               168    171  0
     IEDIMR
     I              MMN                         TVIMMN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:10                                       ALC10 /
      *////////////////////////////////////////////////////////////
     C     ALC10         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     10            ZGN0
     C     KEYMS0        SETLL     EALC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALC96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPB0
     C                   EXSR      ALI10
     C                   EXSR      DTM10
     C                   EXSR      QTY11
     C                   EXSR      PCD12
     C                   EXSR      MOA13
     C                   EXSR      RTE14
     C                   EXSR      TAX15
      *
     C     KEYMS0        READE     EALC96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:20                                       ALC20 /
      *////////////////////////////////////////////////////////////
     C     ALC20         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     20            ZGN1
     C     KEYMS1        SETLL     EALC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALC96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPC0
     C                   Z-ADD     AREP1         ZREPC1
     C                   EXSR      ALI20
     C                   EXSR      QTY21
     C                   EXSR      PCD22
     C                   EXSR      MOA23
     C                   EXSR      RTE24
     C                   EXSR      TAX25
      *
     C     KEYMS1        READE     EALC96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALC GROUP:38                                       ALC38 /
      *////////////////////////////////////////////////////////////
     C     ALC38         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     38            ZGN2
     C     KEYMS2        SETLL     EALC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALC
     C                   Z-ADD     AREP0         ZREPD0
     C                   Z-ADD     AREP1         ZREPD1
     C                   Z-ADD     AREP2         ZREPD2
     C                   EXSR      ALI38
     C                   EXSR      DTM38
     C                   EXSR      QTY39
     C                   EXSR      PCD40
     C                   EXSR      MOA41
     C                   EXSR      RTE42
     C                   EXSR      TAX43
      *
     C     KEYMS2        READE     EALC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:00                                       ALI00 /
      *////////////////////////////////////////////////////////////
     C     ALI00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EALI96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS0        READE     EALI96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:10                                       ALI10 /
      *////////////////////////////////////////////////////////////
     C     ALI10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:16                                       ALI16 /
      *////////////////////////////////////////////////////////////
     C     ALI16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EALI96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS1        READE     EALI96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:20                                       ALI20 /
      *////////////////////////////////////////////////////////////
     C     ALI20         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     20            ZGN2
     C     KEYMS2        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:33                                       ALI33 /
      *////////////////////////////////////////////////////////////
     C     ALI33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EALI96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS2        READE     EALI96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  ALI GROUP:38                                       ALI38 /
      *////////////////////////////////////////////////////////////
     C     ALI38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EALI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EALI96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS3        READE     EALI96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  APR GROUP:18                                       APR18 /
      *////////////////////////////////////////////////////////////
     C     APR18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     EAPR96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EAPR96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      APR
      *
     C     KEYMS2        READE     EAPR96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  APR GROUP:37                                       APR37 /
      *////////////////////////////////////////////////////////////
     C     APR37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EAPR96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EAPR96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      ALI
      *
     C     KEYMS3        READE     EAPR96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CAV GROUP:34                                       CAV34 /
      *////////////////////////////////////////////////////////////
     C     CAV34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN3
     C     KEYMS3        SETLL     ECAV96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECAV96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CAV
      *
     C     KEYMS3        READE     ECAV96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CCI GROUP:34                                       CCI34 /
      *////////////////////////////////////////////////////////////
     C     CCI34         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     34            ZGN2
     C     KEYMS2        SETLL     ECCI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECCI96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CCI
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      CAV34
     C                   EXSR      MEA34
      *
     C     KEYMS2        READE     ECCI96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:04                                       COM04 /
      *////////////////////////////////////////////////////////////
     C     COM04         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     4             ZGN2
     C     KEYMS2        SETLL     ECOM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECOM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS2        READE     ECOM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  COM GROUP:28                                       COM28 /
      *////////////////////////////////////////////////////////////
     C     COM28         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     28            ZGN3
     C     KEYMS3        SETLL     ECOM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECOM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      COM
      *
     C     KEYMS3        READE     ECOM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:04                                       CTA04 /
      *////////////////////////////////////////////////////////////
     C     CTA04         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     4             ZGN1
     C     KEYMS1        SETLL     ECTA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECTA96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      COM04
      *
     C     KEYMS1        READE     ECTA96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTA GROUP:28                                       CTA28 /
      *////////////////////////////////////////////////////////////
     C     CTA28         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     28            ZGN2
     C     KEYMS2        SETLL     ECTA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECTA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CTA
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      COM28
      *
     C     KEYMS2        READE     ECTA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:06                                       CUX06 /
      *////////////////////////////////////////////////////////////
     C     CUX06         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     6             ZGN0
     C     KEYMS0        SETLL     ECUX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ECUX96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPB0
     C                   EXSR      DTM06
      *
     C     KEYMS0        READE     ECUX96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:17                                       CUX17 /
      *////////////////////////////////////////////////////////////
     C     CUX17         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     17            ZGN1
     C     KEYMS1        SETLL     ECUX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ECUX96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPC0
     C                   Z-ADD     CREP1         ZREPC1
     C                   EXSR      DTM17
      *
     C     KEYMS1        READE     ECUX96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:18                                       CUX18 /
      *////////////////////////////////////////////////////////////
     C     CUX18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     ECUX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS2        READE     ECUX96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:36                                       CUX36 /
      *////////////////////////////////////////////////////////////
     C     CUX36         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     36            ZGN2
     C     KEYMS2        SETLL     ECUX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ECUX96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      CUX
     C                   Z-ADD     CREP0         ZREPD0
     C                   Z-ADD     CREP1         ZREPD1
     C                   Z-ADD     CREP2         ZREPD2
     C                   EXSR      DTM36
      *
     C     KEYMS2        READE     ECUX96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CUX GROUP:37                                       CUX37 /
      *////////////////////////////////////////////////////////////
     C     CUX37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ECUX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ECUX96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      CUX
      *
     C     KEYMS3        READE     ECUX96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DOC GROUP:33                                       DOC33 /
      *////////////////////////////////////////////////////////////
     C     DOC33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EDOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDOC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DOC
      *
     C     KEYMS2        READE     EDOC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:00                                       DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EDTM96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS0        READE     EDTM96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:01                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     1             ZGN1
     C     KEYMS1        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:03                                       DTM03 /
      *////////////////////////////////////////////////////////////
     C     DTM03         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     3             ZGN2
     C     KEYMS2        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:06                                       DTM06 /
      *////////////////////////////////////////////////////////////
     C     DTM06         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     6             ZGN1
     C     KEYMS1        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:07                                       DTM07 /
      *////////////////////////////////////////////////////////////

     C     DTM07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:10                                       DTM10 /
      *////////////////////////////////////////////////////////////

     C     DTM10         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     10            ZGN1
     C     KEYMS1        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:16                                       DTM16 /
      *////////////////////////////////////////////////////////////

     C     DTM16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EDTM96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS1        READE     EDTM96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:17                                       DTM17 /
      *////////////////////////////////////////////////////////////
     C     DTM17         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     17            ZGN2
     C     KEYMS2        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:18                                       DTM18 /
      *////////////////////////////////////////////////////////////
     C     DTM18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:27                                       DTM27 /
      *////////////////////////////////////////////////////////////
     C     DTM27         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     27            ZGN3
     C     KEYMS3        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:29                                       DTM29 /
      *////////////////////////////////////////////////////////////
     C     DTM29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:33                                       DTM33 /
      *////////////////////////////////////////////////////////////
     C     DTM33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EDTM96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS2        READE     EDTM96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:36                                       DTM36 /
      *////////////////////////////////////////////////////////////
     C     DTM36         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     36            ZGN3
     C     KEYMS3        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:37                                       DTM37 /
      *////////////////////////////////////////////////////////////
     C     DTM37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:38                                       DTM38 /
      *////////////////////////////////////////////////////////////
     C     DTM38         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     38            ZGN3
     C     KEYMS3        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  DTM GROUP:45                                       DTM45 /
      *////////////////////////////////////////////////////////////
     C     DTM45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EDTM96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EDTM96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      DTM
      *
     C     KEYMS3        READE     EDTM96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:00                                       FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     0             ZGN0
     C     KEYMS0        SETLL     EFTX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EFTX96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS0        READE     EFTX96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:16                                       FTX16 /
      *////////////////////////////////////////////////////////////
     C     FTX16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EFTX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EFTX96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS1        READE     EFTX96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  FTX GROUP:33                                       FTX33 /
      *////////////////////////////////////////////////////////////
     C     FTX33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EFTX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EFTX96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      FTX
      *
     C     KEYMS2        READE     EFTX96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:32                                       HAN32 /
      *////////////////////////////////////////////////////////////
     C     HAN32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EHAN96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:33                                       HAN33 /
      *////////////////////////////////////////////////////////////
     C     HAN33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EHAN96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EHAN96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS2        READE     EHAN96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  HAN GROUP:44                                       HAN44 /
      *////////////////////////////////////////////////////////////
     C     HAN44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EHAN96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EHAN96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      HAN
      *
     C     KEYMS3        READE     EHAN96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  IMD GROUP:33                                       IMD33 /
      *////////////////////////////////////////////////////////////
     C     IMD33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EIMD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EIMD96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      IMD
      *
     C     KEYMS2        READE     EIMD96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LIN GROUP:33                                       LIN33 /
      *////////////////////////////////////////////////////////////
     C     LIN33         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     33            ZGN1
     C     KEYMS1        SETLL     ELIN96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELIN96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LIN
     C                   Z-ADD     LREP0         ZREPC0
     C                   Z-ADD     LREP1         ZREPC1
     C                   EXSR      PIA33
     C                   EXSR      IMD33
     C                   EXSR      MEA33
     C                   EXSR      QTY33
     C                   EXSR      HAN33
     C                   EXSR      ALI33
     C                   EXSR      DTM33
     C                   EXSR      NAD33
     C                   EXSR      RFF33
     C                   EXSR      LOC33
     C                   EXSR      DOC33
     C                   EXSR      FTX33
     C                   EXSR      CCI34
     C                   EXSR      TAX35
     C                   EXSR      CUX36
     C                   EXSR      PRI37
     C                   EXSR      ALC38
     C                   EXSR      PAC44
     C                   EXSR      PAT45
     C                   EXSR      TDT46
     C                   EXSR      TOD47
      *
     C     KEYMS1        READE     ELIN96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:02                                       LOC02 /
      *////////////////////////////////////////////////////////////
     C     LOC02         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     2             ZGN1
     C     KEYMS1        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:08                                       LOC08 /
      *////////////////////////////////////////////////////////////
     C     LOC08         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     8             ZGN1
     C     KEYMS1        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:09                                       LOC09 /
      *////////////////////////////////////////////////////////////
     C     LOC09         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     9             ZGN1
     C     KEYMS1        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ELOC96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS1        READE     ELOC96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:26                                       LOC26 /
      *////////////////////////////////////////////////////////////
     C     LOC26         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     26            ZGN2
     C     KEYMS2        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:30                                       LOC30 /
      *////////////////////////////////////////////////////////////
     C     LOC30         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     30            ZGN2
     C     KEYMS2        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:31                                       LOC31 /
      *////////////////////////////////////////////////////////////
     C     LOC31         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     31            ZGN2
     C     KEYMS2        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:33                                       LOC33 /
      *////////////////////////////////////////////////////////////
     C     LOC33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ELOC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS2        READE     ELOC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:46                                       LOC46 /
      *////////////////////////////////////////////////////////////
     C     LOC46         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     46            ZGN3
     C     KEYMS3        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LOC GROUP:47                                       LOC47 /
      *////////////////////////////////////////////////////////////
     C     LOC47         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     47            ZGN3
     C     KEYMS3        SETLL     ELOC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ELOC96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      LOC
      *
     C     KEYMS3        READE     ELOC96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:32                                       MEA32 /
      *////////////////////////////////////////////////////////////
     C     MEA32         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     32            ZGN2
     C     KEYMS2        SETLL     EMEA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:33                                       MEA33 /
      *////////////////////////////////////////////////////////////
     C     MEA33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EMEA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMEA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS2        READE     EMEA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:34                                       MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     34            ZGN3
     C     KEYMS3        SETLL     EMEA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS3        READE     EMEA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MEA GROUP:44                                       MEA44 /
      *////////////////////////////////////////////////////////////
     C     MEA44         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     44            ZGN3
     C     KEYMS3        SETLL     EMEA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMEA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MEA
      *
     C     KEYMS3        READE     EMEA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:05                                       MOA05 /
      *////////////////////////////////////////////////////////////
     C     MOA05         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     5             ZGN1
     C     KEYMS1        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:07                                       MOA07 /
      *////////////////////////////////////////////////////////////
     C     MOA07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS1        READE     EMOA96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:13                                       MOA13 /
      *////////////////////////////////////////////////////////////
     C     MOA13         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     13            ZGN1
     C     KEYMS1        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EMOA96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPC0
     C                   Z-ADD     MREP1         ZREPC1
     C                   EXSR      RNG13
      *
     C     KEYMS1        READE     EMOA96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:15                                       MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     15            ZGN2
     C     KEYMS2        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:19                                       MOA19 /
      *////////////////////////////////////////////////////////////
     C     MOA19         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     19            ZGN2
     C     KEYMS2        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:23                                       MOA23 /
      *////////////////////////////////////////////////////////////
     C     MOA23         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     23            ZGN2
     C     KEYMS2        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPD0
     C                   Z-ADD     MREP1         ZREPD1
     C                   Z-ADD     MREP2         ZREPD2
     C                   EXSR      RNG23
      *
     C     KEYMS2        READE     EMOA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:25                                       MOA25 /
      *////////////////////////////////////////////////////////////
     C     MOA25         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     25            ZGN3
     C     KEYMS3        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:29                                       MOA29 /
      *////////////////////////////////////////////////////////////
     C     MOA29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EMOA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS2        READE     EMOA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:35                                       MOA35 /
      *////////////////////////////////////////////////////////////
     C     MOA35         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     35            ZGN3
     C     KEYMS3        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:41                                       MOA41 /
      *////////////////////////////////////////////////////////////
     C     MOA41         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     41            ZGN3
     C     KEYMS3        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
     C                   Z-ADD     MREP0         ZREPE0
     C                   Z-ADD     MREP1         ZREPE1
     C                   Z-ADD     MREP2         ZREPE2
     C                   Z-ADD     MREP3         ZREPE3
     C                   EXSR      RNG41
      *
     C     KEYMS3        READE     EMOA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:43                                       MOA43 /
      *////////////////////////////////////////////////////////////
     C     MOA43         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     43            ZGN4
     C     KEYMS4        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     EMOA96A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS4        READE     EMOA96A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  MOA GROUP:45                                       MOA45 /
      *////////////////////////////////////////////////////////////
     C     MOA45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EMOA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EMOA96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      MOA
      *
     C     KEYMS3        READE     EMOA96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:02                                       NAD02 /
      *////////////////////////////////////////////////////////////
     C     NAD02         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     2             ZGN0
     C     KEYMS0        SETLL     ENAD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ENAD96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPB0
     C                   EXSR      LOC02
     C                   EXSR      RFF03
     C                   EXSR      CTA04
      *
     C     KEYMS0        READE     ENAD96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:26                                       NAD26 /
      *////////////////////////////////////////////////////////////
     C     NAD26         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     26            ZGN1
     C     KEYMS1        SETLL     ENAD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ENAD96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      NAD
     C                   Z-ADD     NREP0         ZREPC0
     C                   Z-ADD     NREP1         ZREPC1
     C                   EXSR      LOC26
     C                   EXSR      RFF27
     C                   EXSR      CTA28
      *
     C     KEYMS1        READE     ENAD96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  NAD GROUP:33                                       NAD33 /
      *////////////////////////////////////////////////////////////
     C     NAD33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ENAD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ENAD96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      NAD
      *
     C     KEYMS2        READE     ENAD96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:32                                       PAC32 /
      *////////////////////////////////////////////////////////////
     C     PAC32         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     32            ZGN1
     C     KEYMS1        SETLL     EPAC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAC96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      MEA32
     C                   EXSR      HAN32
      *
     C     KEYMS1        READE     EPAC96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAC GROUP:44                                       PAC44 /
      *////////////////////////////////////////////////////////////
     C     PAC44         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     44            ZGN2
     C     KEYMS2        SETLL     EPAC96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPAC96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PAC
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      MEA44
     C                   EXSR      HAN44
      *
     C     KEYMS2        READE     EPAC96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:07                                       PAT07 /
      *////////////////////////////////////////////////////////////
     C     PAT07         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     7             ZGN0
     C     KEYMS0        SETLL     EPAT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPAT96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM07
     C                   EXSR      PCD07
     C                   EXSR      MOA07
      *
     C     KEYMS0        READE     EPAT96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:29                                       PAT29 /
      *////////////////////////////////////////////////////////////
     C     PAT29         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     29            ZGN1
     C     KEYMS1        SETLL     EPAT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPAT96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      DTM29
     C                   EXSR      PCD29
     C                   EXSR      MOA29
      *
     C     KEYMS1        READE     EPAT96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PAT GROUP:45                                       PAT45 /
      *////////////////////////////////////////////////////////////
     C     PAT45         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     45            ZGN2
     C     KEYMS2        SETLL     EPAT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPAT96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PAT
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      DTM45
     C                   EXSR      PCD45
     C                   EXSR      MOA45
      *
     C     KEYMS2        READE     EPAT96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:07                                       PCD07 /
      *////////////////////////////////////////////////////////////
     C     PCD07         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     7             ZGN1
     C     KEYMS1        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS1        READE     EPCD96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:12                                       PCD12 /
      *////////////////////////////////////////////////////////////
     C     PCD12         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     12            ZGN1
     C     KEYMS1        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPCD96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPC0
     C                   Z-ADD     PREP1         ZREPC1
     C                   EXSR      RNG12
      *
     C     KEYMS1        READE     EPCD96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:22                                       PCD22 /
      *////////////////////////////////////////////////////////////
     C     PCD22         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     22            ZGN2
     C     KEYMS2        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      RNG22
      *
     C     KEYMS2        READE     EPCD96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:29                                       PCD29 /
      *////////////////////////////////////////////////////////////
     C     PCD29         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     29            ZGN2
     C     KEYMS2        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPCD96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS2        READE     EPCD96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:37                                       PCD37 /
      *////////////////////////////////////////////////////////////
     C     PCD37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:40                                       PCD40 /
      *////////////////////////////////////////////////////////////
     C     PCD40         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     40            ZGN3
     C     KEYMS3        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
     C                   Z-ADD     PREP0         ZREPE0
     C                   Z-ADD     PREP1         ZREPE1
     C                   Z-ADD     PREP2         ZREPE2
     C                   Z-ADD     PREP3         ZREPE3
     C                   EXSR      RNG40
      *
     C     KEYMS3        READE     EPCD96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PCD GROUP:45                                       PCD45 /
      *////////////////////////////////////////////////////////////
     C     PCD45         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     45            ZGN3
     C     KEYMS3        SETLL     EPCD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EPCD96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      PCD
      *
     C     KEYMS3        READE     EPCD96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PGI GROUP:16                                       PGI16 /
      *////////////////////////////////////////////////////////////
     C     PGI16         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     16            ZGN0
     C     KEYMS0        SETLL     EPGI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EPGI96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      PGI
     C                   Z-ADD     PREP0         ZREPB0
     C                   EXSR      DTM16
     C                   EXSR      QTY16
     C                   EXSR      ALI16
     C                   EXSR      FTX16
     C                   EXSR      CUX17
     C                   EXSR      PRI18
     C                   EXSR      TAX19
     C                   EXSR      ALC20
     C                   EXSR      NAD26
     C                   EXSR      PAT29
     C                   EXSR      TDT30
     C                   EXSR      TOD31
     C                   EXSR      PAC32
     C                   EXSR      LIN33
      *
     C     KEYMS0        READE     EPGI96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:33                                       PIA33 /
      *////////////////////////////////////////////////////////////
     C     PIA33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EPIA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PIA GROUP:45                                       PIA45 /
      *////////////////////////////////////////////////////////////
     C     PIA45         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     45            ZGN2
     C     KEYMS2        SETLL     EPIA96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPIA96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PIA
      *
     C     KEYMS2        READE     EPIA96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:18                                       PRI18 /
      *////////////////////////////////////////////////////////////
     C     PRI18         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     18            ZGN1
     C     KEYMS1        SETLL     EPRI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EPRI96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      CUX18
     C                   EXSR      APR18
     C                   EXSR      RNG18
     C                   EXSR      DTM18
      *
     C     KEYMS1        READE     EPRI96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  PRI GROUP:37                                       PRI37 /
      *////////////////////////////////////////////////////////////
     C     PRI37         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     37            ZGN2
     C     KEYMS2        SETLL     EPRI96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EPRI96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      PRI
     C                   Z-ADD     PREP0         ZREPD0
     C                   Z-ADD     PREP1         ZREPD1
     C                   Z-ADD     PREP2         ZREPD2
     C                   EXSR      CUX37
     C                   EXSR      APR37
     C                   EXSR      RNG37
     C                   EXSR      DTM37
     C                   EXSR      PCD37
      *
     C     KEYMS2        READE     EPRI96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:11                                       QTY11 /
      *////////////////////////////////////////////////////////////
     C     QTY11         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     11            ZGN1
     C     KEYMS1        SETLL     EQTY96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPC0
     C                   Z-ADD     QREP1         ZREPC1
     C                   EXSR      RNG11
      *
     C     KEYMS1        READE     EQTY96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:16                                       QTY16 /
      *////////////////////////////////////////////////////////////
     C     QTY16         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     16            ZGN1
     C     KEYMS1        SETLL     EQTY96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     EQTY96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS1        READE     EQTY96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:21                                       QTY21 /
      *////////////////////////////////////////////////////////////
     C     QTY21         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     21            ZGN2
     C     KEYMS2        SETLL     EQTY96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPD0
     C                   Z-ADD     QREP1         ZREPD1
     C                   Z-ADD     QREP2         ZREPD2
     C                   EXSR      RNG21
      *
     C     KEYMS2        READE     EQTY96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:33                                       QTY33 /
      *////////////////////////////////////////////////////////////
     C     QTY33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     EQTY96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     EQTY96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      QTY
      *
     C     KEYMS2        READE     EQTY96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  QTY GROUP:39                                       QTY39 /
      *////////////////////////////////////////////////////////////
     C     QTY39         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     39            ZGN3
     C     KEYMS3        SETLL     EQTY96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     EQTY96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      QTY
     C                   Z-ADD     QREP0         ZREPE0
     C                   Z-ADD     QREP1         ZREPE1
     C                   Z-ADD     QREP2         ZREPE2
     C                   Z-ADD     QREP3         ZREPE3
     C                   EXSR      RNG39
      *
     C     KEYMS3        READE     EQTY96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:01                                       RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     1             ZGN0
     C     KEYMS0        SETLL     ERFF96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ERFF96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPB0
     C                   EXSR      DTM01
      *
     C     KEYMS0        READE     ERFF96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:03                                       RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     3             ZGN1
     C     KEYMS1        SETLL     ERFF96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERFF96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      DTM03
      *
     C     KEYMS1        READE     ERFF96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:27                                       RFF27 /
      *////////////////////////////////////////////////////////////
     C     RFF27         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     27            ZGN2
     C     KEYMS2        SETLL     ERFF96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      DTM27
      *
     C     KEYMS2        READE     ERFF96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RFF GROUP:33                                       RFF33 /
      *////////////////////////////////////////////////////////////
     C     RFF33         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     33            ZGN2
     C     KEYMS2        SETLL     ERFF96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERFF96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RFF
      *
     C     KEYMS2        READE     ERFF96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:11                                       RNG11 /
      *////////////////////////////////////////////////////////////
     C     RNG11         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     11            ZGN2
     C     KEYMS2        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:12                                       RNG12 /
      *////////////////////////////////////////////////////////////
     C     RNG12         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     12            ZGN2
     C     KEYMS2        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:13                                       RNG13 /
      *////////////////////////////////////////////////////////////
     C     RNG13         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     13            ZGN2
     C     KEYMS2        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:14                                       RNG14 /
      *////////////////////////////////////////////////////////////
     C     RNG14         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     14            ZGN2
     C     KEYMS2        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:18                                       RNG18 /
      *////////////////////////////////////////////////////////////
     C     RNG18         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     18            ZGN2
     C     KEYMS2        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERNG96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS2        READE     ERNG96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:21                                       RNG21 /
      *////////////////////////////////////////////////////////////
     C     RNG21         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     21            ZGN3
     C     KEYMS3        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:22                                       RNG22 /
      *////////////////////////////////////////////////////////////
     C     RNG22         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     22            ZGN3
     C     KEYMS3        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:23                                       RNG23 /
      *////////////////////////////////////////////////////////////
     C     RNG23         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     23            ZGN3
     C     KEYMS3        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:24                                       RNG24 /
      *////////////////////////////////////////////////////////////
     C     RNG24         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     24            ZGN3
     C     KEYMS3        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:37                                       RNG37 /
      *////////////////////////////////////////////////////////////
     C     RNG37         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     37            ZGN3
     C     KEYMS3        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERNG96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS3        READE     ERNG96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:39                                       RNG39 /
      *////////////////////////////////////////////////////////////
     C     RNG39         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     39            ZGN4
     C     KEYMS4        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG96A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG96A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:40                                       RNG40 /
      *////////////////////////////////////////////////////////////
     C     RNG40         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     40            ZGN4
     C     KEYMS4        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG96A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG96A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:41                                       RNG41 /
      *////////////////////////////////////////////////////////////
     C     RNG41         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     41            ZGN4
     C     KEYMS4        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG96A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG96A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RNG GROUP:42                                       RNG42 /
      *////////////////////////////////////////////////////////////
     C     RNG42         BEGSR
     C                   MOVE      '0'           *IN55
     C                   Z-ADD     42            ZGN4
     C     KEYMS4        SETLL     ERNG96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS4        READE     ERNG96A                                55
     C     *IN55         DOWEQ     '0'
      *
     C                   EXSR      RNG
      *
     C     KEYMS4        READE     ERNG96A                                55
     C  N55              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:14                                       RTE14 /
      *////////////////////////////////////////////////////////////
     C     RTE14         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     14            ZGN1
     C     KEYMS1        SETLL     ERTE96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ERTE96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPC0
     C                   Z-ADD     RREP1         ZREPC1
     C                   EXSR      RNG14
      *
     C     KEYMS1        READE     ERTE96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:24                                       RTE24 /
      *////////////////////////////////////////////////////////////
     C     RTE24         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     24            ZGN2
     C     KEYMS2        SETLL     ERTE96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ERTE96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPD0
     C                   Z-ADD     RREP1         ZREPD1
     C                   Z-ADD     RREP2         ZREPD2
     C                   EXSR      RNG24
      *
     C     KEYMS2        READE     ERTE96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  RTE GROUP:42                                       RTE42 /
      *////////////////////////////////////////////////////////////
     C     RTE42         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     42            ZGN3
     C     KEYMS3        SETLL     ERTE96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ERTE96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      RTE
     C                   Z-ADD     RREP0         ZREPE0
     C                   Z-ADD     RREP1         ZREPE1
     C                   Z-ADD     RREP2         ZREPE2
     C                   Z-ADD     RREP3         ZREPE3
     C                   EXSR      RNG42
      *
     C     KEYMS3        READE     ERTE96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Define workfields
      *""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C                   MOVE      *BLANKS       WCLFE
     C     *LIKE         DEFINE    MST           WST
     C                   MOVE      '+'           WST
     C     *LIKE         DEFINE    MVEN          WVEN
     C                   MOVE      *BLANKS       WVEN
     C     *LIKE         DEFINE    UIN           WUIN
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SSR           WSR
     C                   MOVE      'S'           WSR
     C                   MOVE      '0'           ECFLAG            1
     C                   MOVE      *BLANKS       W0004            35
     C                   MOVE      *BLANKS       W0010            35
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     0             W0074             6 0
     C                   Z-ADD     0             AX                2 0
     C                   Z-ADD     1             BX                2 0
     C                   Z-ADD     0             AXV               2 0
     C                   Z-ADD     0             AXH               2 0
     C                   MOVE      'R'           WDIR              1
     C                   MOVE      *BLANKS       WCHAR             1
     C                   MOVE      'Y'           WCHART            1
     C                   MOVE      *BLANKS       WCONT             5
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
     C                   MOVE      '0'           *IN39
     C                   MOVE      '1'           *IN32
     C     *LIKE         DEFINE    UMN           ZMN
      *____________
      * Define keys
      *""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYUNB        KLIST
     C                   KFLD                    WUIN
     C     KEYUNH        KLIST
     C                   KFLD                    WUMN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYMS0        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN0
     C     KEYMS1        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN1
     C                   KFLD                    ZREPB0
     C     KEYMS2        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN2
     C                   KFLD                    ZREPC0
     C                   KFLD                    ZREPC1
     C     KEYMS3        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN3
     C                   KFLD                    ZREPD0
     C                   KFLD                    ZREPD1
     C                   KFLD                    ZREPD2
     C     KEYMS4        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN4
     C                   KFLD                    ZREPE0
     C                   KFLD                    ZREPE1
     C                   KFLD                    ZREPE2
     C                   KFLD                    ZREPE3
     C     KEYMS5        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN5
     C                   KFLD                    ZREPF0
     C                   KFLD                    ZREPF1
     C                   KFLD                    ZREPF2
     C                   KFLD                    ZREPF3
     C                   KFLD                    ZREPF4
     C     KEYMS6        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN6
     C                   KFLD                    ZREPG0
     C                   KFLD                    ZREPG1
     C                   KFLD                    ZREPG2
     C                   KFLD                    ZREPG3
     C                   KFLD                    ZREPG4
     C                   KFLD                    ZREPG5
     C     KEYMS7        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN7
     C                   KFLD                    ZREPH0
     C                   KFLD                    ZREPH1
     C                   KFLD                    ZREPH2
     C                   KFLD                    ZREPH3
     C                   KFLD                    ZREPH4
     C                   KFLD                    ZREPH5
     C                   KFLD                    ZREPH6
     C     KEYMS8        KLIST
     C                   KFLD                    WUMN
     C                   KFLD                    ZGN8
     C                   KFLD                    ZREPI0
     C                   KFLD                    ZREPI1
     C                   KFLD                    ZREPI2
     C                   KFLD                    ZREPI3
     C                   KFLD                    ZREPI4
     C                   KFLD                    ZREPI5
     C                   KFLD                    ZREPI6
     C                   KFLD                    ZREPI7
     C     KEYMSG        KLIST
     C                   KFLD                    WSR
     C                   KFLD                    U0065
     C                   KFLD                    U0054
     C                   KFLD                    M0010
     C                   KFLD                    M0004
      *__________________________
      * Retreive System Date/Time
      *""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *_________________
      * Input parameters
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   Z-ADD     WSN           WUIN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start of file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *___________________________________
      * Get data from interchange log file
      *"""""""""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C     KEYUNB        CHAIN     EUNB                               81
     C                   Z-ADD     0             W0036
     C                   MOVEL     U0004         W0004
     C                   MOVEL     U0010         W0010
     C     W0010         CHAIN     EDII                               20
     C                   MOVEL     INNETW        WNNETW
      *_________________
      * Move member name
      *"""""""""""""""""
     C                   EVAL      SEMBR=SMBR
     C                   SELECT
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
      *________________
      * Add UNB-segment
      *""""""""""""""""
     C                   EXSR      UNB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Read message log                                     SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
     C     KEYB          CHAIN     EDIMC                              8182
     C                   Z-ADD     TVIMMN        WUMN
     C     *IN81         DOWEQ     '0'
     C  N81
     CANN82KEYUNH        CHAIN     EUNH                               8384
     C     *IN83         IFEQ      '0'
     C     M0065         ANDEQ     'PRICAT'
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   MOVEL     WDT           MDT
     C                   MOVEL     WTM           MTM
     C                   ADD       1             W0036
     C                   EXSR      SRCA
     C                   Z-ADD     WUIN          UIN
     C                   UPDATE    EDIMR
     C                   UPDATE    UNHR
      * Oppslag i ECMSG for å se om det skal sendes en og en melding
      * eller akumuleres opp på vanlig måte.
     C     ECFLAG        IFEQ      '0'
     C     KEYMSG        CHAIN     ECMSG1                             90
     C     *IN90         IFEQ      *ON
     C                   MOVE      *BLANK        ECSEND
     C                   ENDIF
     C                   MOVE      '1'           ECFLAG
      * Forlater løkken hvis det skal sendes en og en melding.
     C     ECSEND        IFNE      *BLANKS
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDIF
     C     KEYB          READE     EDIMC                                8281
     C                   Z-ADD     TVIMMN        WUMN
     C  N81              END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Add segments                                           SRCA
      */////////////////////////////////////////////////////////////
     C     SRCA          BEGSR
     C                   EXSR      UNH
     C                   EXSR      BGM
      *
     C                   EXSR      DTM00
     C                   EXSR      ALI00
     C                   EXSR      FTX00
     C                   EXSR      RFF01
     C                   EXSR      NAD02
     C                   EXSR      TAX05
     C                   EXSR      CUX06
     C                   EXSR      PAT07
     C                   EXSR      TDT08
     C                   EXSR      TOD09
     C                   EXSR      ALC10
     C                   EXSR      PGI16
      *
     C                   EXSR      UNT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  End of interchange                                   SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
     C                   Z-ADD     W0036         S0036
     C                   MOVE      W0036         U0036
      *____________________
      * Interchange trailer
      *""""""""""""""""""""
     C                   EXSR      UNZ
      *____________________________
      * Update interchange log file
      *""""""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   UPDATE    EDISR
     C                   UPDATE    UNBR
      *___________________
      * Create JCL for NIT
      *"""""""""""""""""""
     C     WNNETW        IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'
     C     AXV           DO        AXH           AXV
     C     A(AXV)        COMP      '0'                                  8383
     C   83              END
      * Find last non-blank position                                     I
     C                   ELSE
      *                                                                  I
     C     SRÅ01         TAG
      *                                                                  I
     C     AXH           IFGT      AXV
     C     A(AXH)        IFEQ      *BLANKS
     C                   SUB       1             AXH
     C                   GOTO      SRÅ01
     C                   END
     C                   END
     C                   END
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'
     C     WDIR          IFEQ      'R'
     C     WCHAR         IFEQ      ';'
     C                   MOVE      ':'           WCHAR
     C                   ENDIF
     C     WCHAR         COMP      WAPSTR                                 83
     C  N83WCHAR         COMP      '+'                                    83
     C  N83WCHAR         COMP      ':'                                    83
     C  N83WCHAR         COMP      '?'                                    83
     C   83              EXSR      SRÅA
     C                   END
     C                   END
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *                                                                  I
     C                   END
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80
     C                   MOVEA     B             SDATA
     C                   WRITE     EDISER
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       B
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:05                                       TAX05 /
      *////////////////////////////////////////////////////////////
     C     TAX05         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     5             ZGN0
     C     KEYMS0        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETAX96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      MOA05
      *
     C     KEYMS0        READE     ETAX96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:15                                       TAX15 /
      *////////////////////////////////////////////////////////////
     C     TAX15         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     15            ZGN1
     C     KEYMS1        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA15
      *
     C     KEYMS1        READE     ETAX96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:19                                       TAX19 /
      *////////////////////////////////////////////////////////////
     C     TAX19         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     19            ZGN1
     C     KEYMS1        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETAX96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      MOA19
      *
     C     KEYMS1        READE     ETAX96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:25                                       TAX25 /
      *////////////////////////////////////////////////////////////
     C     TAX25         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     25            ZGN2
     C     KEYMS2        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA25
      *
     C     KEYMS2        READE     ETAX96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:35                                       TAX35 /
      *////////////////////////////////////////////////////////////
     C     TAX35         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     35            ZGN2
     C     KEYMS2        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETAX96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      MOA35
      *
     C     KEYMS2        READE     ETAX96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TAX GROUP:43                                       TAX43 /
      *////////////////////////////////////////////////////////////
     C     TAX43         BEGSR
     C                   MOVE      '0'           *IN54
     C                   Z-ADD     43            ZGN3
     C     KEYMS3        SETLL     ETAX96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS3        READE     ETAX96A                                54
     C     *IN54         DOWEQ     '0'
      *
     C                   EXSR      TAX
     C                   Z-ADD     TREP0         ZREPE0
     C                   Z-ADD     TREP1         ZREPE1
     C                   Z-ADD     TREP2         ZREPE2
     C                   Z-ADD     TREP3         ZREPE3
     C                   EXSR      MOA43
      *
     C     KEYMS3        READE     ETAX96A                                54
     C  N54              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:08                                       TDT08 /
      *////////////////////////////////////////////////////////////
     C     TDT08         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     8             ZGN0
     C     KEYMS0        SETLL     ETDT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETDT96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC08
      *
     C     KEYMS0        READE     ETDT96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:30                                       TDT30 /
      *////////////////////////////////////////////////////////////
     C     TDT30         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     30            ZGN1
     C     KEYMS1        SETLL     ETDT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETDT96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC30
      *
     C     KEYMS1        READE     ETDT96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TDT GROUP:46                                       TDT46 /
      *////////////////////////////////////////////////////////////
     C     TDT46         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     46            ZGN2
     C     KEYMS2        SETLL     ETDT96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETDT96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TDT
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      LOC46
      *
     C     KEYMS2        READE     ETDT96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:09                                       TOD09 /
      *////////////////////////////////////////////////////////////
     C     TOD09         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     9             ZGN0
     C     KEYMS0        SETLL     ETOD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     ETOD96A                                51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPB0
     C                   EXSR      LOC09
      *
     C     KEYMS0        READE     ETOD96A                                51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:31                                       TOD31 /
      *////////////////////////////////////////////////////////////
     C     TOD31         BEGSR
     C                   MOVE      '0'           *IN52
     C                   Z-ADD     31            ZGN1
     C     KEYMS1        SETLL     ETOD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS1        READE     ETOD96A                                52
     C     *IN52         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPC0
     C                   Z-ADD     TREP1         ZREPC1
     C                   EXSR      LOC31
      *
     C     KEYMS1        READE     ETOD96A                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TOD GROUP:47                                       TOD47 /
      *////////////////////////////////////////////////////////////
     C     TOD47         BEGSR
     C                   MOVE      '0'           *IN53
     C                   Z-ADD     47            ZGN2
     C     KEYMS2        SETLL     ETOD96A                                20
     C     *IN20         IFEQ      '1'
     C     KEYMS2        READE     ETOD96A                                53
     C     *IN53         DOWEQ     '0'
      *
     C                   EXSR      TOD
     C                   Z-ADD     TREP0         ZREPD0
     C                   Z-ADD     TREP1         ZREPD1
     C                   Z-ADD     TREP2         ZREPD2
     C                   EXSR      LOC47
      *
     C     KEYMS2        READE     ETOD96A                                53
     C  N53              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  UNS GROUP:00. FORTLØPENDE NUMMERERING              UNS00 /
      *////////////////////////////////////////////////////////////
     C     UNS00         BEGSR
     C                   MOVE      '0'           *IN51
     C                   Z-ADD     50            ZGN0
     C     KEYMS0        SETLL     EUNS                                   20
     C     *IN20         IFEQ      '1'
     C     KEYMS0        READE     EUNS                                   51
     C     *IN51         DOWEQ     '0'
      *
     C                   EXSR      UNS
      *
     C     KEYMS0        READE     EUNS                                   51
     C  N51              ENDDO
     C                   ENDIF
     C                   ENDSR
      /COPY QEDSRC,ALC_O_96A
      /COPY QEDSRC,ALI_O_96A
      /COPY QEDSRC,APR_O_96A
      /COPY QEDSRC,BGM_O
      /COPY QEDSRC,CAV_O_96A
      /COPY QEDSRC,CCI_O_96A
      /COPY QEDSRC,COM_O_96A
      /COPY QEDSRC,CTA_O_96A
      /COPY QEDSRC,CUX_O_96A
      /COPY QEDSRC,DOC_O_96A
      /COPY QEDSRC,DTM_O_96A
      /COPY QEDSRC,FTX_O_96A
      /COPY QEDSRC,HAN_O_96A
      /COPY QEDSRC,IMD_O_96A
      /COPY QEDSRC,LIN_O_96A
      /COPY QEDSRC,LOC_O_96A
      /COPY QEDSRC,MEA_O_96A
      /COPY QEDSRC,MOA_O_96A
      /COPY QEDSRC,NAD_O_96A
      /COPY QEDSRC,PAC_O_96A
      /COPY QEDSRC,PAT_O_96A
      /COPY QEDSRC,PCD_O_96A
      /COPY QEDSRC,PGI_O_96A
      /COPY QEDSRC,PIA_O_96A
      /COPY QEDSRC,PRI_O_96A
      /COPY QEDSRC,QTY_O_96A
      /COPY QEDSRC,RFF_O_96A
      /COPY QEDSRC,RNG_O_96A
      /COPY QEDSRC,RTE_O_96A
      /COPY QEDSRC,TAX_O_96A
      /COPY QEDSRC,TDT_O_96A
      /COPY QEDSRC,TOD_O_96A
      /COPY QEDSRC,UNB_O
      /COPY QEDSRC,UNH_O
      /COPY QEDSRC,UNS_O
      /COPY QEDSRC,UNT_O
      /COPY QEDSRC,UNZ_O
