     FTURER     IF   E           K DISK
     FHEAD11    IF   E           K DISK
     FFREETXT   IF   E           K DISK
     FFIRM      IF   E             DISK
     FCUNDL01   IF   E           K DISK
     FKODTA     IF   E           K DISK
     FSTED2     IF   E           K DISK
     FKODTLB    IF   E           K DISK
     FECNI911   O  A E             DISK
     FECNT911   O  A E             DISK
     FEDTM911   O  A E             DISK
     FEFTX911   O  A E             DISK
     FEGDS911   O  A E             DISK
     FEGID911   O  A E             DISK
     FELOC911   O  A E             DISK
     FENAD911   O  A E             DISK
     FEMEA911   O  A E             DISK
     FEMOA911   O  A E             DISK
     FEPCI911   O  A E             DISK
     FERFF911   O  A E             DISK
     FETDT911   O  A E             DISK
     FETOD911   O  A E             DISK
      *___________________________
      * Arrays for string handling
      *"""""""""""""""""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTID                   1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDATO                  1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  W1004                  1     12
     D  WUAVD                  1      4  0
     D  WUPRO                  5     12  0
     D  WUKNA                 13     20  0
     D  WUMN                  21     29  0
     D                 DS
     D  W1004B                 1     11
     D  HEAVD                  1      4  0
     D  HEOPD                  5     11  0
     D                 DS
     D  WKUNDN                 1      8  0
     D                 DS
     D  WADR                   1     30
     D  W3251                  1      5
     D  W3164A                 6     10
     D  W3164B                11     30
     D  W3164                  6     30
     D                 DS
     D  W7064                  1      3
     D  W4440                  5     25
     D  HEVS1                  1     25
      *____________________________________
      * DS for leftjustify numericel fields
      *""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN153                  1     15  3
     D  ØA153H                 1     12
     D  ØA153X                 5     12
     D  ØA153D                13     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)                              Num edit
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRA                                          CONSIGNMENT
     C     WANTO         CASGT     0             SRB                            TRIP
     C                   END
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    WAVD              4
     C                   PARM                    WPRO              8
     C                   PARM                    WKNA              8
     C                   PARM                    WMN               9
     C                   PARM                    WANTO
     C                   PARM                    WBRUDD            1
     C                   MOVE      WAVD          WUAVD
     C                   MOVE      WPRO          WUPRO
     C                   MOVE      WKNA          WUKNA
     C                   MOVE      WMN           WUMN
     C                   Z-ADD     0             WANTO
      * HENTE DAGENS DATO OG TID
     C                   TIME                    WTIME
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   Z-ADD     WMM           WM
      * INIT AV ARBEIDSFELT
     C     *LIKE         DEFINE    CREP0         WREP0
     C     *LIKE         DEFINE    CREP1         WREP1
     C     *LIKE         DEFINE    CREP2         WREP2
     C     *LIKE         DEFINE    CREP3         WREP3
     C     *LIKE         DEFINE    CREP4         WREP4
     C     *LIKE         DEFINE    CREP5         WREP5
     C     *LIKE         DEFINE    CREP6         WREP6
     C     *LIKE         DEFINE    CREP7         WREP7
     C     *LIKE         DEFINE    CREP8         WREP8
     C     *LIKE         DEFINE    KLBUNI        WLBUNI
     C     *LIKE         DEFINE    KOAUNI        WOAUNI
     C                   MOVE      'LB'          WLBUNI
     C                   MOVE      'A'           WOAUNI
     C                   Z-ADD     0             ØX                2 0                      --I
     C                   MOVE      *BLANKS       ØAN              12            Num alpha
     C                   Z-ADD     1             WEPOS1            4 0
     C                   READ      FIRM                                   51
      * DEF AV KEYS
     C     TURKEY        KLIST
     C                   KFLD                    WUAVD
     C                   KFLD                    WUPRO
     C     KUNKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WKUNDN
     C     KODKEY        KLIST
     C                   KFLD                    WOAUNI
     C                   KFLD                    WUAVD
     C     KLBKEY        KLIST
     C                   KFLD                    WLBUNI
     C                   KFLD                    HEFR
     C     FREKEY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR CONSIGNEMENT INFORMATION                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C     WUPRO         SETLL     HEAD11                                 20
     C     *IN20         IFEQ      '1'
     C     WUPRO         READE     HEAD11                                 51
     C     *IN51         DOWEQ     '0'
     C     HEST          IFNE      'S'
     C     WBRUDD        IFEQ      'J'
     C     HEKNA         ANDNE     WUKNA
     C                   GOTO      SRA1
     C                   ENDIF
      *
     C                   ADD       1             WANTO             5 0
     C                   ADD       HENT          WENT              9 0
     C                   ADD       HEVKT         WEVKT            11 0
     C                   ADD       HELM          WELM              7 2
     C                   ADD       HEM3          WEM3             11 3
      *
     C                   Z-ADD     WANTO         WREP0
     C                   EXSR      CNI15
      *
     C                   ENDIF
     C     SRA1          TAG
     C     WUPRO         READE     HEAD11                                 51
     C  N51              ENDDO
     C                   ENDIF
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR TRIP ONFORMATION                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   EXSR      CNT00
     C                   EXSR      RFF01
     C                   EXSR      TDT05
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  CNI15 /
      *////////////////////////////////////////////////////////////
     C     CNI15         BEGSR
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   CNIR
      *_______________
      * Other segments
      *"""""""""""""""
     C                   EXSR      MOA15
     C                   EXSR      FTX15
     C                   EXSR      LOC16
     C                   EXSR      TOD17
     C                   EXSR      NAD25
     C                   EXSR      GID31
      *______
      * CNI15
      *""""""
      * 1490 Consolidation item number
     C                   Z-ADD     WANTO         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C1490
      * 1004 Document/message number
     C                   MOVEL     W1004B        C1004
      * 1312 CNI load seq no
     C                   MOVEL     HEPOS1        C1312
      * Write record
     C                   Z-ADD     WUMN          CMN
     C                   Z-ADD     15            CGN
     C                   Z-ADD     WREP0         CREP0
     C                   WRITE     CNIR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   Z-ADD     0             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
      *____
      * Key
      *""""
      *__________________________
      * Total number of shipments
      *""""""""""""""""""""""""""
     C                   CLEAR                   CNTR
     C                   Z-ADD     WUMN          CMN
     C                   Z-ADD     0             CGN
     C                   ADD       1             WREP0
     C                   Z-ADD     WREP0         CREP0
     C                   MOVE      '10 '         C6069
     C                   Z-ADD     WANTO         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C6066
     C                   WRITE     CNTR
      *_________________________
      * Total number of packages
      *"""""""""""""""""""""""""
     C                   CLEAR                   CNTR
     C                   Z-ADD     WUMN          CMN
     C                   Z-ADD     0             CGN
     C                   ADD       1             WREP0
     C                   Z-ADD     WREP0         CREP0
     C                   MOVE      '11 '         C6069
     C                   Z-ADD     WENT          ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C6066
     C                   WRITE     CNTR
      *___________________
      * Total gross weight
      *"""""""""""""""""""
     C                   CLEAR                   CNTR
     C                   Z-ADD     WUMN          CMN
     C                   Z-ADD     0             CGN
     C     WEVKT         IFGT      0
     C                   ADD       1             WREP0
     C                   Z-ADD     WREP0         CREP0
     C                   MOVE      '7  '         C6069
     C                   Z-ADD     WEVKT         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C6066
     C                   WRITE     CNTR
     C                   ENDIF
      *____________
      * Total cubic
      *""""""""""""
     C                   CLEAR                   CNTR
     C                   Z-ADD     WUMN          CMN
     C                   Z-ADD     0             CGN
     C     WEM3          IFGT      0
     C                   ADD       1             WREP0
     C                   Z-ADD     WREP0         CREP0
     C                   MOVE      '15 '         C6069
     C                   Z-ADD     WEM3          ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C6066
     C                   WRITE     CNTR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   DTMR
     C                   Z-ADD     WUMN          DMN
     C                   Z-ADD     1             DGN
     C                   Z-ADD     WREP0         DREP0
      *___________
      * Issue date
      *"""""""""""
     C                   MOVEL     '182'         D2005
     C                   MOVEL     WDATO         D2380
     C                   MOVEL     '101'         D2379
     C                   Z-ADD     WREP1         DREP1
     C                   WRITE     DTMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  DTM05 /
      *////////////////////////////////////////////////////////////
     C     DTM05         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   DTMR
     C                   Z-ADD     WUMN          DMN
     C                   Z-ADD     5             DGN
     C                   Z-ADD     WREP0         DREP0
      *_______________
      * Departure date
      *"""""""""""""""
     C     TUDT          IFGT      0
     C                   MOVEL     '136'         D2005
     C                   MOVE      TUDT          XNR06             6 0
     C                   MOVEL     XNR06         D2380
     C                   MOVEL     '101'         D2379
     C                   Z-ADD     WREP1         DREP1
     C                   WRITE     DTMR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  FTX15 /
      *////////////////////////////////////////////////////////////
     C     FTX15         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
      *_________________
      * Special Handling
      *"""""""""""""""""
     C     FREKEY        SETLL     FREETXT                                20
     C     *IN20         IFEQ      '1'
     C     FREKEY        READE     FREETXT                                52
     C     *IN52         DOWEQ     '0'
      *
     C     FRTKOD        IFNE      'K'
     C                   CLEAR                   FTXR
     C                   MOVEL     'SPH'         F4451
     C                   MOVEL     FRTTXT        F4440A
     C                   Z-ADD     WUMN          FMN
     C                   Z-ADD     15            FGN
     C                   Z-ADD     WREP0         FREP0
     C                   Z-ADD     WREP1         FREP1
     C                   WRITE     FTXR
     C                   ENDIF
      *
     C     FREKEY        READE     FREETXT                                52
     C  N52              ENDDO
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  FTX33 /
      *////////////////////////////////////////////////////////////
     C     FTX33         BEGSR
     C                   Z-ADD     1             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   FTXR
     C                   Z-ADD     WUMN          FMN
     C                   Z-ADD     33            FGN
     C                   Z-ADD     WREP0         FREP0
     C                   Z-ADD     WREP1         FREP1
     C                   Z-ADD     WREP2         FREP2
      *_________________
      * Special Handling
      *"""""""""""""""""
     C                   MOVEL     'AAA'         F4451
     C                   MOVEL     W4440         F4440A
     C                   Z-ADD     WREP3         FREP3
     C                   WRITE     FTXR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  GDS33 /
      *////////////////////////////////////////////////////////////
     C     GDS33         BEGSR
     C                   Z-ADD     1             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   GDSR
     C                   Z-ADD     WUMN          GMN
     C                   Z-ADD     33            GGN
     C                   Z-ADD     WREP0         GREP0
     C                   Z-ADD     WREP1         GREP1
      *_________
      * Freetext
      *"""""""""
     C                   EXSR      FTX33
      *____________
      * Item number
      *""""""""""""
     C                   MOVEL     'ZZ4'         G1131A
     C                   Z-ADD     WREP2         GREP2
     C                   WRITE     GDSR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  GID31 /
      *////////////////////////////////////////////////////////////
     C     GID31         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
      *_______________
      * Other segments
      *"""""""""""""""
     C                   EXSR      GDS33
     C                   EXSR      MEA34
     C                   EXSR      PCI37
      *___________________
      * Goods item details
      *"""""""""""""""""""
     C                   CLEAR                   GIDR
     C                   MOVEL     '1'           G1496                          goods item no
     C                   Z-ADD     HENT          ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           G7224A
     C                   MOVEL     W7064         G7064A                         type of pack
     C                   Z-ADD     WUMN          GMN
     C                   Z-ADD     31            GGN
     C                   Z-ADD     WREP0         GREP0
     C                   Z-ADD     WREP1         GREP1
     C                   WRITE     GIDR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  LOC05 /
      *////////////////////////////////////////////////////////////
     C     LOC05         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
      *___________________
      * Place of departure
      *"""""""""""""""""""
     C                   CLEAR                   LOCR
     C                   Z-ADD     WUMN          LMN
     C                   Z-ADD     5             LGN
     C                   Z-ADD     WREP0         LREP0
     C                   Z-ADD     WREP1         LREP1
     C                   MOVEL     '5  '         L3227
     C                   MOVEL     TUSDF         L3224
     C                   WRITE     LOCR
      *_____________________
      * Place of destination
      *"""""""""""""""""""""
     C                   CLEAR                   LOCR
     C                   Z-ADD     WUMN          LMN
     C                   Z-ADD     5             LGN
     C                   Z-ADD     WREP0         LREP0
     C                   ADD       1             WREP1
     C                   Z-ADD     WREP1         LREP1
     C                   MOVEL     '8  '         L3227
     C                   MOVEL     TUSDT         L3224
     C                   WRITE     LOCR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  LOC16 /
      *////////////////////////////////////////////////////////////
     C     LOC16         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   LOCR
      *______________
      * Oter segments
      *""""""""""""""
      *_________________
      * Place of loading
      *"""""""""""""""""
     C                   MOVEL     '9  '         L3227
     C     HESDFF        IFEQ      *BLANKS
     C                   MOVEL     HESDF         L3225
     C     HESDF         CHAIN     STED2                              20
     C                   ELSE
     C                   MOVEL     HESDFF        L3225
     C     HESDFF        CHAIN     STED2                              20
     C                   ENDIF
     C                   MOVEL     'ZZ1'         L1131A
     C                   MOVEL     ST2NVN        L3224
     C                   Z-ADD     WUMN          LMN
     C                   Z-ADD     16            LGN
     C                   Z-ADD     WREP0         LREP0
     C                   Z-ADD     WREP1         LREP1
     C                   WRITE     LOCR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MEA06 /
      *////////////////////////////////////////////////////////////
     C     MEA06         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   MEAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     6             MGN
     C                   Z-ADD     WREP0         MREP0
      *___________________
      * Total gross weight
      *"""""""""""""""""""
     C     WEVKT         IFGT      0
     C                   MOVEL     'WT '         M6311
     C                   MOVEL     'AAD'         M6313
     C                   MOVEL     'KGM'         M6411
     C                   Z-ADD     WEVKT         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M6314
     C                   Z-ADD     WREP1         MREP1
     C                   WRITE     MEAR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MEA34 /
      *////////////////////////////////////////////////////////////
     C     MEA34         BEGSR
     C                   Z-ADD     1             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
      *____________________
      * Fraktberegningsvekt
      *""""""""""""""""""""
     C     HEFBV         IFGT      0
     C                   CLEAR                   MEAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     34            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   Z-ADD     WREP2         MREP2
     C                   MOVEL     'PAL'         M6311
     C                   MOVEL     'WT '         M6313
     C                   MOVEL     'KGM'         M6411
     C                   Z-ADD     HEFBV         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M6314
     C                   WRITE     MEAR
     C                   ENDIF
      *_____________
      * Gross weight
      *"""""""""""""
     C     HEVKT         IFGT      0
     C                   CLEAR                   MEAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     34            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   ADD       1             WREP2
     C                   Z-ADD     WREP2         MREP2
     C                   MOVEL     'WT '         M6311
     C                   MOVEL     'AAG'         M6313
     C                   MOVEL     'KGM'         M6411
     C                   Z-ADD     HEVKT         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M6314
     C                   WRITE     MEAR
     C                   ENDIF
      *_______
      * Volume
      *"""""""
     C     HEM3          IFGT      0
     C                   CLEAR                   MEAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     34            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   ADD       1             WREP2
     C                   Z-ADD     WREP2         MREP2
     C                   MOVEL     'VOL'         M6311
     C                   MOVEL     'Z02'         M6313
     C                   MOVEL     'MTQ'         M6411
     C                   Z-ADD     HEM3          ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M6314
     C                   WRITE     MEAR
     C                   ENDIF
      *_______________
      * Loading meters
      *"""""""""""""""
     C     HELM          IFGT      0
     C                   CLEAR                   MEAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     34            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   ADD       1             WREP2
     C                   Z-ADD     WREP2         MREP2
     C                   MOVEL     'LMT'         M6311
     C                   MOVEL     'Z03'         M6313
     C                   MOVEL     'MTR'         M6411
     C                   Z-ADD     HELM          ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M6314
     C                   ADD       1             WREP2
     C                   WRITE     MEAR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MOA15 /
      *////////////////////////////////////////////////////////////
     C     MOA15         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   MOAR
     C                   Z-ADD     WUMN          MMN
     C                   Z-ADD     15            MGN
     C                   Z-ADD     WREP0         MREP0
      *___________________
      * Total gross VALUE
      *"""""""""""""""""""
     C     HEBELT        IFGT      0
     C                   MOVEL     '43 '         M5025
     C                   MOVEL     'AAD'         M5004
     C                   Z-ADD     HEBELT        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   MOVEL     FICURR        M6345
     C                   Z-ADD     WREP1         MREP1
     C                   WRITE     MOAR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  NAD06 /
      *////////////////////////////////////////////////////////////
     C     NAD09         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   NADR
     C                   Z-ADD     WUMN          NMN
     C                   Z-ADD     9             NGN
     C                   Z-ADD     WREP0         NREP0
      *__________________
      * Message recipient
      *""""""""""""""""""
     C                   MOVEL     'MR '         N3035
     C                   Z-ADD     WUKNA         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   MOVEL     'ZZZ'         N1131
     C                   MOVEL     '91 '         N3055
     C                   Z-ADD     WUKNA         WKUNDN
     C     KUNKEY        CHAIN     CUNDL01                            20
     C     *IN20         IFEQ      '0'
     C                   MOVEL     KNAVN         N3036A                         party
     C                   MOVEL     ADR1          N3042A                         street
     C     ADR2          IFNE      *BLANKS
     C                   MOVEL     ADR2          N3042B                         street
     C                   ENDIF
     C                   MOVEL     ADR3          N3164                          city
     C                   MOVEL     POSTNR        N3251                          postnr
     C                   MOVEL     SYLAND        N3207                          land
     C                   ENDIF
      *
     C                   Z-ADD     WREP1         NREP1
     C                   WRITE     NADR
      *_______________
      * Message sender
      *"""""""""""""""
     C                   CLEAR                   NADR
     C                   Z-ADD     WUMN          NMN
     C                   Z-ADD     9             NGN
     C                   Z-ADD     WREP0         NREP0
     C                   MOVEL     'MS '         N3035
     C     KODKEY        CHAIN     KODTA                              20
     C                   Z-ADD     KOAKNR        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   MOVEL     'ZZZ'         N1131
     C                   MOVEL     '91 '         N3055
     C                   Z-ADD     KOAKNR        WKUNDN
     C     KUNKEY        CHAIN     CUNDL01                            20
     C     *IN20         IFEQ      '0'
     C                   MOVEL     KNAVN         N3036A                         party
     C                   MOVEL     ADR1          N3042A                         street
     C     ADR2          IFNE      *BLANKS
     C                   MOVEL     ADR2          N3042B                         street
     C                   ENDIF
     C                   MOVEL     ADR3          N3164                          city
     C                   MOVEL     POSTNR        N3251                          postnr
     C                   MOVEL     SYLAND        N3207                          land
     C                   ENDIF
      *
     C                   ADD       1             WREP1
     C                   Z-ADD     WREP1         NREP1
     C                   WRITE     NADR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  NAD25 /
      *////////////////////////////////////////////////////////////
     C     NAD25         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   NADR
      *______
      * Buyer
      *""""""
     C                   MOVEL     'BY '         N3035
     C                   Z-ADD     HEKNKF        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   MOVEL     'ZZZ'         N1131
     C                   MOVEL     '91 '         N3055
     C                   Z-ADD     HEKNKF        WKUNDN
     C     KUNKEY        CHAIN     CUNDL01                            20
     C     *IN20         IFEQ      '0'
     C                   MOVEL     KNAVN         N3036A                         party
     C                   MOVEL     ADR1          N3042A                         street
     C     ADR2          IFNE      *BLANKS
     C                   MOVEL     ADR2          N3042B                         street
     C                   ENDIF
     C                   MOVEL     ADR3          N3164                          city
     C     SYPOGE        IFNE      *BLANKS
     C                   MOVEL     SYPOGE        N3251                          postnr
     C                   ELSE
     C                   MOVEL     POSTNR        N3251                          postnr
     C                   ENDIF
     C                   MOVEL     SYLAND        N3207                          land
     C                   ENDIF
      *
     C                   Z-ADD     WUMN          NMN
     C                   Z-ADD     25            NGN
     C                   Z-ADD     WREP0         NREP0
     C                   Z-ADD     WREP1         NREP1
     C                   WRITE     NADR
      *__________
      * Consignee
      *""""""""""
     C                   CLEAR                   NADR
     C                   MOVEL     'CN '         N3035
     C                   Z-ADD     HEKNK         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   MOVEL     'ZZZ'         N1131
     C                   MOVEL     '91 '         N3055
     C                   MOVEL     HENAK         N3036A                         party
     C                   MOVEL     HEADK1        N3042A                         street
     C     HEADK2        IFNE      *BLANKS
     C                   MOVEL     HEADK2        N3042B                         street
     C                   ENDIF
     C                   MOVEL     HEADK3        WADR                           city
     C     W3164A        IFEQ      *BLANKS
     C                   MOVEL     W3164B        N3164                          city
     C                   ELSE
     C                   MOVEL     W3164         N3164                          city
     C                   ENDIF
     C                   MOVEL     W3251         N3251                          postnr
     C                   MOVEL     HELKK         N3207                          land
      *
     C                   Z-ADD     WUMN          NMN
     C                   Z-ADD     25            NGN
     C                   Z-ADD     WREP0         NREP0
     C                   ADD       1             WREP1
     C                   Z-ADD     WREP1         NREP1
     C                   WRITE     NADR
      *__________
      * Consignor
      *""""""""""
     C                   CLEAR                   NADR
     C                   MOVEL     'CZ '         N3035
     C                   Z-ADD     HEKNSF        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   MOVEL     'ZZZ'         N1131
     C                   MOVEL     '91 '         N3055
     C                   Z-ADD     HEKNSF        WKUNDN
     C     KUNKEY        CHAIN     CUNDL01                            20
     C     *IN20         IFEQ      '0'
     C                   MOVEL     KNAVN         N3036A                         party
     C                   MOVEL     ADR1          N3042A                         street
     C     ADR2          IFNE      *BLANKS
     C                   MOVEL     ADR2          N3042B                         street
     C                   ENDIF
     C                   MOVEL     ADR3          N3164                          city
     C     SYPOGE        IFNE      *BLANKS
     C                   MOVEL     SYPOGE        N3251                          postnr
     C                   ELSE
     C                   MOVEL     POSTNR        N3251                          postnr
     C                   ENDIF
     C                   MOVEL     SYLAND        N3207                          land
     C                   ENDIF
      *
     C                   Z-ADD     WUMN          NMN
     C                   Z-ADD     25            NGN
     C                   Z-ADD     WREP0         NREP0
     C                   ADD       1             WREP1
     C                   Z-ADD     WREP1         NREP1
     C                   WRITE     NADR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PCI37 /
      *////////////////////////////////////////////////////////////
     C     PCI37         BEGSR
     C                   Z-ADD     1             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   PCIR
     C                   Z-ADD     WUMN          PMN
     C                   Z-ADD     37            PGN
     C                   Z-ADD     WREP0         PREP0
     C                   Z-ADD     WREP1         PREP1
     C                   MOVEL     '24 '         P4233
     C                   MOVEL     HEGM1         P7102A
     C                   MOVEL     HEGM2         P7102B
     C                   Z-ADD     WREP2         PREP2
     C                   WRITE     PCIR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   RFFR
      *
     C                   EXSR      DTM01
      * Key
     C                   Z-ADD     WUMN          RMN
     C                   Z-ADD     1             RGN
     C                   Z-ADD     WREP0         RREP0
      * Data
     C                   MOVE      'AFB'         R1153
     C                   MOVEL     W1004         R1154
      * Write record
     C                   WRITE     RFFR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  TDT05 /
      *////////////////////////////////////////////////////////////
     C     TDT05         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   TDTR
      *_____________
      * Get tripinfo
      *"""""""""""""
     C     TURKEY        CHAIN     TURER                              51
      *_______________
      * Other segments
      *"""""""""""""""
     C                   EXSR      LOC05
     C                   EXSR      DTM05
     C                   EXSR      MEA06
     C                   EXSR      NAD09
      *______
      * TDT05
      *""""""
     C                   MOVEL     '20 '         T8051
     C                   MOVEL     '30 '         T8067
     C                   MOVEL     TULK          T8179
     C                   MOVEL     TUBILN        T8178
     C                   MOVEL     TUNAT         T3128
      *_____________
      * Write record
      *"""""""""""""
     C                   Z-ADD     WUMN          TMN
     C                   Z-ADD     5             TGN
     C                   Z-ADD     WREP0         TREP0
     C                   WRITE     TDTR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  TOD17 /
      *////////////////////////////////////////////////////////////
     C     TOD17         BEGSR
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   Z-ADD     0             WREP3
     C                   Z-ADD     0             WREP4
     C                   Z-ADD     0             WREP5
     C                   Z-ADD     0             WREP6
     C                   Z-ADD     0             WREP7
     C                   Z-ADD     0             WREP8
     C                   CLEAR                   TODR
     C                   Z-ADD     WUMN          TMN
     C                   Z-ADD     17            TGN
     C                   Z-ADD     WREP0         TREP0
      *__________________
      * Terms of delivery
      *""""""""""""""""""
     C                   MOVEL     HEFR          T4053
     C                   MOVEL     'ZZ2'         T1131
     C     KLBKEY        CHAIN     KODTLB                             20
     C     *IN20         IFEQ      '0'
     C                   MOVEL     KLBXXX        KLBHAD            1
     C     KLBHAD        IFEQ      'A'
      *
     C     HEADK3        IFNE      *BLANKS
     C                   MOVEL     HEADK3        T4052
     C                   ELSE
     C     HEADK2        IFNE      *BLANKS
     C                   MOVEL     HEADK2        T4052
     C                   ELSE
     C                   MOVEL     HEADK1        T4052
     C                   END
     C                   END
      *
     C                   ELSE
      * KLBHAD = 'M'
     C     HEADS3        IFNE      *BLANKS
     C                   MOVEL     HEADS3        T4052
     C                   ELSE
     C     HEADS2        IFNE      *BLANKS
     C                   MOVEL     HEADS2        T4052
     C                   ELSE
     C                   MOVEL     HEADS1        T4052
     C                   END
     C                   END
     C*
     C                   END
     C                   ENDIF
     C                   ADD       1             WREP1
     C                   Z-ADD     WREP1         TREP1
     C                   WRITE     TODR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify num.fields                              SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * Move correct value into alpha 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA153D        IFEQ      '000'                                        <-------------I
     C                   MOVE      ØA153H        ØA12                                         I
     C                   ELSE                                                   <-------------I
     C                   MOVEL     ØA153X        ØA12                                         I
     C                   MOVE      ',   '        ØA12                                         I
     C                   MOVE      ØA153D        ØA12                                         I
     C                   END                                                    <-------------I
      * search from left and find first sign over 0
     C     1             DO        11            ØX                             <-------------I
     C     Ø12(ØX)       IFNE      '0'                                           <-----------II
     C                   GOTO      SRNE1                                                     II
     C                   END                                                     <-----------II
     C                   END                                                    <-------------I
     C     SRNE1         TAG
      * Leftjustify to a new field
     C     ØA153D        IFNE      '000'                                        <-------------I
     C                   SUB       1             ØX                                           I
     C                   ENDIF                                                  <-------------I
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
