      * L1-SYEDI For Serviceringen INVOIC D.93A
      *
      * 1. L1 Fakturering legger ut poster i EDISF hvis styringsfilen
      *    ESTYF inneholder en samsvarende post på kundenivå.
      *
      * 2. Dette programmet leser fra EDISF, men kun de kundenummer som
      *    er  hardkodet i dette program.
      *    OBS ! Kundenummer må rettes for hver installasjon
      *
      * 3. Dette programmet legger ut til EDI-filer i SYEDI.
      *
      * 4. SYEDI lager automatisk EDIFACT utifra EDI-filene.
      *
     FEDISF     UF   E             DISK
     FSSTAL02   IF   E           K DISK    PREFIX(Z_)
     FKUNDL01   IF   E           K DISK    PREFIX(X_)
     FVADRL01   IF   E           K DISK    PREFIX(Å_)
     FHORDL06   IF   E           K DISK    PREFIX(Y_)
     FKODAL01   IF   E           K DISK    PREFIX(Æ_)
     FKHEAL01   IF   E           K DISK    PREFIX(Ø_)
     FVAREL01   IF   E           K DISK    PREFIX(Q_)
     FKODML01   IF   E           K DISK    PREFIX(Q_)
     FKODNL01   IF   E           K DISK    PREFIX(Q_)
     FELFVARE   IF   E           K DISK    PREFIX(Y_)
     FKOMML01   IF   E           K DISK    PREFIX(V_)
     FECMSG     IF   E           K DISK
     FEDIC      UF   E             DISK
     FEUNH      O  A E             DISK
     FEDIM      O  A E             DISK
     FKUNKO     IF   E           K DISK
     FEALC93A   O  A E             DISK
     FEALI93A   O  A E             DISK
     FECNT93A   O  A E             DISK
     FECTA93A   O  A E             DISK
     FECUX93A   O  A E             DISK
     FEDTM93A   O  A E             DISK
     FEIMD93A   O  A E             DISK
     FELIN93A   O  A E             DISK
     FEMOA93A   O  A E             DISK
     FENAD93A   O  A E             DISK
     FEPAT93A   O  A E             DISK
     FEPCD93A   O  A E             DISK
     FEPIA93A   O  A E             DISK
     FEPRI93A   O  A E             DISK
     FEQTY93A   O  A E             DISK
     FERFF93A   O  A E             DISK
     FETAX93A   O  A E             DISK
     FEUNS      O  A E             DISK
      *___________________________
      * Arrays for string handling
      *"""""""""""""""""""""""""""
     D                 DS
     D  WTIME                  1     14  0
     D  WTID                   1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  WDATO                  1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
     D                 DS
     D  FAKDAT                 1      8
     D  FAKAAR                 1      4  0
     D  FAKMND                 5      6  0
     D  FAKDAG                 7      8  0
     D                 DS
     D  FFDDAT                 1      8
     D  FFDAAR                 1      4  0
     D  FFDMND                 5      6  0
     D  FFDDAG                 7      8  0
     D                 DS
     D  RENDAT                 1      8
     D  KAARFS                 1      4  0
     D  KMNDFS                 5      6  0
     D  KDAGFS                 7      8  0
     D                 DS
     D  ZRDDAT                 1      8
     D  Z_ORDAAR               1      4  0
     D  Z_ORDMND               5      6  0
     D  Z_ORDDAG               7      8  0
     D                 DS
     D  ZAKDAT                 1      8
     D  Z_PAKAAR               1      4  0
     D  Z_PAKMND               5      6  0
     D  Z_PAKDAG               7      8  0
     D                 DS
     D  Y_F00001               1     50
     D  Y_DSVGRP              34     37
      *____________________________________
      * DS for leftjustify numericel fields
      *""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN153                  1     15  3
     D  ØA153H                 1     12
     D  ØA153X                 5     12
     D  ØA153D                13     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRA
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      * SR                                                  ALC14 /
      *////////////////////////////////////////////////////////////
     C     ALC14         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
      *____________
      * Ordrerabatt
      *""""""""""""
     C     ORBEL         IFNE      0
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C                   MOVEL     'A'           A5463
     C                   MOVEL     'DI'          A7161
     C                   MOVEL     'ORDRERAB'    A7160
     C     A7160         CAT       'ATT':0       A7160
     C                   WRITE     ALCR
     C                   EXSR      MOA18A
     C                   ENDIF
      *___________
      * Avrundning
      *"""""""""""
     C     AVRUFS        IFNE      0
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     FAKTYP        IFEQ      'F'
     C     AVRUFS        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   ELSE
     C     AVRUFS        IFGT      0
     C                   MOVEL     'A'           A5463
     C                   ELSE
     C                   MOVEL     'C'           A5463
     C                   ENDIF
     C                   ENDIF
      *
     C                   MOVEL     'IA'          A7161
     c                   EVAL      A7160 = 'AVRUNDNINGSBELØP'
     C                   WRITE     ALCR
     C                   EXSR      MOA18B
     C                   ENDIF
     C                   GOTO      ALC14A
      *______________
      * Avgiftskode-1
      *""""""""""""""
     C     AVG1          IFNE      *BLANKS
     C     AVBEL1        ANDNE     0
     C                   MOVEL(P)  AVG1          WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVBEL1        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVBEL1        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
      *______________
      * Avgiftskode-2
      *""""""""""""""
     C     AVG2          IFNE      *BLANKS
     C     AVBEL2        ANDNE     0
     C                   MOVEL(P)  AVG2          WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVBEL2        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVBEL2        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
      *______________
      * Avgiftskode-3
      *""""""""""""""
     C     AVG3          IFNE      *BLANKS
     C     AVBEL3        ANDNE     0
     C                   MOVEL(P)  AVG3          WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVBEL3        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVBEL3        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
      *______________
      * Avgiftskode-4
      *""""""""""""""
     C     AVG4ED        IFNE      *BLANKS
     C     AVB4ED        ANDNE     0
     C                   MOVEL(P)  AVG4ED        WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVB4ED        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVB4ED        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
      *______________
      * Avgiftskode-5
      *""""""""""""""
     C     AVG5ED        IFNE      *BLANKS
     C     AVB5ED        ANDNE     0
     C                   MOVEL(P)  AVG5ED        WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVB5ED        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVB5ED        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
      *______________
      * Avgiftskode-6
      *""""""""""""""
     C     AVG6ED        IFNE      *BLANKS
     C     AVB6ED        ANDNE     0
     C                   MOVEL(P)  AVG6ED        WAVG
     C     AVGKEY        CHAIN     KHEAL01                            52
     C     *IN52         IFEQ      *OFF

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     14            AGN
     C                   Z-ADD     WREP0         AREP0
     C     AVB6ED        IFGT      0
     C                   MOVEL     'C'           A5463
     C                   ELSE
     C                   MOVEL     'A'           A5463
     C                   ENDIF
     C                   MOVEL     'FS'          A7161
     C                   MOVEL     Ø_AVGTXT      A7160
     C                   WRITE     ALCR
     C                   Z-ADD     AVB6ED        WAVBEL
     C                   EXSR      MOA18C

     C                   ENDIF
     C                   ENDIF
     C     ALC14A        ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  ALC35 /
      *////////////////////////////////////////////////////////////
     C     ALC35         BEGSR
     C                   Z-ADD     0             WREP1
      *____________
      * Ordrerabatt
      *""""""""""""
     C     Z_RABBEL      IFNE      0
     C                   ADD       1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALCR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     35            AGN
     C                   Z-ADD     WREP0         AREP0
     C                   Z-ADD     WREP1         AREP1
     C                   MOVEL     'A'           A5463
     C                   MOVEL     'OTE'         A7161
     C                   MOVEL     'RABATT'      A7160
     C                   WRITE     ALCR
     C                   EXSR      PCD37
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  ALI22 /
      *////////////////////////////////////////////////////////////
     C     ALI22         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   ALIR
     C                   Z-ADD     WMN           AMN
     C                   Z-ADD     22            AGN
     C                   Z-ADD     WREP0         AREP0
     C                   Z-ADD     WREP1         AREP1
      *______
      * Bonus
      *""""""
     C                   MOVEL     I7008A        W7008A            5
     C                   SELECT
     C     W7008A        WHENEQ    'FRAKT'
     C                   MOVEL     '15'          A4183A
     C                   OTHER
     C                   MOVEL     '6'           A4183A
     C                   ENDSL
     C                   WRITE     ALIR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
     C                   Z-ADD     1             WREP0
     C                   CLEAR                   CNTR
     C                   Z-ADD     WMN           CMN
     C                   Z-ADD     WREP0         CREP0
     C                   MOVEL     '1'           C6069
     C                   Z-ADD     W6066         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           C6066
     C                   WRITE     CNTR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 CTA05A /
      *////////////////////////////////////////////////////////////
     C     CTA05A        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   CTAR
     C                   Z-ADD     WMN           CMN
     C                   Z-ADD     5             CGN
     C                   Z-ADD     WREP0         CREP0
     C                   Z-ADD     WREP1         CREP1
      *___________________________________
      * "Deres referanse fra bestillingen"
      *"""""""""""""""""""""""""""""""""""
     C                   MOVEL     'PD'          C3139
     C                   MOVEL     Y_KUNREF      C3412
     C                   WRITE     CTAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 CTA05B /
      *////////////////////////////////////////////////////////////
     C     CTA05B        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   CTAR
     C                   Z-ADD     WMN           CMN
     C                   Z-ADD     5             CGN
     C                   Z-ADD     WREP0         CREP0
     C                   Z-ADD     WREP1         CREP1
      *_________________________________
      * "Vår referanse fra bestillingen"
      *"""""""""""""""""""""""""""""""""
     C                   MOVEL     'AD'          C3139
     C                   MOVEL     Y_SELGER      C3412
     C                   WRITE     CTAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  CUX07 /
      *////////////////////////////////////////////////////////////
     C     CUX07         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   CUXR
     C                   Z-ADD     WMN           CMN
     C                   Z-ADD     7             CGN
     C                   Z-ADD     WREP0         CREP0
     C                   MOVEL     '2'           C6347A
     C                   MOVEL     'NOK'         C6345A
     C                   WRITE     CUXR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   DTMR
     C                   Z-ADD     WMN           DMN
     C                   Z-ADD     0             DGN
     C                   Z-ADD     WREP0         DREP0
      *______________
      * Leveringsdato
      *""""""""""""""
     C                   MOVEL     '35'          D2005
     C*                  MOVEL(P)  '19'          D2380
     C*                  CAT       FAKDAT:0      D2380
     C                   MOVEL(P)  FAKDAT        D2380
     C                   MOVEL     '102'         D2379
     C                   WRITE     DTMR
      *_____________
      * Meldingsdato
      *"""""""""""""
     C                   ADD       1             WREP0
     C                   CLEAR                   DTMR
     C                   Z-ADD     WMN           DMN
     C                   Z-ADD     WREP0         DREP0
     C                   MOVEL     '137'         D2005
     C*                  MOVEL(P)  '19'          D2380
     C*                  MOVEL     WDATO         WDATOA            6
     C*                  CAT       WDATOA:0      D2380
     C                   MOVEL     WDATO(P)      D2380
     C                   MOVEL     '102'         D2379
     C                   WRITE     DTMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   DTMR
     C                   Z-ADD     WMN           DMN
     C                   Z-ADD     1             DGN
     C                   Z-ADD     WREP0         DREP0
     C                   Z-ADD     WREP1         DREP1
      *____________
      * Fakturadato
      *""""""""""""
     C                   MOVEL     '137'         D2005
     C*                  MOVEL(P)  '19'          D2380
     C*                  CAT       FAKDAT:0      D2380
     C                   MOVEL(P)  FAKDAT        D2380
     C                   MOVEL     '102'         D2379
     C                   WRITE     DTMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 DTM08A /
      *////////////////////////////////////////////////////////////
     C     DTM08A        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   DTMR
     C                   Z-ADD     WMN           DMN
     C                   Z-ADD     8             DGN
     C                   Z-ADD     WREP0         DREP0
     C                   Z-ADD     WREP1         DREP1
      *____________
      * Fakturadato
      *""""""""""""
     C                   MOVEL     '7'           D2005
     C*                  MOVEL(P)  '19'          D2380
     C*                  CAT       FAKDAT:0      D2380
     C                   MOVEL(P)  FAKDAT        D2380
     C                   MOVEL     '102'         D2379
     C                   WRITE     DTMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 DTM08B /
      *////////////////////////////////////////////////////////////
     C     DTM08B        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   DTMR
     C                   Z-ADD     WMN           DMN
     C                   Z-ADD     8             DGN
     C                   Z-ADD     WREP0         DREP0
     C                   Z-ADD     WREP1         DREP1
      *_____________
      * Forfallsdato
      *"""""""""""""
     C                   MOVEL     '13'          D2005
     C*                  MOVEL(P)  '19'          D2380
     C*                  CAT       FFDDAT:0      D2380
     C                   MOVEL(P)  FFDDAT        D2380
     C                   MOVEL     '102'         D2379
     C                   WRITE     DTMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * EDIM0                                                EDIM0/
      *////////////////////////////////////////////////////////////
     C     EDIM0         BEGSR
     C                   CLEAR                   EDIMR
     C                   MOVEL     ECIIDI        M0004
     C                   MOVEL     ECIIDC        M0010
     C                   MOVE      '1'           M0035
     C                   MOVEL     U0062A        M0062
     C                   MOVEL     U0065         M0065
     C                   MOVEL     U1004         M0068
     C                   MOVEL     U1001         M1001
     C                   MOVEL     U1004         M1004
     C                   Z-ADD     WMN           MMN
     C                   MOVE      'S'           MSR
     C                   MOVEL     WDATO         MDT
     C                   MOVEL     WTID          MTM
     C                   WRITE     EDIMR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  IMD22 /
      *////////////////////////////////////////////////////////////
     C     IMD22         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   IMDR
     C                   Z-ADD     WMN           IMN
     C                   Z-ADD     22            IGN
     C                   Z-ADD     WREP0         IREP0
     C                   Z-ADD     WREP1         IREP1
     C                   MOVEL     'FL'          I7077
     C                   MOVEL     'ZZ'          I7009

     C     KOMMKEY       CHAIN     KOMML01                            52
     C                   IF        *IN52=*OFF AND V_UTSKDF='J'
     C                   MOVEL     V_OTBKOM      I7008A
     C                   ELSE

     C     VARKEY        CHAIN     VAREL01                            52
     C                   IF        *IN52
     C                   EVAL      I7008A = 'FRAKTSONETILLEGG'
     C                   ELSE
     C                   MOVEL     Q_VARTE1      I7008A
     C                   MOVEL     Q_VARTE2      I7008B
     C                   ENDIF
     C                   ENDIF

     C                   WRITE     IMDR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  LIN22 /
      *////////////////////////////////////////////////////////////
     C     LIN22         BEGSR
     C                   Z-ADD     0             WREP0
     C                   Z-ADD     0             W6066            15 3          CNT00 Sum mengde
      * Første record fra SSTAL02 er allerede lest i init av dette pgm.
     C     *IN53         DOWEQ     *OFF
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   LINR
     C                   Z-ADD     WMN           LMN
     C                   Z-ADD     22            LGN
     C                   Z-ADD     WREP0         LREP0
     C                   Z-ADD     WREP0         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           L1082
     C                   EVAL      L7140 = %TRIML(Z_VARENR)
     C                   MOVEL     'SA'          L7143
     C                   WRITE     LINR
     C                   EXSR      PIA22
     C                   EXSR      IMD22
     C                   EXSR      QTY22
     C                   EXSR      ALI22
     C                   EXSR      MOA23
     C                   EXSR      PRI25
     C                   EXSR      ALC35

     C     SSKEY         READE     SSTAL02                                53
     C                   ENDDO
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 MOA18A /
      *////////////////////////////////////////////////////////////
     C     MOA18A        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     18            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   MOVEL     '8'           M5025
     C                   Z-ADD     ORBEL         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 MOA18B /
      *////////////////////////////////////////////////////////////
     C     MOA18B        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     18            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   MOVEL     '8'           M5025
     C     AVRUFS        IFGT      0
     C                   Z-ADD     AVRUFS        ØN153
     C                   ELSE
     C                   Z-SUB     AVRUFS        ØN153
     C                   ENDIF
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                 MOA18C /
      *////////////////////////////////////////////////////////////
     C     MOA18C        BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     18            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   MOVEL     '8'           M5025
     C     WAVBEL        IFGT      0
     C                   Z-ADD     WAVBEL        ØN153
     C                   ELSE
     C                   Z-SUB     WAVBEL        ØN153
     C                   ENDIF
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MOA23 /
      *////////////////////////////////////////////////////////////
     C     MOA23         BEGSR
      *___________________________________________
      * Linjebeløp (Ink rabatt/gebyr og exl. mva.)
      *"""""""""""""""""""""""""""""""""""""""""""
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     23            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   MOVEL     '203'         M5025
     C                   IF        Z_BELOP <> 0
     C                   EVAL      ØN153=Z_BELOP
     C                   ELSE

     C                   EVAL      ØN153=(Z_LEVERT*Z_PRIS)
     C                   IF        Z_PRKOSS = 'C'
     C                   EVAL      ØN153=ØN153 * 0.01
     C                   ENDIF

     C                   IF        Z_VRAB1 <> 0
     C                   EVAL      W_ØN153=(ØN153*Z_VRAB1)/100
     C                   EVAL      ØN153= ØN153-W_ØN153
     C                   ENDIF

     C                   ENDIF
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MOA30 /
      *////////////////////////////////////////////////////////////
     C     MOA30         BEGSR
     C                   Z-ADD     1             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     30            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   Z-ADD     WREP1         MREP1
     C                   Z-ADD     WREP2         MREP2
     C                   MOVEL     '204'         M5025
     C                   Z-ADD     Z_RABBEL      ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  MOA45 /
      *////////////////////////////////////////////////////////////
     C     MOA45         BEGSR
      *_____________
      * Fakturabeløp
      *"""""""""""""
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     45            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   MOVEL     '86'          M5025
     C                   Z-ADD     FTOTN         ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
      *______________________________________________________
      * Sum totalt  varelinjebeløp, inklusive rab/geb og avg.
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     45            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   MOVEL     '125'         M5025
     C                   EVAL      ØN153=FTOTN-MVABEL
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
      *_______________
      * Sum totalt MVA
      *"""""""""""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   MOAR
     C                   Z-ADD     WMN           MMN
     C                   Z-ADD     45            MGN
     C                   Z-ADD     WREP0         MREP0
     C                   MOVEL     '150'         M5025
     C                   Z-ADD     MVABEL        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           M5004
     C                   WRITE     MOAR
      *________________________________________
      * Sum varelinjebeløp exl. fradrag/tillegg
      *""""""""""""""""""""""""""""""""""""""""
     C*                  ADD       1             WREP0
     C*                  Z-ADD     0             WREP1
     C*                  Z-ADD     0             WREP2
     C*                  CLEAR                   MOAR
     C*                  Z-ADD     WMN           MMN
     C*                  Z-ADD     45            MGN
     C*                  Z-ADD     WREP0         MREP0
     C*                  MOVEL     '79'          M5025
     C*    SVBEL         SUB       SVRAB         ØN153
     C*                  EXSR      SRNE
     C*                  MOVEL     ØAN           M5004
     C*                  WRITE     MOAR
      *________________________________________
      * Sum varelinjebeløp ink. fradrag/tillegg
      *""""""""""""""""""""""""""""""""""""""""
     C*                  ADD       1             WREP0
     C*                  Z-ADD     0             WREP1
     C*                  Z-ADD     0             WREP2
     C*                  CLEAR                   MOAR
     C*                  Z-ADD     WMN           MMN
     C*                  Z-ADD     45            MGN
     C*                  Z-ADD     WREP0         MREP0
     C*                  MOVEL     '125'         M5025
     C*                  Z-ADD     SVBEL         ØN153
     C*                  EXSR      SRNE
     C*                  MOVEL     ØAN           M5004
     C*                  WRITE     MOAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  NAD02 /
      *////////////////////////////////////////////////////////////
     C     NAD02         BEGSR
     C                   Z-ADD     0             WREP0
      *________________
      * Fakturamottaker
      *""""""""""""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   NADR
     C                   Z-ADD     WMN           NMN
     C                   Z-ADD     2             NGN
     C                   Z-ADD     WREP0         NREP0

     C                   MOVEL     'IV'          N3035
     C                   Z-ADD     WUNDNR        W_KUKUN2
     C     KOVKEY        CHAIN     KUNKO                              52
     C                   IF        *IN52
     C                   Z-ADD     WUNDNR        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   ELSE
     C                   MOVEL     KUINTN        N3039
     C                   ENDIF
     C                   MOVEL     '9'           N3055
     C                   Z-ADD     WUNDNR        WUNDN2
     C     KUNKEY        CHAIN     KUNDL01                            52
     C                   MOVEL     X_KNAVN       N3036A
     C                   MOVEL     X_ADR1        N3042A
     C                   MOVEL     X_ADR3        N3164
     C                   MOVEL     X_POSTNR      N3251
     C                   WRITE     NADR
      *_______
      * Kjøper
      *"""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   NADR
     C                   Z-ADD     WMN           NMN
     C                   Z-ADD     2             NGN
     C                   Z-ADD     WREP0         NREP0

     C                   MOVEL     'BY'          N3035
     C                   Z-ADD     KUNDNR        W_KUKUN2
     C     KOVKEY        CHAIN     KUNKO                              52
     C                   IF        *IN52
     C                   Z-ADD     KUNDNR        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           N3039
     C                   ELSE
     C                   MOVEL     KUINTN        N3039
     C                   ENDIF
     C                   MOVEL     '9'           N3055
     C                   Z-ADD     KUNDNR        WUNDN2
     C     KUNKEY        CHAIN     KUNDL01                            52
     C                   MOVEL     X_KNAVN       N3036A
     C                   MOVEL     X_ADR1        N3042A
     C                   MOVEL     X_ADR3        N3164
     C                   MOVEL     X_POSTNR      N3251
     C                   WRITE     NADR
     C     Y_KUNREF      IFNE      *BLANKS
     C                   EXSR      CTA05A
     C                   ENDIF
      *___________________________________
      * Mottaker (hvis forskjellig fra BY)
      *"""""""""""""""""""""""""""""""""""
      * Hent vareadresse
     C     VADKEY        CHAIN     VADRL01                            52
     C     *IN52         IFEQ      *OFF
     C     Å_VADRNA      IFNE      X_KNAVN
     C     Å_VADRN1      ORNE      X_ADR1
     C     Å_VADRN3      ORNE      X_ADR3
     C     Å_VPOSTN      ORNE      X_POSTNR

     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   NADR
     C                   Z-ADD     WMN           NMN
     C                   Z-ADD     2             NGN
     C                   Z-ADD     WREP0         NREP0

     C                   MOVEL     'DP'          N3035
     C                   MOVEL     Å_VADRNA      N3036A
     C                   MOVEL     Å_VADRN1      N3042A
     C                   MOVEL     Å_VADRN3      N3164
     C                   MOVEL     Å_VPOSTN      N3251
     C                   WRITE     NADR

     C                   ENDIF
     C                   ENDIF
      *_______
      * Selger
      *"""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   NADR
     C                   Z-ADD     WMN           NMN
     C                   Z-ADD     2             NGN
     C                   Z-ADD     WREP0         NREP0

     C                   MOVEL     'SU'          N3035
     C                   MOVEL     '7080000'     N3039
     C     N3039         CAT       '587261':0    N3039
     C                   MOVEL     '9'           N3055
     C                   MOVEL     'ELEKTRO-'    N3036A
     C     N3036A        CAT       'ARMATU':0    N3036A
     C     N3036A        CAT       'R A/S':0     N3036A
     C                   MOVEL     'SOLHEIMS'    N3042A
     C     N3042A        CAT       'VEIEN':0     N3042A
     C     N3042A        CAT       ' 10':0       N3042A
     C                   MOVEL     'SKÅRER'      N3164
     C                   MOVEL     '1471'        N3251
     C                   WRITE     NADR
     C                   EXSR      RFF03
     C     Y_SELGER      IFNE      *BLANKS
     C                   EXSR      CTA05B
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PAT08 /
      *////////////////////////////////////////////////////////////
     C     PAT08         BEGSR
      *____________
      * Fakturadato
      *""""""""""""
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   PATR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     8             PGN
     C                   Z-ADD     WREP0         PREP0
     C                   MOVEL     '1'           P4279
     C                   WRITE     PATR
     C                   EXSR      DTM08A
      *_____________
      * Forfallsdato
      *"""""""""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   PATR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     8             PGN
     C                   Z-ADD     WREP0         PREP0
     C                   MOVEL     '3'           P4279
     C                   WRITE     PATR
     C                   EXSR      DTM08B
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PCD08 /
      *////////////////////////////////////////////////////////////
     C     PCD08         BEGSR
     C     BETKEY        CHAIN     KODAL01                            52
     C     *IN52         IFEQ      *OFF
     C     Æ_KONRAB      ANDNE     0

     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   PCDR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     8             PGN
     C                   Z-ADD     WREP0         PREP0
     C                   Z-ADD     WREP1         PREP1
     C                   MOVEL     '15'          P5245
     C                   Z-ADD     Æ_KONRAB      ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           P5482
     C                   WRITE     PCDR

     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PCD37 /
      *////////////////////////////////////////////////////////////
     C     PCD37         BEGSR
     C     Z_VRAB1       IFNE      0
     C     Z_RTYPSS      ANDEQ     '4'

     C                   Z-ADD     1             WREP2
     C                   CLEAR                   PCDR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     37            PGN
     C                   Z-ADD     WREP0         PREP0
     C                   Z-ADD     WREP1         PREP1
     C                   Z-ADD     WREP2         PREP2
     C                   MOVEL     '3'           P5245
     C                   Z-ADD     Z_VRAB1       ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           P5482
     C                   WRITE     PCDR

     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PIA22 /
      *////////////////////////////////////////////////////////////
     C     PIA22         BEGSR
     C                   Z-ADD     0             WREP1
      *______________________________________
      * Elektroforeningens Artikkel/Gruppenr.
      *""""""""""""""""""""""""""""""""""""""
     C                   EVAL      W_K00001 = %TRIML(Z_VARENR)
     C     W_K00001      CHAIN     ELFVARE                            52
     C                   ADD       1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   PIAR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     22            PGN
     C                   Z-ADD     WREP0         PREP0
     C                   Z-ADD     WREP1         PREP1
     C                   MOVEL     '1'           P4347
     C                   MOVEL     Y_DSVGRP      P7140A
     C                   MOVEL     'EFO'         P7143A
     C                   WRITE     PIAR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  PRI25 /
      *////////////////////////////////////////////////////////////
     C     PRI25         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   PRIR
     C                   Z-ADD     WMN           PMN
     C                   Z-ADD     25            PGN
     C                   Z-ADD     WREP0         PREP0
     C                   Z-ADD     WREP1         PREP1
     C                   MOVEL     'AAB'         P5125
     C                   Z-ADD     Z_PRIS        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           P5118
     C                   WRITE     PRIR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  QTY22 /
      *////////////////////////////////////////////////////////////
     C     QTY22         BEGSR
     C                   Z-ADD     0             WREP1
      *_________________
      * Fakturert mengde
      *"""""""""""""""""
     C                   ADD       1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   QTYR
     C                   Z-ADD     WMN           QMN
     C                   Z-ADD     22            QGN
     C                   Z-ADD     WREP0         QREP0
     C                   Z-ADD     WREP1         QREP1
     C                   MOVEL     '47'          Q6063
     C                   Z-ADD     Z_LEVERT      ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           Q6060
     C                   MOVEL     'PCE'         Q6411
     C                   WRITE     QTYR
      * summer for total mengde, kommer i segment CNT00 etter UNS
     C                   ADD       Z_LEVERT      W6066
      *______________
      * Levert mengde
      *""""""""""""""
     C                   ADD       1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   QTYR
     C                   Z-ADD     WMN           QMN
     C                   Z-ADD     22            QGN
     C                   Z-ADD     WREP0         QREP0
     C                   Z-ADD     WREP1         QREP1
     C                   MOVEL     '46'          Q6063
     C                   Z-ADD     Z_LEVERT      ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           Q6060
     C                   MOVEL     'PCE'         Q6411
     C                   WRITE     QTYR
      *________________
      * Bestillt mengde
      *""""""""""""""""
     C                   ADD       1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   QTYR
     C                   Z-ADD     WMN           QMN
     C                   Z-ADD     22            QGN
     C                   Z-ADD     WREP0         QREP0
     C                   Z-ADD     WREP1         QREP1
     C                   MOVEL     '21'          Q6063
     C                   Z-ADD     Z_BESTIL      ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           Q6060
     C                   MOVEL     'PCE'         Q6411
     C                   WRITE     QTYR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
      *_______________________
      * Bestillers Ordrenummer
      *"""""""""""""""""""""""
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   RFFR
     C                   Z-ADD     WMN           RMN
     C                   Z-ADD     1             RGN
     C                   Z-ADD     WREP0         RREP0
     C                   MOVEL     'ON'          R1153
     C                   Z-ADD     Z_ORDNR       ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           R1154
     C                   WRITE     RFFR
      *____________________
      * Selgers Fakturanummer
      *""""""""""""""""""""
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   RFFR
     C                   Z-ADD     WMN           RMN
     C                   Z-ADD     1             RGN
     C                   Z-ADD     WREP0         RREP0
     C                   MOVEL     'VN'          R1153
     C                   Z-ADD     FAKTNR        ØN153
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           R1154
     C                   WRITE     RFFR
     C                   EXSR      DTM01
      *__________________
      * Kundens Referanse
      *""""""""""""""""""
     C     Y_KUNREF      IFNE      *BLANKS
     C                   ADD       1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   RFFR
     C                   Z-ADD     WMN           RMN
     C                   Z-ADD     1             RGN
     C                   Z-ADD     WREP0         RREP0
     C                   MOVEL     'AAK'         R1153
     C                   MOVEL     Y_KUNREF      R1154
     C                   WRITE     RFFR
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  RFF03 /
      *////////////////////////////////////////////////////////////
     C     RFF03         BEGSR
     C                   Z-ADD     1             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   RFFR
     C                   Z-ADD     WMN           RMN
     C                   Z-ADD     3             RGN
     C                   Z-ADD     WREP0         RREP0
     C                   Z-ADD     WREP1         RREP1
      *____________________
      * Organisasjonsnummer
      *""""""""""""""""""""
     C                   MOVEL     'VA'          R1153
     C                   MOVEL     'FORETAKSREGI'R1154
     C     R1154         CAT       'STERET':0    R1154
     C     R1154         CAT       'NO':0        R1154
     C     R1154         CAT       '941863':0    R1154
     C     R1154         CAT       '116':0       R1154
     C     R1154         CAT       'MVA':0       R1154
     C                   WRITE     RFFR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
      * HENTE DAGENS DATO OG TID
     C                   TIME                    WTIME
     C     WÅÅ           IFGT      31
     C                   Z-ADD     WÅÅ           WÅ
     C                   Z-ADD     WDD           WD
     C                   ELSE
     C                   Z-ADD     WDD           WÅ
     C                   Z-ADD     WÅÅ           WD
     C                   ENDIF
     C                   Z-ADD     WMM           WM
      * INIT AV ARBEIDSFELT
     C     *LIKE         DEFINE    DREP0         WREP0
     C     *LIKE         DEFINE    DREP1         WREP1
     C     *LIKE         DEFINE    DREP2         WREP2
     C     *LIKE         DEFINE    ECSR          WCSR
     C     *LIKE         DEFINE    EC0065        WC0065
     C     *LIKE         DEFINE    KUNDNR        WUNDNR
     C     *LIKE         DEFINE    KUNDNR        WUNDN2
     C     *LIKE         DEFINE    Ø_AVG         WAVG
     C     *LIKE         DEFINE    AVBEL1        WAVBEL
     C     *LIKE         DEFINE    KUKUN1        W_KUKUN1
     C     *LIKE         DEFINE    KUKUN2        W_KUKUN2
     C     *LIKE         DEFINE    UMN           WMN
     C     *LIKE         DEFINE    Y_K00001      W_K00001
     C     *LIKE         DEFINE    V_OTBKOD      W_OTBKOD
     C     *LIKE         DEFINE    V_LNRKOM      W_LNRKOM
     C                   MOVE      'S'           WCSR
     C                   MOVEL     'INVOIC'      WC0065
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
     C                   Z-ADD     2838          W_KUKUN1
     C                   MOVE      'O'           W_OTBKOD
     C                   Z-ADD     0             W_LNRKOM
     C                   Z-ADD     0             W_ØN153          15 3
      * DEF AV KEYS
     C     ECMKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    WUNDNR
     C                   KFLD                    WCSR
     C                   KFLD                    WC0065
     C     SSKEY         KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    FAKAAR
     C                   KFLD                    FAKTNR
     C     KUNKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    WUNDN2
     C     KOVKEY        KLIST
     C                   KFLD                    W_KUKUN1
     C                   KFLD                    W_KUKUN2
     C     VADKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    KUNDNR
     C                   KFLD                    Y_VADRNR
     C     HORKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    Z_ORDAAR
     C                   KFLD                    Z_ORDMND
     C                   KFLD                    Z_ORDDAG
     C                   KFLD                    Z_ORDNR
     C     BETKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    BETBET
     C     AVGKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    WAVG
     C     VARKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    Z_VARENR
     C     KOMKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    Y_LEVBET
     C     KONKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    Y_LEVMAT
     C     KOMMKEY       KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    W_OTBKOD
     C                   KFLD                    Z_ORDAAR
     C                   KFLD                    Z_ORDNR
     C                   KFLD                    Z_LNRORD
     C                   KFLD                    W_LNRKOM
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                    SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Les faktura fra L1
      *"""""""""""""""""""
     C                   READ      EDISF                                  51
     C     *IN51         DOWEQ     '0'
     C     AKTKOD        IFEQ      'A'
      *_________________________
      * Hente riktig kundenummer
      *"""""""""""""""""""""""""
     C                   Z-ADD     KUNDNR        WUNDNR
     C     FMOT          IFGT      0
     C                   Z-ADD     FMOT          WUNDNR
     C                   ENDIF
     C     WUNDNR        IFEQ      2838
     C     FTOTN         ANDNE     0
      *_______________________
      * Hente ordreinformasjon
      *"""""""""""""""""""""""
     C     SSKEY         CHAIN     SSTAL02                            53
     C     HORKEY        CHAIN     HORDL06                            52
      *________________________
      * Hente partID og release
      *""""""""""""""""""""""""
     C     ECMKEY        CHAIN     ECMSG                              52
      *________________________
      * Retreive message number
      *""""""""""""""""""""""""
     C     1             CHAIN     EDIC                               52
     C                   ADD       1             CMN
     C                   UPDATE    EDICR
     C                   Z-ADD     CMN           WMN
     C                   MOVE      '1'           *IN41
      *_________________
      * EDIFACT Detaljer
      *"""""""""""""""""
     C                   EXSR      SRB
      *____________________________
      * Oppdater status på fakturan
      *""""""""""""""""""""""""""""
     C                   MOVE      'D'           AKTKOD
     C                   ENDIF
     C                   ENDIF
     C                   UPDATE    EDISR
      *__________________
      * Les neste faktura
      *""""""""""""""""""
     C                   READ      EDISF                                  51
     C                   ENDDO
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                    SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *_____________
      * ADD SEGMENTS
      *"""""""""""""
     C                   EXSR      DTM00
     C                   EXSR      RFF01
     C                   EXSR      NAD02
     C                   EXSR      CUX07
     C                   EXSR      PAT08
     C                   EXSR      ALC14
     C                   EXSR      LIN22
     C                   EXSR      UNS00
     C                   EXSR      CNT00
     C                   EXSR      MOA45
     C                   EXSR      TAX47
      *_____________
      * WRITE TO UNH
      *"""""""""""""
     C                   EXSR      UNH00
      *______________
      * WRITE TO EDIM
      *""""""""""""""
     C                   EXSR      EDIM0
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Leftjustify num.fields                              SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * Remove neg sign.
     C                   IF        ØN153 < 0
     C                   Z-SUB     ØN153         ØN153
     C                   ENDIF
      * Move correct value into alpha 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA153D        IFEQ      '000'
     C                   MOVE      ØA153H        ØA12
     C                   ELSE
     C                   MOVEL     ØA153X        ØA12
     C                   MOVE      ',   '        ØA12
     C                   MOVE      ØA153D        ØA12
     C                   END
      * search from left and find first sign over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C     ØA153D        IFNE      '000'
     C     ØA153X        IFEQ      '00000000'
     C                   SUB       1             ØX
     C                   ENDIF
     C     Ø12(12)       IFEQ      '0'
     C                   MOVE      ' '           Ø12(12)
     C     Ø12(11)       IFEQ      '0'
     C                   MOVE      ' '           Ø12(11)
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN

     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  TAX47 /
      *////////////////////////////////////////////////////////////
     C     TAX47         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   TAXR
     C                   Z-ADD     WMN           TMN
     C                   Z-ADD     47            TGN
     C                   Z-ADD     WREP0         TREP0
     C                   MOVEL     '7'           T5283
     C                   MOVEL     'VAT'         T5153
     C                   MOVEL     '23'          T5278
     C                   MOVEL     'S'           T5305
     C                   WRITE     TAXR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * UNH00                                               UNH00 /
      *////////////////////////////////////////////////////////////
     C     UNH00         BEGSR
     C                   CLEAR                   UNHR
     C                   Z-ADD     WMN           UMN
     C                   MOVEL     WMN           U0062A
     C                   MOVEL     EC0065        U0065
     C                   MOVEL     'D'           U0052
     C                   MOVEL     '93A'         U0054
     C                   MOVEL     'UN'          U0051
     C                   Z-ADD     FAKTNR        ØN153
     C                   EXSR      SRNE
     C     FAKTYP        IFEQ      'F'
     C                   MOVEL     '380'         U1001
     C                   MOVEL     ØAN           U1004
     C                   ELSE
     C                   MOVEL     '381'         U1001
     C                   MOVEL     ØAN           U1004
     C                   ENDIF
     C                   MOVEL     U0062A        U0062B
     C                   WRITE     UNHR
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR                                                  UNS00 /
      *////////////////////////////////////////////////////////////
     C     UNS00         BEGSR
     C                   Z-ADD     1             WREP0
     C                   Z-ADD     0             WREP1
     C                   Z-ADD     0             WREP2
     C                   CLEAR                   UNSR
     C                   Z-ADD     WMN           UMN
     C                   Z-ADD     50            UGN
     C                   Z-ADD     WREP0         UREP0
     C                   MOVEL     'S'           U0081
     C                   WRITE     UNSR
     C                   ENDSR
