     FEDIS      IF   E             DISK
     D EDIDTA          DS           256
     D  UELIBO               181    190
     C     *DTAARA       DEFINE                  EDIDTA
     C                   IN        EDIDTA
      *
     C                   READ      EDIS                                   51
     C     *IN51         DOWEQ     '0'
      *
     C     SLIB          IFEQ      UELIBO
     C                   Z-ADD     SSN           WSN               9 0
     C                   CALL      'E501R'
     C                   PARM                    WSN
     C                   ENDIF
      *
     C                   READ      EDIS                                   51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *INLR
