     FEJO93A    UF   E           K DISK
     FEJ293A    UF   E           K DISK
     FEJ393A    UF   E           K DISK
     D                 DS
     D  WMN                    1      9  0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    FMN
     C                   Z-ADD     FMN           WMN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJO93A
     C     WMN           READE     EJO93A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJO93A
     C     WMN           READE     EJO93A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ293A
     C     WMN           READE     EJ293A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ293A
     C     WMN           READE     EJ293A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ393A
     C     WMN           READE     EJ393A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ393A
     C     WMN           READE     EJ393A                                 51
     C  N51              ENDDO
      *
     C                   ENDSR
