     FEJO04A    UF   E           K DISK
     FEJ204A    UF   E           K DISK
     FEJ304A    UF   E           K DISK
     FEJ404A    UF   E           K DISK
     FEJ504A    UF   E           K DISK
     D                 DS
     D  WMN                    1      9  0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    FMN
     C                   Z-ADD     FMN           WMN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJO04A
     C     WMN           READE     EJO04A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJO04A
     C     WMN           READE     EJO04A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ204A
     C     WMN           READE     EJ204A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ204A
     C     WMN           READE     EJ204A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ304A
     C     WMN           READE     EJ304A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ304A
     C     WMN           READE     EJ304A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ404A
     C     WMN           READE     EJ404A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ404A
     C     WMN           READE     EJ404A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ504A
     C     WMN           READE     EJ504A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ504A
     C     WMN           READE     EJ504A                                 51
     C  N51              ENDDO
      *
     C                   ENDSR
