     FEJO98A    UF   E           K DISK
     FEJ298A    UF   E           K DISK
     FEJ398A    UF   E           K DISK
     FEJ498A    UF   E           K DISK
     D                 DS
     D  WMN                    1      9  0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    FMN
     C                   Z-ADD     FMN           WMN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJO98A
     C     WMN           READE     EJO98A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJO98A
     C     WMN           READE     EJO98A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ298A
     C     WMN           READE     EJ298A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ298A
     C     WMN           READE     EJ298A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ398A
     C     WMN           READE     EJ398A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ398A
     C     WMN           READE     EJ398A                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ498A
     C     WMN           READE     EJ498A                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ498A
     C     WMN           READE     EJ498A                                 51
     C  N51              ENDDO
      *
     C                   ENDSR
