     FEJO01B    UF   E           K DISK
     FEJ201B    UF   E           K DISK
     FEJ301B    UF   E           K DISK
     FEJ401B    UF   E           K DISK
     FEJ501B    UF   E           K DISK
     D                 DS
     D  WMN                    1      9  0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   RETURN
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    FMN
     C                   Z-ADD     FMN           WMN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJO01B
     C     WMN           READE     EJO01B                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJO01B
     C     WMN           READE     EJO01B                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ201B
     C     WMN           READE     EJ201B                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ201B
     C     WMN           READE     EJ201B                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ301B
     C     WMN           READE     EJ301B                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ301B
     C     WMN           READE     EJ301B                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ401B
     C     WMN           READE     EJ401B                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ401B
     C     WMN           READE     EJ401B                                 51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *IN51
     C     WMN           SETLL     EJ501B
     C     WMN           READE     EJ501B                                 51
     C     *IN51         DOWEQ     '0'
     C                   DELETE    EJ501B
     C     WMN           READE     EJ501B                                 51
     C  N51              ENDDO
      *
     C                   ENDSR
