     FEDISSS    UF   E             DISK
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EVAL      *INLR=*ON
      *////////////////////////////////////////////////////////////
      * SR for init                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C     *LIKE         DEFINE    SSSDT         WDT
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    UDT               8
     C                   MOVE      UDT           WDT
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * Read Details                                          SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   READ      EDISSS                                 51
     C     *IN51         DOWEQ     '0'
     C     SSSDT         IFLT      WDT
     C                   DELETE    EDISSSR
     C                   ENDIF
     C                   READ      EDISSS                                 51
     C                   ENDDO
     C                   ENDSR
