N02  FEDI07C0R  O  A F  512        DISK
     FDKTFI     IF   E             DISK
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    W0035             1
N03  C                   PARM                    WFTPIP           64
      * Hæmta firmaupplysningar
     C     1             CHAIN     DKTFI
     C                   IF        W0035=*BLANKS
N03  C                   EVAL      WFTPIP=DKTF_FTIPP
     C                   ELSE
N03  C                   EVAL      WFTPIP=DKTF_FTIPT
     C                   ENDIF
      * USERID AND PASSWORD RECORD
     C                   IF        W0035=*BLANKS
N02  C                   MOVEL(P)  DKTF_FTUSP    DATA            512
     C                   CAT       DKTF_FTPWP:1  DATA
     C                   ELSE
N02  C                   MOVEL(P)  DKTF_FTUST    DATA
     C                   CAT       DKTF_FTPWT:1  DATA
     C                   ENDIF
     C                   EXCEPT    AWRK
      * sendepsv 0
     C                   MOVEL(P)  'sendepsv 0'  DATA
     C                   EXCEPT    AWRK
      * LS
     C                   MOVEL(P)  'ls (DISK'    DATA
     C                   EXCEPT    AWRK
      * QUIT COMMAND RECORD
     C                   MOVEL(P)  'quit'        DATA
     C                   EXCEPT    AWRK
     C                   MOVE      '1'           *INLR
     OEDI07C0R  EADD         AWRK
N02  O                       DATA               512
