     FLSOUTPUT  IF   F  256        DISK
     FEFTPGLOG  O  A E             DISK
     ILSOUTPUT  AA  01
     I                                  1  256  DATA
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WEFGL_ID
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    EFGL_ID       WEFGL_ID
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   READ      LSOUTPUT                               51
     C     *IN51         DOWEQ     *OFF
      * SKRIV POST TIL DETALJ LOGG
     C                   EVAL      EFGL_ID=WEFGL_ID
     C                   MOVE      WDT           EFGL_DT
     C                   MOVE      WTM           EFGL_TM
     C                   MOVEL     DATA          EFGL_LD
     C                   WRITE     EFTPGLOGR
     C                   READ      LSOUTPUT                               51
     C                   ENDDO
     C                   ENDSR
