     FEDII      IF   E           K DISK
     FEDI07CBR  O  A F   80        DISK
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    LIB              10
     C                   PARM                    FILE             10
     C                   PARM                    MBR              10
     C                   PARM                    IID              35
     C                   PARM                    INTCHN
      * LAGE RETT SYNTAKS FOR TIL FIL NAVN
     C     6             SUBST     MBR:3         WMBRN             6
     C                   MOVEL(P)  'D'           WMBR             15
     C     WMBR          CAT       WMBRN:0       WMBR
     C     WMBR          CAT       '.T':0        WMBR
     C     WMBR          CAT       WMBRN:0       WMBR
     C
     C     IID           CHAIN     EDII                               20
      * USERID AND PASSWORD RECORD
     C                   MOVEL(P)  INTCUS        DATA             80
     C                   CAT       INTCPW:1      DATA
     C                   EXCEPT    AWRK
      * CD
     C                   MOVEL(P)  'cd in'       DATA
     C                   EXCEPT    AWRK
      * NAMEFMT
     C                   MOVEL(P)  'NAMEFMT 1'   DATA
     C                   EXCEPT    AWRK
      * sendpasv 0
     C                   MOVEL(P)  'sendpasv 0'  DATA
     C                   EXCEPT    AWRK
      * PUT
     C                   MOVEL(P)  'PUT'         DATA
     C                   CAT       '/':1         DATA
     C                   CAT       LIB:0         DATA
     C                   CAT       '/':0         DATA
     C                   CAT       FILE:0        DATA
     C                   CAT       '/':0         DATA
     C                   CAT       MBR:0         DATA
      *
     C                   CAT       WMBR:1        DATA
     C                   EXCEPT    AWRK
      * QUIT COMMAND RECORD
     C                   MOVEL(P)  'quit'        DATA
     C                   EXCEPT    AWRK
     C                   MOVE      '1'           *INLR
     OEDI07CBR  EADD         AWRK
     O                       DATA                80
