     FEDIS3     UF   E           K DISK
     FEDII      IF   E           K DISK
      * Definiere Workfelt
     C     *LIKE         DEFINE    *IN51         WIN51
     C     *LIKE         DEFINE    INNETW        WNNETW
     C     *LIKE         DEFINE    SST           WST
      * Input parametrer
     C     *ENTRY        PLIST
     C                   PARM      *IN51         WIN51
     C                   PARM      SLIB          SLIB
     C                   PARM      SFILE         SFILE
     C                   PARM      SMBR          SMBR
     C                   PARM      SSN           SSN
     C                   PARM                    WNNETW
     C                   PARM                    S0004
     C                   PARM                    S0010
     C                   MOVE      '1'           *IN51
     C                   MOVEL     'A'           WST
      * Gjyldige statuser som skal sendes er: A 1 2 3 4 5
     C     START         TAG
     C                   MOVE      *OFF          *IN52
      *
     C     WST           SETLL     EDIS3
     C     WST           READE     EDIS3                                  52
     C     *IN52         DOWEQ     '0'
      *
     C     SSR           IFEQ      'S'
     C     S0010         CHAIN     EDII                               53
     C     *IN53         IFEQ      '0'
     C     INNETW        ANDEQ     WNNETW
     C                   MOVE      '0'           *IN51
     C                   EVAL      SSR='+'
     C                   UPDATE    EDISR
     C                   GOTO      END
     C                   ENDIF
     C                   ENDIF
      *
     C     WST           READE     EDIS3                                  52
     C  N52              ENDDO
      * Neste statuskode ?
     C                   SELECT
     C     WST           WHENEQ    'A'
     C                   MOVE      '1'           WST
     C     WST           WHENEQ    '1'
     C                   MOVE      '2'           WST
     C     WST           WHENEQ    '2'
     C                   MOVE      '3'           WST
     C     WST           WHENEQ    '3'
     C                   MOVE      '4'           WST
     C     WST           WHENEQ    '4'
     C                   MOVE      '5'           WST
     C                   OTHER
     C                   GOTO      END
     C                   ENDSL
     C                   GOTO      START
      *
     C     END           TAG
     C                   MOVE      '1'           *INLR
