********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10038 * 01 CB  PTF10 Extra for SEND EXTENDED PASV
10018 * 02 CB  PTF10 Send direkte fra IFS
10236 * 03 CB  PTF10 hente hos ergo ?
********************************************************************
     FEDII      IF   E           K DISK
S02  F*DI07CAR  O  A F   80        DISK
N02  FEDI07CAR  O  A F  512        DISK
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    IID              35
     C                   PARM                    INTCHN
N03  C                   PARM                    INEVRYG
     C     IID           CHAIN     EDII                               20
      * USERID AND PASSWORD RECORD
S02  C*                  MOVEL(P)  INTCUS        DATA             80
N02  C                   MOVEL(P)  INTCUS        DATA            512
     C                   CAT       INTCPW:1      DATA
     C                   EXCEPT    AWRK
      * CD
     C                   MOVEL(P)  'cd touser'   DATA
     C                   EXCEPT    AWRK
      * sendpasv 0
N01  C                   SELECT
N01  C     INSPASV       WHENEQ    'Y'
N01  C     INSPASV       OREQ      'J'
     C                   MOVEL(P)  'sendpasv 0'  DATA
     C                   EXCEPT    AWRK
N01  C     INSPASV       WHENEQ    'X'
N01  C                   MOVEL(P)  'sendepsv 0'  DATA
N01  C                   EXCEPT    AWRK
N01  C                   ENDSL
      * LS
     C                   MOVEL(P)  'ls (DISK'    DATA
     C                   EXCEPT    AWRK
      * QUIT COMMAND RECORD
     C                   MOVEL(P)  'quit'        DATA
     C                   EXCEPT    AWRK
     C                   MOVE      '1'           *INLR
     OEDI07CAR  EADD         AWRK
S02  O*                      DATA                80
N02  O                       DATA               512
