     FEDII2     IF   E           K DISK
      * Definiere Key
     C     EDIKEY        KLIST
     C                   KFLD                    WNEX
     C                   KFLD                    WNNETW
      * Definiere Workfelt
     C     *LIKE         DEFINE    INEX          WNEX
     C     *LIKE         DEFINE    INNETW        WNNETW
     C                   MOVE      'E'           WNEX
     C                   MOVE      'B'           WNNETW
      * READ ALL INTERCHANGE ID'S
     C     EDIKEY        SETLL     EDII2
     C                   MOVE      '0'           *IN51
     C     EDIKEY        READE     EDII2                                  51
     C     *IN51         DOWEQ     '0'
     C                   CALL      'EDI07CBR'
     C                   PARM                    INID
      *
     C     EDIKEY        READE     EDII2                                  51
     C  N51              ENDDO
      *
     C                   RETURN
