     FEDIS      IF   E             DISK
     C   20              IF        *IN20=*OFF
     C     1             CHAIN     EDIS                               20
     C                   ENDIF
     C     *LIKE         DEFINE    SSN           WSN
     C                   CALL      'EDI05R'
     C                   PARM      84218         WSN
     C                   EVAL      *INLR=*ON
