     FEDI85F    UP   F   80        DISK
     D                 DS
     D  RDATA                  1     80
     D  R                      1     80
     D                                     DIM(80)
     IEDI85F    AA  01
     I                                  1   80  RDATA
     C   011             DO        80            X                 2 0
     C                   SELECT
     C     R(X)          WHENEQ    X'E0'                                        Ø
     C                   MOVE      X'7C'         R(X)
     C     R(X)          WHENEQ    X'4A'                                        Æ
     C                   MOVE      X'7B'         R(X)
     C     R(X)          WHENEQ    X'5A'                                        Å
     C                   MOVE      X'7D'         R(X)
     C     R(X)          WHENEQ    X'BB'                                        ø
     C                   MOVE      X'6A'         R(X)
     C*    R(X)          WHENEQ    X'7B'
     C*                  MOVE      X'C0'         R(X)
     C     R(X)          WHENEQ    X'47'                                        æ
     C                   MOVE      X'D0'         R(X)
     C                   ENDSL
     C                   ENDDO
     OEDI85F    D    01
     O                       RDATA               80
