     FEDIRE     IF   E           K DISK
     FEDIRE2    O  A E           K DISK    PREFIX(Z_)
     F                                     RENAME(EDIRER:EDIRER2)
      *____________________
      * DS for input string
      *""""""""""""""""""""
     D                 DS
     D  A                      1     80
     D                                     DIM(80)                              Input string
     D  ADS                    1     80
      *_____________________
      * DS for output string
      *"""""""""""""""""""""
     D                 DS
     D  B                      1     80
     D                                     DIM(80)                              Output string
     D  Z_RDATA                1     80
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    WMBR             10
      *__________________
      * Define Workfields
      *""""""""""""""""""
     C                   Z-ADD     0             AX                2 0          Index for A
     C                   Z-ADD     1             BX                2 0          Index for B
     C                   Z-ADD     0             AXV               2 0          Leftindx A
     C                   Z-ADD     0             AXH               2 0          Rightindx A
     C                   MOVE      *BLANKS       WCHAR             1            Test character
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SRB                                                  SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
     C     WMBR          SETLL     EDIRE
     C     WMBR          READE     EDIRE                                  51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     RDATA         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     80            AXH
     C                   EXSR      SRÅ
      *
     C     WMBR          READE     EDIRE                                  51
     C  N51              END
      *
     C     BX            IFGT      1
     C     Z_RDATA       ANDNE     *BLANKS
     C                   WRITE     EDIRER2
     C                   ENDIF
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV
     C                   MOVE      A(AXV)        WCHAR
      * Move to output string
     C     WCHAR         IFGE      *BLANKS
     C                   MOVE      WCHAR         B(BX)
     C                   ADD       1             BX
     C                   ENDIF
      * If arrayindex for output array is over 80 Then add a record
     C     BX            IFGT      80
     C                   WRITE     EDIRER2
     C                   Z-ADD     1             BX
     C                   MOVE      *BLANKS       Z_RDATA
     C                   ENDIF
      *
     C                   ENDDO
      *
     C                   ENDSR
