********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 konverterer odde mottatte tegn
********************************************************************
     FEDI85F1K  IF   E             DISK
     F                                     RENAME(EDIRER:EDI85FR)
     FEDIC      UF   E             DISK
     FEDIRE1K   O  A E             DISK
     D                 DS
     D  WMBR                   1     10
     D  WMBRA                  1      1
     D  WMBRB                  2     10S 0
N01   * konv " far hex 34
N01  D AEF             c                   x'9E'
N01  D AET             c                   x'7B'
N01  D OEF             c                   x'E0'
N01  D OET             c                   x'7C'
N01  D AAF             c                   x'9F'
N01  D AAT             c                   x'5B'
     C     *ENTRY        PLIST
     C                   PARM                    REMBR
      * Lage komponentnavn
     C     1             CHAIN     EDIC
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
     C                   EVAL      WMBRA='K'
     C                   EVAL      WMBRB=CSN
     C                   EVAL      REMBR=WMBR

     C                   READ      EDI85F1K                               51
     C     *IN51         DOWEQ     '0'
N01  C     AEF:AET       XLATE     RDATA         RDATA
N01  C     OEF:OET       XLATE     RDATA         RDATA
N01  C     AAF:AAT       XLATE     RDATA         RDATA
     C                   WRITE     EDIRER

     C                   READ      EDI85F1K                               51
     C  N51              ENDDO

     C                   MOVE      '1'           *INLR
