     FEDII      IF   E           K DISK
     FEDIS3     UF   E           K DISK
     FLOGL05    IF   E           K DISK
     D                 DS
     D  SSNZ                   1      9  0
      * Definiere Workfelt
      *
     C     'B'           SETLL     EDIS3
     C     'B'           READE     EDIS3                                  51
     C     *IN51         DOWEQ     *OFF
     C     S0010         CHAIN     EDII                               51
      *
     C     *IN51         IFEQ      '0'
     C     INNETW        IFEQ      '7'
     C                   Z-ADD     SSN           SSNZ
     C                   MOVEL     SSNZ          REF12            12
     C     REF12         CHAIN     LOGL05                             52
     C     *IN52         IFEQ      *OFF
     C     LGSTAT        IFGE      'F'
     C                   MOVE      'C'           SST
     C                   UPDATE    EDISR
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C     'B'           READE     EDIS3                                  51
     C                   ENDDO
      *
      * SJEKKER OGSÅ STATUS A I TILFELLE TIDLIFERE FEIL
      *
     C     'A'           SETLL     EDIS3
     C     'A'           READE     EDIS3                                  51
     C     *IN51         DOWEQ     *OFF
     C     S0010         CHAIN     EDII                               51
      *
     C     *IN51         IFEQ      '0'
     C     INNETW        IFEQ      '7'
     C                   Z-ADD     SSN           SSNZ
     C                   MOVEL     SSNZ          REF12            12
     C     REF12         CHAIN     LOGL05                             52
     C     *IN52         IFEQ      *OFF
     C     LGSTAT        IFGE      'F'
     C                   MOVE      'C'           SST
     C                   UPDATE    EDISR
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C     'A'           READE     EDIS3                                  51
     C                   ENDDO
      *
      *
     C     SLUTT         TAG
     C                   RETURN
