     C                   EVAL      FilNam='/trond/3170_KD_SV.tot'
     C                   CALL      'EDI10R6I1Y'
     C                   parm                    FilNam          256
     C                   EVAL      *INLR=*ON
