     FEDI85F    IF   E             DISK
     F                                     RENAME(EDIRER:EDI85FR)
     FEDIC      UF   E             DISK
     FEDIRE     O  A E             DISK
     D                 DS
     D  WMBR                   1     10
     D  WMBRA                  1      1
     D  WMBRB                  2     10S 0
     C     *ENTRY        PLIST
     C                   PARM                    REMBR
      * Lage komponentnavn
     C     1             CHAIN     EDIC
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
     C                   EVAL      WMBRA='R'
     C                   EVAL      WMBRB=CSN
     C                   EVAL      REMBR=WMBR

     C                   READ      EDI85F                                 51
     C     *IN51         DOWEQ     '0'

     C                   WRITE     EDIRER

     C                   READ      EDI85F                                 51
     C  N51              ENDDO

     C                   MOVE      '1'           *INLR
