     FEDIS      UF   E           K DISK
     FEDIS4     IF   E           K DISK
     F                                     RENAME(EDISR:EDISR4)
     FEDIM6     IF   E           K DISK
     FEDISSS    UF   E           K DISK
     FEDISOLD   O  A E             DISK
     F                                     RENAME(EDISR:EDISROLD)
     FEDIMOLD   O  A E             DISK
     F                                     RENAME(EDIMR:EDIMROLD)
     C     *ENTRY        PLIST
     C                   PARM                    WMBR             10
     C                   PARM                    WOLIB            10

     C     WMBR          SETLL     EDIS4
     C     WMBR          READE     EDIS4                                  51

     C     *IN51         DOWEQ     '0'

     C     SSN           CHAIN     EDIS                               52
     C     *IN52         IFEQ      '0'
     C                   MOVE      WOLIB         SLIB
     C                   UPDATE    EDISR
     C                   WRITE     EDISROLD
     C     SSN           SETLL     EDIM6
     C     STEDIM        TAG
     C     SSN           READE     EDIM6                                  52
     C     *IN52         IFEQ      '0'
     C                   WRITE     EDIMROLD
     C                   GOTO      STEDIM
     C                   END

     C                   MOVE      *OFF          *IN52
     C     SSN           SETLL     EDISSS
     C     SSN           READE     EDISSS                                 52
     C     *IN52         DOWEQ     '0'
     C                   DELETE    EDISSSR
     C     SSN           READE     EDISSS                                 52
     C                   ENDDO

     C                   END

     C     WMBR          READE     EDIS4                                  51
     C  N51              END

     C                   MOVE      '1'           *INLR
