********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10013 * 01 CB  PTF10 EDISSS endret
********************************************************************
     FEDI43D    CF   E             WORKSTN
     F                                     SFILE(EDI43DB:ZRECNO)
     FEDISSS    IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    SSSSN         SSSN
N01  C     *LIKE         DEFINE    SSSDT         WDT
N01  C     *LIKE         DEFINE    SSSTM         WTM
N01   *_________________
N01   * Input parametrer
N01   *"""""""""""""""""
N01  C     KEYEDISSS     KLIST
N01  C                   KFLD                    SSSN
N01  C                   KFLD                    WDT
N01  C                   KFLD                    WTM
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    SSSN
N01  C                   PARM                    UDT               8
N01  C                   PARM                    UTM               6
N01  C                   MOVE      UDT           WDT
N01  C                   MOVE      UTM           WTM
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *______________
      * Tømme Subfile
      *""""""""""""""
     C                   MOVE      '1'           *IN93
     C                   WRITE     EDI43DC
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZERO         ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
S01  C*    SSSN          SETLL     EDISSS
N01  C     KEYEDISSS     SETLL     EDISSS
S01  C*    SSSN          READE     EDISSS                                 94
N01  C     KEYEDISSS     READE     EDISSS                                 94
     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   MOVEL     SSSDATA       WDATA
     C                   WRITE     EDI43DB
      *
S01  C*    SSSN          READE     EDISSS                                 94
N01  C     KEYEDISSS     READE     EDISSS                                 94
     C  N94              ENDDO
     C     ZRECNO        IFEQ      0
     C                   ADD       1             ZRECNO
     C                   WRITE     EDI43DB
     C                   ENDIF
     C                   Z-ADD     1             ZRECNO
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C     SRB5          TAG

     C                   MOVEA     '11'          *IN(91)
     C                   MOVE      'SY00000'     ZMSGNO
     C                   WRITE     EDI43DØ
     C                   WRITE     EDI43DD
     C                   EXFMT     EDI43DC

     C     SRB9          ENDSR
