     FEDII      IF   E           K DISK
      * Input parametrer
     C     *ENTRY        PLIST
     C                   PARM                    WINID            35
     C                   PARM                    INIFSS           64
     C                   PARM                    INCODPAG          9
     C                   PARM                    INENDLIN          6
      * Find combination, return result.
     C     WINID         CHAIN     EDII                               51
      *
     C                   EVAL      *INLR=*ON
