     FEDI67D    CF   E             WORKSTN
     FEDIM      UF   E           K DISK
     FEDIS      IF   E           K DISK
     FEUNH      IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    MSN           WSN
     C     *LIKE         DEFINE    MMN           WMN
     C     *LIKE         DEFINE    *IN03         WIN03
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WMN
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WMN           PARM                    WMN
     C                   PARM                    WUPD              1            Y=YES
     C                   PARM      *IN03         WIN03
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Vise hele meldingsloggen.                            SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   MOVE      'SY00000'     ZMSGNO
     C                   WRITE     EDI67DØ
     C     WUPD          IFEQ      'Y'
     C                   MOVE      '1'           *IN41
     C     KEYA          CHAIN     EDIM                               51
     C                   ELSE
     C     KEYA          CHAIN(N)  EDIM                               51
     C                   MOVE      '0'           *IN41
     C                   ENDIF
     C     KEYA          CHAIN     EUNH                               51
     C     MSN           CHAIN     EDIS                               51
     C     SRB1          TAG
     C                   MOVEA     '00'          *IN(25)
     C                   EXFMT     EDI67DA
     C     WUPD          IFEQ      'Y'
     C                   UPDATE    EDIMR
     C                   ENDIF
      *
     C     SRB9          ENDSR
