     FEDIM      UP   E             DISK
     D                 DS
     D  X68                    1     33
     D  X68A                   1      8
     D  X68B                   9     33
     D                 DS
     D  Y68                    1     35
     D  Y68A                   1      8
     D  Y68C                   9     10
     D  Y68B                  11     35
     C     M0068A        IFNE      0
     C                   MOVEL     M0068         X68
     C                   MOVE      X68A          Y68A
     C                   MOVE      '19'          Y68C
     C                   MOVE      X68B          Y68B
     C                   MOVE      Y68           M0068
     C                   MOVEL     19            M0068A
     C     M0068D        IFNE      0
     C                   MOVEL     19            M0068D
     C                   END
     C     M2005B        IFNE      0
     C                   MOVEL     19            M2005B
     C                   END
     C                   END
     C                   MOVEL     19            MDT
     C                   UPDATE    EDIMR
