     FEDIS3     UF   E           K DISK
      *
     C     *LIKE         DEFINE    SST           WST
     C                   MOVEL     'A'           WST
      * Status A ---- D
     C     WST           SETLL     EDIS3
     C     WST           READE     EDIS3                                  52
     C     *IN52         DOWEQ     '0'
     C     SSR           IFEQ      'S'
     C                   MOVE      'D'           SST
     C                   UPDATE    EDISR
     C                   ENDIF
      *
     C     WST           READE     EDIS3                                  52
     C  N52              ENDDO
      * Status E ---- D
     C                   EVAL      *IN52=*OFF
     C                   MOVEL     'E'           WST
     C     WST           SETLL     EDIS3
     C     WST           READE     EDIS3                                  52
     C     *IN52         DOWEQ     '0'
     C     SSR           IFEQ      'S'
     C                   MOVE      'D'           SST
     C                   UPDATE    EDISR
     C                   ENDIF
      *
     C     WST           READE     EDIS3                                  52
     C  N52              ENDDO
      *
     C                   MOVE      '1'           *INLR
