********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 OPPDATER PROGRAMNAVN OG TIDSTEMPEL
11XXX * 02 CB  PTF11 Retting av ptf 01
********************************************************************
     FEDISX2    UF A E           K DISK
N01  D Tstampz         S               Z
N01  D Tstampa         S             26
     C     *ENTRY        PLIST
     C                   PARM                    WSXWORKM         10
     C                   PARM                    WSXBACKM         10
      * Skriv til X-ref fil for filnavn/katalognavn
     C     WSXWORKM      CHAIN     EDISX2                             51
     C                   IF        *IN51=*OFF
     C                   EVAL      SXBACKM = WSXBACKM
     C                   UPDATE    EDISXR
     C                   ELSE
N01  C                   TIME                    Tstampz
N01  C                   MOVEL     Tstampz       Tstampa
S02  C*                  EVAL      SXIFSOBJ= 'EDISX1 ' + %TRIM(Tstampa)
     C                   EVAL      SXWORKM = WSXWORKM
     C                   EVAL      SXBACKM = WSXBACKM
     C                   WRITE     EDISXR
     C                   ENDIF

     C                   EVAL      *INLR=*ON
