********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 OPPDATER PROGRAMNAVN OG TIDSTEMPEL
********************************************************************
     FEDISX2    UF A E           K DISK
N01  D Tstampz         S               Z
N01  D Tstampa         S             26
     C     *ENTRY        PLIST
     C                   PARM                    WSXWORKM         10
     C                   PARM                    WSXPRODM         10
      * Skriv til X-ref fil for filnavn/katalognavn
     C     WSXWORKM      CHAIN     EDISX2                             51
     C                   IF        *IN51=*OFF
     C     SXPRODM       IFEQ      *BLANKS
     C                   EVAL      SXPRODM = WSXPRODM
     C                   UPDATE    EDISXR
     C                   ELSE
N01  C                   TIME                    Tstampz
N01  C                   MOVEL     Tstampz       Tstampa
N01  C                   EVAL      SXIFSOBJ= %TRIM(SXIFSOBJ)
N01  C                             + ' EDISX2 ' + %TRIM(Tstampa)
     C                   EVAL      SXPRODM = WSXPRODM
     C                   WRITE     EDISXR
     C                   ENDIF
     C                   ENDIF

     C                   EVAL      *INLR=*ON
