********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
      *
     FFIRMARC   IF   E             DISK
     Farklogh   O  A E             DISK
     Farklogd   O  A E             DISK
     Farklogt   UF a E           K DISK
     D                 DS
     D  XULTID                 1     14  0
     D  eptime                 1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D  XULDDMM                7     10  0
     D  XUL≈≈2                13     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  epdate                 1      8  0
     D                SDS
     D  UUSER                254    263
     C     *ENTRY        PLIST
     C                   PARM                    DATA2            40
     C                   PARM                    DATA3            40
     C                   PARM                    DATA4            40
     C                   PARM                    DATA5            40
     C                   PARM                    DATA6            40
     C                   PARM                    DATA7            40
     C                   PARM                    DATA8            40
     C                   PARM                    epcove           70
     C                   PARM                    eptil            70
     C                   PARM                    epauto            1
     C                   PARM                    uuunik            9
     C                   PARM                    bane             37
     c                   parm                    ukunde            8
      *
      * henter dato klokka
      *
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     c                   move      uuser         epuser
      *
     C                   READ      FIRMARC                                33
      *
      * henter neste teller
      *
     c                   move      'A'           eptelk
     c     keytel        klist
     c                   kfld                    eptelk
     c     keytel        chain     arklogt                            33
     c                   add       1             epunik
     c  N33              update    arklogtr
     c   33              write     arklogtr
      *,
     c                   move      epunik        uuunik
      *
      * skriver f¯rste loggpost
      *
     c                   move      ukunde        epkund
     c                   movel     epcove        EPDATA
     c                   write     arkloghr
     c                   write     arklogdr
      *
     c                   move      *blanks       EPDATA
     C     DATA2         IFNE      *BLANKS
     C                   MOVEL     DATA2         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA3         IFNE      *BLANKS
     C                   MOVEL     DATA3         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA4         IFNE      *BLANKS
     C                   MOVEL     DATA4         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA5         IFNE      *BLANKS
     C                   MOVEL     DATA5         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA6         IFNE      *BLANKS
     C                   MOVEL     DATA6         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA7         IFNE      *BLANKS
     C                   MOVEL     DATA7         EPDATA
     c                   write     arklogdr
     C                   END
     C     DATA8         IFNE      *BLANKS
     C                   MOVEL     DATA8         EPDATA
     c                   write     arklogdr
     C                   END
     C                   EVAL      EPDATA = 'attachment'
     c                   write     arklogdr
     C                   EVAL      EPDATA = BANE
     c                   write     arklogdr
     C                   SETON                                        LR
     C                   RETURN
