     FDISTL     IF   E           K DISK
     D D               S             50    DIM(20)
     C     *ENTRY        PLIST
     C                   PARM                    UDIST             6
     C                   PARM                    DIST01           50
     C                   PARM                    DIST02           50
     C                   PARM                    DIST03           50
     C                   PARM                    DIST04           50
     C                   PARM                    DIST05           50
     C                   PARM                    DIST06           50
     C                   PARM                    DIST07           50
     C                   PARM                    DIST08           50
     C                   PARM                    DIST09           50
     C                   PARM                    DIST10           50
     C                   PARM                    DIST11           50
     C                   PARM                    DIST12           50
     C                   PARM                    DIST13           50
     C                   PARM                    DIST14           50
     C                   PARM                    DIST15           50
     C                   PARM                    DIST16           50
     C                   PARM                    DIST17           50
     C                   PARM                    DIST18           50
     C                   PARM                    DIST19           50
     C                   PARM                    DIST20           50
     C     UDIST         SETLL     DISTL
     C     1             DO        20            NR                3 0
     C  N33UDIST         READE     DISTL                                  33
     C  N33              MOVEL     DISEPO        D(NR)
     C   33              MOVEL     '*NONE'       D(NR)
     C                   END
     C                   MOVE      D(1)          DIST01
     C                   MOVE      D(2)          DIST02
     C                   MOVE      D(3)          DIST03
     C                   MOVE      D(4)          DIST04
     C                   MOVE      D(5)          DIST05
     C                   MOVE      D(6)          DIST06
     C                   MOVE      D(7)          DIST07
     C                   MOVE      D(8)          DIST08
     C                   MOVE      D(9)          DIST09
     C                   MOVE      D(10)         DIST10
     C                   MOVE      D(11)         DIST11
     C                   MOVE      D(12)         DIST12
     C                   MOVE      D(13)         DIST13
     C                   MOVE      D(14)         DIST14
     C                   MOVE      D(15)         DIST15
     C                   MOVE      D(16)         DIST16
     C                   MOVE      D(17)         DIST17
     C                   MOVE      D(18)         DIST18
     C                   MOVE      D(19)         DIST19
     C                   MOVE      D(20)         DIST20
     C                   SETON                                        LR
     C                   RETURN
