     FEPOL      UP   E             DISK
     C                   eval      ELSTA = ELSTA2
     c     ELSTA2        ifne      *blanks
     C                   eval      ELSTA2= 'S'                                  Sendes
     c     ELREAS        ifne      *blanks
     C                   eval      ELSTA3= 'R'                                  Reason er endret
     c                   endif
     c                   else
     C                   eval      ELSTA2= ' '
     c                   endif
     C                   UPDATE    EPOLR
