     FEPOH      IF   E           K DISK
     FEPOL      IF   E           K DISK
     FEPOK      UF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FVADR3     IF   E           K DISK
     FEPOMS04DP O    E             PRINTER
      * konvertering særtegn til OKTegn
     D SÆRT            C                   CONST('ÆØÅæøå')
     D OKT             C                   CONST('EOAeoa')
     D                 DS
     D  ELABES                 1     50
     D  ELABES_30              1     30
     D  ELABES_20             31     50
     D                 DS
     D  VADRNA                 1     30
     D  VADRNA2                1     30
      *
     C                   EXSR      SRINIT
      *
      * Loop number of pieces
     C                   Z-ADD     1             WPCN              5 0
     C     EPOLK         SETLL     EPOK
     C                   Z-ADD     ELNTKL        XN05              5 0
     C     WPCN          DO        XN05          WPCN
      *
     C                   EXSR      SR0001K
      *
     C                   eval      KLLTXT   = %trim(%editc(WPCN:'Z'))
     C                             +' AV '+%trim(%editc(XN05:'Z'))
     C                   eval      KOID21   = X'8F'+'00'+EKMRK
     C                   eval      HRI_koid = '(00)'+EKMRK
     C                   eval      KOID14   = ELARTE
     C     ELARTE        COMP      *BLANKS                            2828
     C                   write     LABEL
      *
     C                   ENDDO
CC    *
CC   C                   CALL      'CC023C'
CC   C                   PARM                    WKN
CC   C                   PARM                    WBES
CC   C                   PARM                    WLIN
CC   C                   PARM                    WULIN
      *
     C                   seton                                        LR
     C                   RETURN
      *
      *_____________________________________________________
      * Execute Label Init copyprint
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0001K       BEGSR
      *
     C     EPOLK         READE     EPOK                                   33
     C                   IF        *IN33 = *OFF
     C                   MOVE      'P'           EKST
     C                   MOVE      WDT           EKDTPR
     C                   MOVE      WUSR          EKUSR
     C                   UPDATE    EPOKR
     C                   END
      *
     C                   ENDSR
      *_____________________________________________________
      * Initialise subroutine, set character set
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRINIT        BEGSR
      *
      * Input Parameter
     C     *ENTRY        PLIST
     C                   PARM                    WUSR             10
     C                   PARM                    WFIRM             2
     C                   PARM                    WMLAYO            2
     C                   PARM                    WKN               8
     C                   PARM                    WBES             10
     C                   PARM                    WLIN              7
     C                   PARM                    WULIN             5
     C                   PARM                    uukopi            1
      * Define workfields
     C     EPOHK         KLIST
     C                   KFLD                    EHKUND
     C                   KFLD                    EHBES
     C     EPOLK         KLIST
     C                   KFLD                    EHKUND
     C                   KFLD                    EHBES
     C                   KFLD                    ELLIN
     C                   KFLD                    ELULIN
     C     CUNDL01K      KLIST
     C                   KFLD                    WFIRM
     C                   KFLD                    EHKUND
     C     VADR3K        KLIST
     C                   KFLD                    WFIRM
     C                   KFLD                    EHKUND
     C                   KFLD                    VAKURE
      *
     C                   MOVE      WKN           EHKUND
     C                   MOVE      WBES          EHBES
     C     EPOHK         CHAIN     EPOH                               33
     C     CUNDL01K      CHAIN     CUNDL01                            33
     C                   EVAL      VAKURE = EHINV
     C     VADR3K        CHAIN     VADR3                              33
     C                   MOVE      WLIN          ELLIN
     C                   MOVE      WULIN         ELULIN
     C     EPOLK         CHAIN     EPOL                               33
     C                   EVAL(H)   XVEKT = ELVKTL * ELNTSL / ELNTKL
     C                   EVAL(H)   XM3   = ELM3E  * ELNTSL / ELNTKL
      *
     c     SÆRT:OKT      XLATE     KNAVN         KNAVN
     c     SÆRT:OKT      XLATE     ADR1          ADR1
     c     SÆRT:OKT      XLATE     EHLNAV        EHLNAV
     c     SÆRT:OKT      XLATE     EHLAD1        EHLAD1
     c     SÆRT:OKT      XLATE     EHLAD2        EHLAD2
     c     SÆRT:OKT      XLATE     EHLAD3        EHLAD3
     c     SÆRT:OKT      XLATE     EHLAD4        EHLAD4
     c     SÆRT:OKT      XLATE     VADRNA        VADRNA
     c     SÆRT:OKT      XLATE     VADRN1        VADRN1
     c     SÆRT:OKT      XLATE     VADRN2        VADRN2
     c     SÆRT:OKT      XLATE     VADRN3        VADRN3
     c     SÆRT:OKT      XLATE     ELART         ELART
     c     SÆRT:OKT      XLATE     ELARTL        ELARTL
     c     SÆRT:OKT      XLATE     ELABES_30     ELABES_30
     c     SÆRT:OKT      XLATE     ELABES_20     ELABES_20
     c     SÆRT:OKT      XLATE     ELCONT        ELCONT
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDATO
     C                   MOVEL     WTM           WTID4
      *
     C                   ENDSR
      *
