     FEPOL03    UF   E           K DISK
     FEPOH      UF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EVAL      *INLR=*ON
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C     *LIKE         DEFINE    ELSTA2        WELSTA2
     C     *LIKE         DEFINE    ELKUND        WELKUND
     C                   EVAL      WELSTA2='S'
     C                   EVAL      WELKUND=21647
     C     EPOLKEY       KLIST
     C                   KFLD                    WELSTA2
     C                   KFLD                    WELKUND
     C     EPOHKEY       KLIST
     C                   KFLD                    ELKUND
     C                   KFLD                    ELBES
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Les linjer                                           SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     EPOLKEY       SETLL     EPOL03
     C     EPOLKEY       READE     EPOL03                                 51
     C                   DOW       *IN51 = *OFF
      * 1=contacted(->01) 15=Ready for stuffing(->02)  (2=booked/3Confirmed/4shipped sendes ikke)
      * fra shipped og opp vil de ha statusene i form av ASN(DESADV)-kall rett fra tur uavh av EHSTA
     C*                  if        ELSTA>='4'
     C                   if        ELSTA>='2'
     c                   move      ' '           ELSTA2
     C                   UPDATE    EPOLR
     C                   else
     C     EPOHKEY       CHAIN     EPOH                               52
     C                   IF        *IN52 = *OFF
     C                   EVAL      EHSTA2='S'
     C                   UPDATE    EPOHR
     C                   ENDIF

     C                   endif
     C     EPOLKEY       READE     EPOL03                                 51
     C                   ENDDO
     C                   ENDSR
