********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 henter nå dire via brukerprofil
10XXX * 02 YBC PTF10 TØM INTADR
********************************************************************
      *
      ***********************************************************
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
N01  FQAOKL02A  IF   E           K DISK
     FQATMSMTPA IF   E           K DISK
     C*
     C     *ENTRY        PLIST
N01  C                   PARM                    USERP            10
     C                   PARM                    DIRENA            8
     C                   PARM                    DIREAD            8
     C                   PARM                    INTADR           50
     C*
N01  C     KEY0          KLIST
     C                   KFLD                    USERP
     C     KEY           KLIST
     C                   KFLD                    DIRENA            8
     C                   KFLD                    DIREAD            8
s01  C*    KEY2          KLIST
s01  C*                  KFLD                    DIRENA
N01  C     KEY0          chain     QAOKL02A                           33
N01  C     *in33         ifeq      '0'
N01  c                   move      WOS1DDEN      DIRENA
N01  c                   move      WOS1DDGN      DIREAD
      *
     C     KEY           CHAIN     QATMSMTPA                          34
s01  C*  34KEY2          CHAIN     QATMSMTPA                          34
     C     *IN34         IFEQ      '0'
S02  C*    INTADR        CAT       SMTPUID:0     INTADR
S02  C*    INTADR        CAT       '@':0         INTADR
S02  C*    INTADR        CAT       DOMROUTE:0    INTADR
N02  C                   EVAL      INTADR = %TRIM(SMTPUID)
N02  C                             + '@' + %TRIM(DOMROUTE)
     C                   END
     C                   END
     C                   SETON                                        LR
     C                   RETURN
