********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
      ***********************************************************
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FQAOKL27A  IF   E           K DISK
     FEPOSRPL   IF   E           K DISK
     FQATMSMTPA IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    USER             10
     C                   PARM                    DIRENA            8
     C                   PARM                    DIREAD            8
     C                   PARM                    INTADR           70
     C                   PARM                    NAVNF            30
     C                   MOVE      USER          USERI            10
     C     USER          CHAIN     EPOSRPL                            33
     C     *IN33         IFEQ      '0'
     C                   MOVE      DIRNAM        DIRENA
     C                   MOVE      DIRADR        DIREAD
     C                   END
     C*
     C     KEY           KLIST
     C                   KFLD                    DIRENA
     C                   KFLD                    DIREAD
     C     KEY2          KLIST
     C                   KFLD                    DIRENA
     C     KEY           CHAIN     QATMSMTPA                          34
     C   34KEY2          CHAIN     QATMSMTPA                          34
     c   34              movel     useri         direna
     C   34KEY2          CHAIN     QATMSMTPA                          34
     C     *IN34         IFEQ      '0'
N01  C                   MOVEL     ADDRESS       DIREAD
     C     INTADR        CAT       SMTPUID:0     INTADR
     C     INTADR        CAT       '@':0         INTADR
     C     INTADR        CAT       DOMROUTE:0    INTADR
     C                   END
     c     key2          chain     QAOKL27A                           33
     c  N33              eval      navnf=WOS3DESC
     c   33              eval      navnf=direna
     C                   SETON                                        LR
     C                   RETURN
