      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/ESARSA1 MODULE(*LIBL/ESARSA1
CRTPGM*        *LIBL/CHECKUSR *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     UF   E           K DISK    USROPN
     Fsadh5b    IF   E           K DISK    usropn
     FFIRMARC   IF   E           K DISK    usropn
     FARKIVL03  IF   E           K DISK    usropn
      *--------------------------------------------------------------------
      * Prototype defintions and standard system API error structure
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      *--------------------------------------------------------------------
      * Variables common to CGI programs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
     D IfsMultIndicators...
     d                 ds
     D  NoErrors                       n
     D  NameTooLong                    n
     D  NotAccessible                  n
     D  NoFilesUsable                  n
     D  DupSections                    n
     D  FileIsEmpty                    n
      *
      * Variables received from the input string
     D lng             s              2
     D BckGnd          s             10
     D lstbrd          s              1
     D WSUSER          s             10
     D UsrSpcName      s             10
     D LNR             s             10
     D EKS             s              6
     D ArGod           s             40
     D ANTSND          s              5  0
     D MaxSN           s              5
     D MaxSND          s              5  0
     D ANTRCD          s              5  0
     D MaxRC           s              5
     D MaxRCD          s              5  0
     D PGM             C                   CONST('SYSPED/CHECKUSR')
      * For xlate mellom Upper Case og Lower Case
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
      *
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================******
      * MAIN PROCESS LINE
      *=====================================================================******
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input
     C                   exsr      Parse
      *
     C                   EXSR      INIT
      *
      * Set output skeleton html member name
     C                   exsr      LoadHtml
      *
      * 1-Section /$top
     C                   exsr      SetTop
     C                   callp     wrtsection('stdtop')
     C                   callp     wrtsection('top')
      *
     C                   Move      *zeros        AntSnd
     C                   Move      *zeros        AntRcd
     C     MaxSnd        IFEQ      *ZEROS
     C                   Z-add     1000          MaxSnd
     C                   END
     C     MaxRcd        IFEQ      *ZEROS
     C                   Z-add     5000          MaxRcd
     C                   END
      *
     C     LNR           SETLL     sadh5b
     C     STHENTOPD     TAG
     c                   Read      sadh5b                                 50
      *
     C                   IF        *IN50 = *OFF
     C                   Add       1             AntRcd
     C     AntRcd        CabGe     MaxRcd        SLHENTOPD
     C                   EXSR      RecordSlt
     C                   IF        selected = 'Y'
     C                   EXSR      SETROW
     C                   callp     wrtsection('row')
     C                   Add       1             AntSnd
     C     AntSnd        CabGe     MaxSnd        SLHENTOPD
     C                   END
     C                   GOTO      STHENTOPD
     C                   END
      *
     C     SLHENTOPD     TAG
     C                   callp     wrtsection('tableend')
     C                   callp     updHTMLvar('ANTSND':
     C                             %trim(%editc(ANTSND:'3')))
     C                   callp     updHTMLvar('MaxSnd':
     C                             %trim(%editc(MaxSnd:'3')))
     C                   callp     updHTMLvar('ANTRCD':
     C                             %trim(%editc(ANTRCD:'3')))
     C                   callp     updHTMLvar('MaxRcd':
     C                             %trim(%editc(MaxRcd:'3')))
     C                   callp     updhtmlvar('runtime':
     C                             %trim(%editw(sec:'     0 .   ')))
      *
     C                   callp     wrtsection('bot')
     C                   callp     wrtsection('stdbot')
     C                   callp     wrtsection('*fini')
     C     SLUTT         tag
     C                   EXSR      EXIT
     C                   return
      *
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   eval      lng     = zhbgetvar('lng')
     C                   eval      BckGnd  = zhbgetvar('bckgnd')
     C                   eval      lstbrd  = zhbgetvar('lstbrd')
     C                   eval      WSUSER  = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   eval      LNR      = zhbgetvar('LNR')
     C                   eval      EKS      = zhbgetvar('EKS')
      *
     C                   endsr
      *
      *=====================================================================******
      *  Set output variables for section /$top
      *  (search criteria)
      *=====================================================================******
     C     SetTop        begsr
      *
     C                   callp     updHTMLvar('USER':WSUSER)
     C                   callp     updHTMLvar('WSNA':BIBESK)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updHtmlVar('KUNDE':
     C                             %trim(%editc(BIKUNR:'Z')))
     C                   callp     updHTMLvar('KNAVN':KNAVN)
      * Søkeparam
     C                   callp     updHTMLvar('LNR':LNR)
     C                   callp     updHTMLvar('EKS':EKS)
      * KUNDE
     C                   callp     updhtmlvar('TITLE':'Søk arkiverte fortolling-
     C                             er')
     C                   callp     updHTMLvar('sdato':
     C                             %trim(%editw(BIDTV:'    .  .  ')))
     C                   callp     updHTMLvar('stid':
     C                             %trim(%editw(BITIDV:'  .  .  ')))
      *
     C                   endsr
      *
      *=====================================================================******
      *  Set output variables for section /$tablerow (table row)
      *=====================================================================******
     C     SetRow        begsr
     C                   callp     updHTMLvar('XEKS':SITLE)
     C                   callp     updHTMLvar('XLNR':SITLL)
     C                   callp     updHTMLvar('XDATE':
     C                             %trim(%editw(ARDATE:'    .  .  ')))
     C                   callp     updHTMLvar('XAVD':
     C                             %trim(%editc(SIAVD:'Z')))
     C                   callp     updHTMLvar('XOPD':
     C                             %trim(%editc(SITDN:'Z')))
     C                   callp     updHTMLvar('XMOT':SINAK)
     C                   exsr      LagPDFURL
     C                   callp     updHTMLvar('UPDF':UPDF)
      *
      * 2.side / tillegsark ???
     C                   Move      'sj'          ARTYPE
     C     ArkKey        chain     Arkivl03                           33
     C                   Move      'sk'          ARTYPE
     C   33ArkKey        chain     Arkivl03                           33
     C                   move      *blanks       UPDF
     c     *in33         Ifeq      *off
     C                   exsr      LagPDFURL
     c                   end
     C                   callp     updHTMLvar('UPDF2':UPDF)
      *
     C                   endsr
      *
      *=====================================================================******
      * Set html output skeleton member before its read into memory
      *=====================================================================******
     C     LoadHtml      begsr
cccccC                   eval      IfsMultIndicators = gethtmlifsmult(
cccccC                             '/syspeddev/html/Header/eSpedTop.html -
cccccC                             /syspeddev/html/ESARSA1.html -
cccccC                             /syspeddev/html/Footer/eSpedBot.html':
cccccC                             '/CGITAG/')
      *
     C                   endsr
      *=====================================================================******
     C*  Select a Recd
      *=====================================================================******
     C     RecordSlt     BEGSR
     C                   move      'N'           selected          1
      *
     c                   Move      'si'          ARTYPE
     C     ArkKey        chain     Arkivl03                           33
     C     *in33         CABeq     '1'           slrecslt
      * Norcargo spørring på A12-speditøren, kun avd 10.
     c     wsuser        ifeq      'NCA12'
     C     Siavd         CABne     10            slrecslt
     c                   else
     C     SIKNK         CABne     BIKUNR        slrecslt
     c                   end
     C     EKS           ifne      *blanks
     C     EKS           andne     SITLE
     C                   end
      *  Recd is selected
     C                   move      'Y'           selected
      *
     C     slrecslt      ENDSR
      *
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN(N)  BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
      *
     C                   EXSR      TSTUSER
      *
      * hent Parametre som går igjen i mange prog:
      *      Odd/Even/Rowhead-farger,Logobilde,Språk,Intern/Ekstern bruker,  mm
     c                   call      'ESGETPAR'
     c                   parm                    BIBRID
     c                   parm                    BIFIRM
     c                   parm                    BIKUNR
     c                   parm                    BIKNG
     c                   parm                    RowHead          10
     c                   parm                    Odd              10
     c                   parm                    Even             10
     c                   parm                    LogoImg          50
     c                   parm                    XSPRÅK            2
     c                   parm                    XINTERN           1
     c                   parm                    ParmDS1        1024
     c                   parm                    ParmDS2        1024
     c                   parm                    ParmDS3        1024
      *
     C                   OPEN      sadh5b
     C                   OPEN      arkivl03
     C                   OPEN      firmarc
      *
     C     KunKey        KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    BIKUNR
     C     ArkKey        KLIST
     C                   KFLD                    ARTYPE
     C                   KFLD                    SIAVD
     C                   KFLD                    SITDN
      * Spesialvri for å kunne deme uten å avsløre kundenavn
     c                   MOVEL     WSUSER        tstjov            4
     c     tstjov        ifeq      'JOVO'
     c                   eval      KNAVN  = 'Jan Ottar Valderhaug'
     c                   movel     Bibesk        KNAVN            30
     c                   end
     c                   read      firmarc                                41
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     TSTUSER       BEGSR
      *////////////////////////////////////////////////////////////
      /copy syspeds/qrpgsrcpy,tstuser
      *
     C                   endsr
      *
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          begsr
     C                   close     BRIDF
     C                   CLOSE     sadh5b
     C                   CLOSE     firmarc
     C                   CLOSE     arkivl03
     C                   eval      *inlr = *on
      *
     C                   endsr
      *
     C***********************************************
     C     LagPDFURL     BEGSR
     C***********************************************
     C* genererer bane for lagring (0 i avd/opd ved samlefakt..)
     C                   MOVE      *ZEROS        AAVD              4
     C                   MOVE      *ZEROS        AOPD              7
     C                   move      *blanks       UPDF
     c                   movel     '<a href="'   UPDF            200
     C     UPDF          CAT       '/':0         UPDF
     C     UPDF          CAT       arcane:0      UPDF
     C     UPDF          CAT       '/':0         UPDF
     C     ARLINK        IFNE      *Blanks
     C     UPDF          CAT       ArLink:0      UPDF
     c                   else
     C     UPDF          CAT       aavd:0        UPDF
     C     UPDF          CAT       aopd:0        UPDF
     C     UPDF          CAT       artype:0      UPDF
     C     UPDF          CAT       arunde:0      UPDF
     c                   end
     C     '.pdf'        SCAN      updf                                   33
     C  N33'.PDF'        SCAN      updf                                   33
     C     *in33         ifeq      *off
     C     UPDF          CAT       '.pdf" ':0    UPDF
     C                   else
     C     UPDF          CAT       '" ':0        UPDF
     C                   end
     C                   CAT       'target="Sy':0UPDF
     C                   CAT       'PDFWind">':0 UPDF
     C     UPDF          CAT       '<img src="':0UPDF
     C     UPDF          CAT       '/syspeddev':0UPDF
     C     UPDF          CAT       '/PDF.gif">':0UPDF
     c                   endsr
