********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 GODTAR SPRAK OGSÅ  FOR   SPRÅK
********************************************************************
      ***************************************************************************
      *  Generelt program for å hente diverse standardparametre brukt ofte.     *
      *  (mer program/funksjons-spesifikke parametre hentes i det enkelte prog) *
      * ----------------------------------------------------------------------- *
      *  Paramete kan setter på USER/KUNDE/KUNDEGRP/FIRMA-nivå                  *
      *  Enkelte parametre vil naturlig nok ikke benytte alle nivåene           *
      ***************************************************************************
      *
     FBRPARF    if   e           k disk
      *
     D DftLogo         s             50a   inz('/syspeddev/systematop1.jpg')
     D DftRowHead      s             10a   inz('#B0E0E6')
     D DftOdd          s             10a   inz('#F8F8FF')
     D DftEven         s             10a   inz('#E6E6FA')
     D                 DS
     D  PAVRDA                 1     50
     D  PAVRDA_1_1             1      1
     D  DSHEAD                 1     10
     D  DSODD                 11     20
     D  DSEVEN                21     30
     D                 DS
     D  ParmDS1                1   1024
     D* Nyxxxxx..              1      2
     D* Nyyyyyy..              3     10
     D* osv
     D                 DS
     D  ParmDS2                1   1024
     D* Nyxxxxx..              1      2
     D* Nyyyyyy..              3     10
     D* osv
     D                 DS
     D  ParmDS3                1   1024
     D* Nyxxxxx..              1      2
     D* Nyyyyyy..              3     10
     D* osv
     C     *entry        Plist
     c                   parm                    UUser            10
     c                   parm                    UFirma            2
     c                   parm                    UKunde            8 0
     c                   parm                    UKuGRP            8 0
     c                   parm                    UHEAD            10
     c                   parm                    UODD             10
     c                   parm                    UEVEN            10
     c                   parm                    ULOGO            50
     c                   parm                    USPRÅK            2
     c                   parm                    UINTERN           1
     c                   parm                    UParmDS1       1024
     c                   parm                    UParmDS2       1024
     c                   parm                    UParmDS3       1024
      *
     c     UserKey       klist
     c                   kfld                    UUSER
     c                   kfld                    NULLKU            8 0
     c                   kfld                    PAID
     c     KundKey       klist
     c                   kfld                    DFTUSER          10
     c                   kfld                    UKUNDE
     c                   kfld                    PAID
     c                   Eval      DFTUSER = '*KUNDFT*'+Ufirma
     c     GrupKey       klist
     c                   kfld                    DFTUSER          10
     c                   kfld                    UKuGRP
     c                   kfld                    PAID
     c     FirmKey       klist
     c                   kfld                    DFTUSER
     c                   kfld                    NULLKU            8 0
     c                   kfld                    PAID
      *
      * 1. Farger for lister (head/odd/even) ,  på user/kunde/gruppe/firma-nivå
     c                   move      DftRowHead    UHEAD
     c                   move      DftOdd        UODD
     c                   move      DftEven       UEVEN
     C                   MOVEL     'LIHOE'       PAID
     C     UserKey       chain     BRPARF                             33
     C   33KundKey       chain     BRPARF                             33
     C   33GrupKey       chain     BRPARF                             33
     C   33FirmKey       chain     BRPARF                             33
     c     *in33         ifeq      *off
     c     DSHEAD        ifne      *Blanks
     c                   move      DSHEAD        UHEAD
     c                   end
     c     DSODD         ifne      *Blanks
     c                   move      DSODD         UODD
     c                   end
     c     DSEVEN        ifne      *Blanks
     c                   move      DSEVEN        UEVEN
     c                   end
     c                   end
      *
      * 2. Toplogo / img ,  på user/kunde/gruppe/firma-nivå
     c                   move      DftLogo       ULOGO
     C                   MOVEL     'TLOGO'       PAID
     C     UserKey       chain     BRPARF                             33
     C   33KundKey       chain     BRPARF                             33
     C   33GrupKey       chain     BRPARF                             33
     C   33FirmKey       chain     BRPARF                             33
     c     *in33         ifeq      *off
     c     PAVRDA        ifne      *Blanks
     c                   movel     PAVRDA        ULOGO
     c                   end
     c                   end
      *
      * 3. Språk  ,  KUN på user-nivå
     C                   MOVEL     'SPRÅK'       PAID
     c                   move      *blanks       USPRÅK
N01  C     NYTEST        TAG
     C     UserKey       chain     BRPARF                             33
     c     *in33         ifeq      *off
      * kun gitte koder støttet
     c     PAVRDA        Ifeq      'EN'
     c**   PAVRDA        Oreq      'XX'
     c                   movel     PAVRDA        USPRÅK
     c                   end
     c                   end
N01  C   33              IF        PAID='SPRÅK'
N01  C                   MOVEL     'SPRAK'       PAID
N01  C                   GOTO      NYTEST
N01  C                   END
      *
      * 4. Intern/ekstern bruker, kun på usernivå
     C                   MOVEL     'INTER'       PAID
     c                   move      *blanks       UINTERN
     C     UserKey       chain     BRPARF                             33
     c     *in33         ifeq      *off
      * kun gitte koder støttet
     c     PAVRDA_1_1    Ifeq      'J'
     c                   movel     'J'           UINTERN
     c                   end
     c                   end
      *
      * NYE parametre plassers i datastrukturene ParmDS1,ParmDS2,ParmDS3
      * 5.......
      *
      *
      *
      *
      * Legg DS-parametre over i variabel for returparameter
     c                   move      ParmDS1       UParmDS1
     c                   move      ParmDS2       UParmDS2
     c                   move      ParmDS3       UParmDS3
      *
     c                   move      *on           *INLR
     c                   return
