      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/ESOP11HM MODULE(*LIBL/ESOP11HM *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Prototype defintions and standard system API error structure
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      *--------------------------------------------------------------------
      * Variables common to CGI programs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D WSUSER          S             10
     D Dialog          s              1
     D avd             S              4
     D avdN            S              4  0
     D opd             S              7
     D opdN            S              7  0
      * Number of records matching search criteria
      *
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================******
      * MAIN PROCESS LINE
      *=====================================================================******
      * Parse input
     C                   exsr      Parse
      *
     C                   EXSR      INIT
      **
      ** Ved behov for dialog FØR jobb  kjøres legges den her...
     C     Dialog        IFeq      'J'
     c                   else
      *
      * ALT OK - aktuell jobb skal kjøres...
N03  c                   move      avdN          HentAvd           4
N03  c                   move      opdN          HentOpd           7
N03  c                   call      'ESOP11H'
N03  c                   parm                    HentAvd
N03  c                   parm                    HentOpd
N03  c                   parm                    HenMail          50
N03  c                   parm                    HenTLF           15
N03  c                   parm                    HenSMS           15
     C                   PARM                    ANNEN             1
     c                   parm                    AnnSMS           15
     C                   PARM                    TRAA              8
     C                   PARM                    TRANAV           20
     c                   parm                    Merknad          50
N03  c                   parm      WSUSER        HenUSR           10
      * Set output skeleton html member name
      *-dummy html for å få kjørt prog                                      ******
      * "bytter ut seg selv" med Html-fil i IFS umiddelbart                 ******
     C                   exsr      SetSklSpool
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
     C                   callp     updhtmlvar('AVD':
     C                             %trim(%editc(AVDN:'Z')))
     C                   callp     updhtmlvar('OPD':
     C                             %trim(%editc(OPDN:'Z')))
     C                   callp     updHtmlVar('MAIL':HENMAIL)
     C                   callp     wrtsection('all')
     c                   end
      *------------------                                                   ******
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
     C*
     C                   close     BRIDF
     C                   eval      *inlr = *on
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      avd     = zhbgetvar('avd')
     C                   EVAL      avdN    = c2n2(AVD)
     C                   EVAL      opd     = zhbgetvar('opd')
     C                   EVAL      opdN    = c2n2(opd)
     C                   EVAL      HENMAIL = zhbgetvar('MAIL')
     C                   EVAL      HENTLF  = zhbgetvar('TLF')
     C                   EVAL      Dialog = zhbgetvar('Dialog')
      *
      *
     C                   endsr
      *=====================================================================******
      * Set html output skeleton member before its read into memory
      *=====================================================================******
     C     SetSklSpool   begsr
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC'
     C                   eval      Mbr = 'ESOP11HM'
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
      *
     C                   endsr
