      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT booking
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 01 02 06-09 11-26
      *** LEDIGE INDIKATORER 44-50 53-89 93 94
      **************************************************************
      *
     FESOSF2    UF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FKODTLK    IF   E           K DISK
     FESOVERS16PO    E             PRINTER OFLIND(*IN27)
      *
     C                   EXSR      INIT
      *
     C                   MOVE      UAVD          O2AVD
     C                   MOVE      UOPD          O2OPD
     C     ESOSF2K       CHAIN     ESOSF2                             33
     C                   IF        *IN33 = *OFF
     C     O2BCD         CHAIN     CDBOAT                             33
     C     KODTLKKS      CHAIN     KODTLK                             33
     C  N33              EVAL      O2SLKNV = KLKNVN
     C   33              EVAL      O2SLKNV = *BLANKS
     C     KODTLKKK      CHAIN     KODTLK                             33
     C  N33              EVAL      O2KLKNV = KLKNVN
     C   33              EVAL      O2KLKNV = *BLANKS
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           O2PDT
     C                   MOVE      WTM           O2PTM
     C                   UPDATE    ESOSF2R
      *
     C                   WRITE     ESOS16PA
     C                   END
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     ESOSF2K       klist
     C                   kfld                    O2AVD
     C                   kfld                    O2OPD
     C     KODTLKKS      klist
     C                   kfld                    KLKUNI
     C                   kfld                    O2SLK
     C                   EVAL      KLKUNI = 'LK'
     C     KODTLKKK      klist
     C                   kfld                    KLKUNI
     C                   kfld                    O2KLK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
      *
     C                   ENDSR
      *
