      **********************************************************************
      * PROGRAM FOR Å SWITCHE FRA BOOKING OPPDRAGSTYPE TIL ENDELIG         *
      * Programmet kalles når ATA settes (via esped/oversjø)               *
      **********************************************************************
      **  OBS **
      * hette før ESOVERS4B, men manglende load gjorde at det prognavnet ble
      *           brukt til noe helt annel / letter å endr her en å reversere de andre
      **  OBS **
      *
     FBRIDF     if   e           k disk
     FHEADF     Uf   e           k disk
      *
     D                 DS
     D  ParmOS1                1   1024
     D  OSCHG                  1      1
     D  OSOT16                 2     49
     D  OT                     2     49    DIM(16)
     D  OSFR12                50     97
     D  FR                    50     97    DIM(12)
     D  OSAVD                 98    101  0
xxjovD  OSO216               102    149
xxjovD  O2                   102    149    DIM(16)
     C     *entry        Plist
     C                   parm                    UAVD              4 0
     C                   parm                    UOPD              7 0
     C                   parm                    UFIRM             2
     C                   parm                    UUser            10
      *
     C     HEADFKEY      Klist
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
      *
     C     UUSER         CHAIN     BRIDF                              33
     C  N33              MOVE      UFIRM         BIFIRM
     C  N33              MOVE      UUSER         BIBRID
      * HENTER PARAMETER
     C                   CALL      'ESGETOS'
     C                   parm                    BIBRID
     C                   parm                    BIFIRM
     C                   parm                    BIKUNR
     C                   parm                    BIKNG
     C                   parm                    ParmOS1        1024
     c
      *
     C     OSOT16        IFNE      *BLANKS
     C     OSO216        ANDNE     *BLANKS
     C     HEADFKEY      CHAIN     HEADF                              33
     C     *IN33         IFEQ      *OFF
     C     1             DO        16            NR                2 0
      *
     C     OT(NR)        IFEQ      HEOT
     C     O2(NR)        IFNE      *BLANKS
     C                   MOVEL     O2(NR)        HEOT
     C                   END
     C                   GOTO      OTOK
     C                   END
      *
     C                   END
     C     OTOK          TAG
     C                   UPDATE    HEADFR
     C                   END
     C                   END
      *
     C                   MOVE      *ON           *INLR
     C                   return
