      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT LOADING INSTRUCTIONS (SHIPPING LINE)
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 01 02 06-09 11-26
      *** LEDIGE INDIKATORER 44-50 53-89 93 94
      **************************************************************
      *
     FESOSF3    UF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FKODTLK    IF   E           K DISK
     FESOVERS19PO    E             PRINTER OFLIND(*IN27)
      *
     C                   EXSR      INIT
      *
     C                   MOVE      UAVD          O3AVD
     C                   MOVE      UOPD          O3OPD
     C     ESOSF3K       CHAIN     ESOSF3                             33
     C                   IF        *IN33 = *OFF
     C     O3BCD         CHAIN     CDBOAT                             33
     C     KODTLKKS      CHAIN     KODTLK                             33
     C  N33              EVAL      O3SLKNV = KLKNVN
     C   33              EVAL      O3SLKNV = *BLANKS
     C     KODTLKKK      CHAIN     KODTLK                             33
     C  N33              EVAL      O3KLKNV = KLKNVN
     C   33              EVAL      O3KLKNV = *BLANKS
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           O3PDT
     C                   MOVE      WTM           O3PTM
     C                   UPDATE    ESOSF3R
      *
     C                   WRITE     ESOS19PA
     C                   END
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     ESOSF3K       klist
     C                   kfld                    O3AVD
     C                   kfld                    O3OPD
     C     KODTLKKS      klist
     C                   kfld                    KLKUNI
     C                   kfld                    O3SLK
     C                   EVAL      KLKUNI = 'LK'
     C     KODTLKKK      klist
     C                   kfld                    KLKUNI
     C                   kfld                    O3KLK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
      *
     C                   ENDSR
      *
