      *
     C     *ENTRY        PLIST
     C                   PARM                    UTXT           1024
      *
     C                   MOVE      '&'           XTEGN             1
     C                   MOVE      '&amp; '      XTEGNE            6
     C                   Z-ADD     5             XTEGNL            1 0
     C                   EXSR      KNVTEGN
      *
     C                   MOVE      '"'           XTEGN
     C                   MOVE      '&quot;'      XTEGNE
     C                   Z-ADD     6             XTEGNL
     C                   EXSR      KNVTEGN
      *
     C                   BITON     '123457'      XAPS              1
     C                   BITOFF    '06'          XAPS
     C                   MOVE      XAPS          XTEGN
     C                   MOVE      '&apos;'      XTEGNE
     C                   Z-ADD     6             XTEGNL
     C                   EXSR      KNVTEGN
      *
     C                   MOVE      '<'           XTEGN
     C                   MOVE      '&gt;  '      XTEGNE
     C                   Z-ADD     4             XTEGNL
     C                   EXSR      KNVTEGN
      *
     C                   MOVE      '>'           XTEGN
     C                   MOVE      '&lt;  '      XTEGNE
     C                   Z-ADD     4             XTEGNL
     C                   EXSR      KNVTEGN
      *
     C                   EVAL      *INLR = *OFF
     C                   RETURN
      *
      ***********************************************
     C     KNVTEGN       BEGSR
      ***********************************************
      *
     C                   MOVE      *BLANKS       XTXT           1024
     C                   Z-ADD     1             XSTRPOS           5 0
     C                   Z-ADD     0             XLNG              5 0
     C                   Z-ADD     1             USTRPOS           5 0
     C                   Z-ADD     0             ULNG              5 0
     C                   EVAL      *IN33 = *ON
      *
     C                   DOW       *IN33
     C     XTEGN         SCAN      UTXT:USTRPOS  UENDPOS           5 0    33
     C                   IF        *IN33 = *OFF
     C                   EVAL      XLNG = 1024 - XSTRPOS + 1
     C                   Z-ADD     1024          UENDPOS
     C                   EVAL      ULNG = UENDPOS - USTRPOS + 1
     C                   EVAL      %subst(XTXT:XSTRPOS:XLNG) =
     C                             %subst(UTXT:USTRPOS:ULNG)
     C                   LEAVE
     C                   ELSE
     C                   EVAL      ULNG = UENDPOS - USTRPOS
     C                   EVAL      XLNG = ULNG
     C                   EVAL      %subst(XTXT:XSTRPOS:XLNG) =
     C                             %subst(UTXT:USTRPOS:ULNG)
     C                   EVAL      XSTRPOS = XSTRPOS + XLNG
     C                   EVAL      %subst(XTXT:XSTRPOS:XTEGNL) = XTEGNE
     C                   EVAL      XSTRPOS = XSTRPOS + XTEGNL
     C                   EVAL      USTRPOS = UENDPOS + 1
     C                   END
     C                   ENDDO
      *
     C                   MOVE      XTXT          UTXT
      *
     C                   ENDSR
      *
