      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/ESTK13 MODULE(*LIBL/ESTK13 *LIBL/INCGI)
CRTPGM*         ACTGRP(*NEW) AUT(*USE)
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 kode Google = Y svar skal til google maps
10XXX * 02 JOV PTF10 Param for å gjøre cross domain kall
********************************************************************
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FQ1024     IF   F 1024        DISK    USROPN
      *********************************************************************
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      /copy syspeds/qrpgsrcpy,variables3
      *
      * Client input variables
     D user            s             10
     D FRADTN          s              8  0
     D FRAKLN          s              4  0
     D TILDTN          s              8  0
     D TILKLN          s              4  0
     D TURNRN          s              8  0
     D FIL             s            100
N01  D GOOGLE          s              1
N02  D CallBack        s           1000
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
     D ItemCount       s             10i 0
     D i               s             10i 0
     D                 DS
     D  ES_PATH                1    100
     D  ESPED                  1      5
     D  PATH                   6     50
     D  FRADT                 51     58
     D  FRAKL                 59     62
     D  TILDT                 63     70
     D  TILKL                 71     74
     D  SISPOS                75     75
     D  SJNR                  76     85
     D  TURNR                 86     93
     IQ1024     NC  01
     I                                  1 1024  Data
      /copy syspeds/qrpgsrcpy,prolog3
      *
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input / cvt to numeric
     C                   exsr      Parse
      * File open / keys
     C                   EXSR      INIT
      * Read output skeleton html member into memory
     C                   exsr      LoadHtml
      * Set section variables
     C                   exsr      SetAll
      * Quit
     C                   exsr      Exit
      *
     C                   eval      *inlr = *on
     C                   return
      *
      *
      *=====================================================================
      * Parse input / cvt to numeric
      *=====================================================================
     C     Parse         begsr
      * Parse variables from QUERY_STRING environment variable
     C                   eval      user = zhbgetvar('user')
     C                   eval      SjNr = zhbgetvar('SjNr')
     C                   eval      TURNR= zhbgetvar('TURNR')
     C                   eval      TURNRN= c2n2(TURNR)
     C                   MOVE      TURNRN        TURNR
     C                   eval      FRADT= zhbgetvar('FRADT')
     C                   eval      FRADTN= c2n2(FRADT)
     C                   MOVE      FRADTN        FRADT
     C                   eval      FRAKL= zhbgetvar('FRAKL')
     C                   eval      FRAKLN= c2n2(FRAKL)
     C                   MOVE      FRAKLN        FRAKL
     C                   eval      TILDT= zhbgetvar('TILDT')
     C                   eval      TILDTN= c2n2(TILDT)
     C                   MOVE      TILDTN        TILDT
     C                   eval      TILKL= zhbgetvar('TILKL')
     C                   eval      TILKLN= c2n2(TILKL)
     C                   MOVE      TILKLN        TILKL
     C                   eval      PATH = zhbgetvar('PATH')
     C                   eval      SISPOS= zhbgetvar('SISPOS')
N01  C                   eval      Google = zhbgetvar('GOOGLE')
N02  C                   eval      CallBack = zhbgetvar('CallBack')
     C                   endsr
      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   CLOSE     BRIDF
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     LoadHtml      begsr
N01  c     Google        ifne      'Y'
     C                   callp     gethtml('HTMLSRC':
     C                             '*LIBL':
     C                             'ESTK13':'/CGITAG/')
N01  c                   else
N01  C                   callp     gethtml('HTMLSRC':
N01  C                             '*LIBL':
N01  C                             'ESTK11G':'/CGITAG/')
N01  c                   end
     C                   endsr
      *=====================================================================
      *  Set variable data for section /$top , lin , Bot
      *=====================================================================
     C     SetAll        begsr
      * Send section top
     C                   callp     wrtsection('top')
      *
     C                   EVAL      ESPED  = '*ES* '
n01  C     Google        ifeq      'Y'
n01  c                   move      'G'           ESPED
n02  C     CallBack      ifne      *blanks
n02  c                   move      'C'           ESPED
n02  c                   end
n01  c                   end
     c                   move      ES_PATH       FIL
     C                   CALL      'SYTK13CLE'
     C                   PARM                    FIL
      *
      * cross domain oppkall ??
N02  c     CallBack      ifne      *blanks
N02  c                   eval      Data=%trim(CallBack)+'('
N02  C                   callp     updHTMLvar('LINTXT':Data)
N02  C                   callp     wrtsection('lin')
N02  C                   end
     C                   MOVE      *ZEROS        ANTREC            5 0
     C                   OPEN      Q1024
     C                   READ      Q1024                                  35
     C     *IN35         DOWEQ     *OFF
     C                   ADD       1             ANTREC
     C     ANTREC        IFEQ      1
N01  c     Google        andne     'Y'
     C                   callp     updHTMLvar('LINTXT':'##OK')
     C                   callp     wrtsection('lin')
     C                   END
     C                   callp     updHTMLvar('LINTXT':Data)
     C                   callp     wrtsection('lin')
     C                   READ      Q1024                                  35
     C                   END
     C                   CLOSE     Q1024
     C     ANTREC        IFEQ      0
N01  c     Google        andne     'Y'
     C                   callp     updHTMLvar('LINTXT':'##INGEN')
     C                   callp     wrtsection('lin')
     C                   END
      *
      * Send section bot
N01  c     Google        ifne      'Y'
     C                   callp     wrtsection('bot')
N01  c                   end
      * cross domain oppkall ??
N02  c     CallBack      ifne      *blanks
N02  C                   callp     updHTMLvar('LINTXT':')')
N02  C                   callp     wrtsection('lin')
N02  C                   end
     C
     C                   endsr
     C
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     USER          CHAIN     BRIDF                              50
      * Ugyldig userID
NUSR c     *in50         ifeq      '1'
NUSR C                   callp     gethtml('HTMLSRC':'*LIBL':'ERRUSR':
NUSR c                             '/CGITAG/')
NUSR C                   callp     updhtmlvar('User':USER)
NUSR C                   callp     wrtsection('all')
NUSR C                   callp     wrtsection('*fini')
NUSR C                   close     BRIDF
NUSR C                   eval      *inlr = *on
NUSR C                   return
NUSR c                   endif
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C     UtInit        endsr
