***** *         NULLSTILLE TUR KOMPLETT MHT PDA-aktivitet          *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 slett oggså loggposter i TKSGM
10XXX * 02 JOV PTF11 de fleste events/trackT/signaturer mmm..
10XXX * 03 JOV PTF11 også bilder + sign ved TEU (henting terminal)
********************************************************************
     FTURER14   UF   E           K DISK
     FHEAD14    UF   E           K DISK
     FTRACKT    UF   E           K DISK
     FTRACKL01  UF   E           K DISK
     FDOKUFM    UF   E           K DISK
     FDOKUFN    UF   E           K DISK
N01  FTKSGM     UF   E           K DISK
     FFRISOK    IF   E           K DISK
     C     *entry        Plist
     C                   PARM                    UTUR              8
     C                   move      UTUR          HEPRO
      *
     C     TRACKKEY      KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C     DOKUFMK       KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   move      'F'           FMRI
      *
     c     HEPRO         cabeq     0             Slutt
     c     HEPRO         chain     Turer14                            33
     c     *in33         ifeq      '0'
     C                   MOVE      ' '           TUST
     C                   MOVE      ' '           TUTST4
     C                   update    TurerR
     c                   end
     c
     C     HEPRO         setll     head14
     C     HEPRO         reade     head14                                 33
     C     *IN33         DOWEQ     *OFF
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *ZEROS        HEKLMO
     C                   UPDATE    HEADFR
      * fjern Actual-tider
     C     TRACKKEY      Chain     Trackt                             33
     C     *in33         ifeq      '0'
     C                   move      *zeros        TXATDD
     C                   move      *zeros        TXATDK
     C                   move      *zeros        TXATAD
     C                   move      *zeros        TXATAK
     C                   UPDATE    TRACKTR
     C                   endif
      *
     C     TRACKKEY      setll     TRACKL01
     C     TRACKKEY      reade     TRACKL01                               33
     C     *IN33         DOWEQ     *OFF
     C     TTACTI        IFne      'ED1'
     C     TTACTI        andne     'ED2'
     C     TTACTI        andne     'STR'
     C                   DELETE    TRACKFR
     C                   END
     C     TRACKKEY      reade     TRACKL01                               33
     C                   END
      *
     C     DokufmK       setll     Dokufm
     C     DokufmK       reade     Dokufm                                 33
     C     *IN33         DOWEQ     *OFF
     C                   MOVE      *zeros        FMItDt
     C                   MOVE      *zeros        FMItTm
     C                   MOVE      *blanks       FMItUs
     c                   move      *blanks       FMITER
     C                   MOVE      *zeros        FMUtDt
     C                   MOVE      *zeros        FMUtTm
     C                   MOVE      *blanks       FMUtUs
     c                   move      *blanks       FMUTER
     C                   MOVE      *zeros        FMPODt
     C                   MOVE      *zeros        FMPOTm
     C                   MOVE      *blanks       FMPOUs
     c                   move      *blanks       FMLEVE
     C                   update    DOKUFMR
     c                   exsr      delDokufn
     C     DokufmK       reade     Dokufm                                 33
     C                   END
      * Fjern alle lenker
     C                   exsr      DELLNK
      *
     C     HEPRO         reade     head14                                 33
     C                   END
      *
N01   * Tk loggfil
N01  C     HEPRO         reade     TKSGM                                  33
N01  C     *in33         doweq     '0'
N01  c                   delete    TKSGMR
N01  C     HEPRO         reade     TKSGM                                  33
N01  C                   END
      *
     C     Slutt         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ******************************************************
     C     DelDokufn     begsr
      ******************************************************
      * DOKUFN er kolliskytinger inn/ut FREMMED terminal - fjern disse
     c                   movel     FMMRK1        FNCLID
     c     FNCLID        setll     DOKUFN
     c     FNCLID        reade     DOKUFN                                 33
     c     *in33         doweq     '0'
     c                   delete    dokufnr
     c     FNCLID        reade     DOKUFN                                 33
     c                   end
     c                   endsr
      ******************************************************
     C     DelLNK        begsr
      ******************************************************
      *
     c                   movel     *blanks       AV_OPD           12
     c                   movel     Heavd         AVDA              4
     c                   movel     Heopd         OPDA              7
     c                   eval      AV_OPD = AVDA+'_'+OPDA
      *
     c     IFBkey        klist
     c                   kfld                    Heavd
     c                   kfld                    Heopd
     c                   kfld                    FSKODE
     c                   movel     'IFB'         FSKODE
     c                   move      *blanks       FBNR17           17
     c     IFBkey        chain     FRISOK                             33
     c  N33              movel     FSSOK         FBNR17
     c                   if        FBNR17 = *Blanks
     c                   if        %subst(HXSNDN:20) <> *blanks
     c                   eval      FBNR17=%subst(HXSNDN:4:17)
     C                   else
     c                   eval      FBNR17=HXSNDN
     c                   endif
     c                   endif
      *
     c                   move      '.gif'        extn              4
     c                   if        FBNR17 = *Blanks
     c                   goto      Avd_OpdTag
     c                   endif
      * på fraktbrev .. Ulike varianter / ulike extentions
     c     FbrTag        tag
     c                   eval      URL='/syspeddev/signatur/'+FBNR17+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/COL_'+FBNR17+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/TEU_'+FBNR17+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/TEI_'+FBNR17+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/TE2_'+FBNR17+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
      *
     c                   select
     c     extn          wheneq    '.gif'
     c                   move      '.bmp'        extn              4
     c                   goto      FbrTag
     c     extn          wheneq    '.bmp'
     c                   move      '.jpg'        extn              4
     c                   goto      FbrTag
     c                   other
     c                   move      '.gif'        extn              4
     c                   endsl
      * på avd._opd....
     c     Avd_OpdTag    tag
     c                   eval      URL='/syspeddev/signatur/'+AV_OPD+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/COL_'+AV_OPD+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/TEU_'+AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/TEI_'+AV_OPD+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
     c                   eval      URL='/syspeddev/signatur/TE2_'+AV_OPD+extn
     c                   call      'ESTKFIXL'
     c                   parm                    URL              70
     c                   parm                    FINS              1
      *
     c                   select
     c     extn          wheneq    '.gif'
     c                   move      '.bmp'        extn              4
     c                   goto      Avd_OpdTag
     c     extn          wheneq    '.bmp'
     c                   move      '.jpg'        extn              4
     c                   goto      Avd_OpdTag
     c                   other
     c                   move      '.gif'        extn              4
     c                   endsl
      *
N03
N03   * Til sist bilder
N03  c                   move      '.jpg'        extn              4
N03  c                   eval      URL='/syspeddev/signatur/Bilde_POD_'
N03  c                                 +AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/Bilde_COL_'
N03  c                                 +AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/Bilde_TEU_'
N03  c                                 +AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/Bilde_TEI_'
N03  c                                 +AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
N03  c                   eval      URL='/syspeddev/signatur/Bilde_TE2_'
N03  c                                 +AV_OPD+extn
N03  c                   call      'ESTKFIXL'
N03  c                   parm                    URL              70
N03  c                   parm                    FINS              1
      *
     c                   endsr
