     FHEADf     UF   E           K DISK
     FDISP      UF   E           K DISK
     FTRACKL01  UF   E           K DISK
     FDOKUFM    UF   E           K DISK
     FDOKUFN    UF   E           K DISK
      *
     C     TRACKKEY      KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C     DOKUFMK       KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   move      'F'           FMRI
      *
     c                   z-add     1             Heavd
     c                   z-add     53858         Heopd
      *
     C     START         TAG
     C     TRACKKEY      CHAIN     headF                              33
     C     *IN33         ifeq      *OFF
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *ZEROS        HEKLMO
     C                   UPDATE    HEADFR
      *
     C     TRACKKEY      CHAIN     DISP                               33
     C                   MOVE      'E'           DISTA1
     C  N33              UPDATE    DISPR
      *
     C     TRACKKEY      setll     TRACKL01
     C     TRACKKEY      reade     TRACKL01                               33
     C     *IN33         DOWEQ     *OFF
     C     TTACTI        IFne      'STR'
     C                   DELETE    TRACKFR
     C                   END
     C     TRACKKEY      reade     TRACKL01                               33
     C                   END
     C     DokufmK       setll     Dokufm
     C     DokufmK       reade     Dokufm                                 33
     C     *IN33         DOWEQ     *OFF
     C                   MOVE      *zeros        FMItDt
     C                   MOVE      *zeros        FMItTm
     C                   MOVE      *blanks       FMItUs
     c                   move      *blanks       FMITER
     C                   MOVE      *zeros        FMUtDt
     C                   MOVE      *zeros        FMUtTm
     C                   MOVE      *blanks       FMUtUs
     c                   move      *blanks       FMUTER
     C                   MOVE      *zeros        FMPODt
     C                   MOVE      *zeros        FMPOTm
     C                   MOVE      *blanks       FMPOUs
     c                   move      *blanks       FMLEVE
     C                   update    DOKUFMR
     c                   exsr      delDokufn
     C     DokufmK       reade     Dokufm                                 33
     C                   END
      * FLERE HARDKODEDE
     C     HEOPD         IFEQ      53858
     C                   z-add     53859         Heopd
     C                   GOTO      START
     C                   END
      *
     C                   END
      *
     C     Slutt         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ******************************************************
     C     DelDokufn     begsr
      ******************************************************
      * DOKUFN er kolliskytinger inn/ut FREMMED terminal - fjern disse
     c                   movel     FMMRK1        FNCLID
     c     FNCLID        setll     DOKUFN
     c     FNCLID        reade     DOKUFN                                 33
     c     *in33         doweq     '0'
     c                   delete    dokufnr
     c     FNCLID        reade     DOKUFN                                 33
     c                   end
     c                   endsr
