     FTURER20 UF  E           K        DISK
     C*
     C                     Z-ADD1         TUSJA1
      *
     C           TUSJA1    SETLLTURER20                            8
     C                     READ TURER20                  33
     C           *IN33     DOWEQ'0'
     C           TUTST4    IFEQ '1'
     C           TUDT      ANDLT20071233
     C           TUDT      ANDNE0
     C                     MOVE '2'       TUTST4
     C                     UPDATTURERR
     C                     END                                        33
     C                     READ TURER20                  33
     C                     END
n01   *
n01  C                     SETON                     LR
     C                     RETRN
