OBS!!FTRACKL06  UF   E           K DISK
SPECI * Les kun poster av type= 'S'
*****C     'S'           SETLL     TRACKL06
     C     'S'           READE     TRACKL06                               51
PTFnrC     *IN51         DOWEQ     '0'
"""""c     TTDATE        iflt      20121015
10XXXC                   move      'X'           TTMANU
10XXXC                   endif
     C                   update    TRACKFR
     C     'S'           READE     TRACKL06                               51
     C                   ENDDO
      *
     C                   EVAL      *INLR=*ON
