     FEUR14D    CF   E             WORKSTN
     FEURORH    UF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    EURORH6       WEURORH6
     C     *LIKE         DEFINE    EURORH5       WEURORH5
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WEURORH6
     C                   KFLD                    WEURORH5
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WEURORH6
     C                   PARM                    WEURORH5
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C     KEYA          CHAIN     EURORH                             51
     C                   MOVE      'CCC0000'     ZMSGNO
     C                   WRITE     EUR14DØ
     C                   EXFMT     EUR14DA

     C     *IN03         CABEQ     '1'           SRB9
     C     *IN12         CABEQ     '1'           SRB9

      * Varelinjer
      * Oppdater hode
     C  N51              UPDATE    EURORHR
      * Varelinjer
     C                   CALL      'EUR15R'
     C                   PARM                    WEURORH6
     C                   PARM                    WEURORH5
     C     SRB9          ENDSR
