     FEUR12D    CF   E             WORKSTN
     F                                     SFILE(EUR12DB:ZRECNO)
     FEUROOLL1  IF   E           K DISK
     F                                     RENAME(EUROOLR:EUROOLR1)
     FEUROOL    UF   E           K DISK
     FEUROOH    IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    EUROOL2       WEUROOL2
     C     *LIKE         DEFINE    EUROOL1       WEUROOL1
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WEUROOL2
     C                   KFLD                    WEUROOL1
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WEUROOL2
     C                   PARM                    WEUROOL1
      *__________
      * Hent hode
      *""""""""""
     C     KEYA          CHAIN     EUROOH
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SRB1          TAG
      *______________
      * Tømme Subfile
      *""""""""""""""
      *
     C                   MOVE      '1'           *IN93
     C                   WRITE     EUR12DC
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZERO         ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KEYA          SETLL     EUROOLL1
     C     KEYA          READE     EUROOLL1                               94
     C     *IN94         DOWEQ     '0'

     C                   ADD       1             ZRECNO
     C                   WRITE     EUR12DB

     C     KEYA          READE     EUROOLL1                               94
     C                   ENDDO
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C     SRB5          TAG
      *
     C                   MOVEA     '11'          *IN(91)
     C  N30              MOVE      'CCC0000'     ZMSGNO
     C                   WRITE     EUR12DØ
     C                   WRITE     EUR12DD
     C                   EXFMT     EUR12DC
      *
     C     *IN12         CABEQ     '1'           SRB1
     C     *IN03         IFEQ      '0'
      *
     C                   MOVEA     '00'          *IN(91)
      *_____________
      * F5=Frisk opp
      *"""""""""""""
     C     *IN05         CABEQ     '1'           SRB1
      *_______
      * Valg ?
      *"""""""
     C                   MOVE      '0'           *IN52
     C                   MOVE      '0'           *IN30
     C                   MOVE      '0'           *IN95
     C     *IN52         DOWEQ     '0'
      *
     C                   READC     EUR12DB                                52
     C     *IN52         IFEQ      '0'
     C     ZOP           CASEQ     '4'           SRBD
     C     ZOP           CASEQ     '5'           SRBE
     C                   ENDCS
     C                   ENDIF
      *
     C  N30
     CANN52              END
      *
     C     *IN03         CABEQ     '1'           SRB9
     C                   END
     C  N03              GOTO      SRB1
      *
     C     SRB9          ENDSR
      *////////////////////////////////////////////////////////////
      *  Slett linje                                         SRBD /
      *////////////////////////////////////////////////////////////
     C     SRBD          BEGSR
     C     KEYA          CHAIN     EUROOL                             51
     C                   IF        *IN51=*OFF
     C                   DELETE    EUROOLR
     C                   ENDIF
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ZOP
     C                   UPDATE    EUR12DB
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Vise linjen                                         SRBE /
      *////////////////////////////////////////////////////////////
     C     SRBE          BEGSR
     C                   MOVE      'CCC0000'     ZMSGNO
     C                   EXFMT     EUR12DE
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ZOP
     C                   UPDATE    EUR12DB
     C                   ENDSR
