     FEUROOH    IF   E           K DISK
     FEUROOL    IF   E           K DISK
     FEURORH    UF A E           K DISK
     FEURORL    UF A E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    EUROOL2       WEUROOL2
     C     *LIKE         DEFINE    EUROOL1       WEUROOL1
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WEUROOL2
     C                   KFLD                    WEUROOL1
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WEUROOL2
     C                   PARM                    WEUROOL1
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Kopier                                               SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *____________
      * Kopier hode
      *""""""""""""
     C     KEYA          CHAIN     EURORH                             51
     C     *IN51         CABEQ     *OFF          SRB1

     C     KEYA          CHAIN     EUROOH                             51
     C     *IN51         CABEQ     *ON           SRB1
     C                   CLEAR                   EURORHR
     C                   EVAL      EURORH1=EUROOH2
     C                   EVAL      EURORH2=EUROOH1
     C                   EVAL      EURORH5=EUROOH5
     C                   EVAL      EURORH6=EUROOH6
     C                   WRITE     EURORHR
      *______________
      * Kopier linjer
      *""""""""""""""
     C     SRB1          TAG
     C     KEYA          CHAIN     EURORL                             51
     C     *IN51         CABEQ     *OFF          SRB9

     C     KEYA          SETLL     EUROOL
     C     KEYA          READE     EUROOL                                 52
     C     *IN52         DOWEQ     *OFF
     C                   CLEAR                   EURORLR
     C                   EVAL      EURORL1=EUROOL1
     C                   EVAL      EURORL2=EUROOL2
     C                   EVAL      EURORL3=EUROOL3
     C                   EVAL      EURORL4=EUROOL4
     C                   EVAL      EURORL5=EUROOL5
     C                   EVAL      EURORL6=EUROOL6
     C                   EVAL      EURORL7=EUROOL7
     C                   EVAL      EURORL8=EUROOL8
     C                   EVAL      EURORL9=EUROOL9
     C                   EVAL      EURORL14=EUROOL14
     C                   EVAL      EURORL16=EUROOL16
     C                   EVAL      EURORL17=EUROOL17
     C                   WRITE     EURORLR
     C     KEYA          READE     EUROOL                                 52
     C                   ENDDO

     C     SRB9          ENDSR
