      * STATUS 35   0=PENDING 1=CONTACTED,2=BOOKED(SATT PÅ OPPDRAG MEN IKKE BEKREFTET)
      * STATUS 40   3=CONDFIRMED (KRYSSET AV I TURVILDET FOR AT B/L MM ER OK.. )
      * STATUS 45   4=SHIPPED (ATD SATT) - ER NÅ OVER I ECARE
      * STATUS 50   5=ARRIVED (ATA SATT)
     FEPOL03    IF   E           K DISK
     FEPOH03    IF   E           K DISK
     C     KEY           KLIST
     C                   KFLD                    XXSTA2            1
     C                   KFLD                    XXKUND            8 0
     C                   eval      XXSTA2 = 'S'
     C                   eval      XXKUND = 13705
      *
      * FØRST - de som er lagt på oppdrag via Linjenivå..
     C     KEY           SETLL     EPOL03
     C     KEY           READE     EPOL03                                 54
     C     *IN54         DOWEQ     *OFF
     c     ELBES         ifne      GMBES
      *
     C                   SELECT
     c     ELSTA         WHENLE    '2    '
     c                   move      '35'          FUNKSJON          2
     c     ELSTA         WHENEQ    '3    '
     c                   move      '40'          FUNKSJON
     c     ELSTA         WHENEQ    '4    '
     c                   move      '45'          FUNKSJON
     c     ELSTA         WHENEQ    '5    '
     c                   move      '50'          FUNKSJON
     c                   endsl
      *
     C                   call      'EUR53SR'
     c                   parm                    ELKUND
     c                   parm                    ELBES
     C                   PARM                    HEALIN            1            Hele Head/Bare S-lin
     c                   parm                    FUNKSJON          2
     C                   endif
     c                   move      ELBES         GMBES            10
     C     KEY           READE     EPOL03                                 54
     C                   ENDDO
      *
      *
      * SÅ    - de som er lagt på oppdrag via POHead   ..
     C     KEY           SETLL     EPOH03
     C     KEY           READE     EPOH03                                 54
     C     *IN54         DOWEQ     *OFF
     c     EHBES         ifne      GMBES
      *
     C                   SELECT
     c     EHSTA         WHENLE    '2    '
     c                   move      '35'          FUNKSJON          2
     c     EHSTA         WHENEQ    '3    '
     c                   move      '40'          FUNKSJON
     c     EHSTA         WHENEQ    '4    '
     c                   move      '45'          FUNKSJON
     c     EHSTA         WHENEQ    '5    '
     c                   move      '50'          FUNKSJON
     c                   endsl
      *
     C                   call      'EUR03SR'
     c                   parm                    EHKUND
     c                   parm                    EHBES
     C                   PARM      'H'           HEALIN            1            Hele Head/Bare S-lin
     c                   parm                    FUNKSJON          2
     C                   endif
     c                   move      EHBES         GMBES            10
     C     KEY           READE     EPOH03                                 54
     C                   ENDDO
      *
      ***
     C                   seton                                        LR
     C                   return
