      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE AVDELINGSHODE PÅ FAKTURA  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                ***
      *** LEDIGE INDIKATORER 27-59 61-97                      ***
      ***********************************************************
      *
     FKODTA     IF   E           K DISK
     FHODEFAX   UF A E           K DISK
     FFAX063FM  CF   E             WORKSTN
     C*
     C     HODEK         KLIST
     C                   KFLD                    WSNET
     C                   KFLD                    WSAVD
     C     HODEKK        KLIST
     C                   KFLD                    WSNET
     C                   KFLD                    WSAVDK
     C     KODTAK        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    WSAVD
     C*
     C                   MOVE      'A'           WSAUNI            1
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       30
     C   03              GOTO      SLUTT
     C     WSAVDK        IFEQ      0
     C     KODTAK        CHAIN     KODTA                              99
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C     HODEK         CHAIN     HODEFAX                            60
     C  N60              EXSR      MOVEH
     C                   ELSE
     C     HODEKK        CHAIN     HODEFAX                            98
     C   98              MOVE      'SPA0015'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C                   EXSR      MOVEH
     C                   END
     C*
     C     START2        TAG
     C                   EXFMT     BILDE02
     C  N12              DO
     C     HODEK         CHAIN     HODEFAX                            60
     C                   EXSR      HMOVE
     C   60              WRITE     HODER
     C  N60              UPDATE    HODER
     C                   END
     C                   EXSR      MOVEB
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     MOVEB         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSNET
     C                   MOVE      *ZEROS        WSAVD
     C                   MOVE      *ZEROS        WSAVDK
     C                   MOVE      *BLANKS       WSHT1
     C                   MOVE      *BLANKS       WSHT2
     C                   MOVE      *BLANKS       WSHT3
     C                   MOVE      *BLANKS       WSHT4
     C                   MOVE      *BLANKS       WSHT5
     C                   MOVE      *BLANKS       WSHT6
     C                   MOVE      *BLANKS       WSHT7
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVEH         BEGSR
     C***********************************************
     C                   MOVEL     HOHT1         WSHT1
     C                   MOVEL     HOHT2         WSHT2
     C                   MOVEL     HOHT3         WSHT3
     C                   MOVEL     HOHT4         WSHT4
     C                   MOVEL     HOHT5         WSHT5
     C                   MOVEL     HOHT6         WSHT6
     C                   MOVEL     HOHT7         WSHT7
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HMOVE         BEGSR
     C***********************************************
     C                   MOVE      WSNET         HONET
     C                   MOVE      WSAVD         HOAVD
     C                   MOVEL     WSHT1         HOHT1
     C                   MOVEL     WSHT2         HOHT2
     C                   MOVEL     WSHT3         HOHT3
     C                   MOVEL     WSHT4         HOHT4
     C                   MOVEL     WSHT5         HOHT5
     C                   MOVEL     WSHT6         HOHT6
     C                   MOVEL     WSHT7         HOHT7
     C*
     C                   ENDSR
     C*
