      *
      ***********************************************************
      *** PROGRAM FOR REORGANISERING AV FAXLOGG               ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
     FFAXMANP   UF   E           K DISK
     FFAXLOG01  UF   E           K DISK
     FFAXQLOG1  UF   E           K DISK
     D                 DS
     D  WSDTC                  1      2
      * VED INNGANG WSDTD=DAG OG WSDTÅ=ÅR
      * ETTER DATOSNUING WSDTD=ÅR OG WSDTÅ=DAG
     D  WSDTD                  3      4  0
     D  WSDTM                  5      6  0
     D  WSDTÅ                  7      8  0
     D  DATO1                  1      8
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C*
     C     *LOVAL        SETLL     FAXLOGR
     C     *LOVAL        SETLL     LOGR
     C                   READ      FAXLOGR                                30
     C     *IN30         DOWEQ     '0'
     C     LOUDAT        IFLE      DATE
     C  N30              DELETE    FAXLOGR
     C                   MOVEL     LODOCN        LODOC2            2
     C     LODOC2        IFEQ      'F0'
     C                   CALL      'FAXDEL'
     C                   PARM                    LODOCN
     C                   PARM                    LOMAPP
     C                   END
     C                   END
     C                   READ      FAXLOGR                                30
     C                   END
     C*
     C                   READ      LOGR                                   31
     C     *IN31         DOWEQ     '0'
     C                   MOVE      QFDATE        XQFDAT            8
     C     QFDATE        IFGT      '501231'
     C                   MOVEL     '19'          XQFDAT
     C                   ELSE
     C                   MOVEL     '20'          XQFDAT
     C                   END
     C     XQFDAT        IFLE      DATO1
     C  N31              DELETE    LOGR
     C                   END
     C                   READ      LOGR                                   31
     C                   END
     C                   EXSR      MANUEL
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     MANUEL        BEGSR
     C***********************************************
     C*
     C                   SETOFF                                       33
     C     *LOVAL        SETLL     FAXMANP
     C     *IN33         DOWEQ     '0'
     C                   READ      FAXMANP                                33
     C     *IN33         IFEQ      '0'
     C     PUDATE        ANDLE     DATE
     C                   DELETE    FAXMANR
     C                   END
     C                   END
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    DATO              6
     C*
     C                   MOVE      DATO          DATO1
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   MOVE      UDT1          WSDTÅ
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTD
      * ETTER DATOSNUING WSDTD=ÅR WSDTÅ=DAG
     C     WSDTD         IFGT      50
     C                   MOVE      '19'          WSDTC
     C                   ELSE
     C                   MOVE      '20'          WSDTC
     C                   END
     C                   MOVE      DATO1         DATE              8 0
     C*
     C                   ENDSR
     C*
