      *
      ************************************************************
      * LEGGER INN PAGE BREAKSYMBOL VED "SKIPP" I FIL KOPIERT INN FRA SPOOL
      ************************************************************
      *
     FFAXDOCA   IP   E           K DISK
     FFAXDOCB   O    E             DISK
     C*
     C* HVIS HELT IDENTISKE LINJER HOPPES OVER LINJEN
     C*
     C     *LIKE         DEFINE    PATXT         FORIGE
     C     PATXT         IFNE      *BLANKS
     C     PATXT         IFEQ      FORIGE
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C                   MOVE      PATXT         FORIGE
     C* I SPOOLFILE LIGGER DET ALLTID ENTEN SKIPP ELLER SPACEB
     C     PASKIP        IFNE      *BLANKS
     C* PAGEBREAK VED SKIPP - MEN IKKE FØRSTE GANG
     C   99              MOVE      *BLANKS       PBTXT
     C   99              MOVEL     '.pa'         PBTXT
     C   99              WRITE     PRTDOCBR
     C                   SETON                                        99
     C     PASKIP        IFGT      '001'
     C                   MOVE      *BLANKS       PBTXT
     C                   MOVE      PASKIP        SKPANT            3 0
     C                   SUB       1             SKPANT
     C                   DO        SKPANT
     C                   WRITE     PRTDOCBR                                     *SKRIV BLANKE LINJER
     C                   END
     C                   END
     C* SPACE FERDIG
     C                   MOVEL     PATXT         PBTXT                          *SKRIV
     C                   WRITE     PRTDOCBR
     C                   ELSE
     C*... ELLER SPACE
     C     PASPAC        IFGT      '1'
     C                   MOVE      *BLANKS       PBTXT
     C                   MOVE      PASPAC        SPCANT            1 0
     C                   SUB       1             SPCANT
     C                   DO        SPCANT
     C                   WRITE     PRTDOCBR                                     *SKRIV BLANKE LINJER
     C                   END
     C                   END
     C* SPACE FERDIG
     C                   MOVEL     PATXT         PBTXT                          *SKRIV LINJA
     C                   WRITE     PRTDOCBR
     C                   END
     C     SLUTT         TAG
