      *
      ************************************************************
      *** PROGRAM FOR Å FIXE FAXNR VED SENTRALBORD             ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FFAXSEN    IF   E           K DISK
     D                 DS
     D  A1                     1     21
     D                                     DIM(21)
     D  FAXFRA                 1     21
     D                 DS
     D  B1                     1     21
     D                                     DIM(21)
     D  FAXTIL                 1     21
     D                 DS
     D  FAX11                  1      1
     D  FAX12                  1      2
     D  FAX22                  2      2
     D  FAX33                  3      3
     D  FAX321                 3     21
     D  FAX421                 4     21
     D  FAXNY                  1     21
     C     *ENTRY        PLIST
     C                   PARM                    UFAXNR           21
     C                   MOVE      UFAXNR        FAXFRA
     C                   Z-ADD     1             N1                2 0
     C                   Z-ADD     0             N2                2 0
     C                   DO        21
     C     A1(N1)        IFGE      '0'
     C     A1(N1)        IFLE      '9'
     C                   ADD       1             N2
     C                   MOVE      A1(N1)        B1(N2)
     C                   END
     C                   END
     C                   ADD       1             N1
     C                   END
     C                   MOVE      FAXTIL        UFAXNR
     C*
     C                   READ      FIRM                                   33
     C     FIFIRM        CHAIN     FAXSEN                             33
     C  N33FAXNRS        IFNE      *BLANKS
     C     FAXVEN        IFEQ      *BLANK
     C                   MOVE      '+'           FAXVEN
     C                   END
     C                   MOVE      FAXNRS        FAX12
     C     FAX22         IFEQ      *BLANK
     C                   MOVE      FAXVEN        FAX22
     C                   MOVEL     UFAXNR        FAX321
     C                   ELSE
     C                   MOVE      FAXVEN        FAX33
     C                   MOVEL     UFAXNR        FAX421
     C                   END
     C                   MOVE      FAXNY         UFAXNR
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
