********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 oppdragsnummer er feil .
********************************************************************
      *
     F*
     F***********************************************************
     F*** PROGRAM SKAL LOGGER SENDTE FAXER                    ***
     F***********************************************************
     F*
     FFAXLOG    O  A E             DISK
     D                 DS
     D  UAAR                   1      4  0
     D  UMND                   5      6  0
     D  UDAG                   7      8  0
     D  LOUDAT                 1      8  0
     D  MAILDA                 3      8  0
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     C*
     C     *ENTRY        PLIST
     C                   PARM                    LOUSER
     C                   PARM                    LOJONR
     C                   PARM                    LOJONA
     C                   PARM                    LOFAXN
     C                   PARM                    LODOCN
     C                   PARM                    LOMAPP
     C                   PARM                    LOTIME
     C                   PARM                    LODATE
     C                   PARM                    LONAVN
     C                   PARM                    XXAVD             4
s01  C*                  PARM                    XXOPD             5
n01  C                   PARM                    XXOPD             7
     C                   PARM                    XXTUR             8
     C                   PARM                    LOKODE
     C                   MOVE      XXAVD         LOAVD
     C                   MOVE      XXOPD         LOOPD
     C                   MOVE      XXTUR         LOTUR
     C                   MOVE      UDAY          UDAG
     C                   MOVE      UMONTH        UMND
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          UAAR
     C                   ELSE
     C     UYEAR         ADD       2000          UAAR
     C                   END
     C                   MOVEL     LOFAXN        LOMAIL            4
     C     LOMAIL        IFEQ      'MAIL'
     C                   TIME                    XULTID           14 0
     C                   MOVE      *BLANKS       LOTIME
     C                   MOVEL     XULTM         LOTIME
     C                   MOVE      *BLANKS       LODATE
     C                   MOVEL     MAILDA        LODATE
     C                   END
     C                   WRITE     FAXLOGR
     C                   SETON                                          LR
     C                   RETURN
