      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE STANDARD FAXER PÅ KUNDER  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-86 95-97    ***
      ***********************************************************
      *
     FFAXAVT    UF A E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTOT2   IF   E           K DISK
     FFAX014FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     CHOISE        TAG
     C                   Z-ADD     11            LINNBR
     C                   Z-ADD     17            POSNBR
     C                   EXFMT     BILDE1
     C                   SETOFF                                       9930
     C*
     C**  AVSLUTT
     C*
     C     *IN03         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END                                                    <*IN03
     C*
     C**  SØK
     C*
     C     *IN04         IFEQ      '1'
     C                   EXSR      SØKUNR
     C     KUNKEY        CHAIN     CUNDL01                            99
     C     *IN99         IFEQ      '1'
     C                   MOVE      *ZEROS        W1KNR
     C                   SETOFF                                       99
     C                   GOTO      CHOISE
     C                   END                                                    <*IN99
     C                   END                                                    <*IN04
     C*
     C     KUNKEY        CHAIN     CUNDL01                            35
     C     W1KNR         IFNE      *ZEROS
     C     *IN35         IFEQ      '0'
     C                   MOVE      KNAVN         W1NAVN
     C                   ELSE
     C                   MOVE      '1'           *IN30
     C                   MOVE      'DIV2480'     MSGNR
     C                   GOTO      CHOISE
     C                   END                                                    <*IN35
     C                   ELSE
     C                   MOVE      *BLANKS       W1NAVN
     C                   MOVEL     'STANDARD'    W1NAVN
     C                   END                                                    <*IN35
     C*
     C     START         TAG
     C                   CLEAR                   SFXAVD
     C                   CLEAR                   SFXOPD
     C                   CLEAR                   SFXTYP
     C                   CLEAR                   SFXDOC
     C                   CLEAR                   SFXMAP
     C     STARTF        TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SFKEY         SETLL     FAXAVT
      *
     C     START1        TAG
     C                   DO        15
     C     W1KNR         READE(N)  FAXAVT                                 94
     C     *IN94         IFEQ      '0'
     C                   MOVE      FAXAVD        SFXAVD
     C                   MOVE      FAXOPD        SFXOPD
     C                   MOVE      FAXTYP        SFXTYP
     C                   MOVE      FAXDOC        SFXDOC
     C                   MOVE      FAXMAP        SFXMAP
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END                                                    <*IN94
     C  N94              ENDDO
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   Z-ADD     WSSUBN        XRECNO
     C                   EXFMT     BUNN
     C                   END
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C*
     C                   SETOFF                                       999830
     C*** AVSLUTT
     C     *IN03         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END                                                    <*IN03
     C*** FRISK OPP
     C     *IN05         IFEQ      '1'
     C                   GOTO      START
     C                   END                                                    <*IN05
     C*** LAGE
     C     *IN06         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   GOTO      START5
     C                   END                                                    <*IN06
     C*** SØK
     C     *IN08         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     21            POSNBR
     C                   GOTO      START6
     C                   END                                                    <*IN08
     C*
     C*** FORRIGE
     C     *IN12         IFEQ      '1'
     C                   GOTO      CHOISE
     C                   END                                                    <*IN12
     C*** BLA VIDERE
     C     *IN25         IFEQ      '1'
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C     *IN94         IFEQ      '0'
     C     SFKEY         SETLL     FAXAVT
     C                   END                                                    <*IN94
     C     START4        TAG
     C     *IN94         IFEQ      '0'
     C                   READ      FAXAVT                                 94
     C                   GOTO      START1
     C                   END                                                    <*IN94
     C                   END                                                    <*IN25
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END                                                    <ZRECNO
     C     *IN98         IFEQ      '1'
     C     XRECNO        ANDNE     0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END                                                    <*IN98
     C                   GOTO      START3
     C*** NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00000'       *IN(86)
     C                   SETOFF                                           30
     C     *IN12         IFEQ      '1'
     C                   EXSR      MOVBWS
     C                   ELSE
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   END                                                    <*IN12
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3
     C*** SØK FRA AVDELING
     C     START6        TAG
     C                   EXFMT     VAREL2
     C     *IN12         IFNE      '1'
     C                   MOVE      WSXAVD        SFXAVD
     C                   MOVE      WSXOPD        SFXOPD
     C                   MOVE      WSXTYP        SFXTYP
     C                   MOVE      WSXDOC        SFXDOC
     C                   MOVE      WSXMAP        SFXMAP
     C                   GOTO      STARTF
     C                   END                                                    <*IN12
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*          N40 = NY
     C*           40 = ENDRING
     C*
     C                   SETOFF                                       37
     C*
     C*
     C*  TEST FOR GYLDIG OPPDRAGSTYPE
     C*
     C     WSXOPD        IFNE      '  '
     C     KODO2K        CHAIN     KODTOT2                            37
     C     *IN37         IFNE      '0'
     C                   MOVE      'DIV2483'     MSGNR
     C                   Z-ADD     12            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN37
     C                   GOTO      SLTB
     C                   END                                                    <*IN37
     C                   END                                                    <*IN37
     C*
     C*TEST BREV/MAPPE
     C*
     C                   CALL      'FAXOBJ'
     C                   PARM                    WSXDOC
     C                   PARM                    WSXMAP
     C                   PARM                    FINS              1
     C     FINS          IFNE      'J'
     C                   SETON                                        30
     C                   MOVE      'SHU0196'     MSGNR
     C                   Z-ADD     21            POSNBR
     C                   GOTO      SLTB
     C                   END
     C*
     C  N40WSKEY         CHAIN     FAXAVT                             33
     C*
     C*
     C   40SFKEY         CHAIN     FAXAVT                             33
     C*
     C*  TEST OM K/S AVTALE FINNES FRA FØR VED NYREGISTRERING
     C*
     C     *IN33         IFEQ      '0'
     C     *IN40         ANDEQ     '0'
     C                   MOVE      'DIV2479'     MSGNR
     C                   Z-ADD     6             POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C*
     C                   EXSR      MOVWKA
     C     *IN33         IFEQ      '1'
     C                   WRITE     FAXAVTR
     C                   ELSE
     C                   UPDATE    FAXAVTR                              38
     C                   END                                                    <*IN33
     C*
     C                   EXSR      MOVWSF
     C     *IN40         IFEQ      '1'
     C                   UPDATE    SUBFIL
     C                   ELSE
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   END                                                    <*IN40
     C                   EXSR      MOVBWS
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              MOVE      '1'           *IN30
     C*******************  Z-ADD1         LINNBR
     C                   GOTO      SLHENT
     C                   ENDDO
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              4 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C*
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     SFXOPD        IFEQ      '*D'
     C                   MOVE      'SPS0029'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   END                                                    <SFFRAN
     C                   EXSR      CHGST
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLHENT
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR
     C*
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     SFXOPD        IFEQ      '*D'
     C                   MOVE      'SPS0029'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   END                                                    <SFFRAN
     C                   EXSR      DLTST
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLHENT
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR
     C                   ENDDO
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTST         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   EXFMT     VAREL3
     C     *IN12         IFEQ      '0'
     C     SFKEY         CHAIN     FAXAVT                             33
     C  N33              DELETE    FAXAVTR
     C                   EXSR      MOVBSF
     C                   END                                                    <*IN12
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGST         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   MOVE      '1'           *IN99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '0000'        *IN(87)
     C                   SETOFF                                       30
     C     *IN12         IFEQ      '1'
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVBWS
     C                   ELSE
     C                   EXSR      TESTB1
     C   30              GOTO      STCHG
     C                   END                                                    <*IN12
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      SFXAVD        WSXAVD
     C                   MOVE      SFXOPD        WSXOPD
     C                   MOVE      SFXTYP        WSXTYP
     C                   MOVE      SFXDOC        WSXDOC
     C                   MOVE      SFXMAP        WSXMAP
     C                   MOVE      '1'           *IN40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     16            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWKA        BEGSR
     C***********************************************
     C                   MOVE      W1KNR         FAXKNR
     C                   MOVE      WSXAVD        FAXAVD
     C                   MOVE      WSXOPD        FAXOPD
     C                   MOVE      WSXTYP        FAXTYP
     C                   MOVE      WSXDOC        FAXDOC
     C                   MOVE      WSXMAP        FAXMAP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C                   MOVE      WSXAVD        SFXAVD
     C                   MOVE      WSXOPD        SFXOPD
     C                   MOVE      WSXTYP        SFXTYP
     C                   MOVE      WSXDOC        SFXDOC
     C                   MOVE      WSXMAP        SFXMAP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBSF        BEGSR
     C***********************************************
     C*
     C                   MOVE      *ZEROS        SFXAVD
     C                   MOVE      '*D'          SFXOPD
     C                   MOVE      *BLANKS       SFXTYP
     C                   MOVE      *BLANKS       SFXDOC
     C                   MOVE      *BLANKS       SFXMAP
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBWS        BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSXAVD
     C                   MOVE      *BLANKS       WSXOPD
     C                   MOVE      *BLANKS       WSXTYP
     C                   MOVE      *BLANKS       WSXDOC
     C                   MOVE      *BLANKS       WSXMAP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C*
     C     SFKEY         KLIST
     C                   KFLD                    W1KNR
     C                   KFLD                    SFXAVD
     C                   KFLD                    SFXOPD
     C                   KFLD                    SFXTYP
     C*
     C     WSKEY         KLIST
     C                   KFLD                    W1KNR
     C                   KFLD                    WSXAVD
     C                   KFLD                    WSXOPD
     C                   KFLD                    WSXTYP
     C*
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     KUNKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    W1KNR
     C*
     C*
     C     KODO2K        KLIST
     C                   KFLD                    YO2UNI
     C                   KFLD                    WSXOPD
     C*
     C*
     C*
     C                   MOVE      'O2Y'         YO2UNI            3
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        ZFIRMA
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     SØKUNR        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    W1KNR
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
     C*
     C                   ENDSR
     C*
