      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE HODE PÅ FAXDOKUMENT       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                ***
      *** LEDIGE INDIKATORER 27-59 61-97                      ***
      ***********************************************************
      *
     FFAXH      UF A E           K DISK
     FFAX011FM  CF   E             WORKSTN
     C*
     C     FAXHK         KLIST
     C                   KFLD                    WSNET
     C                   KFLD                    WSAVD
     C     FAXHKK        KLIST
     C                   KFLD                    WSNET
     C                   KFLD                    WSAVDK
     C*
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       30
     C   03              GOTO      SLUTT
     C     FAXHK         CHAIN(N)  FAXH                               60
     C     WSAVDK        IFNE      *BLANKS
     C     FAXHKK        CHAIN(N)  FAXH                               98
     C* FEIL HVIS IKKE BLANK I KOPIERE FRA
     C   98              MOVE      'SHU0188'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C                   SETOFF                                       60
     C                   END
     C   60FAXHK         CHAIN(N)  FAXH                               60
     C  N60              EXSR      MOVEH
     C*
     C     START2        TAG
     C                   EXFMT     BILDE02
     C  N12              DO
     C     FAXHK         CHAIN     FAXH                               60
     C                   EXSR      HMOVE
     C   60              WRITE     FAXHR
     C  N60              UPDATE    FAXHR
     C                   END
     C                   EXSR      MOVEB
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     MOVEB         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSNET
     C                   MOVE      *BLANKS       WSAVD
     C                   MOVE      *BLANKS       WSAVDK
     C                   MOVE      *BLANKS       WSHT1
     C                   MOVE      *BLANKS       WSHT2
     C                   MOVE      *BLANKS       WSHT3
     C                   MOVE      *BLANKS       WSHT4
     C                   MOVE      *BLANKS       WSHT5
     C                   MOVE      *BLANKS       WSHT6
     C                   MOVE      *BLANKS       WSHT7
     C                   MOVE      *BLANKS       WSBT1
     C                   MOVE      *BLANKS       WSBT2
     C                   MOVE      *BLANKS       WSBT3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVEH         BEGSR
     C***********************************************
     C                   MOVEL     HOHT1         WSHT1
     C                   MOVEL     HOHT2         WSHT2
     C                   MOVEL     HOHT3         WSHT3
     C                   MOVEL     HOHT4         WSHT4
     C                   MOVEL     HOHT5         WSHT5
     C                   MOVEL     HOHT6         WSHT6
     C                   MOVEL     HOHT7         WSHT7
     C                   MOVEL     HOBT1         WSBT1
     C                   MOVEL     HOBT2         WSBT2
     C                   MOVEL     HOBT3         WSBT3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HMOVE         BEGSR
     C***********************************************
     C                   MOVE      WSNET         HONET
     C                   MOVE      WSAVD         HOAVD
     C                   MOVEL     WSHT1         HOHT1
     C                   MOVEL     WSHT2         HOHT2
     C                   MOVEL     WSHT3         HOHT3
     C                   MOVEL     WSHT4         HOHT4
     C                   MOVEL     WSHT5         HOHT5
     C                   MOVEL     WSHT6         HOHT6
     C                   MOVEL     WSHT7         HOHT7
     C                   MOVEL     WSBT1         HOBT1
     C                   MOVEL     WSBT2         HOBT2
     C                   MOVEL     WSBT3         HOBT3
     C*
     C                   ENDSR
     C*
