      *
      * PROGRAM FOR Å TASTE COVERPAGE PÅ FAXSENDINGER               ***
      * """"""""""""""""""""""""""""""""""""""""""""""""""""""""""""***
      *
     FFAXCV4FM  CF   E             WORKSTN
     D F4              S             75    DIM(12)
     D                 DS
     D  WSCF01                 1     75
     D  WSCF02                76    150
     D  WSCF03               151    225
     D  WSCF04               226    300
     D  WSCF05               301    375
     D  WSCF06               376    450
     D  WSCF07               451    525
     D  WSCF08               526    600
     D  WSCF09               601    675
     D  WSCF10               676    750
     D  WSCF11               751    825
     D  WSCF12               826    900
     D  F5                     1    900
     D                                     DIM(12)
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKN               8 0
     C                   PARM                    UNAVN            30
     C                   PARM                    UFAXNR           21
     C                   PARM                    WSCNV
     C                   PARM                    WSCAD1
     C                   PARM                    WSCAD2
     C                   PARM                    WSCAD3
     C                   PARM                    UDOK             20
     C                   PARM                    UMAP             12
     C                   PARM                    UTID              8
     C                   PARM                    UDATO             8
     C                   PARM                    UCVP              1
      *
     C     UCVP          COMP      'J'                                    27
      *
     C                   MOVE      *BLANKS       F5
     C     *IN27         IFEQ      '1'
     C                   EXFMT     BILDE01
     C     *IN12         IFEQ      '1'
     C                   MOVE      'A'           UCVP
     C                   GOTO      SLUTT
     C                   END
     C                   MOVE      '.'           F5(12)
     C                   END
      *
     C                   MOVEA     F5            F4
     C                   CALL      'FAX008CF'
     C                   PARM                    UNAVN            30
     C                   PARM                    UFAXNR           21
     C                   PARM                    WSCNV
     C                   PARM                    WSCAD1
     C                   PARM                    WSCAD2
     C                   PARM                    WSCAD3
     C                   PARM                    WSCATT
     C                   PARM                    UDOK
     C                   PARM                    UMAP
     C                   PARM                    UTID
     C                   PARM                    UDATO
     C                   PARM                    F4
     C                   PARM                    UCVP
      *
     C                   MOVE      ' '           UCVP
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
