      *
      * PROGRAM FOR Å TASTE COVERPAGE PÅ FAXSENDINGER               ***
      *
     FFAXCVPFM  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    WSCVP1           40
     C                   PARM                    WSCVP2           40
     C                   PARM                    WSCVP3           40
     C                   PARM                    WSCVP4           40
     C                   PARM                    WSCVP5           40
     C                   PARM                    WSCVP6           40
     C                   PARM                    WSCVP7           40
     C                   PARM                    WSCVP8           40
     C                   PARM                    UCMD              1
     C                   MOVE      ' '           UCMD
     C                   EXFMT     BILDE01
     C     *IN12         IFEQ      '1'
     C                   MOVE      'A'           UCMD
     C                   END
     C                   SETON                                        LR
     C                   RETURN
