     FSNDDST    O  A E             DISK
     D                 DS
     D  RDATA                  1     80
     D  FDATA                 10     49
     D                 DS
     D LINJE           C                   CONST('<HTML> <HEAD> <TITLE-
     D                                     >MAIL</TITLE> </HEAD-
     D                                     > <BODY> <PRE>      -
     D                                                         ')
     C*
     C*
     C                   MOVE      *BLANKS       RDATA
     C                   MOVEL     LINJE         RDATA
     C                   WRITE     RECORD
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
