     FSNDDSTB   O  A E             DISK
     D                 DS
     D  RDATA                  1    120
     D  FDATA                 10     49
     D                 DS
     D LINJE           C                   CONST('<HTML> <HEAD> <TITLE-
     D                                     >MAIL</TITLE> </HEAD-
     D                                     > <BODY> <B>        -
     D                                                         ')
     D                 DS
     D LINJE2          C                   CONST('<FONT FACE="ARIAL" S-
     D                                     IZE="2"> <PRE>')
     D                 DS
     D LINJE3          C                   CONST('<FONT FACE="ARIAL" S-
     D                                     IZE="3"> <PRE>')
     D                 DS
     D LINJE4          C                   CONST('<FONT FACE="ARIAL" S-
     D                                     IZE="4"> <PRE>')
     C*
     C     *ENTRY        PLIST
     C                   PARM                    FONT              1
     C*
     C                   MOVE      *BLANKS       RDATA
     C                   MOVEL     LINJE         RDATA
     C                   WRITE     RECORD
     C*
     C     FONT          IFEQ      '2'
     C                   MOVE      *BLANKS       RDATA
     C                   MOVEL     LINJE2        RDATA
     C                   WRITE     RECORD
     C                   ELSE
     C     FONT          IFEQ      '3'
     C                   MOVE      *BLANKS       RDATA
     C                   MOVEL     LINJE3        RDATA
     C                   WRITE     RECORD
     C                   ELSE
     C                   MOVE      *BLANKS       RDATA
     C                   MOVEL     LINJE4        RDATA
     C                   WRITE     RECORD
     C                   END
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
