     H
     FFAXUSRS   IF   E           K DISK
     D USERID          DS             8
     D FAXNBR          DS            32
     D TO              DS            40
     D TO1             DS            40
     D TO2             DS            40
     D TO3             DS            40
     D TITLE           DS            40
     D COMMEN          DS            40
     C                   SETON                                        LR
     C     *ENTRY        PLIST
     C     USERID        PARM      FUSERI        USERID
     C                   PARM      FFAXNB        FAXNBR
     C                   PARM      FTO           TO
     C                   PARM      FTO1          TO1
     C                   PARM      FTO2          TO2
     C                   PARM      FTO3          TO3
     C                   PARM      FTITLE        TITLE
     C                   PARM      FCOMME        COMMEN
     C     USERID        CHAIN     FAXUSRS                            01
     C   01              MOVEL     '*NF'         FUSERI
