      ***********************************************************
      *** PROGRAM SOM LAGER MELDINGSTEKST FOR  MANUELL EMAIL  ***
      ***********************************************************
     FFAXMANL1  IF   E           K DISK
     D                 DS
     D  LI01                   1     60
     D  LI02                  62    121
     D  LI03                 123    182
     D  LI04                 184    243
     D  LI05                 245    304
     D  LI06                 306    365
     D  LI07                 367    426
     D  LI08                 428    487
     D  LI09                 489    548
     D  LI10                 550    609
     D  LI11                 611    670
     D  LI12                 672    731
     D  LI13                 733    792
     D  LI14                 794    853
     D  LI15                 855    914
     D  LI16                 916    975
     D  LI17                 977   1036
     D  LI18                1038   1097
     D  LI19                1099   1158
     D  LI20                1160   1219
     D  LI21                1221   1280
     D  LI22                1282   1341
     D  LI23                1343   1402
     D  LI24                1404   1463
     D  DMELD1                 1    256
     D  DMELD2               257    512
     D  DMELD3               513    768
     D  DMELD4               769   1024
     D  DMELD5              1025   1280
     D  DMELD6              1281   1536
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UJOB              6
     C                   PARM                    MELD1           256
     C                   PARM                    MELD2           256
     C                   PARM                    MELD3           256
     C                   PARM                    MELD4           256
     C                   PARM                    MELD5           256
     C                   PARM                    MELD6           256
     C*
     C     UJOB          CHAIN     FAXMANL1                           33
     C     *IN33         IFEQ      '0'
     C                   MOVE      DMELD1        MELD1
     C                   MOVE      DMELD2        MELD2
     C                   MOVE      DMELD3        MELD3
     C                   MOVE      DMELD4        MELD4
     C                   MOVE      DMELD5        MELD5
     C                   MOVE      DMELD6        MELD6
     C                   ELSE
     C                   MOVEL     'NOTEXT'      MELD1
     C                   END
     C                   SETON                                        LR
     C                   RETURN
