      *
      **************************************************************
      *** AUTOMATISK OPPRETTING AV KUNDER SOM FAXBRUKERE         ***
      *** BESTILLINGSPROGRAM                                     ***
      ***                                                        ***
      *** PROGRAMMERT AV TORE BRÅSTAD, SYSTEMA AS, OKTOBER 1993  ***
      **************************************************************
      *
     FFAXOVF    CF   E             WORKSTN
     C*
     C     START         TAG
     C                   EXFMT     INFO
     C*
     C                   SETOFF                                       30
     C     *IN03         IFEQ      '1'
     C                   GOTO      ENDPGM
     C                   ELSE
     C     FIRKOD        IFNE      *BLANKS
     C                   CALL      'FAXOVFCL'
     C                   PARM                    FIRKOD
     C                   ELSE
     C                   MOVE      'TBR0080'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     ENDPGM        TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
