     FLISTE     O    F   70        PRINTER
     C                   EXCEPT    HEAD
     c                   seton                                        lr
     c                   return
     OLISTE     E            HEAD             01
     O                                            1 '.'
