     FPRIK      UP   E           K DISK
     C*
     C     PKKOLL        IFEQ      'X'
     C                   Z-ADD     1             PKPPR
     C                   UPDATE    PRIKR
     C                   END
