     FAMHE      UP   E             DISK
     C     AHADAT        IFGT      0
     C     AHADAT        ANDLT     19000000
     C                   MOVEL     1999          AHADAT
     C                   END
     C     AHBDAT        IFGT      0
     C     AHBDAT        ANDLT     19000000
     C                   MOVEL     1999          AHBDAT
     C                   END
     C                   UPDATE    AMHER
