     FBRIDF     UP   E             DISK
     C     BILIBL        IFEQ      'INCGIFULL'
     C                   MOVE      *BLANKS       BILIBL
     C                   MOVE      '1'           BISTDL
     C                   UPDATE    BRIDFR
     C                   END
