      * SLETTE KUNDER - VALG AVBRUDD / VIDERE ..
      * VALIDITY CHK PÅ WSPASS I SKJERMBILDET
     FFIXCUNFM  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   MOVE      '0'           UIN01
     C*
     C                   EXFMT     BILDE01
     C*
     C  N05              MOVE      *BLANKS       WSPASS
     C*
     C     WSPASS        IFEQ      *BLANKS
     C   03              MOVE      '1'           UIN01                          1=AVBRUDD
     C   05              MOVE      '1'           UIN01                          1=FEIL PASSO
     C                   ELSE                                                   0=KONTR.LIST
     C   05              MOVE      '2'           UIN01                          2=SLETT OK
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
