     FCUNDF     UP   E             DISK
     FKUNDL01   IF   E           K DISK
     F                                     RENAME(KUNDR:KUIBMR)
     FVADR      UF   E           K DISK
     FPRIK      UF   E           K DISK
     FFIRKU     IF   E           K DISK
     FFRATN     UF   E           K DISK
     FAVFRH     UF   E           K DISK
     FAVFRD     UF   E           K DISK
     FCUFLD     UF   E           K DISK
     FCUNDC01   UF   E           K DISK
     FCUNDMAF   UF   E           K DISK
     FCUOTI     UF   E           K DISK
     FCUSAAV    UF   E           K DISK
     FCUSAPR    UF   E           K DISK
     FFRATXT    UF   E           K DISK
     FSADL      UF   E           K DISK
     FKODTFFR   UF   E           K DISK
     FKODTCC    UF   E           K DISK
     FKAVT      UF   E           K DISK
     FOAVT      UF   E           K DISK
     FBRIDF     UF   E           K DISK
     FBRPARF    UF   E           K DISK
     FBRPRF     UF   E           K DISK
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C     KUND1K        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    KUNDNR
      * SKAL SENERE HENTES FRA FIRM..
     C**
     C     KUND1K        CHAIN     KUNDL01                            33
      * IKKE SLETT HVIS "ADRESSE-KUNDE"
     C     FIRMA         CHAIN     FIRKU                              34
     C     *IN33         IFEQ      '1'
     C     KUNDNR        ANDGE     FIKUFR
     C     KUNDNR        ANDLE     FIKUTI
     C                   MOVE      '0'           *IN33
     C                   END
     C* Finnes ikke i KUNDL01 - slett også i CUNDF
     C     *IN33         IFEQ      '1'
     C                   DELETE    KUNDR
     C* Vareadresser?
     C     KUND1K        SETLL     VADR
     C     KUND1K        READE     VADR                                   33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    VADRR
     C     KUND1K        READE     VADR                                   33
     C                   END
     C* Gebyravtaler?
     C                   MOVE      KUNDNR        KUNDNA            8
     C     KUNDNA        SETLL     PRIK
     C     KUNDNA        READE     PRIK                                   33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    PRIKR
     C     KUNDNA        READE     PRIK                                   33
     C                   END
     C* Fraktavtaler?
     C     KUNDNR        SETLL     FRATN
     C     KUNDNR        READE     FRATN                                  33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    FRATR
     C     KUNDNR        READE     FRATN                                  33
     C                   END
      * Postal..header
     C     KUNDNR        SETLL     AVFRH
     C     KUNDNR        READE     AVFRH                                  33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    AVFRHR
      * ........detalj
     C     AFAVNR        SETLL     AVFRD
     C     AFAVNR        READE     AVFRD                                  34
     C     *IN34         DOWEQ     '0'
     C                   DELETE    AVFRDR
     C     AFAVNR        READE     AVFRD                                  34
     C                   END
      *
     C     KUNDNR        READE     AVFRH                                  33
     C                   END
     C* Samle-fakt AVD-avvik
     C     KUNDNR        SETLL     CUSAAV
     C     KUNDNR        READE     CUSAAV                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUSAAVR
     C     KUNDNR        READE     CUSAAV                                 33
     C                   END
     C* Samle-fakt PROFIL
     C     KUNDNR        SETLL     CUSAPR
     C     KUNDNR        READE     CUSAPR                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUSAPRR
     C     KUNDNR        READE     CUSAPR                                 33
     C                   END
     C* Samle-fakt (eller andre dokument..) FELT-liste
     C     KUNDNR        SETLL     CUFLD
     C     KUNDNR        READE     CUFLD                                  33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUFLDR
     C     KUNDNR        READE     CUFLD                                  33
     C                   END
     C* Oppdragstillegg (via frisøk)
     C     KUND1K        SETLL     CUOTI
     C     KUND1K        READE     CUOTI                                  33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUOTIR
     C     KUND1K        READE     CUOTI                                  33
     C                   END
     C* Miljøavgift
     C     KUND1K        SETLL     CUNDMAF
     C     KUND1K        READE     CUNDMAF                                33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUNDMAFR
     C     KUND1K        READE     CUNDMAF                                33
     C                   END
     C* Kontaktpersoner
     C     KUND1K        SETLL     CUNDC01
     C     KUND1K        READE     CUNDC01                                33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    CUNDCR
     C     KUND1K        READE     CUNDC01                                33
     C                   END
     C* Fritekster  ?
     C     KUNDNR        SETLL     FRATXT
     C     KUNDNR        READE     FRATXT                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    FRATXTR
     C     KUNDNR        READE     FRATXT                                 33
     C                   END
     C* Kunders varekatalog SAD ?
     C     KUNDNR        SETLL     SADL
     C     KUNDNR        READE     SADL                                   33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    SADLR
     C     KUNDNR        READE     SADL                                   33
     C                   END
     C* Flyfraktrater  ?
     C     KUNDNR        SETLL     KODTFFR
     C     KUNDNR        READE     KODTFFR                                33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    KODTFFRR
     C     KUNDNR        READE     KODTFFR                                33
     C                   END
     C* CC-fee / tillegg bankkurs ?
     C     KUND1K        SETLL     KODTCC
     C     KUND1K        READE     KODTCC                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    KODTCCR
     C     KUND1K        READE     KODTCC                                 33
     C                   END
     C* Avtale om bytt til motpartens avtale
     C     KUNDNR        SETLL     KAVT
     C     KUNDNR        READE     KAVT                                   33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    KAVTR
     C     KUNDNR        READE     KAVT                                   33
     C                   END
     C* Avtale om bytt oppdargstype fra/til
     C     KUNDNR        SETLL     OAVT
     C     KUNDNR        READE     OAVT                                   33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    OAVTR
     C     KUNDNR        READE     OAVT                                   33
     C                   END
     C* Esped brukerid  (felles fil ved flerfirma)
     C     *loval        SETLL     BRIDF
     C                   READ      BRIDF                                  33
     C     *IN33         DOWEQ     '0'
     c     BIKUNR        ifeq      KUNDNR
     c     BIFIRM        andeq     FIRMA
     C                   DELETE    BRIDFR
     C* parameter på denne brukerID
     C     BIBRID        SETLL     BRPARF
     C     BIBRID        READE     BRPARF                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    BRPARFR
     C     BIBRID        READE     BRPARF                                 33
     C                   END
     C                   END
     C                   READ      BRIDF                                  33
     C                   END
     C* Esped produkt/meny knyttet til denne kunde
     C     KUNDNR        SETLL     BRPRF
     C     KUNDNR        READE     BRPRF                                  33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    BRPRFR
     C     KUNDNR        READE     BRPRF                                  33
     C                   END
      *
      *
     C                   END
