     Fheaddt    UF   E           K DISK
     C                   z-add     05052022      dato              8 0
     C     dato          SETLL     headdt
     C     *IN33         DOUEQ     '1'
     C     dato          READE     headdt                                 33
     C     *IN33         IFNE      '1'
     C                   z-add     20220505      hedtop
     C                   UPDATE    headfr
     C                   END
     C                   END
     C                   SETON                                        LR
     C                   RETURN
