     FDOKUFM    UP   E           K DISK
     D                 DS
     D  FMRI                   1      1
     D  FMAVD                  2      5  0
     D  FMOPD                  6     10  0
     D  FMFBNR                11     13  0
     D  FMLINR                14     15  0
     D  FMMKNR                16     17  0
     D  FMLONR                18     19  0
     D  FM19                   1     19
     C     FM19          IFEQ      X19
     C                   DELETE    DOKUFMR
     C                   ELSE
     C                   UPDATE    DOKUFMR
     C                   MOVE      FM19          X19              19
     C                   END
