     FSTANDE    UP   E             DISK
      *
     C     XEPIN         IFEQ      0
     C     *ENTRY        PLIST
     C                   PARM                    UEPIN             6
     C                   PARM                    UEPUT             6
     C                   MOVE      UEPIN         XEPIN             6 0
     C                   MOVE      UEPUT         XEPUT             6 0
     C                   END
     C     S3039E        IFEQ      XEPIN
     C                   MOVE      XEPUT         S3039E
     C                   UPDATE    STANDER
     C                   END
      *
