     FFAK8      UP   E           K DISK
     C     FAAVD         IFEQ      525
     C     FAOPD         IFEQ      XOPD
     C                   ADD       1             XLI
     C                   ELSE
     C                   Z-ADD     1             XLI               5 0
     C                   MOVE      FAOPD         XOPD              5 0
     C                   END
     C                   MOVE      XLI           FALI
     C                   END
     C                   UPDATE    FAKTR
