      * FILEN FAK99X INKLUDERER BARE LINJENR 99
      * DET KAN VÆRE FLERE MED 99 PÅ SAMME OPPDRAG=PROBLEM STAT-REGEN.
      * FOR ENKLEST MULIG Å FIXE:
      * ALLE SOM ER 99 FRA FØR RENUMERESES TIL HØYESTE (100,101...)
      * FAKDA SETTEL LIK I ="INTERNOVERFØRT" SOM FLAGG TIL SYTR12A M.M.
     FFAK99X    UP   E             DISK
     C                   MOVE      'I'           FAKDA
     C                   MOVE      *ZEROS        FALI
     C                   CALL      'SYGE06'
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FALI
     C                   UPDATE    FAKTR
