     FFAKT      UP   E             DISK
     D                 DS
     D  FAVT                   1     20
     D  FAVTA                  1      5
     C     FAVK          IFEQ      'FRA'
     C     FAVTA         IFEQ      '*AVR*'
     C     FAVTA         OREQ      '*AVF*'
     C                   DELETE    FAKTR
     C                   END
     C                   END
