      *
     FFRATN     UP   E           K DISK
     C     FTDT          IFEQ      20000000
     C                   MOVE      *ZEROS        FTDT
     C                   UPDATE    FRATR
     C                   END
