      *
     FKUNDL01   UF   E           K DISK
     C     KUNKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    KUNDNR
     C                   CLEAR                   FIRMA
     C                   CLEAR                   KUNDNR
     C*
     C     KUNKEY        SETLL     KUNDL01
     C*
     C     LES           TAG
     C                   READ      KUNDL01                                50
     C     *IN50         IFEQ      *OFF
     C                   MOVE      'J'           KUTDR
     C                   UPDATE    KUNDR
     C                   GOTO      LES
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
