     Farktxt    IP   E             DISK
     Fkofast    O  a E             DISK
     C                   movel     artype        artyp1            1
     c     artyp1        ifne      'Z'
     c                   eval      kftyp='FUNKSJON'
     c                   eval      kfkod=artype
     c                   eval      kftxt=artxt
     c                   eval      kftxte=artxt
     c                   write     kofastr
     c                   end
