     FCUNDF     IP   E             DISK
     FWRKK      UF   E           K DISK
     FKUNDF     O    E             DISK
     F                                     RENAME(KUNDR:KUNDR1)
     FKKUNF     O    E             DISK
     D                UDS
     D  FIFIRM                 1      2
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C                   MOVE      FIFIRM        WFIR
     C     WRKKEY        KLIST
     C                   KFLD                    WFIR
     C                   KFLD                    WKNR
     C*
     C                   MOVE      KUNDNR        WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C     *IN44         IFEQ      '0'
     C     SONAVN        IFEQ      '*ENGANG*'
     C                   MOVEL     KNAVN         SONAVN
     C                   END
     C                   MOVE      *BLANKS       KHENV
     C     SYSTAT        IFEQ      '01 '
     C                   MOVEL     '01 '         KHENV
     C                   END
     C     SYSTAT        IFEQ      '10 '
     C                   MOVEL     '10 '         KHENV
     C                   END
     C     SYSTAT        IFEQ      '11 '
     C                   MOVEL     '14 '         KHENV
     C                   END
     C     SYSTAT        IFEQ      '14 '
     C                   MOVEL     '11 '         KHENV
     C                   END
     C     SYSTAT        IFEQ      '93 '
     C                   MOVEL     '93 '         KHENV
     C                   END
     C     KHENV         IFEQ      '11 '
     C     KHENV         OREQ      '14 '
     C                   MOVE      'J'           GNOTAK
     C                   MOVE      'J'           GNOTKD
     C                   ELSE
     C                   MOVE      ' '           GNOTAK
     C                   MOVE      ' '           GNOTKD
     C                   END
     C                   MOVE      'J'           PKOD
     C                   MOVE      ' '           AKONT
     C                   MOVE      'D'           RKOD
     C                   MOVE      'J'           PGEBYR
     C                   MOVE      'J'           KUTDR
     C                   WRITE     KUNDR1
     C                   WRITE     KKUNR
     C                   DELETE    WRKKR
     C                   END
     C*
