     FKOSTA4    IF   E           K DISK
     FLEVEF     UP   E             DISK
     FLRESLALL  IF   E           K DISK
     FFIRM      IF   E           K DISK
     FLISTE     O    F  132        PRINTER OFLIND(*INOF)
     D                 DS
     D  DAOAAR                 1      4  0
     D  DAOMND                 5      6  0
     D  DAODAG                 7      8  0
     D  oppret                 1      8  0
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  datest                 1      8  0
     C     *ENTRY        PLIST
     C                   PARM                    UPD               1
      *
     C     FÿRSTE        IFEQ      ' '
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C     XULMM         ifgt      1
     C     XULMM         sub       1             ULMM
     c                   z-add     XUL≈≈         UL≈≈
     c                   else
     C     XUL≈≈         sub       1             UL≈≈
     c                   z-add     12            UL≈≈
     C                   end
     C                   MOVE      'N'           FÿRSTE            1
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     KOSKEY        KLIST
     C                   KFLD                    LEVNR
     C     LREKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    LEVNR
     C                   END
      * 1. FORUTSETNING - RIKTIG FIRMA, SALDO = 0
     C     FIRMA         IFEQ      FIFIRM
     C     KSALDO        ANDEQ     0
      *
      * 2. FORUTSETNING - FINNES IKKE LRES-POSTER
     C     LREKEY        CHAIN     LRESLALL                           33
     C     *IN33         IFEQ      '1'
      * 3. FORUTSETNING - FINNES IKKE I SYSPED
     C     KOSKEY        CHAIN     KOSTA4                             33
     C     *IN33         IFEQ      '1'
      * 4  ikke opprettet f¯r siste mÂned
      *
     c     oppret        iflt      datest
     C                   MOVE      AKTKOD        GMLAKT            1
     C     UPD           IFEQ      'J'
     C                   SETON                                        50
     C                   MOVE      'I'           AKTKOD
     C                   UPDATE    LEVER
     C                   END
      * PRINT
     C                   EXCEPT    DET
     C                   END
     C                   END
     C                   END
     C                   END
     OLISTE     E            DET            1
     O              N50                          16 'VIL BLI INAKT.:'
     O               50                          16 'MERKET INAKTIV:'
     O                       FIRMA               25
     O                       LEVNR         Z     34
     O                       LNAVN               65
     O                       POSTNR              70
     O                       ADR3               102
     O                                          112 'GML KODE:'
     O                       GMLAKT             114
