     FLLagjs02  UF A E           K DISK
     FLLAGJD01  IF A E           K DISK
     D                SDS
     D  ZJOB                 244    253
     D  ZUSER                254    263
     D  ZJOBNR               264    269  0
     D                 DS
     D  WTIME                  1     14  0
     D  WTM                    1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D  DATO                   1      8  0
     D  DTÅ                    1      4  0
     D  DTM                    5      6  0
     D  DTD                    7      8  0
     C     KEY           KLIST
     C                   KFLD                    GRNR
     C                   KFLD                    KUNR
     C                   move      *zeros        GRNR              8 0
     C                   z-add     175           KUNR              8 0
     C     AGJKEY        KLIST
     C                   KFLD                    VAGRUP
     C                   KFLD                    VAKJED
     C                   KFLD                    VAMN
     C     AGDKEY        KLIST
     C                   KFLD                    VAGRUP
     C                   KFLD                    VAKJED
     C                   KFLD                    VAMN
     C                   KFLD                    VDVN
      *
     C                   TIME                    WTIME
     C                   MOVE      WDD           DTD
     C                   MOVE      WMM           DTM
     C                   MOVE      WÅÅ           DTÅ
      *
      * LES ALLE art for frakunde
     C     KEY           setll     LLagjs02
     C     KEY           READE     LLagjs02                               33
     C     *IN33         DOWEQ     *OFF
     c                   z-add     VAOANT        xxOANT            7 0
     c                   z-add     VASALD        xxSALD            7 0
     c                   z-add     VASAE0        xxSAE0            7 0
     c                   z-add     VASAE1        xxSAE1            5 0
     c                   z-add     VASAE2        xxSAE2            5 0
     c                   z-add     VASAE3        xxSAE3            5 0
     c                   z-add     VAVKTS        xxVKTS            7 2
     c                   z-add     VAKUBS        xxKUBS            7 4
      * Sett saldo til 0 på kunde som avgir
     c                   z-add     0             VASALD            7 0
     c                   z-add     0             VASAE0            7 0
     c                   z-add     0             VASAE1            5 0
     c                   z-add     0             VASAE2            5 0
     c                   z-add     0             VASAE3            5 0
     c                   z-add     0             VAVKTS            7 2
     c                   z-add     0             VAKUBS            7 4
     C                   update    llagjr
      *
      * skrive en "manuell" uttakspost - finn først sit brukte linjenr
     C                   MOVE      999           VDVN
     C     AGDKEY        SETLL     LLAGJD01
     C     AGJKEY        READPE    LLAGJD01                               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      VAGRUP        VDGRUP
     C                   MOVE      VAKJED        VDKJED
     C                   MOVE      VAMN          VDMN
     C                   MOVE      *ZEROS        VDVN
     C                   END
     C                   ADD       1             VDVN
      *
     C                   MOVE      *ZEROS        VDMNL
     C                   MOVE      *ZEROS        VDVNL
     C                   MOVE      DATO          VDLDAT
     C                   Z-ADD     XXSALD        VDLANT
     C                   Z-ADD     xxSAE0        VDSAE0
     C                   Z-ADD     xxSAE1        VDSAE1
     C                   Z-ADD     xxSAE2        VDSAE2
     C                   Z-ADD     xxSAE3        VDSAE3
     C                   MOVE      *BLANKS       VDTEXT
     C                   EVAL      VDTEXT='UTGÅENDE BALANSE ETTER TELLING'
     C                   MOVE      'LAGOT'       VDLTYP
     C                   MOVE      ' '           VDST
     C                   MOVE      *ZEROS        VDDAGE
     C                   MOVE      *ZEROS        VDAVD
     C                   MOVE      *ZEROS        VDOPD
     C                   MOVE      *ZEROS        VDFBNR
     C                   MOVE      ZUSER         VDBUSE
     C                   Z-ADD     DATO          VDBDAT
     C                   Z-ADD     WTM           VDBKL
     C                   WRITE     LLAGJDR
      *
      *
      *
      * Ny kunde overtar varen inkl. saldo. (oppl-ant=saldo Mrap=1)
     C                   z-add     0             VAGRUP
     C                   z-add     101           VAKJED
     c                   z-add     1             VAMRNR
     C                   z-add     0             VAAVD
     C                   z-add     0             VAOPD
     C                   z-add     0             VAFBNR
     c                   z-add     xxSALD        VAOANT
     c                   z-add     xxSALD        VASALD
     c                   z-add     xxSAE0        VASAE0
     c                   z-add     xxSAE1        VASAE1
     c                   z-add     xxSAE2        VASAE2
     c                   z-add     xxSAE3        VASAE3
     c                   z-add     xxVKTS        VAVKTS
     c                   z-add     xxKUBS        VAKUBS
     C                   WRITE     llagjr
     C     KEY           READE     LLagjs02                               33
     C                   END
      *
     c                   seton                                        LR
     c                   return
