********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
PTF8X * 01 SH  IKKE BILAG MED POSTER I  SYSPED
********************************************************************
     FKOSTA4  UP  E                    DISK
     FLEVEF   UP  E                    DISK
     FLRESLALLIF  E           K        DISK
     FFIRM    IF  E           K        DISK
     FLISTE   O   F     132     OF     PRINTER
     C           *ENTRY    PLIST
     C                     PARM           UPD     1
      *
     C           FØRSTE    IFEQ ' '
     C                     MOVE 'N'       FØRSTE  1
     C           *LOVAL    SETLLFIRM
     C                     READ FIRM                     33
N01  C           KOSKEY    KLIST
N01  C                     KFLD           LEVNR
     C           LREKEY    KLIST
     C                     KFLD           FIRMA
     C                     KFLD           LEVNR
     C                     END
      * 1. FORUTSETNING - RIKTIG FIRMA, SALDO = 0
     C           FIRMA     IFEQ FIFIRM
     C           KSALDO    ANDEQ0
      *
      * 2. FORUTSETNING - FINNES IKKE LRES-POSTER
     C           LREKEY    CHAINLRESLALL             33
     C           *IN33     IFEQ '1'
N01   * 3. FORUTSETNING - FINNES IKKE I SYSPED
N01  C           LREKEY    CHAINLRESLALL             33
N01  C           *IN33     IFEQ '1'
     C                     MOVE AKTKOD    GMLAKT  1
     C           UPD       IFEQ 'J'
     C                     SETON                     50
     C                     MOVE 'I'       AKTKOD
     C                     UPDATLEVER
     C                     END
      * PRINT
     C                     EXCPTDET
     C                     END
     C                     END
N01  C                     END
     OLISTE   E  1             DET
     O                N50                16 'VIL BLI INAKT.:'
     O                 50                16 'MERKET INAKTIV:'
     O                         FIRMA     25
     O                         LEVNR Z   34
     O                         LNAVN     65
     O                         POSTNR    70
     O                         ADR3     102
     O                                  112 'GML KODE:'
     O                         GMLAKT   114
