      * OBS!!! DETTE ENDRER ALLE (SOM LIGGER I FILA) FRA N -> J
      * DERSOM SAMME GEBYR-KODE BENYTTE BÅDE FOR NORSKE/UTENLANDSKE
      * (ELLER FOR IMP/EKSP) SLIK AT NOE SKAL UNNTAS MÅ DETTE
      * HÅNDTERES MANUELT...
      * ENTEN VED Å LA VÆRE Å LEGGE INN AKUELT GEBYR I FILA
      * ELLER VED Å ENDRE TILBAKE ETTERPÅ DE SOM IKKE SKAL HA J
      *
     FPRIK      UP   E           K DISK
     FFIXMVANJ  IF   E           K DISK
     FLISTE     O    F  132        PRINTER OFLIND(*INOF)
     C     *IN99         IFEQ      *OFF
     C                   Z-ADD     1             SIDE              4 0
     C                   TIME                    TID               6 0
     C                   EXCEPT    PHEAD
     C                   MOVE      *ON           *IN99
     C                   END
     C   OF              ADD       1             SIDE              4 0
     C   OF              EXCEPT    PHEAD
     C   OF              SETOFF                                       OF         OVERFLOW
     C*
     C     PKMVA         IFNE      'J'
     C     PKGEBY        CHAIN     FIXMVANJ                           44
     C     *IN44         IFEQ      '0'
     C                   MOVE      'J'           PKMVA
     C                   UPDATE    PRIKR
     C                   EXCEPT    DET
     C                   END
     C                   END
     OLISTE     E            PHEAD            02
     O                                           24 '** ENDRING MVA N -> J **'
     O                                           50 '(BASERT PÅ GEB. INN'
     O                                           71 'LAGT I FIL FIXMVANJ)'
     O                                           86 'KJØRT DATO:'
     O                       UDATE         Y     96
     O                                          101 'TID:'
     O                       TID                110 '0  :  :  '
     O                                          120 'SIDE:'
     O                       SIDE          Z    125
     OLISTE     E            PHEAD            05
     O                                           24 ' KUNDE     TN GEB  INTER'
     O                                              'V  OTIO  OT01  FRIO FR01'
     OLISTE     E            PHEAD            06
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O                       *PLACE              96
     O                       *PLACE             120
     O                                          132 '------------'
     OLISTE     E            DET         1
     O                       PKKNR                8
     O                       PKAVTN              12
     O                       PKGEBY              18
     O                       PKINT               25
     O                       PKOTIO              30
     O                       PKOT01              35
     O                       PKFRIO              40
     O                       PKFR01              45
