      *
      *
      ************************************************************
      *** PROGRAM SKAL ENDRE STATUS PÅ OPPDRAG                 ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-97                 ***
      ************************************************************
      *
     FKODTSF    IF   E           K DISK
     FHEADF     UF   E           K DISK
     FTRAN      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSTS       UF A E           K DISK
     FFIXOPDFM  CF   E             WORKSTN
     D                 DS
     D  WSVALP                 1      3  1
     D  HEVALP                 1      3  3
     D                 DS
     D  HEGN                   1     15
     D  WSGN                   5     15
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  HEDTD                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTÅ                  8      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTRD                 1      2  0
     D  WSDTRM                 3      4  0
     D  WSDTRÅ                 5      6  0
     D  WSDTR                  1      6  0
     D                 DS
     D  WSFDD                  1      2  0
     D  WSFDM                  3      4  0
     D  WSFDÅ                  5      6  0
     D  WSSDFD                 1      6  0
     D                 DS
     D  TRFDD                  1      4  0
     D  TRFDM                  5      6  0
     D  TRFDÅ                  7      8  0
     D  TRSDFD                 1      8  0
     D                 DS
     D  WSTDD                  1      2  0
     D  WSTDM                  3      4  0
     D  WSTDÅ                  5      6  0
     D  WSSDTD                 1      6  0
     D                 DS
     D  TRTDD                  1      4  0
     D  TRTDM                  5      6  0
     D  TRTDÅ                  7      8  0
     D  TRSDTD                 1      8  0
     D                 DS
     D  WSFFD                  1      2  0
     D  WSFFM                  3      4  0
     D  WSFFÅ                  5      6  0
     D  WSSFFD                 1      6  0
     D                 DS
     D  TRFFD                  1      4  0
     D  TRFFM                  3      6  0
     D  TRFFÅ                  5      8  0
     D  TRSFFD                 1      8  0
     D                 DS
     D  WSVTD                  1      2  0
     D  WSVTM                  3      4  0
     D  WSVTÅ                  5      6  0
     D  WSSVTD                 1      6  0
     D                 DS
     D  TRVTD                  1      4  0
     D  TRVTM                  5      6  0
     D  TRVTÅ                  7      8  0
     D  TRSVTD                 1      8  0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      6  0
     D  XDAG                   7      8  0
     D  XMND                   9     10  0
     D  XAAR                  11     14  0
     D                 DS
     D  SSDTÅ                  1      4  0
     D  SSDTM                  5      6  0
     D  SSDTD                  7      8  0
     D  SSDT                   1      8  0
NRFA D                 DS
NRFA D  HERFA                  1     35
NRFA D  HERFA15                1     15
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       999830
     C*
     C   03              GOTO      SLUTT
     C     HEADFK        CHAIN     HEADF                              99
     C   99              DO
     C                   MOVE      'SPO0001'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     HEUR          IFNE      'A'
     C     HEUR          ANDNE     'B'
     C     HEUR          ANDNE     'C'
     C     HEUR          ANDNE     'D'
     C     HEUR          ANDNE     'E'
     C     HEUR          ANDNE     'F'
     C     HEUR          ANDNE     'G'
     C     HEUR          ANDNE     'H'
     C                   MOVE      'JOV0082'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              DO
     C                   EXCEPT    DUMHE
     C                   MOVE      'SPS0001'     MSGNR
     C                   GOTO      START
     C                   END
     C*
     C                   MOVE      *BLANKS       WSTRNV           18
     C     HEUR          IFNE      'D'
     C     HEUR          ANDNE     'E'
     C     TRANK         CHAIN     TRAN                               33
     C  N33              MOVEL     VMNAVN        WSTRNV
     C                   MOVE      HEDTRD        WSDTRD
     C                   MOVE      HEDTRM        WSDTRM
     C                   MOVE      HEDTRÅ        WSDTRÅ
     C                   MOVE      HEDTD         WSDTD
     C                   MOVE      HEDTM         WSDTM
     C                   MOVE      HEDTÅ         WSDTÅ
     C                   END
     C*
     C     START2        TAG
     C                   EXSR      KDTFM
     C     HEUR          IFEQ      'A'
     C                   EXFMT     BILDEFA
     C                   END
     C     HEUR          IFEQ      'B'
     C                   EXFMT     BILDEEX
     C                   END
     C     HEUR          IFEQ      'C'
     C                   EXFMT     BILDEFI
     C                   END
     C     HEUR          IFEQ      'E'
     C     HEUR          OREQ      'D'
     C     HEKNT         IFEQ      0
     C                   MOVE      *BLANKS       KFSNAV
     C                   ELSE
     C                   MOVE      HEKNT         HEKNF
     C     KODSFK        CHAIN     KODTSF                             33
     C                   END
     C                   END
     C     HEUR          IFEQ      'E'
     C                   EXFMT     BILDEIN
     C                   END
     C     HEUR          IFEQ      'D'
     C                   EXFMT     BILDEEF
     C                   END
     C     HEUR          IFEQ      'F'
     C                   EXFMT     BILDESJ
     C                   END
     C     HEUR          IFEQ      'G'
     C                   EXFMT     BILDESE
     C                   END
     C     HEUR          IFEQ      'H'
     C                   MOVE      TRFDD         WSFDD
     C                   MOVE      TRFDM         WSFDM
     C                   MOVE      TRFDÅ         WSFDÅ
     C                   MOVE      TRTDD         WSTDD
     C                   MOVE      TRTDM         WSTDM
     C                   MOVE      TRTDÅ         WSTDÅ
     C                   MOVE      TRFFD         WSFFD
     C                   MOVE      TRFFM         WSFFM
     C                   MOVE      TRFFÅ         WSFFÅ
     C                   MOVE      TRVTD         WSVTD
     C                   MOVE      TRVTM         WSVTM
     C                   MOVE      TRVTÅ         WSVTÅ
     C                   EXSR      KDTFM2
     C                   EXFMT     BILDETR
     C                   END
     C                   EXSR      KDTFM
     C*
     C  N05
     CANN12              GOTO      START2
     C   12              EXCEPT    DUMHE
     C   12              GOTO      START
     C*
     C     START3        TAG
     C                   TIME                    XTIME
     C                   MOVE      XAAR          SSDTÅ
     C                   MOVE      XMND          SSDTM
     C                   MOVE      XDAG          SSDTD
     C                   MOVE      XTID          SSTM
     C     STSK          CHAIN     STS                                33
     C  N33              GOTO      START3
     C                   MOVE      WSAVD         SSAVD
     C                   MOVE      WSOPD         SSOPD
     C                   MOVE      WSUSER        SSUSR
     C                   MOVE      WSSG          SSSG
     C                   MOVE      HEUR          SSRTYP
     C                   MOVE      HEST          SSSTG
     C                   MOVE      WSST          SSSTN
     C                   WRITE     STSR
     C*
     C                   MOVE      WSST          HEST
     C                   EXCEPT    ENDRE
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSST
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
     C     HEADFK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     STSK          KLIST
     C                   KFLD                    SSDT
     C                   KFLD                    SSTM
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSUSER
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    HEKNT
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
     C*
     C                   MOVE      'SF'          WSFUNI            2
     C                   MOVE      *ZEROS        WSDT
     C                   MOVE      *ZEROS        WSDTR
     C                   MOVE      *ZEROS        WSSDFD
     C                   MOVE      *ZEROS        WSSDTD
     C                   MOVE      *ZEROS        WSSFFD
     C                   MOVE      *ZEROS        WSSVTD
     C                   MOVE      *ZEROS        HEDTR
     C                   MOVE      *ZEROS        HEDT
     C                   MOVE      *ZEROS        TRSDFD
     C                   MOVE      *ZEROS        TRSDTD
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSVTD
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM         BEGSR
     C***********************************************
     C                   MOVE      WSDTRD        UDT1              2 0
     C                   MOVE      WSDTRM        UDT2              2 0
     C                   MOVE      WSDTRÅ        UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTRD
     C                   MOVE      UDT2          WSDTRM
     C                   MOVE      UDT3          WSDTRÅ
     C                   MOVE      HEDTD         UDT1
     C                   MOVE      HEDTM         UDT2
     C                   MOVE      HEDTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          HEDTD
     C                   MOVE      UDT2          HEDTM
     C                   MOVE      UDT3          HEDTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM2        BEGSR
     C***********************************************
     C                   MOVE      WSFDD         UDT1              2 0
     C                   MOVE      WSFDM         UDT2              2 0
     C                   MOVE      WSFDÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSFDD
     C                   MOVE      UDT2          WSFDM
     C                   MOVE      UDT3          WSFDÅ
     C                   MOVE      WSTDD         UDT1              2 0
     C                   MOVE      WSTDM         UDT2              2 0
     C                   MOVE      WSTDÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSTDD
     C                   MOVE      UDT2          WSTDM
     C                   MOVE      UDT3          WSTDÅ
     C                   MOVE      WSFFD         UDT1              2 0
     C                   MOVE      WSFFM         UDT2              2 0
     C                   MOVE      WSFFÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSFFD
     C                   MOVE      UDT2          WSFFM
     C                   MOVE      UDT3          WSFFÅ
     C                   MOVE      WSVTD         UDT1              2 0
     C                   MOVE      WSVTM         UDT2              2 0
     C                   MOVE      WSVTÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSVTD
     C                   MOVE      UDT2          WSVTM
     C                   MOVE      UDT3          WSVTÅ
      *
     C                   ENDSR
      *
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
     OHEADFR    E            ENDRE
     O                       HEST
     OHEADFR    E            DUMHE
