     Fponrn     IP   E           K DISK
     Fsted2d    IF A E           K DISK
      * hvis PostNrType(Kort) er..
     c     PONTYK        Ifeq      'Stedsnavn '
     c     PONTYK        oreq      'Gate/vei a'
     c     PONTYK        oreq      'Kjent sted'
     c     PONTYK        oreq      'Postmottak'
     c                   clear                   Sted2r
     c     Sted2Key      klist
     c                   kfld                    St2LK
     c                   kfld                    St2KOD
     C                   move      'NO'          St2LK
     C                   movel     PONNR         St2KOD
     C     Sted2Key      CHAIN     STED2d                             33
     C     *in33         IFEQ      *ON
     c                   Movel     PONNAV        ST2NVN
     c                   Move      1             ST2son
     c                   write     sted2r
     C                   END                                                      3<-E
     C                   END                                                     2<-E
