     Fponrn     UP   E           K DISK
      *
     C     PONNR         ifge      '0001'
     C     PONNR         andle     '9999'
     C                   EVAL      PONNAV = %trim(PONNAV)
     C                   EVAL      PONKNA = %trim(PONKNA)
     c                   update    PONRNR
     c                   endif
