      *
     FPRIK      UP   E           K DISK
     C     PKDT          IFEQ      20000000
     C                   MOVE      *ZEROS        PKDT
     C                   UPDATE    PRIKR
     C                   END
