     FGSSORF    UP   E             DISK
     C     ORDTWL        IFEQ      20000000
     C                   MOVE      *ZEROS        ORDTWL
     C                   END
     C                   UPDATE    GSSORFR
