     FQ         IF   F 1024        DISK
     FSVTKD     UF A E           K DISK
     IQ         AA
     I                                  1    4  Q_KD
     I                                  5  104  Q_LBS
     C     SVTKDKEY      KLIST
     C                   KFLD                    ZVKD_IE           1
     C                   KFLD                    ZVKD_TYP          3
     C                   KFLD                    ZVKD_KD          10
     C                   EVAL      ZVKD_IE='A'
     C                   EVAL      ZVKD_TYP='MCF'
     C
     C                   READ      Q                                      51
     C     *IN51         DOWEQ     *OFF

     C                   EVAL      ZVKD_KD=Q_KD
     C     SVTKDKEY      CHAIN     SVTKD                              52
     C                   IF        *IN52
     C                   CLEAR                   SVTKDR
     C                   EVAL      SVKD_IE='A'
     C                   EVAL      SVKD_TYP='MCF'
     C                   MOVEL     Q_KD          SVKD_TYP
     C                   EVAL      SVKD_DTS=20010101
     C                   EVAL      SVKD_DTE=29991231
     C                   MOVEL     Q_LBS         SVKD_KBE
     C                   MOVEL     Q_LBS         SVKD_KBS
     C                   EVAL      SVKD_LBE=Q_LBS
     C                   EVAL      SVKD_LBS=Q_LBS
     C                   WRITE     SVTKDR
     C                   ELSE
     C                   EVAL      SVKD_LBE=Q_LBS
     C                   EVAL      SVKD_LBS=Q_LBS
     C                   UPDATE    SVTKDR
     C                   ENDIF

     C                   READ      Q                                      51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
