     FSADSD     UP   E             DISK
     C     SDKDAÆ        IFEQ      'MV'
     C     SDBLSÆ        IFEQ      24
     C     SDBLSÆ        OREQ      12
     C                   Z-ADD     20050101      SDDTT
     C                   UPDATE    SADSDR
     C                   END
     C                   END
