     FSTED2     UP   E             DISK
     C     ST2KOD        IFEQ      '  '
     C                   movel     st2nvn        dummy            30
     C                   DELETE    sted2R
     C                   END
