     FEDIS      UF   E           K DISK
     FFIXTVINF  IF   E           K DISK
      *
     C     *LOVAL        SETLL     FIXTVINF
     C                   READ      FIXTVINF                               33
     C                   DOW       *IN33 = *OFF
     C                   EVAL      SST = 'A'
     C                   UPDATE    EDISR
     C                   LEAVE
     C                   READ      FIXTVINF                               33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
