nt    * kall på sytr12a
      *
     FKODTSF    IF   E           K DISK
     FTURER     UF   E           K DISK
     FTRAVH1    UF   E           K DISK
     FTRAVV     IF   E           K DISK
     FKOSBU     UF   E           K DISK
     FFIXTUAFM  CF   E             WORKSTN
     D                 DS
EV5  D  TUDTÅ                  1      4  0
EV5  D  TUDTM                  5      6  0
EV5  D  TUDTD                  7      8  0
EV5  D  TUDT                   1      8  0
NV5  D                 DS
NV5  D  WSDTD                  1      2  0
NV5  D  WSDTM                  3      4  0
NV5  D  WSDTÅ                  5      6  0
NV5  D  WSDT                   1      6  0
     D                 DS
EV5  D  TUDTTÅ                 1      4  0
EV5  D  TUDTTM                 5      6  0
EV5  D  TUDTTD                 7      8  0
EV5  D  TUDTT                  1      8  0
NV5  D                 DS
NV5  D  WSDTTD                 1      2  0
NV5  D  WSDTTM                 3      4  0
NV5  D  WSDTTÅ                 5      6  0
NV5  D  WSDTT                  1      6  0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       999830
     C*
     C   03              GOTO      SLUTT
     C     TURK          CHAIN(N)  TURER                              99
     C   99              DO
     C                   MOVE      'SPT0002'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C*
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              DO
     C                   MOVE      'SPS0001'     MSGNR
     C                   GOTO      START
     C                   END
     C*
NV5  C                   MOVE      TUDTD         WSDTD
NV5  C                   MOVE      TUDTM         WSDTM
NV5  C                   MOVE      TUDTÅ         WSDTÅ
NV5  C                   MOVE      TUDTTD        WSDTTD
NV5  C                   MOVE      TUDTTM        WSDTTM
NV5  C                   MOVE      TUDTTÅ        WSDTTÅ
     C*
     C     START2        TAG
     C     TURK          CHAIN(N)  TRAVH1                             33
     C   33              MOVE      ' '           THST
     C   33              MOVE      *ZEROS        THTOT
     C*
     C                   EXFMT     BILDE
     C*
      * SE / SIMULERE AVREGNING
     C   10              DO
     C                   MOVE      'J'           XXVIS             1
     C                   CALL      'SYTR12A'
     C                   PARM                    WSAVD
     C                   PARM                    WSTUR
     C                   PARM                    XXVIS
nt   C                   PARM                    N4                4 0
nt   C                   PARM                    N5                5 0
nt   C                   PARM                    N8                8 0
     C                   GOTO      START2
     C                   END
      *
     C  N05
     CANN12              GOTO      START2
     C   12              GOTO      START
      *
     C* F5 ER VALGT.......
     C* ENDRE STATUS I TUR
     C     TURK          CHAIN     TURER                              33
     C  N33              MOVE      ' '           TUAVRE
     C  N33              EXCEPT    ENDRE
     C* ENDRE STATUS I TRAVH
     C     TURK          CHAIN     TRAVH1                             33
     C  N33              MOVE      ' '           THST
     C  N33              UPDATE    TRAVHR
     C* SETT EVT - OK/TREKK UTFØRT STATUS="O" TILBAKE TIL "T"
     C* PÅ ALLE REKV. SOM ER TREKT I AVREGNINGEN
     C                   EXSR      TREKOK
      *
      *
     C                   MOVE      *ZEROS        WSTUR
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TREKOK        BEGSR
     C***********************************************
     C* NÅR TRANSP. på hovedturen er avregnet - sett "O" på kode
     C* BUBLST på alle trekk (rekvisisjoner) som har inngått i
     C* i turen. (Dette letter inntekts/kostnadsavsetning senere)
     C                   SETOFF                                       33
     C     TURK          SETLL     TRAVV
     C*
     C     TURK          READE     TRAVV                                  33
     C     *IN33         DOWEQ     '0'
     C     TVTYP         IFEQ      'E'
     C     TVTYP         OREQ      'F'
     C     TVBNRB        CHAIN     KOSBU                              33
     C  N33BUBLST        IFEQ      'O'
     C                   MOVE      'T'           BUBLST                         TREKKES
     C                   UPDATE    KOSBUR
     C                   END
     C                   END
     C                   MOVE      '0'           *IN33
     C     TURK          READE     TRAVV                                  33
     C  N33              END
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
     C                   MOVE      'SF'          WSFUNI            2
     C     TURK          KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSTUR
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
     C*
     C*
     C                   ENDSR
     C*
     OTURERR    E            ENDRE
     O                       TUAVRE
