     FEDIMH     IF   E           K DISK
     FEDIS      IF   E           K DISK
     FSADH      IF   E           K DISK
     FSAEH      IF   E           K DISK
     FFIXTVINF  IF A E           K DISK
     D                 DS
     D  SIST                   1      1
     D  SEST                   1      1
      *
     C     EDIMHK        KLIST
     C                   KFLD                    X0068A
     C                   Z-ADD     20140901      X0068A            8 0
     C     SADKEY        KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
      *
     C     EDIMHK        SETLL     EDIMH
     C     EDIMHK        READE     EDIMH                                  33
     C  N33M0068B        COMP      5000                               33  33
     C                   DOW       *IN33 = *OFF
     C                   IF        (M1001 = '929' AND MSR = 'S') OR
     C                             (M1001 = '830' AND MSR = 'S')
     C     SADKEY        CHAIN     SADH                               33
     C  N33SADKEY        CHAIN     SAEH                               33
     C  N33              IF        SIST = 'C'
     C     MSN           CHAIN     EDIS                               33
     C                   IF        *IN33 = *OFF
     C     SMBR          CHAIN     FIXTVINF                           33
     C   33              EVAL      FTSN  = SSN
     C   33              EVAL      FTMBR = SMBR
     C   33              WRITE     FIXTVINFR
     C                   END
     C                   END
     C                   END
     C     EDIMHK        READE     EDIMH                                  33
     C  N33M0068B        COMP      5000                               33  33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
