     FTRAckf    UF   E           K DISK
     C     Key           klist
     C                   kfld                    TTAVD
     c                   kfld                    TTOPD
     C     Key           setll     trackf
     C     Key           reade     trackf                                 33
     C     *in33         doweq     '0'
     C                   delete    trackfr
     C     Key           reade     trackf                                 33
     C                   ENDdo
      *
     C                   seton                                        LR
     c                   return
