     FVADR      UF   E           K DISK
     C     VADRK         KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    ZKUNDN
     C                   KFLD                    ZADRNR
     C*
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     *LIKE         DEFINE    KUNDNR        ZKUNDN
     C     *LIKE         DEFINE    VADRNR        ZADRNR
     C     *LIKE         DEFINE    VADRNA        ZADRNA
     C     *LIKE         DEFINE    VADRN1        ZADRN1
     C     *LIKE         DEFINE    VADRN2        ZADRN2
     C     *LIKE         DEFINE    VADRN3        ZADRN3
     C*
     C                   MOVE      *BLANKS       ZFIRMA
     C                   MOVE      *ZEROS        ZKUNDN
     C                   MOVE      *ZEROS        ZADRNR
     C                   MOVE      *BLANKS       ZADRNA
     C                   MOVE      *BLANKS       ZADRN1
     C                   MOVE      *BLANKS       ZADRN2
     C                   MOVE      *BLANKS       ZADRN3
     C*  NY VAREADRESSE
     C     LESNY         TAG
     C     VADRK         SETLL     VADR
     C                   READ      VADR                                   99
     C     *IN99         IFEQ      *OFF
     C     MOVNY         TAG
     C                   MOVE      FIRMA         ZFIRMA
     C                   MOVE      KUNDNR        ZKUNDN
     C                   MOVE      VADRNR        ZADRNR
     C                   MOVE      VADRNA        ZADRNA
     C                   MOVE      VADRN1        ZADRN1
     C                   MOVE      VADRN2        ZADRN2
     C                   MOVE      VADRN3        ZADRN3
     C     NESTE         TAG
     C                   READ      VADR                                   98
     C     *IN98         IFEQ      *OFF
     C*  SAMME KUNDE/VAREADRESSE ??
     C     FIRMA         IFEQ      ZFIRMA
     C     KUNDNR        ANDEQ     ZKUNDN
     C     VADRNR        ANDEQ     ZADRNR
     C*  LIKE KUNDEOPPLYSNINGER ??
     C     VADRNA        IFEQ      ZADRNA
     C     VADRN1        ANDEQ     ZADRN1
     C     VADRN2        ANDEQ     ZADRN2
     C     VADRN3        ANDEQ     ZADRN3
     C                   DELETE    VADRR
     C                   GOTO      NESTE
     C                   ELSE
     C                   ADD       1             ZADRNR
     C                   GOTO      LESNY
     C                   ENDIF                                                  <VADRNA
     C                   ENDIF                                                  <FIRMA
     C                   GOTO      MOVNY
     C                   ENDIF                                                  <*IN98
     C                   ENDIF                                                  <*IN99
     C                   MOVE      *ON           *INLR
