     D                 DS
     D  WTID                   1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WAA                   11     14  0
     D  WAAU                  13     14  0
     D  DSTID                  1     14  0
     D                 DS
     D  WWDAT                  1      8  0
     D  WWDATA                 1      4  0
     D  WWDATM                 5      6  0
     D  WWDATD                 7      8  0
      * Parameterliste til datoprogram VR014
     D VR014         E DS                  EXTNAME(VR014DS) INZ
      *
     D                 DS
     D  INVAAR                 1      4  0
     D  INVUKE                 5      6  0
     D  INVAAU                 1      6  0
     C                   TIME                    DSTID            14 0
     c                   exsr      finnaa
     c                   seton                                        lr
     c                   return
     c*****************************************************
     c     finnaa        begsr
     c*****************************************************
     C     PARM3         PLIST
     C                   PARM                    VR014
     C*
     C                   CLEAR                   VR014
     C                   MOVE      '3'           ÅTYPE
     C                   MOVE      WDD           WWDATD
     C                   MOVE      WMM           WWDATM
     C                   MOVE      WAA           WWDATA
     C                   Z-ADD     WWDAT         ÅDATO1
     C                   CALL      'VR014'       PARM3
     C*                  move      INVAAU        LDATO
     c                   endsr
