      *
      ***********************************************************
      *** PROGRAM SKAL VISE ALLE ORDRE MED SAMME PO.NR        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 06-11 13-24
      *** LEDIGE INDIKATORER 28-32 34-90 95-99
      ***********************************************************
      *
     FGSSPOL01  IF   E           K DISK
     FGSSORF    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FGSS029D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  ORDTLÅ                 1      4  0
     D  ORDTLM                 5      6  0
     D  ORDTLD                 7      8  0
     D  ORDTL                  1      8  0
     D                 DS
     D  XXDTLD                 1      2  0
     D  XXDTLM                 3      4  0
     D  XXDTLÅ                 5      6  0
     D  XXDTL                  1      6  0
     D                 DS
     D  ORDT2Å                 1      4  0
     D  ORDT2M                 5      6  0
     D  ORDT2D                 7      8  0
     D  ORDTL2                 1      8  0
     D                 DS
     D  XXDT2D                 1      2  0
     D  XXDT2M                 3      4  0
     D  XXDT2Å                 5      6  0
     D  XXDTL2                 1      6  0
     D                 DS
     D  ORDT3Å                 1      4  0
     D  ORDT3M                 5      6  0
     D  ORDT3D                 7      8  0
     D  ORDTL3                 1      8  0
     D                 DS
     D  XXDT3D                 1      2  0
     D  XXDT3M                 3      4  0
     D  XXDT3Å                 5      6  0
     D  XXDTL3                 1      6  0
     D                 DS
     D  ORDTWÅ                 1      4  0
     D  ORDTWM                 5      6  0
     D  ORDTWD                 7      8  0
     D  ORDTWL                 1      8  0
     D                 DS
     D  XXDTWD                 1      2  0
     D  XXDTWM                 3      4  0
     D  XXDTWÅ                 5      6  0
     D  XXDTWL                 1      6  0
     D                 DS
     D  ORDTRÅ                 1      4  0
     D  ORDTRM                 5      6  0
     D  ORDTRD                 7      8  0
     D  ORDTR                  1      8  0
     D                 DS
     D  XXDTRD                 1      2  0
     D  XXDTRM                 3      4  0
     D  XXDTRÅ                 5      6  0
     D  XXDTR                  1      6  0
     D                UDS
     D  UFIRM                  1      2
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     UPO           SETLL     GSSPOL01
     C     START1        TAG
     C     UPO           READE     GSSPOL01                               94
     C  N94POONO         CHAIN     GSSORF                             33
     C  N94ORBCD         CABNE     UBCD          START1
     C  N94ORONO         CABEQ     XONO          START1
     C  N94ORST          CABEQ     'D'           START1
     C  N94ORST          CABEQ     'P'           START1
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     ST21          TAG
     C     UPO           READE     GSSPOL01                               94
     C  N94POONO         CHAIN     GSSORF                             33
     C  N94ORBCD         CABNE     UBCD          ST21
     C  N94ORONO         CABEQ     XONO          ST21
     C  N94ORST          CABEQ     'D'           ST21
     C  N94ORST          CABEQ     'P'           ST21
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *
      *** BLA VIDERE
     C   25              DO
     C     POONO         CHAIN     GSSORF                             33
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C  N03              GOTO      START3
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '5'
     C     ORONO         CHAIN     GSSORF                             33
     C     ORBCD         CHAIN     CDBOAT                             33
     C     CUND1K        CHAIN     CUNDL01                            33
     C                   MOVE      ORDTLÅ        XXDTLÅ
     C                   MOVE      ORDTLM        XXDTLM
     C                   MOVE      ORDTLD        XXDTLD
     C                   MOVE      ORDT2Å        XXDT2Å
     C                   MOVE      ORDT2M        XXDT2M
     C                   MOVE      ORDT2D        XXDT2D
     C                   MOVE      ORDT3Å        XXDT3Å
     C                   MOVE      ORDT3M        XXDT3M
     C                   MOVE      ORDT3D        XXDT3D
     C                   MOVE      ORDTWÅ        XXDTWÅ
     C                   MOVE      ORDTWM        XXDTWM
     C                   MOVE      ORDTWD        XXDTWD
     C                   MOVE      ORDTRÅ        XXDTRÅ
     C                   MOVE      ORDTRM        XXDTRM
     C                   MOVE      ORDTRD        XXDTRD
     C     STHENT        TAG
     C                   EXFMT     GSS029DA
     C  N03
     CANN12              GOTO      STHENT
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   WRITE     WINDOWSZ
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     CUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    ORCNO
      *
     C     *ENTRY        PLIST
     C                   PARM                    UBCD              5
     C                   PARM                    UPO              20
     C                   PARM                    UONO              7
      *
     C                   WRITE     WINDOWSZ
     C                   MOVE      UONO          XONO              7 0
      *
     C                   ENDSR
      *
