********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10004 * 01 YBC PTF10 LEVERANDØRSNR ER ØKT TIL 5.0
      *              INGEN MERKING
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED LEVERANDØRER               ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 28 29 31 32 34-39 41-87 95-97    ***
      ***********************************************************
      *
     FGSSSFF    UF A E           K DISK
     FGSSSFL01  IF   E           K DISK
     F                                     RENAME(GSSSFFR:GSSSFFR1)
     FCUNDL01   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FGSS005D   CF   E             WORKSTN
     F                                     SFILE(GSS005DA:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  SFNM                   1     30
N01  D  SFNM28                 1     28
     D  XDLT                   1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     GSS005DB
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W2NM          SETLL     GSSSFL01
     C     START1        TAG
     C                   READ      GSSSFL01                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     GSS005DA
     C                   READ      GSSSFL01                               94
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     GSS005DG
     C                   ELSE
     C                   WRITE     GSS005DB
     C                   EXFMT     GSS005DC
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     20            LINNBR
S01  C*                  Z-ADD     5             POSNBR
N01  C                   Z-ADD     3             POSNBR
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*** AVSLUTT
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   27WSNR          IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
      *
      *** LAGE NY
     C     START5        TAG
     C                   EXFMT     GSS005DD
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                           30
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START5
     C                   END
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     GSS005DE
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     16            POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSSNO         COMP      0                                      90
     C   90              MOVE      'GSS0020'     MSGNR
     C   90              SETON                                        30
     C  N90WSSNO         CHAIN(N)  GSSSFF                             33
     C  N90
     CANN33              DO
     C                   MOVE      'GSS0021'     MSGNR
     C                   SETON                                        3090
     C                   END
     C   90              Z-ADD     20            LINNBR
S01  C*  90              Z-ADD     5             POSNBR
N01  C   90              Z-ADD     3             POSNBR
     C                   END
      *
     C     WSNM          COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'GSS0022'     MSGNR
     C   89
     CANN30              Z-ADD     20            LINNBR
     C   89
     CANN30              Z-ADD     9             POSNBR
     C   89              SETON                                        30
      *
     C     WSCNO         IFNE      0
     C     CUND1K        CHAIN     CUNDL01                            88
     C   88
     CANN30              MOVE      'GSS0023'     MSGNR
     C   88
     CANN30              Z-ADD     22            LINNBR
     C   88
     CANN30              Z-ADD     14            POSNBR
     C   88              SETON                                        30
     C  N88WSTEL         IFEQ      *BLANKS
     C                   MOVE      TLF           WSTEL
     C                   END
     C  N88WSFAX         IFEQ      *BLANKS
     C                   MOVE      TFAXNR        WSFAX
     C                   END
     C                   END
      *
     C   30              GOTO      SLTB1
      *
      *** OPPDATERE PÅ REGISTER OG SUBFIL
     C     WSSNO         CHAIN     GSSSFF                             33
     C  N33
     CANN40              UPDATE    GSSSFFR
     C  N33
     CANN40              GOTO      SLTB1
     C                   EXSR      MOVWSF
     C  N33              UPDATE    GSSSFFR
     C   33              WRITE     GSSSFFR
     C   40              UPDATE    GSS005DA
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     GSS005DA
     C                   WRITE     GSS005DB
     C                   EXSR      MOVB2
      *
     C     SLTB1         ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     GSS005DA                               98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C   27WSNR          IFEQ      '1'
     C                   MOVE      SFSNO         USNO
     C                   GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSF
     C   12              GOTO      SLHENT
     C                   END
     C  N27WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSF
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'GSS0009'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     GSS005DD
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                         30
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      STCHG
     C                   END
     C   12              DO
     C                   UPDATE    GSS005DA
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSF         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     GSS005DF
     C  N12              DO
     C     SFSNO         CHAIN     GSSSFF                             33
     C  N33              DELETE    GSSSFFR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    GSS005DA
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C                   MOVE      WSSNO         SFSNO
     C                   MOVE      WSNM          SFNM
     C                   MOVE      WSAD1         SFAD1
     C                   MOVE      WSAD2         SFAD2
     C                   MOVE      WSAD3         SFAD3
     C                   MOVE      WSCNO         SFCNO
     C                   MOVE      WSTEL         SFTEL
     C                   MOVE      WSFAX         SFFAX
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      SFSNO         WSSNO
     C                   MOVE      SFNM          WSNM
     C                   MOVE      SFAD1         WSAD1
     C                   MOVE      SFAD2         WSAD2
     C                   MOVE      SFAD3         WSAD3
     C                   MOVE      SFCNO         WSCNO
     C                   MOVE      SFTEL         WSTEL
     C                   MOVE      SFFAX         WSFAX
     C                   SETON                                        40
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     9             POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        SFSNO
     C                   MOVE      *BLANKS       SFNM
     C                   MOVE      '*DELETE'     XDLT
     C                   MOVE      *BLANKS       SFAD1
     C                   MOVE      *BLANKS       SFAD2
     C                   MOVE      *BLANKS       SFAD3
     C                   MOVE      *ZEROS        SFCNO
     C                   MOVE      *BLANKS       SFTEL
     C                   MOVE      *BLANKS       SFFAX
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSSNO
     C                   MOVE      *BLANKS       WSNM
     C                   MOVE      *BLANKS       WSAD1
     C                   MOVE      *BLANKS       WSAD2
     C                   MOVE      *BLANKS       WSAD3
     C                   MOVE      *ZEROS        WSCNO
     C                   MOVE      *BLANKS       WSTEL
     C                   MOVE      *BLANKS       WSFAX
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKUNR        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSCNO
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG            1 0
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     14
     C     POSNBR        ANDLE     21
     C                   EXSR      SØKUNR
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'GSS0013'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSCNO
      *
     C     *ENTRY        PLIST
     C                   PARM                    UFLAGG            1 0
S01  C*                  PARM                    USNO              3 0
N01  C                   PARM                    USNO              5 0
      * UFLAGG = 1 ---> CALL SØKING FRA ET ANNET PROGRAM
     C     UFLAGG        COMP      1                                      27
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   ENDSR
      *
