*****F**************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnrF*Sek Sig Vers Beskrivelse...........................
"""""F*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P0XXXF* 01
*****F**************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL skrive ut    dangerous goods              ***
      **************************************************************
      *
     FGSSTRF    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FGSSDGF    UF A E           K DISK
     FGSSORL21  IF   E           K DISK
     FGSS076P   O    E             PRINTER OFLIND(*IN90)
     C*
     C                   EXSR      INIT
      *
     c                   write     headp
     C     keytur        setll     gssorl21
     c                   setoff                                       33
     C     *in33         doweq     '0'
     C     keytur        reade     gssorl21                               33
     C     *in33         ifeq      '0'
     C     keydg         chain     gssdgf                             34
     c  n34              exsr      print
     c                   end
     c                   enddo
     c                   write     totp
      *
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     print         BEGSR
     C***********************************************
     C*
     c                   setoff                                       35
     C     keydg         setll     gssdgf
     c     *in35         doweq     '0'
     c     keydg         reade     gssdgf                                 35
     c     *in35         ifeq      '0'
     c     *in90         ifeq      '1'
     c                   write     headp
     c                   setoff                                       90
     c                   endif
     c                   move      'KG'          dgkgli
     c     dgnwt         ifeq      'L'
     c                   move      'LI'          dgkgli
     c                   end
     c                   add       dgnop         dgnopt
     c                   add       dggwk         dggwkt
     c                   write     detp
     c                   endif
     c                   enddo
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    URTNO            11 0
     C     KEYTUR        KLIST
     C                   KFLD                    ORTNO            11 0
     C                   MOVE      URTNO         ORTNO
     C*
     C     KEYDG         KLIST
     C                   KFLD                    ORONO
      *
     c                   read      firm                                   33
     c     keytur        chain     gsstrf                             33
     C                   ENDSR
     C*
