      **************************************************************
      *** reorg  dangerous goods              ***
      **************************************************************
      *
     FGSSDGA    UP   E           K DISK
     C*
     C     daunnr        ifne      forrige
     C                   z-add     1             nr                3 0
     c                   else
     c                   add       1             nr
     c                   end
     c                   z-add     nr            dalopn
     C                   update    gssdgar
     C                   MOVE      daunnr        forrige           4 0
