      *
      ***********************************************************
      *** PROGRAM SKAL BEHOLDE BOX-LAPPER PÅ ORDRE            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 06-09 11 13-24
      *** LEDIGE INDIKATORER 29 31 32 34-90 95-97 99
      ***********************************************************
      *
     FGSSORF    UF   E           K DISK
     FGSSOLF    UF   E           K DISK
     FGSSOLL01  IF   E           K DISK    RENAME(GSSOLFR:GSSOLFR1)
     F                                     PREFIX(OL1_)
     D ON              S              7  0 DIM(900)
     D                 DS
     D  OLMN                   1     35
     D  OLMNPRE                1      3
     D  OLMNTNO                4     14
     D  OLMNBOX               15     17
      *
     C                   EXSR      INIT
      * FINN ALLE ORDRE
     C                   EXSR      SRFINORD
      *
     C                   EXSR      SROPPDAT
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     SRFINORD      BEGSR
     C***********************************************
     C                   Z-ADD     1             XN1               3 0
     C                   MOVE      UONO          ON(XN1)
      *
     C     STFINO1       TAG
     C                   MOVE      ON(XN1)       XXONO             7 0
     C     XXONO         SETLL     GSSOLF
     C     XXONO         READE(N)  GSSOLF                                 33
     C                   DOW       *IN33 = *OFF
      *
     C                   IF        OLBOX <> 0
     C     GSSOLL01K     SETLL     GSSOLL01
     C     GSSOLL01K     READE     GSSOLL01                               33
     C                   DOW       *IN33 = *OFF
     C                   IF        OL1_OLONO <> XXONO
     C     1             DO        900           XN2               3 0
     C                   SELECT
     C                   WHEN      OL1_OLONO = ON(XN2)
     C                   LEAVE
     C                   WHEN      ON(XN2) = 0
     C                   MOVE      OL1_OLONO     ON(XN2)
     C                   LEAVE
     C                   ENDSL
     C                   ENDDO
     C                   END
     C     GSSOLL01K     READE     GSSOLL01                               33
     C                   ENDDO
     C                   END
      *
     C     XXONO         READE(N)  GSSOLF                                 33
     C                   ENDDO
      *
     C                   ADD       1             XN1
     C     ON(XN1)       CABNE     0             STFINO1
      *
     C                   ENDSR
      *
     C***********************************************
     C     SROPPDAT      BEGSR
     C***********************************************
     C     1             DO        900           XN1
     C                   IF        ON(XN1) = 0
     C                   LEAVE
     C                   END
      *
     C                   MOVE      ON(XN1)       XXONO
     C     XXONO         SETLL     GSSOLF
     C     XXONO         READE     GSSOLF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        OLBOX <> 0
     C                   MOVE      *BLANKS       OLMN
     C                   MOVE      '995'         OLMNPRE
     C                   MOVE      OLTNO         OLMNTNO
     C                   MOVE      OLBOX         OLMNBOX
     C                   END
     C                   MOVE      *ZEROS        OLTNO
     C                   MOVE      *ZEROS        OLBOX
     C                   UPDATE    GSSOLFR
     C     XXONO         READE     GSSOLF                                 33
     C                   ENDDO
      *
     C     XXONO         CHAIN     GSSORF                             33
     C                   IF        ORST <> '0'
     C                   MOVE      '0'           ORST
     C                   MOVE      *ZEROS        ORTNO
     C     ORLC          IFEQ      'ONWAY'
     C                   MOVE      ORLC2         ORLC
     C                   MOVE      ORLC3         ORLC2
     C                   MOVE      *BLANKS       ORLC3
     C                   MOVE      ORDTL2        ORDTL
     C                   MOVE      ORDTL3        ORDTL2
     C                   MOVE      *ZEROS        ORDTL3
     C                   END
     C                   END
     C                   UPDATE    GSSORFR
      *
     C                   ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UONO              7 0
      *
     C     GSSOLL01K     KLIST
     C                   KFLD                    OLTNO
     C                   KFLD                    OLBOX
      *
     C                   ENDSR
      *
