      *
      **************************************************************
      *** PROGRAM SKAL OPPDATERE KODE FOR DELLEVERING
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 01-03 05-09 11 13-26
      *** LEDIGE INDIKATORER 31 32 34-84
      **************************************************************
      *
     FGSSPAF    UF   E           K DISK
     FGSSORF    IF   E           K DISK
     FGSSPOL01  IF   E           K DISK
      *
     C                   EXSR      INIT
      *
     C     UCON          SETLL     GSSPOL01
     C     UCON          READE     GSSPOL01                               33
     C     *IN33         DOWEQ     '0'                                          1<-B
     C     POONO         IFNE      UONO                                          2<-B
     C     POONO         CHAIN     GSSORF                             34
     C     UBCD          IFEQ      ORBCD                                          3<-B
     C     ORST          ANDEQ     '0'
     C     POONO         CHAIN     GSSPAF                             35
     C     *IN35         IFEQ      '0'                                             4<-B
     C                   MOVE      UPKD          PAPKD
     C                   UPDATE    GSSPAFR
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     UCON          READE     GSSPOL01                               33
     C  N33              ENDDO                                                  1<-E
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UONO              7 0
     C                   PARM                    UBCD              5
     C                   PARM                    UCON             20
     C                   PARM                    UPKD              1
      *
     C                   ENDSR
      *
