      *
      ***********************************************************
      *** PROGRAM SKAL VISE ALLE ORDRE MED SAMME KOLLI-ID     ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 06-09 11 13-24
      *** LEDIGE INDIKATORER 29 31 32 34-90 95-97 99
      ***********************************************************
      *
     FGSSORF    UF   E           K DISK
     FGSSORL24  IF   E           K DISK    RENAME(GSSORFR:GSSORF24)
     FGSSOLF    UF   E           K DISK
     FGSSOLL04  IF   E           K DISK    RENAME(GSSOLFR:GSSOLF04)
     FGSS036D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D ON              S              7  0 DIM(900)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  OLMN                   1     35
     D  OLMNPRE                1      3
     D  OLMNTNO                4     14
     D  OLMNBOX               15     17
     D  OLMNREST              18     35
     D                 DS
     D  XXMN                   1     35
     D  XXMNPRE                1      3
     D  XXMNTNO                4     14
     D  XXMNBOX               15     17
     D                 DS
     D  XXMN2                  1     35
     D  XXMN2PRE               1      3
     D  XXMN2TNO               4     14
     D  XXMN2BOX              15     17
     D                UDS
     D  UFIRM                  1      2
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     UTNOI         SETLL     GSSORL24
     C     UTNOI         READE     GSSORL24                               94
     C                   DOW       *IN94 = *OFF
     C                   IF        ORST = USTF
     C                   IF        ORCLNF = 0
     C                   EXSR      HENTCLNR
     C                   END
     C                   IF        ORCLNT = 0
     C                   EVAL      ORCLNT = ORCLNT
     C                   END
     C                   IF        ((ORCLNF >= UCLNF) AND (ORCLNF <= UCLNT))
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
     C                   END
     C     UTNOI         READE     GSSORL24                               94
     C  N94              ENDDO
      *
     C     ZRECNO        IFEQ      0
     C  N28              EXSR      SRSJBN
     C                   IF        ZRECNO = 0
     C                   EVAL      UINGEN = 'J'
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C                   MOVE      ZRECNO        XRECNO            4 0
     C                   EVAL      ZRECNO = 1
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *** BLA VIDERE
     C   10              DO
     C                   EXSR      PLALLE
     C                   GOTO      SLUTT
     C                   END
      *
      *** BLA VIDERE
     C   25              GOTO      START3
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N28
     CANN98WSNR          IFEQ      '1'
     C     ORONO         ANDNE     0
     C     ORONO         CHAIN     GSSORF                             33
     C                   MOVE      USTT          ORST
     C                   MOVE      UTNOU         ORTNO
     C                   ADD       ORWT          UWT
     C                   UPDATE    GSSORFR
     C                   EXSR      OPDLOK
     C                   MOVE      *ZEROS        ORONO
     C                   EVAL      ORBCD = '*PICK'
     C                   EVAL      ORLC  = *BLANKS
     C                   EVAL      ORSNM = *BLANKS
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C   28
     CANN98WSNR          IFEQ      '4'
     C     ORONO         ANDNE     0
     C     ORONO         CHAIN     GSSORF                             33
     C                   MOVE      USTT          ORST
     C                   MOVE      *ZEROS        ORTNO
     C                   SUB       ORWT          UWT
     C                   IF        ((ORST = '1') AND (ORLC = 'ONWAY'))
     C                   MOVE      ORLC2         ORLC
     C                   MOVE      ORLC3         ORLC2
     C                   MOVE      *BLANKS       ORLC3
     C                   MOVE      ORDTL2        ORDTL
     C                   MOVE      ORDTL3        ORDTL2
     C                   MOVE      *ZEROS        ORDTL3
     C                   END
     C                   UPDATE    GSSORFR
     C                   EXSR      OPDLOK
     C                   MOVE      *ZEROS        ORONO
     C                   EVAL      ORBCD = '*DLT'
     C                   EVAL      ORLC  = *BLANKS
     C                   EVAL      ORSNM = *BLANKS
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   END
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     SRSJBN        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       XXMN
     C                   MOVE      '995'         XXMNPRE
     C                   MOVE      UTNOI         XXMNTNO
     C                   MOVE      UCLNF         XXMNBOX
     C                   MOVE      XXMN          XXMN2
     C                   MOVE      UCLNT         XXMN2BOX
      *
     C     SRST1         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      *ZEROS        ON
     C                   MOVE      *ZEROS        XN1               3 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     XXMN          SETLL     GSSOLL04
     C                   READ      GSSOLL04                               94
     C  N94OLMN          COMP      XXMN2                              94
     C                   DOW       *IN94 = *OFF
     C                   IF        OLMNREST = *BLANKS
     C     1             DO        900           XN2               3 0
     C                   SELECT
     C                   WHEN      ON(XN2) = 0
     C     OLONO         CHAIN(N)  GSSORF                             33
     C                   IF        ORST = USTF
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
     C                   LEAVE
     C                   WHEN      ON(XN2) = OLONO
     C                   LEAVE
     C                   ENDSL
     C                   ENDDO
     C                   END
     C                   READ      GSSOLL04                               94
     C  N94OLMN          COMP      XXMN2                              94
     C  N94              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     PLALLE        BEGSR
     C***********************************************
     C     1             DO        XRECNO        ZRECNO
     C     ZRECNO        CHAIN     SUBFIL                             33
     C     ORONO         IFNE      0
     C     ORONO         CHAIN     GSSORF                             33
     C                   MOVE      USTT          ORST
     C  N28              MOVE      UTNOU         ORTNO
     C   28              MOVE      *ZEROS        ORTNO
     C  N28              ADD       ORWT          UWT
     C   28              SUB       ORWT          UWT
     C                   IF        ((ORST = '1') AND (ORLC = 'ONWAY'))
     C                   MOVE      ORLC2         ORLC
     C                   MOVE      ORLC3         ORLC2
     C                   MOVE      *BLANKS       ORLC3
     C                   MOVE      ORDTL2        ORDTL
     C                   MOVE      ORDTL3        ORDTL2
     C                   MOVE      *ZEROS        ORDTL3
     C                   END
     C                   UPDATE    GSSORFR
     C                   EXSR      OPDLOK
     C                   END
     C                   ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDLOK        BEGSR
     C***********************************************
     C     ORONO         SETLL     GSSOLF
     C     ORONO         READE     GSSOLF                                 33
     C     *IN33         DOWEQ     '0'
     C                   IF        *IN28
     C                   MOVE      OLMNTNO       OLTNO
     C                   MOVE      OLMNBOX       OLBOX
     C                   MOVE      *BLANKS       OLMN
     C                   ELSE
     C                   IF        OLTNO <> 0
     C                   MOVE      *BLANKS       OLMN
     C                   MOVE      '995'         OLMNPRE
     C                   MOVE      OLTNO         OLMNTNO
     C                   MOVE      OLBOX         OLMNBOX
     C                   END
     C                   MOVE      UTNOU         OLTNO
     C                   MOVE      *ZEROS        OLBOX
     C                   END
     C                   MOVE      ' '           OLST
     C                   UPDATE    GSSOLFR
     C     ORONO         READE     GSSOLF                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENTCLNR      BEGSR
     C***********************************************
     C     ORONO         SETLL     GSSOLF
     C     ORONO         READE(N)  GSSOLF                                 33
     C                   DOW       *IN33 = '0'
     C                   IF        UTNOI <> 0
     C                   IF        OLMNPRE = '995'
     C                   MOVE      OLMNBOX       OLMNBOX2          3 0
     C                   IF        ((ORCLNF = 0) OR (ORCLNF > OLMNBOX2))
     C                   MOVE      OLMNBOX2      ORCLNF
     C                   END
     C                   IF        ((ORCLNT = 0) OR (ORCLNT < OLMNBOX2))
     C                   MOVE      OLMNBOX2      ORCLNT
     C                   END
     C                   ELSE
     C                   IF        ((ORCLNF = 0) OR (ORCLNF > OLBOX))
     C                   MOVE      OLBOX         ORCLNF
     C                   END
     C                   IF        ((ORCLNT = 0) OR (ORCLNT < OLBOX))
     C                   MOVE      OLBOX         ORCLNT
     C                   END
     C                   END
     C                   END
     C     ORONO         READE(N)  GSSOLF                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UTNOI            11 0
     C                   PARM                    UTNOU            11 0
     C                   PARM                    USTF              1
     C                   PARM                    USTT              1
     C                   PARM                    UWT               7 1
     C     UCLNF         PARM                    UCLNF             3 0
     C     UCLNT         PARM                    UCLNT             3 0
     C                   PARM                    UINGEN            1
      *
     C                   WRITE     WINDOWSZ
     C                   EVAL      UINGEN = 'N'
     C                   IF        UCLNT  = 0
     C                   EVAL      UCLNT  = UCLNF
     C                   END
     C     USTF          COMP      '0'                                2828
      *
     C                   ENDSR
      *
