********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 NYTT PARAMETER FOR Å HÅNDTERE FEILDATO
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SJEKKE OG SETTE SECUR PÅ KOLLI         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26
      *** LEDIGE INDIKATORER 29 31 32 34-90 95-97 99
      ***********************************************************
      *
     FGSSLGL02  UF   E           K DISK
      *
     D                 DS
     D  XUDTD                  1      2  0
     D  XUDTM                  3      4  0
     D  XUDTÅ                  5      6  0
     D  XUDT                   1      6  0
     D                 DS
     D  XDTÅ                   1      4  0
     D  XDTM                   5      6  0
     D  XDTD                   7      8  0
     D  XDT                    1      8  0
      *
     C     GSSLGL02K     KLIST
     C                   KFLD                    XLGFTYP
     C                   KFLD                    XDT
     C                   KFLD                    XTID
      *
     C                   MOVE      'UNSEC'       XLGFTYP           5
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           XDT
     C                   MOVE      WTM           XTID              6 0
     C                   MOVE      *ZEROS        UINNDT            6 0
     C                   Z-SUB     1             UANTDG            3 0
     C                   CALL      'SYFA20B'
     C                   PARM                    UINNDT
     C                   PARM                    UANTDG
     C     XUDT          PARM                    UUTDT             6 0
N01  C                   PARM                    UFLAGG            1 0
     C                   MOVE      XUDTD         XDTD
     C                   MOVE      XUDTM         XDTM
     C                   MOVE      XUDTÅ         XDTÅ
      *
     C     GSSLGL02K     SETLL     GSSLGL02
     C     XLGFTYP       READPE    GSSLGL02                               33
     C                   DOW       *IN33 = *OFF
     C                   MOVE      'SECUR'       LGFTYP
     C                   MOVE      WDT           LGHDT
     C                   MOVE      WTM           LGHTID
     C                   UPDATE    GSSLGFR
     C     XLGFTYP       READPE    GSSLGL02                               33
     C  N33              ENDDO
      *
     C                   SETON                                        LR
     C                   RETURN
      *
