********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8XXX * 01 YBC PTF8 BENYTT JOBKØ MED EN JOBB AV GANGEN
********************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL SENDE AUTO-STOCK REPORT TIL KUNDER
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 01-26
      *** LEDIGE INDIKATORER 27-32 35-99
      **************************************************************
      *
     FFIRM      IF   E           K DISK
     FGSSPCF    IP   E             DISK
     D UCMD            DS          1024
     D                 DS
     D XCMD01          C                   CONST('SBMJOB -
     D                                     CMD(CALL PGM(-
     D                                     GSS044C1)) -
     D                                     JOB(PRTSTOCKR) -
     D                                     JOBQ(-
N01  D                                     SYJOBQAV)')
S01  D*                                    SYJOBQNMAX)')
     D                 DS
     D  PCUD1                  1      1
     D  PCUD2                  2      2
     D  PCUD3                  3      3
     D  PCUD4                  4      4
     D  PCUD5                  5      5
     D  PCUD6                  6      6
     D  PCUD7                  7      7
     D  UD                     1      7
     D                                     DIM(7)
     D SAVUDS         UDS
     D  FIFIRM                 1      2
     D  UBIUSI               101    110
     D  UWCNO                501    508  0
     D  UWBCD                509    513
     D  UWALL                514    514
     D  UWCG                 515    516
     D  UWLC                 517    521
     D  UWCPRL               522    522
     D  UWFC                 523    525
     D  UWPRT                526    535
     D  UWCNO2               536    543  0
     D  UWCNAM               544    573
     D  UWFAXN               574    588
     D  UWCOUN               589    590
     D  UWRET                591    596
     D  UWCVRP               597    597
     D  UWTIME               598    603  0
     D  UWDATE               606    611  0
     D  UCOVP                612    612
     D  UCOV01               613    652
     D  UCOV02               653    692
     D  UCOV03               693    732
     D  UCOV04               733    772
     D  UCOV05               773    812
     D  UCOV06               813    852
     D  UCOV07               853    892
     D  UCOV08               893    932
     D  UEMAIL               933   1002
     D  UEMAIJ              1003   1003
      *
     C     XINIT         IFEQ      ' '
     C                   EXSR      INIT
     C                   END
      *
     C     PCAUTO        IFEQ      'Y'
     C     PCEM          ANDNE     *BLANKS
     C     UD(XUD)       ANDEQ     'X'
     C                   EXSR      SNDEM
     C                   END
      *
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *DTAARA       DEFINE    *LDA          SAVUDS
     C                   MOVE      'J'           XINIT             1
     C                   Z-ADD     1024          UCMDL            15 5
     C                   MOVE      *BLANKS       UCMD
     C                   MOVEL     XCMD01        UCMD
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   CALL      'GSS045R'
     C                   PARM                    WDT
     C                   PARM                    UUDAG             1
     C                   PARM                    UUKENR            2
     C                   PARM                    UUDAGN            3
     C                   MOVE      UUDAG         XUD               1 0
      *
     C                   ENDSR
      *
     C***********************************************
     C     SNDEM         BEGSR
     C***********************************************
      *
     C                   IN        SAVUDS
     C                   MOVE      PCUSER        UBIUSI
     C                   MOVE      PCPNO         UWCNO
     C                   MOVE      PCBCD         UWBCD
     C                   MOVE      PCTR          UWALL
     C                   MOVE      PCCG          UWCG
     C                   MOVE      *BLANKS       UWLC
     C                   MOVE      'Y'           UWCPRL
     C                   MOVE      PCFIR         UWFC
     C                   MOVE      *BLANKS       UWPRT
     C                   MOVEL     '*JOB'        UWPRT
     C                   MOVE      PCPNO         UWCNO2
     C                   MOVE      PCNM          UWCNAM
     C                   MOVE      *BLANKS       UWFAXN
     C                   MOVE      PCLK          UWCOUN
     C                   MOVE      *BLANKS       UWRET
     C                   MOVE      *BLANKS       UWCVRP
     C                   MOVE      *BLANKS       UWTIME
     C                   MOVE      *BLANKS       UWDATE
     C                   MOVE      PCCP          UCOVP
     C                   MOVE      *BLANKS       UCOV01
     C                   MOVE      *BLANKS       UCOV02
     C                   MOVE      *BLANKS       UCOV03
     C                   MOVE      *BLANKS       UCOV04
     C                   MOVE      *BLANKS       UCOV05
     C                   MOVE      *BLANKS       UCOV06
     C                   MOVE      *BLANKS       UCOV07
     C                   MOVE      *BLANKS       UCOV08
     C                   MOVE      *BLANKS       UCOV01
     C                   MOVEL     PCEM          UEMAIL
     C                   MOVE      'J'           UEMAIJ
     C                   OUT       SAVUDS
      *
     C                   CALL      'QCMDEXC'                            33
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
     C                   ENDSR
      *
