      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED FARLIG GODS                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 11 13-26                      ***
      *** LEDIGE INDIKATORER 28-32 34-99                      ***
      ***********************************************************
      *
     FGSSFGF    UF A E           K DISK
     FGSS038D   CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               382    383B 0
     D  WSSUBN               378    379B 0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE01
      *
     C   12              Z-ADD     1             UFLAGG
     C   12              GOTO      SLUTT
     C  N27              EXSR      UPDFIL
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     UPDFIL        BEGSR
     C***********************************************
     C     UONO          CHAIN     GSSFGF                             33
     C                   IF        ((WSFA11 = *BLANKS) AND (WSFA21 = *BLANKS))
     C  N33              DELETE    GSSFGFR
     C                   ELSE
     C                   MOVE      WSFA11        FGFA11
     C                   MOVE      WSFA12        FGFA12
     C                   MOVE      WSFLP1        FGFLP1
     C                   MOVE      WSFA21        FGFA21
     C                   MOVE      WSFA22        FGFA22
     C                   MOVE      WSFLP2        FGFLP2
     C                   MOVE      WSFA31        FGFA31
     C                   MOVE      WSFA32        FGFA32
     C                   MOVE      WSFLP3        FGFLP3
     C                   MOVE      WSFA41        FGFA41
     C                   MOVE      WSFA42        FGFA42
     C                   MOVE      WSFLP4        FGFLP4
     C                   MOVE      WSFA51        FGFA51
     C                   MOVE      WSFA52        FGFA52
     C                   MOVE      WSFLP5        FGFLP5
     C                   MOVE      WSFA61        FGFA61
     C                   MOVE      WSFA62        FGFA62
     C                   MOVE      WSFLP6        FGFLP6
     C                   IF        *IN33
     C                   MOVE      UONO          FGONO
     C                   WRITE     GSSFGFR
     C                   ELSE
     C                   UPDATE    GSSFGFR
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UONO              7 0
     C                   PARM                    UTYPE             3
     C                   PARM                    UFLAGG            1 0
      *
     C     UTYPE         COMP      'DSP'                                  27
     C                   WRITE     WINDOWSZ
     C     UONO          CHAIN(N)  GSSFGF                             33
     C                   IF        *IN33 = *OFF
     C                   MOVE      FGFA11        WSFA11
     C                   MOVE      FGFA12        WSFA12
     C                   MOVE      FGFLP1        WSFLP1
     C                   MOVE      FGFA21        WSFA21
     C                   MOVE      FGFA22        WSFA22
     C                   MOVE      FGFLP2        WSFLP2
     C                   MOVE      FGFA31        WSFA31
     C                   MOVE      FGFA32        WSFA32
     C                   MOVE      FGFLP3        WSFLP3
     C                   MOVE      FGFA41        WSFA41
     C                   MOVE      FGFA42        WSFA42
     C                   MOVE      FGFLP4        WSFLP4
     C                   MOVE      FGFA51        WSFA51
     C                   MOVE      FGFA52        WSFA52
     C                   MOVE      FGFLP5        WSFLP5
     C                   MOVE      FGFA61        WSFA61
     C                   MOVE      FGFA62        WSFA62
     C                   MOVE      FGFLP6        WSFLP6
     C                   END
      *
     C                   ENDSR
      *
