     FGSSDGF    IP   E           K DISK
     FGSSDGA    IF A E           K DISK
      *
     C     dgunnr        chain     gssdga                             33
      *
N02  C   33              write     gssdgar
