     C     *ENTRY        PLIST
     C                   PARM                    UINN             50
     C                   PARM                    UUT              50
     C                   eval      UUT ='You said ' + %trim(UINN)
     c                             + ' and I say hello to you'
     c                   seton                                        LR
     c                   return
