     FSTANDE    UF   E           K DISK
     FSAEHFR    IF   E           K DISK
     F                                     RENAME(SAEHR:SAEHRFR)
     FSAEVFR    IF   E           K DISK
     F                                     RENAME(SAEVR:SAEVRFR)
     FSAEFFR    IF   E           K DISK
     F                                     RENAME(SADFR:SADFRFR)
     FSAEH      O    E             DISK
     FSAEV      O    E             DISK
     FSAEF      O    E             DISK
      *
     C     SAEHK         KLIST
     C                   KFLD                    SEAVD
     C                   KFLD                    SETDN
      *
     C                   Z-ADD     2             XAVD              4 0
     C     XAVD          CHAIN(N)  STANDE                             33
     C                   MOVE      SETDN         XTDN              5 0
     C                   MOVE      SERG          XRG               9 0
     C                   MOVE      SENAK         XNAK             30
     C                   MOVE      SEADK1        XADK1            30
     C                   MOVE      SEADK2        XADK2            30
     C                   MOVE      SEADK3        XADK3            30
     C                   MOVE      SETLF         XTLF             12
     C                   MOVE      SENAD         XNAD             30
     C                   MOVE      SEKTA         XKTA              5 0
     C                   MOVE      SEKTB         XKTB              2 0
     C                   MOVE      SEDST         XDST             15
      *
     C     *LOVAL        SETLL     SAEHFR
     C                   READ      SAEHFR                                 33
     C     *IN33         DOWEQ     '0'
      * OPPDATER SAEV
     C     SAEHK         SETLL     SAEVFR
     C     SAEHK         READE     SAEVFR                                 34
     C     *IN34         DOWEQ     '0'
     C                   MOVE      XAVD          SVAVD
     C                   MOVE      XTDN          SVTDN
     C                   WRITE     SAEVR
     C     SAEHK         READE     SAEVFR                                 34
     C  N34              ENDDO
      * OPPDATER SAEF
     C     SAEHK         SETLL     SAEFFR
     C     SAEHK         READE     SAEFFR                                 34
     C     *IN34         DOWEQ     '0'
     C                   MOVE      XAVD          SFAVD
     C                   MOVE      XTDN          SFOPDN
     C                   WRITE     SADFR
     C     SAEHK         READE     SAEFFR                                 34
     C  N34              ENDDO
      * OPPDATER SAEH
     C                   MOVE      *BLANKS       SEST
     C                   Z-ADD     2             SEAVD
     C                   MOVE      XTDN          SETDN
     C                   ADD       1             XTDN
     C                   MOVE      'CB '         SESG
     C                   MOVE      XRG           SERG
     C                   MOVE      XNAK          SENAK
     C                   MOVE      XADK1         SEADK1
     C                   MOVE      XADK2         SEADK2
     C                   MOVE      XADK3         SEADK3
     C                   MOVE      XTLF          SETLF
     C                   MOVE      XNAD          SENAD
     C                   MOVE      XKTA          SEKTA
     C                   MOVE      XKTB          SEKTB
     C                   MOVE      ' '           SEKTC
     C                   MOVE      XDST          SEDST
     C                   MOVE      ' '           SEUR
     C                   MOVE      *ZEROS        SEKNS
     C                   MOVE      *ZEROS        SEKNK
     C                   MOVE      *BLANKS       SEMF
     C                   MOVE      *ZEROS        SEMP
     C                   MOVE      *ZEROS        SEDTØ
     C                   MOVE      *BLANKS       SEMI
     C                   MOVE      *ZEROS        SEBELD
     C                   MOVE      *BLANKS       SEPKL
     C                   MOVE      *BLANKS       SEKDV
     C                   MOVE      *BLANKS       SE0035
     C                   MOVE      *BLANKS       SEWS
     C                   MOVE      *BLANKS       SEDTG
     C                   MOVE      *BLANKS       SETLL
     C                   MOVE      *BLANKS       SETLE
     C                   WRITE     SAEHR
      *
     C                   READ      SAEHFR                                 33
     C  N33              ENDDO
      *
     C     XAVD          CHAIN     STANDE                             33
     C                   MOVE      XTDN          SETDN
     C                   UPDATE    STANDER
      *
     C                   SETON                                        LR
     C                   RETURN
