P8068F* 09 TH  PTF8 ny helpfunksjon
********************************************************************
N09  Fsysthlp   IF   E             DISK
N09  c   01              do
n09  c                   exsr      helpsr
n09  c                   end
N09  C***********************************************
N09  C     HELPSR        BEGSR
N09  C***********************************************
N09  c
N09  c                   move      *blanks       pcocmd           70
N09  c     1             chain     systhlp                            33
N09  c     *in(33)       ifeq      '0'
N09   *
N09   * intern
N09  c                   movel     'http://'     pcocmd
N09  C     pcocmd        CAT       systip:0      pcocmd
N09  C     pcocmd        CAT       '/':0         pcocmd
N09  C     pcocmd        CAT       systba:0      pcocmd
N09  C     pcocmd        CAT       '/':0         pcocmd
N09  C     pcocmd        CAT       'sad003.pdf':0pcocmd
N09   *
N09  c                   call      'SYGE34CL'
N09  c                   parm                    pcocmd
N09  c                   end
N09  C                   ENDSR
