     H
     FFAXUSRS   UF   E           K DISK
     FCHGFAX    CF   E             WORKSTN
     C*
     C     *ENTRY        PLIST
     C     IN            PARM                    IN                1
     C     USERID        PARM                    USERID            8
     C     FAXNBR        PARM                    FAXNBR           32
     C     TO            PARM                    TO               40
     C     TITLE         PARM                    TITLE            40
     C     COMMEN        PARM                    COMMEN           40
     C     TO1           PARM                    TO1              40
     C     TO2           PARM                    TO2              40
     C     TO3           PARM                    TO3              40
     C     FI            PARM                    FI                2
     C     KNU           PARM                    KNU               8
     C     ALFA          PARM                    ALFA             10
     C     TELE          PARM                    TELE             32
     C*
     C     USERID        CHAIN     FAXREC                             41
     C     *IN41         IFEQ      '0'
     C                   MOVE      USERID        DUSERI
     C                   MOVE      FFAXNB        DFAXNB
     C                   MOVE      FTO           DTO
     C                   MOVE      FTITLE        DTITLE
     C                   MOVE      FCOMME        DCOMME
     C                   MOVE      FTO1          DTO1
     C                   MOVE      FTO2          DTO2
     C                   MOVE      FTO3          DTO3
     C                   MOVE      FFI           DFI
     C                   MOVE      FKNU          DKNU
     C                   MOVE      FALFA         DALFA
     C                   MOVE      FTELE         DTELE
     C                   EXFMT     INFO
     C     *IN03         IFEQ      '0'
     C                   MOVE      *BLANKS       FFAXNB
     C                   MOVE      *BLANKS       FTO
     C                   MOVE      *BLANKS       FTITLE
     C                   MOVE      *BLANKS       FCOMME
     C                   MOVE      *BLANKS       FTO1
     C                   MOVE      *BLANKS       FTO2
     C                   MOVE      *BLANKS       FTO3
     C                   MOVE      *BLANKS       FFI
     C                   MOVE      *BLANKS       FKNU
     C                   MOVE      *BLANKS       FALFA
     C                   MOVE      *BLANKS       FTELE
     C                   MOVE      DFAXNB        FFAXNB
     C                   MOVE      DTO           FTO
     C                   MOVE      DTITLE        FTITLE
     C                   MOVE      DCOMME        FCOMME
     C                   MOVE      DTO1          FTO1
     C                   MOVE      DTO2          FTO2
     C                   MOVE      DTO3          FTO3
     C                   MOVE      DFI           FFI
     C                   MOVE      DKNU          FKNU
     C                   MOVE      DALFA         FALFA
     C                   MOVE      DTELE         FTELE
     C                   UPDATE    FAXREC
     C                   MOVE      DFAXNB        FAXNBR
     C                   MOVE      DTO           TO
     C                   MOVE      DTITLE        TITLE
     C                   MOVE      DCOMME        COMMEN
     C                   MOVE      DTO1          TO1
     C                   MOVE      DTO2          TO2
     C                   MOVE      DTO3          TO3
     C                   MOVE      DFI           FI
     C                   MOVE      DKNU          KNU
     C                   MOVE      DALFA         ALFA
     C                   MOVE      DTELE         TELE
     C                   ELSE
     C                   MOVE      '1'           IN
     C                   MOVE      DFAXNB        FAXNBR
     C                   MOVE      DTO           TO
     C                   MOVE      DTITLE        TITLE
     C                   MOVE      DCOMME        COMMEN
     C                   MOVE      DTO1          TO1
     C                   MOVE      DTO2          TO2
     C                   MOVE      DTO3          TO3
     C                   MOVE      DFI           FI
     C                   MOVE      DKNU          KNU
     C                   MOVE      DALFA         ALFA
     C                   MOVE      DTELE         TELE
     C                   GOTO      END
     C                   END
     C                   ELSE
     C                   MOVE      'TBR0097'     MSGNR
     C                   END
     C*
     C     END           TAG
     C                   SETON                                        LR
     C                   RETURN
