      *
      ********************************************************************
      *   SYSTEMAvariant av slette prosjekt                              *
      *   Ingen liste                                                    *
      ********************************************************************
      *
      *  HR250SY SLETTE MERKEDE PROSJEKT
      *
      *-----------------------------------------------------------
      *---------------------------------------------------------------
      *
      *
     FPROSL01   UF   E           K DISK
     FSYSRL01   UF   E           K DISK
     FPBUDL01   UF   E           K DISK
     FPSALL01   UF   E           K DISK
     FPPOSL01   UF   E           K DISK
     FPRODQ01   UP   E           K DISK
      *
     D                UDS
     D  FIFIRM                 1      2
      *
      *
     C  N99              DO
     C     *LIKE         DEFINE    ANTBRU        SLETT
      *
     C     WSYSRF        KLIST                                                  FILINFO
     C                   KFLD                    FIRMA                          FIRMA
     C                   KFLD                    REGNAV                         FILNAVN
      *
     C     WKEY          KLIST                                                  FILINFO
     C                   KFLD                    FIRMA                          FIRMA
     C                   KFLD                    PROSNR                         PROSJEKT
     C                   SETON                                        99
     C                   END
      *
      *----------------------------------------------------------------
      * HOVEDPROGRAM START
      *----------------------------------------------------------------
      *
     C     AKTKOD        IFEQ      'I'
     C     FIRMA         ANDEQ     FIFIRM
     C                   EXSR      SLPROS
     C                   DELETE    PRODR
     C                   END
      ****
      ****
      *----------------------------------------------------------------
     C     SLPROS        BEGSR
      *----------------------------------------------------------------
      *
      * FJERNER POST I POSTERINGSFILEN
      *
     C                   MOVE      *ZEROS        SLETT
     C     WKEY          SETLL     PPOSR
     C                   MOVE      '0'           *IN51
     C     *IN51         DOWEQ     '0'
      *
     C     WKEY          READE     PPOSR                                  51
     C  N51              DELETE    PPOSR
     C  N51              ADD       1             SLETT
      *
     C                   END                                                       DO IN51
      *
      * Legg inn korrigert ant. brukt i systemregister
     C                   MOVEL     'PPOSF'       REGNAV
     C     WSYSRF        CHAIN     SYSRL01                            69
     C  N69ANTBRU        SUB       SLETT         ANTBRU
     C  N69              UPDATE    SYSRR
      *
      *
      *
      *
      *
      * FJERNER POST I BUDSJETTfilen
      *
     C                   MOVE      *ZEROS        SLETT
     C     WKEY          SETLL     PBUDR
     C                   MOVE      '0'           *IN51
     C     *IN51         DOWEQ     '0'
      *
     C     WKEY          READE     PBUDR                                  51
     C  N51              DELETE    PBUDR
     C  N51              ADD       1             SLETT
      *
     C                   END                                                       DO IN51
      *
      * Legg inn korrigert ant. brukt i systemregister
     C                   MOVEL     'PBUDF'       REGNAV
     C     WSYSRF        CHAIN     SYSRL01                            69
     C  N69ANTBRU        SUB       SLETT         ANTBRU
     C  N69              UPDATE    SYSRR
      *
      *
      *
      *
      * FJERNER POST I SALDOfilen
      *
     C                   MOVE      *ZEROS        SLETT
     C     WKEY          SETLL     PSALR
     C                   MOVE      '0'           *IN51
     C     *IN51         DOWEQ     '0'
      *
     C     WKEY          READE     PSALR                                  51
     C  N51              DELETE    PSALR
     C  N51              ADD       1             SLETT
      *
     C                   END                                                       DO IN51
      *
      * Legg inn korrigert ant. brukt i systemregister
     C                   MOVEL     'PSALF'       REGNAV
     C     WSYSRF        CHAIN     SYSRL01                            69
     C  N69ANTBRU        SUB       SLETT         ANTBRU
     C  N69              UPDATE    SYSRR
      *
      *
      * FJERNER POST I PROSJEKTFILEN
      *
     C                   MOVE      *ZEROS        SLETT
     C     WKEY          SETLL     PROSR
     C                   MOVE      '0'           *IN51
     C     *IN51         DOWEQ     '0'
      *
     C     WKEY          READE     PROSR                                  51
     C  N51              DELETE    PROSR
     C  N51              ADD       1             SLETT
      *
     C                   END                                                       DO IN51
      *
      * Legg inn korrigert ant. brukt i systemregister
     C                   MOVEL     'PROSF'       REGNAV
     C     WSYSRF        CHAIN     SYSRL01                            69
     C  N69ANTBRU        SUB       SLETT         ANTBRU
     C  N69              UPDATE    SYSRR
      *
     C                   ENDSR
      *
