********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11003 * 01 sh  PTF11 skjekk om bilagsbunke på gang
********************************************************************
     FHR900DSY  CF   E             WORKSTN
     FFIRM      IF   E           K DISK
N011 FMEMBL02   IF   E           K DISK    RENAME(MEMBR:MEMBR4)
      *
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZUSER                254    263
     C     *ENTRY        PLIST
     C                   PARM                    FEIL              1
      *
     C     KEYA          KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    ZUSER
     C                   KFLD                    RUTINE
     C                   KFLD                    STATUS
N011
N011 C     KEYC          KLIST
N011 C                   KFLD                    FIRMA
N011 C                   KFLD                    RUTINE
      *
     C                   MOVE      'A'           RUTINE
     C                   READ      FIRM                                   33
      *
      ****
      *  Sjekk om status "B" avbrudd ved forrige registrering.
      *  Vis bilde om feil. F1 eller F14 er gyldige.
      ****
      *
N011
     C                   MOVE      'B'           STATUS
     C     KEYA          CHAIN     MEMBL02                            50
     C     *IN50         IFEQ      '0'
     C                   MOVE      'J'           FEIL
     C                   END
      ****
      *  Sjekk om status "C" ikke oppdaterte registreringer.
      *  Vis oversikt over membere. Kryss for den som skal brukes.
      ****
     C                   MOVE      'C'           STATUS
     C     KEYA          CHAIN     MEMBL02                            50
     C     *IN50         IFEQ      '0'
     C                   MOVE      'J'           FEIL
     C                   END
      ****
     C     FEIL          IFEQ      'J'
     C                   EXFMT     BILDE01
     C                   END
     C                   SETON                                        LR
     C                   RETURN
