     FFORSL02   UF   E           K DISK
     FLRESL09   UF   E           K DISK
     FIBMFORSD  CF   E             WORKSTN
      *
     C     KEY           KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    FORSNR
      *
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       30
     C     *IN03         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END
     C     KEY           CHAIN(N)  FORSL02                            30
     C     *IN30         IFEQ      '1'
     C                   MOVE      'SHU0771'     MSGNR
     C                   GOTO      START
     C                   END
     C     UTBET         IFNE      'J'
     C                   MOVE      'SHU0772'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C*
     C     START2        TAG
     C                   EXFMT     BILDE02
     C     *IN03         IFEQ      '1'
     C                   GOTO      START
     C                   END
     C     *IN05         IFEQ      '1'
     C     KEY           CHAIN     FORSL02                            33
     C     *IN33         IFNE      '1'
     C                   MOVE      'F'           UTBET
     C                   MOVE      ' '           BETRUT
     C                   UPDATE    FORSR
     C     KEY           SETLL     LRESL09
     C     *IN33         DOWEQ     '0'
     C     KEY           READE     LRESL09                                33
     C     *IN33         IFEQ      '0'
     C                   MOVE      ' '           UTBET
     C                   UPDATE    LRESR
     C                   END
     C                   END
     C                   GOTO      START
     C                   END
     C                   END
     C                   GOTO      START2
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
