     FKUNKO     IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKN               8
     C                   PARM                    UFLAGG            1
      *
     C                   MOVE      UKN           YKN               8 0
     C     YKN           SETLL     KUNKO
     C     YKN           READE     KUNKO                                  33
     C   33              MOVE      '1'           UFLAGG
      *
     C                   SETON                                        LR
     C                   RETURN
