     FHEADF     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FECMSG     IF   E           K DISK
     FIE011D    CF   E             WORKSTN
     D                 DS
     D  HERFA                  1     35
     D  HERFA15                1     15
     D                 DS
     D  IREF                   1     15
     D  ITXT1                  1      4
     D  IAVD                   5      8
     D  IOPD                   9     15
     D                 DS
     D  DSPARM                 1    256
     D  DSKN                   1      8
     D  WSUR                   9      9
     D  WSOT                  10     11
     D  WSFR                  12     14
     D  WSGM1                 15     29
     D  WSGM2                 30     44
     D  WSVS1                 45     69
     D  WSVS2                 70     94
     D  WSFK1                 95     95
     D  WSFK2                 96     96
     D  WSFK3                 97     97
     D  WSFK4                 98     98
     D  WSFK5                 99     99
     D* WSRFA                100    114
     D  WSRFA15              100    114
     D  DSEND                256    256
      *
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C     WSKN          IFNE      *ZEROS
     C     CUN11K        CHAIN     CUNDL01                            33
     C     ECMKEY        CHAIN     ECMSG                              52
     C                   END
     C                   EXFMT     WINDOW1
      *
     C     *IN12         IFEQ      '1'
     C                   MOVE      '1'           UIN01             1
     C                   GOTO      SLUTT
     C                   END
      *
     C     *IN04         IFEQ      '1'
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *
     C     WSKN          IFEQ      *ZEROS
     C     WSLIB         OREQ      *BLANKS
     C                   GOTO      START
     C                   END
      *
      * FLYTT DATA TIL PARAMETER-DS
     C                   MOVE      WSLIB         ULIB
     C*                    MOVE WSKN      DSKN
      * ECPGM=SENDRS KUNDENR HOS MOTTAKER.
     C                   MOVEL     ECPGM         DSKN
     C                   MOVE      DSPARM        UPARMX
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        XXKN
     C                   CALL      'IE011B'
     C                   PARM                    XXKN
     C                   PARM                    XXLIB
     C     XXKN          IFNE      *ZEROS
     C                   MOVE      XXKN          WSKN
     C                   MOVE      XXLIB         WSLIB
     C                   END
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    HEAVD         YAVD
     C     *LIKE         DEFINE    HEOPD         YOPD
     C     OPDKEY        KLIST
     C                   KFLD                    YAVD
     C                   KFLD                    YOPD
     C     ECMKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKN
     C                   KFLD                    YYSR
     C                   KFLD                    YY0065
     C     *LIKE         DEFINE    ECSR          YYSR
     C     *LIKE         DEFINE    EC0065        YY0065
     C                   MOVE      'S'           YYSR
     C                   MOVE      'SYSPED'      YY0065
     C     CUN11K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKN
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
     C                   PARM                    ULIB             10
     C                   PARM                    UPARMX          256
     C                   PARM                    UIN01
      *
     C                   MOVE      UAVD          YAVD
     C                   MOVE      UOPD          YOPD
      *
     C                   MOVE      'X'           DSEND
      *
     C                   READ      FIRM                                   33
      * EN OG BARE 1 MOTPART???
     C                   MOVE      *ZEROS        XXANT             2 0
     C                   MOVE      *ZEROS        XXKN              8 0
     C                   MOVE      *BLANKS       XXLIB            10
     C     FIFIRM        SETLL     ECMSG
     C     FIFIRM        READE     ECMSG                                  33
     C     *IN33         DOWEQ     '0'
     C     EC0065        IFEQ      'SYSPED'
     C     ECSR          ANDEQ     'S'
     C                   ADD       1             XXANT             2 0
     C                   MOVE      ECCNO         XXKN
     C                   MOVEL     ECLIB         XXLIB
     C                   END
     C     FIFIRM        READE     ECMSG                                  33
     C                   END
      *
     C                   MOVE      *ZEROS        WSKN
     C                   MOVE      *BLANKS       KNAVN
     C                   MOVE      *BLANKS       WSLIB
     C     XXANT         IFEQ      1
     C                   MOVE      XXKN          WSKN
     C                   MOVE      XXLIB         WSLIB
     C                   END
      *
      * HENT DATA SOM SKAL FORESLÅS I BILDET
     C     OPDKEY        CHAIN     HEADF                              33
     C                   MOVE      'IRF:'        ITXT1
     C                   MOVE      UAVD          IAVD
     C                   MOVE      UOPD          IOPD
     C*                  MOVEL     IREF          WSRFA
     C                   MOVEL     IREF          WSRFA15
     C                   MOVE      HEGM1         WSGM1
     C                   MOVE      HEGM2         WSGM2
     C                   MOVE      HEVS1         WSVS1
     C                   MOVE      HEVS2         WSVS2
     C                   ENDSR
      *
