********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 CB  '\' Backslash er ikke lov i JSON
11XXX * 02 JOV Ikke skrivbaer under hex40 + hex41=&nbsp byttes med blank
********************************************************************
      * Definere  hex appostrof
     D App             c                   x'7D'
N02   * Definere  hex ikke skrivbare
N02  D Iks             c                   x'000102030405060708090A0B0C0D0E0F-
N02  D                                       101112131415161718191A1B1C1D1E1F-
N02  D                                       202122232425262728292A2B2C2D2E2F-
N02  D                                       303132333435363738393A3B3C3D3E3F-
N02  D                                       41'                                x'41'=&nbsp
N02   * byttes med blank
N02  D bla             c                   x'40404040404040404040404040404040-
N02  D                                       40404040404040404040404040404040-
N02  D                                       40404040404040404040404040404040-
N02  D                                       40404040404040404040404040404040-
N02  D                                       40'
      *
     c     *entry        plist
     c                   parm                    String        32000
      *
      * i flg dokumentasjon skal /" være rett måte å escape en " i JSON - men det blir syntaxfeil
      * Inn til videre jukser med å omsette " til '
     c*                  z-add     1             pos               5 0
     c*                  dow       pos <> 0
     c*                  EVAL      pos  = %scan ('"' : String : pos)
     c*                  if        pos <> 0
     c*                  eval      String = %replace ('/"': String: Pos :1)
     c*                  eval      pos=pos+2
     c*                  endif
     c*                  enddo
      * Midlertideig ertatter med single-app
     c     '"':App       xlate     String        String
N02  c     Iks:Bla       xlate     String        String                         ikke skrivbar->blank
     c     '¬':'"'       xlate     String        String
     c     X'BB':X'40'   xlate     String        String
     c     '\':X'40'     xlate     String        String

     C                   SETON                                        LR
     C                   RETURN
