      *
     FklokkeFM  CF   E             WORKSTN
     C                   EXFMT     klokke
     C                   SETON                                        LR
     C                   RETURN
     C*
