      *****************************************************************
      *
     FEDIS4     UF   E           K DISK
      *
      * LESER ALLE POSTER SOM IKKE HAR SMBR = REMOVED
      *
     C     *LOVAL        SETLL     EDIS4
     C                   READ      EDIS4                                  90
     C     *IN90         DOWEQ     *OFF
     C     SMBR          IFEQ      'REMOVED'
     C                   LEAVE
     C                   ENDIF
     C                   SELECT
     C     SFILE         WHENEQ    'TVINRE'
     C                   MOVEL     'EDIRE '      SFILE
     C     SFILE         WHENEQ    'TVINSE'
     C                   MOVEL     'EDISE '      SFILE
     C                   ENDSL
     C                   UPDATE    EDISR
     C                   READ      EDIS4                                  90
     C                   ENDDO
      * ENDRE BIBLIOTEKSNAVN
     C                   CALL      'KNVEDIS2'
      *
     C                   SETON                                        LR
