      *
      *****************************************************************
      *** PROGRAM FOR KONVERTERING AV GEBYRKODER                    ***
      *****************************************************************
      *
     FKODTGE    UP   E           K DISK
      *
     C                   SELECT
     C     KGEFRA        WHENEQ    'J'
     C                   MOVE      'AI'          KGEIE
     C                   MOVE      'AI'          KGEII
     C                   MOVE      'AK'          KGEKE
     C                   MOVE      'AK'          KGEKI
     C     KGEFRA        WHENEQ    'N'
     C                   MOVE      'BI'          KGEIE
     C                   MOVE      'BI'          KGEII
     C                   MOVE      'BK'          KGEKE
     C                   MOVE      'BK'          KGEKI
     C     KGEFRA        WHENEQ    'F'
     C                   MOVE      'AI'          KGEIE
     C                   MOVE      'AI'          KGEII
     C                   MOVE      'AI'          KGEKE
     C                   MOVE      'AI'          KGEKI
     C     KGEFRA        WHENEQ    'G'
     C                   MOVE      'BI'          KGEIE
     C                   MOVE      'BI'          KGEII
     C                   MOVE      'BI'          KGEKE
     C                   MOVE      'BI'          KGEKI
     C     KGEFRA        WHENEQ    'K'
     C                   MOVE      'AK'          KGEIE
     C                   MOVE      'AK'          KGEII
     C                   MOVE      'AK'          KGEKE
     C                   MOVE      'AK'          KGEKI
     C     KGEFRA        WHENEQ    'I'
     C                   MOVE      *BLANKS       KGEIE
     C                   MOVE      *BLANKS       KGEII
     C                   MOVE      *BLANKS       KGEKE
     C                   MOVE      *BLANKS       KGEKI
     C                   ENDSL
     C                   UPDATE    KOGER
