     FTRKODF    UP   E           K DISK
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZ')
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyz')
     c     tkunik        ifeq      '106'
     C     LO:UP         XLATE     TKTXTN        TKTXTN
     C     LO:UP         XLATE     TKTXTE        TKTXTE
     c                   update    trkodfr
     c                   end
