     F*
     F* KONVERTERER FRA MSGCON TIL MSGID
     FKONFIL    UP   E             DISK
     D                 DS
     D  NYLEN1                 1      3
     D  NYLENT                 1      1
     D                 DS
     D  DATA                   1     41
     D  MSGIDI                 1      6
     D  MSGIDA                 7      9
     D  VAR                    7      7
     D  TESTB                 10     10
     D  MSGID1                10     13
     D  MSGID2                11     14
     D                 DS
     D  DATAUT                 1     41
     D  MSGCOT                 1      7
     D  NYLENG                 8     10  0
     D  BL00                  11     11
     D  MSGCO1                12     14
     D  MSGCO2                15     18
     D  BL02                  19     19
     D  FAST1                 20     25
     D  FAST2                 26     32
     C     LENGD         IFNE      *BLANKS
     C     VAR           IFNE      '&'
     C     MSGIDI        IFEQ      'MSGID('
     C                   MOVE      *BLANKS       BLANK1
     C                   MOVE      LENGD         NYLEN1
     C     NYLENT        IFEQ      ' '
     C                   MOVE      '0'           NYLENT
     C                   END
     C                   MOVE      NYLEN1        NYLENG
     C                   MOVE      *BLANKS       LENGD
     C                   MOVE      *BLANKS       BLANK2
     C                   MOVE      'MSGCON('     MSGCOT
     C                   MOVE      MSGIDA        MSGCO1
     C     TESTB         IFNE      *BLANKS
     C                   MOVE      MSGID1        MSGCO2
     C                   ELSE
     C                   MOVE      MSGID2        MSGCO2
     C                   END
     C                   MOVE      '*LIBL/'      FAST1
     C                   MOVE      'SYMSGF)'     FAST2
     C                   MOVE      DATAUT        DATA
     C                   UPDATE    KONFILR
     C                   END
     C                   END
     C                   END
