      *
      * KONVERTERER FRA MSGCON TIL MSGID
     FKONINIFM  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    SFILE
     C                   PARM                    MEMBER
     C                   PARM                    BIBL
     C                   PARM                    SLUTT             1
     C                   MOVE      'N'           SLUTT
     C     SFILE         IFEQ      *BLANKS
     C                   MOVEL     'QDDSSRC'     SFILE
     C                   END
     C     START         TAG
     C                   EXFMT     BILDE01
     C   03              MOVE      'J'           SLUTT
     C   03              GOTO      END
     C     SFILE         IFEQ      *BLANKS
     C                   MOVEL     'QDDSSRC'     SFILE
     C                   GOTO      START
     C                   END
     C     MEMBER        IFEQ      *BLANKS
     C                   GOTO      START
     C                   END
     C     BIBL          IFEQ      *BLANKS
     C                   GOTO      START
     C                   END
     C     END           TAG
     C                   SETON                                        LR
     C                   RETURN
