     H DEBUG DECEDIT('0,') DFTNAME(KONVS3) DATEDIT(*DMY.)
      ********************************************************************
      *   5797-AWD IBM NORWAY 1988
      *   5797-AWD COPYRIGHT IBM CORP 1988
      *   REFER TO INSTRUCTIONS ON COPYRIGHT NOTICE NO. G120-2083
      ********************************************************************
      *
      * KONVERTERING AV REGISTRE: LEVE OG LRES TIL AS/400
      *
      * ENDRET TIL UTGAVE 2.2 AV LØSNING1
      ****************************************************************
      *
     FLEVE      IP   F  360        DISK
     FLEVEF     O  A F  391        DISK
     FKLEVF     O  A F  128        DISK
     ILEVE      NS  01
     I                                  1    2  AKTKOD
     I                                  3    3  ENDKOD
     I                                  4    8 0JOURNR
     I                                  9   16  USER
     I                                 17   22 0DATO
     I                                 23   28 0TID
     I                                 29   30  WSID
     I                                 31   32  FIRMA
     I                                 33   40 0LEVNR
     I                                 41   70  LNAVN
     I                                 71  100  ADR1
     I                                101  130  ADR2
     I                                131  134 0POSTNR
     I                                135  158  ADR3
     I                                159  188  KPERS
     I                                189  203  TLF
     I                                204  213  SONAVN
     I                                214  216  LAND
     I                                217  219  VALKOD
     I                                220  220  SPRAAK
     I                                221  221  HEAD
     I                                222  236  BANKG
     I                                237  256  POSTG
     I                                257  264 0KUNDNR
     I                                265  273  FACT
     I                                274  281 0FACTNR
     I                                282  283  BETBET
     I                                284  284  BETMAT
     I                                285  285  AKONT
     I                                286  288  KHENV
     I                                289  294  SISDAA
     I                             P  295  301 2KSALDO
     I                                302  305 0KUTSK
     I                             P  306  312 2VKJOP1
     I                             P  313  319 2VKJOP2
     I                                320  325 0DATOO
     I                                326  329 0KUTSKF
     C   80              GOTO      OK
     C                   MOVE      *ZEROS        N5                5 0
     C                   MOVE      *ZEROS        N7                7 0
     C                   MOVE      *ZEROS        N8                8 0
     C                   MOVE      *ZEROS        N9                9 0
     C                   MOVE      *BLANKS       A6                6
     C                   MOVE      *BLANKS       A7                7
     C                   MOVE      *BLANKS       A10              10
     C                   MOVE      *BLANKS       A20              20
     C                   SETON                                        80
     C     OK            TAG
     C                   SETOFF                                       91
     C                   MOVEL     AKTKOD        WAKTKO            1
     C     AKTKOD        COMP      'AI'                                   92
     C   92              MOVE      'I'           WAKTKO
     C*
     C                   Z-ADD     JOURNR        JOURNR
     C                   Z-ADD     POSTNR        POSTNR
     C                   Z-ADD     KUNDNR        KUNDNR
     C                   Z-ADD     FACTNR        FACTNR
     C                   Z-ADD     *ZEROS        ORDRAL            5 2
     C     SISDAA        IFGT      '000000'
     C     SISDAA        ANDLT     '999999'
     C                   MOVE      SISDAA        SISDAT            6 0
     C                   ELSE
     C                   Z-ADD     0             SISDAT
     C                   END
     C                   Z-ADD     KUTSK         WKUTSK            5 0
     C                   Z-ADD     DATOO         DATOO
     C                   Z-ADD     KUTSKF        WKUTF             5 0
     C                   MOVE      *BLANKS       KHENIT            3
     C                   MOVE      *BLANKS       LEVBET            2
     C                   MOVE      *BLANKS       LEVMAT            2
     C                   MOVE      *ZEROS        LEDTID            3 0
     C                   MOVE      *BLANKS       TFAXNR           15
     C                   MOVE      *ZEROS        AGENNR            8 0
     C                   MOVE      *ZEROS        LOMKPR            5 2
     C                   MOVE      *BLANKS       LEVTYP            1
     C                   MOVE      *BLANKS       SPEDNR            2
     C*
     C                   MOVEL     USER          WUSER            10
     C                   Z-ADD     JOURNR        JOURNR
     C                   Z-ADD     DATO          DATO
     C                   Z-ADD     TID           TID
     C*
     C                   MOVE      *BLANKS       JOBNR             6
     C                   Z-ADD     *ZEROS        STEDH             4 0
     C                   Z-ADD     *ZEROS        BARERH            4 0
     C                   MOVE      *BLANKS       INTKOD            1
     C                   MOVE      *ZEROS        DAUDAT            6 0
     C                   MOVE      *ZEROS        LRSGT            13 0
     C                   MOVE      *BLANKS       BILKOD            2
     C                   MOVE      *BLANKS       KRNOKD            1
     C                   SETOFF                                       94
     C*
     OLEVEF     DADD 01
     O                       WAKTKO               1
     O                       JOURNR               4P
     O                       FIRMA                6
     O                       LEVNR               14
     O                       LNAVN               44
     O                       ADR1                74
     O                       ADR2               104
     O                       POSTNR             108
     O                       ADR3               132
     O                       KPERS              162
     O                       TLF                177
     O                       SONAVN             187
     O                       LAND               190
     O                       VALKOD             193
     O                       SPRAAK             194
     O                       HEAD               195
     O                       BANKG              210
     O                       POSTG              230
     O                       KUNDNR             238
     O                       FACT               247
     O                       FACTNR             255
     O                       BETBET             257
     O                       BETMAT             258
     O                       KHENV              261
     O                       KHENIT             264
     O                       AKONT              265
     O                       LEVBET             267
     O                       LEVMAT             269
     O                       ORDRAL             272P
     O                       SISDAT             278
     O                       KSALDO             285P
     O                       WKUTSK             288P
     O                       VKJOP1             295P
     O                       VKJOP2             302P
     O                       DATOO              308
     O                       WKUTF              311P
     O                       LEDTID             313P
     O                       TFAXNR             328
     O                       AGENNR             336
     O                       LOMKPR             339P
     O                       LEVTYP             340
     O                       SPEDNR             342
     O                       A7                 349
     O                       N9                 354P
     O                       A20                374
     O                                          375 ' '
     O                       N5                 378P
     O                       N5                 381P
     O                                          383 '  '
     O                       N8                 391
     OKLEVF     DADD 01
     O                       WAKTKO               1
     O                       FIRMA                3
     O                       LEVNR               11
