     FSAEH      IP   E             DISK
     FWRKK      UF A E           K DISK
     FFIRM      IF   E           K DISK
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        WFIR
     C     WRKKEY        KLIST
     C                   KFLD                    WFIR
     C                   KFLD                    WKNR
     C*
     C     SEKNS         IFNE      *ZEROS
     C                   MOVE      SEKNS         WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
     C     SEKNK         IFNE      *ZEROS
     C                   MOVE      SEKNK         WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
