     FHEADF     IP   E             DISK
     FWRKK      UF A E           K DISK
     FFIRM      IF   E           K DISK
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        WFIR
     C     WRKKEY        KLIST
     C                   KFLD                    WFIR
     C                   KFLD                    WKNR
     C*
     C     HEKNA         IFNE      *ZEROS
     C                   MOVE      HEKNA         WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
     C     HEKNS         IFNE      *ZEROS
     C                   MOVE      HEKNS         WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
     C     HEKNSF        IFNE      *ZEROS
     C                   MOVE      HEKNSF        WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
     C     HEKNK         IFNE      *ZEROS
     C                   MOVE      HEKNK         WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
     C*
     C     HEKNKF        IFNE      *ZEROS
     C                   MOVE      HEKNKF        WKNR
     C     WRKKEY        CHAIN     WRKK                               44
     C   44              WRITE     WRKKR
     C                   END
