*****F**************************************************************
      * SETTER RIKTIG SALDO I KUNDERESKONTRO
     FKUNDF     UP   E             DISK
     FKRESL01   IF   E           K DISK
     C                   MOVE      *ZEROS        KSALDO
     C                   EXSR      SUMSAL
     C                   EXCEPT    KSAL
     C***********************************
     C     SUMSAL        BEGSR
     C***********************************
     C     KEY           KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    KUNDNR
     C                   SETOFF                                       33
     C     KEY           SETLL     KRESL01
     C     *IN33         DOUEQ     '1'
     C     KEY           READE     KRESL01                                33
     C     *IN33         IFEQ      '0'
     C                   ADD       RESTN         KSALDO
     C                   END
     C                   END
     C                   ENDSR
     OKUNDR     E            KSAL
     O                       KSALDO
