*****F**************************************************************
      * SETTER RIKTIG SALDO I KUNDERESKONTRO
     FLEVEF     UP   E             DISK
     FLRESL01   IF   E           K DISK
     C                   MOVE      *ZEROS        KSALDO
     C                   EXSR      SUMSAL
     C                   EXCEPT    KSAL
     C***********************************
     C     SUMSAL        BEGSR
     C***********************************
     C     KEY           KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    LEVNR
     C                   SETOFF                                       33
     C     KEY           SETLL     LRESL01
     C     *IN33         DOUEQ     '1'
     C     KEY           READE     LRESL01                                33
     C     *IN33         IFEQ      '0'
     C                   ADD       RESTN         KSALDO
     C                   END
     C                   END
     C                   ENDSR
     OLEVER     E            KSAL
     O                       KSALDO
