     FLBARC     O    E             PRINTER OFLIND(*IN01)
     D                 DS
     D  WBARC                  1     18  0
     D  WBARCA                 1      3  0
     D  WBARCB                 4     11  0
     D  WBARCC                12     14  0
     D  WBARCD                15     18  0
     C                   Z-ADD     111           WBARCA                         KUNDE-ID
     C                   Z-ADD     22222222      WBARCB                         FRAKTBREV-ID
     C                   Z-ADD     333           WBARCC                         ANT.MERKL
     C                   Z-ADD     4444          WBARCD                         POSTNR
     C                   MOVEL     'FISKE AS'    KNAVN
     C                   MOVEL     'SJØGT. 4'    ADR1
     C                   Z-ADD     8500          POSTNR
     C                   MOVEL     'NARVIK'      ADR3
     C                   MOVEL     'NILSEN'      DFNAM
     C                   MOVEL     'SKIPSG.1'    DFADL
     C                   Z-ADD     1500          DFADUP
     C                   MOVEL     'MOSS'        DFADU
     C                   Z-ADD     2             DFNT
     C     1             DO        DFNT
     C                   WRITE     LBARC1
     C                   WRITE     LBARC2
     C                   WRITE     LBARC3
     C                   END
     C                   MOVE      '1'           *INLR
