     c                   move      *zeros        KundeNr
     c                   move      'NO'          FraLK             2
     c                   move      '4029 '       FraPn             5
     c                   move      'NO'          TilLK             2
     c                   move      '6500 '       TilPn             5
     c                   call      'LEVTID'
     c                   parm                    KundeNr           8 0
     c                   parm                    ProdKod           1
     c                   parm                    FraLK             2
     c                   parm                    FraPn             5
     c                   parm                    TilLK             2
     c                   parm                    TilPn             5
     c                   parm                    UavgDgr           7
     c                   parm                    UframfTid         2 0
     c                   parm                    UframfTimer       3 0
     c                   parm                    UStartKod         5            LTSTMK
     c                   parm                    USisteBook        4 0          LTBOTI
     c                   parm                    USisteInn         4 0          LTINTI
     c                   parm                    USisteAvg         4 0          LTAVTI
     c                   parm                    USisteLev         4 0          LTLETI
      *
     C     ikkeFunnet    tag
     C                   seton                                        LR
     C                   return
