      *
      ***********************************************************
      *** PROGRAM SKAL SØKE VAREKODER                         ***
      ***********************************************************
      *
     FLLVARE01  IF   E           K DISK
     FLLVARE02  IF   E           K DISK
     F                                     RENAME(LLVARER:LLVARER2)
     FLLVARE03  IF   E           K DISK
     F                                     RENAME(LLVARER:LLVARER3)
     FLLVADR3   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FLL002D    CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  LVVB                   1     35
     D  LVVB30                 1     30
     D                 DS
     D  W2VB                   1     35
     D  W2VB30                 1     30
     D                 DS
     D  LVLOK1                 1      5
     D  LVLOK2                 6     25
     D  LVLLOK                 1     25
     D                 DS
     D  LVAN01                 1      5  0
     D  LVAN00                 1      5  0
     D  vari           S             30A   VARYING
     D  soke           S             30
     D  NAVN           S             30
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2ANR         XANR
     C                   MOVE      W2ANRL        XANRL
     C                   MOVE      W2VB          XVB
     C                   MOVE      *BLANKS       YANR
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27
     CANN28LLV01K        SETLL     LLVARE01
     c     wfri          ifeq      *blanks
     C   27
     CANN28LLV02K        SETLL     LLVARE02
     C                   else
     C   27
     cANN28llvark        setll     llvare02
     c                   end
     C   27
     CAN 28LLV03K        SETLL     LLVARE03
     C                   MOVE      *BLANKS       W2ANR
     C                   MOVE      *BLANKS       W2ANRL
     C                   MOVE      *BLANKS       W2VB
     C     START1        TAG
     C  N27
     CANN28LLVARK        READE     LLVARE01                               94
     C   27
     CANN28LLVARK        READE     LLVARE02                               94
     C   27
     CAN 28LLVARK        READE     LLVARE03                               94
     C  N94LVVKT0        CABEQ     0             START1
     C  N94LVAKT         CABEQ     'I'           START1
      *frisok
     C   27
     CANN28
     cANN94wfri          ifeq      'J'
     C                   move      LVVB30        NAVN
     C     VARI          SCAN      NAVN          NUM2              2 0    72
     c  N72              goto      start1
     c                   end
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     ST21          TAG
     C  N27
     CANN28LLVARK        READE     LLVARE01                               94
     C   27
     CANN28LLVARK        READE     LLVARE02                               94
     C   27
     CAN 28LLVARK        READE     LLVARE03                               94
     C  N94LVVKT0        CABEQ     0             ST21
     C  N94LVAKT         CABEQ     'I'           ST21
      *frisok
     C   27
     CANN28
     cANN94wfri          ifeq      'J'
     C                   move      LVVB30        NAVN
     C     VARI          SCAN      NAVN          NUM2              2 0    72
     c  N72              goto      st21
     c                   end
     C  N94              MOVE      LVANR         YANR
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   SELECT
     C     XANR          WHENNE    *BLANKS
     C     XANRL         ORNE      *BLANKS
     C     XVB           ORNE      *BLANKS
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     *IN27         WHENEQ    '0'
     C     *IN28         ANDEQ     '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   OTHER
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   ENDSL
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C   10              do
     C                   EVAL      SOKE=w2vb30
     C     ' '           CHECKR(E) SOKE          NUM               2 0
     C                   EVAL      %len(VARI) = NUM
     C     NUM           SUBST     SOKE:1        VARI
      *
     C                   move      'J'           wfri              1
     C                   end
     C                   SETOFF                                       9830
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     1             UFLAGG
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              DO
     C                   MOVE      XANR          W2ANR
     C                   MOVE      XANRL         W2ANRL
     C                   MOVE      XVB           W2VB
     C                   GOTO      START
     C                   END
      *** LAGE NY
     C   06              DO
     C                   MOVE      UGRP          UGRP2             8
     C                   MOVE      UPNR          UPNR2             8
     C                   CALL      'LL001CS'
     C                   PARM                    UGRP2
     C                   PARM                    UPNR2
     C                   GOTO      START
     C                   END
      *
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94LLV21K        CHAIN     LLVARE01                           94
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2ANR         ANDNE     *BLANKS
     C                   MOVE      W2ANR         UANR
     C                   GOTO      SLUTT
     C                   END
     C     W2ANR         IFNE      *BLANKS
     C     W2ANRL        ORNE      *BLANKS
     C     W2VB          ORNE      *BLANKS
     C                   SELECT
     C     W2ANRL        WHENNE    *BLANKS
     C     W2ANR         ANDEQ     *BLANKS
     C     W2VB          ANDEQ     *BLANKS
     C                   MOVEA     '11'          *IN(27)
     C     W2ANR         WHENEQ    *BLANKS
     C                   MOVEA     '10'          *IN(27)
     C                   OTHER
     C                   MOVEA     '00'          *IN(27)
     C                   ENDSL
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      LVANR         UANR
     C                   MOVE      LVANRL        UANRL
     C                   MOVE      LVTXT         UTXT
     C                   SETON                                        LR
     C                   RETURN
     C                   ELSE
     C     WSNR          IFEQ      '5'
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C     LLV31K        CHAIN     LLVARE01                           33
     C                   UPDATE    SUBFIL
     C     VADRK         CHAIN     LLVADR3                            33
     C   33              MOVE      *BLANKS       XADRNA
     C                   EXFMT     VISART
     C                   END
     C                   END
     C                   END
      *
     C     *IN99         IFEQ      '1'
     C                   MOVEA     '00'          *IN(98)
     C                   ELSE
     C                   MOVE      '0'           *IN99
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    LVTXT         UTXT
     C     *LIKE         DEFINE    LVGRUP        UGRP
     C     *LIKE         DEFINE    LVPNR         UPNR
     C     *LIKE         DEFINE    LVANR         UANR
     C     *LIKE         DEFINE    LVANR         XANR
     C     *LIKE         DEFINE    LVANR         YANR
     C     *LIKE         DEFINE    LVANRL        UANRL
     C     *LIKE         DEFINE    LVANRL        XANRL
     C     *LIKE         DEFINE    LVVB          XVB
     C     LLVARK        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C     LLV01K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    W2ANR
     C     LLV02K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    W2VB
     C     LLV03K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    W2ANRL
     C     LLV11K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    UANR
     C     LLV21K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    YANR
     C     LLV31K        KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
     C                   KFLD                    LVANR
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    LVPNR
     C                   KFLD                    LVLNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    UGRP
     C                   PARM                    UPNR
     C                   PARM                    UANR
     C                   PARM                    UANRL
     C                   PARM                    UTXT
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      *BLANKS       LVVB
     C                   MOVE      *BLANKS       W2VB
     C                   MOVE      *ZEROS        LVAN01
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C     UFLAGG        IFEQ      1
     C     LLV11K        CHAIN     LLVARE01                           33
     C  N33              EXFMT     VISART
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   MOVE      *ZEROS        UFLAGG
      *
     C     UANR          IFEQ      *BLANKS
     C                   MOVEA     '10'          *IN(27)
     C                   ELSE
     C                   MOVE      UANR          W2ANR
     C                   MOVEA     '00'          *IN(27)
     C                   END
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
