      *
      **************************************************************
      *** PROGRAM SKAL HENTE PRINTERSTYRING TOLLAGERLISTE      ***
      **************************************************************
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 JOV PTF11 endrede defaultverdier/parameter for skriv til fil/takler DK/SE/NO
********************************************************************
      *
     FLL025ED   CF   E             WORKSTN
N01  FFIRM      IF   E           K DISK
     FLLGRPK05  IF   E           K DISK
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSLF1                  1      5
     D  WSLF2                  6     25
     D  WSLAGF                 1     25
     D                 DS
     D  WSLT1                  1      5
     D  WSLT2                  6     25
     D  WSLAGT                 1     25
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSGNF
     C                   PARM                    WSGNT
     C                   PARM                    WSARTF
     C                   PARM                    WSARTT
     C                   PARM                    UPNR              8
     C                   PARM      WSLAGF        ULAGF            25
     C                   PARM      WSLAGT        ULAGT            25
     C                   PARM                    WSDET
     C                   PARM                    WSSALD
     C                   PARM                    WSTYPE
     C                   PARM                    WSBRUD
     C                   PARM                    UIN01             1
N01  C                   PARM                    WSFILE            1
N01  C                   PARM                    WSEPOST          70
      *
     C                   MOVE      '0'           UIN01
      *
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     34            POSNBR
N01  C     *loval        setll     firm
N01  C                   read      firm
N01   * 51 ON = DK
N01  C     FILAND        COMP      'DK'                                   51
N01   * 52 ON = SE
N01  C     FILAND        COMP      'SE'                                   52
N01   *
N01  C                   CALL      'SYGE15C'
N01  C                   PARM                    WDT               8
N01  C                   PARM                    WTM               6
N01  C                   MOVEL     WDT           WDTAAR            4
KINGSC*                  eval      WSGNF=WDTAAR
KINGSC*                  eval      WSGNT=WDTAAR+'9999'
KINGSc*                  move      '00021453'    WSPNR
N01  c                   move      'N'           WSBRUD
N01  c                   move      '+'           WSSALD
N01  c                   move      'F'           WSFILE
      *
     C     START         TAG
     C                   EXFMT     BILDE1
      **  AVSLUTT
     C     *IN03         IFEQ      *ON
     C                   MOVE      '1'           UIN01
     C                   GOTO      SLUTT
     C                   ENDIF                                                  <*IN03
      **
     C     *IN04         IFEQ      *ON
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   GOTO      START
     C                   END
     C*
     C*
     C                   MOVE      '0'           *IN30
      *
     C*
      *
     C* GODSNR FRA MÅ FYLLES UT
     C     WSGNF         IFEQ      *BLANKS
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   MOVE      'JOV1252'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END
      * TEST KUNDNR
     C                   IF        WSPNR <> 0
     C     WSPNR         CHAIN     LLGRPK05                           30
     C                   IF        *IN30
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     34            POSNBR
     C                   MOVE      'JOV0825'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C* TESTER
      *
      **  BLANK I GNR NR.  TIL -> SAMME SOM FRA
     C     WSGNT         IFEQ      *BLANKS
     C                   MOVE      WSGNF         WSGNT
     C                   ENDIF
      *
      **  BLANK I ART.NR.  TIL -> SAMME SOM FRA
     C     WSARTT        IFEQ      *BLANKS
     C                   MOVE      WSARTF        WSARTT
     C                   ENDIF
      *
     C                   MOVE      WSPNR         UPNR
     C*
      **  BLANK I LAGERLOK TIL -> SAMME SOM FRA
     C     WSLAGT        IFEQ      *BLANKS
     C                   MOVE      WSLAGF        WSLAGT
     C                   ENDIF
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
