********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 UKOPI = ' ' ER SAMME SOM UKOPI = 'N'
10XXX * 02 JOV UDSavd= *llanks-> 0001 (skal ikke skje i prod, forenkler test Komplett)
10XXX * 03 JOV PTF10 - Init DSfelter
10028 * 04 YBC PTF10 TILDEL VARER TIL RESTORDRE
10281 * 05 YBC PTF10 ARKIVER WEB-MOTTAKSRAPPORT
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 06 YBC PTF11 RETT FEIL VED START HENTING AV POSTER
11XXX * 07 YBC PTF11 SKRIV UT SERIENR
11XXX * 08 YBC PTF11 ENDRING AV MOTTAKSRAPPORT HEADING
11XXX * 09 YBC PTF11 TEST OM SERIENR ER REGISTRERT
********************************************************************
     FARKTXT    IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FARKIVL03  IF A E           K DISK
     FKODTA     IF   E           K DISK
     FKODTV     IF   E           K DISK    USROPN
     FKODTOT2   IF   E           K DISK    USROPN
     FKODTFM    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FVADR      IF   E           K DISK
     FFAK4      IF   E           K DISK    USROPN
     FCUSAAV    IF   E           K DISK    USROPN
     FFERDF     O    E             DISK    USROPN
     FLLKUNF    IF   E           K DISK
     FLLGRPK05  IF   E           K DISK
     FLLMRFL01  UF   E           K DISK
     FLLMRFL02  IF   E           K DISK
     F                                     RENAME(LLMRFR:LLMRFR2)
     FLLAGJL07  UF   E           K DISK
     FLLAGJL10  IF   E           K DISK
     F                                     RENAME(LLAGJR:LLAGJR10)
     FLLAGJL11  UF   E           K DISK    RENAME(LLAGJR:LLAGJR11)
     FLLVARE01  UF   E           K DISK
     FLLLISF    IF   E           K DISK
     FLLSERL03  IF   E           K DISK
     FTELL      UF   E           K DISK
     FKODTSF    IF   E           K DISK
     FHEADF     UF A E           K DISK
     FLL027D    CF   E             WORKSTN USROPN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     FLL027P    O    E             PRINTER OFLIND(*IN01)
     F                                     USROPN
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      4  0
     D  XTT                    1      6  0
     D  XDD                    7      8  0
     D  XMM                    9     10  0
     D  XÅÅ                   11     14  0
     D  XIDAG                  7     14  0
     D                 DS
     D  IDAG                   1      8  0
     D  IDAGÅ                  1      4  0
     D  IDAGM                  5      6  0
     D  IDAGD                  7      8  0
     D                 DS
     D  MRDT                   1      8  0
     D  MRDTÅ                  1      4  0
     D  MRDTM                  5      6  0
     D  MRDTD                  7      8  0
     D                 DS
     D  XMRDT                  1      8  0
     D  XMRDTD                 1      2  0
     D  XMRDTM                 3      4  0
     D  XMRDTÅ                 5      8  0
     D                 DS
     D  WSDT                   1      8  0
     D  WSDTÅ                  1      4  0
     D  WSDTM                  5      6  0
     D  WSDTD                  7      8  0
     D                 DS
     D  VALLOK                 1     25
     D  XXLLOK                 1     14
     D                 DS
     D  ENGAD3                 1     30
     D  SYPOGE                 1      9
     D  ADR3                  11     34
     D                 DS
     D  MRGN                   1     15
     D  XXGN                  15     15
     D                 DS
     D  UPARM2                 1     64
     D  UKJED                  1      8
     D  UPNR                   9     16
     D  UMRNR                 17     21
     D  UOPT                  22     22
     D  UKOPI                 23     23
     D UCMD            DS          1024
     D                 DS
     D OVREPO          C                   CONST('OVRPRTF -
     D                                     FILE(LL027P) -
     D                                     HOLD(*YES) -
     D                                     OVRSCOPE(*JOB)')
     D OVREPOE         C                   CONST('OVRPRTF -
     D                                     FILE(LL027P) -
     D                                     HOLD(*NO) -
     D                                     OVRSCOPE(*JOB)')
     D XTXT            C                   CONST('UTSKREVET')
     D                SDS
     D  ZUSER                254    263
     D                UDS
     D  UFIRM                  1      2
     D  UDSAVD                15     18  0
n02  D  UDSAVDA               15     18
     D  UDSSG                 19     21
     ILLAGJR10
     I              VASTAT                      V1STAT
     I              VAGRUP                      V1GRUP
     I              VAKJED                      V1KJED
     I              VAMN                        V1MN
     I              VAHK                        V1HK
     I              VAANR                       V1ANR
     I              VAANRL                      V1ANRL
     I              VAFAR                       V1FAR
     I              VASIZ                       V1SIZ
     I              VAOANT                      V1OANT
     I              VASALD                      V1SALD
     I              VASAE0                      V1SAE0
     I              VASAE1                      V1SAE1
     I              VASAE2                      V1SAE2
     I              VASAE3                      V1SAE3
     I              VAVARE                      V1VARE
     I              VAVERD                      V1VERD
     I              VADATO                      V1DATO
     I              VADTV                       V1DTV
     I              VALLOK                      V1LLOK
     I              VALLT                       V1LLT
     I              VASENR                      V1SENR
     I              VAVKTS                      V1VKTS
     I              VAKUBS                      V1KUBS
     I              VAAVD                       V1AVD
     I              VAOPD                       V1OPD
     I              VAFBNR                      V1FBNR
     I              VABUSE                      V1BUSE
     I              VABDAT                      V1BDAT
     I              VABKL                       V1BKL
     I              VAULDT                      V1ULDT
     I              VAMRNR                      V1MRNR
     I              VALTDT                      V1LTDT
     I              VAVKT0                      V1VKT0
     I              VAKUB0                      V1KUB0
     I              VAVKF0                      V1VKF0
     I              VAKUF0                      V1KUF0
     I              VAVKT1                      V1VKT1
     I              VAKUB1                      V1KUB1
     I              VAVKF1                      V1VKF1
     I              VAKUF1                      V1KUF1
     I              VAAN01                      V1AN01
     I              VAVKT2                      V1VKT2
     I              VAKUB2                      V1KUB2
     I              VAVKF2                      V1VKF2
     I              VAKUF2                      V1KUF2
     I              VAAN02                      V1AN02
     I              VAAN12                      V1AN12
     I              VAVKT3                      V1VKT3
     I              VAKUB3                      V1KUB3
     I              VAVKF3                      V1VKF3
     I              VAKUF3                      V1KUF3
     I              VAAN03                      V1AN03
     I              VAAN23                      V1AN23
     I              VAMIN                       V1MIN
     IVADRR
     I              AKTKOD                      VVAKOD
     I              JOURNR                      VVJNR
     I              FIRMA                       VVFIRM
     I              KUNDNR                      VVKN
     I              VADRNR                      VVADNR
     I              VADRNA                      VVNA
     I              VADRN1                      VVAD1
     I              VADRN2                      VVAD2
     I              VADRN3                      VVAD3
     I              SONAVN                      VVSTXT
     I              DISTR                       VVDIST
     I              RUTENR                      VVRNR
     I              SEKVNR                      VVSNR
     I              VAREGN                      VVREGN
     I              VAKON1                      VVKT1
     I              VAKON2                      VVKT2
     I              VARG                        VVRG
     I              VASTAT                      VVSTAT
     I              VALAND                      VVLAND
     I              VAKURE                      VVKURE
     I              VATLF                       VVTLF
     I              VAFAX                       VVFAX
     I              VAMAIL                      VVMAIL
      *
     C                   EXSR      INIT
      *
      * parameterkall til programmet uten skjermbilde behandling
      *
     C     UPARM1        IFNE      *BLANKS
     c     UOPT          IFNE      'E'
     C     UOPT          ANDNE     'W'
     C     UOPT          ANDNE     'V'
     c                   OPEN      ll027d
     c                   end
     C                   MOVE      UKJED         WSKJED
     C                   MOVE      UPNR          WSPNR
     C     WSPNR         CHAIN     LLGRPK05                           98
     C                   MOVE      GKGRP         WSGRUP
     C                   MOVE      UMRNR         MRMRNR
     C                   MOVE      UOPT          WSNR
     C     UKOPI         IFEQ      'N'
N01  C     UKOPI         OREQ      ' '
     C                   MOVE      '0'           *IN46
     C     LAGJ7K        CHAIN(N)  LLMRFL01                           33
     C                   ELSE
     C                   MOVE      '1'           *IN46
     C     LAGJ7K        CHAIN     LLMRFL02                           33
     C                   END
     C                   MOVE      MRDTD         XMRDTD
     C                   MOVE      MRDTM         XMRDTM
     C                   MOVE      MRDTÅ         XMRDTÅ
     C                   EXSR      PRINT
     c     UOPT          IFNE      'E'
     C     UOPT          ANDNE     'W'
     C     UOPT          ANDNE     'V'
     c                   GOTO      SLUTT1
     c                   end
     C                   GOTO      SLUTT
     C                   END
      *
      * parameterkall slutt
      *
      *
     C                   open      ll027d
     C     BG            TAG
     C  N04
     CANN30              Z-ADD     7             LINNBR
     C  N04
     CANN30              Z-ADD     30            POSNBR
     C                   EXFMT     BILDE01
     C                   MOVEA     '00'          *IN(98)
     C                   MOVE      '0'           *IN30
     C   03              GOTO      SLUTT1
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      BG
     C                   END
      *
     C                   MOVE      'DIV0000'     MSGNR
      *
     C     WSPNR         CHAIN     LLGRPK05                           98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'JOV0825'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      BG
     C                   ELSE
     C                   MOVE      GKGRP         WSGRUP
     C                   END
      *
      *
     C     WSGRUP        IFGT      0
     C     CUN1KG        CHAIN     CUNDL01                            99
     C     *IN99         IFEQ      '1'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      BG
     C                   END
     C                   END
      *
     C     CUN1KP        CHAIN     CUNDL01                            98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      BG
     C                   END
      *
     C                   EXSR      HOVED
      *
     C     SLUTT1        TAG
     c                   close     ll027d
     C     SLUTT         TAG
     c     kallark       ifeq      'J'
     c                   call      'ARC002CLB'
     c                   parm                    artype
     c                   parm                    aruser
     c                   end
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
     C     ARKKEY        KLIST
     C                   KFLD                    ARTYPE
     C                   KFLD                    ARAVD
     C                   KFLD                    AROPD
     C                   KFLD                    ARUNDE
     C     HEADFK        KLIST
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
     C     HEDF2K        KLIST
     C                   KFLD                    WSAVD2
     C                   KFLD                    WSOPD2
     C     HEAF3K        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     CUN1KG        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSGRUP
     C     CUN1KP        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSPNR
     C     LMRFK         KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    XMRNR
     C     LMRFK1        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C     LMRFK3        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    W2MRNR
     C     LAGJ7K        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    MRMRNR
     C     LVAREK        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    VAANR
     C     KODSFK        KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    WSSG
     C                   MOVE      'SF'          KOSFUN
     C     KODAK         KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    WSAVD
     C                   MOVE      'A'           KOAUNI
     C     KODVK         KLIST
     C                   KFLD                    KOVUNI
     C                   KFLD                    WSAVD
     C                   MOVE      'V'           KOVUNI
     C     KODO2K        KLIST
     C                   KFLD                    KO2UNI
     C                   KFLD                    HEOT
     C                   MOVE      'O2Y'         KO2UNI
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    HEKNK
     C                   KFLD                    KFFMVA
     C     CUSAAK        KLIST
     C                   KFLD                    HEKNK
     C                   KFLD                    HEAVD
      *
     C     *ENTRY        PLIST
     C     LASER         PARM      LASER         LASER             1
     C     STRING        PARM      STRING        STRING            5
     C     COPY          PARM      COPY          COPY              2 0
     C     UPARM2        PARM                    UPARM1           64
      *
n02  c     UDSavda       ifeq      *blanks
n02  c                   z-add     1             UDSavd
n02  c                   end
     C                   move      *zeros        WSDT
     C                   move      *zeros        MRDT
     C                   move      *zeros        XMRDT
      *
     C     STRING        IFNE      *BLANKS
     C     STRING        CHAIN     KODTFM                             33
     C                   END
     C     LASER         IFEQ      'A'
     C                   SETON                                        77
     C                   END
     C                   Z-ADD     1024          UCMDL            15 5
     C                   Z-ADD     99999         W2MRNR
     C                   MOVE      'A'           WSMOD
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     c                   read      firmarc                                33
     c     *in(33)       ifeq      '0'
     c     'lm'          chain     arktxt                             33
     c                   end
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     HOVED         BEGSR
      *////////////////////////////////////////////////////////////
     C     WSPNR         CHAIN     LLKUNF                             33
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C  N05              MOVE      W2MRNR        XMRNR             5 0
     C                   MOVE      *BLANKS       W2MRNR
      *_____________
      * Fyll Subfile
      *"""""""""""""
S06  C* N46LMRFK         SETLL     LLMRFL01                                     ORIGI./PRØVE
S06  C*  46LMRFK         SETLL     LLMRFL02                                     KOPI
N06  C  N46LMRFK         SETGT     LLMRFL01                                     ORIGI./PRØVE
N06  C   46LMRFK         SETGT     LLMRFL02                                     KOPI
     C  N46LMRFK1        READPE(N) LLMRFL01                               94
     C   46LMRFK1        READPE    LLMRFL02                               94
      *
     C     START2        TAG
     C  N94              DO
     C                   DO        15
     C                   MOVE      MRDTD         XMRDTD
     C                   MOVE      MRDTM         XMRDTM
     C                   MOVE      MRDTÅ         XMRDTÅ
N08  C     LAGJ7K        CHAIN(N)  LLAGJL07                           33
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N46LMRFK1        READPE(N) LLMRFL01                               94
     C   46LMRFK1        READPE    LLMRFL02                               94
     C  N94              ENDDO
     C                   ENDDO
      *
     C                   MOVE      ZRECNO        XRECNO            5 0
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   MOVE      '0'           *IN30
     C                   MOVEA     '00'          *IN(98)
     C                   MOVE      'DIV0000'     MSGNR
      *** AVSLUTT
     C   03              GOTO      SLHOV
      *
     C   05              GOTO      START
      *
     C   07              DO
     C     *IN46         IFEQ      '0'
     C                   MOVE      '1'           *IN46
     C                   ELSE
     C                   MOVE      '0'           *IN46
     C                   END
     C     W2MRNR        IFEQ      0
     C                   Z-ADD     99999         W2MRNR
     C                   END
     C                   GOTO      START
     C                   END
     C   25              DO
     C                   MOVE      XRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFNE      ' '
     C     W2MRNR        ORNE      0
     C     W2NR          IFEQ      ' '
     C                   GOTO      START
     C                   ELSE
     C  N46LMRFK3        CHAIN(N)  LLMRFL01                           98
     C   46LMRFK3        CHAIN     LLMRFL02                           98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVE      'YBC0672'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN98
     C                   ELSE
     C                   EXSR      PRINT
     C     MSGNR         IFEQ      *BLANKS
     C                   MOVE      'YBC0673'     MSGNR
     C                   MOVE      *BLANKS       W2NR
     C                   MOVE      *ZEROS        W2MRNR
     C                   END
     C                   END
     C                   GOTO      START3
     C                   END
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HHENT
     C                   END
     C                   GOTO      START3
      *
     C     SLHOV         ENDSR
      *
     C***********************************************
     C     HHENT         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       MSGNR
     C                   MOVEA     '000'         *IN(90)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'                                          1<-B
     C                   READC     SUBFIL                                 98
     C     *IN98         IFEQ      '0'                                           2<-B
     C     WSNR          IFEQ      '6'
     C     WSNR          OREQ      '9'
     C     WSNR          OREQ      'E'
     C     WSNR          OREQ      'W'
     C     UOPT          OREQ      'V'
N09   *
N09  C                   EXSR      SRTSTDTA
N09  C                   IF        XSLUTT = 'J'
N09  C                   MOVE      '1'           *IN99
N09  C                   MOVE      ' '           WSNR
N09  C                   UPDATE    SUBFIL
N09  C                   GOTO      SLHENT
N09  C                   END
N09   *
     C     MRLNA         IFNE      XTXT
     C                   EXSR      PRINT
     c     WSNR          IFEQ      'E'
     C                   MOVE      *BLANKS       UCMD
     C                   MOVEL     OVREPOE       UCMD
     C                   CALL      'QCMDEXC'
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
     C                   END
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C     MSGNR         IFEQ      *BLANKS
     C     MSGNR         OREQ      'YBC0673'
     C  N12
     CANN47              MOVE      *BLANKS       MRLNA
     C  N12
     CANN47              MOVEL     XTXT          MRLNA
     C                   ELSE
     C                   GOTO      SLHENT
     C                   END
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
N08   *
N08  C   46              IF        WSNR = '2' AND WSNR <> '2'                     3<-B
N08  C     CUN1KP        CHAIN     CUNDL01                            98
N08  C                   CALL      'LL023R'
N08  C                   PARM      WSGRUP        URGRUP            8 0
N08  C                   PARM      WSPNR         URKJED            8 0
N08  C                   PARM                    KNAVN
N08  C                   PARM      MRMRNR        URMRNR            5 0
N08  C                   PARM      'E'           USPØR             1
N08  C                   MOVE      '1'           *IN99
N08  C                   MOVE      ' '           WSNR
N08  C                   UPDATE    SUBFIL
N08  C                   END                                                      3<-E
      *
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C     SLHENT        TAG
     C   98
     CANN99              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   END
     C                   MOVE      '0'           *IN99
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     PRINT         BEGSR
      *////////////////////////////////////////////////////////////
     C                   MOVE      'N'           X0LIN
     C                   MOVE      *BLANKS       MSGNR
     C                   MOVE      *ZEROS        TLWNT0
     C                   MOVE      *ZEROS        TLWNTL
     C                   MOVE      *ZEROS        TLWNT1
     C                   MOVE      *ZEROS        TLWNT2
     C                   MOVE      *ZEROS        TLWNT3
     C                   MOVE      *ZEROS        TLVKTS
     C                   MOVE      *ZEROS        TLKUBS
     C     WSNR          COMP      '9'                                    47      PRØVE!!!
     C  N47WSNR          COMP      'V'                                    47      PRØVE!!!
      *
      * spesial ved epost
      *
     C     WSNR          IFEQ      'E'
     C                   MOVE      '1'           *IN47
     C                   MOVE      '1'           *IN48
     c                   move      *blanks       kfmt1
     c                   move      *blanks       kfmt2
     C                   setoff                                       77
      * OVERRIDE MED JOB
     C                   MOVE      *BLANKS       UCMD
     C                   MOVEL     OVREPO        UCMD
     C                   CALL      'QCMDEXC'
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
     C                   END
      *
      *slutt spesial ved epost
      *
     C     *IN47         CABEQ     '1'           PRTPR1
     C                   IF        KFMSO = 'A'
     C     LAGJ7K        SETLL     LLAGJL11
     C     LAGJ7K        READE(N)  LLAGJL11                               33
     C                   ELSE
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE(N)  LLAGJL07                               33
     C                   END
      *
      * KJØRNG MED OPSJON 6 - INGEN POSTER - IKKE LAG OPD, MEN MERK
      *
     C     *IN33         IFEQ      '1'
     C     LAGJ7K        CHAIN     LLMRFL01                           33
     C  N46
     CANN33              MOVE      'P'           MRST
     C  N33              UPDATE    LLMRFR
     C                   MOVE      'J'           X0LIN
     C                   GOTO      PRTPR1
     C                   END
      *
     C                   IF        ((WSNR = '6') OR (W2NR = '6'))
      * TEST OM GODSNR ER OPPGITT
     C                   IF        MRGN = '*GN*'
     C                   MOVE      'YBC1917'     MSGNR
     C                   GOTO      SLPRT
     C                   END
      * TEST OM MOTTAKSDATO
     C                   TIME                    XTIME
     C                   MOVE      XDD           IDAGD
     C                   MOVE      XMM           IDAGM
     C                   MOVE      XÅÅ           IDAGÅ
     C                   MOVE      MRDT          WSDT
     C     STTST1        TAG
S01  C*                  IF        UKOPI = 'N'
N01  C                   IF        ((UKOPI = 'N') OR (UKOPI = ' '))
     C                   EXFMT     LEVDATO
     C                   END
     C                   MOVEA     '00'          *IN(89)
     C                   MOVE      '0'           *IN30
     C                   MOVE      *BLANKS       ZMSGNO
     C                   IF        *IN12 = *OFF
     C                   IF        WSDTÅ < 2000
     C                   Z-ADD     1             UFLAG2
     C                   ELSE
     C                   MOVE      WSDTD         UDD               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAG2            1 0
     C                   END
     C     UFLAG2        IFEQ      1
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPD0001'     ZMSGNO
     C                   GOTO      STTST1
     C                   END
     C     WSDT          CABGT     IDAG          STTST1
     C     LAGJ7K        CHAIN     LLMRFL01                           33
     C                   MOVE      WSDT          MRDT
     C  N33              UPDATE    LLMRFR
     C                   MOVE      MRDTD         XMRDTD
     C                   MOVE      MRDTM         XMRDTM
     C                   MOVE      MRDTÅ         XMRDTÅ
     C                   ELSE
     C                   GOTO      SLPRT
     C                   END
      * TEST OM LINJER ER KLARE
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE(N)  LLAGJL07                               33
     C                   DOW       *IN33 = *OFF
     C     LVAREK        CHAIN(N)  LLVARE01                           33
     C                   IF        LVBATC = 'J'
     C                   IF        VASENR = *BLANKS
     C                   MOVE      'YBC1915'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   END
     C                   IF        LVDTU  = 'J'
     C                   IF        VAULDT = 0
     C                   MOVE      'YBC1915'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   END
     C                   IF        LVDTP  = 'J'
     C                   IF        VAPRDT = 0
     C                   MOVE      'YBC1915'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   END
     C                   IF        LVSN   = 'I'
     C                   MOVE      *ZEROS        XANTSN            7 0
     C     VAMN          SETLL     LLSERL03
     C     VAMN          READE(N)  LLSERL03                               33
     C                   DOW       *IN33 = *OFF
     C                   IF        SNST = ' '
     C                   MOVE      'YBC1922'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   ADD       1             XANTSN
     C     VAMN          READE(N)  LLSERL03                               33
     C                   ENDDO
     C                   IF        XANTSN <> VASALD
     C                   MOVE      'YBC1918'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   END
     C     LAGJ7K        READE(N)  LLAGJL07                               33
     C                   ENDDO
     C                   END
      *
      *
     C                   IF        ((WSNR = '6') OR (W2NR = '6'))
     C     XXGN          COMP      ' '                                    33
     C     *IN33         IFEQ      '0'
      * TOLLAGER --> TEST FAKTURANR ER OPPGITT
     C     XTFNR         TAG
     C     VAMN          SETLL     LLLISF
     C     VAMN          READE     LLLISF                                 33
     C     *IN33         DOWEQ     '0'
     C     LIKD          IFEQ      'FAK'
     C     LITXT         ANDNE     *BLANKS
     C                   LEAVE
     C                   END
     C     VAMN          READE     LLLISF                                 33
     C  N33              ENDDO
     C     *IN33         IFEQ      '1'
     C                   MOVE      'YBC1848'     MSGNR
     C                   GOTO      SLPRT
     C                   END
     C                   IF        KFMSO = 'A'
     C     LAGJ7K        READE(N)  LLAGJL11                               33
     C                   ELSE
     C     LAGJ7K        READE(N)  LLAGJL07                               33
     C                   END
     C  N33              GOTO      XTFNR
     C                   END
     C                   IF        KFMSO = 'A'
     C     LAGJ7K        SETLL     LLAGJL11
     C     LAGJ7K        READE(N)  LLAGJL11                               33
     C                   ELSE
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE(N)  LLAGJL07                               33
     C                   END
     C                   END
     C                   MOVE      VAAVD         XXAVD             4 0
     C                   MOVE      VAOPD         XXOPD             7 0
      *
      * HENT AVDELING OG SIGNATUR
      *
     C     XXAVD         IFEQ      0
     C     XXOPD         ANDEQ     0
     C                   MOVE      *ZEROS        WSAVD2
     C                   MOVE      *ZEROS        WSOPD2
      *
     C     VAKJED        CHAIN     LLKUNF                             33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KFMAVD        WSAVD
     C                   MOVE      KFMUR         WSMOD
     C                   ELSE
     C                   MOVE      UDSAVD        WSAVD
     C                   MOVE      *ZEROS        KFFMVA
     C                   MOVE      *BLANKS       KFMOT
     C                   MOVE      *BLANKS       KFMFR
     C                   MOVE      'N'           KFMVB
     C                   MOVE      'N'           KFMAFF
     C                   MOVE      'N'           KFMFAK
     C                   MOVE      'N'           KFMFKØ
     C                   END
     C                   MOVE      UDSSG         WSSG
     C                   MOVE      MRPTDF        WSPTDF
     C                   MOVE      MRPTDT        WSPTDT
     C                   MOVE      MRPSG         WSPSG
      *
     C     STOPD         TAG
     C                   IF        ((WSNR <> 'W') AND (WSNR <> 'V'))
     C                   EXFMT     OVROPPD
     C                   MOVEA     '0000000'     *IN(84)
     C                   MOVE      '0'           *IN30
     C   12              MOVE      *BLANKS       ZMSGNO
     C   12              GOTO      SLPRT
     C                   END
     C     WSAVD2        IFEQ      0
     C     WSAVD         COMP      0                                      90
     C  N90WSAVD         CHAIN     TELL                               90
     C     *IN90         IFEQ      '1'
     C                   MOVE      'SPA0001'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
      *
     C                   IF        ((WSNR <> 'W') AND (WSNR <> 'V'))
     C     KODSFK        CHAIN     KODTSF                             89
     C     *IN89         IFEQ      '1'
     C                   MOVE      'SPS0001'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
     C                   END
     C                   ELSE
     C     HEDF2K        CHAIN     HEADF                              88
     C     *IN88         IFEQ      '1'
     C     HEUR          ORNE      'A'
     C     HEUR          ANDNE     'B'
     C     HEUR          ANDNE     'H'
     C                   MOVE      'SPO0001'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   ELSE
     C     HEDF2K        SETLL     LLAGJL10
     C     HEDF2K        READE     LLAGJL10                               33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'YBC1704'     ZMSGNO
     C                   MOVE      '1'           *IN88
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
     C                   END
     C                   END
      *
     C                   END
      *
     C  N46KFMMRS        IFEQ      'J'
     C     WSNR          ANDNE     'W'
     C     WSNR          ANDNE     'V'
     C     WSPTDF        COMP      0                                    8686
     C  N86              MOVEL     WSPTDF        XNR02             2 0
     C  N86XNR02         COMP      24                                 86  86
     C  N86              MOVE      WSPTDF        XNR02
     C  N86XNR02         COMP      60                                 86  86
     C     *IN86         IFEQ      '1'
     C                   MOVE      'YBC1881'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
      *
     C     WSPTDT        COMP      0                                    8585
     C  N85              MOVEL     WSPTDT        XNR02             2 0
     C  N85XNR02         COMP      24                                 85  85
     C  N85              MOVE      WSPTDT        XNR02
     C  N85XNR02         COMP      60                                 85  85
     C     *IN86         IFEQ      '1'
     C                   MOVE      'YBC1882'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
      *
     C     WSPSG         IFEQ      *BLANKS
     C                   MOVE      '1'           *IN84
     C                   MOVE      'YBC1868'     ZMSGNO
     C                   MOVE      '1'           *IN30
     C                   GOTO      STOPD
     C                   END
     C                   END
      *
     C                   IF        *IN46 = *OFF
     C     LAGJ7K        CHAIN     LLMRFL01                           33
     C                   MOVE      WSPTDF        MRPTDF
     C                   MOVE      WSPTDT        MRPTDT
     C                   MOVE      WSPSG         MRPSG
     C                   UPDATE    LLMRFR
     C                   END
      *
     C     PRTPR1        TAG
     C                   IF        KFMSO = 'A'
     C     LAGJ7K        SETLL     LLAGJL11
     C     LAGJ7K        READE     LLAGJL11                               33
     C                   ELSE
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE     LLAGJL07                               33
     C                   END
     C                   IF        *IN33
     C                   MOVE      'J'           X0LIN             1
     C                   ELSE
     C                   MOVE      'N'           X0LIN
     C                   END
      *
     C                   OPEN      LL027P
     C                   MOVE      '1'           *IN01
     C                   TIME                    XTIME
     C                   MOVE      'YBC0673'     MSGNR
     C                   MOVE      *BLANKS       XANR
      *
      * HENT OPPDRAGSNR     (MEN IKKE VED PRØVE...)
     C     *IN47         CABEQ     '1'           PRTPR2
     C     X0LIN         CABEQ     'J'           PRTPR2
     C     XXAVD         IFEQ      0
     C     XXOPD         ANDEQ     0
     C     WSAVD2        ANDEQ     0
     C     WSAVD         CHAIN     TELL                               33
     C                   MOVE      TEOPDN        HEOPD
     C                   ADD       1             TEOPDN
     C                   UPDATE    TELLR
      *
     C                   MOVE      WSAVD         HEAVD
     C                   MOVE      WSSG          HESG
     C                   MOVE      WSMOD         HEUR
     C                   MOVE      MRDT          HEDTOP
     C                   MOVE      XDD           IDAGD
     C                   MOVE      XMM           IDAGM
     C                   MOVE      XÅÅ           IDAGÅ
     C                   MOVE      IDAG          HEDTR
     C                   MOVEL     MRLREF        HERFA
     C                   MOVE      'X'           HEKDFS
     C                   MOVE      MRLNA         HENAS
     C                   MOVE      MRLAD1        HEADS1
     C                   MOVE      MRLAD2        HEADS2
     C                   MOVEL     MRLPN         HEADS3
     C                   MOVE      MRLAD3        HEADS3
     C                   MOVE      WSPNR         HEKNK
     C     CUN1KP        CHAIN     CUNDL01                            33
     C     FMOT          IFEQ      0
     C                   MOVE      WSPNR         HEKNKF
     C                   ELSE
     C                   MOVE      FMOT          HEKNKF
     C                   END
     C     VALKOD        IFEQ      *BLANKS
     C                   MOVE      FICURR        HEVALK
     C                   ELSE
     C                   MOVE      VALKOD        HEVALK
     C                   END
     C     VADRK         CHAIN     VADR                               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      KNAVN         HENAK
     C                   MOVE      ADR1          HEADK1
     C                   MOVE      ADR2          HEADK2
     C                   MOVE      *BLANKS       HEADK3
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          HEADK3
     C                   ELSE
     C                   MOVE      ENGAD3        HEADK3
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        HEADK3
     C                   MOVE      ADR3          HEADK3
     C                   END
     C                   ELSE
     C                   MOVE      VVNA          HENAK
     C                   MOVE      VVAD1         HEADK1
     C                   MOVE      VVAD2         HEADK2
     C                   MOVE      VVAD3         HEADK3
     C                   END
     C     KFMOT         IFNE      *BLANKS
     C                   MOVE      KFMOT         HEOT
     C                   END
     C     KFMFR         IFNE      *BLANKS
     C                   MOVE      KFMFR         HEFR
     C                   END
     C     KODAK         CHAIN     KODTA                              33
     C                   MOVE      'NO'          HELKA
     C                   MOVE      'NO'          HELKS
     C                   MOVE      'NO'          HELKK
     C                   MOVEL     HEADS3        HESDF
     C                   MOVEL     HEADK3        HESDT
     C     KOAPOS        IFEQ      'J'
     C     HEUR          IFEQ      'A'
     C     HEUR          OREQ      'B'
     C                   MOVEL     HEADS3        HESDFF
     C                   MOVEL     HEADK3        HESDVT
     C                   MOVE      *BLANKS       HESDF
     C                   MOVE      *BLANKS       HESDT
     C                   END
     C                   END
     C     HEVS1         IFEQ      *BLANKS
     C                   MOVEL     'STK I.H.'    HEVS1
     C                   CAT       'T. M.R':0    HEVS1
     C                   CAT       'AP.NR':0     HEVS1
     C                   MOVE      MRMRNR        XAN05             5
     C                   CAT       XAN05:1       HEVS1
     C                   END
     C                   MOVE      'N'           HEPK1
     C                   MOVE      'N'           HEPK2
     C                   MOVE      'N'           HEPK3
     C                   MOVE      'N'           HEPK4
     C                   MOVE      'N'           HEPK5
     C                   MOVE      'N'           HEPK6
     C                   MOVE      'N'           HEPK7
     C                   MOVE      'N'           HEPK8
     C                   MOVEL     MRFT1         HEGM1
     C                   MOVEL     MRFT2         HEGM2
     C                   ELSE
     C     WSAVD2        IFEQ      0
     C     HEADFK        CHAIN     HEADF                              33
     C                   ELSE
     C     HEDF2K        CHAIN     HEADF                              33
     C                   END
     C                   END
N04   *
N04   * TØM ARBEIDFIL
N04  C                   IF        KFPRES = 'J'
N04  C                   CALL      'LL080C'
N04  C                   END
      *
     C     *IN33         DOWEQ     '0'
      * OPPDATER OPPDRAGSNR PÅ INNLEGGING  (MEN IKKE VED PRØVE)
     C     *IN47         CABEQ     '1'           PRTPR2
     C     XXAVD         IFEQ      0
     C     XXOPD         ANDEQ     0
     C                   MOVE      HEAVD         VAAVD
     C                   MOVE      HEOPD         VAOPD
     C     VADATO        IFEQ      99999999
     C     LVAREK        CHAIN     LLVARE01                           33
     C                   ADD       VASALD        LVSALD
     C                   EXCEPT    NYSALD
     C                   MOVE      MRDT          VADATO
N04  C                   IF        KFPRES = 'J'
N04  C                   CALL      'LL080R'
N04  C                   PARM                    VAGRUP
N04  C                   PARM                    VAKJED
N04  C                   PARM                    VAMN
N04  C                   END
     C                   END
     C                   IF        KFMSO = 'A'
     C                   EXCEPT    NYOPD11
     C                   ELSE
     C                   EXCEPT    NYOPD
     C                   END
      * arkivering ved ny
     C     arkjn         ifeq      'J'
     C     WSNR          ANDNE     'W'
     C     WSNR          ANDNE     'V'
N05  C     arkjn         OREQ      'J'
N05  C     UOPT          ANDEQ     'W'
     C                   exsr      arkivsr
     c                   end
      *
     C                   ELSE
     C                   IF        KFMSO = 'A'
     C                   EXCEPT    GMOPD11
     C                   ELSE
     C                   EXCEPT    GMOPD
     C                   END
     C                   END
     C*
     C     PRTPR2        TAG
     C                   IF        X0LIN = 'J'
     C                   GOTO      PRTPR3
     C                   END
     C     VAANR         COMP      XANR                                   41
     C                   ADD       VAOANT        TLWNT0
     C                   ADD       VASAE0        TLWNTL
     C                   ADD       VASAE1        TLWNT1
     C                   ADD       VASAE2        TLWNT2
     C                   ADD       VASAE3        TLWNT3
     C                   ADD       VAVKTS        TLVKTS
     C                   ADD       VAKUBS        TLKUBS
     C   01              WRITE     LL027P1
     C   01              MOVE      '0'           *IN01
     C* N41      LVAREK    CHAINLLVARE01             34
     C  N41LVAREK        CHAIN(N)  LLVARE01                           34
     C     VASENR        COMP      *BLANKS                            4242
     C                   WRITE     LL027P2
N07   *
N07  C                   IF        LVSN <> ' '
N07  C     VAMN          SETLL     LLSERL03
N07  C     VAMN          READE(N)  LLSERL03                               33
N07  C                   DOW       *IN33 = *OFF
N07  C                   WRITE     LL027P5
N07  C     VAMN          READE(N)  LLSERL03                               33
N07  C                   ENDDO
N07  C                   END
N07   *
     C     VAULDT        COMP      0                                  4343
     C  N41
     CAN 42
     COR 43              WRITE     LL027P4
     C                   MOVE      VAANR         XANR             15
      *
     C                   IF        KFMSO = 'A'
     C     LAGJ7K        READE     LLAGJL11                               33
     C                   ELSE
     C     LAGJ7K        READE     LLAGJL07                               33
     C                   END
     C  N33              ENDDO
      *
     C     PRTPR3        TAG
     C   01              WRITE     LL027P1
     C   01              MOVE      '0'           *IN01
     C                   WRITE     LL027P3
     C                   CLOSE     LL027P
     C     WSNR          IFEQ      'E'
     C     UPARM1        andeq     *blanks
     C     WSNR          OREQ      'W'
     C     UPARM1        andeq     *blanks
     C     WSNR          OREQ      'V'
     C     UPARM1        andeq     *blanks
     C                   MOVEL     'LL027P'      PRTFIL           10
     C                   CALL      'SYGE31CL'
     C                   PARM                    PRTFIL
     C                   END
      *
      * OPPDATER STATUS PÅ MOTTAKS-RAP./LAG OPPDRAG (MEN IKKE V/PRØVE)
      *
     C     *IN47         CABEQ     '1'           SLPRT
     C     X0LIN         CABEQ     'J'           SLPRT
     C     LAGJ7K        CHAIN     LLMRFL01                           33
     C  N46
     CANN33              MOVE      'P'           MRST
     C  N33              UPDATE    LLMRFR
      *
      * OPPDATER OPPDRAG
     C                   Z-ADD     TLWNT0        HENT
     C                   Z-ADD(H)  TLVKTS        HEVKT
     C                   Z-ADD(H)  TLKUBS        HEM3
     C     XXAVD         IFEQ      0
     C     XXOPD         ANDEQ     0
     C     WSAVD2        IFEQ      0
     C                   WRITE     HEADFR
     C                   ELSE
     C                   UPDATE    HEADFR
     C                   END
      * TIL OPPDRAG
     C     KFMAFF        IFNE      'J'
     C     WSNR          ANDNE     'W'
     C     WSNR          ANDNE     'V'
     C                   MOVE      HEAVD         UAVD2             4 0
     C                   MOVE      HEOPD         UOPD2             7 0
     C                   MOVE      'CHG'         UTYPE2            3
     C                   MOVE      ' '           UKODE             1
     C                   MOVE      ' '           UDUMMY            1
     C                   MOVE      *ZEROS        UAVDNY            4 0
     C                   SELECT
     C     HEUR          WHENEQ    'A'
     C                   CALL      'SYFA10'
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    HESG
     C                   PARM                    UTYPE2
     C                   PARM                    UKODE
     C                   PARM                    UDUMMY
     C                   PARM                    UAVDNY
     C     HEUR          WHENEQ    'B'
     C                   CALL      'SYEX10'
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    HESG
     C                   PARM                    UTYPE2
     C                   PARM                    UKODE
     C                   PARM                    UDUMMY
     C                   PARM                    UAVDNY
     C     HEUR          WHENEQ    'H'
     C                   MOVE      'A'           UUSPØR            1
     C                   MOVE      '2'           UURETU            1
     C                   MOVE      '0'           UUFUNK            1
     C                   CALL      'SYTR10'
     C                   PARM                    UAVD2
     C                   PARM                    UUAVDC            4 0
     C                   PARM                    UOPD2
     C                   PARM                    UUSPØR
     C                   PARM                    UURETU
     C                   PARM                    UUFUNK
     C                   ENDSL
     C                   END
      *________________
      * Autofakturering
      *""""""""""""""""
     C                   IF        ((WSNR <> 'W') AND (WSNR <> 'V'))
     C     KFMFAK        IFEQ      'J'
     C                   EXSR      AUTFAK
     C                   END
      *________________
      * Inn i samlefakt
      *""""""""""""""""
     C     KFMFKØ        IFEQ      'J'
     C                   EXSR      AUTSAM
     C                   END
     C                   END
     C                   ELSE
     C                   UPDATE    HEADFR
     C                   END
      *
     C     SLPRT         ENDSR
      *
      *////////////////////////////////////////////////////////////
      * AUTO FAKTURERING                                   AUTFAK /
      *////////////////////////////////////////////////////////////
     C     AUTFAK        BEGSR
      *
     C                   OPEN      KODTV
     C                   OPEN      KODTOT2
     C     KODVK         CHAIN     KODTV                              33
     C     KODO2K        CHAIN     KODTOT2                            33
     C                   MOVE      'J'           UNYGML            1
     C     SYUTLP        IFEQ      0
     C                   MOVE      FIUPS         XKUTL             4 2
     C                   MOVE      FIUPM         XKUMIN            2 0
     C                   ELSE
     C                   Z-ADD     SYUTLP        XKUTL
     C                   Z-ADD     SYMINU        XKUMIN
     C                   END
     C     XKUTL         IFEQ      99.99
     C                   MOVE      *ZEROS        XKUTL
     C                   END
     C                   MOVE      *ZEROS        XSUTL             4 2
     C                   MOVE      *ZEROS        XSUMIN            2 0
     C                   Z-ADD     3             UFLAGG            1 0
      *
     C                   CALL      'SYFI10X'
     C                   PARM                    UFIRM
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
     C                   PARM                    UNYGML
     C                   PARM                    KO2UTL
     C                   PARM                    XKUTL
     C                   PARM                    XSUTL
     C                   PARM                    XKUMIN
     C                   PARM                    XSUMIN
     C                   PARM                    KO2MVK
     C                   PARM                    KO2MVS
     C                   PARM                    UKFRA             7 0
     C                   PARM                    KOVAVR
     C                   PARM                    UMSG             62
     C                   PARM                    UMELD             1
     C                   PARM                    UFLAGG
     C                   PARM                    USK               1
     C                   PARM                    USECUR            6
      *
     C                   MOVE      HEAVD         UAVD3             4
     C                   MOVE      HEOPD         UOPD3             7
     C                   Z-ADD     9             UFLAGG            1 0
     C                   CALL      'LL052C'
     C                   PARM                    UAVD3
     C                   PARM                    UOPD3
     C                   PARM                    UFLAGG
     C                   CLOSE     KODTV
     C                   CLOSE     KODTOT2
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * AUTO INN SAMLEFAKTURAKØ                            AUTSAM /
      *////////////////////////////////////////////////////////////
     C     AUTSAM        BEGSR
     C                   OPEN      FAK4
     C                   OPEN      FERDF
     C                   OPEN      CUSAAV
     C     HEAF3K        SETLL     FAK4
     C     HEAF3K        READE     FAK4                                   33
     C     *IN33         IFEQ      '0'
     C                   MOVE      HEAVD         FEAVD
     C                   MOVE      HEOPD         FEOPD
     C                   MOVE      ZUSER         FEWS
     C                   MOVE      FAKUNR        FEKN
     C                   MOVE      FASK          FESKX
     C     CUSAAK        CHAIN     CUSAAV                             33        *AVVIK SF.KO
     C  N33              MOVE      CASFAK        FESFAK                         PÅ AVDNIVÅ?
     C   33              MOVE      'J'           FESFAK
     C                   WRITE     FERDR
     C                   END
     C                   CLOSE     FAK4
     C                   CLOSE     FERDF
     C                   CLOSE     CUSAAV
      * SEND TIL SAMLEFAKTURAKØ
     C                   CALL      'LL017C'
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      'SØKGRP  '    UTYPE             8
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      WSGRUP        UTYPE
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
      **********************************************************************
     C     arkivsr       begsr
      **********************************************************************
      *
     C                   MOVE      FIFIRM        ARFIRM
     C                   MOVE      vaavd         ARAVD
     C                   MOVE      vaopd         AROPD
     C                   MOVEL     vamrnr        ARUNDE
     C                   MOVE      'lm'          ARTYPE
     C                   MOVE      ZUSER         ARUSER
     C                   MOVE      idag          ARDATE
     C                   MOVE      XTT           ARTIME
     C                   MOVE      vakjed        ARKUND
     C     arkkey        chain     arkivl03                           34
     C   34              WRITE     ARKIVR
     C   34              move      'J'           kallark           1
     C                   ENDSR
      *
N09   ***********************************************
N09  C     SRTSTDTA      BEGSR
N09   ***********************************************
N09  C     *LIKE         DEFINE    VAMN          X_VAMN
N09  C                   MOVE      'N'           XSLUTT            1
N09  C     LAGJ7K        SETLL     LLAGJL07
N09  C     LAGJ7K        READE(N)  LLAGJL07                               33
N09  C                   DOW       *IN33 = *OFF
N09  C     LVAREK        CHAIN(N)  LLVARE01                           33
N09  C                   MOVE      *ZEROS        X_VAMN
N09  C                   IF        LVSN = 'I'
N09  C     STTSTDTA1     TAG
N09  C                   Z-ADD     0             XANTSER           3 0
N09  C     VAMN          SETLL     LLSERL03
N09  C     VAMN          READE(N)  LLSERL03                               33
N09  C                   DOW       *IN33 = *OFF
N09  C                   ADD       1             XANTSER
N09  C     VAMN          READE(N)  LLSERL03                               33
N09  C                   ENDDO
N09  C                   IF        XANTSER < VAOANT
N09  C                   IF        VAMN = X_VAMN
N09  C                   MOVE      'J'           XSLUTT
N09  C                   GOTO      SLTSTDTA
N09  C                   END
N09  C                   CALL      'LL018R'
N09  C                   PARM                    VAGRUP
N09  C                   PARM                    VAKJED
N09  C                   PARM                    VAANR
N09  C                   PARM                    VALLOK
N09  C                   PARM                    VAMN
N09  C                   PARM                    VAOANT
N09  C                   MOVE      VAMN          X_VAMN
N09  C                   GOTO      STTSTDTA1
N09  C                   END
N09  C                   END
N09  C     LAGJ7K        READE(N)  LLAGJL07                               33
N09  C                   ENDDO
N09   *
N09  C     SLTSTDTA      TAG
N09  C                   ENDSR
N09   *
     OLLAGJR    E            NYOPD
     O                       VAAVD
     O                       VAOPD
     O                       VADATO
     OLLAGJR    E            GMOPD
     OLLAGJR11  E            NYOPD11
     O                       VAAVD
     O                       VAOPD
     O                       VADATO
     OLLAGJR11  E            GMOPD11
     OLLVARER   E            NYSALD
     O                       LVSALD
