      ***********************************************************
      *** PROGRAM SKAL DEAKTIVERE ARTIKKEL SOM IKKE ER I BRUK ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26                            ***
      *** LEDIGE INDIKATORER 27-32 35-99                      ***
      ***********************************************************
      *
     FLLLINE02  IF   E           K DISK
     FLLHEAD    IF   E           K DISK
     FLLVARE01  UF   E           K DISK
      *
     C                   EXSR      INIT
      *
     C     LLVARE01K     SETLL     LLVARE01
     C     LLVARE01K     READE     LLVARE01                               33
     C                   DOW       *IN33 = *OFF
      *
     C                   IF        LVSALD = 0
     C     LVANR         SETLL     LLLINE02
     C     LVANR         READE     LLLINE02                               34
     C                   DOW       *IN34 = *OFF
     C     LLMN          CHAIN     LLHEAD                             34
     C  N34LHGRP         IFEQ      LVGRUP
     C     LHPNR         ANDEQ     LVPNR
     C     LHTDT         ANDGE     XDT
     C                   GOTO      NESTE
     C                   END
     C     LVANR         READE     LLLINE02                               34
     C                   ENDDO
     C                   MOVE      'I'           LVAKT
     C                   ELSE
     C                   MOVE      'A'           LVAKT
     C                   END
      *
     C     NESTE         TAG
     C                   UPDATE    LLVARER
     C     LLVARE01K     READE     LLVARE01                               33
     C                   ENDDO
      *
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     LLVARE01K     KLIST
     C                   KFLD                    UGRP
     C                   KFLD                    UPNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    UGRP              8 0
     C                   PARM                    UPNR              8 0
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
     C                   MOVE      WDT           XDT               8 0
     C                   SUB       10000         XDT
      *
     C                   ENDSR
      *
