      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE/SPØRRE FRITEKST TIL PLL   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                ***
      *** LEDIGE INDIKATORER 28-32 34-99                      ***
      *** IND. 27 PÅ = SPØRRING   27 AV = VEDLIKEHOLD         ***
      ***********************************************************
      *
     FLLHETXT   UF A E           K DISK
     FLL035D    CF   E             WORKSTN
     D                 DS
     D  WSTX01                 1     70
     D  WSTX02                71    140
     D  WSTX03               141    210
     D  WSTX04               211    280
     D  WSTX05               281    350
     D  WSTX06               351    420
     D  WSTX07               421    490
     D  WSTX08               491    560
     D  WSTX09               561    630
     D  WSTX10               631    700
     D  WT                     1    700
     D                                     DIM(10) ASCEND
      *
     C                   EXSR      INIT
      *
     C                   MOVE      *BLANKS       WT
     C                   MOVE      *ZEROS        XN                3 0
     C     UMN           SETLL     LLHETXT
     C     UMN           READE(N)  LLHETXT                                33
     C     *IN33         DOWEQ     *OFF
     C                   ADD       1             XN
     C                   MOVE      LTTXT         WT(XN)
     C     UMN           READE(N)  LLHETXT                                33
     C  N33              ENDDO
      *
     C                   EXFMT     BILDE01
     C  N27*IN03         IFEQ      *OFF
     C     *IN12         ANDEQ     *OFF
     C     1             DO        10            XN
     C     LHTXTK        CHAIN     LLHETXT                            33
     C     WT(XN)        IFEQ      *BLANKS
     C  N33              DELETE    LLHTXTR
     C                   ELSE
     C                   MOVE      WT(XN)        LTTXT
     C     *IN33         IFEQ      *OFF
     C                   UPDATE    LLHTXTR
     C                   ELSE
     C                   MOVE      UMN           LTMN
     C                   MOVE      XN            LTVN
     C                   WRITE     LLHTXTR
     C                   END
     C                   END
     C                   ENDDO
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     LHTXTK        KLIST
     C                   KFLD                    UMN
     C                   KFLD                    XN
      *
     C     *ENTRY        PLIST
     C                   PARM                    UMN
     C                   PARM                    UOPTXT            1
      *
     C     UOPTXT        COMP      'J'                                2727
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
