     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FLLMRFL06  IF   E           K DISK
     FLLAGJL07  IF   E           K DISK
     FLLGRPK05  IF   E           K DISK
     FLL034D    CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     FLL034P    O    E             PRINTER OFLIND(*IN01)
     F                                     USROPN
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      4  0
     D  XDD                    7      8  0
     D  XMM                    9     10  0
     D  XÅÅ                   11     14  0
     D                 DS
     D  IDAG                   1      8  0
     D  IDAGÅ                  1      4  0
     D  IDAGM                  5      6  0
     D  IDAGD                  7      8  0
     D                 DS
     D  XMRDT                  1      8  0
     D  XMRDTD                 1      2  0
     D  XMRDTM                 3      4  0
     D  XMRDTÅ                 5      8  0
     D                 DS
     D  WSDTF8                 1      8  0
     D  WSDTF                  3      8  0
     D  WSDTFÅ                 3      4  0
     D  WSDTFM                 5      6  0
     D  WSDTFD                 7      8  0
     D                 DS
     D  WSDTT8                 1      8  0
     D  WSDTT                  3      8  0
     D  WSDTTÅ                 3      4  0
     D  WSDTTM                 5      6  0
     D  WSDTTD                 7      8  0
     D UCMD            DS          1024
     D                 DS
     D XCMD11          C                   CONST('OVRPRTF -
     D                                     FILE(LL034P) -
     D                                     OUTQ(')
     D XCMD21          C                   CONST('PAGESIZE(72 80) -
     D                                     CPI(10) -
     D                                     OVRFLW(64)')
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C  N04
     CANN30              Z-ADD     7             LINNBR
     C  N04
     CANN30              Z-ADD     30            POSNBR
     C                   EXFMT     BILDE01
     C                   MOVEA     '0000'        *IN(96)
     C                   MOVE      '0'           *IN30
     C   03              GOTO      SLUTT
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      'DIV0000'     MSGNR
      *
     C     WSPNR         CHAIN     LLGRPK05                           98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'JOV0825'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   ELSE
     C                   MOVE      GKGRP         WSGRUP
     C                   END
      *
     C     WSGRUP        IFGT      0
     C     CUN1KG        CHAIN     CUNDL01                            99
     C     *IN99         IFEQ      '1'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
     C                   END
      *
     C     CUN1KP        CHAIN     CUNDL01                            98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      WSDTFD        UDD               2 0
     C                   MOVE      WSDTFM        UMM               2 0
     C                   MOVE      WSDTFÅ        UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN97
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPD0001'     MSGNR
     C                   GOTO      START
     C                   END
      *
     C     WSDTT         IFEQ      0
     C                   MOVE      WSDTF         WSDTT
     C                   ELSE
     C                   MOVE      WSDTTD        UDD               2 0
     C                   MOVE      WSDTTM        UMM               2 0
     C                   MOVE      WSDTTÅ        UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN96
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPD0001'     MSGNR
     C                   GOTO      START
     C                   END
     C                   END
      *
     C     WSDTF         IFGT      501231
     C                   ADD       19000000      WSDTF8
     C                   ELSE
     C                   ADD       20000000      WSDTF8
     C                   END
     C     WSDTT         IFGT      501231
     C                   ADD       19000000      WSDTT8
     C                   ELSE
     C                   ADD       20000000      WSDTT8
     C                   END
      *
     C     WSPRT         IFEQ      *BLANKS
     C                   MOVE      '*JOB'        WSPRT
     C                   END
      *
     C                   EXSR      PRINT
      *
     C     SLUTT         TAG
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
     C     LMR6K         KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    WSDTF8
     C     LMR6K1        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C     CUN1KG        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSGRUP
     C     CUN1KP        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSPNR
     C     LAGJ7K        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSPNR
     C                   KFLD                    MRMRNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSPRT
      *
     C                   Z-ADD     1024          UCMDL            15 5
     C     WSPRT         IFEQ      *BLANKS
     C                   MOVE      '*JOB'        WSPRT
     C                   END
     C                   MOVE      *ZEROS        WSDTF8
     C                   MOVE      *ZEROS        WSDTT8
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     PRINT         BEGSR
      *////////////////////////////////////////////////////////////
     C                   MOVE      *BLANKS       UCMD
     C     XCMD11        CAT       WSPRT:0       UCMD
     C                   CAT       ')':0         UCMD
     C                   CAT       XCMD21:1      UCMD
     C                   CALL      'QCMDEXC'                            33
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
     C                   OPEN      LL034P
     C                   TIME                    XTIME
     C                   MOVE      XDD           IDAGD
     C                   MOVE      XMM           IDAGM
     C                   MOVE      XÅÅ           IDAGÅ
      *
     C                   MOVE      '1'           *IN01
     C     LMR6K         SETLL     LLMRFL06
     C     LMR6K1        READE     LLMRFL06                               33
     C  N33MRDT          COMP      WSDTT8                             33
      *
     C     *IN33         DOWEQ     '0'
      *
     C                   MOVE      *ZEROS        XXOANT
     C                   MOVE      *ZEROS        XXVKT
     C                   MOVE      *ZEROS        XXKUB
      *
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE     LLAGJL07                               34
     C     *IN34         DOWEQ     '0'
     C                   ADD       VAOANT        XXOANT
     C                   ADD(H)    VAVKTS        XXVKT
     C                   ADD(H)    VAKUBS        XXKUB
     C     LAGJ7K        READE     LLAGJL07                               34
     C  N34              ENDDO
      *
     C     *IN01         IFEQ      '1'
     C                   MOVE      'J'           XLISTE            1
     C                   WRITE     LL034P1
     C                   MOVE      '0'           *IN01
     C                   END
      *
     C                   WRITE     LL034P2
     C                   ADD       1             TTAMOT
     C                   ADD       XXOANT        TTOANT
     C                   ADD       XXVKT         TTVKT
     C                   ADD       XXKUB         TTKUB
      *
     C     LMR6K1        READE     LLMRFL06                               33
     C  N33MRDT          COMP      WSDTT8                             33
     C  N33              ENDDO
      *
     C     XLISTE        IFEQ      'J'
     C                   WRITE     LL034P3
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      'SØKGRP  '    UTYPE             8
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      WSGRUP        UTYPE
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
