     FKODTFM    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTA     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FTRAN      IF   E           K DISK
     FLLHEAD11  IF   E           K DISK
     FLLHEAD12  IF   E           K DISK
     F                                     RENAME(LLHEADR:LLHEADRC)
     FLLHEAD13  IF   E           K DISK
     F                                     RENAME(LLHEADR:LLHEADRD)
     FLLHEAD21  IF   E           K DISK
     F                                     RENAME(LLHEADR:LLHEAR21)
     FLLHEAD22  IF   E           K DISK
     F                                     RENAME(LLHEADR:LLHEAR22)
     FLLHEAD23  IF   E           K DISK
     F                                     RENAME(LLHEADR:LLHEAR23)
     FLL064P    O    E             PRINTER OFLIND(*IN01)
     D                 DS
     D  XXDTF                  1      6  0
     D  XXDTFD                 1      2  0
     D  XXDTFM                 3      4  0
     D  XXDTFÅ                 5      6  0
     D                 DS
     D  YYDTF                  1      8  0
     D  YYDTFÅ                 1      4  0
     D  YYDTFM                 5      6  0
     D  YYDTFD                 7      8  0
     D                 DS
     D  XXDTT                  1      6  0
     D  XXDTTD                 1      2  0
     D  XXDTTM                 3      4  0
     D  XXDTTÅ                 5      6  0
     D                 DS
     D  YYDTT                  1      8  0
     D  YYDTTÅ                 1      4  0
     D  YYDTTM                 5      6  0
     D  YYDTTD                 7      8  0
     D                 DS
     D  LHTDT                  1      8  0
     D  LHTDTÅ                 1      4  0
     D  LHTDTM                 5      6  0
     D  LHTDTD                 7      8  0
     D                 DS
     D  XHTDT                  1      6  0
     D  XHTDTD                 1      2  0
     D  XHTDTM                 3      4  0
     D  XHTDTÅ                 5      6  0
     D                 DS
     D  LHODT                  1      8  0
     D  LHODTÅ                 1      4  0
     D  LHODTM                 5      6  0
     D  LHODTD                 7      8  0
     D                 DS
     D  XHODT                  1      6  0
     D  XHODTD                 1      2  0
     D  XHODTM                 3      4  0
     D  XHODTÅ                 5      6  0
     D                 DS
     D  XIDAG                  1      6  0
     D  XIDAGD                 1      2  0
     D  XIDAGM                 3      4  0
     D  XIDAGÅ                 5      6  0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      4  0
     D  XDD                    7      8  0
     D  XMM                    9     10  0
     D  XÅÅ                   11     14  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
      *
     C                   EXSR      INIT
      *
     C                   EXSR      PRINT
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
     C     *ENTRY        PLIST
     C                   PARM                    UGRUP             8
     C                   PARM                    UPNR              8
     C                   PARM                    UTN               8
     C                   PARM                    UDTF              8
     C                   PARM                    UDTT              8
     C     LASER         PARM      LASER         LASER             1
     C     STRING        PARM      STRING        STRING            5
     C     COPY          PARM      COPY          COPY              2 0
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     CUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    KOAKNR
     C     CUND2K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    VMTRKU
     C     CUND3K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    LHPNR
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    YYTN
     C     KODSFK        KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    USG
     C     KODAK         KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    UAVD
     C     LH11K         KLIST
     C                   KFLD                    YYGRUP
     C                   KFLD                    YYPNR
     C                   KFLD                    YYTN
     C                   KFLD                    YYDTF
     C     LH11K2        KLIST
     C                   KFLD                    YYGRUP
     C                   KFLD                    YYPNR
     C                   KFLD                    YYTN
     C     LH12K         KLIST
     C                   KFLD                    YYGRUP
     C                   KFLD                    YYPNR
     C                   KFLD                    YYTN
     C                   KFLD                    YYDTF
     C     LH13K         KLIST
     C                   KFLD                    YYGRUP
     C                   KFLD                    YYPNR
     C                   KFLD                    YYDTF
     C     LH21K         KLIST
     C                   KFLD                    YYTN
     C                   KFLD                    YYDTF
     C     LH21K2        KLIST
     C                   KFLD                    YYTN
     C     LH22K         KLIST
     C                   KFLD                    YYTN
     C                   KFLD                    YYDTF
     C     LH23K         KLIST
     C                   KFLD                    YYDTF
      *
      *
     C     STRING        IFNE      *BLANKS
     C     STRING        CHAIN     KODTFM                             33
     C                   END
     C     LASER         IFEQ      'A'
     C                   SETON                                        88
     C                   END
     C                   TIME                    XTIME
     C                   MOVE      XDD           XIDAGD
     C                   MOVE      XMM           XIDAGM
     C                   MOVE      XÅÅ           XIDAGÅ
     C                   MOVE      UGRUP         YYGRUP            8 0
     C                   MOVE      UPNR          YYPNR             8 0
     C                   MOVE      UTN           YYTN              8 0
     C                   MOVE      UDTF          YYDTF
     C                   MOVE      YYDTFD        XXDTFD
     C                   MOVE      YYDTFM        XXDTFM
     C                   MOVE      YYDTFÅ        XXDTFÅ
     C                   MOVE      UDTT          YYDTT
     C                   MOVE      YYDTTD        XXDTTD
     C                   MOVE      YYDTTM        XXDTTM
     C                   MOVE      YYDTTÅ        XXDTTÅ
     C                   MOVE      'SF'          KOSFUN
     C                   MOVE      'A'           KOAUNI
     C     YYDTF         COMP      YYDTT                              2727
     C     YYTN          COMP      99999999                               28
     C     KODSFK        CHAIN     KODTSF                             33
     C     KODAK         CHAIN     KODTA                              33
     C     CUND1K        CHAIN     CUNDL01                            33
     C                   MOVE      KNAVN         XXNV
     C                   MOVE      ADR1          XXADR1
     C                   MOVE      TLF           XXTLF
     C                   MOVE      TFAXNR        XXFAX
     C     TRANK         CHAIN     TRAN                               33
     C     CUND2K        CHAIN     CUNDL01                            33
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     PRINT         BEGSR
      *////////////////////////////////////////////////////////////
     C                   WRITE     LL064P1
     C     UPNR          IFEQ      '99999999'
     C     *IN27         IFEQ      '1'
     C     LH21K         SETLL     LLHEAD21
     C     LH21K2        READE     LLHEAD21                               33
     C  N33LHODT         COMP      YYDTT                              33
     C                   ELSE
     C     *IN28         IFEQ      '0'
     C     LH22K         SETLL     LLHEAD22
     C     LH22K         READE     LLHEAD22                               33
     C                   ELSE
     C     LH23K         SETLL     LLHEAD23
     C     LH23K         READE     LLHEAD23                               33
     C                   END
     C                   END
     C                   ELSE
     C     *IN27         IFEQ      '1'
     C     LH11K         SETLL     LLHEAD11
     C     LH11K2        READE     LLHEAD11                               33
     C  N33LHODT         COMP      YYDTT                              33
     C                   ELSE
     C     *IN28         IFEQ      '0'
     C     LH12K         SETLL     LLHEAD12
     C     LH12K         READE     LLHEAD12                               33
     C                   ELSE
     C     LH13K         SETLL     LLHEAD13
     C     LH13K         READE     LLHEAD13                               33
     C                   END
     C                   END
     C                   END
     C     *IN33         DOWEQ     '0'
     C                   MOVE      LHTDTD        XHTDTD
     C                   MOVE      LHTDTM        XHTDTM
     C                   MOVE      LHTDTÅ        XHTDTÅ
     C                   MOVE      LHODTD        XHODTD
     C                   MOVE      LHODTM        XHODTM
     C                   MOVE      LHODTÅ        XHODTÅ
     C   01              WRITE     LL064P1
     C   01              MOVE      '0'           *IN01
     C                   MOVE      *BLANKS       XHPNS
     C     LHBPN         IFEQ      0
     C                   MOVEL     LHBPU         XHPNS
     C                   ELSE
     C                   MOVEL     LHBPN         XHPNS
     C                   END
     C                   CAT       LHBA3:1       XHPNS
     C     CUND3K        CHAIN     CUNDL01                            33
     C                   WRITE     LL064P2
     C                   ADD       LHKLL         THKLL
     C                   ADD       LHWKUB        THWKUB
      *
     C     UPNR          IFEQ      '99999999'
     C     *IN27         IFEQ      '1'
     C     LH21K2        READE     LLHEAD21                               33
     C  N33LHODT         COMP      YYDTT                              33
     C                   ELSE
     C     *IN28         IFEQ      '0'
     C     LH22K         READE     LLHEAD22                               33
     C                   ELSE
     C     LH23K         READE     LLHEAD23                               33
     C                   END
     C                   END
     C                   ELSE
     C     *IN27         IFEQ      '1'
     C     LH11K2        READE     LLHEAD11                               33
     C  N33LHODT         COMP      YYDTT                              33
     C                   ELSE
     C     *IN28         IFEQ      '0'
     C     LH12K         READE     LLHEAD12                               33
     C                   ELSE
     C     LH13K         READE     LLHEAD13                               33
     C                   END
     C                   END
     C                   END
     C  N33              ENDDO
      *
     C                   WRITE     LL064P3
      *
     C                   ENDSR
      *
