     FCUNDL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FLL063D    CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSDTF                  1      6  0
     D  WSDTFD                 1      2  0
     D  WSDTFM                 3      4  0
     D  WSDTFÅ                 5      6  0
     D                 DS
     D  XXDTF                  1      8  0
     D  XXDTFÅ                 1      4  0
     D  XXDTFM                 5      6  0
     D  XXDTFD                 7      8  0
     D                 DS
     D  WSDTT                  1      6  0
     D  WSDTTD                 1      2  0
     D  WSDTTM                 3      4  0
     D  WSDTTÅ                 5      6  0
     D                 DS
     D  XXDTT                  1      8  0
     D  XXDTTÅ                 1      4  0
     D  XXDTTM                 5      6  0
     D  XXDTTD                 7      8  0
     D                UDS
     D  UFIRM                  1      2
      *
     C                   EXSR      INIT
      *
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   MOVEA     '000000'      *IN(94)
     C                   MOVE      '0'           *IN30
     C   03              MOVE      'N'           UOK
     C   03              GOTO      SLUTT
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *
     C                   EXSR      TESTB
     C     *IN30         CABEQ     '1'           START
      *
     C                   MOVE      WSGRUP        UGRUP
     C                   MOVE      WSPNR         UPNR
     C                   MOVE      WSTN          UTN
     C                   MOVE      XXDTF         UDTF
     C                   MOVE      XXDTT         UDTT
      *
     C     SLUTT         TAG
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *////////////////////////////////////////////////////////////
     C     TESTB         BEGSR
      *////////////////////////////////////////////////////////////
     C                   MOVE      'DIV0000'     MSGNR
      *
     C     WSGRUP        IFGT      0
     C     CUN1KG        CHAIN     CUNDL01                            99
     C     *IN99         IFEQ      '1'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END
     C                   END
      *
     C     WSPNR         IFNE      99999999
     C     CUN1KP        CHAIN     CUNDL01                            98
     C     *IN98         IFEQ      '1'
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPK0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END
     C                   END
      *
     C     WSTN          IFNE      99999999
     C     TRANK         CHAIN     TRAN                               97
     C     *IN97         IFEQ      '1'
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      'SPT0105'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END
     C                   END
      *
     C                   MOVE      WSDTFD        UDD               2 0
     C                   MOVE      WSDTFM        UMM               2 0
     C                   MOVE      WSDTFÅ        UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      96
     C  N30*IN96         IFEQ      '1'
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPD0001'     MSGNR
     C                   GOTO      SLTB
     C                   END
      *
     C     WSDTT         IFEQ      0
     C     WSTN          OREQ      99999999
     C                   MOVE      WSDTF         WSDTT
     C                   ELSE
     C                   MOVE      WSDTTD        UDD               2 0
     C                   MOVE      WSDTTM        UMM               2 0
     C                   MOVE      WSDTTÅ        UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      95
     C  N30*IN95         IFEQ      '1'
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPD0001'     MSGNR
     C                   GOTO      SLTB
     C                   END
     C                   END
      *
     C                   MOVE      WSDTFD        XXDTFD
     C                   MOVE      WSDTFM        XXDTFM
     C     WSDTFÅ        IFGT      50
     C     WSDTFÅ        ADD       1900          XXDTFÅ
     C                   ELSE
     C     WSDTFÅ        ADD       2000          XXDTFÅ
     C                   END
     C                   MOVE      WSDTTD        XXDTTD
     C                   MOVE      WSDTTM        XXDTTM
     C     WSDTTÅ        IFGT      50
     C     WSDTTÅ        ADD       1900          XXDTTÅ
     C                   ELSE
     C     WSDTTÅ        ADD       2000          XXDTTÅ
     C                   END
     C     XXDTF         IFGT      XXDTT
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVEA     '11'          *IN(95)
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPD0007'     MSGNR
     C                   GOTO      SLTB
     C                   END
      *
     C     SLTB          ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      'SØKGRP  '    UTYPE             8
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      WSGRUP        UTYPE
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSPNR
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     37
     C                   MOVE      *ZEROS        UTN2              8 0
     C                   CALL      'SYTR04A'
     C                   PARM                    UTN2
     C     UTN2          IFNE      0
     C                   MOVE      UTN2          WSTN
     C                   END
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
     C     *ENTRY        PLIST
     C                   PARM                    UOK               1
     C                   PARM                    UGRUP             8
     C                   PARM                    UPNR              8
     C                   PARM                    UTN               8
     C                   PARM                    UDTF              8
     C                   PARM                    UDTT              8
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     CUN1KG        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSGRUP
     C     CUN1KP        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSPNR
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSTN
      *
     C                   MOVE      'J'           UOK
     C                   MOVE      UYEAR         WSDTFÅ
     C                   MOVE      UMONTH        WSDTFM
     C                   MOVE      UDAY          WSDTFD
     C                   MOVE      *ZEROS        WSDTT
      *
     C                   ENDSR
      *
