     FISTAL76   IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UFIRMA            2
     C                   PARM                    UAAR              4
     C                   PARM                    UJNR              5
     C                   PARM                    UEKSNR            7
     C                   PARM                    UFLAGG            1
      *
     C     IST76K        KLIST
     C                   KFLD                    UFIRMA
     C                   KFLD                    XAAR
     C                   KFLD                    XJNR
      *
     C                   MOVE      UAAR          XAAR              4 0
     C                   MOVE      UJNR          XJNR              5 0
     C                   MOVE      UEKSNR        XTRNNR            7 0
      *
     C     IST76K        CHAIN     ISTAL76                            33
     C     *IN33         DOWEQ     '0'
     C     AKTKOD        IFEQ      'A'
     C                   LEAVE
     C                   END
     C     IST76K        READE     ISTAL76                                33
     C  N33              ENDDO
     C  N33TTYPE         COMP      'J'                                3333
     C  N33XTRNNR        IFNE      0
     C     XTRNNR        COMP      TRNNR                              3333
     C                   END
     C     *IN33         IFEQ      '0'
     C                   MOVE      ' '           UFLAGG
     C                   ELSE
     C                   MOVE      '1'           UFLAGG
     C                   END
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
