     FGODSHF    O  A E           K DISK
     FKODTFM    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FGODSFI    IF   E           K DISK
     FGODSJL01  UF   E           K DISK
     FMERKNF    IF A E           K DISK
     FCUNDL01   IF   E           K DISK
     FLLMRF     IF   E           K DISK
     FLLAGJL07  IF   E           K DISK
     FLLAGJD01  IF   E           K DISK
     FLL079P    O    E             PRINTER OFLIND(*IN01)
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZUSER                254    263
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      4  0
     D  XDD                    7      8  0
     D  XMM                    9     10  0
     D  X≈≈                   11     14  0
     D  XIDAG                  7     14  0
     D                 DS
     D  MRDT                   1      8  0
     D  MRDT≈                  1      4  0
     D  MRDTM                  5      6  0
     D  MRDTD                  7      8  0
     D                 DS
     D  XMRDT                  1      8  0
     D  XMRDTD                 1      2  0
     D  XMRDTM                 3      4  0
     D  XMRDT≈                 5      8  0
     D                 DS
     D  GO≈R4                  1      4
     D  GOCC                   1      2  0
     D  GO≈R                   3      4  0
     D UCMD            DS          1024
     D                 DS
     D XTXT01          C                   CONST('MANKO')
     D XTXT02          C                   CONST('OVERTALLIGE')
      *
     C                   EXSR      INIT
      *
     C                   EXSR      PRINT
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     LAGJ7K        KLIST
     C                   KFLD                    XGRUP
     C                   KFLD                    KUNDNR
     C                   KFLD                    XMRNR
     C     LAGJDK        KLIST
     C                   KFLD                    XGRUP
     C                   KFLD                    KUNDNR
     C                   KFLD                    VAMN
     C     LMRFK         KLIST
     C                   KFLD                    XGRUP
     C                   KFLD                    KUNDNR
     C                   KFLD                    XMRNR
     C     GODSJK        KLIST
     C                   KFLD                    GOGN
     C     MERKNFK       KLIST
     C                   KFLD                    MRGN
     C                   KFLD                    GOTRNR
     C                   KFLD                    GOPOS
      *
     C     *ENTRY        PLIST
     C                   PARM                    UMRNR             5
     C                   PARM                    UKN               8
     C                   PARM                    LASER             1
     C                   PARM                    STRING            5
     C                   PARM                    COPY              2 0
      *
     C     STRING        IFNE      *BLANKS
     C     STRING        CHAIN     KODTFM                             33
     C                   END
     C     LASER         IFEQ      'A'
     C                   SETON                                        77
     C                   END
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     *LOVAL        SETLL     GODSFI
     C                   READ      GODSFI                                 33
     C                   MOVE      *ZEROS        XGRUP             8 0
     C                   MOVE      UKN           KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            33
     C                   MOVE      UMRNR         XMRNR             5 0
     C     LMRFK         CHAIN     LLMRF                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      MRDTD         XMRDTD
     C                   MOVE      MRDTM         XMRDTM
     C                   MOVE      MRDT≈         XMRDT≈
     C                   MOVEL     MRGN          GO≈R4
     C                   MOVEL     MRGN          GOGN
     C                   MOVE      'J'           XOPDMERK          1
     C                   MOVEL     MRTRNR        GOTRNR
     C                   MOVE      9999          GOPOS
     C     LMRFK         CHAIN     LLMRF                              33
     C                   IF        *IN33
     C                   MOVE      *ZEROS        GOPOS             4 0
     C                   ELSE
     C                   MOVE      GOPOS         XPOS
     C                   CLEAR                   MERKNFR
     C                   MOVE      XPOS          GOPOS
     C                   MOVEL     MRGN          GOGN
     C                   MOVEL     MRTRNR        GOTRNR
     C                   Z-ADD     1             GOPOS2
     C                   MOVEL     ADR3          GOSTED
     C                   MOVEL     KNAVN         GOMOTM
     C                   MOVEL     VAANR         GOMERK
     C                   MOVEL     'LOGISTIKK'   GOMERC
     C                   MOVEL     'ADR'         GOMER1
     C                   MOVEL     'DI'          GOMKOD
     C                   END
     C                   ELSE
     C                   MOVE      *ZEROS        XMRDT
     C                   MOVE      'N'           XOPDMERK
     C                   END
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     PRINT         BEGSR
      *////////////////////////////////////////////////////////////
     C     LAGJ7K        SETLL     LLAGJL07
     C     LAGJ7K        READE     LLAGJL07                               33
      *
     C     *IN33         DOWEQ     '0'
     C     LAGJDK        SETLL     LLAGJD01
     C     LAGJDK        READE     LLAGJD01                               34
      *
     C     *IN34         DOWEQ     '0'
      *
     C                   MOVEL     VALLOK        XLLOK1
     C     VDLTYP        IFEQ      'OSJUS'
     C     XOPDGN        ANDEQ     ' '
     C                   MOVE      'J'           XOPDGN            1
     C     GODSJK        SETLL     GODSJL01
     C     GODSJK        READE     GODSJL01                               33
     C     *IN33         DOWEQ     '0'
     C                   MOVEL     'DI'          GOREI3
     C                   UPDATE    GODSJR
     C                   EXSR      gohist
     C     GODSJK        READE     GODSJL01                               33
     C  N33              ENDDO
     C                   END
     C     XPRT          IFEQ      ' '
     C                   MOVE      'J'           XPRT              1
     C                   TIME                    XTIME
     C                   WRITE     LL079P1
     C                   MOVE      '0'           *IN01
     C                   END
      *
     C     VDLTYP        IFEQ      'OSJUS'
     C                   ADD       1             XPOS
     C                   MOVE      *BLANKS       XMERKN
     C     VDLANT        IFGT      0
     C                   MOVEL     XTXT01        XMERKN
     C                   ELSE
     C                   MOVEL     XTXT02        XMERKN
     C                   END
     C                   WRITE     LL079P2
      *
     C                   IF        XOPDMERK = 'J'
     C                   ADD       1             GOPOS
     C                   MOVE      VDLANT        GOANTK
     C                   MOVEL     VAVARE        GOVSLA
     C                   MOVEL     VAANR         GOMERK
     C                   MOVEL     XMERKN        GOMERB
     C                   WRITE     MERKNFR
     C                   END
      *
     C                   END
     C     LAGJDK        READE     LLAGJD01                               34
     C  N34              ENDDO
      *
     C     LAGJ7K        READE     LLAGJL07                               33
     C  N33              ENDDO
      *
     C     XPRT          IFEQ      'J'
     C                   WRITE     LL079P3
     C                   END
      *
     C                   ENDSR
     C***********************************************
     C     gohist        BEGSR
     C***********************************************
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   movel     'LL079R'      gohpgm
     c                   move      wdt           gohdat
     c                   move      wtm           gohtim
     c                   move      zuser         gohusr
     c                   move      'E'           gohkod
     c                   write     godshr
     c                   endsr
      *
