      *
     FLLLINEE1  IF   E           K DISK
     FLL083D    CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     LESKEY        SETLL     LLLINEE1
     C     LESKEY        READE     LLLINEE1                               94
     C                   DOW       *IN94 = *OFF
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     LESKEY        READE     LLLINEE1                               94
     C  N94              ENDDO
      *
     C                   IF        ZRECNO > 1
     C                   EVAL      ZRECNO = 1
     C                   END
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *
     C                   GOTO      START3
      *
     C     SLUTT         TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UMN               7 0
     C                   PARM                    UANR             15
      *
     C     LESKEY        KLIST
     C                   KFLD                    UMN
     C                   KFLD                    UANR
     C                   KFLD                    ELTYPE
      *
     C                   EVAL      ELTYPE = 'A'
     C     LESKEY        CHAIN     LLLINEE1                           33
     C                   EVAL      ELTYPE = 'D'
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
