      *
     FLLAGJFE2  IF   E           K DISK
     FLL082D    CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  ITETXT                 1     35
     D  ITETXT20               1     20
     D                 DS
     D  VAFAR                  1     10
     D  VAVAL                  1      3
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     LESKEY        SETLL     LLAGJFE2
     C     LESKEY        READE     LLAGJFE2                               94
     C                   DOW       *IN94 = *OFF
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     LESKEY        READE     LLAGJFE2                               94
     C  N94              ENDDO
      *
     C                   IF        ZRECNO > 1
     C                   EVAL      ZRECNO = 1
     C                   END
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *
     C                   IF        ZRECNO > 0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   SETOFF                                       9998
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98              IF        WSNR = '5'
     C                   EXSR      SRVIS
     C                   MOVE      *BLANKS       WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C   98
     CANN99              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   END
     C                   MOVE      '0'           *IN99
     C                   ENDSR
      *
      ***********************************************
     C     SRVIS         BEGSR
      ***********************************************
     C                   MOVE      '1'           *IN99
      *
     C     STSRVIS       TAG
     C                   EXFMT     BILDE
      *
     C   03
     COR 12              GOTO      SLSRVIS
     C                   GOTO      STSRVIS
      *
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     SLSRVIS       ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UGRUP             8 0
     C                   PARM                    UKJED             8 0
     C                   PARM                    UMN               7 0
     C                   PARM                    UFLAGG            1
      *
     C     LESKEY        KLIST
     C                   KFLD                    UGRUP
     C                   KFLD                    UKJED
     C                   KFLD                    UMN
     C                   KFLD                    EVTYPE
      *
     C                   EVAL      EVTYPE = 'A'
     C     LESKEY        CHAIN     LLAGJFE2                           33
     C                   EVAL      FAKTXT15 = FAKTXT
     C                   EVAL      TARTXT15 = TARTXT
     C                   EVAL      EVTYPE = 'D'
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
