     FLLVARE01  IF   E           K DISK
     FLLGRPK01  IF   E           K DISK
     FLLAGJL03  UF   E           K DISK
     FLL098D    CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
      *
     C     LGRPKK        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSKJED
     C     LVAREK        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSKJED
     C                   KFLD                    WSANR
     C     LAGJ3K        KLIST
     C                   KFLD                    WSGRUP
     C                   KFLD                    WSKJED
     C                   KFLD                    WSANR
      *
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     20            POSNBR
     C     START         TAG
     C                   EXFMT     BILDE1
     C                   MOVEA     '000'         *IN(97)
     C                   MOVE      '0'           *IN30
      *
     C   03              GOTO      SLUTT
     C   04              DO
     C                   EXSR      SØKKUN
     C                   GOTO      START
     C                   END
      *
     C     WSGRUP        IFNE      0
     C     WSGRUP        SETLL     LLGRPK01
     C     WSGRUP        READE     LLGRPK01                               99
     C     *IN99         IFEQ      '1'
     C                   MOVE      'JOV0824'     MSGNR
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
     C                   END
      *
     C     WSKJED        COMP      0                                      98
     C  N98LGRPKK        SETLL     LLGRPK01
     C  N98LGRPKK        READE     LLGRPK01                               98
     C     *IN98         IFEQ      '1'
     C                   MOVE      'JOV0825'     MSGNR
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      *
     C     LVAREK        CHAIN     LLVARE01                           97
     C     *IN97         IFEQ      '1'
     C                   MOVE      'YBC0585'     MSGNR
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      *
     C     LAGJ3K        SETLL     LLAGJL03
     C     LAGJ3K        READE     LLAGJL03                               33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      ' '           VASTAT
     C                   UPDATE    LLAGJR
     C     LAGJ3K        READE     LLAGJL03                               33
     C  N33              ENDDO
      *
     C                   MOVE      *BLANKS       WSANR
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      ***********************************************
     C     SØKKUN        BEGSR
      ***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     20
     C     POSNBR        ANDLE     27
     C                   MOVE      'SØKGRP  '    UTYPE             8
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSKJED
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     20
     C     POSNBR        ANDLE     27
     C                   MOVE      WSGRUP        UTYPE
     C                   CALL      'LL004R'
     C                   PARM                    UTYPE
     C                   PARM                    WSGRUP
     C                   PARM                    WSKJED
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
      *
     C                   ENDSR
      *
