********************************************************************
      * OBS!!! havlfabrikata  - kompiler helst til QTEMP...
PTFnr:* Hardkodet kundenr lagerkunder - sletter ALLE TRANSER...
PTFnr:* SR DELVADR, DELVARE SLETTER OGSÅ LL-VAREADR OG ART.REGISTER - STJERN UT OM UØNSKET!!
      * 01 jov - tillegsfil for eufrakt
********************************************************************
     FLLAGJL01  UF   E           K DISK
N01  FLLAGJFEU  UF   E           K DISK
     FLLAGJD01  UF   E           K DISK
     FLLLISF    UF   E           K DISK
     FLLJUSF    UF   E           K DISK
     FLLVADR    UF   E           K DISK
     FLLVARE01  UF   E           K DISK
     FLLTARF    UF   E           K DISK
     FLLMRF     UF   E           K DISK
     FLLHEAD03  UF   E           K DISK
     FLLLINE    UF   E           K DISK
     FFIRM      IF   E           K DISK
     C                   EXSR      INIT
      * HARDKODET!!!!
     C                   Z-ADD     0             XKJED
     C                   Z-ADD     21453         XPNR
     C                   MOVE      FIFIRM        FIRMA
      * HARDKODET!!!!  (HUSK OGSÅ DELVADR/DELVARE - SKAL KALL PÅ SR  STJERNES UT ?? )

      * SLETT  MOTTAKSRAPP-HEADER
     C     MainKey       SETLL     LLMRF
     C     MainKey       reade     LLMRF                                  94
     C     *in94         doweq     '0'
     C                   DELETE    LLMRFR
     C     MainKey       reade     LLMRF                                  94
     C                   enddo

      * SLETT VAREINNG-POSTER, M. UNDERPOSTER
     C     MainKey       SETLL     LLAGJL01
     C     MainKey       reade     LLAGJL01                               94
     C     *in94         doweq     '0'
     C                   DELETE    LLAGJR
     C                   EXSR      DELUND01
     C     MainKey       reade     LLAGJL01                               94
     C                   enddo

      * SLETT VAREUTGG-POSTER/PLUKKLISTER , M. UNDERPOSTER
     C     MainKey       SETLL     LLHEAD03
     C     MainKey       reade     LLHEAD03                               94
     C     *in94         doweq     '0'
     C                   DELETE    LLHEADR
     C                   EXSR      DELUND02
     C     MainKey       reade     LLHEAD03                               94
     C                   enddo

      * SLETT VAREADRESSER LEVERANDØRER...
     C                   EXSR      DELVADR

      * SLETT VARE/ARKIKKEL-REGISTER MED UNDERREGISTER.
     C                   EXSR      DELVARE

     C                   MOVE      '1'           *INLR
     C                   RETURN


      ********************************************************
     C     DELUND01      BEGSR
      ********************************************************
N01   * tillegsrecord for Eu-frakt
N01  c     LAGDKey       chain     LLAGJFEU                           33
N01  C  N33              delete    LLAGJEUR
      * UTTAKSPOSTER
     C     LAGDKey       SETLL     LLAGJD01
     C     LAGDKey       reade     LLAGJD01                               94
     C     *in94         doweq     '0'
     C                   DELETE    LLAGJDR
     C     LAGDKey       reade     LLAGJD01                               94
     C                   enddo
      * LIS/FAKTNR MM
     C     VAMN          SETLL     LLLISF
     C     VAMN          reade     LLLISF                                 94
     C     *in94         doweq     '0'
     C                   DELETE    LLLISFR
     C     VAMN          reade     LLLISF                                 94
     C                   enddo
      * Logg på verdijusteringer
     C     VAMN          SETLL     LLJUSF
     C     VAMN          reade     LLJUSF                                 94
     C     *in94         doweq     '0'
     C                   DELETE    LLJUSFR
     C     VAMN          reade     LLJUSF                                 94
     C                   enddo
     C                   ENDSR
      ********************************************************
     C     DELUND02      BEGSR
      ********************************************************
      * PLUKKLISTELINJER
     C     LHMN          SETLL     LLLINE
     C     LHMN          reade     LLLINE                                 94
     C     *in94         doweq     '0'
     C                   DELETE    LLLINER
     C     LHMN          reade     LLLINE                                 94
     C                   enddo
     C                   ENDSR
      ********************************************************
     C     DELVADR       BEGSR
      ********************************************************
      * VAREADRESSE LEVERAND
     C     VADRKey       SETLL     LLVADR
     C     VADRKey       reade     LLVADR                                 94
     C     *in94         doweq     '0'
     C                   DELETE    LLVADRR
     C     VADRKey       reade     LLVADR                                 94
     C                   enddo
     C                   ENDSR
      ********************************************************
     C     DELVARE       BEGSR
      ********************************************************
      * VAREREGISTER
     C     VAREKey       SETLL     LLVARE01
     C     VAREKey       reade     LLVARE01                               94
     C     *in94         doweq     '0'
     C                   DELETE    LLVARER
     C     VAREKey       reade     LLVARE01                               94
     C                   enddo
      * TARIFFNR
     C     VAREKey       SETLL     LLTARF
     C     VAREKey       reade     LLTARF                                 94
     C     *in94         doweq     '0'
     C                   DELETE    LLTARFR
     C     VAREKey       reade     LLTARF                                 94
     C                   enddo
     C                   ENDSR
      ********************************************************
     C     INIT          BEGSR
      ********************************************************
     C     MainKey       KLIST
     C                   KFLD                    XKJED             8 0
     C                   KFLD                    XPNR              8 0
     C     LAGDKey       KLIST
     C                   KFLD                    XKJED
     C                   KFLD                    XPNR
     C                   KFLD                    VAMN
     C     VAREKey       KLIST
     C                   KFLD                    XKJED
     C                   KFLD                    XPNR
     C     VADRKey       KLIST
     C                   KFLD                    FIRMA             2
     C                   KFLD                    XPNR
     c     *loval        setll     FIRM
     c                   read      FIRM
     c                   ENDSR
      *
