     FLLMRFL05  IP   E           K DISK
     FLLVADR3   IF A E           K DISK
     FFIRM      IF   E           K DISK
      *
     C     *IN01         IFEQ      '0'
     C     LVAD3K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    MRKJED
     C                   KFLD                    MRLNR
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   01
     C                   MOVE      '1'           *IN01
     C                   MOVE      FIFIRM        FIRMA
     C                   MOVE      *ZEROS        GMKJED            8 0
     C                   END
      *
     C     MRLNR         IFNE      *BLANKS
     C     LVAD3K        CHAIN     LLVADR3                            33
     C     *IN33         IFEQ      '1'
     C     GMKJED        IFNE      MRKJED
     C                   MOVE      MRKJED        GMKJED
     C                   MOVE      *ZEROS        XXDRNR            5 0
     C                   MOVE      MRKJED        KUNDNR
     C                   END
     C                   ADD       1             XXDRNR
     C                   MOVE      XXDRNR        VADRNR
     C                   MOVE      MRLNA         VADRNA
     C                   MOVE      MRLAD1        VADRN1
     C                   MOVE      MRLAD2        VADRN2
     C                   MOVEL     MRLPN         VADRN3
     C                   MOVE      MRLAD3        VADRN3
     C                   MOVE      MRLNR         VAKURE
     C                   WRITE     LLVADRR
     C                   END
     C                   END
