     FLLWW01    UF A E           K DISK
     FLLAGJL03  IF   E           K DISK
     FLLAGJD01  IF   E           K DISK
      *
      *
     C                   EXSR      INIT
     C                   EXSR      HOVED
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      ************************************
     C     INIT          BEGSR
      ************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    XXGRUP            8
     C                   PARM                    XXPNR             8
     C                   PARM                    XXANR            15
     C                   PARM                    XXTØM             1
      *
     C                   MOVE      XXGRUP        LWWGRU
     C                   MOVE      XXPNR         LWWKN
     C                   MOVE      XXANR         LWWART
     C     LAGJ3K        KLIST
     C                   KFLD                    LWWGRU
     C                   KFLD                    LWWKN
     C                   KFLD                    LWWART
     C     LAGJ3KA       KLIST
     C                   KFLD                    LWWGRU
     C                   KFLD                    LWWKN
     C     LAGD1K        KLIST
     C                   KFLD                    LWWGRU
     C                   KFLD                    LWWKN
     C                   KFLD                    LWWMN
      *
      * TØM
     C                   SELECT
     C                   WHEN      XXTØM = '1'
     C     LAGJ3K        SETLL     LLWW01
     C     LAGJ3K        READE     LLWW01                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    LLWW01R
     C     LAGJ3K        READE     LLWW01                                 33
     C                   END
     C                   WHEN      XXTØM = 'A'
     C     LAGJ3KA       SETLL     LLWW01
     C     LAGJ3KA       READE     LLWW01                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    LLWW01R
     C     LAGJ3KA       READE     LLWW01                                 33
     C                   ENDDO
     C                   MOVE      XXANR         LWWART
     C                   ENDSL
      *
     C                   ENDSR
      ************************************
     C     HOVED         BEGSR
      ************************************
     C                   MOVE      *ZEROS        LWWLNR
     C     LAGJ3K        SETLL     LLAGJL03
     C     LAGJ3K        READE     LLAGJL03                               33
     C     *IN33         DOWEQ     '0'
     C     VADATO        IFNE      99999999
     C                   MOVE      VADATO        LWWDAT
     C                   MOVE      'I'           LWWTYP
     C                   Z-ADD     VAOANT        LWWANT
     C                   Z-ADD     VASALD        LWWSAL
     C                   MOVE      VAMN          LWWMN
     C                   MOVE      *ZEROS        LWWVN
     C                   ADD       1             LWWLNR
     C                   WRITE     LLWW01R
     C                   EXSR      DETALJ
     C                   END
     C     LAGJ3K        READE     LLAGJL03                               33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
      ************************************
     C     DETALJ        BEGSR
      ************************************
     C     LAGD1K        SETLL     LLAGJD01
     C     LAGD1K        READE     LLAGJD01                               34
     C     *IN34         DOWEQ     '0'
     C                   MOVE      VDLDAT        LWWDAT
     C                   IF        VDLTYP = 'PLIST'
     C                   MOVE      'S'           LWWTYP
     C                   ELSE
     C                   MOVE      'J'           LWWTYP
     C                   END
     C                   Z-SUB     VDLANT        LWWANT
     C                   MOVE      *ZEROS        LWWSAL
     C                   MOVE      VAMN          LWWMN
     C                   MOVE      VDVN          LWWVN
     C                   ADD       1             LWWLNR
     C                   WRITE     LLWW01R
     C     LAGD1K        READE     LLAGJD01                               34
     C  N34              ENDDO
      *
     C                   ENDSR
