     FLOGUSRF   UF A E           K DISK
     D                 DS
     D  AAR                    1      4  0
     D  MND                    5      6  0
     D  DAG                    7      8  0
     D  DATO                   1      8  0
     D                 DS
     D  AARO                   1      4  0
     D  MNDO                   5      6  0
     D  DAGO                   7      8  0
     D  DATOO                  1      8  0
     D                 DS
     D  XTIME                  1     14  0
     D  XAAR                   1      4  0
     D  XMND                   5      6  0
     D  XDAG                   7      8  0
     D                SDS
     D  USER                 254    263
     C     *ENTRY        PLIST
     C                   PARM                    PGM              10
     C*
     C     KEY           KLIST
     C                   KFLD                    USER
     C                   KFLD                    PGM
     C     KEY           CHAIN     LOGUSRF                            33
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   Z-ADD     0             XTIME
     C                   MOVEL     WDT           XTIME
     C                   MOVE      WTM           XTIME
     C                   MOVE      XAAR          AAR
     C                   MOVE      XMND          MND
     C                   MOVE      XDAG          DAG
     C                   ADD       1             ANTALL
     C   33              MOVE      XAAR          AARO
     C   33              MOVE      XMND          MNDO
     C   33              MOVE      XDAG          DAGO
     C*
     C  N33              UPDATE    LOGUSRFR
     C   33              WRITE     LOGUSRFR
     C                   SETON                                        LR
     C                   RETURN
