      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE SAKSBEHANDLER(SIGNATUR)   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FFIRM      IF   E           K DISK
     FMAILPRTF  UF A E           K DISK
     Fmail04fm  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      *BLANKS       YSTXT            10
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     startk        SETLL     MAILPRTF
     C     START1        TAG
     C                   READ(N)   MAILPRTF                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ(N)   MAILPRTF                               94
     C  N94              MOVE      ARTXT         YSTXT
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     4             POSNBR
     C                   MOVE      *BLANKS       WSTXT
     C                   GOTO      START5
     C                   END
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94VIDEREK       SETLL     MAILPRTF
     C  N94              READ(N)   MAILPRTF                               94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 8=VEDLIKEHOLD EPOSTMOTTAGERE TIL DOKUMENT
      *
     C     WSNR          IFEQ      '8'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      EPOMOT
     C                   END
      *
      * 1=prukk
      *
     C     WSNR          IFEQ      '1'                                          ENDRE
     c                   move      artxt         udok11           11
     c                   movel     '*'           udok11
     C                   MOVEL     udok11        udok
     C                   seton                                        lr
     c                   return
     C                   END
      *
      * ENDRE
      *
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      CHGSF
     C   12              GOTO      SLHENT
     C                   END
      *
      * SLETTE
      *
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C                   EXSR      DLTSF
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     EPOMOT        BEGSR
     C***********************************************
     C                   MOVE      ARTXT         U11              11
     C                   MOVEL     '*'           U11
     C                   MOVEL     U11           UDOC             30
     C                   CALL      'VCUNDC3R'
     C                   PARM                    FIFIRM
     C                   PARM                    UDOC
     C                   PARM                    USOK80           10 0
     C                   PARM                    EPOFAX            1
     C*
     C                   UPDATE    SUBFIL
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    udok             30
     c                   parm                    plukk             1
     c     plukk         comp      'J'                                    60
     C     startk        KLIST
     C                   KFLD                    XXTXT            10
     C     viderek       KLIST
     C                   KFLD                    YSTXT
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSTXT
     C                   MOVE      *BLANKS       WSTXT2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSTXT         COMP      *BLANKS                                90
     C   90              MOVE      'SPK0029'     MSGNR
     C  N90WSTXT         CHAIN     MAILPRTF                           33
     C  N90
     CANN33              DO
     C                   UPDATE    MAILPRTFR
     C                   SETON                                        90
     C                   MOVE      'SPK0024'     MSGNR
     C                   END
     C   90              Z-ADD     17            POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C  N30WSTXT2        COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'SPK0030'     MSGNR
     C   89
     CANN30              Z-ADD     39            POSNBR
     C   89              SETON                                        30
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     WSTXT         CHAIN     MAILPRTF                           33
     C                   EXSR      MOVWSF
     C  N33              UPDATE    MAILPRTFR
     C   33              WRITE     MAILPRTFR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      WSTXT         ARTXT
     C                   END
     C*
     C                   MOVE      WSTXT2        ARTXT2
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      ARTXT         WSTXT
     C                   MOVE      ARTXT2        WSTXT2
     C                   SETON                                        40
     C*
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSF         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     VAREL3
     C  N12              DO
     C     ARTXT         CHAIN     MAILPRTF                           33
     C  N33              DELETE    MAILPRTFR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       ARTXT
     C                   MOVE      *BLANKS       ARTXT2
     C*
     C                   ENDSR
     C*
