     Fmail10fm  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    Ulenke          140
     C                   move      ulenke        lenke
     C                   EXFMT     BILDE
     C                   seton                                        lr
     C                   return
