     FFRSTTG    IP   E           K DISK
     FSTEDP     UF A E           K DISK
     C     KEY           KLIST
     C                   KFLD                    STPNLK
     C                   KFLD                    STPNPO
     C                   MOVE      *BLANKS       STPNPO
     C                   MOVEL     TGPNT         STPNPO
     C                   MOVE      'NO'          STPNLK
     C     KEY           CHAIN     STEDP                              33
     C   33              MOVE      *BLANKS       STPNPL
     C   33TGPNT         IFNE      '0000'
     C     TGPNT         ANDNE     '9999'
     C     TGPNT         ANDNE     '    '
     C   33              MOVEL     TGNA          STPNPL
     C   33              WRITE     STEDPR
     C                   END
