     D A8              S              2  0 DIM(8)
     D T8              S              1  0 DIM(8) CTDATA PERRCD(8)
      *
     D                 DS
     D  WK8                    1      8  0
     D                                     DIM(8)
     D  UK8                    1      8
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKID              8
     C                   PARM                    UMODA             1 0
     C                   MOVEL     UKID          UK8
     C     T8            MULT      WK8           A8                                            D150
     C                   XFOOT     A8            SUM               3 0                         D150
     C     SUM           DIV       11            SUM2              5 0                         D150
     C                   MVR                     MVR               2 0                         D150
     C     11            SUB       MVR           XBAK              2 0                         D150
     C                   SELECT
     C     XBAK          WHENEQ    11
     C                   Z-ADD     5             XBAK
     C     XBAK          WHENEQ    10
     C                   Z-ADD     0             XBAK
     C                   ENDSL
     C                   MOVE      XBAK          UMODA                                         D150
     C                   RETURN
**
86423597
