     H DEBUG(*YES)
     D ID              DS
     D  OPENI4                 1      6    INZ('000000')
     D  PATH                   7     19    INZ('/SYEDIF/EDIRE')
     D UDCPRM          DS                  INZ
     D  A1                     1     16
     D  A3                     1      4B 0
     D  A6                     1      4B 0
     C                   EVAL      A3=12
     C                   EVAL      A6=-1
     C                   CALL      'QHFOPNDR'
     C                   PARM                    DIRH             16
     C                   PARM      PATH          PATH1            13
     C                   PARM                    A3
     C                   PARM                    OPENI4
     C                   PARM                    ATTRST           20
     C                   PARM                    A6
     C                   PARM                    ERRC             50
     C                   DUMP
     C                   EVAL      *INLR=*ON
