      *
      ************************************************************
      *** PROGRAM SKAL VISE HYPERKOBLING TIL PDF
     F**************************************************************
     FPDF001FM  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    link             70
     C*
     C     START         TAG
     C     XWIN          IFEQ      ' '
     C                   MOVE      'J'           XWIN              1
     C                   WRITE     WINDOWSZ
     C                   END
     C                   EXFMT     BILDE01
     C*
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
