      *
      ************************************************************
      *** PROGRAM SKAL VISE HYPERKOBLING TIL PDF
     F**************************************************************
     Ffirm      IF   E           K DISK
     Ffirmpdf   IF   E           K DISK
     C     *entry        plist
     c                   parm                    liss              1
     C                   move      'N'           liss
     c                   read      firm                                   33
     c     fifirm        chain     firmpdf                            34
     C  n34              move      'J'           liss
     C                   seton                                        lr
     C                   return
