      *
      ************************************************************
      *** PROGRAM SKAL VISE HYPERKOBLING TIL PDF
     F**************************************************************
     Ffirm      IF   E           K DISK
     Ffirmpdf   UF A E           K DISK
     FPDF002FM  CF   E             WORKSTN
     C*
     c                   read      firm                                 30
     C     START         TAG
     C     fifirm        chain(n)  firmpdf                            33
     C                   move      pdipad        wsipad
     C                   move      pdbane        wsbane
     C                   WRITE     WINDOWSZ
     C                   EXFMT     BILDE01
     C*
     C     fifirm        chain     firmpdf                            33
     C                   move      fifirm        pdffir
     C                   move      wsipad        pdipad
     C                   move      wsbane        pdbane
     c   33              write     firmpdfr
     c  n33              update    firmpdfr
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
