     H
     FFAXUSRS   O  A E           K DISK
     D USERID          DS             8
     D FAXNBR          DS            32
     D TO              DS            40
     D TITLE           DS            40
     D COMMEN          DS            40
     D TO1             DS            40
     D TO2             DS            40
     D TO3             DS            40
     D FI              DS             2
     D KNU             DS             8
     D ALFA            DS            10
     D TELE            DS            32
     C                   SETON                                        LR
     C     *ENTRY        PLIST
     C     FUSERI        PARM                    USERID
     C     FFAXNB        PARM                    FAXNBR
     C     FTO           PARM                    TO
     C     FTITLE        PARM                    TITLE
     C     FCOMME        PARM                    COMMEN
     C     FTO1          PARM                    TO1
     C     FTO2          PARM                    TO2
     C     FTO3          PARM                    TO3
     C     FFI           PARM                    FI
     C     FKNU          PARM                    KNU
     C     FALFA         PARM                    ALFA
     C     FTELE         PARM                    TELE
     OFAXREC    DADDNLR
     O                       *ALL
