     FRENASP    IP   E             DISK
     FCUNDLFO   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDMAF   UF A E           K DISK
      *
      *init
      *
     C  n99              read      firm                                   33
     c  n99              eval      cmafi=fifirm
     C  n99              seton                                        99
      *
     c     kunkey        klist
     C                   kfld                    firma
     c                   kfld                    syrg
     c                   eval      syrg=renfor
     c                   eval      firma=fifirm
      *
     c     mafkey        klist
     C                   kfld                    CMAFI
     c                   kfld                    CMAKN
     c                   kfld                    CMAKD
      *
     c     kunkey        chain     cundlfo                            33
      *
     c     *in33         ifeq      '0'
     c                   eval      cmakn=kundnr
      *
      * kode01
      *
     c     kode01        ifne      *blanks
     c                   eval      cmakd=kode01
     c     mafkey        chain     cundmaf                            34
     C     cmakd         ifeq      'RR'
     c                   eval      cmatxt='MILJØGEBYR FASTSATT AV RENAS'
     c                   end
     C     cmakd         ifeq      'RK'
     c                   eval      cmatxt='AVGIFT PÅ ELEKTRISKE PRODUKTER'
     c                   end
     c  N34              update    cundmafr
     c   34              write     cundmafr
     c                   end
      *
      *
      * kode02
      *
     c     kode02        ifne      *blanks
     c                   eval      cmakd=kode02
     c     mafkey        chain     cundmaf                            34
     C     cmakd         ifeq      'RR'
     c                   eval      cmatxt='MILJØGEBYR FASTSATT AV RENAS'
     c                   end
     C     cmakd         ifeq      'RK'
     c                   eval      cmatxt='AVGIFT PÅ ELEKTRISKE PRODUKTER'
     c                   end
     c  N34              update    cundmafr
     c   34              write     cundmafr
     c                   end
     c                   end
