      *   merk budsjettposter ført
      *
     Fkosbu     UP   E           K DISK
NRFA D                 DS
NRFA D  BUPCC                  1      2  0
NRFA D  BUPÅR                  3      4  0
NRFA D  AARF                   1      4  0
NRFA D                 DS
     D  aarn                   1      4  0
     D  nini                   5      8  0
     D  dato                   1      8  0
      *
     C     *entry        plist
     c                   parm                    aar               4
     c                   move      aar           aarn              4 0
     c                   z-add     9999          nini
     c     bust          ifeq      ' '
     c     aarf          andle     aarn
     c     bufedt        andlt     dato
     c                   move      'S'           bust
     c                   update    kosbur
     c                   end
