      *   SLETTER EN PARTS EDILOGGING
      *
     FEDIS7     UF   E           K DISK
     FEDIS8     UF   E           K DISK
     F                                     RENAME(EDISR:EDIS8R)
     FEDIRE     UF   E           K DISK
     FEDISE     UF   E           K DISK
     FEDISX     UF   E           K DISK
     FEDIRE1K   UF   E           K DISK
     F                                     RENAME(EDIRER:EDIRE1KR)
     FEDISE1K   UF   E           K DISK
     F                                     RENAME(EDISER:EDISE1KR)
     IEDIRE1KR
     I              RDATA                       RDATA1K
     IEDISE1KR
     I              SDATA                       SDATA1K
      *
      * EDI AVSENDER
      *
     c                   exsr      init
      *
     C     KEYLL         SETLL     EDIS7
     C     *IN33         DOWEQ     '0'
     C     KEYE          READE     EDIS7                                  33
     C  N33SDT           COMP      TILDAT                             33
     C     *IN33         IFEQ      '0'
     C                   DELETE    EDISR
     c                   exsr      srifs
     C     SFILE         IFEQ      'EDIRE'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDIRE
     C                   END
     C     SFILE         IFEQ      'EDISE'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDISE
     C                   END
     C     SFILE         IFEQ      'EDIRE1K'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDIRE1K
     C                   END
     C     SFILE         IFEQ      'EDISE1K'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDISE1K
     C                   END
     C                   ENDIF
     C                   ENDDO
      *
      *
      * EDI MOTTAGER
      *
     C                   SETOFF                                       33
     C     KEYLL         SETLL     EDIS8
     C     *IN33         DOWEQ     '0'
     C     KEYE          READE     EDIS8                                  33
     C  N33SDT           COMP      TILDAT                             33
     C     *IN33         IFEQ      '0'
     C                   DELETE    EDIS8R
     c                   exsr      srifs
     C     SFILE         IFEQ      'EDIRE'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDIRE
     C                   END
     C     SFILE         IFEQ      'EDISE'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDISE
     C                   END
     C     SFILE         IFEQ      'EDIRE1K'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDIRE1K
     C                   END
     C     SFILE         IFEQ      'EDISE1K'
     C     SMBR          ANDNE     *BLANKS
     C                   EXSR      SEDISE1K
     C                   END
     C                   ENDIF
     C                   ENDDO
      *
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UPART            35
     C                   PARM                    UFRAD             8 0
     C                   PARM                    TILDAT            8 0
     C     KEYLL         KLIST
     C                   KFLD                    PART             35
     C                   KFLD                    FRADAT            8 0
     C
      *
     c                   move      upart         part
     c                   move      ufrad         fradat
     C
      *
     C     KEYE          KLIST
     C                   KFLD                    part
     C     KEYMBR        KLIST
     C                   KFLD                    SMBR
     C                   ENDSR
      *
      *
     C***********************************************
     C     SEDIRE        BEGSR
     C***********************************************
     C                   SETOFF                                       35
      *
     C     KEYMBR        SETLL     EDIRE
     C     *IN35         DOWEQ     '0'
     C     KEYMBR        READE     EDIRE                                  35
     C     *IN35         IFEQ      '0'
     C                   DELETE    EDIRER
     C                   ENDIF
     C                   ENDDO
     C                   ENDSR
     C***********************************************
     C     SEDISE        BEGSR
     C***********************************************
     C                   SETOFF                                       35
      *
     C     KEYMBR        SETLL     EDISE
     C     *IN35         DOWEQ     '0'
     C     KEYMBR        READE     EDISE                                  35
     C     *IN35         IFEQ      '0'
     C                   DELETE    EDISER
     C                   ENDIF
     C                   ENDDO
     C                   ENDSR
     C***********************************************
     C     SEDIRE1K      BEGSR
     C***********************************************
     C                   SETOFF                                       35
      *
     C     KEYMBR        SETLL     EDIRE1K
     C     *IN35         DOWEQ     '0'
     C     KEYMBR        READE     EDIRE1K                                35
     C     *IN35         IFEQ      '0'
     C                   DELETE    EDIRE1KR
     C                   ENDIF
     C                   ENDDO
     C                   ENDSR
     C***********************************************
     C     SEDISE1K      BEGSR
     C***********************************************
     C                   SETOFF                                       35
      *
     C     KEYMBR        SETLL     EDISE1K
     C     *IN35         DOWEQ     '0'
     C     KEYMBR        READE     EDISE1K                                35
     C     *IN35         IFEQ      '0'
     C                   DELETE    EDISE1KR
     C                   ENDIF
     C                   ENDDO
     C                   ENDSR
      *
     C***********************************************
     C     SRIFS         BEGSR
     C***********************************************
     c
     C     keymbr        chain     edisx                              36
     c     *in36         ifeq      '0'
     c                   delete    edisxr
     c                   call      'REOEDIDLT'
     c                   parm                    SXIFSOBJ
     c                   end
     c                   endsr
