********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 flytter arkivlogg    ...
10XXX * 02 YBC PTF10 FLERE NYE FILER
********************************************************************
      ***********************************************************
      *** PROGRAM SKAL FLYTTE OPPDRAG FRA DRIFTSFILER TIL     ***
      ***      FULLSTENDIGE HISTORIKKFILER                    ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06-26                   ***
      *** LEDIGE INDIKATORER 30 35-97                         ***
      ***********************************************************
      *
     FAMDE      UF   E           K DISK    USROPN
     FAMGE      UF   E           K DISK    USROPN
     FAMHE      UF   E           K DISK    USROPN
     FAMSAML1   UF   E           K DISK    USROPN
     F                                     RENAME(SAMLR:AMSAMLR)
N01  FARKIVL02  UF   E           K DISK    USROPN
N02  FARKLOGH4  UF   E           K DISK    USROPN
N02  FARKLOGD   UF   E           K DISK    USROPN
     FAVSLUTF   UF   E           K DISK    USROPN
     FAVSLUTGF  UF   E           K DISK    USROPN
     FBILLOF    UF   E           K DISK    USROPN
N02  FBILLOFOS  UF   E           K DISK    USROPN
     FBLADRT    UF   E           K DISK    USROPN
     FBLLOK     UF   E           K DISK    USROPN
     FBLVSD2    UF   E           K DISK    USROPN
     FBLV1      UF   E           K DISK    USROPN
N02  FBLV1GATE  UF   E           K DISK    USROPN
     FBLV2      UF   E           K DISK    USROPN
N02  FCCBLV1    UF   E           K DISK    USROPN
N02  F                                     PREFIX(CC_)
N02  FCCBLV2    UF   E           K DISK    USROPN
N02  F                                     PREFIX(CC_)
     FBOOKING   UF   E           K DISK    USROPN
     FBOOKIN2   UF   E           K DISK    USROPN
N02  FCARGOF3   UF   E           K DISK    USROPN
N02  FCARGOO    UF   E           K DISK    USROPN
     FDIMM      UF   E           K DISK    USROPN
     FDISP      UF   E           K DISK    USROPN
     FDOKEB     UF   E           K DISK    USROPN
     FDOKEC     UF   E           K DISK    USROPN
     FDOKECE    UF   E           K DISK    USROPN
     FDOKECEL   UF   E           K DISK    USROPN
     FDOKECET   UF   E           K DISK    USROPN
     FDOKEF     UF   E           K DISK    USROPN
     FDOKEFIM   UF   E           K DISK    USROPN
     FDOKEM     UF   E           K DISK    USROPN
     FDOKEQ     UF   E           K DISK    USROPN
     FDOKEQM    UF   E           K DISK    USROPN
     FDOKOTH    UF   E           K DISK    USROPN
     FDOKOTHM1  UF   E           K DISK    USROPN
     F                                     RENAME(DOKOTR:DOKOTMR)
     FDOKUF     UF   E           K DISK    USROPN
     FDOKUFM    UF   E           K DISK    USROPN
     FDOKUFV    UF   E           K DISK    USROPN
     FDOKUDGS   UF   E           K DISK    USROPN
     FDOKUI     UF   E           K DISK    USROPN
N02  FDOKULG    UF   E           K DISK    USROPN
     FDOKUM     UF   E           K DISK    USROPN
     FDOKUT     UF   E           K DISK    USROPN
     FDOK29     UF   E           K DISK    USROPN
     FDOK36     UF   E           K DISK    USROPN
N02  FDOLAL01   UF   E           K DISK    USROPN
N02  FEDICS2    UF   E           K DISK    USROPN
N02  FENADSF    UF   E           K DISK    USROPN
     FEDIM2     UF   E           K DISK
     FEDIS      UF   E           K DISK
N02  FEPOH      UF   E           K DISK    USROPN
N02  FEPOH02    UF   E           K DISK    USROPN
N02  F                                     RENAME(EPOHR:EPOH02R)
N02  FEPOL      UF   E           K DISK    USROPN
N02  FEPOL02    UF   E           K DISK    USROPN
N02  F                                     RENAME(EPOLR:EPOL02R)
N02  FEPOPOS    UF   E           K DISK    USROPN
N02  FESOSF1    UF   E           K DISK    USROPN
N02  FESOSF2    UF   E           K DISK    USROPN
N02  FESOSF3    UF   E           K DISK    USROPN
N02  FE171F     UF   E           K DISK    USROPN
N02  FE307F     UF   E           K DISK    USROPN
     FFAI4      UF   E           K DISK
     FFAK2      UF   E           K DISK
N02  FFAKTXT    UF   E           K DISK    USROPN
N02  FFAXLOG03  UF   E           K DISK    USROPN
     FFORDEL    UF   E           K DISK    USROPN
     FFREETXT   UF   E           K DISK    USROPN
     FFRISOK    UF   E           K DISK    USROPN
     FFRMDOC    UF   E           K DISK    USROPN
     FFRMDOC1   UF   E           K DISK    USROPN
     FFRMDOC2   UF   E           K DISK    USROPN
     FFRMDOC3   UF   E           K DISK    USROPN
N02  FFPXREF    UF   E           K DISK    USROPN
     FGSSAKF    UF   E           K DISK    USROPN
     FGSSFGF    UF   E           K DISK    USROPN
     FGSSGDF    UF   E           K DISK    USROPN
     FGSSKAF    UF   E           K DISK    USROPN
     FGSSLGL01  UF   E           K DISK    USROPN
     FGSSOLL01  UF   E           K DISK    USROPN
     FGSSORL21  UF   E           K DISK    USROPN
     FGSSOVF    UF   E           K DISK    USROPN
     FGSSOWL01  UF   E           K DISK    USROPN
     FGSSPAF    UF   E           K DISK    USROPN
     FGSSPOF    UF   E           K DISK    USROPN
     FGSSRFF    UF   E           K DISK    USROPN
     FGSSTRF    UF   E           K DISK    USROPN
N02  FGSSTUR    UF   E           K DISK    USROPN
     FHEADD     UF   E           K DISK
N02  FHEBRELE   UF   E           K DISK    USROPN
     FHESTED    UF   E           K DISK    USROPN
     FHETRIU    UF   E           K DISK    USROPN
     FHUBOL02   UF   E           K DISK    USROPN
     FISOFL1    UF   E           K DISK    USROPN
     FISOLFL1   UF   E           K DISK    USROPN
     FISOSAKF   UF   E           K DISK    USROPN
     FKOSBU12   UF   E           K DISK    USROPN
     FMCAWF     UF   E           K DISK    USROPN
N02  FOMDI      UF   E           K DISK    USROPN
     FPALLDL99  UF   E           K DISK    USROPN
N02  FRUCKP     UF   E           K DISK    USROPN
N02  FRUCKPU    UF   E           K DISK    USROPN
     FSAML1     UF   E           K DISK    USROPN
N02  FSKPOS     UF   E           K DISK    USROPN
N02  F                                     PREFIX(SK_)
     FSTSCLI    UF   E           K DISK    USROPN
     FSTSFBR    UF   E           K DISK    USROPN
     FSTSOPD1   UF   E           K DISK    USROPN
N02  FTKSGML1   UF   E           K DISK    USROPN
     FTRACKF    UF   E           K DISK    USROPN
N02  FTRACKK02  UF   E           K DISK    USROPN
     FTRACKT    UF   E           K DISK    USROPN
     FUTLLOGF   UF   E           K DISK    USROPN
N02  FVARELI    UF   E           K DISK    USROPN
N02  FXMLINHL1  UF   E           K DISK    USROPN
      *
     FAMDEOLD   O  A E             DISK    USROPN
     F                                     RENAME(AMDER:AMDERO)
     FAMGEOLD   O  A E             DISK    USROPN
     F                                     RENAME(AMGER:AMGERO)
     FAMHEOLD   O  A E             DISK    USROPN
     F                                     RENAME(AMHER:AMHERO)
     FAMSAMLOLD O  A E             DISK    USROPN
     F                                     RENAME(SAMLR:AMSAMLRO)
N01  FARKIVOLD  O  A E             DISK    USROPN
N01  F                                     RENAME(ARKIVR:ARKIVRO)
N02  FARKLOHOLD O  A E             DISK    USROPN
N02  F                                     RENAME(ARKLOGHR:ARKLOGHRO)
N02  FARKLODOLD O  A E             DISK    USROPN
N02  F                                     RENAME(ARKLOGDR:ARKLOGDRO)
     FAVSLUTOLD O  A E             DISK    USROPN
     F                                     RENAME(AVSLUTFR:AVSLUTFRO)
     FAVSLUGOLD O  A E             DISK    USROPN
     F                                     RENAME(AVSLUTGR:AVSLUTGRO)
     FBILLOFOLD O  A E             DISK    USROPN
     F                                     RENAME(BILLOFR:BILLOFRO)
N02  FBILLOSOLD O  A E             DISK    USROPN
N02  F                                     RENAME(BLOSR:BLOSRO)
     FBLADRTOLD O  A E             DISK    USROPN
     F                                     RENAME(BLADRTR:BLADRTRO)
     FBLLOKOLD  O  A E             DISK    USROPN
     F                                     RENAME(BLLOKR:BLLOKRO)
     FBLVSD2OLD O  A E             DISK    USROPN
     F                                     RENAME(BLVSD2R:BLVSD2RO)
     FBLV1OLD   O  A E             DISK    USROPN
     F                                     RENAME(BLV1R:BLV1RO)
N02  FBLV1GTOLD O  A E             DISK    USROPN
N02  F                                     RENAME(BLV1GTR:BLV1GTRO)
     FBLV2OLD   O  A E             DISK    USROPN
     F                                     RENAME(BLV2R:BLV2RO)
N02  FCCBLV1OLD O  A E             DISK    USROPN
N02  F                                     RENAME(CCBLV1R:CCBLV1RO)
N02  F                                     PREFIX(CC_)
N02  FCCBLV2OLD O  A E             DISK    USROPN
N02  F                                     RENAME(CCBLV2R:CCBLV2RO)
N02  F                                     PREFIX(CC_)
     FBOOKINGOLDO  A E             DISK    USROPN
     F                                     RENAME(BOOKINGR:BOOKINGRO)
     FBOOKIN2OLDO  A E             DISK    USROPN
     F                                     RENAME(BOOKIN2R:BOOKIN2RO)
N02  FCARGOFOLD O  A E             DISK    USROPN
N02  F                                     RENAME(CARGOFR:CARGOFRO)
N02  FCARGOOOLD O  A E             DISK    USROPN
N02  F                                     RENAME(CARGOOR:CARGOORO)
     FDIMMOLD   O  A E             DISK    USROPN
     F                                     RENAME(DIMMR:DIMMRO)
     FDISPOLD   O  A E             DISK    USROPN
     F                                     RENAME(DISPR:DISPRO)
     FDOKEBOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKEBR:DOKEBRO)
     FDOKECOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKECR:DOKECRO)
     FDOKECEOLD O  A E             DISK    USROPN
     F                                     RENAME(DOKECER:DOKECERO)
     FDOKECELOLDO  A E             DISK    USROPN
     F                                     RENAME(DOKECELR:DOKECELRO)
     FDOKECETOLDO  A E             DISK    USROPN
     F                                     RENAME(DOKECETR:DOKECETRO)
     FDOKEFOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKEFR:DOKEFRO)
     FDOKEFIMOLDO  A E             DISK    USROPN
     F                                     RENAME(DOKEFIMR:DOKEFIMRO)
     FDOKEMOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKEMR:DOKEMRO)
     FDOKEQOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKEQR:DOKEQRO)
     FDOKEQMOLD O  A E             DISK    USROPN
     F                                     RENAME(DOKEQMR:DOKEQMRO)
     FDOKOTHOLD O  A E             DISK    USROPN
     F                                     RENAME(DOKOTR:DOKOTRO)
     FDOKOTHMOLDO  A E             DISK    USROPN
     F                                     RENAME(DOKOTR:DOKOTMRO)
     FDOKUFOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKUFR:DOKUFRO)
     FDOKUFMOLD O  A E             DISK    USROPN
     F                                     RENAME(DOKUFMR:DOKUFMRO)
     FDOKUFVOLD O  A E             DISK    USROPN
     F                                     RENAME(DOKUFVR:DOKUFVRO)
     FDOKUDOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKUDGSR:DOKUDGOL)
     FDOKUIOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKUIR:DOKUIRO)
N02  FDOKULGOLD O  A E             DISK    USROPN
N02  F                                     RENAME(DOKULGR:DOKULGRO)
     FDOKUMOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKUMR:DOKUMRO)
     FDOKUTOLD  O  A E             DISK    USROPN
     F                                     RENAME(DOKUTR:DOKUTRO)
     FDOK29OLD  O  A E             DISK    USROPN
     F                                     RENAME(DOK29R:DOK29RO)
     FDOK36OLD  O  A E             DISK    USROPN
     F                                     RENAME(DOK36R:DOK36RO)
N02  FDOLAFOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(DOLAR:DOLARO)
N02  FEDICSOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(EDICSR:EDICSRO)
N02  FENADSFOLD O  A E             DISK    USROPN
N02  F                                     RENAME(NADSR:NADSRO)
     FEDIMOLD   O  A E             DISK    RENAME(EDIMR:EDIMRO)
     FEDISOLD   O  A E             DISK    RENAME(EDISR:EDISRO)
N02  FEPOHOLD   O  A E             DISK    USROPN
N02  F                                     RENAME(EPOHR:EPOHRO)
N02  FEPOLOLD   O  A E             DISK    USROPN
N02  F                                     RENAME(EPOLR:EPOLRO)
N02  FEPOPOSOLD O  A E             DISK    USROPN
N02  F                                     RENAME(EPOPOSR:EPOPOSRO)
N02  FESOSF1OLD O  A E             DISK    USROPN
N02  F                                     RENAME(ESOSF1R:ESOSF1RO)
N02  FESOSF2OLD O  A E             DISK    USROPN
N02  F                                     RENAME(ESOSF2R:ESOSF2RO)
N02  FESOSF3OLD O  A E             DISK    USROPN
N02  F                                     RENAME(ESOSF3R:ESOSF3RO)
N02  FE171FOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(E171FR:E171FRO)
N02  FE307FOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(E307FR:E307FRO)
     FFAKTOLD   O  A E             DISK
     F                                     RENAME(FAKTR:FAKTRO)
N02  FFAKTXTOLD O  A E             DISK
N02  F                                     RENAME(FAKTXTR:FAKTXTRO)
     FFAINOLD   O  A E             DISK
     F                                     RENAME(FAINR:FAINRO)
N02  FFAXLOGOLD O  A E             DISK
N02  F                                     RENAME(FAXLOGR:FAXLOGRO)
     FFORDELOLD O  A E             DISK    USROPN
     F                                     RENAME(FORDR:FORDRO)
     FFREETXTOLDO  A E             DISK    USROPN
     F                                     RENAME(FREETXTR:FREETXTRO)
     FFRISOKOLD O  A E             DISK    USROPN
     F                                     RENAME(FRISOKR:FRISOKRO)
     FFRMDOCOLD O  A E             DISK    USROPN
     F                                     RENAME(FRMDOCR:FRMDOCRO)
     FFRMDOC1OLDO  A E             DISK    USROPN
     F                                     RENAME(FRMDOC1R:FRMDOC1RO)
     FFRMDOC2OLDO  A E             DISK    USROPN
     F                                     RENAME(FRMDOC2R:FRMDOC2RO)
     FFRMDOC3OLDO  A E             DISK    USROPN
     F                                     RENAME(FRMDOC3R:FRMDOC3RO)
N02  FFPXREFOLD O  A E             DISK
N02  F                                     RENAME(FPXREFR:FPXREFRO)
     FGSSAKFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSAKFR:GSSAKFRO)
     FGSSFGFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSFGFR:GSSFGFRO)
     FGSSGDFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSGDFR:GSSGDFRO)
     FGSSKAFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSKAFR:GSSKAFRO)
     FGSSLGFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSLGFR:GSSLGFRO)
     FGSSOLFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSOLFR:GSSOLFRO)
     FGSSORFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSORFR:GSSORFRO)
     FGSSOVFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSOVFR:GSSOVFRO)
     FGSSOWFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSOWFR:GSSOWFRO)
     FGSSPAFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSPAFR:GSSPAFRO)
     FGSSPOFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSPOFR:GSSPOFRO)
     FGSSRFFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSRFFR:GSSRFFRO)
     FGSSTRFOLD O  A E             DISK    USROPN
     F                                     RENAME(GSSTRFR:GSSTRFRO)
N02  FGSSTUROLD O  A E             DISK    USROPN
N02  F                                     RENAME(GSSTURR:GSSTURRO)
     FHEADFOLD  O  A E             DISK
     F                                     RENAME(HEADFR:HEADFRO)
N02  FHEBRELEOLDO  A E             DISK    USROPN
N02  F                                     RENAME(HEBRELER:HEBRRO)
     FHESTEDOLD O  A E             DISK    USROPN
     F                                     RENAME(HESTEDR:HESTEDRO)
     FHETRIUOLD O  A E             DISK    USROPN
     F                                     RENAME(HETRIUR:HETRIURO)
     FHUBOFOLD  O  A E             DISK    USROPN
     F                                     RENAME(HUBOR:HUBORO)
     FISOFOLD   O  A E             DISK    USROPN
     F                                     RENAME(ISOFR:ISOFRO)
     FISOLFOLD  O  A E             DISK    USROPN
     F                                     RENAME(ISOLFR:ISOLFRO)
     FISOSAKFOLDO  A E             DISK    USROPN
     F                                     RENAME(ISOSAKFR:ISOSAKFRO)
     FKOSBUOLD  O  A E             DISK    USROPN
     F                                     RENAME(KOSBUR:KOSBURO)
     FMCAWFOLD  O  A E             DISK    USROPN
     F                                     RENAME(MCAWR:MCAWRO)
N02  FOMDIOLD   O  A E             DISK    USROPN
N02  F                                     RENAME(OMDIR:OMDIRO)
     FPALLDOLD  O  A E             DISK    USROPN
     F                                     RENAME(PALLDR:PALLDRO)
N02  FRUCKPOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(RUCKPR:RUCKPRO)
N02  FRUCKPUOLD O  A E             DISK    USROPN
N02  F                                     RENAME(RUCKPUR:RUCKPURO)
     FSAMLOLD   O  A E             DISK    USROPN
     F                                     RENAME(SAMLR:SAMLRO)
N02  FSKPOSOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(SKPOSR:SKPOSRO)
N02  F                                     PREFIX(SK_)
     FSTSCLIOLD O  A E             DISK    USROPN
     F                                     RENAME(STSCLIR:STSCLIRO)
     FSTSFBROLD O  A E             DISK    USROPN
     F                                     RENAME(STSFBRR:STSFBRRO)
     FSTSOPDOLD O  A E             DISK    USROPN
     F                                     RENAME(STSOPDR:STSOPDRO)
N02  FTKSGMOLD  O  A E             DISK    USROPN
N02  F                                     RENAME(TKSGMR:TKSGMRO)
     FTRACKFOLD O  A E             DISK    USROPN
     F                                     RENAME(TRACKFR:TRACKFRO)
N02  FTRACKKOLD O  A E             DISK    USROPN
N02  F                                     RENAME(TRACKKR:TRACKKRO)
     FTRACKTOLD O  A E             DISK    USROPN
     F                                     RENAME(TRACKTR:TRACKTRO)
     FUTLLOGFOLDO  A E             DISK    USROPN
     F                                     RENAME(UTLLOGR:UTLLOGRO)
N02  FVARELIOLD O  A E             DISK    USROPN
N02  F                                     RENAME(VARELIR:VARELIRO)
N02  FXMLINH1OLDO  A E             DISK    USROPN
N02  F                                     RENAME(XMLINHR:XMLINHRO)
     FREOPDAFM  CF   E             WORKSTN MAXDEV(*FILE)
     F                                     INFDS(FEEDBK)
      *
     D FEEDBK          DS
     D  STATUS           *STATUS
     D                 DS
     D  YDT                    1      8  0
     D  YDTÅ                   1      4  0
     D  YDTM                   5      6  0
     D  YDTD                   7      8  0
     D                 DS
     D  HESAML                 1      6
     D  YSD                    1      3
     D  XLNR1                  4      4
     D  XLNR2                  5      5
     D  XLNR3                  6      6
     D  XLNR                   4      6
     D                UDS
     D  UFIRM                  1      2
     D  DT                   101    106  0
     D  UIND26               107    107
     D  UIND27               108    108
     D  UIND28               109    109
     D  UIND29               110    110
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE
     C                   EXSR      KDTFMT
     C   03              MOVE      *ZEROS        YDT
     C   03              GOTO      SLUTT
      * TEST DATO
     C                   MOVE      WSDT          XMMÅÅ             4 0
     C                   MOVE      XMMÅÅ         UÅÅ               2 0
     C                   MOVEL     XMMÅÅ         UMM               2 0
     C                   MOVEL     WSDT          UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      99
     C   99
     CORN05              GOTO      START
      *
     C                   SETON                                        98
      * VIS MELDINGSBILDE OM FLYTTING ER I GANG.
     C                   EXSR      KDTFMT
     C                   TIME                    WSTDST
     C                   READ      REOPDAFM                             3333
     C                   WRITE     BILDE
     C                   READ      REOPDAFM                             3333
     C                   EXSR      KDTFMT
      *
     C                   EXSR      OPENFILES
     C                   EXSR      DLORDRE
     C                   EXSR      CLOSEFILES
      *
     C     SLUTT         TAG
     C                   MOVE      YDT           DT
     C                   MOVE      *IN(26)       UIND26
     C                   MOVE      *IN(27)       UIND27
     C                   MOVE      *IN(28)       UIND28
     C                   MOVE      *IN(29)       UIND29
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     OPENFILES     BEGSR
     C***********************************************
     C                   OPEN      AMDE
     C                   READ(N)   AMDE                                   33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAMDE             1
     C                   OPEN      AMDEOLD
     C                   ELSE
     C                   CLOSE     AMDE
     C                   END
      *
     C                   OPEN      AMGE
     C                   READ(N)   AMGE                                   33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAMGE             1
     C                   OPEN      AMGEOLD
     C                   ELSE
     C                   CLOSE     AMGE
     C                   END
      *
     C                   OPEN      AMHE
     C                   READ(N)   AMHE                                   33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAMHE             1
     C                   OPEN      AMHEOLD
     C                   ELSE
     C                   CLOSE     AMHE
     C                   END
      *
     C                   OPEN      AMSAML1
     C                   READ(N)   AMSAML1                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAMSAML1          1
     C                   OPEN      AMSAMLOLD
     C                   ELSE
     C                   CLOSE     AMSAML1
     C                   END
N01   *
N01  C                   OPEN      ARKIVL02
N01  C                   READ(N)   ARKIVL02                               33
N01  C                   IF        *IN(33) = *OFF
N01  C                   MOVE      'Y'           XARKIV            1
N01  C                   OPEN      ARKIVOLD
N01  C                   ELSE
N01  C                   CLOSE     ARKIVL02
N01  C                   END
N02   *
N02  C                   OPEN      ARKLOGH4
N02  C                   READ(N)   ARKLOGH4                               33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XARKLOG           1
N02  C                   OPEN      ARKLOGD
N02  C                   OPEN      ARKLOHOLD
N02  C                   OPEN      ARKLODOLD
N02  C                   ELSE
N02  C                   CLOSE     ARKLOGH4
N02  C                   END
      *
      *
     C                   OPEN      AVSLUTF
     C                   READ(N)   AVSLUTF                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAVSLUTF          1
     C                   OPEN      AVSLUTOLD
     C                   ELSE
     C                   CLOSE     AVSLUTF
     C                   END
      *
     C                   OPEN      AVSLUTGF
     C                   READ(N)   AVSLUTGF                               33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XAVSLUTGF         1
     C                   OPEN      AVSLUGOLD
     C                   ELSE
     C                   CLOSE     AVSLUTGF
     C                   END
      *
     C                   OPEN      BILLOF
     C                   READ(N)   BILLOF                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XBILLOF           1
N02  C                   OPEN      BILLOFOS
     C                   OPEN      BLADRT
     C                   OPEN      BLLOK
     C                   OPEN      BLVSD2
     C                   OPEN      BLV1
N02  C                   OPEN      BLV1GATE
     C                   OPEN      BLV2
N02  C                   OPEN      CCBLV1
N02  C                   OPEN      CCBLV2
     C                   OPEN      BOOKING
     C                   OPEN      BOOKIN2
     C                   OPEN      BILLOFOLD
N02  C                   OPEN      BILLOSOLD
     C                   OPEN      BLADRTOLD
     C                   OPEN      BLLOKOLD
     C                   OPEN      BLVSD2OLD
     C                   OPEN      BLV1OLD
N02  C                   OPEN      BLV1GTOLD
     C                   OPEN      BLV2OLD
N02  C                   OPEN      CCBLV1OLD
N02  C                   OPEN      CCBLV2OLD
     C                   OPEN      BOOKINGOLD
     C                   OPEN      BOOKIN2OLD
     C                   ELSE
     C                   CLOSE     BILLOF
     C                   END
N02   *
N02  C                   OPEN      CARGOF3
N02  C                   READ(N)   CARGOF3                                33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XCARGOF           1
N02  C                   OPEN      CARGOFOLD
N02  C                   ELSE
N02  C                   CLOSE     CARGOF3
N02  C                   END
N02   *
N02  C                   OPEN      CARGOO
N02  C                   READ(N)   CARGOO                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XCARGOO           1
N02  C                   OPEN      CARGOOOLD
N02  C                   ELSE
N02  C                   CLOSE     CARGOO
N02  C                   END
      *
     C                   OPEN      DIMM
     C                   READ(N)   DIMM                                   33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDIMM             1
     C                   OPEN      DIMMOLD
     C                   ELSE
     C                   CLOSE     DIMM
     C                   END
      *
     C                   OPEN      DISP
     C                   READ(N)   DISP                                   33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDISP             1
     C                   OPEN      DISPOLD
     C                   ELSE
     C                   CLOSE     DISP
     C                   END
      *
     C                   OPEN      DOKEB
     C                   READ(N)   DOKEB                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEB            1
     C                   OPEN      DOKEBOLD
     C                   ELSE
     C                   CLOSE     DOKEB
     C                   END
      *
     C                   OPEN      DOKEC
     C                   READ(N)   DOKEC                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEC            1
     C                   OPEN      DOKECOLD
     C                   ELSE
     C                   CLOSE     DOKEC
     C                   END
      *
     C                   OPEN      DOKECE
     C                   READ(N)   DOKECE                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKECE           1
     C                   OPEN      DOKECEOLD
     C                   ELSE
     C                   CLOSE     DOKECE
     C                   END
      *
     C                   OPEN      DOKECEL
     C                   READ(N)   DOKECEL                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKECEL          1
     C                   OPEN      DOKECELOLD
     C                   ELSE
     C                   CLOSE     DOKECEL
     C                   END
      *
     C                   OPEN      DOKECET
     C                   READ(N)   DOKECET                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKECET          1
     C                   OPEN      DOKECETOLD
     C                   ELSE
     C                   CLOSE     DOKECET
     C                   END
      *
     C                   OPEN      DOKEF
     C                   READ(N)   DOKEF                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEF            1
     C                   OPEN      DOKEFOLD
     C                   ELSE
     C                   CLOSE     DOKEF
     C                   END
      *
     C                   OPEN      DOKEFIM
     C                   READ(N)   DOKEFIM                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEFIM          1
     C                   OPEN      DOKEFIMOLD
     C                   ELSE
     C                   CLOSE     DOKEFIM
     C                   END
      *
     C                   OPEN      DOKEM
     C                   READ(N)   DOKEM                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEM            1
     C                   OPEN      DOKEMOLD
     C                   ELSE
     C                   CLOSE     DOKEM
     C                   END
      *
     C                   OPEN      DOKEQ
     C                   READ(N)   DOKEQ                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKEQ            1
     C                   OPEN      DOKEQOLD
     C                   ELSE
     C                   CLOSE     DOKEQ
     C                   END
      *
     C                   OPEN      DOKEQM
     C                   READ(N)   DOKEQM                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKQM            1
     C                   OPEN      DOKEQMOLD
     C                   ELSE
     C                   CLOSE     DOKEQM
     C                   END
      *
     C                   OPEN      DOKOTH
     C                   READ(N)   DOKOTH                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKOTH           1
     C                   OPEN      DOKOTHOLD
     C                   ELSE
     C                   CLOSE     DOKOTH
     C                   END
      *
     C                   OPEN      DOKOTHM1
     C                   READ(N)   DOKOTHM1                               33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKOTHM1         1
     C                   OPEN      DOKOTHMOLD
     C                   ELSE
     C                   CLOSE     DOKOTHM1
     C                   END
      *
     C                   OPEN      DOKUF
     C                   READ(N)   DOKUF                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUF            1
     C                   OPEN      DOKUFOLD
     C                   ELSE
     C                   CLOSE     DOKUF
     C                   END
      *
     C                   OPEN      DOKUFM
     C                   READ(N)   DOKUFM                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUFM           1
     C                   OPEN      DOKUFMOLD
     C                   ELSE
     C                   CLOSE     DOKUFM
     C                   END
      *
     C                   OPEN      DOKUFV
     C                   READ(N)   DOKUFV                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUFV           1
     C                   OPEN      DOKUFVOLD
     C                   ELSE
     C                   CLOSE     DOKUFV
     C                   END
      *
     C                   OPEN      DOKUDGS
     C                   READ(N)   DOKUDGS                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUDG           1
     C                   OPEN      DOKUDOLD
     C                   ELSE
     C                   CLOSE     DOKUDGS
     C                   END
      *
     C                   OPEN      DOKUI
     C                   READ(N)   DOKUI                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUI            1
     C                   OPEN      DOKUIOLD
     C                   ELSE
     C                   CLOSE     DOKUI
     C                   END
N02   *
N02  C                   OPEN      DOKULG
N02  C                   READ(N)   DOKULG                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XDOKULG           1
N02  C                   OPEN      DOKULGOLD
N02  C                   ELSE
N02  C                   CLOSE     DOKULG
N02  C                   END
      *
     C                   OPEN      DOKUM
     C                   READ(N)   DOKUM                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUM            1
     C                   OPEN      DOKUMOLD
     C                   ELSE
     C                   CLOSE     DOKUM
     C                   END
      *
     C                   OPEN      DOKUT
     C                   READ(N)   DOKUT                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOKUT            1
     C                   OPEN      DOKUTOLD
     C                   ELSE
     C                   CLOSE     DOKUT
     C                   END
      *
     C                   OPEN      DOK29
     C                   READ(N)   DOK29                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOK29            1
     C                   OPEN      DOK29OLD
     C                   ELSE
     C                   CLOSE     DOK29
     C                   END
      *
     C                   OPEN      DOK36
     C                   READ(N)   DOK36                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XDOK36            1
     C                   OPEN      DOK36OLD
     C                   ELSE
     C                   CLOSE     DOK36
     C                   END
N02   *
N02  C                   OPEN      DOLAL01
N02  C                   READ(N)   DOLAL01                                33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XDOLAF            1
N02  C                   OPEN      DOLAFOLD
N02  C                   ELSE
N02  C                   CLOSE     DOLAL01
N02  C                   END
N02   *
N02  C                   OPEN      EDICS2
N02  C                   READ(N)   EDICS2                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XEDICS            1
N02  C                   OPEN      EDICSOLD
N02  C                   ELSE
N02  C                   CLOSE     EDICS2
N02  C                   END
N02   *
N02  C                   OPEN      ENADSF
N02  C                   READ(N)   ENADSF                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XENADSF           1
N02  C                   OPEN      ENADSFOLD
N02  C                   ELSE
N02  C                   CLOSE     ENADSF
N02  C                   END
N02   *
N02  C                   OPEN      EPOH
N02  C                   READ(N)   EPOH                                   33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XEPOH             1
N02  C                   OPEN      EPOH02
N02  C                   OPEN      EPOHOLD
N02  C                   OPEN      EPOL
N02  C                   OPEN      EPOL02
N02  C                   OPEN      EPOLOLD
N02  C                   OPEN      EPOPOS
N02  C                   OPEN      EPOPOSOLD
N02  C                   ELSE
N02  C                   CLOSE     EPOH
N02  C                   END
N02   *
N02  C                   OPEN      ESOSF1
N02  C                   READ(N)   ESOSF1                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XESOSF1           1
N02  C                   OPEN      ESOSF1OLD
N02  C                   ELSE
N02  C                   CLOSE     ESOSF1
N02  C                   END
N02   *
N02  C                   OPEN      ESOSF2
N02  C                   READ(N)   ESOSF2                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XESOSF2           1
N02  C                   OPEN      ESOSF2OLD
N02  C                   ELSE
N02  C                   CLOSE     ESOSF2
N02  C                   END
N02   *
N02  C                   OPEN      ESOSF3
N02  C                   READ(N)   ESOSF3                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XESOSF3           1
N02  C                   OPEN      ESOSF3OLD
N02  C                   ELSE
N02  C                   CLOSE     ESOSF3
N02  C                   END
N02   *
N02  C                   OPEN      E171F
N02  C                   READ(N)   E171F                                  33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XE171F            1
N02  C                   OPEN      E171FOLD
N02  C                   ELSE
N02  C                   CLOSE     E171F
N02  C                   END
N02   *
N02  C                   OPEN      E307F
N02  C                   READ(N)   E307F                                  33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XE307F            1
N02  C                   OPEN      E307FOLD
N02  C                   ELSE
N02  C                   CLOSE     E307F
N02  C                   END
N02   *
N02  C                   OPEN      FAKTXT
N02  C                   READ(N)   FAKTXT                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XFAKTXT           1
N02  C                   OPEN      FAKTXTOLD
N02  C                   ELSE
N02  C                   CLOSE     FAKTXT
N02  C                   END
N02   *
N02  C                   OPEN      FAXLOG03
N02  C                   READ(N)   FAXLOG03                               33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XFAXLOG           1
N02  C                   OPEN      FAXLOGOLD
N02  C                   ELSE
N02  C                   CLOSE     FAXLOG03
N02  C                   END
      *
     C                   OPEN      FORDEL
     C                   READ(N)   FORDEL                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFORDEL           1
     C                   OPEN      FORDELOLD
     C                   ELSE
     C                   CLOSE     FORDEL
     C                   END
      *
     C                   OPEN      FREETXT
     C                   READ(N)   FREETXT                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFREETXT          1
     C                   OPEN      FREETXTOLD
     C                   ELSE
     C                   CLOSE     FREETXT
     C                   END
      *
     C                   OPEN      FRISOK
     C                   READ(N)   FRISOK                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFRISOK           1
     C                   OPEN      FRISOKOLD
     C                   ELSE
     C                   CLOSE     FRISOK
     C                   END
      *
     C                   OPEN      FRMDOC
     C                   READ(N)   FRMDOC                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFRMDOC           1
     C                   OPEN      FRMDOCOLD
     C                   ELSE
     C                   CLOSE     FRMDOC
     C                   END
      *
     C                   OPEN      FRMDOC1
     C                   READ(N)   FRMDOC1                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFRMDOC1          1
     C                   OPEN      FRMDOC1OLD
     C                   ELSE
     C                   CLOSE     FRMDOC1
     C                   END
      *
     C                   OPEN      FRMDOC2
     C                   READ(N)   FRMDOC2                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFRMDOC2          1
     C                   OPEN      FRMDOC2OLD
     C                   ELSE
     C                   CLOSE     FRMDOC2
     C                   END
      *
     C                   OPEN      FRMDOC3
     C                   READ(N)   FRMDOC3                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XFRMDOC3          1
     C                   OPEN      FRMDOC3OLD
     C                   ELSE
     C                   CLOSE     FRMDOC3
     C                   END
N02   *
N02  C                   OPEN      FPXREF
N02  C                   READ(N)   FPXREF                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XFPXREF           1
N02  C                   OPEN      FPXREFOLD
N02  C                   ELSE
N02  C                   CLOSE     FPXREF
N02  C                   END
      *
     C                   OPEN      GSSORL21
     C                   READ(N)   GSSORL21                               33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XGSSORL21         1
     C                   OPEN      GSSAKF
     C                   OPEN      GSSFGF
     C                   OPEN      GSSGDF
     C                   OPEN      GSSKAF
     C                   OPEN      GSSLGL01
     C                   OPEN      GSSOLL01
     C                   OPEN      GSSOVF
     C                   OPEN      GSSOWL01
     C                   OPEN      GSSPAF
     C                   OPEN      GSSPOF
     C                   OPEN      GSSRFF
     C                   OPEN      GSSTRF
N02  C                   OPEN      GSSTUR
     C                   OPEN      GSSAKFOLD
     C                   OPEN      GSSFGFOLD
     C                   OPEN      GSSGDFOLD
     C                   OPEN      GSSKAFOLD
     C                   OPEN      GSSLGFOLD
     C                   OPEN      GSSOLFOLD
     C                   OPEN      GSSORFOLD
     C                   OPEN      GSSRFFOLD
     C                   OPEN      GSSOVFOLD
     C                   OPEN      GSSOWFOLD
     C                   OPEN      GSSPAFOLD
     C                   OPEN      GSSPOFOLD
     C                   OPEN      GSSTRFOLD
N02  C                   OPEN      GSSTUROLD
     C                   ELSE
     C                   CLOSE     GSSORL21
     C                   END
N02   *
N02  C                   OPEN      HEBRELE
N02  C                   READ(N)   HEBRELE                                33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XHEBRELE          1
N02  C                   OPEN      HEBRELEOLD
N02  C                   ELSE
N02  C                   CLOSE     HEBRELE
N02  C                   END
      *
     C                   OPEN      HESTED
     C                   READ(N)   HESTED                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XHESTED           1
     C                   OPEN      HESTEDOLD
     C                   ELSE
     C                   CLOSE     HESTED
     C                   END
      *
     C                   OPEN      HETRIU
     C                   READ(N)   HETRIU                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XHETRIU           1
     C                   OPEN      HETRIUOLD
     C                   ELSE
     C                   CLOSE     HETRIU
     C                   END
      *
     C                   OPEN      HUBOL02
     C                   READ(N)   HUBOL02                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XHUBOL02          1
     C                   OPEN      HUBOFOLD
     C                   ELSE
     C                   CLOSE     HUBOL02
     C                   END
      *
     C                   OPEN      ISOFL1
     C                   READ(N)   ISOFL1                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XISOFL1           1
     C                   OPEN      ISOFOLD
     C                   OPEN      ISOLFL1
     C                   OPEN      ISOLFOLD
     C                   ELSE
     C                   CLOSE     ISOFL1
     C                   END
      *
     C                   OPEN      ISOSAKF
     C                   READ(N)   ISOSAKF                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XISOSAKF          1
     C                   OPEN      ISOSAKFOLD
     C                   ELSE
     C                   CLOSE     ISOSAKF
     C                   END
      *
     C                   OPEN      KOSBU12
     C                   READ(N)   KOSBU12                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XKOSBU12          1
     C                   OPEN      KOSBUOLD
     C                   ELSE
     C                   CLOSE     KOSBU12
     C                   END
      *
     C                   OPEN      MCAWF
     C                   READ(N)   MCAWF                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XMCAWF            1
     C                   OPEN      MCAWFOLD
     C                   ELSE
     C                   CLOSE     MCAWF
     C                   END
N02   *
N02  C                   OPEN      OMDI
N02  C                   READ(N)   OMDI                                   33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XOMDI             1
N02  C                   OPEN      OMDIOLD
N02  C                   ELSE
N02  C                   CLOSE     OMDI
N02  C                   END
N02   *
N02  C                   OPEN      RUCKP
N02  C                   READ(N)   RUCKP                                  33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XRUCKP            1
N02  C                   OPEN      RUCKPOLD
N02  C                   ELSE
N02  C                   CLOSE     RUCKP
N02  C                   END
N02   *
N02  C                   OPEN      RUCKPU
N02  C                   READ(N)   RUCKPU                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XRUCKPU           1
N02  C                   OPEN      RUCKPUOLD
N02  C                   ELSE
N02  C                   CLOSE     RUCKPU
N02  C                   END
      *
     C                   OPEN      PALLDL99
     C                   READ(N)   PALLDL99                               33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XPALLDL99         1
     C                   OPEN      PALLDOLD
     C                   ELSE
     C                   CLOSE     PALLDL99
     C                   END
      *
     C                   OPEN      SAML1
     C                   READ(N)   SAML1                                  33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XSAML1            1
     C                   OPEN      SAMLOLD
     C                   ELSE
     C                   CLOSE     SAML1
     C                   END
N02   *
N02  C                   OPEN      SKPOS
N02  C                   READ(N)   SKPOS                                  33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XSKPOS            1
N02  C                   OPEN      SKPOSOLD
N02  C                   ELSE
N02  C                   CLOSE     SKPOS
N02  C                   END
      *
     C                   OPEN      STSOPD1
     C                   READ(N)   STSOPD1                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XSTSOPD1          1
     C                   OPEN      STSOPDOLD
     C                   OPEN      STSCLI
     C                   OPEN      STSCLIOLD
     C                   OPEN      STSFBR
     C                   OPEN      STSFBROLD
     C                   ELSE
     C                   CLOSE     STSOPD1
     C                   END
N02   *
N02  C                   OPEN      TKSGML1
N02  C                   READ(N)   TKSGML1                                33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XTKSGM            1
N02  C                   OPEN      TKSGMOLD
N02  C                   ELSE
N02  C                   CLOSE     TKSGML1
N02  C                   END
      *
     C                   OPEN      TRACKF
     C                   READ(N)   TRACKF                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XTRACKF           1
     C                   OPEN      TRACKFOLD
     C                   ELSE
     C                   CLOSE     TRACKF
     C                   END
N02   *
N02  C                   OPEN      TRACKK02
N02  C                   READ(N)   TRACKK02                               33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XTRACKK           1
N02  C                   OPEN      TRACKKOLD
N02  C                   ELSE
N02  C                   CLOSE     TRACKK02
N02  C                   END
      *
     C                   OPEN      TRACKT
     C                   READ(N)   TRACKT                                 33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XTRACKT           1
     C                   OPEN      TRACKTOLD
     C                   ELSE
     C                   CLOSE     TRACKT
     C                   END
      *
     C                   OPEN      UTLLOGF
     C                   READ(N)   UTLLOGF                                33
     C                   IF        *IN(33) = *OFF
     C                   MOVE      'Y'           XUTLLOGF          1
     C                   OPEN      UTLLOGFOLD
     C                   ELSE
     C                   CLOSE     UTLLOGF
     C                   END
N02   *
N02  C                   OPEN      VARELI
N02  C                   READ(N)   VARELI                                 33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XVARELI           1
N02  C                   OPEN      VARELIOLD
N02  C                   ELSE
N02  C                   CLOSE     VARELI
N02  C                   END
N02   *
N02  C                   OPEN      XMLINHL1
N02  C                   READ(N)   XMLINHL1                               33
N02  C                   IF        *IN(33) = *OFF
N02  C                   MOVE      'Y'           XXMLINH           1
N02  C                   OPEN      XMLINH1OLD
N02  C                   ELSE
N02  C                   CLOSE     XMLINHL1
N02  C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     CLOSEFILES    BEGSR
     C***********************************************
     C                   IF        XAMDE = 'Y'
     C                   CLOSE     AMDEOLD
     C                   CLOSE     AMDE
     C                   END
      *
     C                   IF        XAMGE = 'Y'
     C                   CLOSE     AMGEOLD
     C                   CLOSE     AMGE
     C                   END
      *
     C                   IF        XAMHE = 'Y'
     C                   CLOSE     AMHEOLD
     C                   CLOSE     AMHE
     C                   END
      *
     C                   IF        XAMSAML1 = 'Y'
     C                   CLOSE     AMSAMLOLD
     C                   CLOSE     AMSAML1
     C                   END
N01   *
N01  C                   IF        XARKIV = 'Y'
N01  C                   CLOSE     ARKIVL02
N01  C                   CLOSE     ARKIVOLD
N01  C                   END
N02   *
N02  C                   IF        XARKLOG = 'Y'
N02  C                   CLOSE     ARKLOGH4
N02  C                   CLOSE     ARKLOGD
N02  C                   CLOSE     ARKLOHOLD
N02  C                   CLOSE     ARKLODOLD
N02  C                   END
      *
      *
     C                   IF        XAVSLUTF = 'Y'
     C                   CLOSE     AVSLUTOLD
     C                   CLOSE     AVSLUTF
     C                   END
      *
     C                   IF        XAVSLUTGF = 'Y'
     C                   CLOSE     AVSLUGOLD
     C                   CLOSE     AVSLUTGF
     C                   END
      *
     C                   IF        XBILLOF = 'Y'
     C                   CLOSE     BILLOFOLD
N02  C                   CLOSE     BILLOSOLD
     C                   CLOSE     BLADRTOLD
     C                   CLOSE     BLLOKOLD
     C                   CLOSE     BLVSD2OLD
     C                   CLOSE     BLV1OLD
N02  C                   CLOSE     BLV1GTOLD
     C                   CLOSE     BLV2OLD
N02  C                   CLOSE     CCBLV1OLD
N02  C                   CLOSE     CCBLV2OLD
     C                   CLOSE     BOOKINGOLD
     C                   CLOSE     BOOKIN2OLD
     C                   CLOSE     BILLOF
N02  C                   CLOSE     BILLOFOS
     C                   CLOSE     BLADRT
     C                   CLOSE     BLLOK
     C                   CLOSE     BLVSD2
     C                   CLOSE     BLV1
N02  C                   CLOSE     BLV1GATE
     C                   CLOSE     BLV2
N02  C                   CLOSE     CCBLV1
N02  C                   CLOSE     CCBLV2
     C                   CLOSE     BOOKING
     C                   CLOSE     BOOKIN2
     C                   END
N02   *
N02  C                   IF        XCARGOF = 'Y'
N02  C                   CLOSE     CARGOFOLD
N02  C                   CLOSE     CARGOF3
N02  C                   END
N02   *
N02  C                   IF        XCARGOO = 'Y'
N02  C                   CLOSE     CARGOOOLD
N02  C                   CLOSE     CARGOO
N02  C                   END
      *
     C                   IF        XDIMM = 'Y'
     C                   CLOSE     DIMMOLD
     C                   CLOSE     DIMM
     C                   END
      *
     C                   IF        XDISP = 'Y'
     C                   CLOSE     DISPOLD
     C                   CLOSE     DISP
     C                   END
      *
     C                   IF        XDOKEB = 'Y'
     C                   CLOSE     DOKEBOLD
     C                   CLOSE     DOKEB
     C                   END
      *
     C                   IF        XDOKEC = 'Y'
     C                   CLOSE     DOKECOLD
     C                   CLOSE     DOKEC
     C                   END
      *
     C                   IF        XDOKECE = 'Y'
     C                   CLOSE     DOKECEOLD
     C                   CLOSE     DOKECE
     C                   END
      *
     C                   IF        XDOKECEL = 'Y'
     C                   CLOSE     DOKECELOLD
     C                   CLOSE     DOKECEL
     C                   END
      *
     C                   IF        XDOKECET = 'Y'
     C                   CLOSE     DOKECETOLD
     C                   CLOSE     DOKECET
     C                   END
      *
     C                   IF        XDOKEF = 'Y'
     C                   CLOSE     DOKEFOLD
     C                   CLOSE     DOKEF
     C                   END
      *
     C                   IF        XDOKEFIM = 'Y'
     C                   CLOSE     DOKEFIMOLD
     C                   CLOSE     DOKEFIM
     C                   END
      *
     C                   IF        XDOKEM = 'Y'
     C                   CLOSE     DOKEMOLD
     C                   CLOSE     DOKEM
     C                   END
      *
     C                   IF        XDOKQM = 'Y'
     C                   CLOSE     DOKEQMOLD
     C                   CLOSE     DOKEQM
     C                   END
      *
     C                   IF        XDOKEQ = 'Y'
     C                   CLOSE     DOKEQOLD
     C                   CLOSE     DOKEQ
     C                   END
      *
     C                   IF        XDOKOTH = 'Y'
     C                   CLOSE     DOKOTHOLD
     C                   CLOSE     DOKOTH
     C                   END
      *
     C                   IF        XDOKOTHM1 = 'Y'
     C                   CLOSE     DOKOTHMOLD
     C                   CLOSE     DOKOTHM1
     C                   END
      *
     C                   IF        XDOKUF = 'Y'
     C                   CLOSE     DOKUFOLD
     C                   CLOSE     DOKUF
     C                   END
      *
     C                   IF        XDOKUFM = 'Y'
     C                   CLOSE     DOKUFMOLD
     C                   CLOSE     DOKUFM
     C                   END
      *
     C                   IF        XDOKUFV = 'Y'
     C                   CLOSE     DOKUFVOLD
     C                   CLOSE     DOKUFV
     C                   END
      *
     C                   IF        XDOKUDG = 'Y'
     C                   CLOSE     DOKUDOLD
     C                   CLOSE     DOKUDGS
     C                   END
      *
     C                   IF        XDOKUI = 'Y'
     C                   CLOSE     DOKUIOLD
     C                   CLOSE     DOKUI
     C                   END
N02   *
N02  C                   IF        XDOKULG = 'Y'
N02  C                   CLOSE     DOKULGOLD
N02  C                   CLOSE     DOKULG
N02  C                   END
      *
     C                   IF        XDOKUM = 'Y'
     C                   CLOSE     DOKUMOLD
     C                   CLOSE     DOKUM
     C                   END
      *
     C                   IF        XDOKUT = 'Y'
     C                   CLOSE     DOKUTOLD
     C                   CLOSE     DOKUT
     C                   END
      *
     C                   IF        XDOK29 = 'Y'
     C                   CLOSE     DOK29OLD
     C                   CLOSE     DOK29
     C                   END
      *
     C                   IF        XDOK36 = 'Y'
     C                   CLOSE     DOK36OLD
     C                   CLOSE     DOK36
     C                   END
N02   *
N02  C                   IF        XDOLAF = 'Y'
N02  C                   CLOSE     DOLAFOLD
N02  C                   CLOSE     DOLAL01
N02  C                   END
N02   *
N02  C                   IF        XEDICS = 'Y'
N02  C                   CLOSE     EDICSOLD
N02  C                   CLOSE     EDICS2
N02  C                   END
N02   *
N02  C                   IF        XENADSF = 'Y'
N02  C                   CLOSE     ENADSFOLD
N02  C                   CLOSE     ENADSF
N02  C                   END
N02   *
N02  C                   IF        XEPOH = 'Y'
N02  C                   CLOSE     EPOPOSOLD
N02  C                   CLOSE     EPOPOS
N02  C                   CLOSE     EPOHOLD
N02  C                   CLOSE     EPOH02
N02  C                   CLOSE     EPOH
N02  C                   CLOSE     EPOLOLD
N02  C                   CLOSE     EPOL02
N02  C                   CLOSE     EPOL
N02  C                   END
N02   *
N02  C                   IF        XESOSF1 = 'Y'
N02  C                   CLOSE     ESOSF1OLD
N02  C                   CLOSE     ESOSF1
N02  C                   END
N02   *
N02  C                   IF        XESOSF2 = 'Y'
N02  C                   CLOSE     ESOSF2OLD
N02  C                   CLOSE     ESOSF2
N02  C                   END
N02   *
N02  C                   IF        XESOSF3 = 'Y'
N02  C                   CLOSE     ESOSF3OLD
N02  C                   CLOSE     ESOSF3
N02  C                   END
N02   *
N02  C                   IF        XE171F = 'Y'
N02  C                   CLOSE     E171FOLD
N02  C                   CLOSE     E171F
N02  C                   END
N02   *
N02  C                   IF        XE307F = 'Y'
N02  C                   CLOSE     E307FOLD
N02  C                   CLOSE     E307F
N02  C                   END
N02   *
N02  C                   IF        XFAKTXT = 'Y'
N02  C                   CLOSE     FAKTXTOLD
N02  C                   CLOSE     FAKTXT
N02  C                   END
N02   *
N02  C                   IF        XFAXLOG = 'Y'
N02  C                   CLOSE     FAXLOGOLD
N02  C                   CLOSE     FAXLOG03
N02  C                   END
      *
     C                   IF        XFORDEL = 'Y'
     C                   CLOSE     FORDELOLD
     C                   CLOSE     FORDEL
     C                   END
      *
     C                   IF        XFREETXT = 'Y'
     C                   CLOSE     FREETXTOLD
     C                   CLOSE     FREETXT
     C                   END
      *
     C                   IF        XFRISOK = 'Y'
     C                   CLOSE     FRISOKOLD
     C                   CLOSE     FRISOK
     C                   END
      *
     C                   IF        XFRMDOC = 'Y'
     C                   CLOSE     FRMDOCOLD
     C                   CLOSE     FRMDOC
     C                   END
      *
     C                   IF        XFRMDOC1 = 'Y'
     C                   CLOSE     FRMDOC1OLD
     C                   CLOSE     FRMDOC1
     C                   END
      *
     C                   IF        XFRMDOC2 = 'Y'
     C                   CLOSE     FRMDOC2OLD
     C                   CLOSE     FRMDOC2
     C                   END
      *
     C                   IF        XFRMDOC3 = 'Y'
     C                   CLOSE     FRMDOC3OLD
     C                   CLOSE     FRMDOC3
     C                   END
N02   *
N02  C                   IF        XFPXREF = 'Y'
N02  C                   CLOSE     FPXREFOLD
N02  C                   CLOSE     FPXREF
N02  C                   END
      *
     C                   IF        XGSSORL21 = 'Y'
     C                   CLOSE     GSSAKFOLD
     C                   CLOSE     GSSFGFOLD
     C                   CLOSE     GSSGDFOLD
     C                   CLOSE     GSSKAFOLD
     C                   CLOSE     GSSLGFOLD
     C                   CLOSE     GSSOLFOLD
     C                   CLOSE     GSSORFOLD
     C                   CLOSE     GSSOVFOLD
     C                   CLOSE     GSSOWFOLD
     C                   CLOSE     GSSPAFOLD
     C                   CLOSE     GSSPOFOLD
     C                   CLOSE     GSSRFFOLD
     C                   CLOSE     GSSTRFOLD
N02  C                   CLOSE     GSSTUROLD
     C                   CLOSE     GSSORL21
     C                   CLOSE     GSSAKF
     C                   CLOSE     GSSFGF
     C                   CLOSE     GSSGDF
     C                   CLOSE     GSSKAF
     C                   CLOSE     GSSLGL01
     C                   CLOSE     GSSOLL01
     C                   CLOSE     GSSOVF
     C                   CLOSE     GSSOWL01
     C                   CLOSE     GSSPAF
     C                   CLOSE     GSSPOF
     C                   CLOSE     GSSRFF
     C                   CLOSE     GSSTRF
N02  C                   CLOSE     GSSTUR
     C                   END
N02   *
N02  C                   IF        XHEBRELE = 'Y'
N02  C                   CLOSE     HEBRELEOLD
N02  C                   CLOSE     HEBRELE
N02  C                   END
      *
     C                   IF        XHESTED = 'Y'
     C                   CLOSE     HESTEDOLD
     C                   CLOSE     HESTED
     C                   END
      *
     C                   IF        XHETRIU = 'Y'
     C                   CLOSE     HETRIUOLD
     C                   CLOSE     HETRIU
     C                   END
      *
     C                   IF        XHUBOL02 = 'Y'
     C                   CLOSE     HUBOFOLD
     C                   CLOSE     HUBOL02
     C                   END
      *
     C                   IF        XISOFL1 = 'Y'
     C                   CLOSE     ISOLFOLD
     C                   CLOSE     ISOLFL1
     C                   CLOSE     ISOFOLD
     C                   CLOSE     ISOFL1
     C                   END
      *
     C                   IF        XISOSAKF = 'Y'
     C                   CLOSE     ISOSAKFOLD
     C                   CLOSE     ISOSAKF
     C                   END
      *
     C                   IF        XKOSBU12 = 'Y'
     C                   CLOSE     KOSBUOLD
     C                   CLOSE     KOSBU12
     C                   END
      *
     C                   IF        XMCAWF = 'Y'
     C                   CLOSE     MCAWFOLD
     C                   CLOSE     MCAWF
     C                   END
N02   *
N02  C                   IF        XOMDI = 'Y'
N02  C                   CLOSE     OMDIOLD
N02  C                   CLOSE     OMDI
N02  C                   END
N02   *
N02  C                   IF        XRUCKP = 'Y'
N02  C                   CLOSE     RUCKPOLD
N02  C                   CLOSE     RUCKP
N02  C                   END
N02   *
N02  C                   IF        XRUCKPU = 'Y'
N02  C                   CLOSE     RUCKPUOLD
N02  C                   CLOSE     RUCKPU
N02  C                   END
      *
     C                   IF        XPALLDL99 = 'Y'
     C                   CLOSE     PALLDOLD
     C                   CLOSE     PALLDL99
     C                   END
      *
     C                   IF        XSAML1 = 'Y'
     C                   CLOSE     SAMLOLD
     C                   CLOSE     SAML1
     C                   END
N02   *
N02  C                   IF        XSKPOS = 'Y'
N02  C                   CLOSE     SKPOSOLD
N02  C                   CLOSE     SKPOS
N02  C                   END
      *
     C                   IF        XSTSOPD1 = 'Y'
     C                   CLOSE     STSOPDOLD
     C                   CLOSE     STSOPD1
     C                   CLOSE     STSCLIOLD
     C                   CLOSE     STSCLI
     C                   CLOSE     STSFBROLD
     C                   CLOSE     STSFBR
     C                   END
      *
     C                   IF        XTRACKF = 'Y'
     C                   CLOSE     TRACKFOLD
N02  C                   CLOSE     TRACKF
     C                   END
N02   *
N02  C                   IF        XTRACKK = 'Y'
N02  C                   CLOSE     TRACKKOLD
N02  C                   CLOSE     TRACKK02
N02  C                   END
      *
     C                   IF        XTRACKT = 'Y'
     C                   CLOSE     TRACKTOLD
N02  C                   CLOSE     TRACKT
     C                   END
N02   *
N02  C                   IF        XTKSGM = 'Y'
N02  C                   CLOSE     TKSGMOLD
N02  C                   CLOSE     TKSGML1
N02  C                   END
      *
     C                   IF        XUTLLOGF = 'Y'
     C                   CLOSE     UTLLOGFOLD
     C                   CLOSE     UTLLOGF
     C                   END
N02   *
N02  C                   IF        XVARELI = 'Y'
N02  C                   CLOSE     VARELIOLD
N02  C                   CLOSE     VARELI
N02  C                   END
N02   *
N02  C                   IF        XXMLINH = 'Y'
N02  C                   CLOSE     XMLINH1OLD
N02  C                   CLOSE     XMLINHL1
N02  C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     DLORDRE       BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        YDT
     C     YDT           SETLL     HEADD
     C                   MOVE      UDD           YDTD
     C                   MOVE      UMM           YDTM
     C                   MOVE      UÅÅ           YDTÅ
     C                   IF        UÅÅ > 50
     C                   MOVEL     '19'          YDTÅ
     C                   ELSE
     C                   MOVEL     '20'          YDTÅ
     C                   END
     C     STDLORDRE     TAG
     C                   READ      HEADD                                  31
     C  N31HEDTR         COMP      YDT                                31
     C   31              GOTO      SLDLORDRE
      * Mønstreoppdrag skal ikke reorganiseres
     C     HEOPD         CABLT     0             STDLORDRE
      *
     C                   IF        XAMDE = 'Y'
     C     AMETAK        SETLL     AMDE                                   32
     C                   IF        *IN(32)
     C     AMETAK        READE     AMDE                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AMDERO
     C                   DELETE    AMDER
     C     AMETAK        READE     AMDE                                   33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XAMGE = 'Y'
     C     AMETAK        SETLL     AMGE                                   32
     C                   IF        *IN(32)
     C     AMETAK        READE     AMGE                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AMGERO
     C                   DELETE    AMGER
     C     AMETAK        READE     AMGE                                   33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XAMHE = 'Y'
     C     AMETAK        SETLL     AMHE                                   32
     C                   IF        *IN(32)
     C     AMETAK        READE     AMHE                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AMHERO
     C                   DELETE    AMHER
     C     AMETAK        READE     AMHE                                   33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XAMSAML1 = 'Y'
     C     AMSAML1K      SETLL     AMSAML1                                32
     C                   IF        *IN(32)
     C     AMSAML1K      READE     AMSAML1                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AMSAMLRO
     C                   DELETE    AMSAMLR
     C     AMSAML1K      READE     AMSAML1                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N01   *
N01  C                   IF        XARKIV  = 'Y'
N01  C     ARKIVK        SETLL     ARKIVL02                               32
N01  C                   IF        *IN(32)
N01  C     ARKIVK        READE     ARKIVL02                               33
N01  C                   DOW       *IN(33) = *OFF
N01  C                   WRITE     ARKIVRO
N01  C                   DELETE    ARKIVR
N01  C     ARKIVK        READE     ARKIVL02                               33
N01  C                   ENDDO
N01  C                   ENDIF
N01  C                   ENDIF
N02   *
N02  C                   IF        XARKLOG  = 'Y'
N02  C     ORDREK        SETLL     ARKLOGH4                               32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     ARKLOGH4                               33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     ARKLOGHRO
N02  C                   DELETE    ARKLOGHR
N02  C     EPUNIK        SETLL     ARKLOGD
N02  C     EPUNIK        READE     ARKLOGD                                33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     ARKLOGDRO
N02  C                   DELETE    ARKLOGDR
N02  C     EPUNIK        READE     ARKLOGD                                33
N02  C                   ENDDO
N02  C     ORDREK        READE     ARKLOGH4                               33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
      *
     C                   IF        XAVSLUTF = 'Y'
     C     ORDREK        SETLL     AVSLUTF                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     AVSLUTF                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AVSLUTFRO
     C                   DELETE    AVSLUTFR
     C     ORDREK        READE     AVSLUTF                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XAVSLUTGF = 'Y'
     C     ORDREK        SETLL     AVSLUTGF                               32
     C                   IF        *IN(32)
     C     ORDREK        READE     AVSLUTGF                               33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     AVSLUTGRO
     C                   DELETE    AVSLUTGR
     C     ORDREK        READE     AVSLUTGF                               33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XBILLOF = 'Y'
      *
     C     ORDREK        CHAIN     BILLOF                             32
     C                   IF        *IN(32) = *OFF
     C                   WRITE     BILLOFRO
     C                   DELETE    BILLOFR
     C                   ENDIF
N02   *
N02  C     ORDREK        CHAIN     BILLOFOS                           32
N02  C                   IF        *IN(32) = *OFF
N02  C                   WRITE     BLOSRO
N02  C                   DELETE    BLOSR
N02  C                   ENDIF
      *
     C     ORDREK        SETLL     BLADRT                                 32
     C   32ORDREK        CHAIN     BLADRT                             33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     BLADRTRO
     C                   DELETE    BLADRTR
     C                   ENDIF
      *
     C     ORDREK        SETLL     BLLOK                                  32
     C   32ORDREK        CHAIN     BLLOK                              33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     BLLOKRO
     C                   DELETE    BLLOKR
     C                   ENDIF
      *
     C     ORDREK        SETLL     BLVSD2                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     BLVSD2                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     BLVSD2RO
     C                   DELETE    BLVSD2R
     C     ORDREK        READE     BLVSD2                                 33
     C                   ENDDO
     C                   ENDIF
      *
     C     ORDREK        SETLL     BLV1                                   32
     C                   IF        *IN(32)
     C     ORDREK        READE     BLV1                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     BLV1RO
     C                   DELETE    BLV1R
     C     ORDREK        READE     BLV1                                   33
     C                   ENDDO
     C                   ENDIF
N02   *
N02  C     ORDREK        SETLL     BLV1GATE                               32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     BLV1GATE                               33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     BLV1GTRO
N02  C                   DELETE    BLV1GTR
N02  C     ORDREK        READE     BLV1GATE                               33
N02  C                   ENDDO
N02  C                   ENDIF
N02   *
N02  C     ORDREK        SETLL     CCBLV1                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     CCBLV1                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     CCBLV1RO
N02  C                   DELETE    CCBLV1R
N02  C     ORDREK        READE     CCBLV1                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02   *
N02  C     ORDREK        SETLL     CCBLV2                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     CCBLV2                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     CCBLV2RO
N02  C                   DELETE    CCBLV2R
N02  C     ORDREK        READE     CCBLV2                                 33
N02  C                   ENDDO
N02  C                   ENDIF
      *
     C     ORDREK        SETLL     BLV2                                   32
     C                   IF        *IN(32)
     C     ORDREK        READE     BLV2                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     BLV2RO
     C                   DELETE    BLV2R
     C     ORDREK        READE     BLV2                                   33
     C                   ENDDO
     C                   ENDIF
      *
     C     ORDREK        SETLL     BOOKING                                32
     C   32ORDREK        CHAIN     BOOKING                            33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     BOOKINGRO
     C                   DELETE    BOOKINGR
     C                   ENDIF
      *
     C     ORDREK        SETLL     BOOKIN2                                32
     C   32ORDREK        CHAIN     BOOKIN2                            33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     BOOKIN2RO
     C                   DELETE    BOOKIN2R
     C                   ENDIF
      *
     C                   ENDIF
N02   *
N02  C                   IF        XCARGOF = 'Y'
N02  C     ORDREK        SETLL     CARGOF3                                32
N02  C   32ORDREK        READE     CARGOF3                                33
N02  C   32              DOW       *IN(33) = *OFF
N02  C                   WRITE     CARGOFRO
N02  C                   DELETE    CARGOFR
N02  C     ORDREK        READE     CARGOF3                                33
N02  C                   ENDDO
N02  C                   ENDIF
N02   *
N02  C                   IF        XCARGOO = 'Y'
N02  C     ORDREK        SETLL     CARGOO                                 32
N02  C   32ORDREK        READE     CARGOO                                 33
N02  C   32              DOW       *IN(33) = *OFF
N02  C                   WRITE     CARGOORO
N02  C                   DELETE    CARGOOR
N02  C     ORDREK        READE     CARGOO                                 33
N02  C                   ENDDO
N02  C                   ENDIF
      *
     C                   IF        XDIMM = 'Y'
     C     ORDREK        SETLL     DIMM                                   32
     C   32ORDREK        CHAIN     DIMM                               33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     DIMMRO
     C                   DELETE    DIMMR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDISP = 'Y'
     C     ORDREK        SETLL     DISP                                   32
     C   32ORDREK        CHAIN     DISP                               33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     DISPRO
     C                   DELETE    DISPR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEB = 'Y'
     C     ORDREK        SETLL     DOKEB                                  32
     C   32ORDREK        CHAIN     DOKEB                              33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     DOKEBRO
     C                   DELETE    DOKEBR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEC = 'Y'
     C     ORDREK        SETLL     DOKEC                                  32
     C   32ORDREK        CHAIN     DOKEC                              33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     DOKECRO
     C                   DELETE    DOKECR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKECE = 'Y'
     C     ORDREK        SETLL     DOKECE                                 32
     C   32ORDREK        CHAIN     DOKECE                             33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     DOKECERO
     C                   DELETE    DOKECER
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKECEL = 'Y'
     C     ORDREK        SETLL     DOKECEL                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKECEL                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKECELRO
     C                   DELETE    DOKECELR
     C     ORDREK        READE     DOKECEL                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKECET = 'Y'
     C     ORDREK        SETLL     DOKECET                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKECET                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKECETRO
     C                   DELETE    DOKECETR
     C     ORDREK        READE     DOKECET                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEF = 'Y'
     C     DOKEFK        SETLL     DOKEF                                  32
     C                   IF        *IN(32)
     C     DOKEFK        READE     DOKEF                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKEFRO
     C                   DELETE    DOKEFR
     C     DOKEFK        READE     DOKEF                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEFIM = 'Y'
     C     ORDREK        SETLL     DOKEFIM                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKEFIM                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKEFIMRO
     C                   DELETE    DOKEFIMR
     C     ORDREK        READE     DOKEFIM                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEM = 'Y'
     C                   IF        (((XLNR1 >= '0') AND (XLNR2 >= '0'))
     C                             AND (XLNR3 >= '0'))
     C                   MOVE      XLNR          YLNR
     C     DOKEMK        CHAIN     DOKEM                              32
     C                   IF        *IN(32) = *OFF
     C                   WRITE     DOKEMRO
     C                   DELETE    DOKEMR
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKQM = 'Y'
     C                   IF        (((XLNR1 >= '0') AND (XLNR2 >= '0'))
     C                             AND (XLNR3 >= '0'))
     C                   MOVE      XLNR          YLNR
     C     DOKQMK        CHAIN     DOKEQM                             32
     C                   IF        *IN(32) = *OFF
     C                   WRITE     DOKEQMRO
     C                   DELETE    DOKEQMR
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKEQ = 'Y'
     C     DOKEQK        SETLL     DOKEQ                                  32
     C                   IF        *IN(32)
     C     DOKEQK        READE     DOKEQ                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKEQRO
     C                   DELETE    DOKEQR
     C     DOKEQK        READE     DOKEQ                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKOTH = 'Y'
     C     ORDREK        SETLL     DOKOTH                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKOTH                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKOTRO
     C                   DELETE    DOKOTR
     C     ORDREK        READE     DOKOTH                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKOTHM1 = 'Y'
     C     ORDREK        SETLL     DOKOTHM1                               32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKOTHM1                               33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKOTMRO
     C                   DELETE    DOKOTMR
     C     ORDREK        READE     DOKOTHM1                               33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUF = 'Y'
     C     DOKUFK        SETLL     DOKUF                                  32
     C                   IF        *IN(32)
     C     DOKUFK        READE     DOKUF                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUFRO
     C                   DELETE    DOKUFR
     C     DOKUFK        READE     DOKUF                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUFM = 'Y'
     C     DOKUFK        SETLL     DOKUFM                                 32
     C                   IF        *IN(32)
     C     DOKUFK        READE     DOKUFM                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUFMRO
     C                   DELETE    DOKUFMR
     C     DOKUFK        READE     DOKUFM                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUFV = 'Y'
     C     DOKUFK        SETLL     DOKUFV                                 32
     C                   IF        *IN(32)
     C     DOKUFK        READE     DOKUFV                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUFVRO
     C                   DELETE    DOKUFVR
     C     DOKUFK        READE     DOKUFV                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUDG = 'Y'
     C     ORDREK        SETLL     DOKUDGS                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOKUDGS                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUDGOL
     C                   DELETE    DOKUDGSR
     C     ORDREK        READE     DOKUDGS                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUI = 'Y'
     C     DOKUIK        SETLL     DOKUI                                  32
     C                   IF        *IN(32)
     C     DOKUIK        READE     DOKUI                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUIRO
     C                   DELETE    DOKUIR
     C     DOKUIK        READE     DOKUI                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XDOKULG = 'Y'
N02  C     ORDREK        SETLL     DOKULG                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     DOKULG                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     DOKULGRO
N02  C                   DELETE    DOKULGR
N02  C     ORDREK        READE     DOKULG                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XDOKUM = 'Y'
     C                   IF        (((XLNR1 >= '0') AND (XLNR2 >= '0'))
     C                             AND (XLNR3 >= '0'))
     C                   MOVE      XLNR          YLNR
     C     DOKUMK        CHAIN     DOKUM                              32
     C                   IF        *IN(32) = *OFF
     C                   WRITE     DOKUMRO
     C                   DELETE    DOKUMR
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOKUT = 'Y'
     C     DOKUTK        SETLL     DOKUT                                  32
     C                   IF        *IN(32)
     C     DOKUTK        READE     DOKUT                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOKUTRO
     C                   DELETE    DOKUTR
     C     DOKUTK        READE     DOKUT                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOK29 = 'Y'
     C     ORDREK        SETLL     DOK29                                  32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOK29                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOK29RO
     C                   DELETE    DOK29R
     C     ORDREK        READE     DOK29                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XDOK36 = 'Y'
     C     ORDREK        SETLL     DOK36                                  32
     C                   IF        *IN(32)
     C     ORDREK        READE     DOK36                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     DOK36RO
     C                   DELETE    DOK36R
     C     ORDREK        READE     DOK36                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XDOLAF = 'Y'
N02  C     ORDREK        SETLL     DOLAL01                                32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     DOLAL01                                33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     DOLARO
N02  C                   DELETE    DOLAR
N02  C     ORDREK        READE     DOLAL01                                33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XEDICS = 'Y'
N02  C     ORDREK        SETLL     EDICS2                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     EDICS2                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     EDICSRO
N02  C                   DELETE    EDICSR
N02  C     ORDREK        READE     EDICS2                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XENADSF = 'Y'
N02  C     ORDREK        SETLL     ENADSF                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     ENADSF                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     NADSRO
N02  C                   DELETE    NADSR
N02  C     ORDREK        READE     ENADSF                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XEPOH = 'Y'
N02  C     ORDREK        SETLL     EPOH02                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     EPOH02                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C     EPOLK         SETLL     EPOL
N02  C     EPOLK         READE     EPOL                                   33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     EPOLRO
N02  C                   DELETE    EPOLR
N02  C     EPOLK         READE     EPOL                                   33
N02  C                   ENDDO
N02  C                   WRITE     EPOHRO
N02  C                   DELETE    EPOH02R
N02  C     ORDREK        READE     EPOH02                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C     ORDREK        SETLL     EPOL02                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     EPOL02                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C     EPOHK         SETLL     EPOH
N02  C     EPOHK         READE     EPOH                                   33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   IF        (EPAVD = 9999 AND EPOPD = 9999999) OR
N02  C                             (EPAVD = -9999 AND EPOPD = -9999999)
N02  C                   WRITE     EPOHRO
N02  C                   DELETE    EPOHR
N02  C                   ELSE
N02  C                   UPDATE    EPOHR
N02  C                   END
N02  C     EPOHK         READE     EPOH                                   33
N02  C                   ENDDO
N02  C                   WRITE     EPOLRO
N02  C                   DELETE    EPOL02R
N02  C     ORDREK        READE     EPOL02                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C     ORDREK        SETLL     EPOPOS                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     EPOPOS                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     EPOPOSRO
N02  C                   DELETE    EPOPOSR
N02  C     ORDREK        READE     EPOPOS                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XESOSF1 = 'Y'
N02  C     ORDREK        SETLL     ESOSF1                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     ESOSF1                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     ESOSF1RO
N02  C                   DELETE    ESOSF1R
N02  C     ORDREK        READE     ESOSF1                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XESOSF2 = 'Y'
N02  C     ORDREK        SETLL     ESOSF2                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     ESOSF2                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     ESOSF2RO
N02  C                   DELETE    ESOSF2R
N02  C     ORDREK        READE     ESOSF2                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XESOSF3 = 'Y'
N02  C     ORDREK        SETLL     ESOSF3                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     ESOSF3                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     ESOSF3RO
N02  C                   DELETE    ESOSF3R
N02  C     ORDREK        READE     ESOSF3                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XE171F = 'Y'
N02  C     ORDREK        SETLL     E171F                                  32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     E171F                                  33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     E171FRO
N02  C                   DELETE    E171FR
N02  C     ORDREK        READE     E171F                                  33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XE307F = 'Y'
N02  C     ORDREK        SETLL     E307F                                  32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     E307F                                  33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     E307FRO
N02  C                   DELETE    E307FR
N02  C     ORDREK        READE     E307F                                  33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C     ORDREK        SETLL     EDIM2
     C     ORDREK        READE     EDIM2                                  33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((((M1001 <> '830') AND
     C                                (M1001 <> '929')) AND
     C                                (M1001 <> 'TET')) AND
     C                                (M1001 <> 'TEI'))
     C                   WRITE     EDIMRO
     C                   DELETE    EDIMR
     C     MSN           CHAIN     EDIS                               34
     C  N34              WRITE     EDISRO
     C  N34              DELETE    EDISR
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C     ORDREK        READE     EDIM2                                  33
     C                   END
      *
     C     ORDREK        SETLL     FAI4                                   32
     C                   IF        *IN(32)
     C     ORDREK        READE     FAI4                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FAINRO
     C                   DELETE    FAINR
     C     ORDREK        READE     FAI4                                   33
     C                   ENDDO
     C                   ENDIF
      *
     C     ORDREK        SETLL     FAK2                                   32
     C                   IF        *IN(32)
     C     ORDREK        READE     FAK2                                   33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FAKTRO
     C                   DELETE    FAKTR
     C     ORDREK        READE     FAK2                                   33
     C                   ENDDO
     C                   ENDIF
N02   *
N02  C                   IF        XFAKTXT = 'Y'
N02  C     ORDREK        SETLL     FAKTXT                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     FAKTXT                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     FAKTXTRO
N02  C                   DELETE    FAKTXTR
N02  C     ORDREK        READE     FAKTXT                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XFAXLOG = 'Y'
N02  C     ORDREK        SETLL     FAXLOG03                               32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     FAXLOG03                               33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     FAXLOGRO
N02  C                   DELETE    FAXLOGR
N02  C     ORDREK        READE     FAXLOG03                               33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XFORDEL = 'Y'
     C     ORDREK        SETLL     FORDEL                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     FORDEL                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FORDRO
     C                   DELETE    FORDR
     C     ORDREK        READE     FORDEL                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFREETXT = 'Y'
     C     ORDREK        SETLL     FREETXT                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     FREETXT                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FREETXTRO
     C                   DELETE    FREETXTR
     C     ORDREK        READE     FREETXT                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFRISOK = 'Y'
     C     ORDREK        SETLL     FRISOK                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     FRISOK                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FRISOKRO
     C                   DELETE    FRISOKR
     C     ORDREK        READE     FRISOK                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFRMDOC = 'Y'
     C     ORDREK        SETLL     FRMDOC                                 32
     C   32ORDREK        CHAIN     FRMDOC                             33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     FRMDOCRO
     C                   DELETE    FRMDOCR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFRMDOC1 = 'Y'
     C     ORDREK        SETLL     FRMDOC1                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     FRMDOC1                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FRMDOC1RO
     C                   DELETE    FRMDOC1R
     C     ORDREK        READE     FRMDOC1                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFRMDOC2 = 'Y'
     C     ORDREK        SETLL     FRMDOC2                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     FRMDOC2                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FRMDOC2RO
     C                   DELETE    FRMDOC2R
     C     ORDREK        READE     FRMDOC2                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XFRMDOC3 = 'Y'
     C     ORDREK        SETLL     FRMDOC3                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     FRMDOC3                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     FRMDOC3RO
     C                   DELETE    FRMDOC3R
     C     ORDREK        READE     FRMDOC3                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XFPXREF = 'Y'
N02  C     ORDREK        SETLL     FPXREF                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     FPXREF                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     FPXREFRO
N02  C                   DELETE    FPXREFR
N02  C     ORDREK        READE     FPXREF                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XGSSORL21 = 'Y'
      *
     C                   MOVEL     HEAVD         YORDRENR         11 0
     C                   MOVE      HEOPD         YORDRENR
     C     GSSK          SETLL     GSSORL21                               32
     C                   IF        *IN(32)
     C     GSSK          READE     GSSORL21                               33
     C                   DOW       *IN(33) = *OFF
      *
     C     ORONO         SETLL     GSSOVF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSOVF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSOVFRO
     C                   DELETE    GSSOVFR
     C     ORONO         READE     GSSOVF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSOWL01                               32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSOWL01                               34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSOWFRO
     C                   DELETE    GSSOWFR
     C     ORONO         READE     GSSOWL01                               34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSPAF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSPAF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSPAFRO
     C                   DELETE    GSSPAFR
     C     ORONO         READE     GSSPAF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSPOF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSPOF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSPOFRO
     C                   DELETE    GSSPOFR
     C     ORONO         READE     GSSPOF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSGDF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSGDF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSGDFRO
     C                   DELETE    GSSGDFR
     C     ORONO         READE     GSSGDF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSAKF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSAKF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSAKFRO
     C                   DELETE    GSSAKFR
     C     ORONO         READE     GSSAKF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSFGF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSFGF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSFGFRO
     C                   DELETE    GSSFGFR
     C     ORONO         READE     GSSFGF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSKAF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSKAF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSKAFRO
     C                   DELETE    GSSKAFR
     C     ORONO         READE     GSSKAF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSLGL01                               32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSLGL01                               34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSLGFRO
     C                   DELETE    GSSLGFR
     C     ORONO         READE     GSSLGL01                               34
     C                   ENDDO
     C                   ENDIF
      *
     C     ORONO         SETLL     GSSRFF                                 32
     C                   IF        *IN(32)
     C     ORONO         READE     GSSRFF                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     GSSRFFRO
     C                   DELETE    GSSRFFR
     C     ORONO         READE     GSSRFF                                 34
     C                   ENDDO
     C                   ENDIF
      *
     C                   WRITE     GSSORFRO
     C                   DELETE    GSSORFR
     C     GSSK          READE     GSSORL21                               33
     C                   ENDDO
     C                   ENDIF
      *
     C     GSSK          SETLL     GSSOLL01                               32
     C   32GSSK          CHAIN     GSSOLL01                           33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     GSSOLFRO
     C                   DELETE    GSSOLFR
     C                   ENDIF
      *
     C     GSSK          SETLL     GSSTRF                                 32
     C   32GSSK          CHAIN     GSSTRF                             33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     GSSTRFRO
     C                   DELETE    GSSTRFR
     C                   ENDIF
N02   *
N02  C     GSSK          SETLL     GSSTUR                                 32
N02  C   32GSSK          CHAIN     GSSTUR                             33
N02  C   32              IF        *IN(33) = *OFF
N02  C                   WRITE     GSSTURRO
N02  C                   DELETE    GSSTURR
N02  C                   ENDIF
      *
     C                   ENDIF
N02   *
N02  C                   IF        XHEBRELE = 'Y'
N02  C     ORDREK        SETLL     HEBRELE                                32
N02  C   32ORDREK        CHAIN     HEBRELE                            33
N02  C   32              IF        *IN(33) = *OFF
N02  C                   WRITE     HEBRRO
N02  C                   DELETE    HEBRELER
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XHESTED = 'Y'
     C     ORDREK        SETLL     HESTED                                 32
     C   32ORDREK        CHAIN     HESTED                             33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     HESTEDRO
     C                   DELETE    HESTEDR
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XHETRIU = 'Y'
     C     ORDREK        SETLL     HETRIU                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     HETRIU                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     HETRIURO
     C                   DELETE    HETRIUR
     C     ORDREK        READE     HETRIU                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XHUBOL02 = 'Y'
     C     ORDREK        SETLL     HUBOL02                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     HUBOL02                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     HUBORO
     C                   DELETE    HUBOR
     C     ORDREK        READE     HUBOL02                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XISOFL1 = 'Y'
     C     ORDREK        SETLL     ISOFL1                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     ISOFL1                                 33
     C                   DOW       *IN(33) = *OFF
     C     ISSAKN        SETLL     ISOLFL1
     C     ISSAKN        READE     ISOLFL1                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     ISOLFRO
     C                   DELETE    ISOLFR
     C     ISSAKN        READE     ISOLFL1                                33
     C                   ENDDO
     C                   WRITE     ISOFRO
     C                   DELETE    ISOFR
     C     ORDREK        READE     ISOFL1                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XISOSAKF = 'Y'
     C     ORDREK        SETLL     ISOSAKF                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     ISOSAKF                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     ISOSAKFRO
     C                   DELETE    ISOSAKFR
     C     ORDREK        READE     ISOSAKF                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XKOSBU12 = 'Y'
     C     ORDREK        SETLL     KOSBU12                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     KOSBU12                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     KOSBURO
     C                   DELETE    KOSBUR
     C     ORDREK        READE     KOSBU12                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XMCAWF = 'Y'
     C     ORDREK        SETLL     MCAWF                                  32
     C                   IF        *IN(32)
     C     ORDREK        READE     MCAWF                                  33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     MCAWRO
     C                   DELETE    MCAWR
     C     ORDREK        READE     MCAWF                                  33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XOMDI = 'Y'
N02  C     ORDREK        SETLL     OMDI                                   32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     OMDI                                   33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     OMDIRO
N02  C                   DELETE    OMDIR
N02  C     ORDREK        READE     OMDI                                   33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XRUCKP = 'Y'
N02  C     ORDREK        SETLL     RUCKP                                  32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     RUCKP                                  33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     RUCKPRO
N02  C                   DELETE    RUCKPR
N02  C     ORDREK        READE     RUCKP                                  33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XRUCKPU = 'Y'
N02  C     ORDREK        SETLL     RUCKPU                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     RUCKPU                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     RUCKPURO
N02  C                   DELETE    RUCKPUR
N02  C     ORDREK        READE     RUCKPU                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XPALLDL99 = 'Y'
     C     ORDREK        SETLL     PALLDL99                               32
     C                   IF        *IN(32)
     C     ORDREK        READE     PALLDL99                               33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     PALLDRO
     C                   DELETE    PALLDR
     C     ORDREK        READE     PALLDL99                               33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XSAML1 = 'Y'
     C     ORDREK        SETLL     SAML1                                  32
     C   32ORDREK        CHAIN     SAML1                              33
     C   32              IF        *IN(33) = *OFF
     C                   WRITE     SAMLRO
     C                   DELETE    SAMLR
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XSKPOS = 'Y'
N02  C     ORDREK        SETLL     SKPOS                                  32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     SKPOS                                  33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     SKPOSRO
N02  C                   DELETE    SKPOSR
N02  C     ORDREK        READE     SKPOS                                  33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XSTSOPD1 = 'Y'
     C     ORDREK        SETLL     STSOPD1                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     STSOPD1                                33
     C                   DOW       *IN(33) = *OFF
     C     STSKEY        SETLL     STSCLI
     C     STSKEY        READE     STSCLI                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     STSCLIRO
     C                   DELETE    STSCLIR
     C     STSKEY        READE     STSCLI                                 34
     C                   ENDDO
     C     STSKEY        SETLL     STSFBR
     C     STSKEY        READE     STSFBR                                 34
     C                   DOW       *IN(34) = *OFF
     C                   WRITE     STSFBRRO
     C                   DELETE    STSFBRR
     C     STSKEY        READE     STSFBR                                 34
     C                   ENDDO
     C                   WRITE     STSOPDRO
     C                   DELETE    STSOPDR
     C     ORDREK        READE     STSOPD1                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XTKSGM = 'Y'
N02  C     ORDREK        SETLL     TKSGML1                                32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     TKSGML1                                33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     TKSGMRO
N02  C                   DELETE    TKSGMR
N02  C     ORDREK        READE     TKSGML1                                33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XTRACKF = 'Y'
     C     ORDREK        SETLL     TRACKF                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     TRACKF                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     TRACKFRO
     C                   DELETE    TRACKFR
     C     ORDREK        READE     TRACKF                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XTRACKK = 'Y'
N02  C     ORDREK        SETLL     TRACKK02                               32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     TRACKK02                               33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     TRACKKRO
N02  C                   DELETE    TRACKKR
N02  C     ORDREK        READE     TRACKK02                               33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   IF        XTRACKT = 'Y'
     C     ORDREK        SETLL     TRACKT                                 32
     C                   IF        *IN(32)
     C     ORDREK        READE     TRACKT                                 33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     TRACKTRO
     C                   DELETE    TRACKTR
     C     ORDREK        READE     TRACKT                                 33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
      *
     C                   IF        XUTLLOGF = 'Y'
     C     ORDREK        SETLL     UTLLOGF                                32
     C                   IF        *IN(32)
     C     ORDREK        READE     UTLLOGF                                33
     C                   DOW       *IN(33) = *OFF
     C                   WRITE     UTLLOGRO
     C                   DELETE    UTLLOGR
     C     ORDREK        READE     UTLLOGF                                33
     C                   ENDDO
     C                   ENDIF
     C                   ENDIF
N02   *
N02  C                   IF        XVARELI = 'Y'
N02  C     ORDREK        SETLL     VARELI                                 32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     VARELI                                 33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     VARELIRO
N02  C                   DELETE    VARELIR
N02  C     ORDREK        READE     VARELI                                 33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
N02   *
N02  C                   IF        XXMLINH = 'Y'
N02  C     ORDREK        SETLL     XMLINHL1                               32
N02  C                   IF        *IN(32)
N02  C     ORDREK        READE     XMLINHL1                               33
N02  C                   DOW       *IN(33) = *OFF
N02  C                   WRITE     XMLINHRO
N02  C                   DELETE    XMLINHR
N02  C     ORDREK        READE     XMLINHL1                               33
N02  C                   ENDDO
N02  C                   ENDIF
N02  C                   ENDIF
      *
     C                   WRITE     HEADFRO
     C                   DELETE    HEADFR
      *
     C                   ADD       1             WSANT
     C                   ADD       1             XANT              3 0
     C                   IF        WSANT <= 1000
     C                   MOVEA     '01'          *IN(94)
     C     XANT          COMP      100                                    97
     C                   ELSE
     C                   MOVEA     '10'          *IN(94)
     C     XANT          COMP      1000                                   97
     C                   END
     C                   IF        *IN97
     C                   MOVE      *ZEROS        XANT
     C                   TIME                    WSTDNÅ
     C                   READ      REOPDAFM                             3333
     C                   WRITE     BILDE
     C                   READ      REOPDAFM                             3333
     C                   END
      *
     C                   GOTO      STDLORDRE
      *
     C     SLDLORDRE     ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     AMETAK        KLIST
     C                   KFLD                    HEPRO
     C                   KFLD                    HEKNA
     C     AMSAML1K      KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
N01  C     ARKIVK        KLIST
N01  C                   KFLD                    ARKKOD
N01  C                   KFLD                    HEAVD
N01  C                   KFLD                    HEOPD
N02  C     EPOLK         KLIST
N02  C                   KFLD                    EHKUND
N02  C                   KFLD                    EHBES
N02  C     EPOHK         KLIST
N02  C                   KFLD                    ELKUND
N02  C                   KFLD                    ELBES
     C     ORDREK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKEFK        KLIST
     C                   KFLD                    YFRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKEMK        KLIST
     C                   KFLD                    YMRI
     C                   KFLD                    YSD
     C                   KFLD                    YLNR
     C     DOKQMK        KLIST
     C                   KFLD                    YQRI
     C                   KFLD                    YSD
     C                   KFLD                    YLNR
     C     DOKEQK        KLIST
     C                   KFLD                    YQRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKUFK        KLIST
     C                   KFLD                    YFRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKUIK        KLIST
     C                   KFLD                    YIRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKUMK        KLIST
     C                   KFLD                    YSD
     C                   KFLD                    YLNR
     C     DOKUTK        KLIST
     C                   KFLD                    YTRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     GSSK          KLIST
     C                   KFLD                    YORDRENR
     C     STSKEY        KLIST
     C                   KFLD                    SOTYPE
     C                   KFLD                    SOPRO
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C                   MOVE      'F'           YFRI              1
     C                   MOVE      'Q'           YQRI              1
     C                   MOVE      'M'           YMRI              1
     C                   MOVE      'I'           YIRI              1
     C                   MOVE      'T'           YTRI              1
N01  C                   MOVE      'A'           ARKKOD            1
     C                   MOVE      *ZEROS        YDT
     C                   MOVE      *ZEROS        YLNR              3 0
     C                   MOVEA     '0100'        *IN(26)
      *
     C                   ENDSR
      *
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      WSDT          XDTFMT            4 0
     C                   MOVEL     WSDT          UDT1              2 0
     C                   MOVEL     XDTFMT        UDT2              2 0
     C                   MOVE      XDTFMT        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVEL     UDT1          WSDT
     C                   MOVEL     UDT2          XDTFMT
     C                   MOVE      UDT3          XDTFMT
     C                   MOVE      XDTFMT        WSDT
      *
     C                   ENDSR
      *
