     FSTATOHL3  IF   E           K DISK
     FSTATODF   UP   E             DISK
      *
      *
     C     STSTNR        CHAIN     STATOHL3                           33
      *
     C   33              DELETE    STATDFR
