     FSTATHFL3  IF   E           K DISK
     FSTATDF    UP   E             DISK
      *
      *
     C     STSTNR        CHAIN     STATHFL3                           33
      *
     C   33              DELETE    STATDFR
