      ***********************************************************
      *** reorganisering statistikk                           ***
      ***********************************************************
      *
     Fstatohfl3 IF   E           K DISK
     Fstatodl1  Up   E           K DISK
     c*
     C     key           klist
     C                   kfld                    ststnr
     c*
     c     ststnr        ifne      forige
     c     key           chain     statohfl3                          33
     c                   move      ststnr        forige           11 0
     c                   end
     c     *in(33)       ifeq      '1'
     c                   delete    statdfr
     c                   end
