     FSTATOHF   UP   E           K DISK
      *
     D                 DS
EV5  D  STDTC                  1      2  0
EV5  D  STDTÅ                  3      4  0
EV5  D  AAR                    1      4
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAAR              4
     C     AAR           IFLE      UAAR
     C                   DELETE    STATHFR
     C                   END
