      ***************************************************************
      *** PROGRAM SKAL SKRIVE UT LASTELISTE (SYSPED) HENT OPLYSN. ***
      ***************************************************************
     FSTANDT    IF   E           K DISK
     FKODTA     IF   E           K DISK
     FKODTSI    IF   E           K DISK
     FKODTP     IF   E           K DISK
     FSAD025FX  CF   E             WORKSTN
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE01
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C                   SETOFF                                       309899
      *
     C     KODTAK        CHAIN     KODTA                              99
     C  N99WSAVD         CHAIN     STANDT                             99
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C     KODSIK        CHAIN     KODTSI                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C     WSDTY         IFEQ      '  '
     C                   GOTO      START
     C                   END
      *
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     95            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        ULSTP
     C                   MOVE      KOPTY         ULSTTY
     C                   ENDIF
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTAK        KLIST
     C                   KFLD                    YAUNI
     C                   KFLD                    WSAVD
     C     KODSIK        KLIST
     C                   KFLD                    YSUNI
     C                   KFLD                    WSSG
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI
     C                   KFLD                    WOPAVD
     C                   KFLD                    WOPLNR
     C     *LIKE         DEFINE    KOPAVD        WOPAVD
     C     *LIKE         DEFINE    KOPUNI        WOPUNI
     C     *LIKE         DEFINE    KOPLNR        WOPLNR
     C                   Z-ADD     0             WOPAVD
     C                   MOVE      'P'           WOPUNI
     C                   Z-ADD     0             WOPLNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSAVD             4 0
     C                   PARM                    WSSG              3
     C                   PARM                    WSDTY             2
     C                   PARM                    WSST              1
     C                   PARM                    ULSTP            10
     C                   PARM                    ULSTTY           10
     C                   PARM                    UIN01             1
      *
     C                   MOVE      'SI'          YSUNI             2
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      '0'           UIN01
      *
     C                   ENDSR
      *
