********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
10XXX * 02 SH  PTF10 når kundenummer = 0  ikke chain
10XXX * 04 YBC PTF10 TEST DUA ETTER INNSTIKK
10XXX * 04TH    BEARBEIDING PROSEDYRE 65  0109-2010
10XXX * 05 SH  PTF10 curser ved eksternref
10XXX * 06 YBC PTF10 HENT LANDKODE OG BILNR FRA TURREGISTER
10XXX * 07 YBC PTF10 VED KOPI BRUKER STED FRA AVDELING
10XXX * 08 JOV PTF10 Om en kommer fra 'Arkiv/Papisløs' skipp inng-bilde
10167 * 09 YBC PTF10 BLANK KURS VED VALUTAKODE ENDRING
10172 * 10 SH  PTF10 norsk text til Track and trace
10XXX * 11 YBC PTF10 IKKE TEST GODSNR VED GRENSEFORTOLLING
10XXX * 12 YBC PTF10 OPPDATER STATUS VED AVBRYT PLUKKING FRA Z-FIL
10XXX * 13 YBC PTF10 TØMM UDS VED NYTT OPPDRAG.
10XXX * 14 SH  PTF10 henter data fra hekns
10205 * 15 YBC PTF10 IKKE OPPDATER FAKTURASUM FRA RUBR28 VED SPLITTET OPPDRAG
10XXX * 16 SH  PTF10 ogst til track and trace ved edi oppdrag
10XXX * 17 SH  PTF10 ryckattest sendes
10286 * 18 YBC PTF10 FELT FPR "MERKE & NR" ER ØKT FRA 17 TIL 28
10XXX * 19 YBC PTF10 OPPDATER GAMMEL STATUS VED F12
10XXX * 20 CB  PTF10 NOEN korreksjoner på endring 06
10XXX * 21 YBC PTF10 TVINN BRUKER KUN 6 LANG POSISJON
      *              ENDRE VF I HODE -> ENDRE VF PÅ LINJER
10XXX * 22 SH  PTF10 Låser deklarant på skjermbildet
10XXX * 23 SH  PTF10 endring 06 rettet på
********************************************************************
     H DEBUG(*YES)
      *
      *****************************************************************
      *** PROGRAM SKAL REGISTRERE TOLLDEK.-IMPORT (HOVEDBILDE)      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 05 06 09 11 16 18-22 25 56
      *** LEDIGE INDIKATORER 27 34 37-60 63-67 74 75          ***
      *** ALLE VARIABLER SOM STARTER MED 'X' ER ARBERDSVAR.   ***
      ***   OG DEFINERES I PROGRAM                            ***
      ***********************************************************
      *
N17  FRUCKPU    IF A E           K DISK
N17  FSYPARL4   IF   E           K DISK
     FFPXREF    IF A E           K DISK
s16  F*RACKF    O  A E           K DISK
n16  FTRACKL02  IF A E           K DISK
     FFRATXT    IF   E           K DISK
     FSYPTFF    IF   E           K DISK
     FSADH      UF A E           K DISK
     FSADH6B    IF   E           K DISK
     F                                     RENAME(SADHR:SADHR6B)
     FFRISOL01  IF   E           K DISK
     F                                     RENAME(FRISOKR:FRISOKR1)
     FFRISOK    UF A E           K DISK
     FSADV      UF A E           K DISK
     FSADW      IF   E           K DISK
     FSTANDI    UF   E           K DISK
     FDOKUF     UF   E           K DISK
     FHEADF     IF   E           K DISK
     FTURER14   IF   E           K DISK
     FBILLOF    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   UF   E           K DISK
     FCUNDLFO   IF   E           K DISK
     F                                     RENAME(kundr:kundrfo)
     FEDIM1     UF   E           K DISK
     FEDIM4     IF   E           K DISK
     F                                     RENAME(EDIMR:EDIMR4)
     FTVINF     IF   E           K DISK
     FKODTLB    IF   E           K DISK
     FKODTVAL2  IF   E           K DISK
     FKODTSD    IF   E           K DISK
     FMULTKOD2  IF   E           K DISK
     FZEADL01   IF   E           K DISK
     F                                     RENAME(HEADFR:ZEADHR1)
     FZEADL04   IF   E           K DISK
     F                                     RENAME(HEADFR:ZEADHR4)
     FZADHL01   UF   E           K DISK
     F                                     RENAME(SADHR:ZADHR)
     FZADFL01   UF   E           K DISK
     F                                     RENAME(SADFR:ZADFR)
     FSADF      IF A E           K DISK    USROPN
     FSAD061FM  CF   E             WORKSTN USROPN
     F                                     INFDS(FBAREA)
     D                SDS
     D  UUSR                 254    263
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  SITRT                  1      7  0
     D  SISLAA                 1      1  0
     D  SIDFVF                 2      2  0
     D*
     D*** SI28 I SADH ER TATT I BRUK (FØRST 15 POS.)
     D*** PGA. ENDRING AV REGISTER BESKRIVELSE (SE SADH)
     D*** GJØR VI FØLGENDE DOBBEL DEFINISJON.
     D                 DS
     D  SI28                   1     28
     D  SIBELC                 1     11  2
     D  SIRAB                 12     15  2
     D  SIRABX                12     15
     D  SIRABY                15     15
     D  SI27                   1     27
     D* SPLITTER GODSNUMMER
     D                 DS
     D  WSGN                   1     15
     D  XXGN1                  5      5
     D  XXGN11                 5     15
N17  D  TLAGER                 5      9
     D  XXGN10                 6     15
     D  XXGN1B                 7      7
     D  XXGN8                  8     15
     D*
     D*** FØRST POS. AV KLBXXX I KODTLB ER TATT I BRUK
     D                 DS
     D  KLBXXX                 1     35
     D  KLBHAD                 1      1
     D*
     D                 DS
     D  WSFIDD                 1      2  0
     D  WSFIDM                 3      4  0
     D  WSFIDÅ                 5      6  0
     D  WSFID                  1      6  0
     D                 DS
     D  SIFIDÅ                 1      4  0
     D  SIFIDM                 5      6  0
     D  SIFIDD                 7      8  0
     D  SIFID                  1      8  0
     D                 DS
     D  ZIFIDÅ                 1      4  0
     D  ZIFIDM                 5      6  0
     D  ZIFIDD                 7      8  0
     D  ZIFID                  1      8  0
     D                 DS
     D  WSFT1                  1     45
     D  XFT1S                 16     45
     D                 DS
     D  WSFT3                  1     45
     D  XFT3S                 27     45
     D  WFFOR                  1      3
     D  WFBLAN                 4      4
     D  WFFORK                14     14
     D  WFFT3                  5     45
     D                 DS
     D  WSFT4                  1     45
     D  WFFOR4                 1      3
     D  WFBLA4                 4      4
     D  WFFT4                  5     45
     D                 DS
     D  HEPOS1                 1      7
     D  XPOS11                 1      1
     D  XPOS12                 2      2
     D  XPOS13                 3      3
     D  XPOS14                 4      4
     D  XPOS15                 5      5
     D  XPOS16                 6      6
     D  XPOS17                 7      7
     D                 DS
     D  HEPOS2                 1      4  0
     D  XPOS21                 1      1  0
     D  XPOS22                 2      2  0
     D  XPOS23                 3      3  0
     D  XPOS24                 4      4  0
     D  XPOS25                 2      4  0
     D  XPOS26                 3      4  0
     D                 DS
     D  SYRG                   1     14
     D  SYFOR9                 1      9
     D  SYFORE                 1     11
N13  D SAVUDS         UDS
N13  D  UUDSDTA              101    300
     ISADHR6B
     I              SIAVD                       S6AVD
     I              SITDN                       S6TDN
     I              SISG                        S6SG
     I              SITARF                      S6TARF
     I              SIOPD                       S6OPD
     I              SIFRBN                      S6FRBN
     IZADHR
     I              SIST                        ZIST
     I              SIAVD                       ZIAVD
     I              SITDN                       ZITDN
     I              SIUR                        ZIUR
     I              SIDTY                       ZIDTY
     I              SIDP                        ZIDP
     I              SIKNS                       ZIKNS
     I              SINAS                       ZINAS
     I              SIADS1                      ZIADS1
     I              SIADS2                      ZIADS2
     I              SIADS3                      ZIADS3
     I              SINTK                       ZINTK
     I              SISKI                       ZISKI
     I              SIKDDK                      ZIKDDK
     I              SIVKB                       ZIVKB
     I              SIKDC                       ZIKDC
     I              SISG                        ZISG
     I              SIKNK                       ZIKNK
     I              SIRG                        ZIRG
     I              SINAK                       ZINAK
     I              SIADK1                      ZIADK1
     I              SIADK2                      ZIADK2
     I              SIADK3                      ZIADK3
     I              SIVAL1                      ZIVAL1
     I              SIBEL1                      ZIBEL1
     I              SIVAL2                      ZIVAL2
     I              SIBEL2                      ZIBEL2
     I              SIFTG2                      ZIFTG2
     I              SILKA                       ZILKA
     I              SITLF                       ZITLF
     I              SINAD                       ZINAD
     I              SILV                        ZILV
     I              SILVT                       ZILVT
     I              SITRID                      ZITRID
     I              SILKT                       ZILKT
     I              SIVAL3                      ZIVAL3
     I              SIBEL3                      ZIBEL3
     I              SIVKU                       ZIVKU
     I              SITST                       ZITST
     I              SITRT                       ZITRT
     I              SITRM                       ZITRM
     I              SIFIF                       ZIFIF
     I              SIFID                       ZIFID
     I              SIBELT                      ZIBELT
     I              SI07                        ZI07
     I              SIKTA                       ZIKTA
     I              SIKTB                       ZIKTB
     I              SIGN                        ZIGN
     I              SIFT1                       ZIFT1
     I              SIFT2                       ZIFT2
     I              SIFT3                       ZIFT3
     I              SIFT4                       ZIFT4
     I              SIDST                       ZIDST
     I              SIBEL4                      ZIBEL4
     I              SIDTG                       ZIDTG
     I              SITLL                       ZITLL
     I              SITLE                       ZITLE
     I              SILS                        ZILS
     I              SIKDLS                      ZIKDLS
     I              SIKDH                       ZIKDH
     I              SIKDTR                      ZIKDTR
     I              SIAS                        ZIAS
     I              SIDT                        ZIDT
     I              SIBEL5                      ZIBEL5
     I              SIBEL6                      ZIBEL6
     I              SIBEL7                      ZIBEL7
     I              SIBEL8                      ZIBEL8
     I              SIBEL9                      ZIBEL9
     I              SIBELA                      ZIBELA
     I              SILV2                       ZILV2
     I              SIPOS                       ZIPOS
     I              SITARF                      ZITARF
     I              SIVALB                      ZIVALB
     I              SIBELB                      ZIBELB
     I              SIMID                       ZIMID
     I              SIMIDK                      ZIMIDK
     I              SIMF                        ZIMF
     I              SIMP                        ZIMP
     I              SIDTØ                       ZIDTØ
     I              SIMI                        ZIMI
     I              SIBELD                      ZIBELD
     I              SIPKL                       ZIPKL
     I              SIKDV                       ZIKDV
     I              SI0035                      ZI0035
     I              SI27                        ZI27
     I              SIOPD                       ZIOPD
     I              SIFRBN                      ZIFRBN
     I              SIWS                        ZIWS
     I              SIKTC                       ZIKTC
     I              SIVALR                      ZIVALR
     I              SIBELR                      ZIBELR
     I              SIBELS                      ZIBELS
     I              SIDTPL                      ZIDTPL
     I              SIUNIK                      ZIUNIK
     I              SIREFF                      ZIREFF
     C*
     C                   OPEN      SAD061FM
     C                   EXSR      INIT
     C*...............................................
     C* BILDE-1 INNLESING AV OPDNR./TARIFFØR OSV.
     C*'''''''''''''''''''''''''''''''''''''''''''''''
     C     START         TAG
     C  N31
     CAN 36              Z-ADD     10            LINNBR
     C  N31
     CANN36              Z-ADD     9             LINNBR
     C   31              Z-ADD     13            LINNBR
     C                   Z-ADD     20            POSNBR
     C     FIURBI        COMP      'N'                                3535
N05  C  N30SIEKST        ifeq      'J'
N05  c                   z-add     7             LINNBR
N05  c                   end
N08  c     UMODE         ifne      'A'
     C                   EXFMT     BILDE01
N08  c                   else
N08  c                   move      ' '           UMODE
N08  c                   endif
     C                   MOVEA     '00000'       *IN(95)
     C                   MOVEA     '000'         *IN(28)
     C*
     C*  12 = AVBRYTT
     C   12              GOTO      SLUTT
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C                   EXSR      TESTB1
     C   30              GOTO      START
S12  C*  04UFLAGG        CABEQ     1             START
N12  C   04              IF        UFLAGG = 1
N12  C     SADHK         CHAIN     SADH                               33
N12  C  N33              EVAL      SIST = ' '
N12  C  N33              UPDATE    SADHR
N12  C                   GOTO      START
N12  C                   END
      *
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      *ZEROS        WSTDN
     C                   MOVE      *ZEROS        WSFRBN
     C                   MOVE      *BLANKS       WSDTG
     C                   MOVE      *BLANKS       WSTLL
     C                   MOVE      *BLANKS       WSTLE
     C                   MOVE      *ZEROS        SITDN
     C                   MOVEL     WSFIF         WSFIF3            3
     C     WSFIF3        IFEQ      'F15'
     C                   MOVE      *BLANKS       WSFIF
     C                   END
     C                   END
     C*===============================================
     C*
     C*...............................................
     C* BILDE-2 INNLESING AV HOVED OPPLYSNINGER AV SAD
     C*'''''''''''''''''''''''''''''''''''''''''''''''
     C     START2        TAG
     C  N30              Z-ADD     1             LINNBR
     C  N30              Z-ADD     65            POSNBR
     C     ST21          TAG
      *
     C                   EXSR      TSTOPL
N09  C                   EVAL      XXVAL3 = WSVAL3
N09  C                   EVAL      XXVKU  = WSVKU
      *
     C                   EXFMT     BILDE02
     C                   MOVEA     '00000000'    *IN(92)
     C                   MOVEA     '00000000'    *IN(84)
     C                   MOVEA     '0000'        *IN(80)
     C                   MOVEA     '0000'        *IN(76)
     C                   MOVEA     '0000000'     *IN(67)
     C                   SETOFF                                       30
N09   *
N09  C                   IF        XXVAL3 <> WSVAL3 AND XXVKU = WSVKU
N09  C                   EVAL      WSVKU  = 0
N09  C                   END
     C*
     C*  04 = SØK AVSENDER/MOTTAKER
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      ST21
     C                   END
     C*
     C*  07 = SØKE OPPDRAG
     C   07              DO
     C                   MOVE      'S'           UTYPES            1
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPES
     C                   PARM                    UAVD
     C                   PARM                    WSTDN
     C                   PARM                    WSSG
     C                   GOTO      START2
     C                   END
     C*
     C*  10 = SE OPPLYSNIGER OM GODKJENNELSE FRA TOLLVESENET (KUN KOMMUNIKASJON)
     C   10              DO
     C                   EXSR      VISTOL
     C                   GOTO      START2
     C                   END
     C*
     C*  12 = AVBRYT, FRIGJØR E-MERKING OG GÅ TIL BILDE01
     C   12              DO
     C     SADHK         CHAIN     SADH                               33
     C     XNYTDK        IFEQ      'N'
N19  C                   IF        XSISTGML = 'Q' OR XSISTGML = 'K'
     C                   MOVE      ' '           SIST
N19  C                   ELSE
N19  C                   MOVE      XSISTGML      SIST
N19  C                   END
     c   49              move      'F'           sist
     C                   END
     C  N33              UPDATE    SADHR
     C     UTYPE         IFEQ      'CR2'
     C                   MOVE      *ZEROS        WSTDN
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C*
     C* F14 = VIS FRITEKST PÅ KUNDE
     C*
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      START2
     C                   END
     C*
     C*
     C   24              DO
     C                   EXSR      UTCMDL
     C                   GOTO      START2
     C                   END
     C*
     C*
     C*  15 = REGISTRER RUBR.28
     C   15              DO
     C                   EXSR      OPDSAD
     C                   Z-ADD     UAVD          XAVD              4 0
     C                   Z-ADD     WSTDN         XTDN              7 0
N15  C     'Oppdraget er'SCAN      WSFT3                                  33
N15  C                   IF        *IN33
N15  C                   Z-ADD     5             FLAGG
N15  C                   ELSE
     C                   MOVE      *ZEROS        FLAGG
N15  C                   END
     C                   MOVE      USIDT         USIDT2            8
     C                   CALL      'RUBR28'
     C                   PARM                    XAVD
     C                   PARM                    XTDN
     C                   PARM                    WSBEL3
     C                   PARM                    WSVAL3
     C                   PARM                    UKURS             7 3
     C                   PARM                    FLAGG
     C                   PARM                    USIDT2
     C     FLAGG         IFEQ      1
     C                   MOVE      *BLANKS       WSFIF
     C                   MOVEL     'F15  ER '    WSFIF
     C                   MOVE      'BENYTTET'    WSFIF
     C                   MOVE      '999999'      WSFID
     C     UKURS         IFNE      0
     C                   MOVE      UKURS         WSVKU
     C                   END
     C                   ELSE
     C     WSFID         IFEQ      0
     C     WSFIF         OREQ      *BLANKS
     C                   MOVE      'SPD0011'     MSGNR
     C                   SETON                                        3079
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     49            POSNBR
     C                   END
     C                   END
     C                   GOTO      START2
     C                   END
     C*
     C* ----------- T E S T   B I L D E 0 2 ----------
     C                   EXSR      TESTB2
     C   30              GOTO      START2
     C   12              GOTO      START2
      *
      * ikke test godsnummer ved forenklet prosedyre
      *
     c     umode         ifne      'F'
N11  C     XXGN1B        IFNE      'D'
N11  C     XXGN8         ORNE      *BLANKS
N21  C                   EVAL      WSPOS9 = WSPOS
     C     SADH6K        SETLL     SADH6B
     C     SADH6K        READE     SADH6B                                 33
     C     *IN33         DOWEQ     '0'
     C     UAVD          IFNE      S6AVD
     C     WSTDN         ORNE      S6TDN
     C                   MOVE      'N'           WSJN
     C                   EXFMT     BILDE05
     C     WSJN          IFEQ      'N'
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     59            POSNBR
     C                   GOTO      ST21
     C                   END
     C                   LEAVE
     C                   END
     C     SADH6K        READE     SADH6B                                 33
     C  N33              ENDDO
N11  C                   END
     c                   end
      *
     C                   MOVE      *ZEROS        XOMRR
     C                   MOVE      *ZEROS        XKRSR
     C     WSDP          IFEQ      64
     C     WSDP          OREQ      65
     C     WSDP          OREQ      66
     C     WSDP          OREQ      49
     C                   EXSR      BKOST
     C   12              GOTO      START2
     C                   END
     C*
     C* ----- INGEN FEIL HITTIL     OPPDATER SAD -----
     C                   EXSR      CIFSR
     C  N08XBEL4         IFLT      0
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     62            POSNBR
     C                   MOVE      'YBC0876'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START2
     C                   END
      * test ryckattest OM VALGT ALLEREDE
N17  C     HEADFK        CHAIN     RUCKPU                             33
N17  C   33              exsr      rycksr
      *
     C                   EXSR      OPDSAD
     C*
     C*  08 = INNSTIKK
     C   08              DO
     C                   EXSR      PRINT
     C     UTYPE         IFEQ      'CR2'
     C                   MOVE      *ZEROS        WSTDN
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C                   END
      *
     C*...............................................
     C* REGISTRER TILLEGGSARK
     C*'''''''''''''''''''''''''''''''''''''''''''''''
     C*
     C                   EXSR      TOSADV
     C   12              GOTO      START2
     C     UTYPE         IFEQ      'CR2'
     C     *IN17         OREQ      '1'
     C                   MOVE      *ZEROS        WSTDN
     C  N03              DO
     C                   MOVE      *ZEROS        WSFRBN
     C                   MOVE      *ZEROS        WSNTK
     C                   MOVE      *ZEROS        WSVKB
     C                   MOVE      *BLANKS       WSVAL1
     C                   MOVE      *ZEROS        WSBEL1
     C                   MOVE      *BLANKS       WSVAL2
     C                   MOVE      *ZEROS        WSBEL2
     C                   MOVE      *BLANKS       WSFTG2
     C                   MOVE      *BLANKS       WSKDDK
     C                   MOVE      *ZEROS        WSKNK
     C                   MOVE      *BLANKS       WSRG
     C                   MOVE      *BLANKS       WSNAK
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      *ZEROS        WSKTA
     C                   MOVE      *ZEROS        WSKTB
     C                   MOVE      *BLANKS       WSKTC
     C                   MOVE      *BLANKS       WSLVT
     C                   MOVE      *ZEROS        WSBEL3
     C                   MOVE      *ZEROS        WSFID
     C                   MOVE      *BLANKS       WSFIF
     C                   MOVE      *BLANKS       WSDTG
     C                   MOVE      *BLANKS       WSTLL
     C                   MOVE      *BLANKS       WSTLE
     C                   MOVE      *ZEROS        SITDN
     C                   GOTO      START2
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C     SLUTT         TAG
N19  C                   IF        XNYTDK = 'N'
N19  C     SADHK         CHAIN     SADH                               33
N19  C  N33              IF        SIST = ' '
N19  C                   EXSR      HENTGMLST
N19  C                   UPDATE    SADHR
N19  C                   ELSE
N19  C                   UPDATE    SADHR
N19  C                   END
N19  C                   END
     C                   CLOSE     SAD061FM
     C*                    SETON                     LR
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C*
     C***********************************************
     C     BKOST         BEGSR
     C***********************************************
     C     WSVALR        IFEQ      *BLANKS
     C                   MOVE      WSVAL3        WSVALR
     C                   END
     C     WSBELR        IFEQ      0
     C     WSDP          ANDEQ     49
     C     WSBEL3        MULT(H)   0.2           WSBELR
     C                   END
     C                   WRITE     WINDOWSZ
     C     STBKST        TAG
     C                   EXFMT     BILDE03
     C                   MOVEA     '00'          *IN(98)
     C   04              DO
     C                   CALL      'SAD061F'
     C                   PARM                    WSVALR
     C                   PARM                    USIDT
     C                   GOTO      STBKST
     C                   END
     C   12              GOTO      SLBKST
     C                   MOVE      WSVALR        XVALKO
     C     KODVAK        SETGT     KODTVAL2
     C     WSVALR        READPE    KODTVAL2                               99
     C   99              GOTO      STBKST
     C     WSBELR        COMP      0                                      98
     C   98              GOTO      STBKST
     C                   MOVE      KVAOMR        XOMRR             3 0
     C     WSVALR        IFEQ      WSVAL3
     C                   MOVE      WSVKU         XKRSR
     C                   ELSE
     C                   MOVE      KVAKRS        XKRSR             7 3
     C                   END
      *
     C     SLBKST        ENDSR
      *
     C***********************************************
     C     SØKDT2        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
      * SØK AVSENDER
      *
     C     LINNBR        IFEQ      2
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     20
S01  C*                  EXSR      SØKUNR
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNS
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    WSNAS
N01  C                   IF        WSKNS <> 0
N01  C                   EXSR      TESTSS
N01  C                   END
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     49            POSNBR
     C                   GOTO      SLSØK2
     C                   END
      *
      * FRISØK AVSENDER
      *
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     1
     C     POSNBR        ANDLE     30
     c     wsnas         andne     *blanks
     C                   MOVE      WSNAS         NAVN             30
     C                   EXSR      FRISR
     c     kunde         ifne      *zeros
     C                   MOVE      *blanks       WSNAS
     C                   MOVE      *blanks       WSADS1
     C                   MOVE      *blanks       WSADS2
     C                   MOVE      *blanks       WSADS3
     c                   z-add     kunde         wskns
     c                   exsr      testss
     c                   end
     C                   GOTO      SLSØK2
     C                   END
      *
      * SØK MOTTAKER
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     20
S01  C*                  EXSR      SØKUNR
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNK
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    WSNAK
N01  C                   IF        WSKNK <> 0
N01  C                   EXSR      TESTKK
N01  C                   END
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK2
     C                   END
      *
      * SØK Foretaksnummer viser umiddelbart hvis kun 1
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     38
     c                   movel     wsrg          wsrg14
     c     kufokey       setll     cundlfo
     c     kufokey       reade     cundlfo                                33
     c     *in33         ifeq      '0'
     c     kufokey       reade     cundlfo                                33
      * 1 POST FUNNET
     c     *in33         ifeq      '1'
     C                   MOVE      *blanks       WSNAK
     C                   MOVE      *blanks       WSADK1
     C                   MOVE      *blanks       WSADK2
     C                   MOVE      *blanks       WSADK3
     c                   move      kundnr        wsknk
     c                   exsr      testkk
      * FLERE  POSTER  FUNNET
     C                   else
     C                   exsr      foresr
     c     kunde         ifne      *zeros
     C                   MOVE      *blanks       WSNAK
     C                   MOVE      *blanks       WSADK1
     C                   MOVE      *blanks       WSADK2
     C                   MOVE      *blanks       WSADK3
     c                   z-add     kunde         wsknk
     c                   exsr      testkk
     c                   end
     c                   end
      * INGEN  POSTER  FUNNET
     C                   ELSE
     C                   MOVE      'SHU0878'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLSØK2
     c                   end
     C                   GOTO      SLSØK2
     c                   end
     C*
      *
      * FRISØK MOTTAKER
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     1
     C     POSNBR        ANDLE     30
     C     WSNAK         andne     *blanks
     C                   MOVE      WSNAK         NAVN
     C                   EXSR      FRISR
     c     kunde         ifne      *zeros
     C                   MOVE      *blanks       WSNAK
     C                   MOVE      *blanks       WSADK1
     C                   MOVE      *blanks       WSADK2
     C                   MOVE      *blanks       WSADK3
     c                   z-add     kunde         wsknk
     c                   exsr      testkk
     c                   end
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      1
     C     POSNBR        ANDGE     68
     C     POSNBR        ANDLE     69
     C                   MOVE      'J'           UIMP              1
     C                   CALL      'SAD061E'
     C                   PARM                    WSDP
     C                   PARM                    UIMP
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     42
     C                   CALL      'SAD061F'
     C                   PARM                    WSVAL1
     C                   PARM                    USIDT
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     58
     C     POSNBR        ANDLE     60
     C                   CALL      'SAD061F'
     C                   PARM                    WSVAL2
     C                   PARM                    USIDT
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      9
     C     POSNBR        ANDGE     56
     C     POSNBR        ANDLE     57
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKA
     C                   PARM                    USPED
     C                   Z-ADD     69            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     53
     C     POSNBR        ANDLE     55
     C                   MOVE      'N'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSLV
     C                   PARM                    USPED
     C                   Z-ADD     57            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     29
     C     POSNBR        ANDLE     30
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKT
     C                   PARM                    USPED
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     42
     C                   CALL      'SAD061F'
     C                   PARM                    WSVAL3
     C                   PARM                    USIDT
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C     LINNBR        IFEQ      15
     C     POSNBR        ANDGE     18
     C     POSNBR        ANDLE     19
     C                   CALL      'SAD061I'
     C                   PARM                    WSTRM
     C                   Z-ADD     49            POSNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     29
     C     POSNBR        ANDLE     30
     C                   CALL      'SAD061P'
     C                   PARM                    WSKDLS
     C                   Z-ADD     59            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C* KALKULATOR ANTALL
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     49
     C     POSNBR        ANDLE     55
     C                   Z-ADD     WSNTK         UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSNTK
     C                   Z-ADD     1             POSNBR
     C                   Z-ADD     4             LINNBR
     C                   GOTO      SLSØK2
     C                   END
     C* KALKULATOR BRUTTOVEKT
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     69
     C     POSNBR        ANDLE     77
     C                   Z-ADD     WSVKB         UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSVKB
     C                   Z-ADD     1             POSNBR
     C                   Z-ADD     6             LINNBR
     C                   GOTO      SLSØK2
     C                   END
     C* KALKULATOR FRAKTBELØP
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     44
     C     POSNBR        ANDLE     55
     C                   Z-ADD     WSBEL1        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSBEL1
     C                   Z-ADD     58            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C* KALKULATOR ANDRE KOSTNADER
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     62
     C     POSNBR        ANDLE     73
     C                   Z-ADD     WSBEL2        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSBEL2
     C                   Z-ADD     77            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C* KALKULATOR FAKTURASUM
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     44
     C     POSNBR        ANDLE     57
     C                   Z-ADD     WSBEL3        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSBEL3
     C                   Z-ADD     60            POSNBR
     C                   GOTO      SLSØK2
     C                   END
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK2        ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        HEUNIK
     C                   MOVE      *BLANKS       HEREFF
     C                   MOVE      *ZEROS        HEOPD
     C                   MOVE      *BLANKS       UFT
     C                   MOVE      *BLANKS       HEVS1
     C                   MOVE      *BLANKS       HEVS2
N19  C                   MOVE      *BLANKS       XSISTGML          1
     C*** TEST OM DET ER SJØ-OPPDRAG
     C     FIURBI        IFNE      'N'
     C     BILLK         CHAIN     BILLOF                             33
     C   33              MOVE      WSUR          BLUR
     C     BLUR          COMP      'F'                                    35
     C                   ELSE
     C                   MOVE      *BLANKS       BLUR
     C                   SETOFF                                       35
     C                   END
      *
      * henter fra eksterref
      *
     C     *IN04         IFEQ      '1'
     C     LINNBR        ANDEQ     7
     C                   CALL      'SYGE47R'
     C                   PARM      'A'           UHEUR             1
     C                   PARM                    EXTREF
     C                   EVAL      *IN04=*OFF
     C     EXTREF        IFEQ      *BLANKS
     C                   EVAL      *IN30=*ON
     C                   GOTO      SLTB1
     C                   ENDIF
     C                   ENDIF
      *
     C     UTYPE         IFNE      'CPY'
     C     EXTREF        IFNE      *BLANKS
     C     UAVD          CHAIN(N)  STANDI                             99
     C  N99KODSIK        CHAIN     KOSIR                              99
     C  N99              DO
     C     EXTREFK       CHAIN     FRISOL01                           99
      *
      * allerede flyttet til sysped
      *
     C  N99              MOVE      FSOPD         WSTDN
     C  N99              MOVE      FSAVD         UAVD
      * Ny ekstern ref  - hent data
     C   99              DO
     C     SIEKST        ifeq      'J'
     c                   move      *zeros        nyopd             7 0
     C                   CALL      'SADEXT'
     C                   PARM                    UAVD
     C                   PARM                    EXTREF
     C                   PARM                    nyopd
     C                   PARM                    WSSG
     C                   MOVE      nyopd         WSTDN
     C     WSTDN         IFEQ      0
     C                   SETON                                        30
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   MOVE      'SHU1172'     MSGNR
     C                   GOTO      SLTB1
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   End
     C*** TEST AVDELING
     C     UAVD          CHAIN(N)  STANDI                             95
     C  N95              DO
     C                   MOVE      *BLANKS       SIST
     C                   MOVE      *ZEROS        SITDN
     C     *LIKE         DEFINE    SITOLK        XTOLK
     C                   MOVE      SITOLK        XTOLK
     C                   END
     C   95              DO
     C                   MOVE      'SPA0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTB1
     C                   END
     C*** TEST TARIFFØR
     C     KODSIK        CHAIN     KOSIR                              99
     C   99              DO
     C                   MOVE      'SPS0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTB1
     C                   END
     C*
     C                   MOVE      'J'           XNYTDK            1
     C*** TEST OM TASTET TOLLDEKNR./FRAKTBREVNR. ER RIKTIG
     C     UTYPE         IFEQ      'CPY'                                        1<-B
     C     SADHKK        CHAIN(N)  SADH                               33
     C                   ELSE                                                   1
     C     WSFRBN        IFEQ      0                                             2<-B
     C* WSTDN = 0  --> HENT STANDARD SAD-OPPLYSNINGER
     C     WSTDN         IFNE      0                                              3<-B
     C     SADHK         CHAIN     SADH                               33
     C  N33SIST          IFEQ      'F'
     C     UMODE         ANDNE     'F'
     C                   MOVE      'SHU1056'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   UPDATE    SADHR
     C                   GOTO      SLTB1
     C                   END
     C  N33SIST          IFNE      ' '                                             4<-B
     C     SIST          ANDNE     'F'
     C     SIST          ANDNE     'K'
     C     SIST          ANDNE     'M'
     C     SIST          ANDNE     'U'
     C     SIST          IFEQ      '1'
     C                   UPDATE    SADHR
     C                   CALL      'SAD061S'
     C                   PARM                    SIAVD
     C                   PARM                    SITDN
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      0
     C     SADHK         CHAIN     SADH                               33
     C                   ELSE
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   ELSE
     C     SIST          COMP      'P'                                9898
     C   98SIST          COMP      'Q'                                9898
     C                   END
     C                   END                                                       4<-E
     C  N33
     CANN98SIST          IFEQ      'K'                                             4<-B
     C     SIWS          COMP      UWS                                9898
     C                   END                                                       4<-E
      *
     C  N33
     CANN98              DO                                                        4<-B
     C                   EXSR      TSTM
     C   98              UPDATE    SADHR
     C   98              GOTO      SLTB1
     C                   END                                                       4<-E
      *
N19  C  N33
N19  CANN98              MOVE      SIST          XSISTGML
     C  N33
     CANN98              MOVE      'E'           SIST
     C  N33              UPDATE    SADHR
     C  N33              MOVE      'N'           XNYTDK
     C*
     C* SIMI = I  BETYR TIDLIGERE INNSTIKK
     C  N33
     CANN98SIMI          COMP      'I'                                    28
     C*
     C   33HEADFK        CHAIN     HEADF                              98
     C   33
     CANN98HEST          COMP      'S'                                    98
     C* HENT HEADOPPLYSN. OGSÅ O SAD EKSISTERER - 96=ARBEIDSVARIABEL
     C  N33HEADFK        CHAIN     HEADF                              96
     C  N33
     CANN96HEST          COMP      'S'                                    96
     C                   END                                                      3<-E
     C   98              DO                                                       3<-B
     C                   MOVE      'SPT0028'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTB1
     C                   END                                                      3<-E
     C                   ELSE                                                    2
     C     DOKUFK        CHAIN(N)  DOKUF                              97
     C  N97DFST2         COMP      'T'                                    97
     C  N97              SETON                                        33
     C   97              DO                                                       3<-B
     C                   MOVE      'SPF0028'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTB1
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C*** TEST KOMMUNIKASJON
     C     XTOLK         COMP      'J'                                9696
     C   96WSTOLK        COMP      'J'                                    96
     C   96              DO
     C                   MOVE      'SPK0036'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTB1
     C                   END
     C* TEST OM DET SKAL SENDES PÅ TVINN  (99 ON = DENNE SENDES TVINN)
     C     WSTOLK        COMP      'J'                                    29
     C  N29              MOVE      'J'           WSTVIN
     C*
      *  04 = PLUKK FRA Z-FIL
     C  N30*IN04         IFEQ      '1'
     C                   CALL      'SAD061G'
     C                   PARM                    FIFIRM
     C                   PARM                    UZAVD
     C                   PARM                    UZTDN
     C                   PARM                    UZREFF
     C                   PARM                    UZUNIK
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     1             SLTB1
     C                   ELSE
     C                   MOVE      *ZEROS        UZAVD             4 0
     C                   MOVE      *ZEROS        UZTDN             7 0
     C                   MOVE      *BLANKS       UZREFF           17
     C                   MOVE      *ZEROS        UZUNIK            9 0
     C                   END
     C*** HENT OPPLYSNINGER FRA HEADF/DOKUF
     C  N30
     CAN 33              EXSR      SRU1
     C*
     C*** FLYTT DATA FRA FIL-VARIABLER TIL WS-VARIABLER
     C  N30              EXSR      MOVW2
     C  N30*IN04         IFEQ      '1'
     C     HEREFF        ORNE      *BLANKS
     C                   EXSR      HZFIL
     C                   END
     C     USIDT         IFEQ      0
     C                   MOVE      WDT           USIDT
     C                   END
      *
      * KAN IKKE BLANKE NY FAKTOR
      *
     C     WSBVNV        IFEQ      *ZEROS
     C                   Z-ADD     0.9           WSBVNV
     C                   END
     C*
     C     SLTB1         ENDSR
     C*
     C***********************************************
     C     TSTM          BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        USIDT
      *
      * Test om det finnes sending i "postkasse"
     C     TVINMK        SETGT     EDIM1
     C     STTSTM        TAG
     C     TVINMK        READPE    EDIM1                                  98
     C  N98MSR           IFEQ      'S'
     C     M1001         ANDEQ     '929'
     C   10              DELETE    EDIMR
     C   10              GOTO      SLTSTM
     C                   UPDATE    EDIMR
     C                   MOVE      'SPT0043'     MSGNR
     C                   SETON                                        3098
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTSTM
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   GOTO      STTSTM
     C                   END
      *
      * Test om det har fått tollkvittering
     C     TVIM4K        SETLL     EDIM4                              98
     C     STTST2        TAG
     C     TVI41K        READPE    EDIM4                                  98
     C  N98MST           IFEQ      'D'
     C     M1001         ORNE      '929'
     C                   GOTO      STTST2
     C                   ELSE
     C     M1N07         IFEQ      'DTK'
     C                   MOVE      'YBC0012'     MSGNR
     C                   SETON                                        3098
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTSTM
     C                   END
     C     M1N07         IFEQ      'DUA'
     C     SIMI          ANDNE     'I'
     C     MMN           SETLL     TVINF
     C     MMN           READE     TVINF                                  33
     C     *IN33         DOWEQ     '0'
     C     F0078A        IFEQ      '951'
N04  C     F0078A        OREQ      '962'
     C                   MOVE      M0068A        USIDT
     C                   GOTO      SLTSTM
     C                   END
     C     MMN           READE     TVINF                                  33
     C  N33              ENDDO
     C                   MOVE      '0'           *IN33
     C                   MOVE      'YBC0012'     MSGNR
     C                   SETON                                        3098
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLTSTM
     C                   END
     C     M1N07         IFEQ      'DFI'
     C     M0068C        ANDEQ     1
     C                   GOTO      STTST2
     C                   END
     C     M1N07         IFNE      'DII'
     C                   MOVE      M0068A        USIDT
     C                   END
     C                   END
     C                   MOVE      '0'           *IN98
     C*
     C     SLTSTM        ENDSR
     C*
N19   ***********************************************
N19  C     HENTGMLST     BEGSR
N19   ***********************************************
N19   *
N19  C     TVIM4K        SETLL     EDIM4                              33
N19  C     STHENT01      TAG
N19  C     TVI41K        READPE    EDIM4                                  33
N19  C  N33              SELECT
N19  C                   WHEN      MST = 'D' OR M1001 <> '929'
N19  C                   GOTO      STHENT01
N19  C                   WHEN      M1N07 = 'DUA'
N19  C                   MOVE      'U'           SIST
N19  C                   OTHER
N19  C                   MOVE      'M'           SIST
N19  C                   ENDSL
N19   *
N19  C                   ENDSR
N19   *
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C*** TEST DEKLARASJONSTYPE
     C     WSDTY         COMP      '  '                                   99
     C*
     C*** TEST DEKLARASJONSKODE
     C  N08KODS1K        CHAIN     KOS1R                              98
     C  N98WSDP          IFEQ      66
     C                   MOVE      'SJ'          WSLKA
     C                   END
     C                   IF        ((WSDP>=64) AND (WSDP<=66))
     C                   IF        WSFTG2 = '+'
     C                   MOVE      'P'           WSFTG2
     C                   END
     C                   END
     C*
     C*** TEST AVSENDER
     C     WSKNS         IFNE      0
     C                   EXSR      TESTSS
     C                   END
     C  N97WSNAS         COMP      *BLANKS                                97
     C  N97
     CAN 29WSADS1        COMP      *BLANKS                                96
     C  N97
     CAN 29
     CAN 96WSADS2        COMP      *BLANKS                                96
     C  N97
     CAN 29
     CAN 96WSADS3        COMP      *BLANKS                                96
     C*
     C*** TEST ANTALL KOLLI
     C     WSNTK         COMP      0                                    9595
     C*
     C*** TEST BRUTTO VEKT
     C     WSVKB         COMP      0                                    9393
     C*
     C*** TEST MOTTAKER
     C     WSKNK         IFNE      0
     C                   EXSR      TESTKK
     C                   END
     C     PTFDT         IFLE      WDT80
     C     WSRG          COMP      *BLANKS                                76
     C                   END
     C  N92WSNAK         COMP      *BLANKS                                92
     C*
     C*** TEST TOLL/MVA  K/S/I
     C     WSSKI         COMP      'S'                                    33
     C   33WSKTC         IFEQ      ' '
     C                   MOVE      *ZEROS        WSKTA
     C                   MOVE      *ZEROS        WSKTB
     C                   END
     C     WSSKI         COMP      'K'                                    33
     C   33WSKTA         COMP      0                                  9494
     C     WSKTA         COMP      0                                      33
     C  N33WSKTC         IFEQ      '8'
     C     WSKTC         OREQ      '9'
     C                   MOVE      '1'           *IN33
     C                   END
     C   33WSSKI         COMP      ' '                                    94
     C     HEKDFS        IFNE      'X'
     C     WSSKI         COMP      'S'                                3333
     C                   END
     C     HEKDFK        IFNE      'X'
     C   33WSSKI         COMP      'K'                                3333
     C                   END
     C   33WSSKI         COMP      ' '                                3333
     C   33WSSKI         COMP      'I'                                3333
     C   33              SETON                                        94
     C*
     C*** TEST VALUTAKODE TIL ANDRE KOSTNAD
     C                   MOVE      WSBEL2        XBELB             5 2
     C                   MOVE      WSVAL2        XVALB             3
     C     WSVAL2        IFEQ      'P  '
     C     WSBEL3        DIV       100           XWORK
     C     XWORK         MULT      WSBEL2        XBEL2            11 2
     C                   MOVE      WSVAL3        XVAL2             3
     C                   ELSE
     C     WSVAL2        IFEQ      'F  '
     C                   MOVE      WSVAL3        XVAL2
     C     WSBEL2        SUB       WSBEL3        XBEL2
     C     WSBEL2        IFGT      WSBEL3
     C                   MOVE      '+'           WSFTG2
     C                   ELSE
     C                   MOVE      '-'           WSFTG2
     C                   END
     C                   ELSE
     C                   MOVE      WSBEL2        XBEL2
     C                   MOVE      WSVAL2        XVAL2
     C                   END
     C                   END
     C  N08              DO
     C     XVAL2         IFEQ      *BLANKS
     C                   MOVE      FICURR        XVAL2
     C                   END
     C                   MOVE      XVAL2         XVALKO
     C     KODVAK        SETGT     KODTVAL2
     C     XVAL2         READPE    KODTVAL2                               91
     C  N91              MOVE      KVAOMR        XOMR2             3 0
     C  N91              MOVE      KVAKRS        XKRS2             7 3
     C                   END
     C*
     C*** SJEKK +/- TEGN
     C     WSFTG2        IFEQ      ' '
     C                   MOVE      '+'           WSFTG2
     C                   END
     C*
     C*** TEST AVSENDER-/UTFØRSELSLAND
     C                   MOVE      WSLKA         XLANDK
     C     KODS2K        CHAIN     KOS2R                              90
     C*
     C*** TEST OM DEKL.KODE SAMSVARER MED LANDKODE
     C  N08
     CANN99
     CANN90WSDTY         IFEQ      'EU'
     C     KS2PRE        COMP      'A'                                6969
     C   69KS2PRE        COMP      'B'                                6969
     C   69KS2PRE        COMP      'C'                                6969
     C                   ELSE
     C     KS2PRE        COMP      'A'                                    69
     C  N69KS2PRE        COMP      'B'                                    69
     C  N69KS2PRE        COMP      'C'                                    69
     C                   END
     C*
     C*** TEST LEVERINGSVILKÅR
     C   08WSLV          IFNE      *BLANKS
     C     KODLBK        CHAIN     KODTLB                             89
     C                   END
     C  N08KODLBK        CHAIN     KODTLB                             89
     C  N08
     CANN89              MOVE      KLBKT         XLV2              3
     C     WSLVT         IFEQ      *BLANKS
     C     KLBHAD        ANDNE     ' '
     C                   EXSR      HENTAD
     C                   END
     C  N08WSLVT         COMP      *BLANKS                                88
     C*
     C*** TEST FRAKT
     C  N08
     CANN89
     CANN88              DO
     C     WSBEL1        COMP      0                                  33
     C   33KLBFRK        COMP      'J'                                8787
     C  N33KLBFRK        COMP      'N'                                8787
     C     KLBFRK        IFEQ      'F'
     C                   SETOFF                                       87
     C                   END
     C     WSVAL1        IFEQ      *BLANKS
     C  N87              MOVE      FICURR        WSVAL1
     C                   END
     C                   MOVE      WSVAL1        XVALKO
     C     KODVAK        SETGT     KODTVAL2
     C     WSVAL1        READPE    KODTVAL2                               86
     C  N86              MOVE      KVAOMR        XOMR1             3 0
     C  N86              MOVE      KVAKRS        XKRS1             7 3
     C                   END
     C*
     C*          Postsending skal ALLTID ha transportmåte 50
     C* RETTELSE POST SENDING  FJERNET GAMMEL LOGIKK
     C     XXGN1B        IFEQ      'P'
     C     XXGN8         ANDEQ     *BLANKS
     C                   MOVE      50            WSTRM
     C                   END
     C*
     C*** TEST TRANSPORTMIDLETS INDENTITET OG NASJONALITET
     C  N08              DO
     C     WSTRM         COMP      20                                 8585
     C   85WSTRM         COMP      23                                 8585
     C   85WSTRM         COMP      24                                 8585
     C   85WSTRM         COMP      50                                 8585
     C   85WSTRM         COMP      60                                 8585
     C   85WSTRM         COMP      70                                 8585
     C   85WSTRM         COMP      80                                 8585
     C   85              MOVE      WSLKT         XLANDK
     C   85KODS2K        CHAIN     KOS2R                              85
     C                   END
     C*
     C*** TEST FAKTURA SUM
     C                   MOVE      'N'           ULVERD            1
     C   08WSVAL3        IFEQ      *BLANKS                                      1<-B
     C     WSBEL3        ANDEQ     0
     C                   GOTO      STTB21
     C                   END                                                    1<-E
     C                   MOVE      WSVAL3        XVALKO
     C     KODVAK        SETGT     KODTVAL2
     C     WSVAL3        READPE    KODTVAL2                               83
     C  N83              MOVE      KVAOMR        XOMRF             3 0
     C  N83WSVKU         IFEQ      0                                            1<-B
     C                   MOVE      KVAKRS        WSVKU
     C                   END                                                    1<-E
     C     WSVAL2        IFEQ      WSVAL3
     C     WSBEL2        ANDNE     *ZEROS
     C                   MOVE      WSVKU         XKRS2
     C                   END
     C  N83WSBEL3        COMP      0                                    8484
     C  N83
     CANN84WSBEL3        IFLE      KVAGV
     C                   MOVE      'J'           ULVERD
     C                   END
     C     STTB21        TAG
     C*
     C*** TEST TRANSASJONSTYPE
     C  N08KODS3K        CHAIN     KOS3R                              82
     C*
     C*** TEST TRANSPORTMÅTE
     C  N08KODS4K        CHAIN     KOS4R                              81
     C* DERSOM DET ER  50 MÅ GODSNR VISE POSTSENDING
     C  N08
     CANN81WSTRM         IFEQ      50
     C     XXGN1B        COMP      'P'                                8181
     C  N81XXGN8         COMP      *BLANKS                            8181
     C                   END
     C*
     C*** TEST RUBR.28 (FINANSIELLE OPPLYSNINGER OG BANKDATA)
     C  N08WSFID         COMP      0                                      79
     C  N08
     CANN79              DO
     C                   MOVE      WSFID         XMMÅÅ             4 0
     C                   MOVE      XMMÅÅ         XÅR               2 0
     C                   MOVEL     XMMÅÅ         XMND              2 0
     C                   MOVEL     WSFID         XDAG              2 0
     C     WSFID         IFNE      999999
     C                   CALL      'TESTDATO'
     C                   PARM                    XDAG
     C                   PARM                    XMND
     C                   PARM                    XÅR
     C                   PARM                    FLAGG             1 0
     C     FLAGG         COMP      1                                      79
     C                   IF        *IN79 = *OFF
     C                   EVAL      XFDT = 20000000 + WSFIDÅ * 10000
     C                             + WSFIDM * 100 + WSFIDD
     C     XFDT          COMP      WDT80                              79
     C                   END
     C                   END
     C                   END
     C*
     C*** LAGRINGSSTED
     C     WSKDLS        CHAIN     KODTSD                             80
     C  N80WSLS          IFEQ      *BLANKS
     C                   MOVE      KSDTXT        WSLS
     C                   END
     C*
     C*** TEST GODSNR. OG POSISJON
     C     WSGN          COMP      *BLANKS                                78
     C     *IN78         IFEQ      '0'
     C     XXGN8         IFNE      *BLANKS
     C* Ved ordin. godsnr... MÅ fylle ut konnossementsnr
     C     WSPOS         COMP      *BLANKS                                77
     C                   ELSE
     C* Ved spesialverdi (kun en lang)......
     C*  Hvis post/Reisegods/Grensefortollet.. KAN IKKE fylle ut konn.
     C     XXGN1B        IFEQ      'P'
     C     XXGN1B        OREQ      'R'
     C     XXGN1B        OREQ      'D'
     C     WSPOS         COMP      *BLANKS                            7777
     C                   END
     C*  andre spesial 1 lang  VALGFRITT (Jernbane(J) Ekspress(E)...)
     C                   END
     C                   END
     C*
     C*** TEST HAVN, TRAFIKKAVGIFT OG AVGIFTSATS
     C  N08              DO
     C     WSTRM         COMP      10                                 33  33
     C   33WSTRM         COMP      17                                   3333
     C*
     C                   END
      *
     C*** FOR AVD. MED TVINN-INNSTIKK TATT TVINN/OPPGJØR I TVINN
     C*** DERSOM MANUELT OPPGJØR/INNSTIKK - SJEKK TADLOGG FOR "DFO"
     C*** (INDIKATOR 29 PÅ BETYR OPPGJØR PÅ INNSTIKK)
     C  N08
     CANN29
     CAN 28XTOLK         IFEQ      'J'
     C     TVIM2K        SETLL     EDIM4                              33
     C                   SETOFF                                       73
     C     STTB22        TAG
     C     TVI21K        READE     EDIM4                                  33
     C  N33MST           IFEQ      'D'
     C     M1001         ORNE      '929'
     C     M0065         ORNE      'CUSDEC'
     C                   GOTO      STTB22
     C                   ELSE
     C     M1N07         COMP      'DFO'                                  73
     C                   END
     C                   END
     C*
     C   08              DO
     C* RUB 31
     C     WSFT1         IFEQ      *BLANKS
     C                   MOVEL     HEVS1         WSFT1
     C                   END
     C     WSFT1         COMP      *BLANKS                                72
     C     WSTOLK        IFEQ      'J'
     C     XFT1S         COMP      *BLANKS                            6868
     C                   ELSE
     C                   SETOFF                                       68
     C                   END
     C                   END
     C* RUB 44
     C   08
     CAN 29              DO
     C     WFFOR         IFNE      '.  '
     C                   MOVE      'FOR'         WFFOR
     C     WFBLAN        COMP      ' '                                7070
     C     WFFORK        COMP      '0'                                  71
     C  N71WFFORK        COMP      '9'                                71
     C                   END
     C                   END
     C*
     C     WSDP          IFEQ      70
     C     WSDP          OREQ      72
     C                   MOVEA     '000'         *IN(77)
     C     WSVAL3        IFEQ      *BLANKS
     C     WSBEL3        ANDEQ     0
     C                   MOVEA     '00000000'    *IN(82)
     C                   ELSE
     C                   MOVE      '0'           *IN(82)
     C                   MOVEA     '000000'      *IN(84)
     C                   END
     C                   SETOFF                                       9094
     C                   END
      * PROS.=70,72,74,76 ---> IKKE TEST RUBR. 21,28
      * PROS.=73,77,47    ---> IKKE TEST RUBR. 28
     C     WSDP          IFEQ      70
     C     WSDP          OREQ      72
     C     WSDP          OREQ      74
     C     WSDP          OREQ      76
     C                   SETOFF                                       8579
     C                   END
     C     WSDP          IFEQ      73
     C     WSDP          OREQ      77
     C     WSDP          OREQ      47
     C     WSDP          OREQ      48
     C                   SETOFF                                       79
     C                   END
      *
     C                   IF        ((WSTST = 9) AND (WSDFVF = 1))
     C                   MOVE      *ON           *IN67
     C                   END
      *
     C                   EXSR      HMSG
     C*
     C  N30WSKTC         IFEQ      '8'
     C     WSKTC         OREQ      '9'
     C     WSKDDK        IFNE      'K'
     C                   MOVE      'D'           WSKDDK
     C                   END
     C                   ELSE
     C     WSKTA         IFEQ      0
     C     WSKDDK        IFNE      'K'
     C                   MOVE      'D'           WSKDDK
     C                   END
     C                   ELSE
     C     WSKDDK        IFEQ      'D'
     C     STTB23        TAG
     C                   EXFMT     BILDE04
     C   12
     COR 23              GOTO      SLTB2
     C                   GOTO      STTB23
     C                   END
     C                   MOVE      ' '           WSKDDK
     C                   END
     C                   END
     C*
     C     SLTB2         TAG
     C                   ENDSR
     C*
     C***********************************************
     C     HMSG          BEGSR
     C***********************************************
     C   99              MOVE      'SPD0008'     MSGNR
     C   69
     CANN99              MOVE      'SPD0009'     MSGNR
     C   69              SETON                                        99
     C   99              DO
     C                   SETON                                        30
     C                   Z-ADD     1             LINNBR
     C                   Z-ADD     65            POSNBR
     C                   END
     C   98
     CANN30              DO
     C                   MOVE      'SPD0010'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     1             LINNBR
     C                   Z-ADD     68            POSNBR
     C                   END
     C   97
     CANN30              DO
     C                   MOVE      'SPK0037'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     1             POSNBR
     C                   END
     C   95
     CANN30              DO
     C                   MOVE      'SPN0003'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     49            POSNBR
     C                   END
     C   96
     CANN30              DO
     C                   MOVE      'SPA0025'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     1             POSNBR
     C                   END
     C   94
     CANN30              DO
     C     WSKTC         IFEQ      ' '
     C                   MOVE      'SPS0040'     MSGNR
     C                   ELSE
     C                   MOVE      'YBC0221'     MSGNR
     C                   END
     C                   SETON                                        30
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     48            POSNBR
     C                   END
     C   93
     CANN30              DO
     C                   MOVE      'SPV0002'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     69            POSNBR
     C                   END
     C   76
     CANN30              DO
     C                   MOVE      'YBC1828'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     28            POSNBR
     C                   END
     C   92
     CANN30              DO
     C                   MOVE      'SPK0038'     MSGNR
     C     WSKTA         IFEQ      99999
     C                   MOVE      'JOV0080'     MSGNR
     C                   END
     C                   SETON                                        30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     1             POSNBR
     C                   END
     C   86
     CANN30              DO
     C                   MOVE      'SPV0012'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   END
     C   87
     CANN30              DO
     C                   MOVE      'SPB0004'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     44            POSNBR
     C                   END
     C   91
     CANN30              DO
     C                   MOVE      'SPV0013'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     58            POSNBR
     C                   END
     C   90
     CANN30              DO
     C                   MOVE      'SPL0013'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     56            POSNBR
     C                   END
     C   89
     CANN30              DO
     C                   MOVE      'SPL0014'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     53            POSNBR
     C                   END
     C   88
     CANN30              DO
     C                   MOVE      'SPL0015'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     57            POSNBR
     C                   END
     C   85
     CANN30              DO
     C                   MOVE      'SPL0016'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     29            POSNBR
     C                   END
     C   83
     CANN30              DO
     C                   MOVE      'SPV0014'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     40            POSNBR
     C                   END
     C   84
     CANN30              DO
     C                   MOVE      'SPB0005'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     44            POSNBR
     C                   END
     C   82
     CANN30              DO
     C                   MOVE      'SPT0029'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     73            POSNBR
     C                   END
     C   81
     CANN30              DO
     C     WSTRM         IFEQ      50
     C                   MOVE      'JOV0310'     MSGNR
     C                   ELSE
     C                   MOVE      'SPT0030'     MSGNR
     C                   END
     C                   SETON                                        30
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     18            POSNBR
     C                   END
     C   79
     CANN30              DO
     C                   MOVE      'SPD0011'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     49            POSNBR
     C                   END
     C   80
     CANN30              DO
     C                   MOVE      'SPL0020'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     29            POSNBR
     C                   END
     C   78
     CANN30              DO
     C                   MOVE      'SPG0008'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     59            POSNBR
     C                   END
     C   77
     CANN30              DO
     C     XXGN8         IFNE      *BLANKS
     C                   MOVE      'JOV0308'     MSGNR                           *ORD.GODSN.
     C                   ELSE
     C                   MOVE      'JOV0309'     MSGNR                           *SPES Gn.
     C                   END
     C                   SETON                                        30
     C                   Z-ADD     17            LINNBR
     C                   Z-ADD     59            POSNBR
     C                   END
     C   72
     CANN30              MOVE      'SPF0028'     MSGNR
     C   68
     CANN30
     CANN72              MOVE      'SPF0029'     MSGNR
     C   68              SETON                                        72
     C   72
     CANN30              DO
     C                   SETON                                        30
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     5             POSNBR
     C                   END
     C   71
     CANN30              MOVE      'SPF0030'     MSGNR
     C   70
     CANN30              MOVE      'SPF0031'     MSGNR
     C   70              SETON                                        71
     C   71
     CANN30              DO
     C                   SETON                                        30
     C                   Z-ADD     20            LINNBR
     C   71
     CANN70              Z-ADD     9             POSNBR
     C   71
     CAN 70              Z-ADD     8             POSNBR
     C                   END
     C   73
     CANN30              DO
     C                   MOVE      'SPD0012'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     21            LINNBR
     C                   Z-ADD     53            POSNBR
     C                   END
     C   67
     CANN30              DO
     C                   MOVE      'YBC1940'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTAD        BEGSR
     C***********************************************
     C     KLBHAD        IFEQ      'A'
     C*
     C     WSADS3        IFNE      *BLANKS
     C                   MOVEL     WSADS3        WSLVT
     C                   ELSE
     C     WSADS2        IFNE      *BLANKS
     C                   MOVEL     WSADS2        WSLVT
     C                   ELSE
     C                   MOVEL     WSADS1        WSLVT
     C                   END
     C                   END
     C*
     C                   ELSE
     C* KLBHAD = 'M'
     C     WSADK3        IFNE      *BLANKS
     C                   MOVEL     WSADK3        WSLVT
     C                   ELSE
     C     WSADK2        IFNE      *BLANKS
     C                   MOVEL     WSADK2        WSLVT
     C                   ELSE
     C                   MOVEL     WSADK1        WSLVT
     C                   END
     C                   END
     C*
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVW2         BEGSR
     C***********************************************
     C                   MOVEL     SITRT         WSSLAA
     C                   MOVE      SIDFVF        WSDFVF
     C                   MOVE      SIDTY         WSDTY
     C                   MOVE      EXTREF        WSTREF
     C                   MOVE      SIDP          WSDP
     C                   MOVE      SIKNS         WSKNS
     C                   MOVE      SINAS         WSNAS
     C                   MOVE      SIADS1        WSADS1
     C                   MOVE      SIADS2        WSADS2
     C                   MOVE      SIADS3        WSADS3
     C                   MOVE      SINTK         WSNTK
     C                   MOVE      SISKI         WSSKI
     C                   MOVE      SIKDDK        WSKDDK
     C                   MOVE      SIVKB         WSVKB
     C                   MOVE      SIKNK         WSKNK
     C                   MOVE      SIRG          WSRG
     C                   MOVE      SINAK         WSNAK
     C                   MOVE      SIADK1        WSADK1
     C                   MOVE      SIADK2        WSADK2
     C                   MOVE      SIADK3        WSADK3
     C                   MOVE      SIVAL1        WSVAL1
     C                   MOVE      SIBEL1        WSBEL1
     C     SIVALB        IFEQ      'P  '
     C                   MOVE      SIVALB        WSVAL2
     C                   Z-ADD     SIBELB        WSBEL2
     C                   ELSE
     C     SIVAL2        IFEQ      'F  '
     C                   MOVE      SIVAL2        WSVAL2
     C     SIFTG2        IFEQ      '+'
     C     SIBEL3        ADD       SIBEL2        WSBEL2
     C                   ELSE
     C     SIBEL3        SUB       SIBEL2        WSBEL2
     C                   END
     C                   ELSE
     C                   MOVE      SIVAL2        WSVAL2
     C                   MOVE      SIBEL2        WSBEL2
     C                   END
     C                   END
     C                   MOVE      SIFTG2        WSFTG2
     C                   MOVE      SILKA         WSLKA
     C     SIRABX        IFEQ      *BLANKS
     C     SIRABY        OREQ      *BLANKS
     C                   MOVE      *ZEROS        WSRAB
     C                   ELSE
     C                   MOVE      SIRAB         WSRAB
     C                   END
     C                   MOVE      SIKDC         WSKDC
     C                   MOVE      SITLF         WSTLF
     C                   MOVE      SINAD         WSNAD
     C                   MOVE      SILV          WSLV
     C                   MOVE      SILVT         WSLVT
     C                   MOVE      SITRID        WSTRID
     C                   MOVE      SILKT         WSLKT
     C                   MOVE      SIVAL3        WSVAL3
     C                   MOVE      SIBEL3        WSBEL3
     C                   MOVE      SIVKU         WSVKU
     C                   MOVE      SITST         WSTST
     C                   MOVE      SITRM         WSTRM
     C                   MOVE      SIFIF         WSFIF
     C                   MOVE      SIFIDD        WSFIDD
     C                   MOVE      SIFIDM        WSFIDM
     C                   MOVE      SIFIDÅ        WSFIDÅ
     C                   MOVE      SILS          WSLS
     C                   MOVE      SIKDLS        WSKDLS
     C                   MOVE      SIKTA         WSKTA
     C                   MOVE      SIKTB         WSKTB
     C                   MOVE      SIKTC         WSKTC
     C                   MOVE      SIGN          WSGN
S21  C*                  MOVE      SIPOS         WSPOS
N21  C                   EVAL      WSPOS = SIPOS
     C                   MOVE      SIFT1         WSFT1
     C                   MOVE      SIFT2         WSFT2
     C                   MOVE      SIFT3         WSFT3
     C                   MOVE      SIFT4         WSFT4
     C                   MOVE      SIDTG         WSDTG
     C                   MOVE      SITLL         WSTLL
     C                   MOVE      SITLE         WSTLE
     C                   MOVE      SIDST         XDST             15
     C                   MOVE      SIVALR        WSVALR
     C                   IF        SITDN <> 0
     C                   MOVE      SIBELR        WSBELR
     C                   END
     C*
     C     KODSIK        CHAIN     KOSIR                              33
     C                   MOVE      WSSG          SISG
     C                   MOVE      KSINAV        SITARF
     C                   MOVE      UAVD          SIAVD
      *
     C     WSBEL3        IFEQ      0
     C     WSTDN         ANDNE     0
     C                   MOVE      UAVD          UAVD2             4
     C                   MOVE      WSTDN         UTDN2             7
     C                   MOVE      'I'           UIE2              1
     C                   MOVE      USIDT         UDT2              8
     C                   MOVE      WSBEL3        UBEL32           13
     C                   MOVE      WSVAL3        UVAL32            3
     C                   MOVE      WSFIF         UFIF2            17
     C                   MOVE      WSFID         UFID2             6
     C                   MOVE      WSGN          UGN2             15
     C                   CALL      'LL070R'
     C                   PARM                    UAVD2
     C                   PARM                    UTDN2
     C                   PARM                    UIE2
     C                   PARM                    UDT2
     C                   PARM                    UBEL32
     C                   PARM                    UVAL32
     C                   PARM                    UFIF2
     C                   PARM                    UFID2
     C                   PARM                    UGN2
     C     UBEL32        IFNE      *ZEROS
     C                   MOVE      UBEL32        WSBEL3
     C                   MOVE      UVAL32        WSVAL3
     C                   MOVE      UFIF2         WSFIF
     C                   MOVE      UFID2         WSFID
     C                   MOVE      UGN2          WSGN
     C                   END
     C                   END
     C*
     C   49              move      'D'           WSKDDK
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSAD        BEGSR
     C***********************************************
     C                   MOVEL     WSSLAA        SITRT
     C                   MOVE      WSSG          SISG
     C                   MOVE      WSDTY         SIDTY
     C                   MOVE      WSDP          SIDP
     C                   MOVE      WSKNS         SIKNS
     C                   MOVE      WSNAS         SINAS
     C                   MOVE      WSADS1        SIADS1
     C                   MOVE      WSADS2        SIADS2
     C                   MOVE      WSADS3        SIADS3
     C                   MOVE      WSNTK         SINTK
     C                   MOVE      WSSKI         SISKI
     C                   MOVE      WSKDDK        SIKDDK
     C                   MOVE      WSVKB         SIVKB
     C                   MOVE      WSKNK         SIKNK
     C                   MOVE      WSRG          SIRG
     C                   MOVE      WSNAK         SINAK
     C                   MOVE      WSADK1        SIADK1
     C                   MOVE      WSADK2        SIADK2
     C                   MOVE      WSADK3        SIADK3
     C     WSKDDK        IFEQ      'D'
     C     WSADK3        ANDEQ     *BLANKS
     C                   MOVEL     '.'           SIADK3
     C                   MOVE      SITDN         SIADK3
     C                   END
     C                   MOVE      WSVAL1        SIVAL1
     C                   MOVE      WSBEL1        SIBEL1
     C     WSVAL2        IFNE      'F  '
     C                   MOVE      XVAL2         SIVAL2
     C                   ELSE
     C                   MOVE      WSVAL2        SIVAL2
     C                   END
     C                   MOVE      XBEL2         SIBEL2
     C                   MOVE      WSFTG2        SIFTG2
     C                   MOVE      WSLKA         SILKA
     C                   MOVE      WSRAB         SIRAB
     C                   MOVE      WSKDC         SIKDC
     C                   MOVE      WSTLF         SITLF
     C                   MOVE      WSNAD         SINAD
     C                   MOVE      WSLV          SILV
     C                   MOVE      XLV2          SILV2
     C                   MOVE      WSLVT         SILVT
     C     WSTRM         IFEQ      20
     C     WSTRM         OREQ      23
     C     WSTRM         OREQ      24
     C     WSTRM         OREQ      50
     C     WSTRM         OREQ      60
     C     WSTRM         OREQ      70
     C     WSTRM         OREQ      80
     C                   MOVE      *BLANKS       WSTRID
     C                   MOVE      *BLANKS       WSLKT
     C                   END
     C                   MOVE      WSTRID        SITRID
     C                   MOVE      WSLKT         SILKT
     C                   MOVE      WSVAL3        SIVAL3
     C                   MOVE      WSBEL3        SIBEL3
     C                   MOVE      WSVKU         SIVKU
     C                   MOVE      WSTST         SITST
     C                   MOVE      WSTRM         SITRM
     C                   MOVE      WSFIF         SIFIF
     C     WSFID         IFEQ      999999
     C                   MOVE      99999999      SIFID
     C                   ELSE
     C                   MOVE      WSFIDD        SIFIDD
     C                   MOVE      WSFIDM        SIFIDM
     C     WSFIDÅ        IFGT      50
     C     WSFIDÅ        ADD       1900          SIFIDÅ
     C                   ELSE
     C     WSFID         IFNE      0
     C     WSFIDÅ        ADD       2000          SIFIDÅ
     C                   END
     C                   END
     C                   END
     C                   MOVE      WSLS          SILS
     C                   MOVE      WSKDLS        SIKDLS
     C                   MOVE      WSKTA         SIKTA
     C                   MOVE      WSKTB         SIKTB
     C                   MOVE      WSKTC         SIKTC
     C                   MOVE      WSGN          SIGN
S21  C*                  MOVE      WSPOS         SIPOS
N21  C                   EVAL      SIPOS = WSPOS
     C                   MOVE      *ZEROS        SIKDH
     C                   MOVE      *BLANKS       SIKDTR
     C                   MOVE      *ZEROS        SIAS
     C                   MOVE      WSFT1         SIFT1
     C                   MOVE      WSFT2         SIFT2
     C                   MOVE      WSFT3         SIFT3
     C                   MOVE      WSFT4         SIFT4
     C                   MOVE      WSDTG         SIDTG
     C                   MOVE      WSTLL         SITLL
     C                   MOVE      WSTLE         SITLE
     C                   MOVE      XBEL4         SIBEL4
     C                   MOVE      XBEL8         SIBEL8
     C                   MOVE      XBEL9         SIBEL9
     C                   MOVE      XBELA         SIBELA
     C                   MOVE      XBELB         SIBELB
     C                   MOVE      XBELC         SIBELC
     C                   MOVE      XVALB         SIVALB
     C                   MOVE      *BLANKS       SIVALR
     C                   MOVE      *ZEROS        SIBELR
     C                   MOVE      *ZEROS        SIBELS
     C     WSDP          IFEQ      64
N04THC     WSDP          OREQ      65
     C     WSDP          OREQ      66
     C     WSDP          OREQ      49
     C                   MOVE      XBELS         SIBELS
     C                   MOVE      WSVALR        SIVALR
     C                   MOVE      WSBELR        SIBELR
     C                   END
     C                   MOVE      UWS           SIWS
     C     SIMF          IFNE      'DTK'
     C                   MOVE      *BLANKS       SIMF
     C                   END
     C                   MOVE      *ZEROS        SIMP
     C                   MOVE      *BLANKS       SIDTØ
     C                   MOVE      *BLANKS       SI0035
     C  N08
     CANN29              MOVE      *BLANKS       SIMI
     C   08              MOVE      'I'           SIMI
     C*
     C     SITDN         IFEQ      0
     C                   MOVE      WSSG          SISG
     C                   END
     C                   MOVE      KSINAV        SITARF
     C                   MOVE      UAVD          SIAVD
     C     WSDFVF        IFEQ      0
     C                   Z-ADD     1             WSDFVF
     C                   END
N21  C                   IF        WSDFVF = SIDFVF
N21  C                   MOVE      'N'           XOPDLINVF         1
N21  C                   ELSE
N21  C                   MOVE      'J'           XOPDLINVF
N21  C                   MOVE      SIDFVF        XGMDFVF           1
N21  C                   END
     C                   MOVE      WSDFVF        SIDFVF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTSS        BEGSR
     C***********************************************
     C                   MOVE      WSKNS         KUNDNR
     C     KUND1K        CHAIN(N)  CUNDL01                            97
N02  C  N97kundnr        comp      0                                      97
     C  N97              DO
     C                   MOVE      *BLANKS       WSADS3
     C                   MOVE      KNAVN         WSNAS
     C                   MOVE      ADR1          WSADS1
     C                   MOVE      ADR2          WSADS2
     C     POSTNR        IFEQ      0
     C                   MOVEL     ADR3          WSADS3
     C                   ELSE
     C                   MOVEL     POSTNR        WSADS3
     C                   MOVE      ADR3          WSADS3
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTKK        BEGSR
     C***********************************************
     C                   MOVE      WSKNK         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            92
N02  C  N92kundnr        comp      0                                      92
      *
      * behanling for oppdatring
      *
     C  N92
     CAN 13              DO
     C     WSRG          IFNE      *BLANKS
     C                   MOVEL     WSRG          SYFORE
     c                   call      'SYGE29'
     c                   parm                    fifirm
     c                   parm                    wsknk
     c                   parm                    syrg
     C                   END
     C                   MOVEL     WSKTA         SYKONT
     C                   MOVE      WSKTB         SYKONT
     C                   MOVE      WSKTC         SYFR02
     C                   END
      *
      * generellt når kunden er funnet
      *
     C  N92              DO
     C                   UPDATE    KUNDR
     C     WSDTG         IFEQ      *BLANKS
     C     WSTLL         ANDEQ     *BLANKS
     C     WSTLE         ANDEQ     *BLANKS
     C     WSNAK         OREQ      *BLANKS
     C     WSADK1        ANDEQ     *BLANKS
     C     WSADK2        ANDEQ     *BLANKS
     C     WSADK3        ANDEQ     *BLANKS
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END
     C                   END
     C                   TESTN                   SYFOR9               92
     C   92SYFOR9        COMP      *ZEROS                             9292
     C                   MOVE      *BLANKS       WSRG
     C   92              MOVEL     SYFORE        WSRG
     C                   MOVE      '0'           *IN92
     C                   MOVEL     SYKONT        WSKTA
     C                   MOVE      SYKONT        WSKTB
     C                   MOVE      SYFR02        WSKTC
     C     WSKTC         IFEQ      '8'
     C     WSKTC         OREQ      '9'
     C                   MOVE      'D'           WSKDDK
     C                   END
     C                   END
     C  N92WSKTA         COMP      99999                                  92
     C                   ENDSR
     C*
     C***********************************************
     C     CIFSR         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        XBEL8            11 2
     C   08              GOTO      SLCIF
     C*
     C*** OMREGN FAKTURASUM TIL NORSK KRONE
     C*** OG LEGG DETTE PÅ CIFSUM (XBEL4)
     C     XOMRF         IFNE      0
     C     WSBEL3        MULT      WSVKU         XWORK            16 5
     C*   AVRUND CIFSUM
     C     XWORK         DIV(H)    XOMRF         XFAKNO            9 0          DEF. BILDE05
     C                   Z-ADD     XFAKNO        XBEL4             9 0
     C                   END
      *** OMREGN BEARBEDINGSKOSTNAD TIL NORSK KRONE
     C     XOMRR         IFNE      0
     C     WSBELR        MULT      XKRSR         XWORK            16 5
     C*   AVRUND CIFSUM
     C     XWORK         DIV(H)    XOMRR         XFAKNO            9 0          DEF. BILDE05
     C                   Z-ADD     XFAKNO        XBELS             9 0
     C                   END
      *
     C                   MOVE      *ZEROS        XKOSTN           15 4
     C*
     C*** EGET FELT FOR PROSENTRABATT I TILLEGG TIL ANDRE KOSTNAD
     C     WSRAB         IFNE      0
     C     XBEL4         DIV       100           XWORK
     C     XWORK         MULT      WSRAB         XBELC            11 2
     C     WSDP          IFEQ      49
     C                   MULT(H)   0.2           XBELC
     C                   END
     C                   SUB(H)    XBELC         XBEL4
     C                   ELSE
     C                   MOVE      *ZEROS        XBELC
     C                   END
     C*
     C*** OMREGN FRAKT TIL NORSK KRONE
     C*** OG LEGG DETTE PÅ CIFSUM (XBEL4)
     C     WSBEL1        IFNE      0
     C     WSBEL1        MULT(H)   XKRS1         XKOSTN
     C     XKOSTN        DIV(H)    XOMR1         XKOSTN
     C                   Z-ADD     XKOSTN        XBEL8
     C                   ADD(H)    XKOSTN        XBEL4
     C     WSDP          IFEQ      49
     C                   MULT(H)   0.2           XKOSTN
     C                   END
     C                   ADD(H)    XKOSTN        XBELS
     C                   END
     C                   MOVE      *ZEROS        XKOSTN
     C*
     C*** OMREGN ANDRE KOSTNAD TIL NORSK KRONE
     C*** OG LEGG DETTE PÅ CIFSUM (XBEL4)
     C     XBEL2         IFNE      0
     C     XBEL2         MULT(H)   XKRS2         XKOSTN
     C     XKOSTN        DIV(H)    XOMR2         XKOSTN
     C     WSDP          IFEQ      49
     C                   MULT(H)   0.2           XKOSTN
     C                   END
     C     WSFTG2        IFEQ      '+'
     C     WSFTG2        OREQ      'P'
     C                   ADD(H)    XKOSTN        XBEL4
     C                   ELSE
     C                   SUB(H)    XKOSTN        XBEL4
     C                   END
     C                   END
     C                   Z-ADD(H)  XKOSTN        XBEL9            11 2
     C*
     C*** SJEKK OM FORSIKRING SKAL BEREGNES
     C     KLBFOK        IFEQ      'A'
     C     XBEL4         MULT      KLBPRM        XWORK
     C     XWORK         DIV(H)    1000          XBELA             7 0
     C     WSDP          IFEQ      49
     C                   MULT(H)   0.2           XBELA
     C                   END
     C                   ELSE
     C                   MOVE      *ZEROS        XBELA
     C                   END
     C                   ADD       XBELA         XBEL4
     C                   ADD       XBELA         XBELS
     C*
     C     SLCIF         ENDSR
     C*
     C***********************************************
     C     OPDSAD        BEGSR
     C***********************************************
      *
      * henter neste nummer
      *
     C     WSTDN         IFEQ      0
     C     UAVD          CHAIN     STANDI                             33
     C                   MOVE      SITDN         WSTDN
     C                   ADD       1             SITDN
     C                   UPDATE    STANDIR
     C                   MOVE      *BLANKS       SIST
     C                   END
     C*
     C     SADHK         CHAIN     SADH                               33
     C  N33XNYTDK        IFEQ      'J'
     C                   UPDATE    SADHR
     C                   CLOSE     SAD061FM
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
      *
     C  N33WSSLAA        IFEQ      1
     C                   MOVEL     SITRT         XITRT1            1 0
     C     XITRT1        IFEQ      0
     C                   EXSR      NYTTNR
     C                   END
     C                   END
      *
      * FLYTTER SKJERMVARIABLE TIL FILVARIABLE
      *
     C                   EXSR      MOVSAD
     C*
     C*** 08 = INNSTIKK (IKKE VARELINJE)
     C  N08              MOVE      'E'           SIST
     C   08              MOVE      'K'           SIST
     C                   MOVE      BLUR          SIUR
      *
      * 33 ER PÅ VED NY SAD
      *
     C   33              DO                                                     1<-B
     C                   MOVE      UAVD          SIAVD
     C                   MOVE      WSTDN         SITDN
     C                   MOVE      HEOPD         SIOPD
     C                   MOVE      WSFRBN        SIFRBN
N07  C                   IF        UTYPE <> 'CPY'
     C                   MOVE      XDST          SIDST
N07  C                   END
     C                   MOVE      WDT           SIDT
     C                   WRITE     SADHR
      *
      * FORENKLET PROSEDYRE
      * STATUS BLANK NÅ LAGT TIL HER
      *
     C     *IN(49)       IFEQ      '1'
     C     SADHK         CHAIN     FPXREF                             33
     C     *IN(33)       IFEQ      '1'
     C                   CLEAR                   FPXREFR
      * KUREF I SPESIALPROSJEKT
     C****               MOVEL     ASGXREF       FPKURE
     C                   MOVE      SIAVD         FPAVD
     C                   MOVE      SITDN         FPOPD
     C                   WRITE     FPXREFR
     C                   END
     C                   END
      *
     C                   MOVE      'N'           XNYTDK
      *
      * OPPDATER Z-FIL
      *
     C     ZIREFF        IFNE      *BLANKS                                       2<-B
     C     ZIUNIK        ANDNE     0
     C     ZADHK         CHAIN     ZADHL01                            33
     C     *IN33         IFEQ      '0'                                            3<-B
     C                   MOVE      'O'           ZIST
     C                   MOVE      SIAVD         ZIAVD
     C                   MOVE      SITDN         ZITDN
     C                   MOVE      SIDT          ZIDTPL
     C                   UPDATE    ZADHR
      * OPPDATER SADF
     C                   OPEN      SADF
     C     ZADHK         SETLL     ZADFL01
     C     ZADHK         READE     ZADFL01                                33
     C     *IN33         DOWEQ     '0'                                             4<-B
     C                   MOVE      SIAVD         SFAVD
     C                   MOVE      SITDN         SFOPDN
     C                   UPDATE    ZADFR
     C                   WRITE     SADFR
     C     ZADHK         READE     ZADFL01                                33
     C  N33              END                                                       4<-E
     C                   CLOSE     SADF
      *
     C                   END                                                      3<-E
     C                   MOVE      '1'           *IN33
     C                   END                                                     2<-E
      *
      * OPPDATERER TRACK AND TRACE
      *
s16  C*    FIURBL        IFEQ      'J'                                           2<-B
s16  C*                  EXSR      TTSR
s16  C*                  END                                                     2<-E
      *
      * KOPIERER VARELINJE VED KOPIFUNKSJON
      *
     C     UTYPE         IFEQ      'CPY'                                         2<-B
     C     KAVD          ANDNE     0
     C                   MOVE      'J'           WSJNV
     C                   MOVE      'N'           WSJNF
     C                   EXFMT     BILDE06
      *
     C                   IF        WSJNV = 'J'
     C     SADHKK        SETLL     SADV                               33
     C     STOPDS        TAG
     C     SADHKK        READE(N)  SADV                                   33
     C     *IN33         IFEQ      '0'                                            3<-B
     C                   MOVE      SIAVD         SVAVD
     C                   MOVE      SITDN         SVTDN
     C                   WRITE     SADVR
     C                   GOTO      STOPDS
     C                   END                                                      3<-E
     C                   END
      *
     C                   IF        WSJNF = 'J'
     C                   MOVE      'N'           XCPYSF            1
     C                   OPEN      SADF
     C     SADHKK        SETLL     SADF                               33
     C     SADHKK        READE(N)  SADF                                   33
     C                   DOW       *IN33 = *OFF                                   3<-B
     C                   MOVE      SIAVD         SFAVD
     C                   MOVE      SITDN         SFOPDN
     C                   MOVE      'J'           XCPYSF
     C                   WRITE     SADFR
     C     SADHKK        READE(N)  SADF                                   33
     C                   ENDDO                                                    3<-E
     C                   CLOSE     SADF
     C                   IF        XCPYSF = 'J'
     C     SADHK         CHAIN     SADH                               33
     C                   EVAL      WSFIF = 'F15  ER  BENYTTET'
     C                   EVAL      WSFID = 999999
     C                   EVAL      SIFIF = 'F15  ER  BENYTTET'
     C                   EVAL      SIFID = 99999999
     C                   UPDATE    SADHR
     C                   END
     C                   END
      *
     C                   MOVE      *ZEROS        KAVD
     C                   END                                                     2<-E
     C                   MOVE      *ON           *IN33
     C                   END                                                    1<-E
      *
      * SLUTT PÅ NY SAD -  ENDRING STARTER
      *
     C  N33              UPDATE    SADHR
N21  C  N33              IF        XOPDLINVF = 'J'
N21  C     HEADFK        SETLL     SADV                               33
N21  C     HEADFK        READE     SADV                                   33
N21  C                   DOW       *IN33 = *OFF
N21  C                   IF        SVVF = XGMDFVF
N21  C                   MOVE      WSDFVF        SVVF
N21  C                   END
N21  C                   UPDATE    SADVR
N21  C     HEADFK        READE     SADV                                   33
N21  C                   ENDDO
N21  C                   EVAL      *IN33 = *OFF
N21  C                   END
     C     USIDT         IFEQ      0
     C                   MOVE      WDT           USIDT
     C                   END
     C*
     C     WSFRBN        IFNE      0
     C                   MOVE      WSTDN         HEOPD
     C                   MOVE      UTDN          WSTDN
     C     DOKUFK        CHAIN     DOKUF                              33
     C  N33              MOVE      'T'           DFST2
     C  N33              UPDATE    DOKUFR
     C                   MOVE      HEOPD         WSTDN
     C                   END
     C*
      *
      * FOR DE SOM REGISTRERER EGEN REF
      *
     C     SIEKST        IFEQ      'R'
     C     EXTREF        ANDNE     WSTREF
     C     EXTREFK2      CHAIN     frisok                             33
     C                   eval      fssok = wstref
     C   33              eval      fsavd = siavd
     C   33              eval      fsopd = sitdn
     C   33              eval      fskode = wskode
     C   33              eval      fsdtop = sidt
     c   33              write     frisokr
     c  n33              update    frisokr
     c                   end
N16  C     FIURBL        IFEQ      'J'                                           2<-B
N16  C                   EXSR      TTSR
N16  C                   END                                                     2<-E
     C                   ENDSR
     C*
     C***********************************************
     C     PRINT         BEGSR
     C***********************************************
     C                   Z-ADD     0             UDIFF            13 2
     C                   MOVE      *IN28         UIN28             1
     C                   MOVE      *IN29         UIN29             1
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SAD061T'
     C                   PARM                    SIAVD
     C                   PARM                    SITDN
     C                   PARM                    WSTVIN
     C                   PARM                    UDIFF
     C                   PARM                    UIN28
     C                   PARM                    UIN29
     C                   PARM                    UFLAGG
     C                   PARM                    UWS
     C*
     C     UFLAGG        COMP      2                                      17
     C     UFLAGG        COMP      1                                      12
     C     UFLAGG        COMP      3                                      03
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TOSADV        BEGSR
     C***********************************************
     C                   MOVE      *IN28         UIN28
     C                   MOVE      *IN29         UIN29
      * IKKE LOV Å TASTE F2 HVIS DET FINNES SADV -> TIL VANLIG FORTOLL.
     C     *IN02         IFEQ      '1'
     C     SADHK         CHAIN(N)  SADV                               33
     C     *IN33         IFEQ      '0'
     C                   MOVE      '0'           *IN02
     C                   END
     C                   ELSE
      * SELV OM IKKE F2 TASTES - HVIS DET FINNES SADW - TIL BILFORTOLL.
     C     SADHK         CHAIN     SADW                               33
     C     *IN33         IFEQ      '0'
     C                   MOVE      '1'           *IN02
     C                   END
     C                   END
      *
     C     *IN02         IFEQ      '0'
      * UZAVD<>0 ---> HAR VRÆT PLUKKET FRA FØR.
     C     UZAVD         IFNE      0
     C                   Z-SUB     HEUNIK        HEUNIK
     C                   END
      *
     C                   CALL      'SAD061A'
     C                   PARM                    FIFIRM
     C                   PARM                    SIAVD
     C                   PARM                    SITDN
     C                   PARM                    BLUR
     C                   PARM                    XFAKNO
     C                   PARM                    UFT
     C                   PARM                    UWS
     C                   PARM                    WSTVIN
     C                   PARM                    UIN28
     C                   PARM                    UIN29
     C                   PARM                    UIN36
     C                   PARM                    UFLAGG
     C*                    PARM           WSKDH
     C                   PARM                    HEUNIK
     C                   PARM                    HEREFF
     C                   PARM                    ULVERD
     C                   PARM                    HEVS1
     C                   PARM                    HEVS2
     C                   PARM                    USIDT             8 0
     C                   PARM                    WSBVNV
     C                   PARM                    UMODE
     C                   ELSE
     C                   CALL      'SAD061B'
     C                   PARM                    FIFIRM
     C                   PARM                    SIAVD
     C                   PARM                    SITDN
     C                   PARM                    BLUR
     C                   PARM                    XFAKNO
     C                   PARM                    UFT
     C                   PARM                    UWS
     C                   PARM                    WSTVIN
     C                   PARM                    UIN28
     C                   PARM                    UIN29
     C                   PARM                    UIN36
     C                   PARM                    USIDT             8 0
     C                   PARM                    UFLAGG
     C                   END
N13   *
N13  C                   IN        SAVUDS
N13   *
     C     UFLAGG        COMP      1                                      12
     C     UFLAGG        COMP      2                                      17
     C     UFLAGG        COMP      3                                      03
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISTOL        BEGSR
     C***********************************************
      *________________________
      * Call på eksternt CL-pgm
      *""""""""""""""""""""""""
     C                   MOVE      '0'           WIN03
     C                   CALL      'SAD003'
     C                   PARM                    SIAVD
     C                   PARM                    SITDN
     C                   PARM                    WIN03
     C*
     C                   ENDSR
     C*
S01  C***********************************************
S01  C*    SØKUNR        BEGSR
S01  C***********************************************
S01  C*                  CALL      'SOEKUN'
S01  C*                  PARM                    FIFIRM
S01  C*                  PARM                    SOANTK
S01  C*                  PARM                    SOTXT1
S01  C*                  PARM                    WSKNS
S01  C*                  PARM                    SOTXT2
S01  C*                  PARM                    WSKNK
S01  C*                  PARM                    SOTXT3
S01  C*                  PARM                    SOKNR3
S01  C*                  PARM                    SOTXT4
S01  C*                  PARM                    SOKNR4
S01  C*                  PARM                    SOTXT5
S01  C*                  PARM                    SOKNR5
S01  C*                  PARM                    SOTXT6
S01  C*                  PARM                    SOKNR6
S01  C*                  PARM                    SOTXT7
S01  C*                  PARM                    SOKNR7
S01  C*                  PARM                    SOTXT8
S01  C*                  PARM                    SOKNR8
S01  C*    WSKNS         IFNE      0
S01  C*                  EXSR      TESTSS
S01  C*                  END
S01  C*    WSKNK         IFNE      0
S01  C*                  EXSR      TESTKK
S01  C*                  END
S01  C*
S01  C*                  ENDSR
S01  C*
     C***********************************************
     C     SRU1          BEGSR
     C***********************************************
S18  C*                  MOVE      *BLANKS       UFT              17
N18  C                   MOVE      *BLANKS       UFT              28
     C     WSFRBN        COMP      0                                  9999
     C  N99              DO
     C     SADHK         CHAIN     SADH                               98
     C  N98              MOVE      'E'           SIST
     C  N98              UPDATE    SADHR
     C  N98              GOTO      SLSRU
     C                   END
     C*
     C     STANIK        CHAIN(N)  STANDI                             98
     C  N98              MOVE      *BLANKS       SIST
     C     BILLK         CHAIN     BILLOF                             98
     C   98              MOVE      *BLANKS       BLUR
     C*** BLUR = 'F/G'  --->  SJØSPEDISJON
     C     BLUR          COMP      'F'                                    96
     C  N96BLUR          COMP      'G'                                    96
     C     HEADFK        CHAIN     HEADF                              98
     C   99DOKUFK        CHAIN(N)  DOKUF                              98
     C   99              MOVE      WSFRBN        SIFRBN
     C   99              MOVE      *ZEROS        WSTDN
      *
     C   98UZAVD         IFNE      0
     C     ZEADFK        CHAIN     ZEADL04                            98
     C                   ELSE
     C     UZREFF        IFNE      *BLANKS
     C     ZEAF1K        CHAIN     ZEADL01                            98
     C                   END
     C                   END
      *
     C                   MOVE      WSTDN         SITDN
     C*
     C  N98              MOVE      HESG          SISG
     C  N98WSSG          IFEQ      *BLANKS
     C                   MOVE      HESG          WSSG
     C     SITARF        IFEQ      *BLANKS
     C     KODSIK        CHAIN     KOSIR                              97
     C  N97              MOVE      KSINAV        SITARF
     C                   END
     C                   END
     C*
     C*** START N98
     C  N98              DO
     C*
     C*.................................................
     C*** FLYTT DATA FRA HEADF TIL SADH
     C                   MOVEL     HEGN          SIGN
     C                   MOVE      *ZEROS        SIKNS
     C                   MOVE      HENAS         SINAS
     C                   MOVE      HEADS1        SIADS1
     C                   MOVE      HEADS2        SIADS2
     C                   MOVE      HEADS3        SIADS3
     C                   MOVE      HEFR          SILV
     C                   MOVE      HEFR          WSLV
     C                   MOVE      HELKA         SILKA
     C                   MOVE      *BLANKS       SITRID
     C                   MOVEL     HEHAWB        SITRID
     C     HETRM         IFNE      0
     C                   Z-ADD     HETRM         SITRM
     C* VED TRANSPORTMÅTE 16 HENTES TOLLSTED FRA TURER
N06  C                   MOVE      'N'           XTUR              1
     C     HETRM         IFEQ      16
     C     HEPRO         CHAIN     TURER14                            97
N06  C  N97              MOVE      'J'           XTUR
N06  C                   ELSE
N06  C     HEPRO         IFNE      0
N06  C     HEPRO         CHAIN     TURER14                            33
N06  C  N33              MOVE      'J'           XTUR
N06  C                   END
     C                   END
     C*
     C                   END
     C                   MOVE      HETRC         SIKDC
s23  C*                  IF        XTUR = 'J'
n23  C                   IF        XTUR = 'N'
     C                   MOVE      HETRI         SILKT
N06  C                   ELSE
N20  C     TULK          IFNE      *BLANKS
N06  C                   EVAL      SILKT  = TULK
N20  C                   ENDIF
N20  C     TUBILN        IFNE      *BLANKS
N06  C                   EVAL      SITRID = TUBILN
N20  C                   ENDIF
N06  C                   END
     C     KODLBK        CHAIN     KODTLB                             97
     C* KLBFOK=FORSIKRING  KLBFRK=FRAKTKODE
     C  N97KLBFRK        IFNE      'N'
     C                   Z-ADD     HEFBK         SIBEL1
     C                   END
     C     HETRCN        IFEQ      *BLANKS
S18  C*                  MOVEL     HEGM1         UFT
N18  C                   EVAL      UFT = HEGM1
     C                   ELSE
S18  C*                  MOVE      HETRCN        UFT
N18  C                   EVAL      UFT = HETRCN
     C                   END
     C*
     C  N99              DO
     C                   MOVE      HEKNS         SIKNS
n14  C                   MOVE      HEKNS         wsKNS
n14  c     wskns         ifne      *zeros
n14  C                   MOVE      WSKNS         KUNDNR
n14  C     KUND1K        CHAIN(N)  CUNDL01                            97
n14  C  N97              DO
n14  C                   MOVE      *BLANKS       siADS3
n14  C                   MOVE      KNAVN         siNAS
n14  C                   MOVE      ADR1          siADS1
n14  C                   MOVE      ADR2          siADS2
n14  C     POSTNR        IFEQ      0
n14  C                   MOVEL     ADR3          siADS3
n14  C                   ELSE
n14  C                   MOVEL     POSTNR        siADS3
n14  C                   MOVE      ADR3          siADS3
n14  C                   END
n14  C                   END
n14  c                   end
     C                   MOVE      HEKNK         SIKNK
     C                   MOVE      HEKNK         KUNDNR
     C     KUND1K        CHAIN(N)  CUNDL01                            97
N02  C  N97kundnr        comp      0                                      97
     C  N97              DO
     C                   MOVE      KNAVN         SINAK
     C                   MOVE      ADR1          SIADK1
     C                   MOVE      ADR2          SIADK2
     C                   MOVE      *BLANKS       SIADK3
     C     POSTNR        IFEQ      0
     C                   MOVEL     ADR3          SIADK3
     C                   ELSE
     C                   MOVEL     POSTNR        SIADK3
     C                   MOVE      ADR3          SIADK3
     C                   END
     C                   TESTN                   SYFOR9               97
     C   97SYFOR9        COMP      *ZEROS                             9797
     C                   MOVE      *ZEROS        SIRG
     C   97              MOVEL     SYFORE        SIRG
     C                   MOVE      '0'           *IN97
     C                   MOVEL     SYKONT        SIKTA
     C                   MOVE      SYKONT        SIKTB
     C                   MOVE      SYFR02        SIKTC
     C                   END
     C*
     C*  DERSOM DET I OPPDRAGET ER BRUKT VAREADRESSE OG DENNE HAR
     C*  EGEN TOLLKREDITT - ANTA AT DET ER VAREADR (SOM VED "D") SOM
     C*  ER MOTTAKER PÅ SAD - HENT OPP REGNR./KNTO FRA KUNDENR+VAREADRN
     C*  (VAREADRNR = HEVN I HEADF)-
     C*  (BLIR IKKE LAGT UT AV "SOEKVADR" PR. 191091.. MÅ ENDRES)
     C   97              MOVE      'D'           DKUND
     C     DKUND         IFEQ      'D'
     C                   MOVE      *BLANKS       SIRG
     C                   MOVE      *ZEROS        SIKTA
     C                   MOVE      *ZEROS        SIKTB
     C                   MOVE      *BLANKS       SIKTC
     C                   MOVE      HENAK         SINAK
     C                   MOVE      HEADK1        SIADK1
     C                   MOVE      HEADK2        SIADK2
     C                   MOVE      HEADK3        SIADK3
     C                   MOVE      *ZEROS        SIKNK
     C                   END
     C*
     C                   Z-ADD     HENT          SINTK
     C                   Z-ADD     HEVKT         SIVKB
     C*
     C                   END
     C*** END PÅ N99
     C*''''''''''''''''''''''''''''''''''''''''''''''''
     C*
     C*................................................
     C*** FLYTT DATA FRA DOKUF TIL SADH
     C   99              DO
     C                   MOVE      DFNAVM        SINAK
     C                   MOVE      DFAD1M        SIADK1
     C                   MOVE      *BLANKS       SIADK2
     C                   MOVE      DFAD3M        SIADK3
     C                   Z-ADD     DFNT          SINTK
     C                   Z-ADD     DFVKT         SIVKB
     C                   MOVEL     DFRG          SIRG
     C* "SOEKVADR" OPPDATERER IKKE DFKTA/DFKTB
     C* (PR 191091 - MÅ ENDRES TIL NESTE HOVEDRELEASE)
     C* (TAR IKKE JOBBEN NÅ DA DET MEDFØRER ENDRING I ALLE PROGRAM
     C* SOM KALLER SOEKVADR)
     C                   MOVE      DFKTA         SIKTA
     C                   MOVE      DFKTB         SIKTB
     C                   MOVE      *BLANKS       SIKTC
     C                   END
     C*** END PÅ 99
     C*''''''''''''''''''''''''''''''''''''''''''''''
     C*
     C*
     C                   EXSR      FIXPOS
     C*
     C*
     C                   END
     C*** END PÅ N98
     C*
     C     SLSRU         TAG
     C                   SETOFF                                       999897
     C*
     C* ......................................................
     C*** U1=DIREKT FRA OPD.REG.
     C***   SIMI = I  BETYR TIDLIGERE INNSTIKK
     C*  U1      SIMI      COMP 'I'                      28
     C***   TEST KOMMUNIKASJON
     C*  U1      WSTOLK    COMP 'J'                      29
     C*'''''''''''''''''''''''''''''''''''''''''''''''''''''''
     C                   ENDSR
     C*
     C***********************************************
     C     FIXPOS        BEGSR
     C***********************************************
      * FIKSER POSISJON/UNDERPOSISJON
     C                   MOVEA     '0000000'     *IN(91)
     C                   MOVEA     '0000'        *IN(81)
     C                   MOVE      *BLANKS       SIPOS
     C*
     C     XPOS17        COMP      ' '                                9797
     C  N97XPOS16        COMP      ' '                                9696
     C  N97
     CANN96XPOS15        COMP      ' '                                9595
     C  N97
     CANN96
     CANN95XPOS14        COMP      ' '                                9494
     C  N97
     CANN96
     CANN95
     CANN94XPOS13        COMP      ' '                                9393
     C  N97
     CANN96
     CANN95
     CANN94
     CANN93XPOS12        COMP      ' '                                9292
     C  N97
     CANN96
     CANN95
     CANN94
     CANN93
     CANN92XPOS11        COMP      ' '                                9191
     C*
     C  N91
     CANN92
     CANN93
     CANN94
     CANN95
     CANN96
     CANN97              GOTO      SLFPOS
     C*
     C                   MOVEL     HEPOS1        SIPOS
     C     HEPOS2        COMP      0                                      81
     C   81              GOTO      SLFPOS
     C*
     C     XPOS21        COMP      0                                  8181
     C  N81XPOS22        COMP      0                                  8282
     C  N81
     CANN82XPOS23        COMP      0                                  8383
     C  N81
     CANN82
     CANN83XPOS24        COMP      0                                  8484
     C*
     C   91              DO
     C                   MOVEL     '/'           XPOS8             8
     C                   MOVE      *BLANKS       XPOS7             7
     C   81              MOVEL     HEPOS2        XPOS7
     C   82              MOVEL     XPOS25        XPOS7
     C   83              MOVEL     XPOS26        XPOS7
     C   84              MOVEL     XPOS24        XPOS7
     C                   MOVE      XPOS7         XPOS8
     C                   MOVE      XPOS8         SIPOS
     C                   END
     C*
     C   92              DO
     C                   MOVEL     '/'           XPOS7
     C                   MOVE      *BLANKS       XPOS6             6
     C   81              MOVEL     HEPOS2        XPOS6
     C   82              MOVEL     XPOS25        XPOS6
     C   83              MOVEL     XPOS26        XPOS6
     C   84              MOVEL     XPOS24        XPOS6
     C                   MOVE      XPOS6         XPOS7
     C                   MOVE      XPOS7         SIPOS
     C                   END
     C*
     C   93              DO
     C                   MOVEL     '/'           XPOS6
     C                   MOVE      *BLANKS       XPOS5             5
     C   81              MOVEL     HEPOS2        XPOS5
     C   82              MOVEL     XPOS25        XPOS5
     C   83              MOVEL     XPOS26        XPOS5
     C   84              MOVEL     XPOS24        XPOS5
     C                   MOVE      XPOS5         XPOS6
     C                   MOVE      XPOS6         SIPOS
     C                   END
     C*
     C   94              DO
     C                   MOVEL     '/'           XPOS5
     C                   MOVE      *BLANKS       XPOS4             4
     C   81              MOVEL     HEPOS2        XPOS4
     C   82              MOVEL     XPOS25        XPOS4
     C   83              MOVEL     XPOS26        XPOS4
     C   84              MOVEL     XPOS24        XPOS4
     C                   MOVE      XPOS4         XPOS5
     C                   MOVE      XPOS5         SIPOS
     C                   END
     C*
     C   95              DO
     C                   MOVEL     '/'           XPOS4
     C                   MOVE      *BLANKS       XPOS3             3
     C   81              MOVEL     HEPOS2        XPOS3
     C   82              MOVEL     XPOS25        XPOS3
     C   83              MOVEL     XPOS26        XPOS3
     C   84              MOVEL     XPOS24        XPOS3
     C                   MOVE      XPOS3         XPOS4
     C                   MOVE      XPOS4         SIPOS
     C                   END
     C*
     C   96              DO
     C                   MOVEL     '/'           XPOS3
     C                   MOVE      *BLANKS       XPOS2             2
     C   81              MOVEL     HEPOS2        XPOS2
     C   82              MOVEL     XPOS25        XPOS2
     C   83              MOVEL     XPOS26        XPOS2
     C   84              MOVEL     XPOS24        XPOS2
     C                   MOVE      XPOS2         XPOS3
     C                   MOVE      XPOS3         SIPOS
     C                   END
     C*
     C   97              DO
     C                   MOVEL     '/'           XPOS2
     C                   MOVE      *BLANKS       XPOS1             1
     C   81              MOVEL     HEPOS2        XPOS1
     C   82              MOVEL     XPOS25        XPOS1
     C   83              MOVEL     XPOS26        XPOS1
     C   84              MOVEL     XPOS24        XPOS1
     C                   MOVE      XPOS1         XPOS2
     C                   MOVE      XPOS2         SIPOS
     C                   END
     C*
     C     SLFPOS        TAG
     C                   MOVEA     '0000000'     *IN(91)
     C                   MOVEA     '0000'        *IN(81)
     C*
     C                   ENDSR
     C*
      ***********************************************
     C     HZFIL         BEGSR
      ***********************************************
     C     UZAVD         IFEQ      0
     C     UZREFF        ANDEQ     *BLANKS
     C     ZEAF1K        CHAIN     ZEADL01                            98
     C                   ELSE
     C                   MOVE      UZUNIK        HEUNIK
     C                   MOVE      UZREFF        HEREFF
     C                   MOVE      '0'           *IN98
     C                   END
      *
     C  N98ZADHK         CHAIN(N)  ZADHL01                            98
     C     *IN98         IFEQ      '0'                                          1<-B
     C     WSDTY         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIDTY         WSDTY
     C                   END                                                     2<-E
     C     WSDP          IFEQ      0                                             2<-B
     C                   MOVE      ZIDP          WSDP
     C                   END                                                     2<-E
     C     WSKNS         IFEQ      0                                             2<-B
     C     WSNAS         ANDEQ     *BLANKS
     C                   MOVE      ZIKNS         WSKNS
     C                   MOVE      ZINAS         WSNAS
     C                   MOVE      ZIADS1        WSADS1
     C                   MOVE      ZIADS2        WSADS2
     C                   MOVE      ZIADS3        WSADS3
     C                   END                                                     2<-E
     C     WSNTK         IFEQ      0                                             2<-B
     C                   MOVE      ZINTK         WSNTK
     C                   END                                                     2<-E
     C     WSSKI         IFEQ      ' '                                           2<-B
     C                   MOVE      ZISKI         WSSKI
     C                   END                                                     2<-E
     C     WSKDDK        IFEQ      ' '                                           2<-B
     C                   MOVE      ZIKDDK        WSKDDK
     C                   END                                                     2<-E
     C     WSVKB         IFEQ      0                                             2<-B
     C                   MOVE      ZIVKB         WSVKB
     C                   END                                                     2<-E
     C     WSKDC         IFEQ      ' '                                           2<-B
     C                   MOVE      ZIKDC         WSKDC
     C                   END                                                     2<-E
     C     WSKNK         IFEQ      0                                             2<-B
     C     WSNAK         ANDEQ     *BLANKS
     C                   MOVE      ZIKNK         WSKNK
     C                   MOVE      ZINAK         WSNAK
     C                   MOVE      ZIADK1        WSADK1
     C                   MOVE      ZIADK2        WSADK2
     C                   MOVE      ZIADK3        WSADK3
     C                   END                                                     2<-E
     C     WSRG          IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIRG          WSRG
     C                   END                                                     2<-E
     C     WSVAL1        IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIVAL1        WSVAL1
     C                   END                                                     2<-E
     C     WSBEL1        IFEQ      0                                             2<-B
     C                   MOVE      ZIBEL1        WSBEL1
     C                   END                                                     2<-E
     C     WSVAL2        IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIVAL2        WSVAL2
     C                   END                                                     2<-E
     C     WSBEL2        IFEQ      0                                             2<-B
     C                   MOVE      ZIBEL2        WSBEL2
     C                   END                                                     2<-E
     C     WSFTG2        IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIFTG2        WSFTG2
     C                   END                                                     2<-E
     C     WSLKA         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZILKA         WSLKA
     C                   END                                                     2<-E
     C     WSTLF         IFEQ      *BLANKS                                       2<-B
     C     WSNAD         ANDEQ     *BLANKS
     C                   MOVE      ZITLF         WSTLF
     C                   MOVE      ZINAD         WSNAD
     C                   END                                                     2<-E
     C     WSLV          IFEQ      *BLANKS                                       2<-B
     C     WSLVT         ANDEQ     *BLANKS
     C                   MOVE      ZILV          WSLV
     C                   MOVE      ZILVT         WSLVT
     C                   END                                                     2<-E
     C     WSTRID        IFEQ      *BLANKS                                       2<-B
     C     WSLKT         ANDEQ     *BLANKS
     C                   MOVE      ZITRID        WSTRID
     C                   MOVE      ZILKT         WSLKT
     C                   END                                                     2<-E
     C     WSVAL3        IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIVAL3        WSVAL3
     C                   END                                                     2<-E
     C     WSBEL3        IFEQ      0                                             2<-B
     C                   MOVE      ZIBEL3        WSBEL3
     C                   END                                                     2<-E
     C     WSVKU         IFEQ      0                                             2<-B
     C                   MOVE      ZIVKU         WSVKU
     C                   END                                                     2<-E
     C     WSTST         IFEQ      0                                             2<-B
     C                   MOVE      ZITST         WSTST
     C                   END                                                     2<-E
     C     WSTRM         IFEQ      0                                             2<-B
     C                   MOVE      ZITRM         WSTRM
     C                   END                                                     2<-E
     C     WSFIF         IFEQ      *BLANKS                                       2<-B
     C     WSFID         ANDEQ     0
     C                   MOVE      ZIFIF         WSFIF
     C                   MOVE      ZIFIDD        WSFIDD
     C                   MOVE      ZIFIDM        WSFIDM
     C                   MOVE      ZIFIDÅ        WSFIDÅ
     C                   END                                                     2<-E
     C     WSKTA         IFEQ      0                                             2<-B
     C     WSKTB         ANDEQ     0
     C     WSKTC         ANDEQ     ' '
     C                   MOVE      ZIKTA         WSKTA
     C                   MOVE      ZIKTB         WSKTB
     C                   MOVE      ZIKTC         WSKTC
     C                   END                                                     2<-E
     C     WSGN          IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIGN          WSGN
     C                   END                                                     2<-E
     C     WSFT1         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIFT1         WSFT1
     C                   END                                                     2<-E
     C     WSFT2         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIFT2         WSFT2
     C                   END                                                     2<-E
     C     WSFT3         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIFT3         WSFT3
     C                   END                                                     2<-E
     C     WSFT4         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ZIFT4         WSFT4
     C                   END                                                     2<-E
     C     WSLS          IFEQ      *BLANKS                                       2<-B
     C     WSKDLS        ANDEQ     *BLANKS
     C                   MOVE      ZILS          WSLS
     C                   MOVE      ZIKDLS        WSKDLS
     C                   END                                                     2<-E
     C     WSPOS         IFEQ      *BLANKS                                       2<-B
S21  C*                  MOVE      ZIPOS         WSPOS
N21  C                   EVAL      WSPOS = ZIPOS
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     EXTREFK       KLIST
     C                   KFLD                    WSKODE            3
     C                   KFLD                    EXTREF
     C                   MOVEL     '*CR'         WSKODE
     C     EXTREFK1      KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C                   KFLD                    WSKODE            3
     C     EXTREFK2      KLIST
     C                   KFLD                    SIAVD
     C                   KFLD                    SITDN
     C                   KFLD                    WSKODE            3
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'K'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     ZADHK         KLIST
     C                   KFLD                    HEUNIK
     C                   KFLD                    HEREFF
     C     SADHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     SADHKK        KLIST
     C                   KFLD                    KAVD
     C                   KFLD                    KTDN
     C     SADH6K        KLIST
     C                   KFLD                    WSGN
S21  C*                  KFLD                    WSPOS
N21  C                   KFLD                    WSPOS9            9
     C     STANIK        KLIST
     C                   KFLD                    UAVD
     C     DOKUFK        KLIST
     C                   KFLD                    XFRI
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C                   KFLD                    WSFRBN
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     ZEADFK        KLIST
     C                   KFLD                    UZAVD
     C                   KFLD                    UZTDN
     C     ZEAF1K        KLIST
     C                   KFLD                    UZREFF
     C                   KFLD                    UZUNIK
     C     BILLK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     KUfokey       KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSRG14           14
     C     TVIM2K        KLIST
     C                   KFLD                    XSR
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C                   KFLD                    MIN0B
     C                   KFLD                    MIN0C
     C                   KFLD                    MIN0D
     C     TVI21K        KLIST
     C                   KFLD                    XSR
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     TVIM4K        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C                   KFLD                    MAX0B
     C                   KFLD                    MAX0C
     C                   KFLD                    MAX0D
     C     TVI41K        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     KODLBK        KLIST
     C                   KFLD                    XLBUNI
     C                   KFLD                    WSLV
     C     KODSIK        KLIST
     C                   KFLD                    XSIUNI
     C                   KFLD                    WSSG
     C     KODVAK        KLIST
     C                   KFLD                    XVALKO
     C                   KFLD                    USIDT
     C     KODS1K        KLIST
     C                   KFLD                    XS1UNI
     C                   KFLD                    WSDP
     C     KODS2K        KLIST
     C                   KFLD                    XS2UNI
     C                   KFLD                    XLANDK
     C     KODS3K        KLIST
     C                   KFLD                    XS3UNI
     C                   KFLD                    WSTST
     C     KODS4K        KLIST
     C                   KFLD                    XS4UNI
     C                   KFLD                    WSTRM
     C     TVINMK        KLIST
     C                   KFLD                    YST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C*
     C     *LIKE         DEFINE    SITDN         UTDN
     C     *LIKE         DEFINE    SISG          USG
     C     *LIKE         DEFINE    SIWS          UWS
     C     *LIKE         DEFINE    SIFID         XFDT
     C     *ENTRY        PLIST
     C                   PARM                    UAVD
     C     WSTDN         PARM      WSTDN         UTDN
     C     WSSG          PARM                    USG
     C                   PARM                    UTYPE             3
     C                   PARM                    UWS
     C                   PARM                    UMODE             1
N13   *
N13  C     *DTAARA       DEFINE    *LDA          SAVUDS
N13  C                   EVAL      UUDSDTA = *BLANKS
N13  C                   OUT       SAVUDS
      *
      *F= forenklet prosedyre
     c     UMODE         IFEQ      'F'
     C                   SETON                                        49
     c                   move      'SHU1052'     HEAMSG
     c                   else
     c                   move      'SHU1050'     HEAMSG
     c                   end
     C     'TVI00004'    CHAIN     SYPTFF                             33
     C   33              MOVE      *ZEROS        PTFDT
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDT80             8 0
     C     UTYPE         IFEQ      'PRT'
     C     SADHK         CHAIN     SADH                               31
     C  N31              DO
     C                   MOVE      UWS           SIWS
     C                   MOVE      'K'           SIST
     C                   MOVE      'J'           SIPKL
     C                   UPDATE    SADHR
     C                   END
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C     UTYPE         COMP      'CHG'                                  31
     C     UTYPE         COMP      'CHG'                                  32
     C  N32UTYPE         COMP      'CPY'                                  32
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      UAVD          KAVD              4 0
     C                   MOVE      WSTDN         KTDN              7 0
     C                   MOVE      *ZEROS        WSTDN
     C                   END
      *
N09  C     *LIKE         DEFINE    WSVAL3        XXVAL3
N09  C     *LIKE         DEFINE    WSVKU         XXVKU
     C                   MOVE      *ZEROS        USIDT
     C                   MOVE      *ZEROS        KUNDNR            8 0
     C                   MOVE      'F'           XFRI              1
     C                   MOVE      'S'           XSR               1
     C                   MOVE      'R'           XSR1              1
     C                   MOVE      *ZEROS        MIN0B             8 0
     C                   MOVE      *ZEROS        MIN0C             6 0
     C                   MOVE      *ZEROS        MIN0D             2 0
     C                   MOVE      '99999999'    MAX0B             8 0
     C                   MOVE      '999999'      MAX0C             6 0
     C                   MOVE      '99'          MAX0D             2 0
     C                   MOVE      'LB'          XLBUNI            2
     C                   MOVE      'SI'          XSIUNI            2
     C                   MOVE      *BLANKS       XVALKO            3
     C                   MOVE      'S1 '         XS1UNI            3
     C                   MOVE      'S2 '         XS2UNI            3
     C                   MOVE      *BLANKS       XLANDK            2
     C                   MOVE      'S3  '        XS3UNI            4
     C                   MOVE      'S4 '         XS4UNI            3
     C                   MOVE      ' '           YST               1
     C                   MOVE      'N'           USPED             1
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVEL     WTM           TTTIME
     C*
S01  C*                  Z-ADD     2             SOANTK            1 0
S01  C*                  MOVE      'AVSENDER'    SOTXT1            8
S01  C*                  MOVE      'MOTTAKER'    SOTXT2            8
S01  C*                  MOVE      *BLANKS       SOTXT3            8
S01  C*                  MOVE      *BLANKS       SOTXT4            8
S01  C*                  MOVE      *BLANKS       SOTXT5            8
S01  C*                  MOVE      *BLANKS       SOTXT6            8
S01  C*                  MOVE      *BLANKS       SOTXT7            8
S01  C*                  MOVE      *BLANKS       SOTXT8            8
S01  C*                  MOVE      *ZEROS        SOKNR3            8 0
S01  C*                  MOVE      *ZEROS        SOKNR4            8 0
S01  C*                  MOVE      *ZEROS        SOKNR5            8 0
S01  C*                  MOVE      *ZEROS        SOKNR6            8 0
S01  C*                  MOVE      *ZEROS        SOKNR7            8 0
S01  C*                  MOVE      *ZEROS        SOKNR8            8 0
     C                   MOVE      *ZEROS        SIRAB
     C                   MOVE      *ZEROS        SIBELC
     C     *LIKE         DEFINE    *IN03         WIN03
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     FIURBI        IFEQ      'J'
     C     FIURBL        OREQ      'J'
     C                   MOVE      'F'           WSUR
     C                   END
     C     UAVD          CHAIN(N)  STANDI                             33
      * WSTOLK = J BETYR TVINN
      * WSTVIN = J BETYR SKRIVES NÅ
     C     SITOLK        IFEQ      'J'
     C                   MOVE      'J'           WSTOLK
     C     S0035         IFEQ      '2'
     C                   MOVE      'J'           WSTVIN
     C                   ELSE
     C                   MOVE      'N'           WSTVIN
     C                   END
     C                   ELSE
     C                   MOVE      'N'           WSTOLK
     C                   MOVE      'J'           WSTVIN
     C                   END
      * IKKE TVINN VED FORENKLET PROSEDYRE
     C   49              MOVE      'N'           WSTVIN
     C   49              MOVE      'N'           WSTOLK
     C* SJEKK OM DET ER FRITTSTÅENDE SAD-MODUL (TOM HEADF)
     C     HEADFK        SETLL     HEADF
     C                   READ      HEADF                                  36
     C                   MOVE      *IN36         UIN36             1
     C                   EXSR      UTCMDL
     C*
     C     WSBVNV        IFEQ      *ZEROS
     C                   Z-ADD     0.9           WSBVNV
     C                   END
      *
      * henteventuell externrefkode
      *
     C     EXTREFK1      CHAIN(N)  frisok                             33
     C  N33              movel     fssok         EXTREF
     C                   ENDSR
     C*
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
      * AVSENDER   ...
     C     POSNBR        IFGE      13
     C     POSNBR        ANDLE     20
     C     LINNBR        ANDEQ     2
     C     WSKNS         ANDGT     0
     C                   MOVE      WSKNS         XSKKNR
     C                   GOTO      STVISO
     C                   END
      *
      *
      * MOTTAGER   ...
     C     WSKNK         IFGT      0
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C                   END
      *
      *
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
      *
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR            8 0
     C                   PARM                    XSKMOT            8
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
      *
      *
     C     SLVISO        ENDSR
      *
      *
     C***********************************************
     C     TSTOPL        BEGSR
     C***********************************************
     C                   SETOFF                                       6162
      *** TEST OM SELGER OPPLYSNING. HVIS DET, SETT 61 PÅ
     C                   MOVE      WSKNS         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        61
      *
      *** TEST OM KJØPER OPPLYSNING. HVIS DET, SETT 62 PÅ
     C                   MOVE      WSKNK         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        62
     C     siekst        comp      'R'                                6363
     C                   ENDSR
     C*
     C***********************************************
     C     UTCMDL        BEGSR
     C***********************************************
     C     XCMD          IFEQ      0
     C                   MOVE      'DIV0032'     MSGLN1
     C   36              MOVE      'DIV0024'     MSGLN2
     C  N36              MOVE      'DIV0033'     MSGLN2
     C                   MOVE      'SHU0437'     MSGLN3
     C                   MOVE      'DIV0029'     MSGLN4
     C                   ADD       1             XCMD              2 0
     C                   ELSE
     C     XCMD          IFEQ      1
     C                   MOVE      'SHU0438'     MSGLN1
     C                   MOVE      'DIV0024'     MSGLN2
     C                   MOVE      'SHU0435'     MSGLN3
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      2
     C                   MOVE      'SHU0433'     MSGLN1
     C                   MOVE      'SHU0436'     MSGLN2
     C                   MOVE      'DIV0000'     MSGLN3
     C                   Z-ADD     0             XCMD
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
N16  C     TTKEY         KLIST
n16  C                   KFLD                    TTAVD
n16  C                   KFLD                    TTOPD
n16  C                   KFLD                    TTFBNR
n16  C                   KFLD                    TTACTI
n16  C                   MOVE      *ZEROS        TTFBNR
     C                   MOVE      SIAVD         TTAVD
     C                   MOVE      SITDN         TTOPD
     C                   MOVE      'STS'         TTACTI
n16  C     ttkey         chain     trackl02                           33
n16  c     *in33         cabeq     '0'           uttt
     C                   MOVE      WDT           TTDATE
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      UUSR          TTUSER
     C                   MOVEL     'SAD docu'    XXTE16           16
     C                   MOVE      'ment imp'    XXTE16
     C                   MOVEL     XXTE16        XXTE32           32
     C                   MOVEL     'ort ente'    XXTE16
     C                   MOVE      'red     '    XXTE16
     C                   MOVE      XXTE16        XXTE32
     C                   MOVEL     XXTE32        TTTEXT
N10  C                   MOVEL     'SAD doku'    XXTE16           16
N10  C                   MOVE      'ment imp'    XXTE16
N10  C                   MOVEL     XXTE16        XXTE32           32
N10  C                   MOVEL     'ort lage'    XXTE16
N10  C                   MOVE      't       '    XXTE16
N10  C                   MOVE      XXTE16        XXTE32
N10  C                   MOVEL     XXTE32        TTTEXl
     C                   WRITE     TRACKFR
s16  C*                  ENDSR
n16  C     uttt          ENDSR
     C***********************************************
     C     NYTTNR        BEGSR
     C***********************************************
     C     SADHK         SETLL     SADV
     C     SADHK         READE     SADV                                   33
     C     *IN33         DOWEQ     '0'
     C     SVREFL        IFLE      0
     C                   MOVE      SVLI          SVLN
     C                   ELSE
     C                   MOVE      SVREFL        SVLN
     C                   END
     C                   UPDATE    SADVR
     C     SADHK         READE     SADV                                   33
     C  N33              ENDDO
     C                   MOVE      '0'           *IN33
      *
     C                   ENDSR
     C***********************************************
     C     FRISR         BEGSR
     C***********************************************
      *
     C                   MOVE      *zeros        kunde
     c                   CALL      'SYGE22'
     C                   PARM                    NAVN             30
     C                   PARM                    KUNDE             8 0
     C                   ENDSR
     C***********************************************
     C     FORESR        BEGSR
     C***********************************************
      *
     C                   MOVE      *zeros        kunde
     C                   MOVE      wsrg14        urg14
     c                   CALL      'SYGE23'
     C                   PARM                    uRG14            14
     C                   PARM                    KUNDE             8 0
     C                   ENDSR
N17  c***************************************************************************
N17  c     rycksr        begsr
N17  c***************************************************************************
N17   *ryckattest import
N17   *
N17  c     keysypa       klist
N17  c                   kfld                    sypaid
N17  c                   kfld                    syvrdn
N17   *
N17  c                   move      'RYCUT'       sypaid
N17  c                   testn                   tlager               33
N17  c     *in33         ifeq      '1'
N17  c                   setoff                                       33
N17  c                   move      tlager        tlagern           5 0
N17  C                   z-add     tlagern       syvrdn
N17  c     keysypa       setll     syparl4
N17  c     keysypa       reade     syparl4                                33
N17  C     *in33         IFEQ      '0'
N17  c     keysypa       reade     syparl4                                33
N17  c     *in33         ifeq      '0'
N17  c                   CALL      'SYRU04'
N17  c                   parm                    tlager
N17  c                   parm                    uavd
N17  c                   parm                    wstdn
N17  c                   else
N17  c                   move      uavd          ruavd
N17  c                   move      wstdn         ruopd
N17  c                   movel     syvrda        ruepost
N17  c                   write     ruckpur
N17  c                   end
N17  c                   end
N17  c                   end
N17  C                   ENDSR
