      *
      ************************************************************
      *** PROGRAM SKAL ENDRE STATUS PÅ SAD-TRANSITT            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 27-29 31-59 61-92                 ***
      ************************************************************
      *
     FKODTSI    IF   E           K DISK
     FSADTRH    UF   E           K DISK
     FSTS       UF A E           K DISK
     FSAD043FM  CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  SEDTÅ                  1      4  0
     D  SEDTM                  5      6  0
     D  SEDTD                  7      8  0
     D  SEDT                   1      8  0
     D                 DS
     D  WSCDTD                 1      2  0
     D  WSCDTM                 3      4  0
     D  WSCDTÅ                 5      6  0
     D  WSCDT                  1      6  0
     D                 DS
     D  SECDTÅ                 1      4  0
     D  SECDTM                 5      6  0
     D  SECDTD                 7      8  0
     D  SECDT                  1      8  0
     D                 DS
     D  WSDDTD                 1      2  0
     D  WSDDTM                 3      4  0
     D  WSDDTÅ                 5      6  0
     D  WSDDT                  1      6  0
     D                 DS
     D  SEDDTÅ                 1      4  0
     D  SEDDTM                 5      6  0
     D  SEDDTD                 7      8  0
     D  SEDDT                  1      8  0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      6  0
     D  XDAG                   7      8  0
     D  XMND                   9     10  0
     D  XAAR                  11     14  0
     D                 DS
     D  SSDTÅ                  1      4  0
     D  SSDTM                  5      6  0
     D  SSDTD                  7      8  0
     D  SSDT                   1      8  0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       999830
      *
     C   03              GOTO      SLUTT
     C     SATHK         CHAIN     SADTRH                             99
     C   99              DO
     C                   MOVE      'SPT0035'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     KODSIK        CHAIN     KODTSI                             98
     C   98              DO
     C                   UPDATE    SADTRHR
     C                   MOVE      'SPS0001'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      SEDTD         WSDTD
     C                   MOVE      SEDTM         WSDTM
     C                   MOVE      SEDTÅ         WSDTÅ
     C                   MOVE      SECDTD        WSCDTD
     C                   MOVE      SECDTM        WSCDTM
     C                   MOVE      SECDTÅ        WSCDTÅ
     C                   MOVE      SEDDTD        WSDDTD
     C                   MOVE      SEDDTM        WSDDTM
     C                   MOVE      SEDDTÅ        WSDDTÅ
      *
     C                   EXFMT     BILDE02
      *
     C   05              DO
     C     START2        TAG
     C                   TIME                    XTIME
     C                   MOVE      XAAR          SSDTÅ
     C                   MOVE      XMND          SSDTM
     C                   MOVE      XDAG          SSDTD
     C                   MOVE      XTID          SSTM
     C     STSK          CHAIN     STS                                99
     C  N99              GOTO      START2
     C                   MOVE      WSAVD         SSAVD
     C                   MOVE      WSOPD         SSOPD
     C                   MOVE      WSUSER        SSUSR
     C                   MOVE      WSSG          SSSG
     C                   MOVE      'N'           SSRTYP
     C                   MOVE      SEST          SSSTG
     C                   MOVE      WSST          SSSTN
     C                   WRITE     STSR
      *
     C   05              MOVE      WSST          SEST
     C                   UPDATE    SADTRHR
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSST
     C                   SETOFF                                       99
     C                   END
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSIK        KLIST
     C                   KFLD                    WSIUNI
     C                   KFLD                    WSSG
     C     SATHK         KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     STSK          KLIST
     C                   KFLD                    SSDT
     C                   KFLD                    SSTM
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSUSER
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
      *
     C                   MOVE      'SI'          WSIUNI            2
      *
     C                   ENDSR
      *
