     FSADMAVF   IF   E           K DISK
     FCUNDMAF   IF A E           K DISK
     FCUNDMAL1  UF   E           K DISK    RENAME(CUNDMAFR:CUNDMAR1)
     FCUNDLFO   IF   E           K DISK
     FCUNDL01   IF   E           K DISK    RENAME(KUNDR:KUNDR01)
     FFIRM      IF   E           K DISK
     FKODTS8    IF   E           K DISK
     D                 DS
     D  SYRG                   1     14
     D  SYRG01                 1      9
     D  SYRG02                10     14
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKD               2
     C     SADMAVFK      KLIST
     C                   KFLD                    UKD
     C                   KFLD                    MARG
     C     CUNDMAFK      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C                   KFLD                    UKD
     C     CUNDMAL1K     KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    UKD
     C     CUNDLFOK      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    SYRG
     C     CUNDL01K      KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    CMAKN
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
      * SLETT ALLE SOM IKKE ER MED ORDNING
     C     UKD           SETLL     SADMAVF                                33
     C                   IF        *IN33
     C     CUNDMAL1K     SETLL     CUNDMAL1
     C     CUNDMAL1K     READE     CUNDMAL1                               33
     C                   DOW       *IN33 = *OFF
     C     CUNDL01K      CHAIN     CUNDL01                            33
     C                   SELECT
     C                   WHEN      *IN33
     C                   UPDATE    CUNDMAR1
     C                   WHEN      (((SYRG01 <> *ZEROS) AND
     C                               (SYRG01 <> *BLANKS)) AND
     C                               (SYRG02 = *BLANKS))
     C                   MOVE      SYRG01        MARG
     C     SADMAVFK      CHAIN     SADMAVF                            33
     C                   IF        *IN33
     C                   DELETE    CUNDMAR1
     C                   ELSE
     C                   UPDATE    CUNDMAR1
     C                   END
     C                   OTHER
     C                   UPDATE    CUNDMAR1
     C                   ENDSL
     C     CUNDMAL1K     READE     CUNDMAL1                               33
     C                   ENDDO
     C                   END
      *
     C     UKD           SETLL     SADMAVF
     C     UKD           READE     SADMAVF                                33
     C                   DOW       *IN33 = *OFF
     C                   MOVEL     MARG          SYRG
     C     CUNDLFOK      CHAIN     CUNDLFO                            33
     C                   IF        *IN33 = *OFF
     C     CUNDMAFK      CHAIN     CUNDMAF                            33
     C                   IF        *IN33
     C                   EVAL      CMAFI  = FIFIRM
     C                   EVAL      CMAKN  = KUNDNR
     C                   EVAL      CMAKD  = UKD
     C     UKD           CHAIN     KODTS8                             33
     C  N33              EVAL      CMATXT = KS8FTX
     C   33              EVAL      CMATXT = *BLANKS
     C                   WRITE     CUNDMAFR
     C                   END
     C                   END
     C     UKD           READE     SADMAVF                                33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
