********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11062 * 01 YBC PTF11 TEST PÅ GODKJENNINGSDATO
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TOLLVESENETS LØPENR./DATO ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-32 34-39 41-89 95-97          ***
      ***********************************************************
      *
     Fsysthlp   IF   E             DISK
     FSAEH      UF   E           K DISK
     FHEADF     UF   E           K DISK
     FSAD024FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                UDS
     D  UAVD                   1      4  0
     C*
     C                   EXSR      INIT
     C                   GOTO      START6
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2TDN         YTDN              7 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SAEHK1        SETLL     SAEH
     C     START1        TAG
     C     UAVD          READE     SAEH                                   94
     C  N94              MOVE      SETDN         YTDN
     C  N94              EXCEPT    DUMSE
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     UAVD          READE     SAEH                                   94
     C  N94              MOVE      SETDN         YTDN
     C  N94              EXCEPT    DUMSE
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     4             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     c   01              do
     c                   movel     'sad024'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START3
     c                   end
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     c   01              do
     c                   movel     'sad024'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START3
     c                   end
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C   12              MOVE      *ZEROS        UAVD
     C   12              MOVE      '1'           UIN02
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94SAEHK3        SETLL     SAEH
     C  N94UAVD          READE     SAEH                                   94
     C  N94              EXCEPT    DUMSE
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      GETSE
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     c   01              do
     c                   movel     'sad024'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START6
     c                   end
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C*** TEST OM MAN HAR TASTET NOE
     C     WSDTG         COMP      *BLANKS                                90
     C   90WSTLL         COMP      *BLANKS                                90
     C   90WSTLE         COMP      *BLANKS                                90
N01   * TEST DATOFORMATO
N01  C                   IF        WSDTG <> *BLANKS
N01  C                   MOVE      *BLANKS       XAN02             2
N01  C                   IF        %SUBST(WSDTG:1:2) <> '20'
N01  C                   EVAL      *IN89 = *ON
N01  C                   ELSE
N01  C     '.'           SCAN      WSDTG                                  89
N01  C                   IF        *IN89 = *OFF
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:3:2)
N01  C                   MOVE      XAN02         UAA
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:5:2)
N01  C                   MOVE      XAN02         UMM
N01  C                   EVAL      XAN02 = %SUBST(WSDTG:7:2)
N01  C                   MOVE      XAN02         UDD
N01  C                   CALL      'TESTDATO'
N01  C                   PARM                    UDD               2 0
N01  C                   PARM                    UMM               2 0
N01  C                   PARM                    UAA               2 0
N01  C                   PARM                    FLAGG             1 0
N01  C     FLAGG         COMP      1                                      89
N01  C                   END
N01  C                   END
N01  C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     GETSE         BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLGET
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      CHGSE
     C   12              GOTO      SLGET
     C                   END
     C                   END
     C*
     C     SLGET         TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     4             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSE         BEGSR
     C***********************************************
     C                   EXSR      MOVSEW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     c   01              do
     c                   movel     'sad024'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      STCHG
     c                   end
     C                   SETOFF                                       90
N01  C                   MOVE      '0'           *IN89
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 90              GOTO      STCHG
N01  C  N12
N01  CAN 89              GOTO      STCHG
     C  N12              EXSR      OPDSE
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDSE         BEGSR
     C***********************************************
     C     SAEHK         CHAIN     SAEH                               33
     C  N33              DO
     C                   MOVE      WSDTG         SEDTG
     C                   MOVE      WSTLL         SETLL
     C                   MOVE      WSTLE         SETLE
     C                   EXCEPT    NYSE
     C                   END
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              DO
     C                   MOVE      WSTLL         HETLL
     C                   MOVE      WSTLE         HETLE
     C                   EXCEPT    NYHEAD
     C                   END
     C*
     C   40              UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSEW        BEGSR
     C***********************************************
     C                   MOVE      SEDTG         WSDTG
     C                   MOVE      SETLL         WSTLL
     C                   MOVE      SETLE         WSTLE
     C                   SETON                                        40
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSTLL
     C                   MOVE      *ZEROS        WSTLE
     C                   MOVE      *BLANKS       WSDTG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SAEHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    SETDN
     C     SAEHK1        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    W2TDN
     C     SAEHK3        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    YTDN
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    SETDN
     C*
     C     *ENTRY        PLIST
     C*** UIN02 = '1' -> UT PROGRAM FOR Å BYTTE AVDELING
     C     UIN02         PARM      UIN02         UIN02             1
     C                   MOVE      '0'           UIN02
     C*
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   WRITE     NYWRK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HELPSR        BEGSR
     C***********************************************
     c
     c                   move      *blanks       pcocmd           70
     c     1             chain     systhlp                            33
     c     *in(33)       ifeq      '0'
      *
      * intern
     c                   movel     'http://'     pcocmd
     C     pcocmd        CAT       systip:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       systba:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       hlpna:0       pcocmd
     C     pcocmd        CAT       '.htm':0      pcocmd
      *
     c                   call      'SYGE34CL'
     c                   parm                    pcocmd
     c                   end
     C                   ENDSR
      *
     OHEADFR    E            NYHEAD
     O                       HETLL
     O                       HETLE
     OSAEHR     E            DUMSE
     OSAEHR     E            NYSE
     O                       SEDTG
     O                       SETLL
     O                       SETLE
