********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 TOLLSTEDSKODE ER ENDRET TIL 4.0
10XXX * 02 SH  PTF10 flyttet cursorposition
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SØKE HAVNEKODER                        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 04 07-11 13-24
      *** LEDIGE INDIKATORER 31-90 95-97 99
      ***********************************************************
      *
     FKODTTST   IF   E           K DISK
     FKODTTSLF  IF   E           K DISK    RENAME(KOTSTR:KOTSTRL)
     FSAD061FJ  CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27KODTSK        SETLL     KODTTST
     C   27KODTLK        SETLL     KODTTSLF
     C     START1        TAG
     C  N27              READ      KODTTST                                94
     C   27              READ      KODTTSLF                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27              READ      KODTTST                                94
     C   27              READ      KODTTSLF                               94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
s02  C*                  Z-ADD     8             POSNBR
n02  C                   Z-ADD     10            POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C*
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   CALL      'SYFT04'
     C                   GOTO      START
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
S01  C*    W2KOD         ANDNE     0
S01  C*                  MOVE      W2KOD         UKOD
N01  C     W2PNR         ANDNE     0
N01  C                   MOVE      W2PNR         UPNR
     C                   GOTO      SLUTT
     C                   END
S01  C*    W2KOD         IFNE      0
N01  C     W2PNR         IFNE      0
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
S01  C*                  MOVE      KTSKOD        UKOD
N01  C                   MOVE      KTSPNR        UPNR
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTSK        KLIST
     C                   KFLD                    KTSUNI
S01  C*                  KFLD                    W2KOD
N01  C                   KFLD                    W2PNR
     C     KODTLK        KLIST
     C                   KFLD                    W2SØK
     C*
     C     *ENTRY        PLIST
S01  C*                  PARM                    UKOD              2 0
N01  C                   PARM                    UPNR              4 0
      *
S01  C*    UKOD          IFEQ      0
N01  C     UPNR          IFEQ      0
     C                   MOVE      '1'           *IN27
     C                   ELSE
S01  C*                  MOVE      UKOD          W2KOD
N01  C                   MOVE      UPNR          W2PNR
     C                   END
     C                   MOVE      'TST'         KTSUNI
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
     C*
