********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10244 * 01 YBC PTF10 VARENR ER UTVIDERT FRA 15A TIL 28A
      *              MYE ENDRING. INGEN MERKING
10286 * 02 YBC PTF10 VEKT ER ENDRET FRA 9.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
********************************************************************
      *
      ***********************************************************
      *** PROGRAM FOR VEDLIKEHOLD I LEVERANDØRERS VARER       ***
      ***********************************************************
      *
     FSADVARE   UF A E           K DISK
     FSAD001FM  CF   E             WORKSTN
      *
     C                   EXSR      INIT
      *
     C     ST            TAG
     C                   EXFMT     BILDE
     C   03              GOTO      SLUTT
     C   33              WRITE     SADVARER
     C  N33              UPDATE    SADVARER
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     KEYVAR        KLIST
     C                   KFLD                    LEVENR
     C                   KFLD                    VARENR
      *
     C     *ENTRY        PLIST
     C                   PARM                    ULEVE             8 0
     C                   PARM                    UVAREN           28
     C                   PARM                    UVAREB           50
      *
     C                   MOVE      ULEVE         LEVENR
     C                   MOVE      UVAREN        VARENR
      *
     C     KEYVAR        CHAIN     SADVARE                            33
      *
     C                   MOVE      UVAREB        VAREBE
     C                   ENDSR
