********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF10 frisøk mulig
10244 * 02 YBC PTF10 VARENR ER UTVIDERT FRA 15A TIL 28A
      *              MYE ENDRING. INGEN MERKING
10XXX * 03 SH  PTF11 startverdi søking
********************************************************************
      *
      ***********************************************************
      *** PLUKKING VARER                                      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 07-11 13-24
      *** LEDIGE INDIKATORER 31-90 95-97 99
      ***********************************************************
     FSADVARE   IF   E           K DISK
     FSADVARE1  IF   E           K DISK
     F                                     RENAME(SADVARER:SADVAR1)
     FSAD001FB  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D  SOKE28         S             28
     D  NAVN28         S             28
     D  VARI28         S             28A   VARYING
     D  SOKE50         S             50
     D  NAVN50         S             50
     D  VARI50         S             50A   VARYING
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZ')
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyz')
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     FRISOK        IFEQ      'N'
     C  N27KEYFYS        SETLL     SADVARE
     C   27KEYLOG        SETLL     SADVARE1
     C                   ELSE
     C  N27KEYFYS2       SETLL     SADVARE
     C   27KEYLOG2       SETLL     SADVARE1
     C  N27              EVAL      SOKE28=W2VANR
     C   27              EVAL      SOKE50=W2VABE
     C  N27' '           CHECKR(E) SOKE28        NUM               2 0
     C   27' '           CHECKR(E) SOKE50        NUM               2 0
     C     num           ifne      *zeros
     C  n27              EVAL      %len(VARI28) = NUM
     C   27              EVAL      %len(VARI50) = NUM
     C  N27NUM           SUBST     SOKE28:1      VARI28
     C   27NUM           SUBST     SOKE50:1      VARI50
     C                   END
     C                   END
     C     START1        TAG
     C  N27KEYLEV        READE     SADVARE                                94
     C   27KEYLEV        READE     SADVARE1                               94
     C  N94FRISOK        IFEQ      'J'
     C     num           andne     *zeros
     C  N27LO:UP         XLATE     VARENR        NAVN28
     C  N27VARI28        SCAN      NAVN28        NUM2              2 0    72
     C   27LO:UP         XLATE     VAREBE        NAVN50           50
     C   27VARI50        SCAN      NAVN50        NUM2              2 0    72
     c  N72              goto      start1
     C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     nyles         tag
     C  N27KEYLEV        READE     SADVARE                                94
     C   27KEYLEV        READE     SADVARE1                               94
      *
     C  N94FRISOK        IFEQ      'J'
     C     num           andne     *zeros
     C  N27LO:UP         XLATE     VARENR        NAVN28
     C  N27VARI28        SCAN      NAVN28        NUM2              2 0    72
     C   27LO:UP         XLATE     VAREBE        NAVN50           50
     C   27VARI50        SCAN      NAVN50        NUM2              2 0    72
     c  N72              goto      nyles
     C                   END
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     4             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
     C     LEVENR        IFNE      WSKUND
     C                   MOVE      WSKUND        LEVENR
     C                   GOTO      START
     C                   END
      *** FRISK OPP
     C   05              GOTO      START
      *** LAG NY
     C     *IN06         IFEQ      *ON
     C                   CALL      'SAD001A'
     C                   GOTO      START
     C                   END
      *
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2VANR        IFNE      *BLANKS
     C     KEYFYS        CHAIN     SADVARE                            33
     C     *IN33         IFNE      '1'
     C                   EVAL      UKOD = W2VANR
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C     W2VANR        IFNE      *BLANKS
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2VABE        IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     HENT          BEGSR
      ***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      LEVENR        ULEVE
     C                   MOVE      VARENR        UKOD
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    ULEVE             8
     C                   PARM                    UKOD             28
     C                   MOVE      ULEVE         LEVENR
n03  c                   movel     ukod          w2vanr
     C     KEYFYS        KLIST
     C                   KFLD                    LEVENR
     C                   KFLD                    W2VANR
     C     KEYFYS2       KLIST
     C                   KFLD                    LEVENR
     C     KEYLOG        KLIST
     C                   KFLD                    LEVENR
     C                   KFLD                    W2VABE
     C     KEYLOG2       KLIST
     C                   KFLD                    LEVENR
     C     KEYLEV        KLIST
     C                   KFLD                    LEVENR
      *
s03  C*                  MOVE      'J'           FRISOK
n03  C                   MOVE      'N'           FRISOK
     C                   MOVE      ULEVE         WSKUND
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
