********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10006 * 01 sh  PTF10 *cr til *ce
10024 * 02 YBC PTF10 SAMSLÅING OG FORHOLD BRT/NET VEKT
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11016 * 03 YBC PTF11 VIS OMBEREGNINGS OPPDRAG
11XXX * 04 YBC PTF11 VIS LØPENR/EKSP.NR TIL OMBEREGNING
11XXX * 05 YBC PTF11 VIS BLANK LØPENR NÅR OMBEREGNING IKKE ER SENDT
11XXX * 06 YBC PTF11 VIS LØPENR VED NYTT LØPENR <> GAMMELT LØPENR
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ SAD-EKSPORT (HOVEDARK)       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04-11 13-26                   ***
      *** LEDIGE INDIKATORER 27 28 30-99                      ***
      ***********************************************************
      *
     FSAEH      IF   E           K DISK
N03  FSAEHOM    IF   E           K DISK    RENAME(SAEHR:SAEHROM)
N02  FSAEHTL    IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FSAD023FA  CF   E             WORKSTN
     D                 DS
     D  SEDTÅF                 1      4  0
     D  SEDTMF                 5      6  0
     D  SEDTDF                 7      8  0
     D  SEFID                  1      8  0
     D                 DS
     D  WSDTDF                 1      2  0
     D  WSDTMF                 3      4  0
     D  WSDTÅF                 5      6  0
     D  WSFID                  1      6  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  SEDTÅ                  1      4  0
     D  SEDTM                  5      6  0
     D  SEDTD                  7      8  0
     D  SEDT                   1      8  0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
N03  C                   IF        UTDN < 0
N06  C                   EVAL      UTDN = UTDN * -1
N06  C     SAEHK         CHAIN     SAEH                               99
N06  C                   MOVE      SETLL         X_SETLL          10
N06  C                   EVAL      UTDN = UTDN * -1
N03  C     SAEHK         CHAIN     SAEH                               99
S06  C*    SEST          COMP      'P'                                    39
N06  C     SETLL         COMP      X_SETLL                            3939
N05  C                   IF        SEMF <> 'DEB' AND SEMF <> 'DRE'
N05  C                             AND SEMF <> 'DSO'
N06  C                             AND SETLL = X_SETLL
N05  C                   EVAL      SETLL = *BLANKS
N05  C                   EVAL      SETLE = *BLANKS
N05  C                   EVAL      SEDTG = *BLANKS
N05  C                   END
N03  C                   EXFMT     BILDEOM
N03  C                   ELSE
     C                   EXFMT     BILDE
N03  C                   END
     C                   SETOFF                                       99
     C   01              Z-ADD     1             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     9             UFLAGG
     C   01
     COR 03
     COR 12              GOTO      SLUTT
     C   04              DO
     C                   EXSR      VISR28
     C                   GOTO      START
     C                   END
     C   14              DO
     C                   EXSR      SRM
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C                   END
     C*
     C                   CALL      'SAD023B'
     C                   PARM                    UAVD
     C                   PARM                    UTDN
     C                   PARM                    SEBEL1
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      9
     C                   GOTO      START
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     VISR28        BEGSR
     C***********************************************
     C     SEFID         IFNE      99999999
     C                   SETON                                        99
     C                   ELSE
     C                   CALL      'VISRB28C'
     C                   PARM                    UAVD
     C                   PARM                    UTDN
     C                   PARM                    UFLAGG
     C                   END
     C*
     C                   ENDSR
     C*
      *__________________________________________________________
      * SR for å vise TVINN Meldingslogg                      SRM
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRM           BEGSR
      *________________________
      * Call på eksternt CL-pgm
      *""""""""""""""""""""""""
     C                   MOVE      '1'           WIN03             1
     C                   CALL      'SAD003'
     C                   PARM                    UAVD
     C                   PARM                    UTDN
     C                   PARM                    WIN03
     C     WIN03         IFEQ      '1'
     C                   SETON                                        03
     C                   Z-ADD     3             UFLAGG
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SAEHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C     EXTREFK1      KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    WSKODE            3
s01  C*                  MOVEL     '*CR'         WSKODE
n01  C                   MOVEL     '*CE'         WSKODE
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    UFLAGG            1 0
     C                   Z-ADD     0             UFLAGG
     C*
     C                   MOVE      *ZEROS        WSDT
     C                   MOVE      *ZEROS        SEDT
     C     SAEHK         CHAIN     SAEH                               29
N03  C                   IF        UTDN < 0
N03  C     SAEHK         CHAIN     SAEHOM                             29
N03  C                   END
     C   29              SETON                                        LR
     C   29              RETURN
N02  C     SAEHK         CHAIN     SAEHTL                             33
N02  C   33              EVAL      SESAM = 'J'
N02  C   33              EVAL      SEFVK = 0,9
     C                   MOVE      SEDTD         WSDTD
     C                   MOVE      SEDTM         WSDTM
     C                   MOVE      SEDTÅ         WSDTÅ
     C                   MOVE      SEDTDF        WSDTDF
     C                   MOVE      SEDTMF        WSDTMF
     C                   MOVE      SEDTÅF        WSDTÅF
     C     EXTREFK1      CHAIN     FRISOK                             33
     C  N33              MOVEL     FSSOK         WSTR17
     C*
     C                   ENDSR
     C*
