      ***************************************************************
      *** PROGRAM SKAL HENTE AVDELINGSDATA SAD OG RETURNERE       ***
      *** PRINTERPARAMETRE                                        ***
      *** PARAMETER INN ER AVD                                    ***
      ***************************************************************
     FSTANDT    IF   E           K DISK
     FKODTP     IF   E           K DISK
     D                UDS
     D  UDSAVD                15     18
     D  UDL                   36     36
     D  UA4                   43     43
      *
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI
     C                   KFLD                    WOPAVD
     C                   KFLD                    WOPLNR
     C     *LIKE         DEFINE    KOPAVD        WOPAVD
     C     *LIKE         DEFINE    KOPUNI        WOPUNI
     C     *LIKE         DEFINE    KOPLNR        WOPLNR
     C                   Z-ADD     0             WOPAVD
     C                   MOVE      'P'           WOPUNI
     C                   Z-ADD     0             WOPLNR
     C     *ENTRY        PLIST
     C                   PARM                    WSAVD             4 0
     C                   PARM                    UHOVP            10            * HOVEDARK
     C                   PARM                    UTILP            10            * TILLEGSARK
     C                   PARM                    ULSTP            10            * TRANSITTLISTE
     C                   PARM                    UUTLP            10
     C                   PARM                    UMRKP            10
     C                   PARM                    UDLP             10
     C                   MOVE      WSAVD         UDSAVD
      *
     C     WSAVD         CHAIN     STANDT                             99
     C  N99              DO
     C                   MOVE      SEDL          UDL
      * Printerstyring for hovedark
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     91            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UHOVP
     C                   ENDIF
      * Printerstyring for tillegssark
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     92            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UTILP
     C                   ENDIF
      * Printerstyring for dataliste
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     93            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UDLP
     C                   ENDIF
      * Printerstyring for lasteliste
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     95            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        ULSTP
     C                   ENDIF
      * Printerstyring for utleveringsattest
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     96            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UUTLP
     C                   ENDIF
      * Printerstyring for merknad
     C                   Z-ADD     WSAVD         WOPAVD
     C                   Z-ADD     97            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UMRKP
     C                   ENDIF
     C                   MOVE      SEA4          UA4
     C                   END
      *  0000 I WSAVD ER SIGNAL TIL NESTE PROG OM UDEF. AVDELING
     C   99              DO
     C                   MOVE      *ZEROS        WSAVD
     C                   MOVEL     'PRT01'       UHOVP
     C                   MOVEL     'PRT01'       UTILP
     C                   MOVEL     'PRT01'       UDLP
     C                   MOVEL     'PRT01'       ULSTP
     C                   MOVEL     'PRT01'       UUTLP
     C                   MOVEL     'PRT01'       UMRKP
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
