      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ SAD-EKSPORT (HISTORIKK)      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04-11 13-26                   ***
      *** LEDIGE INDIKATORER 28-99                            ***
      ***********************************************************
      *
     FSAEHCMP   IF   E           K DISK
     FSAD023OA  CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
EV5  D  SEDTÅ                  1      4  0
EV5  D  SEDTM                  5      6  0
EV5  D  SEDTD                  7      8  0
EV5  D  SEDT                   1      8  0
     C*
     C                   EXSR      INIT
     C*
     C                   EXFMT     BILDE
     C   01              Z-ADD     1             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     9             UFLAGG
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SAEHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    UFLAGG            1 0
     C                   Z-ADD     0             UFLAGG
     C*
     C                   MOVE      *ZEROS        WSDT
     C                   MOVE      *ZEROS        SEDT
     C     SAEHK         CHAIN     SAEHCMP                            27
     C   27              SETON                                        LR
     C   27              RETURN
     C                   MOVE      SEDTD         WSDTD
     C                   MOVE      SEDTM         WSDTM
     C                   MOVE      SEDTÅ         WSDTÅ
     C*
     C                   ENDSR
     C*
