********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 YBC PTF11 KUN ENDRE STATUS FRA 'E' ELLER BLANK
11XXX * 02 YBC PTF11 OGSÅ STATUS 'K' OG 'Å' KAN ENDRES
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 03 YBC PTF11 ENDRE STATUS PÅ OMBEREGNING
********************************************************************
      *
      ************************************************************
      *** PROGRAM SKAL ENDRE STATUS PÅ SAD-EKSPORT             ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 27-29 31-59 61-92                 ***
      ************************************************************
      *
     Fsysthlp   IF   E             DISK
     FKODTSI    IF   E           K DISK
     FSAEH      UF   E           K DISK
     FSTS       UF A E           K DISK
     FSAD029FM  CF   E             WORKSTN
     D                 DS
     D  SEDTÅF                 1      4  0
     D  SEDTMF                 5      6  0
     D  SEDTDF                 7      8  0
     D  SEFID                  1      8  0
     D                 DS
     D  WSDTDF                 1      2  0
     D  WSDTMF                 3      4  0
     D  WSDTÅF                 5      6  0
     D  WSFID                  1      6  0
     D                 DS
     D  SEDTÅ                  1      4  0
     D  SEDTM                  5      6  0
     D  SEDTD                  7      8  0
     D  SEDT                   1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      6  0
     D  XDAG                   7      8  0
     D  XMND                   9     10  0
     D  XAAR                  11     14  0
     D                 DS
     D  SSDTÅ                  1      4  0
     D  SSDTM                  5      6  0
     D  SSDTD                  7      8  0
     D  SSDT                   1      8  0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     c   01              do
     c                   movel     'sad029'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START
     c                   end
     C                   SETOFF                                       999830
     C*
     C   03              GOTO      SLUTT
     C     SAEHK         CHAIN     SAEH                               99
     C   99              DO
     C                   MOVE      'SPT0035'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     KODSIK        CHAIN     KODTSI                             98
     C   98              DO
     C                   UPDATE    SAEHR
     C                   MOVE      'SPS0001'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
N03   *
N03  C     SETLL         IFNE      *ZEROS
N03  C     SETLL         ANDNE     *BLANKS
N03  C     WSOPD         ANDGT     0
N03  C                   SETON                                        3099
N03  C                   MOVE      'SHU1387'     MSGNR
N03  C                   GOTO      START
N03  C                   END
     C*
     C                   MOVE      SEDTDF        WSDTDF
     C                   MOVE      SEDTMF        WSDTMF
     C                   MOVE      SEDTÅF        WSDTÅF
     C                   MOVE      SEDTD         WSDTD
     C                   MOVE      SEDTM         WSDTM
     C                   MOVE      SEDTÅ         WSDTÅ
N01  C     SEST          COMP      'E'                                2828
N01  C   28SEST          COMP      ' '                                2828
N02  C   28SEST          COMP      'K'                                2828
N02  C   28SEST          COMP      'Å'                                2828
N03  C     WSOPD         COMP      0                                    29
     C     START3        TAG
     C                   EXFMT     BILDE02
     c   01              do
     c                   movel     'sad029'      hlpna             8
     c                   exsr      helpsr
     C                   GOTO      START3
     c                   end
     C*
     C   05
     COR 07
     COR 09              DO
     C     START2        TAG
     C                   TIME                    XTIME
     C                   MOVE      XAAR          SSDTÅ
     C                   MOVE      XMND          SSDTM
     C                   MOVE      XDAG          SSDTD
     C                   MOVE      XTID          SSTM
     C     STSK          CHAIN     STS                                99
     C  N99              GOTO      START2
     C                   MOVE      WSAVD         SSAVD
     C                   MOVE      WSOPD         SSOPD
     C                   MOVE      WSUSER        SSUSR
     C                   MOVE      WSSG          SSSG
     C                   MOVE      'J'           SSRTYP
     C                   SELECT
     C     *IN05         WHENEQ    '1'
     C                   MOVE      SEST          SSSTG
     C                   MOVE      WSST          SSSTN
     C     *IN07         WHENEQ    '1'
     C                   MOVE      SEMI          SSSTG                          *FJERN MERKE
     C                   MOVE      '<'           SSSTN
     C     *IN09         WHENEQ    '1'
     C                   MOVE      SEMI          SSSTG                          *SETT  MERKE
     C                   MOVE      '>'           SSSTN
     C                   ENDSL
     C                   WRITE     STSR
     C*
     C   05              MOVE      WSST          SEST
     C   07              MOVE      ' '           SEMI
     C   09              MOVE      'I'           SEMI
     C                   UPDATE    SAEHR
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSST
     C                   SETOFF                                       99
     C                   END
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSIK        KLIST
     C                   KFLD                    WSIUNI
     C                   KFLD                    WSSG
     C     SAEHK         KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     STSK          KLIST
     C                   KFLD                    SSDT
     C                   KFLD                    SSTM
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSUSER
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
     C*
     C                   MOVE      'SI'          WSIUNI            2
     C                   MOVE      *ZEROS        SEFID
     C                   MOVE      *ZEROS        WSFID
     C*
     C                   ENDSR
     C***********************************************
     C     HELPSR        BEGSR
     C***********************************************
     c
     c                   move      *blanks       pcocmd           70
     c     1             chain     systhlp                            33
     c     *in(33)       ifeq      '0'
      *
      * intern
     c                   movel     'http://'     pcocmd
     C     pcocmd        CAT       systip:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       systba:0      pcocmd
     C     pcocmd        CAT       '/':0         pcocmd
     C     pcocmd        CAT       hlpna:0       pcocmd
     C     pcocmd        CAT       '.htm':0      pcocmd
      *
     c                   call      'SYGE34CL'
     c                   parm                    pcocmd
     c                   end
     C                   ENDSR
     C*
