********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SLUTT DATO
10262 * 02 YBC PTF10 SATS ER UTVIDERT TIL 7.2, INGEN MERKING
********************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TOLLTARIFFEN                 ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 28 29 32 34-39 41-83 90 95-97       ***
      **************************************************************
      *
     FTARI      IF   E           K DISK
     FTARIL02   IF   E           K DISK
     F                                     RENAME(TARIR:TARI2R)
     FSAD010FA  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  XKOD                   1      8
     D  VN                     1      8
     D                                     DIM(8)
     D                 DS
     D  W2KOD                  1      8  0
     D  VN2                    1      8  0
     D                                     DIM(8)
     D                 DS
     D  TATANR                 1      8  0
     D  TAORDK                 9      9
     D  TAORDB                10     16  2
     D  TAEFTB                17     23  2
     D  TAEFB                 24     30  2
     D  TASTK                 31     31
     D  TAKAP                 32     32
     D  TAALFA                33     47
     D  TAENHE                48     50
     D  TATXT                 51    130
     D  TAALL                  1    130
     D                 DS
     D  T2TANR                 1      8  0
     D  T2ORDK                 9      9
     D  T2ORDB                10     16  2
     D  T2EFTB                17     23  2
     D  T2EFB                 24     30  2
     D  T2STK                 31     31
     D  T2KAP                 32     32
     D  T2ALFA                33     47
     D  T2ENHE                48     50
     D  T2TXT                 51    130
     D  T2ALL                  1    130
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2KOD         YKOD              8 0
     C                   MOVE      W2SØK         YSØK             15
     C                   Z-SUB     1             T2TANR
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27TARIK         SETLL     TARI
     C   27TARI2K        SETLL     TARIL02
     C     START1        TAG
     C  N27              READ      TARI                                   94
     C   27              READ      TARIL02                                94
     C  N94T2TANR        IFEQ      -1
     C     T2TANR        OREQ      TATANR
     C                   MOVE      TATANR        XTANR             8 0
     C     TADATO        IFLE      UDATO
     C                   MOVE      TAALL         T2ALL
     C                   GOTO      START1
     C                   ELSE
     C  N94T2TANR        DOUNE     TATANR
     C     TADATO        ANDLE     UDATO
     C  N27              READ      TARI                                   94
     C   27              READ      TARIL02                                94
     C  N94              ENDDO
     C                   END
     C                   END
N01  C  N94              IF        ((TADTS <> 0) AND (TADTS < UDATO))
N01  C                   MOVE      TAALL         T2ALL
N01  C                   GOTO      START1
N01  C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   MOVE      TATANR        XTANR             8 0
     C                   MOVE      TAALL         T2ALL
     C     ST21          TAG
     C  N27              READ      TARI                                   94
     C   27              READ      TARIL02                                94
     C  N94T2TANR        IFEQ      TATANR
     C                   MOVE      TATANR        XTANR             8 0
     C     TADATO        IFLE      UDATO
     C                   MOVE      TAALL         T2ALL
     C                   GOTO      ST21
     C                   ELSE
     C  N94T2TANR        DOUNE     TATANR
     C     TADATO        ANDLE     UDATO
     C  N27              READ      TARI                                   94
     C   27              READ      TARIL02                                94
     C  N94              ENDDO
     C                   END
     C                   END
N01  C  N94              IF        ((TADTS <> 0) AND (TADTS < UDATO))
N01  C                   MOVE      TAALL         T2ALL
N01  C                   GOTO      ST21
N01  C                   END
     C  N94              END
     C                   END
      *
     C   94T2TANR        IFNE      -1
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     46            POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C                   MOVE      *ZEROS        W2KOD
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C*
     C                   SETOFF                                       989930
     C*
     C   03
     COR 12              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   MOVE      'N'           UPLUKK            1
     C                   CALL      'SAD010'
     C                   PARM                    UPLUKK
     C                   PARM                    UKOD
     C                   GOTO      START
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2KOD         ANDNE     0
     C                   MOVE      W2KOD         UKOD
     C                   GOTO      SLUTT
     C                   END
     C     W2KOD         IFNE      0
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   SETOFF                                       9192
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      T2TANR        UKOD
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     TARIK         KLIST
     C                   KFLD                    YKOD
     C                   KFLD                    YTAR
     C     TARI2K        KLIST
     C                   KFLD                    YSØK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UKOD              8
     C                   PARM                    UDATO             8 0
      *
     C                   MOVE      *BLANKS       YTAR              3
     C                   MOVE      *ZEROS        W2KOD
     C     UKOD          IFEQ      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   ELSE
     C                   MOVE      UKOD          XKOD
     C     1             DO        8             XN                1 0
     C     VN(XN)        IFNE      ' '
     C                   MOVE      VN(XN)        VN2(XN)
     C                   END
     C                   END
     C                   END
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
     C*
