      *
      ***********************************************************
      *** PROGRAM SKAL PLUKKE TOLLDEK. FRA Z-FILER            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 06-11 13-24
      *** LEDIGE INDIKATORER 31-49 51-90 95-97
      ***********************************************************
      *
     FZAEHL05   IF   E           K DISK
     FZAEHL03   IF   E           K DISK
     F                                     RENAME(SAEHR:SAEHR3)
     FZAEHL04   IF   E           K DISK
     F                                     RENAME(SAEHR:SAEHR4)
     FZAEHL01   UF   E           K DISK
     F                                     RENAME(SAEHR:SAEHR1)
     FSAD052FG  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  XNAS                   1     30
     D  AL                     1     30
     D                                     DIM(30)
      *
     C                   EXSR      INIT
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   GOTO      START3
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2REFF        YREFF            17
     C                   MOVE      W2KNS         YKNS              8 0
     C                   MOVE      W2NAS         YNAS             30
     C                   MOVE      *BLANKS       W2REFF
     C                   MOVE      *ZEROS        W2KNS
     C                   MOVE      *BLANKS       W2NAS
     C   29              EXSR      FINMAX
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C   27YREFF         SETLL     ZAEHL05
     C   28YKNS          SETLL     ZAEHL03
     C   29YNAS          SETLL     ZAEHL04
     C     START1        TAG
     C   27              READ      ZAEHL05                                94
     C   28YKNS          READE     ZAEHL03                                94
     C   29              READ      ZAEHL04                                94
     C   29SENAK         COMP      XNAS                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        10
     C                   ADD       1             ZRECNO
     C     SEST          COMP      'O'                                    50
     C                   WRITE     SUBFIL
     C   27              READ      ZAEHL05                                94
     C   28YKNS          READE     ZAEHL03                                94
     C   29              READ      ZAEHL04                                94
     C   29SENAK         COMP      XNAS                               94
     C     *IN94         IFEQ      '0'
     C                   MOVE      SEREFF        XXREFF           17
     C                   MOVE      SEUNIK        XXUNIK            9 0
     C                   MOVE      SEAVD         XXAVD             4 0
     C                   MOVE      SETDN         XXOPD             7 0
     C                   MOVE      SEKNK         XXKNK             8 0
     C                   MOVE      SENAK         XXNAK            30
     C                   MOVE      SEST          XXST              1
     C                   END
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              Z-ADD     1             UFLAGG
     C   03
     COR 12              GOTO      SLUTT
      *
     C   04              DO
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    W2KNS
     C                   PARM                    UFIRM
     C                   PARM                    USØKKN
     C                   GOTO      START3
     C                   END
      *** FRISK OPP
     C   05              GOTO      START
      *
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C     *IN94         IFEQ      '0'
     C                   MOVE      XXREFF        SEREFF
     C                   MOVE      XXUNIK        SEUNIK
     C                   MOVE      XXAVD         SEAVD
     C                   MOVE      XXOPD         SETDN
     C                   MOVE      XXKNK         SEKNK
     C                   MOVE      XXNAK         SENAK
     C                   MOVE      XXST          SEST
     C                   END
     C                   GOTO      START2
     C                   END
      *
     C     W2REFF        IFNE      *BLANKS
     C                   MOVEA     '100'         *IN(27)
     C                   GOTO      START
     C                   END
     C     W2KNS         IFNE      0
     C                   MOVEA     '010'         *IN(27)
     C                   GOTO      START
     C                   END
     C     W2NAS         IFNE      *BLANKS
     C                   MOVEA     '001'         *IN(27)
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     FINMAX        BEGSR
     C***********************************************
     C                   MOVEL     W2NAS         XNAS
     C                   Z-ADD     30            XN                2 0
     C     STSMAX        TAG
     C     AL(XN)        IFEQ      ' '
     C                   MOVE      '9'           AL(XN)
     C                   SUB       1             XN
     C     XN            IFGE      1
     C                   GOTO      STSMAX
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C     SEST          IFEQ      'O'
     C                   EXFMT     BEKREFT
     C                   END
     C     *IN12         IFEQ      '0'
     C                   MOVE      SEREFF        UREFF
     C                   MOVE      SEUNIK        UUNIK
     C                   MOVE      SEAVD         UAVD
     C                   MOVE      SETDN         UOPD
     C                   GOTO      SLHENT
     C                   ELSE
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     ZAEH1K        CHAIN     ZAEHL01                            33
     C                   MOVE      'O'           SEST
     C                   UPDATE    SAEHR1
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
      *
     C     *IN99         IFEQ      '1'
     C                   MOVEA     '00'          *IN(98)
     C                   ELSE
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     ZAEH1K        KLIST
     C                   KFLD                    SEUNIK
     C                   KFLD                    SEREFF
     C     *ENTRY        PLIST
     C                   PARM                    UFIRM             2
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UREFF            17
     C                   PARM                    UUNIK             9 0
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      *ZEROS        UAVD
     C                   MOVE      *ZEROS        UOPD
     C                   MOVE      *BLANKS       UREFF
     C                   MOVE      *ZEROS        UUNIK
     C                   MOVE      *ZEROS        UFLAGG
     C                   MOVEA     '100'         *IN(27)
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
