      *
      ***********************************************************
      *** PROGRAM SKAL PLUKKING AV FISKEAVGIFT                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 08-11 13-24
      *** LEDIGE INDIKATORER 31-90 95-97 99
      ***********************************************************
      *
     FSADAVGE   IF   E           K DISK
     FSAD052FD  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SADAVK        SETLL     SADAVGE
     C     START1        TAG
     C     SADAVK        READE     SADAVGE                                94
     C     *IN94         IFEQ      '0'
     C     AGDTF         IFGT      USEDT
     C     AGDTT         ORLE      USEDT
     C                   GOTO      START1
     C                   END
     C     AGAKTK        CABEQ     'I'           START1
     C     AGKD          CABNE     UPRE          START1
     C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     ST21          TAG
     C     SADAVK        READE     SADAVGE                                94
     C     *IN94         IFEQ      '0'
     C     AGDTF         IFGT      USEDT
     C     AGDTT         ORLE      USEDT
     C                   GOTO      ST21
     C                   END
     C     AGAKTK        CABEQ     'I'           ST21
     C     AGKD          CABNE     UPRE          ST21
     C                   END
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
      *** FRISK OPP
     C   05              GOTO      START
      *** AVBRYT
     C   12              GOTO      SLUTT
      *
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      AGSKV         USKV
     C                   MOVE      AGSATS        USATS
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SADAVK        KLIST
     C                   KFLD                    UVNT
     C                   KFLD                    AGAKD
      *
     C     *ENTRY        PLIST
     C                   PARM                    UVNT              8 0
     C                   PARM                    USKV              3
     C                   PARM                    USATS             5 3
     C                   PARM                    UPRE              1
     C                   PARM                    USEDT             8 0
      *
     C                   MOVE      'FF'          AGAKD
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
