      *
     FSADS      IP   E           K DISK
     FSADSD     O    E           K DISK
     FTARI      IF   E           K DISK
     C*
     C     TARIK         KLIST
     C                   KFLD                    WSTNR
     C                   KFLD                    WSTAR
     C                   MOVE      *BLANKS       WSTAR             3
     C*
     C                   MOVE      SSKDAÆ        SDKDAÆ
     C                   MOVE      SSBLSÆ        SDBLSÆ
     C                   MOVE      SSHKOD        SDHKOD
     C                   MOVE      SSVF          SDVF
     C*
     C                   MOVE      SSTNRF        WSTNR             8 0
     C     TARIK         SETLL     TARI
     C     LESTAR        TAG
     C                   READ      TARI                                   87
     C     *IN87         IFEQ      *OFF
     C     TATANR        ANDLE     SSTNRT
     C                   MOVE      TATANR        SDTNRF
     C                   WRITE     SADSDR
     C                   GOTO      LESTAR
     C                   ENDIF                                                  <*IN87
