     FSADTRH11  UF   E           K DISK
     FSADTRV    UF   E           K DISK
      *
     D                 DS
     D  XDT2                   1      6  0
     D  XD                     1      2  0
     D  XM                     3      4  0
     D  XÅ                     5      6  0
     D                 DS
EV5  D  WDT                    1      8  0
EV5  D  WÅ                     1      4  0
EV5  D  WM                     5      6  0
EV5  D  WD                     7      8  0
      *
     C                   EXSR      INIT
      *
      *_____________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SADTRH11
      *"""""""""""""""""""""""""""""""""""""""""""""
     C     SEDT          SETLL     SADTRH11
     C                   READ      SADTRH11                               51
     C  N51SEDT          COMP      WDT                                51
     C                   DOW       *IN51 = *OFF
     C                   IF        ((XAVD = 0) OR (SEAVD = XAVD))
     C                   EXSR      SRA
     C                   DELETE    SADTRHR
     C                   END
     C                   READ      SADTRH11                               51
     C  N51SEDT          COMP      WDT                                51
     C  N51              END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SADTRV
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
     C     SADTRHK       SETLL     SADTRV
     C     SADTRHK       READE     SADTRV                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    SADTRVR
     C     SADTRHK       READE     SADTRV                                 52
     C                   END
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SADTRHK       KLIST
     C                   KFLD                    SEAVD
     C                   KFLD                    SETDN
      *_______________
      * PARAMETER LIST
      *"""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    XAVD
     C     XDT2          PARM                    XDT
      *____________
      * WORK FIELDS
      *""""""""""""
     C     *LIKE         DEFINE    SEAVD         XAVD
     C     *LIKE         DEFINE    XDT2          XDT
      *____________
      * INIT FIELDS
      *""""""""""""
     C                   Z-ADD     XÅ            WÅ
     C                   Z-ADD     XM            WM
     C                   Z-ADD     XD            WD
NV5  C                   IF        XÅ > 50
NV5  C                   MOVEL     '19'          WÅ
NV5  C                   ELSE
NV5  C                   MOVEL     '20'          WÅ
NV5  C                   ENDIF
      *
     C                   ENDSR
      *
