     FEDIM2     UF   E           K DISK
     FEDIS      UF   E           K DISK
     FSAEF      UF   E           K DISK
     FSAEHD     UF   E           K DISK
     FSAEV      UF   E           K DISK
     FTVINF     UF   E           K DISK
      *
     FEDIMOLD   O    E             DISK    RENAME(EDIMR:EDIMRO)
     FEDISOLD   O    E             DISK    RENAME(EDISR:EDISRO)
     FSAEFOLD   O    E             DISK    RENAME(SADFR:SADFRO)
     FSAEHOLD   O    E             DISK    RENAME(SAEHR:SAEHRO)
     FSAEVOLD   O  A E             DISK    RENAME(SAEVR:SAEVRO)
      *
     D                 DS
     D  XDT2                   1      6  0
     D  XD                     1      2  0
     D  XM                     3      4  0
     D  XÅ                     5      6  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
      *
     C                   EXSR      INIT
      *
      *__________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SAEHD
      *""""""""""""""""""""""""""""""""""""""""""
     C     SEDT          SETLL     SAEHD
     C                   READ      SAEHD                                  51
     C  N51SEDT          COMP      WDT                                51
     C                   DOW       *IN51 = *OFF
     C                   IF        ((XAVD = 0) OR (SEAVD = XAVD))
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   WRITE     SAEHRO
     C                   DELETE    SAEHR
     C                   END
     C                   READ      SAEHD                                  51
     C  N51SEDT          COMP      WDT                                51
     C  N51              END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      *_________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SAEV
      *"""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
     C     SAEHK         SETLL     SAEV
     C     SAEHK         READE     SAEV                                   52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     SAEVRO
     C                   DELETE    SAEVR
     C     SAEHK         READE     SAEV                                   52
     C                   END
     C                   ENDSR
      *_________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SAEF
      *"""""""""""""""""""""""""""""""""""""""""
     C     SRB           BEGSR
     C     SAEHK         SETLL     SAEF
     C     SAEHK         READE     SAEF                                   52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     SADFRO
     C                   DELETE    SADFR
     C     SAEHK         READE     SAEF                                   52
     C                   END
     C                   ENDSR
      *_____________________________________________________
      * SETLL, READ AND DELETE RECORDS FROM EDIM2/EDIS/TVINF
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRC           BEGSR
     C     SAEHK         SETLL     EDIM2
     C     SAEHK         READE     EDIM2                                  52
     C                   DOW       *IN52 = *OFF
     C                   IF        M1001 = '830'
     C     MMN           SETLL     TVINF
     C     MMN           READE     TVINF                                  53
     C                   DOW       *IN53 = *OFF
     C                   DELETE    TVINFF
     C     MMN           READE     TVINF                                  53
     C                   END
     C     MSN           CHAIN     EDIS                               53
     C  N53              WRITE     EDISRO
     C  N53              DELETE    EDISR
     C                   WRITE     EDIMRO
     C                   DELETE    EDIMR
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C     SAEHK         READE     EDIM2                                  52
     C                   END
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SAEHK         KLIST
     C                   KFLD                    SEAVD
     C                   KFLD                    SETDN
      *_______________
      * PARAMETER LIST
      *"""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    XAVD
     C     XDT2          PARM                    XDT
      *____________
      * WORK FIELDS
      *""""""""""""
     C     *LIKE         DEFINE    SEAVD         XAVD
     C     *LIKE         DEFINE    XDT2          XDT
      *____________
      * INIT FIELDS
      *""""""""""""
     C                   Z-ADD     XÅ            WÅ
     C                   Z-ADD     XM            WM
     C                   Z-ADD     XD            WD
     C                   IF        XÅ > 50
     C                   MOVEL     '19'          WÅ
     C                   ELSE
     C                   MOVEL     '20'          WÅ
     C                   ENDIF
      *
     C                   ENDSR
      *
