      ***********************************************************
      *** PROGRAM SKAL beregner miljøavgift                   ***
      ***********************************************************
     FKODTS8    IF   E           K DISK
     FSADSD     IF   E           K DISK
     FCUNDMAF   IF A E           K DISK
      *
     C                   EXSR      INIT
      *
      * SJEKK OM KUNDE SKAL HA MILJØ-GEBYR
     C     CUNDMAFK      SETLL     CUNDMAF
     C     CUNDMAFK      READE     CUNDMAF                                33
     C                   DOW       *IN33 = *OFF
     C                   EXSR      SJEKKA
     C                   IF        UAVG <> *BLANKS
     C                   LEAVE
     C                   END
     C     CUNDMAFK      READE     CUNDMAF                                33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
      **********************************************************************
     C     SJEKKA        BEGSR
      **********************************************************************
      *
     C     SADSDK        SETLL     SADSD
     C     SADSDK        READE     SADSD                                  33
     C                   DOW       *IN33 = *OFF
     C                   IF        SDAKTK <> 'I'
     C                   IF        ((SDDTF <= UDT) AND (SDDTT >= UDT))
     C                   MOVE      SDKDAÆ        UAVG
     C                   MOVE      SDKDSÆ        USEK
     C                   MOVE      SDBLSÆ        USATS
     C     S8KEY         CHAIN     KODTS8                             35
     C  N35              MOVE      KS8STY        UKOGRU
     C                   LEAVE
     C                   END
     C                   END
     C     SADSDK        READE     SADSD                                  33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     CUNDMAFK      KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    UKN
     C     SADSDK        KLIST
     C                   KFLD                    UVNT
     C                   KFLD                    CMAKD
     C     S8KEY         KLIST
     C                   KFLD                    SDKDAÆ
     C                   KFLD                    SDKDSÆ
      *
     C     *ENTRY        PLIST
     C                   PARM                    UFIRM             2            INN
     C                   PARM                    UKN               8 0          INN
     C                   PARM                    UVNT              8 0          INN
     C                   PARM                    UDT               8 0          INN
     C                   PARM                    UAVG              2            UT
     C                   PARM                    USEK              3            UT
     C                   PARM                    USATS             7 2          UT
     C                   PARM                    UKOGRU            1            UT
      *
     C                   ENDSR
      *
