     FEDIM      UF   E             DISK
     FTVINF     UF   E           K DISK
     FSADH      IF   E           K DISK
     FSAEH      IF   E           K DISK
     FTRUH      IF   E           K DISK
     FTRIH      IF   E           K DISK
     D                 DS
     D  WP3A                   1      8
     D  WP3N                   1      8  0
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WP1               1            IKKE I SAD ?
     C                   PARM                    WP2               1            T.O.M. DATO
     C                   PARM                    WP3               8            DATO
     C                   MOVE      WP3           WP3A
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     TVFKEY        KLIST
     C                   KFLD                    MMN
     C     SADKEY        KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  LES EDIM                                             SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *
      *
     C                   READ      EDIM                                   51
     C     *IN51         DOWEQ     '0'
     C                   MOVEA     '00'          *IN(52)
      * T.O.M. DATO ?
     C     WP2           IFEQ      'Y'
     C     MDT           ANDLE     WP3N
     C                   MOVE      '1'           *IN53
     C                   ENDIF
      * FINNES POST I SADH, SAEH, TRUH, TRIH
     C     *IN53         IFEQ      '0'
     C     WP1           ANDEQ     'Y'
     C     SADKEY        CHAIN     SADH                               52
     C     *IN52         IFEQ      '1'
     C     SADKEY        CHAIN     SAEH                               52
     C     *IN52         IFEQ      '1'
     C     SADKEY        CHAIN     TRUH                               52
     C     *IN52         IFEQ      '1'
     C     SADKEY        CHAIN     TRIH                               52
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      * FANT IKKE POST I VERKEN SADH ELLER SAEH, SLETT EDIM OG TVINF
     C     *IN52         IFEQ      '1'
     C     *IN53         OREQ      '1'
     C                   EXSR      SRBA
     C                   ENDIF
      *
     C                   READ      EDIM                                   51
     C  N51              ENDDO
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SLETT EDIM OG TVINF                                 SRBA /
      *////////////////////////////////////////////////////////////
     C     SRBA          BEGSR
      *
     C                   MOVE      '0'           *IN54
     C     TVFKEY        SETLL     TVINF
     C     TVFKEY        READE     TVINF                                  54
     C     *IN54         DOWEQ     '0'
      * SLETT POST I TVINF
     C                   DELETE    TVINFF
      *
     C     TVFKEY        READE     TVINF                                  54
     C  N54              ENDDO
      * SLETT TVINM
     C                   DELETE    EDIMR
      *
     C                   ENDSR
