     FHEADF     UF   E           K DISK
     FSADEUF    UF A E           K DISK
     FKODTSIA1  IF   E           K DISK
     FKALENDER2 IF   E           K DISK
     D                 DS
     D  HEGN                   1     15
     D  HEGN15                12     15
     D  HEGNÅr                 1      4
     D  HEGNDag               10     12
     C     *ENTRY        PLIST
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
      * FORELØPIG HARDKODET
     C                   MOVE      'J'           KUNNYE            1
      *
     C     OpdKey        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     JulianKey     KLIST
     C                   KFLD                    KAYEAR
     C                   KFLD                    KADGNR
      *
     C     SIaKey        KLIST
     C                   KFLD                    SIAKN
     C                   KFLD                    SIAAVD
      *
     c     OpdKey        chain     HEADF                              33
     c     *in33         cabeq     '1'           Slutt
      *
      * konvertere HEDTOP via Godsnr godsnr-dato
     c     HEGn15        ifne      ' '
     c     HEGnÅr        andge     '2011'
     c     HEGnÅr        andle     '2099'
     c     HEGnDag       andge     '001'
     c     HEGnDag       andle     '366'
     c                   move      HEGnÅr        KAYEAR
     c                   move      HEGnDag       KADGNR
     c     JulianKey     chain     KALENDER2                          33
     c  n33              move      KADATE        HEDTOP
     c                   endif
     c                   update    HEADFR
      *
      *
     C     KUNNYE        IFEQ      'J'
     c     OpdKey        chain(N)  SADEUF                             33
     c     *in33         cabeq     '0'           Slutt
     C                   ENDIF
      * tilhører saden en gitt saksbehandler utfra knr/avd ??
     c                   move      HEKNK         SIAKN
     c                   move      HEAVD         SIAAVD
     c     SiaKey        chain     KODTSIA1                           33
     c     *in33         ifeq      '1'
     c                   move      *zeros        SIAAVD
     c     SiaKey        chain     KODTSIA1                           33
     c                   endif
     c     *in33         ifeq      '1'
     c                   move      *zeros        SIAKN
     c                   move      HEAVD         SIAAVD
     c     SiaKey        chain     KODTSIA1                           33
     c                   endif
      * fant match - tilordne SAD til saksbehandleren.
     c     *in33         ifeq      '0'
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     c     OpdKey        chain     SADEUF                             33
     c                   Move      ' '           SAIST
     c                   Move      SIASIG        SAISG
     c                   Movel     'AUTO       ' SAIUSE
     c                   Move      WDT           SAIUSD
     c                   Move      WTM           SAIUSK
     c                   clear                   SAIME1
     c                   clear                   SAIME2
     c                   clear                   SAIME3
     c                   clear                   SAIME4
     c                   clear                   SAIME5
     c                   clear                   SAIME6
     c                   clear                   SAIME7
     c                   clear                   SAIME8
     c                   clear                   SAIME9
     c                   clear                   SAIME10
     c   33              write     SADEUFR
     c  N33              update    SADEUFR
     c                   endif
      *
      *
     C     Slutt         Tag
     C                   seton                                        LR
     C                   return
