      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE SAKSBEHANDLER(SIGNATUR)   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FSASGRO    UF A E           K DISK
     FSAS060FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   Z-ADD     XSONE         YSSONE            2 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSF1        SETLL     SASGRO
     C     START1        TAG
     C                   READ      SASGRO                                 94
     C  N94              UPDATE    SASGROR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      SASGRO                                 94
     C  N94              UPDATE    SASGROR
     C  N94              Z-ADD     SASONE        YSSONE
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     08            POSNBR
     C                   Z-ADD     0             WSSONE
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODSF3        SETLL     SASGRO
     C  N94              READ      SASGRO                                 94
     C  N94              UPDATE    SASGROR
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSSONE        COMP      0                                      90
     C   90              MOVE      'TRO0508'     MSGNR
     C  N90KODSFK        CHAIN     SASGRO                             33
     C  N90
     CANN33              DO
     C                   UPDATE    SASGROR
     C                   SETON                                        90
     C                   MOVE      'TRO0509'     MSGNR
     C                   END
     C   90              Z-ADD     08            POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C**>        WSSFNV    COMP *BLANKS                  89
     C**>89N30             MOVE 'SPN0010' MSGNR
     C**>89N30             Z-ADD39        POSNBR
     C**>89                SETON                     30
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSFK        CHAIN     SASGRO                             33
     C                   EXSR      MOVWSF
     C  N33              UPDATE    SASGROR
     C   33              WRITE     SASGROR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C**>        KOSFN7    COMP '*DELETE'                98
     C**>98                GOTO SLHENT
     C                   EXSR      CHGSF
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C**>        KOSFN7    COMP '*DELETE'                98
     C**>98                GOTO SLHENT
     C                   EXSR      DLTSF
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     5             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSF         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   Z-ADD     SASONE        WSSONE
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSFK        CHAIN     SASGRO                             33
     C  N33              DELETE    SASGROR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C**                   SETOF                     40
     C                   EXSR      MOVSFW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   Z-ADD     0             SASONE
     C                   Z-ADD     0             SGMINI
     C                   Z-ADD     0             SGNRAT
     C                   Z-ADD     0             SGQ045
     C                   Z-ADD     0             SGQ100
     C                   Z-ADD     0             SGQ500
     C                   Z-ADD     0             SPMINI
     C                   Z-ADD     0             SPNRAT
     C                   Z-ADD     0             SPQ045
     C                   Z-ADD     0             SPQ100
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   Z-ADD     0             WSSONE
     C                   Z-ADD     0             WGMINI
     C                   Z-ADD     0             WGNRAT
     C                   Z-ADD     0             WGQ045
     C                   Z-ADD     0             WGQ100
     C                   Z-ADD     0             WGQ500
     C                   Z-ADD     0             WPMINI
     C                   Z-ADD     0             WPNRAT
     C                   Z-ADD     0             WPQ045
     C                   Z-ADD     0             WPQ100
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   Z-ADD     SASONE        WSSONE
     C                   Z-ADD     SGMINI        WGMINI
     C                   Z-ADD     SGNRAT        WGNRAT
     C                   Z-ADD     SGQ045        WGQ045
     C                   Z-ADD     SGQ100        WGQ100
     C                   Z-ADD     SGQ500        WGQ500
     C                   Z-ADD     SPMINI        WPMINI
     C                   Z-ADD     SPNRAT        WPNRAT
     C                   Z-ADD     SPQ045        WPQ045
     C                   Z-ADD     SPQ100        WPQ100
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C*  33                DO
     C                   Z-ADD     WSSONE        SASONE
     C                   Z-ADD     WGMINI        SGMINI
     C                   Z-ADD     WGNRAT        SGNRAT
     C                   Z-ADD     WGQ045        SGQ045
     C                   Z-ADD     WGQ100        SGQ100
     C                   Z-ADD     WGQ500        SGQ500
     C                   Z-ADD     WPMINI        SPMINI
     C                   Z-ADD     WPNRAT        SPNRAT
     C                   Z-ADD     WPQ045        SPQ045
     C                   Z-ADD     WPQ100        SPQ100
     C*                    END
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSFK        KLIST
     C                   KFLD                    WSSONE
     C     KODSF1        KLIST
     C                   KFLD                    XSONE
     C     KODSF2        KLIST
     C                   KFLD                    SASONE
     C     KODSF3        KLIST
     C                   KFLD                    YSSONE
     C*
     C                   ENDSR
     C*
