      *
      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE FLYFRAKTRATER              ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01-26                             ***
      *** LEDIGE INDIKATORER 27-29 31-99                       ***
      ************************************************************
      *
     FNOFLYSPJB UF A E           K DISK
     FSAS010FM  CF   E             WORKSTN
     C*
     C*
     C                   EXSR      HENT
     C*
     c     start         tag
     C                   EXFMT     BILDE01
     c   12              goto      slutt
     c   03              goto      slutt
     c   05              exsr      oppdat
     c                   goto      start
     C*
     c     slutt         tag
     C                   SETON                                        LR
     C                   RETURN
     C*
     C**********************************************************
     C     HENT          BEGSR
     C**********************************************************
     C                   MOVE      '11'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR11
     C  N33              MOVE      SOPRIS        KG11
     C                   MOVE      '12'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR12
     C  N33              MOVE      SOPRIS        KG12
     C                   MOVE      '13'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR13
     C  N33              MOVE      SOPRIS        KG13
     C                   MOVE      '14'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR14
     C  N33              MOVE      SOPRIS        KG14
     C                   MOVE      '15'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR15
     C  N33              MOVE      SOPRIS        KG15
     C                   MOVE      '21'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR21
     C  N33              MOVE      SOPRIS        KG21
     C                   MOVE      '22'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR22
     C  N33              MOVE      SOPRIS        KG22
     C                   MOVE      '23'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR23
     C  N33              MOVE      SOPRIS        KG23
     C                   MOVE      '24'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR24
     C  N33              MOVE      SOPRIS        KG24
     C                   MOVE      '25'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR25
     C  N33              MOVE      SOPRIS        KG25
     C                   MOVE      '31'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR31
     C  N33              MOVE      SOPRIS        KG31
     C                   MOVE      '32'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR32
     C  N33              MOVE      SOPRIS        KG32
     C                   MOVE      '33'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR33
     C  N33              MOVE      SOPRIS        KG33
     C                   MOVE      '34'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR34
     C  N33              MOVE      SOPRIS        KG34
     C                   MOVE      '35'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR35
     C  N33              MOVE      SOPRIS        KG35
     C                   MOVE      '41'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR41
     C  N33              MOVE      SOPRIS        KG41
     C                   MOVE      '42'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR42
     C  N33              MOVE      SOPRIS        KG42
     C                   MOVE      '43'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR43
     C  N33              MOVE      SOPRIS        KG43
     C                   MOVE      '44'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR44
     C  N33              MOVE      SOPRIS        KG44
     C                   MOVE      '45'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR45
     C  N33              MOVE      SOPRIS        KG45
     C                   MOVE      '51'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR51
     C  N33              MOVE      SOPRIS        KG51
     C                   MOVE      '52'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR52
     C  N33              MOVE      SOPRIS        KG52
     C                   MOVE      '53'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR53
     C  N33              MOVE      SOPRIS        KG53
     C                   MOVE      '54'          KEY               2
     C     KEY           CHAIN(N)  NOFLYSPJB                          33
     C  N33              MOVE      SOGRUN        GR54
     C  N33              MOVE      SOPRIS        KG54
     c                   endsr
     C*
     C**********************************************************
     C     oppdat        BEGSR
     C**********************************************************
     C                   MOVE      '11'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR11          SOGRUN
     C                   MOVE      KG11          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '12'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR12          SOGRUN
     C                   MOVE      KG12          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '13'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR13          SOGRUN
     C                   MOVE      KG13          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '14'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR14          SOGRUN
     C                   MOVE      KG14          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '15'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR15          SOGRUN
     C                   MOVE      KG15          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '21'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR21          SOGRUN
     C                   MOVE      KG21          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '22'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR22          SOGRUN
     C                   MOVE      KG22          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '23'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR23          SOGRUN
     C                   MOVE      KG23          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '24'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR24          SOGRUN
     C                   MOVE      KG24          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '25'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR25          SOGRUN
     C                   MOVE      KG25          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '31'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR31          SOGRUN
     C                   MOVE      KG31          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '32'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR32          SOGRUN
     C                   MOVE      KG32          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '33'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR33          SOGRUN
     C                   MOVE      KG33          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '34'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR34          SOGRUN
     C                   MOVE      KG34          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '35'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR35          SOGRUN
     C                   MOVE      KG35          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '41'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR41          SOGRUN
     C                   MOVE      KG41          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '42'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR42          SOGRUN
     C                   MOVE      KG42          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '43'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR43          SOGRUN
     C                   MOVE      KG43          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '44'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR44          SOGRUN
     C                   MOVE      KG44          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '45'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR45          SOGRUN
     C                   MOVE      KG45          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '51'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR51          SOGRUN
     C                   MOVE      KG51          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '52'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR52          SOGRUN
     C                   MOVE      KG52          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '53'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR53          SOGRUN
     C                   MOVE      KG53          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     C                   MOVE      '54'          SOTAB
     C     SOTAB         CHAIN     NOFLYSPJB                          33
     C                   MOVE      GR54          SOGRUN
     C                   MOVE      KG54          SOPRIS
     c  N33              update    NOFLYSPJBR
     c   33              write     NOFLYSPJBR
     c                   endsr
