     F********************************************************************
     F* genererer flyfrakt innland for SAS og Bråthens
     F********************************************************************
N01  Fnoflypj   IF a E           k DISK
     Fsted2d    iF a E           k disk
     Fnofly     if   e           k disk
     Inoflyr
     I              st2kod                      innflp
     c*
     c*
     c  n33              exsr      oppdat
     c                   seton                                        lr
     c                   return
     c*
     c*
     c*******************************************************************
     c     oppdat        begsr
     c*******************************************************************
     c* skjekker om flyplassene er opprettet
     c*
     c     keyste        klist
     c                   kfld                    st2lk
     c                   kfld                    st2kod
     c     *loval        setll     nofly
     c     *in(33)       doweq     '0'
     c                   read      nofly                                  33
     c     *in(33)       ifeq      '0'
     c                   movel     innflp        st2kod
     c     keyste        chain     sted2d                             34
     c   34              write     sted2r
     c                   move      innflp        flkode
     c     flkode        chain     noflypj                            35
     c   35              write     noflypjr
     c                   endif
     c                   enddo
     c                   endsr
