     Fflypriso  ip   e           k disk
     Fflypris1  if   e           k disk
     F                                     RENAME(flyprior:xxprior)
     Fsted2d    if a e           k disk
     Fairld     uf   e           k disk
     c*
     c* initiering kun 1 gang
     c*
     c  n44              exsr      init
     c*
     c* sletter prisrecords
     c                   exsr      detsr
     c*
     c*
     c*******************************************************************
     c     detsr         begsr
     c*******************************************************************
     c     keydet        klist
     c                   kfld                    airlin
     c                   kfld                    airpfr
     c                   kfld                    airpto
     c                   kfld                    airccp
     c                   z-add     000           airlin
     c                   move      fofrfl        airpfr
     c                   move      fotifl        airpto
     c                   move      ' '           airccp
     c*
     c* OOO slettes
     c*
     c                   setoff                                       33
     c     keydet        setll     airld
     c     *in(33)       doweq     '0'
     c     keydet        reade     airld                                  33
     c  n33              delete    airldr
     c                   enddo
     c*
     c                   endsr
     c*
     c*******************************************************************
     c     init          begsr
     c*******************************************************************
     c* skjekker om flyplassene er opprettet
     c*
     c     keyste        klist
     c                   kfld                    st2lk
     c                   kfld                    st2kod
     c     *loval        setll     flypris1
     c     *in(44)       doweq     '0'
     c                   read      flypris1                               44
     c     *in(44)       ifeq      '0'
     c                   movel     fotifl        st2kod
     c                   movel     fotilk        st2lk
     c     keyste        chain     sted2d                             45
     c   45              write     sted2r
     c                   endif
     c                   enddo
     c                   endsr
