     Fflyprisp  IP   E             DISK
     Fflypriso  O  a E             DISK
     Fnoflypj   if   E           k DISK
     D                 DS
     D  fpvekt                 1      6
     D  fovekt                 1      5  0
     c*
     c* Plukk ut alle med flyselskap blank
     c* og gjør om alfafelter til numeriske
     c*
     c     fpflys        ifeq      '   '
     c     fpfrfl        chain     noflypj                            34
     c     *in34         ifeq      '0'
     c     fpvekt        ifeq      '00000K'
     c                   movel     fprate        wogrn             9 2
     c                   endif
     c                   movel     fpfrfl        fofrfl
     c                   movel     fpfrfl        fofrfl
     c                   movel     fpfrlk        fofrlk
     c                   movel     fptifl        fotifl
     c                   movel     fptilk        fotilk
     c                   z-add     wogrn         fogrn
     c                   movel     fpvalk        fovalk
     c                   movel     fprate        forate
     c                   write     flyprior
     c                   endif
     c                   endif
