      * FORUTSETNING - EXCEL FOR terminaler - via CSV til flatfil  SCHTERM
      * KOLONNER:
      *
      * post_nr;post_sted_nv;dist_term_id
      * 0001;OSLO;AL
      *
     FSCHTERM   IP   F 1024        DISK
     FSCTERM    O  A E             DISK
     D A               S              1    DIM(79)
     D B               S              1    DIM(18)
      *________________________
      * DS for decimal handling
      *""""""""""""""""""""""""
     D                 DS
     D  ZDEC                   1      7  6
     D  ZDEC6                  2      7
     D  ZHEL                  11     22  0
     D                 DS
     D  data                   1   1024
     D  da                     1   1024
     D                                     DIM(1024)
     D                 DS
     D  felta                  1     60
     D  fa                     1     60
     D                                     DIM(60)
      * ARRAY MED INTIL 600 KOLONNER A 100 TEGN etter dekoding.
     D                 DS
     D  dta                    1  60000
     D                                     DIM(600)
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D                 DS
     D  Test                   1      5
     D  Test1_3                1      3
     D  Test4_5                4      5
     D  Test5_5                5      5
     D  Test1_4                1      4
     D                 DS
     D  ADR2                   1     30
     D  ADR2_1_4               1      4
     D                 DS
     D  WTIME                  1     14  0
     D  WTID                   1      6  0
     D  WDD                    7      8  0
     D  WMM                    9     10  0
     D  WÅÅ                   11     14  0
     D                 DS
     D WSDTÅÅ                  1      4  0
     D WSDTMM                  5      6  0
     D WSDTDD                  7      8  0
     D WSDT                    1      8  0
      *
     ISCHTERM   NC  01
     I                                  1    4  Data1_4
     I                                  1 1024  Data
      * Init kun i første syklus
     C     INI           IFEQ      ' '
     C                   EXSR      INIT
     C                   MOVE      'X'           INI               1
     C                   END
      *
      * INITIERER VARIABLE
      *
     c                   z-add     1             fra               3 0
     c                   z-add     1             til               3 0
     c                   z-add     0             DN                3 0
     c                   clear                   dta
     C     DATA1_4       IFeq      'post'                                       SKIPP OVERSKR.LINJE
     C                   GOTO      NextRcd
     C                   END
      *
      * leser til neste skilletegn ';'
      *
     c     til           dowlt     900
     C     da(til)       ifne      ';'
     c                   add       1             til
     c                   else
      *
      * fra og til er funnet
      *
     c                   exsr      dekod
     c                   add       1             til
     c                   z-add     til           fra
     c                   endif
     c                   enddo
      *
      * siste post
      *
     c     fra           add       58            til
     c                   exsr      dekod
      * DETALJBEHANDLING
      *
     c**** AntPoster     cabgt     10            NextRcd
     c                   exsr      DETSR
     c                   add       1             AntPoster         5 0
      *
     c     NextRcd       tag
      *
     c***************************************************************
     c     dekod         begsr
     c***************************************************************
      *
      * dekoder innlest post
      *
     c     til           sub       fra           antp              3 0
     c     antp          ifgt      0
     c                   exsr      dokoda
     c                   add       1             dn
     c                   movel     felta         dta(dn)
     C                   ELSE
     c                   add       1             dn
     c                   end
     c                   endsr
     c***************************************************************
     c     DOKODA        begsr
     c***************************************************************
     c*    dekoder  TIL FELTA
     c*
     c                   move      *blanks       felta
     c                   z-add     fra           nr                3 0
     c                   z-add     1             n2                3 0
     c                   do        antp
     c                   move      da(nr)        fa(n2)
     c                   add       1             n2
     c                   add       1             nr
     c                   enddo
     c                   endsr
     c***************************************************************
     c     DETSR         begsr
     c***************************************************************
      *
     c                   clear                   SCTERMR
     c                   movel     dta(1)        SCPNR
     c                   movel     dta(2)        SCSTED
     c                   movel     dta(3)        SCTER
      *
     C                   WRITE     SCTERMR
     c     Utdet         endsr
     c*****************************************
     c     kompress      begsr
     c*****************************************
     C                   MOVE      *blanks       B
     C                   Z-ADD     1             AX                2 0
     C                   Z-ADD     1             BX                2 0
      * Get Integer
     C     1             do        15            AX
     C     A(AX)         IFGE      '0'
     C     A(AX)         andle     '9'
     C                   MOVE      A(AX)         B(BX)
     C                   ADD       1             BX
     C                   END
     C                   ENDDO
     c                   endsr
     c*****************************************
     c     getnum        begsr
     c*****************************************
     C                   MOVE      *ZEROS        ZHEL
     C                   MOVE      *ZEROS        ZDEC
     C                   MOVE      *ZEROS        B
     C                   Z-ADD     1             AX                2 0
     C                   Z-ADD     1             BX                2 0
      * Get Integer
     C     A(AX)         DOWGE     '0'
     C     ZHEL          MULT      10            ZHEL
     C                   MOVE      A(AX)         ZHEL
     C                   ADD       1             AX
     C                   ENDDO
      * Decimal point ?
     C     A(AX)         IFEQ      '.'
     C     A(AX)         OREQ      ','
     C                   ADD       1             AX
     C     A(AX)         DOWGE     '0'
     C                   MOVE      A(AX)         B(BX)
     C                   ADD       1             AX
     C                   ADD       1             BX
     C                   ENDDO
     C                   MOVEA     B             ZDEC6
     C                   ENDIF
      * Concatenate
     C                   Z-ADD     ZHEL          ZNUM             18 6
     C                   ADD       ZDEC          ZNUM
     C                   ENDSR
     c
     c*****************************************
     c     INIT          begsr
     c*****************************************
     c                   Z-add     1             VAnr              5 0
     C                   ENDSR
