      * PROGRAM FOR Å MERKE OPPDRAG UTLEVERT (SLETT FRA LAGERLISTE)
      * SIDEN EN MED STOR SANSYNLIGHET SKAL MERKE OPPDRAG FRAM
      * TIL EN NOKSÅ FERSK DATO-(BEGYNNE LAGEROPPFØLGING F.O.M......)
      * ER DET RAKERE(ENKLERE) Å LESE HELE HEADF INP.PRIMARY/UNKEYED
      * ENN Å GÅ PÅ LOGISK FIL PÅ DATO..
     FHEADF     UP   E             DISK
SV5  I*           DS
SV5  I*                                       1   40HEDTRÅ
SV5  I*                                       5   60HEDTRM
SV5  I*                                       7   80HEDTRD
SV5  I*                                       1   6 REGDAT
     C     *ENTRY        PLIST
     C                   PARM                    TILDAT            6
NV5  C                   MOVE      TILDAT        TILDT8            8 0
NV5  C     TILDAT        IFGT      '500000'
NV5  C                   MOVEL     '19'          TILDT8
NV5  C                   ELSE
NV5  C                   MOVEL     '20'          TILDT8
NV5  C                   END
SV5  C*          REGDAT    IFLT TILDAT
NV5   * JEG ANTTAR AT OPPDRAGSDATO SKAL BRUKES HER.
NV5  C     HEDTOP        IFLT      TILDT8
     C     HESGM         ANDEQ     *BLANKS
     C* IKKE MØNSTEROPPDRAG...
     C     HEOPD         ANDGT     0
     C                   MOVE      'X'           HESGM
     C                   UPDATE    HEADFR
     C                   END
