      * PROGRAM FOR Å MERKE OPPDRAG FOR STOPPET
     FSLPRO2FM  CF   E             WORKSTN
     FPROSL01   UF   E           K DISK
     FPROSLSY   UF   E           K DISK
     F                                     RENAME(PROSR:PROSSY)
     FFIRM      IF   E           K DISK
     D                 DS
     D  ZDATO                  1      6  0
     D  ZDAG                   1      2  0
     D  ZMND                   3      4  0
     D  ZÅR                    5      6  0
     D                 DS
     D  UDATO                  1      8  0
     D  UÅR                    1      4  0
     D  UMND                   5      6  0
     D  UDAG                   7      8  0
     D                 DS
     D  PDATO                  1      8  0
     D  STDAAR                 1      4  0
     D  STDMND                 5      6  0
     D  STDDAG                 7      8  0
SV5  D*           DS
SV5  D*                                       1  140WTIME
SV5  D*                                       1   60WTID
SV5  D*                                       7  140WDAT
SV5  D*                                       7   80WDD
SV5  D*                                       9  100WMM
SV5  D*                                      11  140WÅÅ
     D                UDS
     D  FIFIRM                 1      2
     C*
     C     *ENTRY        PLIST
     C*** UIN01 = '1' -> INGEN TING Å OPPDATERE
     C                   PARM                    UIN01             1
     C                   MOVE      '0'           UIN01
     C                   MOVE      *ZEROS        ZDATO
     C                   MOVE      *ZEROS        LOWÅR             4 0
     C                   MOVE      *ZEROS        LOWMND            2 0
     C                   MOVE      *ZEROS        LOWDAG            2 0
SV5  C* HENTE SYSTEMDATO OG TID
SV5  C*                    TIME           WTIME
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   98
     C     PROK01        KLIST                                                  FILINFO
     C                   KFLD                    FIFIRM                         FIRMA
     C                   KFLD                    ZPROSF                         PROSJEKT
     C     PROKSY        KLIST                                                  FILINFO
     C                   KFLD                    FIFIRM                         FIRMA
     C                   KFLD                    LOWÅR
     C                   KFLD                    LOWMND
     C                   KFLD                    LOWDAG
     C*
     C     START         TAG
     C                   EXFMT     SLPROSA
     C                   SETOFF                                       313233
     C                   SETOFF                                       34
     C*
     C   03              GOTO      SLUTT
     C   12              GOTO      SLUTT
     C*
     C* INGEN BEGREP UTFYLT?
     C     ZPROSF        IFEQ      *ZEROS
     C     ZPROST        ANDEQ     *ZEROS
     C     ZDATO         ANDEQ     *ZEROS
     C                   SETON                                        34
     C                   GOTO      START
     C                   END
     C*
     C* BEGGE BEGREP UTFYLT?
     C     ZPROSF        IFNE      *ZEROS
     C     ZDATO         ANDNE     *ZEROS
     C                   SETON                                        34
     C                   GOTO      START
     C                   END
     C*
     C* DET ER FRA TIL SOM ER/GITT
     C*
     C*
     C     ZDATO         IFEQ      *ZEROS
     C* FRA IKKE UTFYLT NÅR TIL ER DET
     C     ZPROSF        IFEQ      *ZEROS
     C     ZPROST        ANDNE     *ZEROS
     C                   SETON                                        31
     C                   GOTO      START
     C                   END
     C*
     C* FRA ER STØRRE ENN TIL (NÅR FRA TIL/ER UTFYLT)
     C     ZPROSF        IFNE      *ZEROS
     C     ZPROSF        ANDGT     ZPROST
     C                   SETON                                        32
     C                   GOTO      START
     C                   END
     C*
     C* INGEN FEIL FRA TIL/PROSJNR - MERK SERIE OG GÅ TIL NY INNTASTING
     C*
     C                   EXSR      MERK01
     C                   GOTO      START
     C*
     C* DET ER DATO SOM ER GITT
     C*
     C                   ELSE
     C* DATO ER PÅ FEIL FORMAT
     C     ZDAG          IFGT      31
     C     ZMND          ORGT      12
     C                   SETON                                        33
     C                   GOTO      START
     C                   END
     C*
     C*
     C* INGEN FEIL TIL OG MED DATO - SETT PARAMETER FOR OPPDAT
NV5  C     ZDATO         IFEQ      0
NV5  C                   MOVE      *ZEROS        UDATO
NV5  C                   ELSE
     C                   MOVE      ZDAG          UDAG
     C                   MOVE      ZMND          UMND
SV5  C*                    Z-ADDWÅÅ       UÅR
     C                   MOVE      ZÅR           UÅR
NV5  C     ZÅR           IFGT      50
NV5  C                   MOVEL     '19'          UÅR
NV5  C                   ELSE
NV5  C                   MOVEL     '20'          UÅR
NV5  C                   END
NV5  C                   END
     C                   EXSR      MERKSY
     C                   GOTO      START
     C                   END
     C*
     C     SLUTT         TAG
     C     ZANTTO        IFNE      *ZEROS
     C                   MOVE      '1'           UIN01
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     MERK01        BEGSR
     C***********************************************
     C                   SETOFF                                         9091
     C                   SETON                                            50    *VIS ANT.MRK
     C                   MOVE      *ZEROS        ZANT
     C     PROK01        SETLL     PROSL01
     C     STMERK        TAG
     C                   READ      PROSL01                                90
     C  N90FIRMA         COMP      FIFIRM                             9191
     C  N90
     CANN91PROSNR        COMP      ZPROST                             91
     C  N90
     CANN91AKTKOD        IFEQ      'A'
     C                   ADD       1             ZANT
     C                   ADD       1             ZANTTO
     C                   MOVE      UYEAR         SLDAAR
     C                   MOVE      UMONTH        SLDMND
     C                   MOVE      UDAY          SLDDAG
     C                   MOVE      'J'           STOPP
     C                   SETON                                            51    *IKKE AVBRYT
     C*
     C                   END
     C  N90              UPDATE    PROSR
     C  N90
     CANN91              GOTO      STMERK
     C                   MOVE      *ZEROS        ZPROSF
     C                   MOVE      *ZEROS        ZPROST
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     MERKSY        BEGSR
     C***********************************************
     C                   SETOFF                                         9091
     C                   SETON                                            50    *VIS.ANT.MRK
     C                   MOVE      *ZEROS        ZANT
     C     PROKSY        SETLL     PROSLSY
     C     STMER2        TAG
     C                   READ      PROSLSY                                90
     C  N90FIRMA         COMP      FIFIRM                             9191
     C  N90
     CANN91PDATO         COMP      UDATO                              91
     C  N90
     CANN91AKTKOD        IFEQ      'A'
     C                   ADD       1             ZANT
     C                   ADD       1             ZANTTO
     C                   MOVE      UYEAR         SLDAAR
     C                   MOVE      UMONTH        SLDMND
     C                   MOVE      UDAY          SLDDAG
     C                   MOVE      'J'           STOPP
     C                   SETON                                            51    *IKKE AVBRYT
     C                   END
     C  N90              UPDATE    PROSSY
     C  N90
     CANN91              GOTO      STMER2
     C                   MOVE      *ZEROS        ZDATO
     C*
     C                   ENDSR
     C*
