     F*MPFIL    O  A F   80        DISK
     FTMP196    O  A F  196        DISK
     C*
     C                   EXCEPT    NY
     C                   SETON                                        LR
     C                   RETURN
     OTMP196    EADD         NY
     O                                              '<HTML>'
     O          EADD         NY
     O                                              '<style type="text/css">'
     O          EADD         NY
     O                                              'body {margin-left: 0mm}'
     O          EADD         NY
     O                                              '</style>'
     O          EADD         NY
     O                                              '<body OnLoad = "Print()">'
     O          EADD         NY
     O                                              '<pre>'
