     F*MPFIL    O  A F   80        DISK
     FTMP196    O  A F  196        DISK
     C*
     C                   EXCEPT    NY
     C                   SETON                                        LR
     C                   RETURN
     OTMP196    EADD         NY
     O                                              '</pre></body>'
     O          EADD         NY
     O                                              '<Script language="java'
     O                                              'script">'
     O          EADD         NY
     O                                              'function Print() {'
     O          EADD         NY
     O                                              'window.print();'
     O          EADD         NY
     O                                              'self.setTimeout("'
     O                                              'window.close()",1500);'
     O          EADD         NY
     O                                              '}</Script>'
     O          EADD         NY
     O                                              '</HTML>'
