********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 LES POST I WRKCGI MED KEY
********************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT aktive ordre
      **************************************************************
     FWRKCGI    UF   E           K DISK
     FSS002PF   O    E             PRINTER OFLIND(*IN27)
     D WSuser          s             10
     D KEY2            s             30
     D WSKDB           s              5
     D WSNAB           s             30
     D WSSTD           s              5
     D SEND            s              1
     D WSNEDDT         s             10
     D Mail1           s             50
     D Mail2           s             50
     D Mail3           s             50
     D Mail4           s             50
     D Mail5           s             50
     D ANTPO           s              5  0
     D TOTCLI          s              5  0
     D TOTWT           s              7  1
     D                 DS
     D WSSHCO                  1    540
     D WSSHTNA                 1     30
     D WSSHTA1                31     60
     D WSSHTA2                61     90
     D WSSHTA3                91    120
     D WSSHTA4               121    150
     D WSSHTA5               151    180
     D WSCOMM1               181    240
     D WSCOMM2               241    300
     D WSCOMM3               301    360
     D WSCOMM4               361    420
     D WSCOMM5               421    480
     D WSCOMM6               481    540
     D WSdummy               541    541
     D                 DS
     D  Wkey2                  1     30
     D  Wkey2_10               1     10
     D                 DS
     D  DataDs                 1    220
     D  POCONO                 1     20
     D  ORLC                  25     29
     D  ORSNM                 31     60
     D  ORDTL                 63     70  0
     D  ORSTAT                72     91
     D  ORCLI                103    107  0
     D  ORWT                 111    117  1
      *
     C                   EXSR      INIT
      *
     C                   WRITE     SS002PA
      *
      * Vis liste over registrete leveringer
     C                   Move      *zeros        AntPO
     C                   Move      *zeros        TOTCLI
     C                   Move      *zeros        TOTWT
     c     WCgiKey       setLL     WRKCGI
S01  c*                  Read      WRKCGI                                 35
N01  C     WINTEG        READE     WRKCGI                                 35
     C  N35Wkey2_10      comp      XBCDLC                             3535
     c     *IN35         doweq     '0'
     c                   delete    WRKCGIR
     C                   movel     WDATA         DataDs
     C   27              WRITE     SS002PA
     C   27              MOVE      '0'           *IN27
     C                   WRITE     SS002PB
     C                   Add       1             AntPO
     C                   Add       ORCLI         TOTCLI
     C                   Add       ORWT          TOTWT
S01  c*                  Read      WRKCGI                                 35
N01  C     WINTEG        READE     WRKCGI                                 35
     C  N35Wkey2_10      comp      XBCDLC                             3535
     c                   end
      *
     C                   WRITE     SS002PC
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    KEY2
     C                   PARM                    WSuser
     C                   PARM                    WSKDB
     C                   PARM                    WSNAB
     C                   PARM                    WSSTD
     C                   PARM                    Mail1
     C                   PARM                    Mail2
     C                   PARM                    Mail3
     C                   PARM                    Mail4
     C                   PARM                    Mail5
     C                   PARM                    WSNEDDT
     C                   PARM                    UUSHCO          540
     C                   PARM                    WSEND             1
N01  C                   PARM                    WINT              6
      *
     C                   MOVE      wsend         dummy             1
     C                   MOVE      UUSHCO        WSSHCO
N01  C                   MOVE      WINT          WINTEG
      *
     C     WCgiKey       klist
     C                   kfld                    WINTEG
     C                   kfld                    WKEY2
S01  C*                  z-sub     99999         WINTEG
     C                   move      KEY2          WKEY2
     C                   movel     KEY2          XBCDLC           10
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTD               6
     C                   MOVEL     WTD           XTID4
      *
     C                   ENDSR
      *
