      *********************************************************************
      * Program for print(reprint) av alle merkelapper for gitt trip(oppdrag
      *         FRA HUB. Skaper er dummy fraktbrev/tildeler nye EAN-nr
      *         om det ikke finnes. Kaller vanlig prog for merelappsutskr.
      *         Når utskrift er skapt som fil i IFS skrives en dummu HTML
      *         som ved laod replacer seg selv med denne
      *********************************************************************
      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/SS135 MODULE(*LIBL/SS135 *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Prototype defintions and standard system API error structure
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      *--------------------------------------------------------------------
      * Variables common to CGI programs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D WSUSER          S             10
     D UsrSpcName      s             10
     D CURTUR          S             11
     D CURTURN         S             11  0
     D UNIK            S              7
     D UNIK6           S              6  0
     D IFSFIL          S             50
     D LabelTyp        S              1
      * Number of records matching search criteria
      *
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================******
      * MAIN PROCESS LINE
      *=====================================================================******
      * Parse input
     C                   exsr      Parse
      *
     C                   EXSR      INIT
      * Set output skeleton html member name
     C                   exsr      SetSkl
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      *-dummy html for å få kjørt prog                                      ******
      * "bytter ut seg selv" med (Html)fil i IFS umiddelbart                ******
     c     LabelTyp      ifeq      'Z'
     C                   eval      IFSFil = 'ZBARC'+TUR+'.html'
     c                   else
     C                   eval      IFSFil = 'ELTRON'+TUR+'.txt'
     c                   end
     C                   callp     updhtmlvar('IFSFIL':IFSFIL)
     C                   callp     wrtsection('top')
      *------------------                                                   ******
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
     C*
     C                   close     BRIDF
     C                   eval      *inlr = *on
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   EVAL      CURTUR  = zhbgetvar('CURTUR')
     C                   eval      CURTURN = c2n2(CURTUR)
     C                   eval      LabelTyp = zhbgetvar('LabelTyp')
      *
     C                   endsr
      *=====================================================================******
      * Set html output skeleton member before its read into memory
      *=====================================================================******
     C     SetSkl        begsr
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC'
     C                   eval      Mbr = 'SS115'
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     c                   eval      Unik = UsrSpcName
     c     Unik          ifeq      *blanks
     c                   eval      Unik6    = random(1:999999)
     c                   move      Unik6         Unik
     c                   movel     'W'           Unik
     c                   end
      *  Kall prog for å generere html
     C                   MOVE      CURTURN       TUR              11
     C                   MOVE      'Z'           ULABTYP           1
     C                   MOVE      'W'           UFROM             1
     C                   MOVE      'J'           UKOPI             1
     C                   MOVEL     UNIK          UPRT             10
     C                   call      'GSS028R'
     c                   parm                    BIFIRM
     c                   parm                    TUR
     c                   parm                    ULABTYP
     c                   parm                    UPRT
     c                   parm                    UFROM
     c                   parm                    UKOPI
      *
     C                   endsr
