      *********************************************************************
      *
CRTPG+*   CRTPGM SYSPED/SS156 MODULE(*LIBL/SS156 *LIBL/SS153A
CRTPGM*         *LIBL/CHECKUSR *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     UF   E           K DISK    USROPN
     FGSSORF    UF   E           K DISK    USROPN
     FGSSPOF    UF   E           K DISK    USROPN
     FGSSRFF    UF   E           K DISK    USROPN
     FGSSLGF    O    E             DISK    USROPN
      *--------------------------------------------------------------------
      * Prototype defintions and standard system API error structure
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      *--------------------------------------------------------------------
      * Variables common to CGI programs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D lng             s              2
     D BckGnd          s             10
     D UsrSpcName      s             10
     D WSUSER          S             10
     D WSNA            S             30
     D WSCONO          s             20
     D WSONO           s              7
     D W2ONO           s              7  0
     D WKEY            S            256
     D WSPO            s             20
     D WSSNM           s             30
     D WSACC           s             35
     D WSDTL           s             10
     D WSCLI           s              5
     D W2CLI           s              5  0
     D WSWT            s              8
     D W2WT            s              7  1
     D WSVOL           s              6
     D W2VOL           s              5  2
     D WSLM            s              5
     D W2LM            s              4  2
     D WSSAL           s             35
     D WSAREA          s              2
     D WSTYM           s              7
     D WSDTWL          s             10
     D WS155           s             15  5
     D lstbrd          s              1
     D FMELDNR         S              2
     D FEILMELDING     S             60
     D FEIL01          C                   CONST('P.O.no. can not be blank.')
     D FEIL02          C                   CONST('Vendor is not valid.')
     D FEIL03          C                   CONST('Acc. no. can not be blank.')
     D FEIL04          C                   CONST('Ready date is not valid.')
     D FEIL05          C                   CONST('Order ref. can not be blank.')
     D FEIL06          C                   CONST('Area can not be blank.')
     D FEIL07          C                   CONST('Tr. year/week is not valid.')
     D FEIL08          C                   CONST('Need date is not valid.')
     D PGM             C                   CONST('SYSPED/CHECKUSR')
     D PGM2            C                   CONST('*LIBL/SS153A')
     D XXTXT01         C                   CONST('Vendor is changed at')
     D XXTXT02         C                   CONST('Del. date is changed at')
     D XXTXT03         C                   CONST('No. of colli is changed at')
     D XXTXT04         C                   CONST('Weight is changed at')
     D XXTXT05         C                   CONST('Volume is changed at')
     D XXTXT06         C                   CONST('Area code is changed at')
     D XXTXT07         C                   CONST('Trans.week is changed at')
     D XXTXT08         C                   CONST('Need date is changed at')
     D XXTXT09         C                   CONST('P.O.no is changed at')
     D XXTXT10         C                   CONST('ACC no. is changed at')
     D XXTXT11         C                   CONST('Sales no. is changed at')
     D XXTXT12         C                   CONST('Load.metre is changed at')
      *
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
     D                 DS
     D W2DTL                   1      8  0
     D W2DTL≈                  1      4  0
     D W2DTLM                  5      6  0
     D W2DTLD                  7      8  0
     D                 DS
     D ORDTL                   1      8  0
     D ORDTL≈                  1      4  0
     D ORDTLM                  5      6  0
     D ORDTLD                  7      8  0
     D                 DS
     D W2DTWL                  1      8  0
     D W2DTWL≈                 1      4  0
     D W2DTWLM                 5      6  0
     D W2DTWLD                 7      8  0
     D                 DS
     D ORDTWL                  1      8  0
     D ORDTWL≈                 1      4  0
     D ORDTWLM                 5      6  0
     D ORDTWLD                 7      8  0
     D                 DS
     D XXDT≈≈                  1      4  0
     D XXSKILL1                5      5
     D XXDTMM                  6      7  0
     D XXSKILL2                8      8
     D XXDTDD                  9     10  0
     D XXDT                    1     10
     D                 DS
     D W2TYM                   1      6  0
     D W2TYM≈                  1      4  0
     D W2TYMU                  5      6  0
     D                 DS
     D ORFT4                   1     30
     D ORAREA                  1      2
     D ORAAR                   4      7
     D ORUKE                   8      9
     D ORAARUKE                4      9
     D ORLMA                  11     14
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================******
      * MAIN PROCESS LINE
      *=====================================================================******
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input
     C                   exsr      Parse
      *
     C                   EXSR      INIT
      *
     C                   EXSR      TESTINP
     C                   IF        FMELDNR = *BLANKS
     C                   EXSR      OPDDATA
     C                   END
      *
     C                   CALLB     PGM2
     C                   PARM                    LNG
     C                   PARM                    BCKGND
     C                   PARM                    WSUSER
     C                   PARM                    UsrSpcName
     C                   PARM                    WSNA
     C                   PARM                    WKEY
     C                   PARM                    WSONO
     C                   PARM                    WSCONO
     C                   PARM                    WSPO
     C                   PARM                    WSSNM
     C                   PARM                    WSACC
     C                   PARM                    WSDTL
     C                   PARM                    WSCLI
     C                   PARM                    WSWT
     C                   PARM                    WSVOL
     C                   PARM                    WSLM
     C                   PARM                    WSSAL
     C                   PARM                    WSAREA
     C                   PARM                    WSTYM
     C                   PARM                    WSDTWL
     C                   PARM                    LSTBRD
     C                   PARM                    FMELDNR
     C                   PARM                    FEILMELDING
      *
     C     SLUTT         TAG
     C                   EXSR      EXIT
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   eval      lng     = zhbgetvar('lng')
     C                   eval      BckGnd  = zhbgetvar('bckgnd')
     C                   eval      lstbrd  = zhbgetvar('lstbrd')
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   EVAL      WSNA    = zhbgetvar('WSNA')
     C                   EVAL      WKEY    = zhbgetvar('WKEY')
     C                   EVAL      WSONO   = zhbgetvar('ORONO')
     C                   eval      W2ONO   = c2n2(WSONO)
     C                   EVAL      WSCONO  = zhbgetvar('WSCONO')
     C                   eval      WSCONO  = uppify(WSCONO)
     C                   EVAL      WSSNM   = zhbgetvar('WSSNM')
     C                   EVAL      WSACC   = zhbgetvar('WSACC')
     C                   eval      WSACC   = uppify(WSACC)
     C                   EVAL      WSDTL   = zhbgetvar('WSDTL')
     C                   eval      W2DTL   = c2n2(WSDTL)
     C                   EVAL      WSCLI   = zhbgetvar('WSCLI')
     C                   eval      W2CLI   = c2n2(WSCLI)
     C                   EVAL      WSWT    = zhbgetvar('WSWT')
     C                   eval      WS155   = c2n2(WSWT)
     C                   IF        WS155 > 999999
     C                   EVAL      W2WT    = 999999.9
     C                   ELSE
     C                   EVAL(H)   W2WT    = WS155
     C                   END
     C                   EVAL      WSVOL   = zhbgetvar('WSVOL')
     C                   eval      WS155   = c2n2(WSVOL)
     C                   IF        WS155 > 999
     C                   EVAL      W2VOL   = 999.99
     C                   ELSE
     C                   EVAL(H)   W2VOL   = WS155
     C                   END
     C                   EVAL      WSLM    = zhbgetvar('WSLM')
     C                   eval      WS155   = c2n2(WSLM)
     C                   IF        WS155 > 99
     C                   EVAL      W2LM    = 99.99
     C                   ELSE
     C                   EVAL(H)   W2LM    = WS155
     C                   END
     C                   EVAL      WSSAL   = zhbgetvar('WSSAL')
     C                   eval      WSSAL   = uppify(WSSAL)
     C                   EVAL      WSAREA  = zhbgetvar('WSAREA')
     C                   eval      WSAREA  = uppify(WSAREA)
     C                   EVAL      WSTYM   = zhbgetvar('WSTYM')
     C                   eval      W2TYM   = c2n2(WSTYM)
     C                   EVAL      WSDTWL  = zhbgetvar('WSDTWL')
     C                   eval      W2DTWL  = c2n2(WSDTWL)
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$top
      *  (search criteria)
      *=====================================================================******
     C     SetTop        begsr
      * Repeat national language for the next invocation
     C                   callp     updhtmlvar('LNG':lng:
     C                             InitHTMLVars)
      * Color for text, background, links, visited links, active links
     C                   callp     updhtmlvar('TXTCOLOR':'black')
     C                   callp     updhtmlvar('BOLD':' ')
     C                   callp     updhtmlvar('BGCOLOR':BIFARG)
     C                   callp     updhtmlvar('LINK':'0000FF')
     C                   callp     updhtmlvar('VLINK':'FF0000')
     C                   callp     updhtmlvar('ALINK':'00FF00')
      * KUNDE
     C                   callp     updhtmlvar('WSNA':WSNA)
BODY C                   callp     updhtmlvar('BODYCLASS':'class='+BIFARG)
     C                   callp     updhtmlvar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updHTMLvar('sdato':
     C                             %trim(%editw(BIDTV:'    .  .  ')))
     C                   callp     updHTMLvar('stid':
     C                             %trim(%editw(BITIDV:'  .  .  ')))
      *
     C                   endsr
      *=====================================================================******
      *  TEST INPUT
      *=====================================================================******
     C     TESTINP       begsr
     C                   IF        WSCONO = *BLANKS
     C                   MOVEL     FEIL01        FEILMELDING
     C                   MOVE      '01'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   IF        WSSNM = *BLANKS
     C                   MOVEL     FEIL02        FEILMELDING
     C                   MOVE      '02'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   IF        WSACC = *BLANKS
     C                   MOVEL     FEIL03        FEILMELDING
     C                   MOVE      '03'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   MOVE      W2DTLD        UDD               2 0
     C                   MOVE      W2DTLM        UMM               2 0
     C                   MOVE      W2DTL≈        U≈≈               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    U≈≈
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C                   MOVEL     FEIL04        FEILMELDING
     C                   MOVE      '04'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   IF        WSSAL = *BLANKS
     C                   MOVEL     FEIL05        FEILMELDING
     C                   MOVE      '05'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   IF        WSAREA = *BLANKS
     C                   MOVEL     FEIL06        FEILMELDING
     C                   MOVE      '06'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C                   IF        W2TYM <> 0
     C     UYEAR         ADD       2000          XNR04             4 0
     C                   IF        W2TYM≈ < XNR04
     C                   MOVEL     FEIL07        FEILMELDING
     C                   MOVE      '07'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
     C                   IF        ((W2TYMU < 1) OR (W2TYMU > 53))
     C                   MOVEL     FEIL07        FEILMELDING
     C                   MOVE      '07'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
     C                   ENDIF
      *
     C                   MOVE      W2DTWLD       UDD               2 0
     C                   MOVE      W2DTWLM       UMM               2 0
     C                   MOVE      W2DTWL≈       U≈≈               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    U≈≈
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C                   MOVEL     FEIL08        FEILMELDING
     C                   MOVE      '08'          FMELDNR
     C                   GOTO      UtTest
     C                   ENDIF
      *
     C     UTTEST        endsr
      *=====================================================================******
      *  OPPDATER DATABASE
      *=====================================================================******
     C     OPDDATA       begsr
     C     W2ONO         CHAIN     GSSORF                             33
     C                   IF        *IN33 = *OFF
     C                   EXSR      OPDLOGG1
     C                   EVAL      ORSNM  = WSSNM
     C                   EVAL      ORDTL  = W2DTL
     C                   EVAL      ORCLI  = W2CLI
     C                   EVAL      ORWT   = W2WT
     C                   EVAL      ORVOL  = W2VOL
     C                   MOVE      W2LM          ORLMA
     C                   EVAL      ORAREA = WSAREA
     C                   MOVEL     W2TYM         ORAAR
     C                   MOVE      W2TYM         ORUKE
     C                   EVAL      ORDTWL = W2DTWL
     C                   UPDATE    GSSORFR
      *
     C     W2ONO         CHAIN     GSSPOF                             33
     C                   IF        *IN33 = *OFF
     C                   EXSR      OPDLOGG2
     C                   EVAL      POCONO = WSCONO
     C                   UPDATE    GSSPOFR
     C                   END
      *
     C     W2ONO         SETLL     GSSRFF
     C     W2ONO         READE     GSSRFF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        RFKD  = 'CPO'
     C                   EXSR      OPDLOGG3
     C                   EVAL      RFREF = WSACC
     C                   END
     C                   UPDATE    GSSRFFR
     C     W2ONO         READE     GSSRFF                                 33
     C  N33              ENDDO
      *
     C     W2ONO         SETLL     GSSRFF
     C     W2ONO         READE     GSSRFF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        RFKD  = 'SAL'
     C                   EXSR      OPDLOGG4
     C                   EVAL      RFREF = WSSAL
     C                   END
     C                   UPDATE    GSSRFFR
     C     W2ONO         READE     GSSRFF                                 33
     C  N33              ENDDO
      *
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  Oppdater loggen
      *=====================================================================
     C     OPDLOGG1      begsr
      *
     C                   IF        ORSNM <> WSSNM
     C                   EVAL      LGTXT = XXTXT01
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = WSSNM
     C                   EVAL      LGAGM = ORSNM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   IF        ORDTL <> W2DTL
     C                   EVAL      LGTXT = XXTXT02
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   MOVE      W2DTL≈        XXDT≈≈
     C                   MOVE      W2DTLM        XXDTMM
     C                   MOVE      W2DTLD        XXDTDD
     C                   CAT       XXDT:1        LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   MOVE      ORDTL≈        XXDT≈≈
     C                   MOVE      ORDTLM        XXDTMM
     C                   MOVE      ORDTLD        XXDTDD
     C                   CAT       XXDT:1        LGAGM
     C                   WRITE     GSSLGFR
     C                   END
     C                   EVAL      LGANY = *BLANKS
     C                   EVAL      LGAGM = *BLANKS
      *
     C                   IF        ORCLI <> W2CLI
     C                   EVAL      LGTXT = XXTXT03
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGNNY = W2CLI
     C                   EVAL      LGNGM = ORCLI
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   IF        ORWT <> W2WT
     C                   EVAL      LGTXT = XXTXT04
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGNNY = W2WT
     C                   EVAL      LGNGM = ORWT
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   IF        ORVOL <> W2VOL
     C                   EVAL      LGTXT = XXTXT05
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGNNY = W2VOL
     C                   EVAL      LGNGM = ORVOL
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   IF        ORLMA = *BLANKS
     C                   MOVE      *ZEROS        ORLMA
     C                   END
     C                   MOVE      W2LM          W2LMA             4
     C                   IF        W2LMA <> W2LMA
     C                   EVAL      LGTXT = XXTXT12
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGNNY = W2LM
     C                   MOVE      ORLMA         ORLM              4 2
     C                   EVAL      LGNGM = ORLM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   EVAL      LGNNY = *ZEROS
     C                   EVAL      LGNGM = *ZEROS
      *
     C                   IF        ORAREA <> WSAREA
     C                   EVAL      LGTXT = XXTXT06
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = WSAREA
     C                   EVAL      LGAGM = ORAREA
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   MOVE      W2TYM≈        WSTYM1            4
     C                   MOVE      W2TYMU        WSTYM2            2
     C                   IF        ((ORAAR <> WSTYM1) OR (ORUKE <> WSTYM2))
     C                   EVAL      LGTXT = XXTXT07
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   CAT       WSTYM1:1      LGANY
     C                   CAT       '.':0         LGANY
     C                   CAT       WSTYM2:0      LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   CAT       ORAAR:1       LGAGM
     C                   CAT       '.':0         LGAGM
     C                   CAT       ORUKE:0       LGAGM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   IF        ORDTWL <> W2DTWL
     C                   EVAL      LGTXT = XXTXT08
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   MOVE      W2DTWL≈       XXDT≈≈
     C                   MOVE      W2DTWLM       XXDTMM
     C                   MOVE      W2DTWLD       XXDTDD
     C                   CAT       XXDT:1        LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   MOVE      ORDTWL≈       XXDT≈≈
     C                   MOVE      ORDTWLM       XXDTMM
     C                   MOVE      ORDTWLD       XXDTDD
     C                   CAT       XXDT:1        LGAGM
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  Oppdater loggen
      *=====================================================================
     C     OPDLOGG2      begsr
      *
     C                   IF        POCONO <> WSCONO
     C                   EVAL      LGTXT = XXTXT08
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   CAT       WSCONO:1      LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   CAT       POCONO:1      LGAGM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  Oppdater loggen
      *=====================================================================
     C     OPDLOGG3      begsr
      *
     C                   IF        POCONO <> WSCONO
     C                   EVAL      LGTXT = XXTXT09
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   CAT       WSACC:1       LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   CAT       RFREF:1       LGAGM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  Oppdater loggen
      *=====================================================================
     C     OPDLOGG4      begsr
      *
     C                   IF        POCONO <> WSCONO
     C                   EVAL      LGTXT = XXTXT10
     C                   CAT       ORLC:1        LGTXT
     C                   EVAL      LGANY = 'To:'
     C                   CAT       WSSAL:1       LGANY
     C                   EVAL      LGAGM = 'From:'
     C                   CAT       RFREF:1       LGAGM
     C                   WRITE     GSSLGFR
     C                   END
      *
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN(N)  BRIDF                              50
      *
     C                   CALLB     PGM
     C                   PARM                    BIBRID
     C                   PARM                    UsrSpcName
     C                   PARM                    UINN              1
     C                   IF        UINN = 'N'
     C                   EXSR      EXIT
     C                   return
     C                   END
     C     WSUSER        CHAIN     BRIDF                              50
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           BIDTF
     C                   MOVE      WTM           BITIDF
     C                   UPDATE    BRIDFR
     C* En "standardvariant" libl: call bound (INC
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt pÂ user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
      *
     C                   OPEN      GSSORF
     C                   OPEN      GSSPOF
     C                   OPEN      GSSRFF
     C                   open      GSSLGF                               50
      *
     C                   MOVE      '.'           XXSKILL1
     C                   MOVE      '.'           XXSKILL2
      *
     C                   MOVE      WSUSER        LGUSER
     C                   MOVE      WDT           LGDT
     C                   MOVE      WTM           LGTID
     C                   Z-ADD     1             LGLN
     C                   MOVEL     'SS156'       LGPGM
     C                   Z-ADD     5             LGNIV≈
     C                   MOVE      WDT           LGHDT
     C                   MOVEL     WTM           LGHTID
     C                   MOVEL     'MAIN'        LGFTYP
     C                   MOVE      W2ONO         LGONO
     C                   MOVE      *ZEROS        LGLNO
      *
     C                   endsr
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          begsr
     C                   close     BRIDF
     C                   close     GSSORF
     C                   close     GSSPOF
     C                   close     GSSRFF
     C                   CLOSE     GSSLGF
     C                   eval      *inlr = *on
      *
     C                   endsr
