      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT aktive ordre
      **************************************************************
     FWRKCGISS  IF   E           K DISK
     FSS152P    O    E             PRINTER OFLIND(*IN27)
     D                 DS
     D WKEY2                   1    256
     D KEY                     1    256    DIM(256)
     D                 DS
     D WDATA                   1   1024
     D DATA                    1   1024    DIM(1024)
      *
     C                   EXSR      INIT
      *
     C                   WRITE     SS152PA
      *
     C     WINTEG        SETLL     WRKCGISS
     C     WINTEG        READE     WRKCGISS                               33
     C                   DOW       *IN33 = *OFF
     C                   MOVEA     DATA(1)       POCONO
     C                   MOVEA     DATA(21)      ORSNM
     C                   MOVEA     DATA(51)      WSACC
     C                   MOVEA     DATA(88)      XAN09             9
     C                   MOVE      XAN09         ORAMT
     C                   MOVEA     DATA(97)      XAN08             8
     C                   MOVE      XAN08         ORDTL
     C                   MOVEA     DATA(105)     ORLC
     C                   MOVEA     DATA(110)     XAN08
     C                   MOVE      XAN08         ORDTR
     C                   MOVEA     KEY(93)       ORST2
     C                   MOVEA     DATA(168)     XAN05             5
     C                   MOVE      XAN05         ORCLI
     C                   MOVEA     DATA(173)     XAN07             7
     C                   MOVE      XAN07         ORWT
     C                   MOVEA     DATA(180)     XAN05
     C                   MOVE      XAN05         ORVOL
     C                   MOVEA     DATA(189)     W2CNA
     C                   MOVEA     DATA(225)     XXSAL
     C                   MOVEA     DATA(260)     ORAREA
     C                   MOVEA     DATA(262)     W2TYM
     C                   MOVEA     DATA(269)     XAN08
     C                   MOVE      XAN08         ORDTWL
     C                   MOVEA     DATA(277)     XAN11            11
     C                   MOVE      XAN11         ORTNO
      *
     C   27              WRITE     SS152PA
     C   27              MOVE      '0'           *IN27
     C                   WRITE     SS152PB
      *
     C     WINTEG        READE     WRKCGISS                               33
     C  N33              ENDDO
      *
     C                   WRITE     SS152PC
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UINTEG            6
      *
     C                   MOVE      UINTEG        WINTEG            6 0
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTD               6
     C                   MOVEL     WTD           XTID4
      *
     C                   ENDSR
      *
