      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT aktive ordre
      **************************************************************
     FWRKCGISS  IF   E           K DISK
     FSS182P    O    E             PRINTER OFLIND(*IN27)
     D                 DS
     D WKEY2                   1    256
     D KEY                     1    256    DIM(256)
     D                 DS
     D WDATA                   1   1024
     D DATA                    1   1024    DIM(1024)
      *
     C                   EXSR      INIT
      *
     C                   WRITE     SS182PA
      *
     C     WINTEG        SETLL     WRKCGISS
     C     WINTEG        READE     WRKCGISS                               33
     C                   DOW       *IN33 = *OFF
     C                   MOVEA     DATA(1)       POCONO
     C                   MOVEA     DATA(21)      ORSNM
     C                   MOVEA     DATA(51)      WSACC
     C                   MOVEA     DATA(86)      XAN05             5
     C                   MOVE      XAN05         ORCLI
     C                   MOVEA     DATA(91)      XAN07             7
     C                   MOVE      XAN07         ORWT
     C                   MOVEA     DATA(98)      XAN05
     C                   MOVE      XAN05         ORVOL
     C                   MOVEA     DATA(107)     W2CNA
     C                   MOVEA     DATA(143)     XXSAL
     C                   MOVEA     DATA(178)     ORAREA
     C                   MOVEA     DATA(180)     XAN08             8
     C                   MOVE      XAN08         ORDTWL
     C                   MOVEA     DATA(188)     XAN08             8
     C                   MOVE      XAN08         ORDTL
     C                   MOVEA     DATA(196)     W2TYM
     C                   MOVEA     DATA(203)     XAN11            11
     C                   MOVE      XAN11         ORTNO
      *
     C   27              WRITE     SS182PA
     C   27              MOVE      '0'           *IN27
     C                   WRITE     SS182PB
      *
     C     WINTEG        READE     WRKCGISS                               33
     C  N33              ENDDO
      *
     C                   WRITE     SS182PC
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UINTEG            6
      *
     C                   MOVE      UINTEG        WINTEG            6 0
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTD               6
     C                   MOVEL     WTD           XTID4
      *
     C                   ENDSR
      *
