      *
      ***********************************************************
      * MANUELT VEDLIKEHOLD AV SKYTESTATUS PÅ FRAKTBREVSNIVÅ
      ***********************************************************
      *
     FSTSFBR    UF   E           K DISK
     FHEADF     IF   E           K DISK
     FDOKUF     IF   E           K DISK
     FSTSFBRFM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  SFBESK                 1     35
     D  AVSEND                 1      7
     D  MOTTAK                11     21
     D  STED                  23     35
     C*
     C     *ENTRY        PLIST
     C                   PARM                    XXTYPE            5
     C                   PARM                    XXPRO             8 0
     C                   PARM                    XXAVD             4 0
     C                   PARM                    XXOPD             7 0
     C                   PARM                    XXANOP            4 0
     C                   PARM                    XXMANK            4 0
      *
     C     HEAKEY        KLIST
     C                   KFLD                    SFAVD
     C                   KFLD                    SFOPD
     C     DOKUFK        KLIST
     C                   KFLD                    DFRI
     C                   KFLD                    SFAVD
     C                   KFLD                    SFOPD
     C                   KFLD                    SFFBNR
     C                   MOVE      'F'           DFRI
      *
     C     STRKEY        KLIST
     C                   KFLD                    XXTYPE
     C                   KFLD                    XXPRO
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
     C     UPDKEY        KLIST
     C                   KFLD                    XXTYPE
     C                   KFLD                    XXPRO
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
     C                   KFLD                    SFFBNR
      *
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     STRKEY        SETLL     STSFBR
     C     STRKEY        READE(N)  STSFBR                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C     SFANKI        SUB       SFANKK        MANKO
     C     HEAKEY        CHAIN     HEADF                              33
     C     *IN33         IFEQ      *OFF
     C                   MOVEL     HENAS         AVSEND
     C                   MOVEL     HENAK         MOTTAK
     C                   MOVEL     HEADK3        STED
     C                   ELSE
     C                   CLEAR                   SFBESK
     C                   END
     C     DOKUFK        CHAIN     DOKUF                              33
     C     *IN33         IFEQ      *OFF
     C                   MOVEL     DFNAVM        MOTTAK
     C                   MOVEL     DFAD3M        STED
     C                   END
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     STRKEY        READE(N)  STSFBR                                 94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0            NESTE SIDE
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C* N94      STRKEY    READESTSFBR              N    94
     C                   GOTO      START2
     C                   END
     C*
     C                   MOVE      'N'           REFRES            1
     C     ZRECNO        IFNE      0
     C                   EXSR      HENTSR
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C     REFRES        IFEQ      'J'
     C                   GOTO      START
     C                   END
     C                   GOTO      START3
     C*
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENTSR        BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '1'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      CHGSF
     C                   END
     C     WSNR          IFEQ      '9'                                          FULLFØRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      FULSF
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C                   CALL      'STSCLI'
     C                   PARM                    XXTYPE
     C                   PARM                    XXPRO
     C                   PARM                    SFAVD
     C                   PARM                    SFOPD
     C                   PARM                    SFFBNR
     C                   PARM                    SFANKI
     C                   PARM                    MANKO
      * RETURNERER EVT ENDREDE VERDIER
     C                   SETON                                        99
     C                   UPDATE    SUBFIL
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FULSF         BEGSR
     C***********************************************
      *
     C     UPDKEY        CHAIN     STSFBR                             33
     C     *IN33         IFEQ      *OFF
     C                   SELECT
     C     SFSTAT        WHENEQ    ' '
     C                   MOVE      'Y'           SFSTAT
     C     SFSTAT        WHENEQ    'Y'
     C     SFSTAT        OREQ      'X'
     C                   MOVE      ' '           SFSTAT
     C                   ENDSL
     C                   UPDATE    STSFBRR
     C                   END
      *
     C                   SETON                                        99
     C                   UPDATE    SUBFIL
     C*
     C*                    MOVE 'J'       REFRES
     C*
     C                   ENDSR
     C*
