      * SJEKK OM DET FINNES OPPDRAG PÅ TUREN SOM IKKE ER
      * SKUTT (ENTEN VIA PDA ELLER MERKET MANUELT AV TERMINALLEDER)
     FHEAD14    IF   E           K DISK
     FSTSOPD    IF   E           K DISK
     FSTSCLI    IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    XXTYPE            5
     C                   PARM                    XXPRO             8 0
     C                   PARM                    UIN30             1
      *
      *
     C     TSTKEY        KLIST
     C                   KFLD                    XXTYPE
     C                   KFLD                    XXPRO
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C                   MOVE      '0'           UIN30
     C     XXPRO         SETLL     HEAD14
     C     XXPRO         READE     HEAD14                                 33
     C     *IN33         DOWEQ     *OFF
     C     TSTKEY        CHAIN     STSOPD                             33
     C     *IN33         IFEQ      '0'
      * OPPDRAG finnes i skytefil men er ÅPENT - enkeltkolli skutt??
     C     SOSTAT        IFEQ      ' '
     C     TSTKEY        SETLL     STSCLI
     C     TSTKEY        READE     STSCLI                                 33
     C     *IN33         DOWEQ     '0'
     C     SCSTAT        IFNE      ' '
     C                   MOVE      'M'           SOSTAT
     C                   goto      UTBSTS
     C                   END
     C     TSTKEY        READE     STSCLI                                 33
     C                   END
     C                   END
     C     UTBSTS        TAG
     C     SOSTAT        IFEQ      ' '
     C                   MOVE      '1'           UIN30
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C     XXPRO         READE     HEAD14                                 33
     C                   END
      *
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
