     FSVEV      UF   E             DISK
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      * Tell antal varelinjer
     C                   READ      SVEV                                   53
     C     *IN53         DOWEQ     *OFF
     C     SVEV_STVA     IFEQ      0
     C                   EVAL      SVEV_STVA=SVEV_FABL
     C                   UPDATE    SVEVR
     C                   ENDIF
     C                   READ      SVEV                                   53
     C                   ENDDO
     C                   ENDSR
