     FSVEZ      UF A E           K DISK
     FSVE035D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    SVEZ_SYAV     ZVEZ_SYAV
     C     *LIKE         DEFINE    SVEZ_SYOP     ZVEZ_SYOP
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    ZVEZ_SYAV
     C                   PARM                    ZVEZ_SYOP
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVEZ_KEY      KLIST
     C                   KFLD                    ZVEZ_SYAV
     C                   KFLD                    ZVEZ_SYOP
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVEZ_KEY      CHAIN(N)  SVEZ                               90
     C                   EVAL      XVEZ_SYAV=ZVEZ_SYAV
     C                   EVAL      XVEZ_SYOP=ZVEZ_SYOP
     C                   EVAL      XVEZ_CON2=SVEZ_CON2
     C                   EVAL      XVEZ_CON3=SVEZ_CON3
     C                   EVAL      XVEZ_CON4=SVEZ_CON4
     C                   EVAL      XVEZ_CON5=SVEZ_CON5
     C                   EVAL      XVEZ_CON6=SVEZ_CON6
     C                   EVAL      XVEZ_CON7=SVEZ_CON7
     C                   EVAL      XVEZ_CON8=SVEZ_CON8
     C                   EVAL      XVEZ_CON9=SVEZ_CON9
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     SVE035DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9

     C     SRB8          TAG
     C     SVEZ_KEY      CHAIN     SVEZ                               90
     C   90              EVAL      SVEZ_SYAV=ZVEZ_SYAV
     C   90              EVAL      SVEZ_SYOP=ZVEZ_SYOP
     C                   EVAL      SVEZ_CON2=XVEZ_CON2
     C                   EVAL      SVEZ_CON3=XVEZ_CON3
     C                   EVAL      SVEZ_CON4=XVEZ_CON4
     C                   EVAL      SVEZ_CON5=XVEZ_CON5
     C                   EVAL      SVEZ_CON6=XVEZ_CON6
     C                   EVAL      SVEZ_CON7=XVEZ_CON7
     C                   EVAL      SVEZ_CON8=XVEZ_CON8
     C                   EVAL      SVEZ_CON9=XVEZ_CON9
     C  N90              UPDATE    SVEZR
     C   90              WRITE     SVEZR

     C     SRB9          TAG
     C                   ENDSR
