     FSVEX      UF A E           K DISK
     FSVE031D   CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    SVEX_SYAV     ZVEX_SYAV
     C     *LIKE         DEFINE    SVEX_SYOP     ZVEX_SYOP
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    ZVEX_SYAV
     C                   PARM                    ZVEX_SYOP
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVEX_KEY      KLIST
     C                   KFLD                    ZVEX_SYAV
     C                   KFLD                    ZVEX_SYOP
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVEX_KEY      CHAIN(N)  SVEX                               90
     C                   EVAL      XVEX_SYAV=ZVEX_SYAV
     C                   EVAL      XVEX_SYOP=ZVEX_SYOP
     C                   EVAL      XVEX_KOT2=SVEX_KOT2
     C                   EVAL      XVEX_KOT3=SVEX_KOT3
     C                   EVAL      XVEX_KOT4=SVEX_KOT4
     C                   EVAL      XVEX_KOT5=SVEX_KOT5
     C                   EVAL      XVEX_KOT6=SVEX_KOT6
     C                   EVAL      XVEX_KOT7=SVEX_KOT7
     C                   EVAL      XVEX_KOT8=SVEX_KOT8
     C                   EVAL      XVEX_KOT9=SVEX_KOT9
     C                   EVAL      XVEX_KOS2=SVEX_KOS2
     C                   EVAL      XVEX_KOS3=SVEX_KOS3
     C                   EVAL      XVEX_KOS4=SVEX_KOS4
     C                   EVAL      XVEX_KOS5=SVEX_KOS5
     C                   EVAL      XVEX_KOS6=SVEX_KOS6
     C                   EVAL      XVEX_KOS7=SVEX_KOS7
     C                   EVAL      XVEX_KOS8=SVEX_KOS8
     C                   EVAL      XVEX_KOS9=SVEX_KOS9
     C                   EVAL      XVEX_VAS2=SVEX_VAS2
     C                   EVAL      XVEX_VAS3=SVEX_VAS3
     C                   EVAL      XVEX_VAS4=SVEX_VAS4
     C                   EVAL      XVEX_VAS5=SVEX_VAS5
     C                   EVAL      XVEX_VAS6=SVEX_VAS6
     C                   EVAL      XVEX_VAS7=SVEX_VAS7
     C                   EVAL      XVEX_VAS8=SVEX_VAS8
     C                   EVAL      XVEX_VAS9=SVEX_VAS9
      * Viser bilde
     C     TAG01         TAG
     C                   WRITE     SVE031DØ
     C                   EXFMT     SVE031DA
     C                   EVAL      *IN30=*OFF
     C                   EVAL      *IN32=*OFF
     C                   EVAL      *IN33=*OFF
     C                   EVAL      *IN34=*OFF
     C                   EVAL      *IN35=*OFF
     C                   EVAL      *IN36=*OFF
     C                   EVAL      *IN37=*OFF
     C                   EVAL      *IN38=*OFF
     C                   EVAL      *IN39=*OFF
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9
      * F4=Søk
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     *IN04         IFEQ      '1'
     C     POSNBR        ANDEQ     15
     C                   CALL      'SVT003R'
     C                   PARM      'KLI'         UTYP              3
     C                   PARM      'A'           UIE               1
     C                   PARM      WDT           UDATO             8
     C                   PARM                    UKD              10
     C     UKD           IFNE      *BLANKS
     C                   SELECT
     C     LINNBR        WHENEQ    6
     C                   MOVEL     UKD           XVEX_KOS2
     C     LINNBR        WHENEQ    7
     C                   MOVEL     UKD           XVEX_KOS3
     C     LINNBR        WHENEQ    8
     C                   MOVEL     UKD           XVEX_KOS4
     C     LINNBR        WHENEQ    9
     C                   MOVEL     UKD           XVEX_KOS5
     C     LINNBR        WHENEQ    10
     C                   MOVEL     UKD           XVEX_KOS6
     C     LINNBR        WHENEQ    11
     C                   MOVEL     UKD           XVEX_KOS7
     C     LINNBR        WHENEQ    12
     C                   MOVEL     UKD           XVEX_KOS8
     C     LINNBR        WHENEQ    13
     C                   MOVEL     UKD           XVEX_KOS9
     C                   ENDSL
     C                   ENDIF
     C                   GOTO      TAG01
     C                   ENDIF
     C     SRB8          TAG
     C     SVEX_KEY      CHAIN     SVEX                               90
     C   90              EVAL      SVEX_SYAV=ZVEX_SYAV
     C   90              EVAL      SVEX_SYOP=ZVEX_SYOP
     C                   EVAL      SVEX_KOT2=XVEX_KOT2
     C                   EVAL      SVEX_KOT3=XVEX_KOT3
     C                   EVAL      SVEX_KOT4=XVEX_KOT4
     C                   EVAL      SVEX_KOT5=XVEX_KOT5
     C                   EVAL      SVEX_KOT6=XVEX_KOT6
     C                   EVAL      SVEX_KOT7=XVEX_KOT7
     C                   EVAL      SVEX_KOT8=XVEX_KOT8
     C                   EVAL      SVEX_KOT9=XVEX_KOT9
     C                   EVAL      SVEX_KOS2=XVEX_KOS2
     C                   EVAL      SVEX_KOS3=XVEX_KOS3
     C                   EVAL      SVEX_KOS4=XVEX_KOS4
     C                   EVAL      SVEX_KOS5=XVEX_KOS5
     C                   EVAL      SVEX_KOS6=XVEX_KOS6
     C                   EVAL      SVEX_KOS7=XVEX_KOS7
     C                   EVAL      SVEX_KOS8=XVEX_KOS8
     C                   EVAL      SVEX_KOS9=XVEX_KOS9
     C                   EVAL      SVEX_VAS2=XVEX_VAS2
     C                   EVAL      SVEX_VAS3=XVEX_VAS3
     C                   EVAL      SVEX_VAS4=XVEX_VAS4
     C                   EVAL      SVEX_VAS5=XVEX_VAS5
     C                   EVAL      SVEX_VAS6=XVEX_VAS6
     C                   EVAL      SVEX_VAS7=XVEX_VAS7
     C                   EVAL      SVEX_VAS8=XVEX_VAS8
     C                   EVAL      SVEX_VAS9=XVEX_VAS9
     C  N90              UPDATE    SVEXR
     C   90              WRITE     SVEXR

     C     SRB9          TAG
     C                   ENDSR
