     FSVEX      UF A E           K DISK
     FSVE032D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    SVEX_SYAV     ZVEX_SYAV
     C     *LIKE         DEFINE    SVEX_SYOP     ZVEX_SYOP
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    ZVEX_SYAV
     C                   PARM                    ZVEX_SYOP
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVEX_KEY      KLIST
     C                   KFLD                    ZVEX_SYAV
     C                   KFLD                    ZVEX_SYOP
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVEX_KEY      CHAIN(N)  SVEX                               90
     C                   EVAL      XVEX_SYAV=ZVEX_SYAV
     C                   EVAL      XVEX_SYOP=ZVEX_SYOP
     C                   EVAL      XVEX_GOD2=SVEX_GOD2
     C                   EVAL      XVEX_GOD3=SVEX_GOD3
     C                   EVAL      XVEX_GOD4=SVEX_GOD4
     C                   EVAL      XVEX_GOD5=SVEX_GOD5
     C                   EVAL      XVEX_GOD6=SVEX_GOD6
     C                   EVAL      XVEX_GOD7=SVEX_GOD7
     C                   EVAL      XVEX_GOD8=SVEX_GOD8
     C                   EVAL      XVEX_GOD9=SVEX_GOD9
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     SVE032DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9

     C     SRB8          TAG
     C     SVEX_KEY      CHAIN     SVEX                               90
     C   90              EVAL      SVEX_SYAV=ZVEX_SYAV
     C   90              EVAL      SVEX_SYOP=ZVEX_SYOP
     C                   EVAL      SVEX_GOD2=XVEX_GOD2
     C                   EVAL      SVEX_GOD3=XVEX_GOD3
     C                   EVAL      SVEX_GOD4=XVEX_GOD4
     C                   EVAL      SVEX_GOD5=XVEX_GOD5
     C                   EVAL      SVEX_GOD6=XVEX_GOD6
     C                   EVAL      SVEX_GOD7=XVEX_GOD7
     C                   EVAL      SVEX_GOD8=XVEX_GOD8
     C                   EVAL      SVEX_GOD9=XVEX_GOD9
     C  N90              UPDATE    SVEXR
     C   90              WRITE     SVEXR

     C     SRB9          TAG
     C                   ENDSR
