     FSVEW      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSVE036D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                UDS
     D  UFIRM                  1      2
      *____
      * Inz
      *""""
     C     *ENTRY        PLIST
     C                   PARM                    UVEW_KNNR
     C                   PARM                    UVEW_KNSO
     C     *LIKE         DEFINE    SVEW_KNNR     UVEW_KNNR
     C     *LIKE         DEFINE    SVEW_KNSO     UVEW_KNSO
     C                   MOVEL     *BLANKS       UVEW_KNSO
     C                   MOVEL     *BLANKS       WVEW_KNSO
     C     SVEWKEY       KLIST
     C                   KFLD                    UVEW_KNNR
     C                   KFLD                    WVEW_KNSO
     C     CUNDL01K      KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    UVEW_KNNR
     C     CUNDL01K      CHAIN     CUNDL01
     C
      *______________
      * Clear Subfile
      *""""""""""""""
     C     START1        TAG

     C                   MOVE      '1'           *IN93
     C                   MOVE      *BLANKS       SFNR
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SVEWKEY       SETLL     SVEW
     C                   READ      SVEW                                   94

     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      SVEW                                   94
     C  N94              ENDDO
     C*                  Z-ADD     1             ZRECNO
      *________________
      * Display Subfile
      *""""""""""""""""
     C     START2        TAG

     C                   MOVE      *OFF          *IN51
     C                   MOVEA     '11'          *IN(91)
      * KOMMER HIT VED TOM FIL
     C     ZRECNO        IFEQ      0
     C                   MOVE      *OFF          *IN94
     C                   ADD       1             ZRECNO
     C                   MOVE      *ON           *IN51
     C                   WRITE     SUBFIL
     C                   SETON                                        94
     C                   ENDIF
     C                   WRITE     WIND01
     C                   WRITE     BUNN
     C     STBUNN        TAG

     C                   MOVEL     *BLANKS       WVEW_KNSO
     C                   EXFMT     SUBCTL

     C                   SETOFF                                       999830
      * FORRIGE
     C   12              GOTO      SLUTT

     C     ZRECNO        IFNE      0
     C                   MOVE      *OFF          *IN98
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C                   ENDDO
     C     SFNR          IFEQ      '1'
     C                   MOVE      SVEW_KNSO     UVEW_KNSO
     C                   GOTO      SLUTT
     C                   ENDIF
     C                   ENDIF
     C     WVEW_KNSO     CABNE     *BLANKS       START1
     C                   GOTO      START2

     C     SLUTT         TAG

     C                   SETON                                        LR
     C                   RETURN
