     FSVEHE     IF   E           K DISK
     D  XVEH_BYTE      S              7S 0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRB
     C                   MOVE      *ON           *INLR
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *LIKE         DEFINE    XVEH_BYTE     UVEH_BYTE
     C     *LIKE         DEFINE    SVEHE_SYA     UVEHE_SYA
     C     *LIKE         DEFINE    SVEHE_SYO     UVEHE_SYO
      * INIT AV ARBEIDSFELT
     C                   EVAL      UVEH_BYTE=0
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UVEHE_SYA
     C                   PARM                    UVEHE_SYO
     C                   PARM                    UVEH_BYTE
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    UVEHE_SYA
     C                   KFLD                    UVEHE_SYO
     C     KEYA          SETLL     SVEHE
     C     KEYA          READE     SVEHE                                  51
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR Les og tell                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     *IN51         DOWEQ     *OFF
     C                   ADD       80            UVEH_BYTE
     C     KEYA          READE     SVEHE                                  51
     C                   ENDDO
     C                   SUB       80            UVEH_BYTE
     C     ' '           CHECKR(E) SVEHE_DTA     XVEH_BYTE
     C                   ADD       XVEH_BYTE     UVEH_BYTE
     C                   ENDSR
