     FSVEHOLD   IF   E             DISK
     F                                     RENAME(SVEHR:SVEHROLD)
     FSVEHNEW   O  A E             DISK
     F                                     RENAME(SVEHR:SVEHRNEW)
     C                   READ      SVEHOLD                                51
     C     *IN51         DOWEQ     *OFF

     C                   MOVEL(P)  SVEH_AVLK     SVEH_AVEO
     C                   CAT       SVEH_AVO1:0   SVEH_AVEO
     C                   CAT       SVEH_AVO2:0   SVEH_AVEO

     C                   MOVEL(P)  SVEH_DKLK     SVEH_DKEO
     C                   CAT       SVEH_DKO1:0   SVEH_DKEO
     C                   CAT       SVEH_DKO2:0   SVEH_DKEO

     C                   MOVEL(P)  SVEH_OMLK     SVEH_OMEO
     C                   CAT       SVEH_OMO1:0   SVEH_OMEO
     C                   CAT       SVEH_OMO2:0   SVEH_OMEO

     C     SVEH_KLA1     IFNE      *BLANKS
     C                   MOVEL(P)  'SE'          SVEH_KLEO
     C                   CAT       SVEH_KLA1:0   SVEH_KLEO
     C                   CAT       SVEH_KLA2:0   SVEH_KLEO
     C                   ENDIF

     C                   WRITE     SVEHRNEW

     C                   READ      SVEHOLD                                51
     C                   ENDDO

     C                   EVAL      *INLR=*ON
