     FSVIAOLD   IF   E             DISK
     F                                     RENAME(SVIAR:SVIAROLD)
     FSVIANEW   O  A E             DISK
     F                                     RENAME(SVIAR:SVIARNEW)
     C                   READ      SVIAOLD                                51
     C     *IN51         DOWEQ     *OFF

     C                   MOVEL(P)  SVIA_OMLK     SVIA_OMEO
     C                   CAT       SVIA_OMO1:0   SVIA_OMEO
     C                   CAT       SVIA_OMO2:0   SVIA_OMEO
     C                   WRITE     SVIARNEW

     C                   READ      SVIAOLD                                51
     C                   ENDDO

     C                   EVAL      *INLR=*ON
