     FSVG514D   CF   E             WORKSTN
     F                                     SFILE(SVG514DA:ZRECNO)
     FSVG513F   UF A E           K DISK
     FSVG513F1  IF   E           K DISK
     F                                     RENAME(SVG513FR:SVG513FR1)
     FSVNH05    IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *________________
      * Arbetsvariablar
      *""""""""""""""""
     C     *LIKE         DEFINE    ZRECNO        WRECNO
     C     *LIKE         DEFINE    *IN30         WIN30
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR

     C     SRB1          TAG
      *______________
      * Tømme Subfile
      *""""""""""""""
     C                   EVAL      *IN93=*ON
     C                   WRITE     SVG514DB
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZERO         ZRECNO
     C                   Z-ADD     *ZERO         WRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     *LOVAL        SETLL     SVG513F1
     C                   READ      SVG513F1                               94

     C     *IN94         DOWEQ     '0'

     C                   EVAL      OTINTK = *ZEROS
     C     YTITRNR       CHAIN     SVNH05                             54
     C                   IF        *IN54 = *OFF
     C                   EVAL      OTINTK = TINTK
     C                   IF        NINTK > 0
     C                   EVAL      OTINTK=NINTK
     C                   ENDIF
     C                   ENDIF

     C                   ADD       1             ZRECNO
     C                   WRITE     SVG514DA
     C                   READ      SVG513F1                               94
     C  N94              ENDDO

     C     ZRECNO        IFEQ      0
     C                   ADD       1             ZRECNO
     C                   WRITE     SVG514DA
     C                   ENDIF
     C                   EVAL      WRECNO=ZRECNO
     C                   EVAL      ZRECNO=1
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C     SRB3          TAG

     C                   MOVEA     '11'          *IN(91)
     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     SVG514DE
     C                   WRITE     SVG514DØ
     C                   WRITE     SVG514DC
     C                   EXFMT     SVG514DB

     C     *IN03         IFEQ      '0'
     C     *IN12         ANDEQ     '0'

     C                   MOVEA     '00'          *IN(91)
      *_____________
      * F5=Frisk opp
      *"""""""""""""
     C     *IN05         CABEQ     '1'           SRB1
      *___________
      * F6=Lage ny
      *"""""""""""
     C     *IN06         IFEQ      '1'
     C                   EXSR      SRBA
     C     *IN03         CABEQ     '1'           SRB9
     C                   GOTO      SRB3
     C                   ENDIF
      *_______
      * Valg ?
      *"""""""
     C                   EVAL      *IN52=*OFF
     C                   EVAL      *IN95=*OFF
     C     *IN52         DOWEQ     '0'

     C                   READC     SVG514DA                               52
     C     *IN52         IFEQ      '0'
     C     ZOP           CASEQ     '2'           SRBB                           Endre
     C     ZOP           CASEQ     '4'           SRBD                           Slette
     C                   ENDCS
     C                   ENDIF
      *
     C  N52              ENDDO

     C     *IN03         CABEQ     '1'           SRB9
     C     *IN12         CABEQ     '1'           SRB3
     C                   GOTO      SRB1

     C                   ENDIF

     C     SRB9          ENDSR
      *////////////////////////////////////////////////////////////
      *  Lage ny                                             SRBA /
      *////////////////////////////////////////////////////////////
     C     SRBA          BEGSR

     C                   CLEAR                   SVG514DD
     C                   MOVEA     '0000'        *IN(30)
     C                   EVAL      *IN40=*OFF

     C     SRBA1         TAG

      *____________
      * Blanke felt
      *""""""""""""
     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     SVG514DØ
     C                   EXFMT     SVG514DD
     C                   MOVEA     '0000'        *IN(30)
     C     *IN03         IFEQ      '0'
     C     *IN05         ANDEQ     '0'
     C     *IN12         ANDEQ     '0'
      *_______
      * F4=Søk
      *"""""""
     C     *IN04         IFEQ      '1'
     C                   ENDIF
      *____________
      * Teste input-1
      *""""""""""""
      * MRN-nr måste vare utfyllt
     C     ZTITRNR       IFEQ      *BLANKS
     C                   EVAL      *IN30=*ON
     C                   EVAL      *IN31=*ON
     C                   MOVE      'SVX1763'     ZMSGNO
     C                   GOTO      SRBA1
     C                   ENDIF
      * MRN-nr måste finnas i SVNH05
     C     ZTITRNR       CHAIN     SVNH05                             54
     C                   IF        *IN54
     C                   EVAL      *IN30=*ON
     C                   EVAL      *IN31=*ON
     C                   MOVE      'SVX1763'     ZMSGNO
     C                   GOTO      SRBA1
     C                   ENDIF
      * Antal
     C                   IF        ZTINTK = *ZEROS
     C                   EVAL      *IN30=*ON
     C                   EVAL      *IN33=*ON
     C                   MOVE      'SVE0012'     ZMSGNO
     C                   GOTO      SRBA1
     C                   ENDIF
      *___________________
      * Adda post til  FIL
      *"""""""""""""""""""
     C                   EVAL      YTITRNR=ZTITRNR
     C                   EVAL      YTINTK=ZTINTK
     C                   WRITE     SVG513FR
      *______________________
      * Adda post til  SUBFIL
      *""""""""""""""""""""""
     C                   ADD       1             WRECNO
     C                   EVAL      ZRECNO=WRECNO

     C                   EVAL      OTINTK = *ZEROS
     C     YTITRNR       CHAIN     SVNH05                             54
     C                   IF        *IN54 = *OFF
     C                   EVAL      OTINTK = TINTK
     C                   IF        NINTK > 0
     C                   EVAL      OTINTK=NINTK
     C                   ENDIF
     C                   ENDIF

     C                   WRITE     SVG514DA

     C                   ENDIF

     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Endre                                               SRBB /
      *////////////////////////////////////////////////////////////
     C     SRBB          BEGSR
     C                   EVAL      *IN40=*ON
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ZOP
     C                   UPDATE    SVG514DA
      *____________
      * Flytte felt
      *""""""""""""
     C     YTITRNR       CHAIN(N)  SVG513F                            53
     C                   MOVEA     '00000000'    *IN(30)
     C                   EVAL      ZTITRNR=YTITRNR
     C                   EVAL      ZTINTK=YTINTK

     C     SRBB1         TAG

     C  N30              EVAL      ZMSGNO='SY00000'
     C                   WRITE     SVG514DØ
     C                   EXFMT     SVG514DD
     C                   MOVEA     '00000000'    *IN(30)
     C     *IN12         IFEQ      '0'
      *_______
      * F4=Søk
      *"""""""
     C     *IN04         IFEQ      '1'
     C                   ENDIF
      *____________
      * Teste input-1
      *""""""""""""
      * MRN-nr måste vare utfyllt
     C     ZTITRNR       IFEQ      *BLANKS
     C                   EVAL      *IN30=*ON
     C                   EVAL      *IN31=*ON
     C                   MOVE      'SVX1763'     ZMSGNO
     C                   GOTO      SRBB1
     C                   ENDIF
      * Antal
     C                   IF        ZTINTK = *ZEROS
     C                   EVAL      *IN30=*ON
     C                   EVAL      *IN33=*ON
     C                   MOVE      'SVE0012'     ZMSGNO
     C                   GOTO      SRBB1
     C                   ENDIF
      *______________
      * Oppdatere FIL
      *""""""""""""""
     C     ZTITRNR       CHAIN     SVG513F                            53
     C                   EVAL      YTINTK=ZTINTK
     C                   UPDATE    SVG513FR

     C                   ENDIF

     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Slette                                              SRBD /
      *////////////////////////////////////////////////////////////
     C     SRBD          BEGSR
      *______________
      * Oppdatere FIL
      *""""""""""""""
     C     YTITRNR       CHAIN     SVG513F                            53
     C                   DELETE    SVG513FR
      *_________________
      * Oppdatere SUBFIL
      *"""""""""""""""""
     C                   CLEAR                   SVG514DA
     C                   UPDATE    SVG514DA
     C                   EVAL      *IN95=*ON

     C                   ENDSR
