     FSVIX      UF A E           K DISK
     FSVI032D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    SVIX_SYAV     ZVIX_SYAV
     C     *LIKE         DEFINE    SVIX_SYOP     ZVIX_SYOP
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    ZVIX_SYAV
     C                   PARM                    ZVIX_SYOP
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVIX_KEY      KLIST
     C                   KFLD                    ZVIX_SYAV
     C                   KFLD                    ZVIX_SYOP
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVIX_KEY      CHAIN(N)  SVIX                               90
     C                   EVAL      XVIX_SYAV=ZVIX_SYAV
     C                   EVAL      XVIX_SYOP=ZVIX_SYOP
     C                   EVAL      XVIX_GOD2=SVIX_GOD2
     C                   EVAL      XVIX_GOD3=SVIX_GOD3
     C                   EVAL      XVIX_GOD4=SVIX_GOD4
     C                   EVAL      XVIX_GOD5=SVIX_GOD5
     C                   EVAL      XVIX_GOD6=SVIX_GOD6
     C                   EVAL      XVIX_GOD7=SVIX_GOD7
     C                   EVAL      XVIX_GOD8=SVIX_GOD8
     C                   EVAL      XVIX_GOD9=SVIX_GOD9
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     SVI032DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9

     C     SRB8          TAG
     C     SVIX_KEY      CHAIN     SVIX                               90
     C   90              EVAL      SVIX_SYAV=ZVIX_SYAV
     C   90              EVAL      SVIX_SYOP=ZVIX_SYOP
     C                   EVAL      SVIX_GOD2=XVIX_GOD2
     C                   EVAL      SVIX_GOD3=XVIX_GOD3
     C                   EVAL      SVIX_GOD4=XVIX_GOD4
     C                   EVAL      SVIX_GOD5=XVIX_GOD5
     C                   EVAL      SVIX_GOD6=XVIX_GOD6
     C                   EVAL      SVIX_GOD7=XVIX_GOD7
     C                   EVAL      SVIX_GOD8=XVIX_GOD8
     C                   EVAL      SVIX_GOD9=XVIX_GOD9
     C  N90              UPDATE    SVIXR
     C   90              WRITE     SVIXR

     C     SRB9          TAG
     C                   ENDSR
