     FSVTAR     IF   E             DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
     C   30              READ      SVTAR                                  30
      *________________
      * Arbetsvariablar
      *""""""""""""""""
     C     *LIKE         DEFINE    SVTA_SAT      ZVTA_SAT
      *_________________
      * Input parametere
      *"""""""""""""""""
     C                   CALL      'SVI016R'
     C                   PARM      'NO'          ZVIV_ULKD         2
     C                   PARM      '3923309090'  ZVIV_VATA        10
     C                   PARM      *ZEROS        ZVTA_SAT
     C                   ENDSR
