     FSVIHE     IF   E           K DISK
     D  XVIH_BYTE      S              7S 0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRB
     C                   MOVE      *ON           *INLR
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *LIKE         DEFINE    XVIH_BYTE     UVIH_BYTE
     C     *LIKE         DEFINE    SVIHE_SYA     UVIHE_SYA
     C     *LIKE         DEFINE    SVIHE_SYO     UVIHE_SYO
      * INIT AV ARBEIDSFELT
     C                   EVAL      UVIH_BYTE=0
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UVIHE_SYA
     C                   PARM                    UVIHE_SYO
     C                   PARM                    UVIH_BYTE
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    UVIHE_SYA
     C                   KFLD                    UVIHE_SYO
     C     KEYA          SETLL     SVIHE
     C     KEYA          READE     SVIHE                                  51
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR Les og tell                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     *IN51         DOWEQ     *OFF
     C                   ADD       80            UVIH_BYTE
     C     KEYA          READE     SVIHE                                  51
     C                   ENDDO
     C                   SUB       80            UVIH_BYTE
     C     ' '           CHECKR(E) SVIHE_DTA     XVIH_BYTE
     C                   ADD       XVIH_BYTE     UVIH_BYTE
     C                   ENDSR
