********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 CB  PTF10 Ny logikk vedr. PKI, ikke merket
P11130* 02 CB  PTF11 Møjlighet till fler varuposter helt omskriven
     FSVIH      UF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRC
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UVIH_SYAV
     C                   PARM                    UVIH_SYOP
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    SVIH_SYAV     UVIH_SYAV
     C     *LIKE         DEFINE    SVIH_SYOP     UVIH_SYOP
     C     *LIKE         DEFINE    SVIH_BYTE     UVIH_BYTE
     C     *LIKE         DEFINE    SVIH_SGDK     UVIH_SGDK
     C     *LIKE         DEFINE    SVIH_SGUT     UVIH_SGUT
     C                   MOVE      UVIH_SYAV     WAVD              4
     C                   MOVE      UVIH_SYOP     WOPD              7
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     UKEY          KLIST
     C                   KFLD                    UVIH_SYAV
     C                   KFLD                    UVIH_SYOP
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Lag edifact                                          SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR

      * Lag edifact
     C                   CALL      'SVI022RN'
     C                   PARM                    UVIH_SYAV
     C                   PARM                    UVIH_SYOP
      * Oppdater
     C     UKEY          CHAIN     SVIH                               51
     C                   MOVEL     WDT           SVIH_SGDT
     C     4             SUBST     WTM:1         WTM2              4
     C                   MOVE      WTM2          SVIH_SGDT
     C                   EVAL      SVIH_SYST='S'
     C                   UPDATE    SVIHR

     C                   ENDSR
