     C                   CALL      'SVT014R.N'
     C                   PARM      'I'           UVTA_IE           1
     C                   PARM      '6402919000'  UVTA_VATA        10
     C                   PARM      'NO'          ULK               2
     C                   PARM      '100'         UFOKD             3
     C                   PARM                    UYKOD1            4
     C                   PARM                    UYTXT1          100
     C                   PARM                    UYKOD2            4
     C                   PARM                    UYTXT2          100
     C                   PARM                    UYKOD3            4
     C                   PARM                    UYTXT3          100
     C                   PARM                    UYKOD4            4
     C                   PARM                    UYTXT4          100
     C                   PARM                    UYKOD5            4
     C                   PARM                    UYTXT5          100
     C                   PARM                    UYKOD6            4
     C                   PARM                    UYTXT6          100
     C                   PARM                    UYKOD7            4
     C                   PARM                    UYTXT7          100
     C                   PARM                    UYKOD8            4
     C                   PARM                    UYTXT8          100
     C                   PARM                    UYKOD9            4
     C                   PARM                    UYTXT9          100
     C                   EVAL      *INLR=*ON
