     d wtsat           S             10S 3
     C                   CALL      'SVI303R'
     C                   PARM      '3923309090'  SVTX15_01        10
     C                   PARM      'NO'          LK               10
     C                   PARM      '300 '        FOKD              4
     C                   PARM      0             wtsat
     C                   PARM                    wtfti             2
     C                   PARM                    wtmti             3
     C                   PARM                    wtmuc             3
     C                   EVAL      *INLR=*ON
