     D FROMI           S               D   DATFMT(*ISO)
     D TOI             S               D   DATFMT(*ISO)
     D                 DS
     D D                       1      8
     D DYYYY                   1      4
     D DMM                     5      6
     D DDD                     7      8
     D                 DS
     D E                       1     10
     D EYYYY                   1      4
     D E1                      5      5
     D EMM                     6      7
     D E2                      8      8
     D EDD                     9     10

     C     *ENTRY        PLIST
     C                   PARM                    FROMU             8
     C                   PARM                    TOU               8
     C                   PARM                    DAYS

      * Från datum
     C                   MOVE      FROMU         D
     C                   EVAL      EYYYY = DYYYY
     C                   EVAL      E1    = '-'
     C                   EVAL      EMM   = DMM
     C                   EVAL      E2    = '-'
     C                   EVAL      EDD   = DDD
     C                   MOVE      E             FROMI
      * Til datum
     C                   MOVE      TOU           D
     C                   EVAL      EYYYY = DYYYY
     C                   EVAL      E1    = '-'
     C                   EVAL      EMM   = DMM
     C                   EVAL      E2    = '-'
     C                   EVAL      EDD   = DDD
     C                   MOVE      E             TOI

      * Antal dagar
     C     TOI           SUBDUR    FROMI         DAYS:*D           5 0

     C                   EVAL      *INLR=*ON
