     FSVTVK     IF   E           K DISK
     FSVT007D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  KFTXT                  1     50
     D  XFTXT                  1     30
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     *LOVAL        SETLL     SVTVK
     C                   READ      SVTVK                                  94
     C     *IN94         DOWEQ     *OFF
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      SVTVK                                  94
     C  N94              ENDDO
      *
     C     ZRECNO        IFGT      1
     C                   Z-ADD     1             ZRECNO
     C                   ENDIF
     C                   MOVE      *BLANKS       W2SØK
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVE      '1'           *IN29
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
      *
      *** BLA VIDERE
     C   25              GOTO      START3
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVEL     SVVK_KD       UKD
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKD              10
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
