     FSVTX10F   IF   E           K DISK
     FSVTX10L1  IF   E           K DISK
     F                                     RENAME(SVTX10R:SVTX102)
     FSVT004D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  SVTX10_01              1     10
     D  XVATA4                 1      4
     D  XVATA34                3      4
     D  XVATA6                 5     10
     D                 DS
     D  WDT                    1      8
     D  WDTY                   1      4
     D  WDTM                   5      6
     D  WDTD                   7      8
     D                 DS
     D  WD                     1     10
     D  WDY                    1      4
     D  WD1                    5      5
     D  WDM                    6      7
     D  WD2                    8      8
     D  WDD                    9     10

     C                   EXSR      INIT

     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W2SØK2        IFEQ      *BLANKS
     C                   MOVEL     W2SØK1        WSOK256         256
     C     WSOK256       SETLL     SVTX10L1
     C                   READ      SVTX10L1                               94
     C                   ELSE
     C                   MOVE      '0000000000'  SVTX10FK         10
     C                   MOVEL     W2SØK2        SVTX10FK
     C     SVTX10FK      SETLL     SVTX10F
     C                   READ      SVTX10F                                94
     C                   END
     C     *IN94         DOWEQ     *OFF

     C     SVTX10_03     IFLE      WD
     C     SVTX10_02     ANDGE     WD
     C     XVATA6        ANDEQ     '000000'
     C     XVATA34       ANDNE     '00'
     C                   MOVEL     SVTX10_31     SVTX10_315
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   ENDIF

     C     W2SØK2        IFEQ      *BLANKS
     C                   READ      SVTX10L1                               94
     C                   ELSE
     C                   READ      SVTX10F                                94
     C                   END
     C  N94              ENDDO

     C     ZRECNO        IFGT      1
     C                   Z-ADD     1             ZRECNO
     C                   ENDIF
     C     W2SØK1        IFNE      *BLANKS
     C     W2SØK2        ORNE      *BLANKS
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   ELSE
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   ENDIF
     C                   MOVE      *BLANKS       W2SØK1
     C                   MOVE      *BLANKS       W2SØK2
     C                   MOVE      '1'           *IN29

     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END

     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
     C   05              GOTO      START

     C   25              GOTO      START3

     C     W2SØK1        CABNE     *BLANKS       START
     C     W2SØK2        CABNE     *BLANKS       START

     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C     UFLAGG        CABEQ     1             START3
     C                   GOTO      SLUTT
     C                   END

     C     SLUTT         TAG
     C                   SETON                                        LR
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   CALL      'SVT005R'
     C                   PARM      SVTX10_01     UVATA
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    UIE
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30

     C     SLHENT        ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UVATA            10
     C                   PARM                    UDATO             8
     C                   PARM                    UIE               1

     C     UVATA         IFNE      *ZEROS
     C                   MOVEL     UVATA         UVATA4            4
     C                   MOVE      UVATA4        UVATA2            2
     C     UVATA2        IFNE      *ZEROS
     C                   CALL      'SVT005R'
     C                   PARM                    UVATA
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    UIE
     C     UFLAGG        IFNE      1
     C                   SETON                                        LR
     C                   RETURN
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   MOVEL     UVATA         W2SØK2

     C                   WRITE     WINDOWSZ
      * Hent dagens dato
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   EVAL      WD1='-'
     C                   EVAL      WD2='-'
     C                   EVAL      WDY=WDTY
     C                   EVAL      WDM=WDTM
     C                   EVAL      WDD=WDTD
     C                   ENDSR
