     FSVTX03L1  IF   E           K DISK
     FSVTX03L2  IF   E           K DISK
     F                                     RENAME(SVTX03R:SVTX032)
     FKOFAST    IF   E           K DISK
     FSVT003D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  KFTXT                  1     50
     D  XFTXT                  1     30
     D                 DS
     D  WDT                    1      8
     D  WDTY                   1      4
     D  WDTM                   5      6
     D  WDTD                   7      8
     D                 DS
     D  WD                     1     10
     D  WDY                    1      4
     D  WD1                    5      5
     D  WDM                    6      7
     D  WD2                    8      8
     D  WDD                    9     10

     C                   EXSR      INIT

     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C                   MOVEL     W2SØK2        W2SØK256        256
     C     W2SØK1        COMP      *BLANKS                            21
     C   21SVTX03K1      SETLL     SVTX03L2
     C  N21SVTX03K2      SETLL     SVTX03L1
     C   21UTYP          READE     SVTX03L2                               94
     C  N21UTYP          READE     SVTX03L1                               94

     C     *IN94         DOWEQ     *OFF

     C     SVTX03_01     IFEQ      'A'
     C     SVTX03_01     OREQ      UIE

     C     SVTX03_06     IFLE      WD
     C     SVTX03_05     ANDGE     WD

     C                   MOVEL     SVTX03_04     WVTX03_04
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL

     C                   ENDIF
     C                   ENDIF

     C   21UTYP          READE     SVTX03L2                               94
     C  N21UTYP          READE     SVTX03L1                               94
     C  N94              ENDDO

     C     ZRECNO        IFGT      1
     C                   Z-ADD     1             ZRECNO
     C                   ENDIF
     C                   MOVE      *BLANKS       W2SØK2
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVE      '1'           *IN29

     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END

     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
     C   05              GOTO      START
     C   25              GOTO      START3

     C     W2SØK1        CABNE     *BLANKS       START
     C     W2SØK2        CABNE     *BLANKS       START

     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END

     C     SLUTT         TAG
     C                   SETON                                        LR
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVEL     SVTX03_03     UKD
     C                   GOTO      SLHENT
     C                   END
     C                   END

     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30

     C     SLHENT        ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KFKEY         KLIST
     C                   KFLD                    KFTYP
     C                   KFLD                    KFKOD
     C     SVTX03K1      KLIST
     C                   KFLD                    UTYP
     C                   KFLD                    W2SØK1
     C     SVTX03K2      KLIST
     C                   KFLD                    UTYP
     C                   KFLD                    W2SØK256

     C     *ENTRY        PLIST
     C                   PARM                    UTYP              3
     C                   PARM                    UIE               1
     C                   PARM                    UDATO             8
     C                   PARM                    UKD              10

     C                   EVAL      UKD = *BLANKS
     C                   MOVEL     'SVTULL1'     KFTYP
     C                   MOVEL     UTYP          KFKOD
     C     KFKEY         CHAIN     KOFAST                             33

     C                   MOVE      UDATO         XDATO             8 0
      * Hent dagens dato
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   EVAL      WD1='-'
     C                   EVAL      WD2='-'
     C                   EVAL      WDY=WDTY
     C                   EVAL      WDM=WDTM
     C                   EVAL      WDD=WDTD

     C                   WRITE     WINDOWSZ

     C                   ENDSR
