     FEDIRE1K   UF   E           K DISK
     FSVTAR2    UF A E           K DISK
      *
     D TABIN           S              1    DIM(29) CTDATA PERRCD(1)
     D TABUT           S              1    DIM(29) ALT(TABIN)
      *____________________
      * DS for input string
      *""""""""""""""""""""
     D                 DS
     D  RDATA                  1   1024
     D  TIN                    1    265    DIM(265)
     D  SVTA_TYPE              1      1
     D  SVTA_RT               10     12
     D                 DS
     D  T200                   1    200
     D  TB200                  1    200    DIM(200)
      *____________________
      * POSTTYPE = A
      *""""""""""""""""""""
     D                 DS
     D  SVTB_POST              1    265
     D  SVTB_TYPE              1      1
     D  SVTB_ST                2      2
     D  SVTB_IE                3      3
     D  SVTB_VATA              4     13
     D  SVTB_SDTS             14     21
     D  SVTB_SDTE             22     29
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  SRB                                                  SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     *IN51         DOWEQ     '0'
      *
      * UPCASE
     C     1             DO        265           XN                3 0
     C     TIN(XN)       LOOKUP    TABIN         TABUT                    33
     C                   IF        *IN33
     C                   MOVE      TABUT         TIN(XN)
     C                   ENDIF
     C                   ENDDO
      *
     C                   SELECT
     C                   WHEN      XPOSTTYPE = 'A'
     C                   EXSR      SRPA
     C                   ENDSL
     C                   DELETE    EDIRER
N01  C     WMBR          READE     EDIRE1K                                51
     C  N51              ENDDO
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *________________
      * Input parameter
      *""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    WMBR             10
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      'J'           XINIT             1
      *                                                                         Test character
      * Test vilken type fil
     C     WMBR          SETLL     EDIRE1K
     C     WMBR          READE     EDIRE1K                                51
     C                   SELECT
     C                   WHEN      ((SVTA_RT = '_KA') OR
     C                              (SVTA_RT = '_DA'))
     C                   MOVE      'A'           XPOSTTYPE         1
     C                   ENDSL
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  SRPA                                                SRPB /
      *////////////////////////////////////////////////////////////
     C     SRPA          BEGSR
      *
     C                   EVAL      SVTB_POST = RDATA
     C     SVTA_TYPE     IFEQ      'A'
     C     SVTA_IE       ANDEQ     'E'
      *
     C     SVTB_ST       IFEQ      'D'
     C     SVTB_ST       OREQ      'U'
     C                   GOTO      SLSRPB
     C                   ENDIF
      *
     C     SVTB_SDTE     IFEQ      *BLANKS
     C     SVTB_SDTE     ORGT      WDT
      *
     C     SVTB_VATA     CHAIN(N)  SVTAR2                             33
      *
     C                   IF        *IN33
     C                   CLEAR                   SVTARR
     C                   EVAL      SVTA_IE = SVTB_IE
     C                   EVAL      SVTA_VATA = SVTB_VATA
     C                   EVAL      SVTA_MTI = '467'
     C                   EVAL      SVTA_RG = '1008'
     C                   EVAL      SVTA_SEKV = 1
      *
     C                   MOVEL     SVTB_SDTS     SVTA_DTS
     C     SVTB_SDTE     IFEQ      *BLANKS
     C                   EVAL      SVTA_DTE = 99999999
     C                   ELSE
     C                   MOVE      SVTB_SDTE     SVTA_DTE
     C                   ENDIF
     C     SVTB_SDTS     IFEQ      *BLANKS
     C                   MOVE      *ZEROS        SVTA_SDTS
     C                   ELSE
     C                   MOVE      SVTB_SDTS     SVTA_SDTS
     C                   ENDIF
     C     SVTB_SDTE     IFEQ      *BLANKS
     C     SVTA_SDTS     IFEQ      0
     C                   MOVE      *ZEROS        SVTA_SDTE
     C                   ELSE
     C                   MOVE      99999999      SVTA_SDTE
     C                   ENDIF
     C                   ELSE
     C                   MOVE      SVTB_SDTE     SVTA_SDTE
     C                   ENDIF
      *
     C                   WRITE     SVTARR
      *
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
     C     SLSRPB        ENDSR
**
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
Ê∆
¯ÿ
Â≈
