     FSVTLV1    IF   E           K DISK
     FSVT059D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *____
      * Inz
      *""""
     C     *ENTRY        PLIST
     C                   PARM                    UVLV_KD
     C     *LIKE         DEFINE    SVLV_KD       UVLV_KD
     C                   MOVEL     *BLANKS       UVLV_KD
     C                   MOVEL     *BLANKS       WVLV_KD
      *______________
      * Clear Subfile
      *""""""""""""""
     C     START1        TAG

     C                   MOVE      '1'           *IN93
     C                   MOVE      *BLANKS       SFNR
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WVLV_KD       SETLL     SVTLV1
     C                   READ(N)   SVTLV1                                 94

     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      SVTLV1                                 94
     C  N94              ENDDO
     C                   Z-ADD     1             ZRECNO
      *________________
      * Display Subfile
      *""""""""""""""""
     C     START2        TAG

     C                   MOVE      *OFF          *IN51
     C                   MOVEA     '11'          *IN(91)
      * KOMMER HIT VED TOM FIL
     C     ZRECNO        IFEQ      0
     C                   MOVE      *OFF          *IN94
     C                   ADD       1             ZRECNO
     C                   MOVE      *ON           *IN51
     C                   WRITE     SUBFIL
     C                   SETON                                        94
     C                   ENDIF
     C                   WRITE     WIND01
     C                   WRITE     BUNN
     C     STBUNN        TAG

     C                   MOVEL     *BLANKS       WVLV_KD
     C                   EXFMT     SUBCTL

     C                   SETOFF                                       999830
      * FORRIGE
     C   12              GOTO      SLUTT

     C     ZRECNO        IFNE      0
     C                   MOVE      *OFF          *IN98
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C                   ENDDO
     C     SFNR          IFEQ      '1'
     C                   MOVE      SVLV_KD       UVLV_KD
     C                   GOTO      SLUTT
     C                   ENDIF
     C                   ENDIF
     C     WVLV_KD       CABNE     *BLANKS       START1
     C                   GOTO      START2
      *
     C     SLUTT         TAG
      *
     C                   SETON                                        LR
     C                   RETURN
