     FEDIRE1K   IF   E           K DISK
     FSVTX20F   UF A E             DISK

     D  A              C                   '<meursingHeading '
     D  B              C                   '<meursingHeadingFootnote+
     D                                       Association '
     D  C              C                   '<meursingHeadingText '
     D  D              C                   '</meursingHeading>'

     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     C     *ENTRY        PLIST
     C                   PARM                    ULIB             10
     C                   PARM                    UFILE            10
     C                   PARM                    UMBR             10

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C     UMBR          SETLL     EDIRE1K
     C     UMBR          READE     EDIRE1K                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX20R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C                   WHEN      *IN44
     C
     C                   EVAL      WDT10=SVTX20_05
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX20R
     C                   ENDIF
     C                   ENDSL

     C     UMBR          READE     EDIRE1K                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les <meursingHeading                                     XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'ingNumber="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'blePlanId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'olumnCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX20_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_06=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX20_05=*BLANKS
     C                   EVAL      SVTX20_05='9999-12-31'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <meursingHeadingFootnoteAssociation                  XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR

     C                   IF        SVTX20_11=*BLANKS

     C     'ootnoteId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_11=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'noteType="'  SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       10            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_12=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX20_13=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX20_14=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX20_13=*BLANKS
     C                   EVAL      SVTX20_13='9999-12-31'
     C                   ENDIF
     C
     C                   EVAL      WDT10=SVTX20_13
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      SVTX20_11=*BLANKS
     C                   EVAL      SVTX20_12=*BLANKS
     C                   EVAL      SVTX20_13=*BLANKS
     C                   EVAL      SVTX20_14=*BLANKS
     C                   ENDIF
     C
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <meursingHeadingText                                 XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C                   MOVE      *BLANKS       W21             256
     C                   MOVE      *BLANKS       W22               2

     C     'scription="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C  N21              EVAL      Y=999
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W21=%SUBST(RDATA :X:Z)
     C                   EVAL      STRINGIN=*BLANKS
     C                   EVAL      STRINGOUT=*BLANKS
     C                   EVAL      STRINGIN=W21
     C                   EVAL      STRINGOUT=*BLANKS
     C                   CALL      'CVTU8SE'
     C                   PARM                    STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   EVAL      W21=*BLANKS
     C                   EVAL      W21=STRINGOUT
     C                   ENDIF
     C                   ENDIF

     C     'anguageId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W22=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W22='SV' or W22=*BLANKS
     C                   EVAL      SVTX20_21=W21
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX20F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX20R
     C                   READ      SVTX20F                                51
     C                   ENDDO
     C                   ENDSR
