     FEDIRE1K   IF   E           K DISK
     FSVTX11F   UF A E             DISK

     D  A              C                   '<lookupTable '
     D  B              C                   '<lookupTableItem '
     D  C              C                   '<lookupTableDescription '
     D  D              C                   '</lookupTable>'

     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     C     *ENTRY        PLIST
     C                   PARM                    ULIB             10
     C                   PARM                    UFILE            10
     C                   PARM                    UMBR             10

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C     UMBR          SETLL     EDIRE1K
     C     UMBR          READE     EDIRE1K                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX11R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C                   WHEN      *IN44
     C
     C                   EVAL      WDT10=SVTX11_05
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX11R
     C                   ENDIF
     C                   ENDSL

     C     UMBR          READE     EDIRE1K                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les <lookupTable                                         XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'terpolate="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'xInterval="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'nInterval="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'SID="'       SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       5             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX11_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_06=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'tableId="'   SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_07=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'hangeType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX11_08=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX11_05=*BLANKS
     C                   EVAL      SVTX11_05='9999-12-31'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <lookupTableItem                                     XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR

     C                   MOVE      *BLANKS       W11               9
     C                   MOVE      *BLANKS       W12               9

     C     'threshold="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W11=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'value="'     SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       7             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W12=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX11_13A=*BLANKS
     C                   EVAL      SVTX11_13A=W11
     C                   EVAL      SVTX11_14A=W12
     C                   WHEN      SVTX11_13B=*BLANKS
     C                   EVAL      SVTX11_13B=W11
     C                   EVAL      SVTX11_14B=W12
     C                   WHEN      SVTX11_13C=*BLANKS
     C                   EVAL      SVTX11_13C=W11
     C                   EVAL      SVTX11_14D=W12
     C                   WHEN      SVTX11_13D=*BLANKS
     C                   EVAL      SVTX11_13E=W11
     C                   EVAL      SVTX11_14E=W12
     C                   WHEN      SVTX11_13F=*BLANKS
     C                   EVAL      SVTX11_13F=W11
     C                   EVAL      SVTX11_14G=W12
     C                   WHEN      SVTX11_13G=*BLANKS
     C                   EVAL      SVTX11_13H=W11
     C                   EVAL      SVTX11_14H=W12
     C                   WHEN      SVTX11_13I=*BLANKS
     C                   EVAL      SVTX11_13I=W11
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Les <lookupTableDescription                              XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C                   MOVE      *BLANKS       W21             256
     C                   MOVE      *BLANKS       W22               2

     C     'scription="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C  N21              EVAL      Y=999
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W21=%SUBST(RDATA :X:Z)
     C                   EVAL      STRINGIN=*BLANKS
     C                   EVAL      STRINGOUT=*BLANKS
     C                   EVAL      STRINGIN=W21
     C                   EVAL      STRINGOUT=*BLANKS
     C                   CALL      'CVTU8SE'
     C                   PARM                    STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   EVAL      W21=*BLANKS
     C                   EVAL      W21=STRINGOUT
     C                   ENDIF
     C                   ENDIF

     C     'anguageId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W22=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX11_09=*BLANKS
     C                   EVAL      SVTX11_09=W21
     C                   EVAL      SVTX11_10=W22
     C                   WHEN      SVTX11_11=*BLANKS
     C                   EVAL      SVTX11_11=W21
     C                   EVAL      SVTX11_12=W22
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX11F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX11R
     C                   READ      SVTX11F                                51
     C                   ENDDO
     C                   ENDSR
