     FEDIRE1K   IF   E           K DISK
     FSVTX10F   UF A E             DISK

     D  A              C                   '<goodsNomenclature '
     D  B              C                   '<goodsNomenclatureIndent '
     D  C              C                   '<goodsNomenclatureDescriptionPerio+
     D                                      d '
     D  D              C                   '<goodsNomenclatureDescription '
     D  E              C                   '<goodsNomenclatureFootnoteAssociati+
     D                                      on '
     D  F              C                   '<goodsNomenclatureGroupMembership '
     D  G              C                   '</goodsNomenclature>'
     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     C     *ENTRY        PLIST
     C                   PARM                    ULIB             10
     C                   PARM                    UFILE            10
     C                   PARM                    UMBR             10
     C

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C     UMBR          SETLL     EDIRE1K
     C     UMBR          READE     EDIRE1K                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C     E             SCAN      RDATA                                  45
     C     F             SCAN      RDATA                                  46
     C     G             SCAN      RDATA                                  47
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX10R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C                   WHEN      *IN44
     C                   EXSR      XML5
     C                   WHEN      *IN45
     C                   EXSR      XML6
     C                   WHEN      *IN46
     C                   EXSR      XML7
     C
     C                   WHEN      *IN47
     C
     C                   EVAL      WDT10=SVTX10_02
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX10R
     C                   ENDIF
     C                   ENDSL

     C     UMBR          READE     EDIRE1K                                51
     C                   ENDDO
     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les >goodsNomenclature                                   XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'atureCode="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX10_02=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF


     C     'ineSuffix="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'Indicator="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_07=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX10_02=*BLANKS
     C                   EVAL      SVTX10_02='9999-12-31'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >goodsNomenclatureIndent                             XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR

     C                   MOVE      *BLANKS       W14              10

     C     'tyIndents="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_12=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W14=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W14=*BLANKS
     C                   EVAL      W14='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W14
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      SVTX10_12=*BLANKS
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >goodsNomenclatureDescriptionPeriod                  XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C                   MOVE      *BLANKS       W23              10

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W23=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W23=*BLANKS
     C                   EVAL      W23='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W23
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C                   ENDSR
      *______________________________________________________________
      * Les >goodsNomenclatureDescription                        XML5
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML5          BEGSR
     C                   MOVE      *BLANKS       W31             256
     C                   MOVE      *BLANKS       W32               2
     C                   MOVE      *BLANKS       W33               1

     C     WDT08         IFGE      WDT

     C     'scription="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C  N21              EVAL      Y=999
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W31=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'anguageId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W32=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   EVAL      STRINGIN=*BLANKS
     C                   EVAL      STRINGIN=W31
     C                   EVAL      STRINGOUT=*BLANKS
     C                   CALL      'CVTU8SE'
     C                   PARM                    STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   EVAL      W31=*BLANKS
     C                   EVAL      W31=STRINGOUT

     C                   IF        W32='SV' or W32=*BLANKS
     C                   EVAL      SVTX10_31=W31
     C                   ENDIF

     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >goodsNomenclatureFootnoteAssociation                XML6
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML6          BEGSR

     C                   MOVE      *BLANKS       W41              10

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W41=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'ootnoteId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_43=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'tnoteType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX10_44=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W41=*BLANKS
     C                   EVAL      W41='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W41
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      SVTX10_43=*BLANKS
     C                   EVAL      SVTX10_44=*BLANKS
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les >goodsNomenclatureGroupMembership                    XML7
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML7          BEGSR
     C                   MOVE      *BLANKS       W52              10
     C                   MOVE      *BLANKS       W53               6
     C                   MOVE      *BLANKS       W54               1
     C                   MOVE      *BLANKS       W55               1

     C     'dateEnd="'   SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W52=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'reGroupId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W53=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'GroupType="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W54=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W52=*BLANKS
     C                   EVAL      W52='9999-12-31'
     C                   ENDIF

     C                   EVAL      WDT10=W52
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      W53=*BLANKS
     C                   EVAL      W54=*BLANKS
     C                   ENDIF

     C                   SELECT
     C                   WHEN      SVTX10_53A=*BLANKS
     C                   EVAL      SVTX10_53A=W53
     C                   EVAL      SVTX10_54A=W54
     C                   WHEN      SVTX10_53B=*BLANKS
     C                   EVAL      SVTX10_53B=W53
     C                   EVAL      SVTX10_54B=W54
     C                   ENDSL

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR
     C                   READ      SVTX10F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX10R
     C                   READ      SVTX10F                                51
     C                   ENDDO
     C                   ENDSR
