     FEDIRE1K   IF   E           K DISK
     FSVTX08F   UF A E           K DISK
     FSVTX08F2  UF A E           K DISK
     FSVTLK     UF A E           K DISK

     D  A              C                   '<geographicalArea '
     D  B              C                   '<geographicalAreaMembership '
     D  C              C                   '<geographicalAreaDescriptionPeriod '
     D  D              C                   '<geographicalAreaDescription '
     D  E              C                   '</geographicalArea>'

     D                 DS
     D  WDT10                  1     10
     D  WDT10Y                 1      4
     D  WDT10M                 6      7
     D  WDT10D                 9     10
     D                 DS
     D  WDT08                  1      8
     D  WDT08Y                 1      4
     D  WDT08M                 5      6
     D  WDT08D                 7      8

     C     *ENTRY        PLIST
     C                   PARM                    ULIB             10
     C                   PARM                    UFILE            10
     C                   PARM                    UMBR             10

     C                   EXSR      SLETT

     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6

     C     UMBR          SETLL     EDIRE1K
     C     UMBR          READE     EDIRE1K                                51
     C     *IN51         DOWEQ     *OFF

     C     A             SCAN      RDATA                                  41
     C     B             SCAN      RDATA                                  42
     C     C             SCAN      RDATA                                  43
     C     D             SCAN      RDATA                                  44
     C     E             SCAN      RDATA                                  45
     C
     C                   SELECT
     C                   WHEN      *IN41
     C                   CLEAR                   SVTX08R
     C                   EXSR      XML2
     C                   WHEN      *IN42
     C                   EXSR      XML3
     C                   WHEN      *IN43
     C                   EXSR      XML4
     C                   WHEN      *IN44
     C                   EXSR      XML5
     C                   WHEN      *IN45
     C
     C                   EVAL      WDT10=SVTX08_04
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT
     C                   WRITE     SVTX08R
     C                   ENDIF
     C                   ENDSL

     C     UMBR          READE     EDIRE1K                                51
     C                   ENDDO

     C                   EXSR      UPPDAT

     C                   EVAL      *INLR=*ON
      *______________________________________________________________
      * Les <geographicalArea                                    XML2
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML2          BEGSR

     C     'calAreaId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX08_01=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'SID="'       SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       5             X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX08_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX08_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX08_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX08_04=*BLANKS
     C                   EVAL      SVTX08_04='9999-12-31'
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <geographicalAreaMembership                          XML3
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML3          BEGSR

     C                   CLEAR                   SVTX082R

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      SVTX082_04=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'dateStart="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX082_05=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C     'AreaGroup="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      SVTX082_03=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        SVTX082_04=*BLANKS
     C                   EVAL      SVTX082_04='9999-12-31'
     C                   ENDIF
     C
     C                   EVAL      WDT10=SVTX082_04
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFGE      WDT

     C                   EVAL      SVTX082_01=SVTX08_01
     C                   WRITE     SVTX082R

     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <geographicalAreaDescriptionPeriod                   XML4
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML4          BEGSR

     C                   MOVE      *BLANKS       W13              10

     C     'dateEnd="'   SCAN      RDATA         X                 3 0    20
     C                   IF        *IN20
     C                   ADD       9             X
     C     '"'           SCAN      RDATA :X      Y                 3 0    21
     C                   IF        *IN20
     C     Y             SUB       X             Z                 3 0
     C                   EVAL      W13=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W13=*BLANKS
     C                   EVAL      W13='9999-12-31'
     C                   ENDIF
     C
     C                   EVAL      WDT10=W13
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D

     C     WDT08         IFLT      WDT
     C                   EVAL      W13=*BLANKS
     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Les <geographicalAreaDescription                         XML5
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     XML5          BEGSR

     C                   MOVE      *BLANKS       W21             256
     C                   MOVE      *BLANKS       W22               2

     C     WDT08         IFGE      WDT

     C     'scription="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C  N21              EVAL      Y=999
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W21=%SUBST(RDATA :X:Z)
     C                   EVAL      STRINGIN=*BLANKS
     C                   EVAL      STRINGOUT=*BLANKS
     C                   EVAL      STRINGIN=W21
     C                   EVAL      STRINGOUT=*BLANKS
     C                   CALL      'CVTU8SE'
     C                   PARM                    STRINGIN      30000
     C                   PARM                    STRINGOUT     30000
     C                   EVAL      W21=*BLANKS
     C                   EVAL      W21=STRINGOUT
     C                   ENDIF
     C                   ENDIF

     C     'anguageId="' SCAN      RDATA         X                        20
     C                   IF        *IN20
     C                   ADD       11            X
     C     '"'           SCAN      RDATA :X      Y                        21
     C                   IF        *IN20
     C     Y             SUB       X             Z
     C                   EVAL      W22=%SUBST(RDATA :X:Z)
     C                   ENDIF
     C                   ENDIF

     C                   IF        W22='SV' or W22='  '
     C                   EVAL      SVTX08_02=W21
     C                   ENDIF

     C                   ENDIF

     C                   ENDSR
      *______________________________________________________________
      * Slett alle poster i filen                               SLETT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SLETT         BEGSR

     C                   READ      SVTX08F                                51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX08R
     C                   READ      SVTX08F                                51
     C                   ENDDO

     C                   EVAL      *IN51=*OFF
     C                   READ      SVTX08F2                               51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTX082R
     C                   READ      SVTX08F2                               51
     C                   ENDDO

     C                   EVAL      *IN51=*OFF
     C                   READ      SVTLK                                  51
     C                   DOW       *IN51 = *OFF
     C                   DELETE    SVTLKR
     C                   READ      SVTLK                                  51
     C                   ENDDO

     C                   ENDSR
      *______________________________________________________________
      * Uppdatera landgrupp                                    UPPDAT
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     UPPDAT        BEGSR
     C                   EVAL      *IN51=*OFF
     C     *LOVAL        SETLL     SVTX08F2
     C                   READ      SVTX08F2                               51
     C                   DOW       *IN51 = *OFF
     C     SVTX082_03    CHAIN     SVTX08F                            52
     C                   IF        *IN52=*OFF
     C                   EVAL      SVTX082_02=SVTX08_01
     C                   UPDATE    SVTX082R
     C                   ENDIF
     C                   READ      SVTX08F2                               51
     C                   ENDDO

     C                   EVAL      *IN51=*OFF
     C     *LOVAL        SETLL     SVTX08F2
     C                   READ(N)   SVTX08F2                               51
     C                   DOW       *IN51 = *OFF
     C                   CLEAR                   SVTLKR
     C                   MOVEL     SVTX082_01    SVLK_LK
     C                   MOVEL     SVTX082_02    SVLK_RG
     C                   EVAL      WDT10=SVTX082_05
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D
     C                   MOVEL     WDT08         SVLK_DTS
     C                   MOVEL     WDT08         SVLK_SDTS
     C                   EVAL      WDT10=SVTX082_04
     C                   EVAL      WDT08Y=WDT10Y
     C                   EVAL      WDT08M=WDT10M
     C                   EVAL      WDT08D=WDT10D
     C                   MOVEL     WDT08         SVLK_DTE
     C                   MOVEL     WDT08         SVLK_SDTE
     C                   WRITE     SVTLKR
     C                   READ(N)   SVTX08F2                               51
     C                   ENDDO

     C                   ENDSR
