     FSVTARQ    IF   E             DISK
     F                                     RENAME(SVTARR:SVTARRQ)
     FSVTAVQ    IF   E             DISK
     F                                     RENAME(SVTAVR:SVTAVRQ)
     FSVTKDQ    IF   E             DISK
     F                                     RENAME(SVTKDR:SVTKDRQ)
     FSVTLKQ    IF   E             DISK
     F                                     RENAME(SVTLKR:SVTLKRQ)
     FSVTPROQ   IF   E             DISK
     F                                     RENAME(SVTPROR:SVTPRORQ)
     FSVTVKQ    IF   E             DISK
     F                                     RENAME(SVTVKR:SVTAVKQ)
     FSVTVSQ    IF   E             DISK
     F                                     RENAME(SVTVSR:SVTAVSQ)
     FSVTAR     O  A E             DISK
     FSVTAV     O  A E             DISK
     FSVTKD     O  A E             DISK
     FSVTLK     O  A E             DISK
     FSVTPRO    O  A E             DISK
     FSVTVK     O  A E             DISK
     FSVTVS     O  A E             DISK

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTARQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTARR
     C                   READ      SVTARQ                                 94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTAVQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTAVR
     C                   READ      SVTAVQ                                 94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTKDQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTKDR
     C                   READ      SVTKDQ                                 94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTLKQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTLKR
     C                   READ      SVTLKQ                                 94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTPROQ                                94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTPROR
     C                   READ      SVTPROQ                                94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTVKQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTVKR
     C                   READ      SVTVKQ                                 94
     C  N94              ENDDO

     C                   EVAL      *IN94=*OFF
     C                   READ      SVTVSQ                                 94
     C     *IN94         DOWEQ     '0'
     C                   WRITE     SVTVSR
     C                   READ      SVTVSQ                                 94
     C  N94              ENDDO

     C                   EVAL      *INLR=*ON
