     FSVUH      UF   E           K DISK
     FSVU002P   O    E             PRINTER USROPN
     FFIRM      IF   E             DISK
     FFIRMARC   IF   E           K DISK
     FARKIVP    O  A E           K DISK
     FARKTXT    IF   E           K DISK
     D                SDS
     D  ZUSER                254    263
      * INPUT PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    WDOC_1004        10
     C                   PARM                    CALLTYP           1
      * Hente firmaopplysninger fra spedisjon
     C                   READ      FIRM
      * Hente dato/tid
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      * Ev. overstyring til Arkiv ?
     C                   IF        CALLTYP='A'
     C                   CALL      'SVU002CA'
     C                   ENDIF

     C                   OPEN      SVU002P

     C     WDOC_1004     CHAIN     SVUH                               51
     C                   IF        *IN51=*OFF
     C                   EVAL      SVUH_ST='P'
     C                   UPDATE    SVUHR
     C                   EVAL      WDTM_2380B=DTM_2380B
     C                   IF        PAC_7064A=*BLANKS
     C                   EVAL      PAC_7064A=PAC_70641
     C                   ENDIF
     C                   IF        PAC_7064B=*BLANKS
     C                   EVAL      PAC_7064B=PAC_70642
     C                   ENDIF
     C                   IF        PAC_7064C=*BLANKS
     C                   EVAL      PAC_7064C=PAC_70643
     C                   ENDIF
     C                   IF        PAC_7064D=*BLANKS
     C                   EVAL      PAC_7064D=PAC_70644
     C                   ENDIF
     C                   IF        PAC_7064E=*BLANKS
     C                   EVAL      PAC_7064E=PAC_70645
     C                   ENDIF
     C                   IF        PAC_7064F=*BLANKS
     C                   EVAL      PAC_7064F=PAC_70646
     C                   ENDIF
     C                   IF        PAC_7064G=*BLANKS
     C                   EVAL      PAC_7064G=PAC_70647
     C                   ENDIF
     C                   IF        PAC_7064H=*BLANKS
     C                   EVAL      PAC_7064H=PAC_70648
     C                   ENDIF
     C                   WRITE     SVU002PA
     C                   ENDIF
     C                   IF        CALLTYP='C'
     C                   EXSR      ARKSR
     C                   ENDIF
     C                   EVAL      *INLR=*ON
      ***********************************************
     C     ARKSR         BEGSR
      ***********************************************
     C                   MOVE      'UT'          ARTYPE
     C     FIFIRM        CHAIN     FIRMARC                            34
     C  N34ARTYPE        CHAIN     ARKTXT                             34
     C     *IN(34)       IFEQ      '0'
     C     ARKJN         ANDEQ     'J'
      *
     C                   CLEAR                   ARKIVR
     C                   MOVE      'UT'          ARTYPE
     C                   MOVE      FIFIRM        ARFIRM
     C                   MOVE      WDT           ARDATE
     C                   MOVE      WTM           ARTIME
     C                   MOVE      ZUSER         ARUSER
     C                   MOVEL     WDOC_1004     ARUNDE
     C                   WRITE     ARKIVR
      *_________________________
      * Aktivera arkivfunktionen
      *"""""""""""""""""""""""""
     C                   CALL      'ARC002CLB'
     C                   PARM      'UT'          WATYPE            2
     C                   PARM                    ARUSER
     C                   END
     C                   ENDSR
