********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 IKKE ALLOKERE REKORD
********************************************************************
      *
      ************************************************************
      *** PROGRAM SKAL ENDRE STATUS PÅ EL. TRANSITT            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 27-29 31-59 61-92                 ***
      ************************************************************
      *
     FSVTHA     IF   E           K DISK
     FSVXH      UF   E           K DISK
     FSTS       UF A E           K DISK
     FSVX015D   CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  THDTÅ                  1      4  0
     D  THDTM                  5      6  0
     D  THDTD                  7      8  0
     D  THDT                   1      8  0
     D                 DS
     D  WSTRDD                 1      2  0
     D  WSTRDM                 3      4  0
     D  WSTRDÅ                 5      6  0
     D  WSTRDT                 1      6  0
     D                 DS
     D  THTRDÅ                 1      4  0
     D  THTRDM                 5      6  0
     D  THTRDD                 7      8  0
     D  THTRDT                 1      8  0
     D                 DS
     D  WSDDTD                 1      2  0
     D  WSDDTM                 3      4  0
     D  WSDDTÅ                 5      6  0
     D  WSDDT                  1      6  0
     D                 DS
     D  THDDTÅ                 1      4  0
     D  THDDTM                 5      6  0
     D  THDDTD                 7      8  0
     D  THDDT                  1      8  0
     D                 DS
     D  WSDDKD                 1      2  0
     D  WSDDKM                 3      4  0
     D  WSDDKÅ                 5      6  0
     D  WSDDTK                 1      6  0
     D                 DS
     D  THDDKÅ                 1      4  0
     D  THDDKM                 5      6  0
     D  THDDKD                 7      8  0
     D  THDDTK                 1      8  0
     D                 DS
     D  THTSN1                 1     35
     D  WSTSN1                 1     30
     D                 DS
     D  THTSN2                 1     35
     D  WSTSN2                 1     30
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     SVX015D01
     C                   SETOFF                                       999830
      *
     C   03              GOTO      SLUTT
     C     SVHK          CHAIN     SVXH                               99
     C   99              DO
     C                   MOVE      'SPT0035'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
     C     WSSG          CHAIN     SVTHA                              98
     C   98              DO
     C                   UPDATE    SVXHR
     C                   MOVE      'SPS0001'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      THDTD         WSDTD
     C                   MOVE      THDTM         WSDTM
     C                   MOVE      THDTÅ         WSDTÅ
     C                   MOVE      THTRDD        WSTRDD
     C                   MOVE      THTRDM        WSTRDM
     C                   MOVE      THTRDÅ        WSTRDÅ
     C                   MOVE      THDDTD        WSDDTD
     C                   MOVE      THDDTM        WSDDTM
     C                   MOVE      THDDTÅ        WSDDTÅ
     C                   MOVE      THDDKD        WSDDKD
     C                   MOVE      THDDKM        WSDDKM
     C                   MOVE      THDDKÅ        WSDDKÅ
      *
     C                   EXFMT     SVX015D02
      *
S01  C*  05              DO
N01  C                   IF        *IN05
     C     START2        TAG
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           SSDT
     C                   MOVE      WTM           SSTM
     C     STSK          CHAIN     STS                                99
     C  N99              GOTO      START2
     C                   MOVE      WSAVD         SSAVD
     C                   MOVE      WSOPD         SSOPD
     C                   MOVE      WSUSER        SSUSR
     C                   MOVE      WSSG          SSSG
     C                   MOVE      'Q'           SSRTYP
     C                   MOVE      THST          SSSTG
     C                   MOVE      WSST          SSSTN
     C                   WRITE     STSR
      *
     C   05              MOVE      WSST          THST
     C                   UPDATE    SVXHR
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSST
     C                   SETOFF                                       99
N01  C                   ELSE
N01  C                   UPDATE    SVXHR
     C                   END
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SVHK          KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     STSK          KLIST
     C                   KFLD                    SSDT
     C                   KFLD                    SSTM
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSUSER
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSUSER           10
      *
     C                   MOVE      'SI'          WSIUNI            2
     C                   MOVE      *ZEROS        WSOPD
      *
     C                   ENDSR
      *
