********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FJERN UBRUKTE LINJER
10003 * 02 YBC PTF10 KLARGJØR TIL EKSTERN REFERANSE
10326 * 03 YBC PTF10 AUTO TILDELER GODSNR
10XXX * 04 YBC PTF10 SØK PÅ SPRÅKKODE TIL AVT.L.STED
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 05 YBC PTF11 OPPDATER 007 I FELTET TIMF
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED EL.TRANSIT HOVED-OPPLYSNING***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 05 06 08 09 11 13 16 18-26
      *** LEDIGE INDIKATORER 28 29 35 38-83
      ***        INDIKATOR   27 PÅ = SPØRRING                 ***
      *** ALLE VARIABLER SOM STARTER MED 'X' ER ARBERDSVAR.   ***
      ***   OG DEFINERES I PROGRAM                            ***
      ***********************************************************
      *
     FFRATXT    IF   E           K DISK
N03  FGODSFI    IF   E           K DISK
N03  FGODSGFSE  UF A E           K DISK
N03  FGODSJF    O  A E           K DISK
     FSYPROD    IF   E           K DISK
     FSVNH      UF A E           K DISK
     FSVNH05    IF   E           K DISK
     F                                     RENAME(SVNHR:SVNHR5)
     FSVNV      IF A E           K DISK
     FSVNSTD    UF   E           K DISK
     FSVXKODL01 IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FEDIM1     UF   E           K DISK
     FEDIM4     IF   E           K DISK
     F                                     RENAME(EDIMR:EDIMR4)
     FSVTKD     IF   E           K DISK
     FSVTHA     IF   E           K DISK
     FSVX061D   CF   E             WORKSTN USROPN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XIDAGÅ                 1      4  0
     D  XIDAGM                 5      6  0
     D  XIDAGD                 7      8  0
     D  XIDAG                  1      8  0
     D                 DS
     D  XIDAG2D                1      2  0
     D  XIDAG2M                3      4  0
     D  XIDAG2Å                5      6  0
     D  XIDAG2                 1      6  0
     D                 DS
     D  WSGN                   1     35
     D  WSGN1                  1      4
     D  WSGN2                  5      9
     D  WSGN3                 10     12
     D  WSGN4                 13     15
      *
     D                 DS
     D  SYRG                   1     14
     D  SYFOR9                 1      9
     D  SYFORE                 1     11
     D                 DS
     D  TIAVD                  1      4  0
     D  TITDN                  5     11  0
     D  UIN27                 12     12
     D  UIN36                 14     14
     D  U1N07                 15     17
     D  UWS2                  18     27
     D  UPARM2                 1    128
      *
     C                   OPEN      SVX061D
     C                   EXSR      INIT
     C     UTYPE         CABEQ     'DSP'         START1
      *...............................................
      * BILDE-1 INNLESING AV OPDNR./TARIFFØR OSV.
      *'''''''''''''''''''''''''''''''''''''''''''''''
     C     START         TAG
     C  N30
     CANN31              Z-ADD     10            LINNBR
     C  N30
     CAN 31              Z-ADD     9             LINNBR
     C  N30UTYPE         IFEQ      'CPY'
     C                   Z-ADD     9             LINNBR
     C                   END
     C  N30              Z-ADD     34            POSNBR
     C  N30WSSG          IFEQ      *BLANKS
     C                   Z-ADD     9             LINNBR
     C                   END
     C                   EXFMT     SVX061D1
     C                   MOVEA     '00'          *IN(98)
     C                   SETOFF                                       3095
      *
      *  07 = SØKE OPPDRAG
     C   07              DO
     C                   MOVE      'S'           UTYPES            1
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPES
     C                   PARM                    UAVD
     C                   PARM      WSTDN         UTDN              7 0
     C                   PARM                    WSSG
     C                   GOTO      START
     C                   END
     C   12              GOTO      SLUTT
      *
     C     START1        TAG
     C                   EXSR      TESTB1
     C   30              GOTO      START
     C   04UFLAGG        CABEQ     1             START
      *
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      *ZEROS        WSTDN
     C                   MOVE      *ZEROS        TITDN
     C                   END
      *===============================================
      *
      *...............................................
      * BILDE-2 INNLESING AV HOVED OPPLYSNINGER AV SAD
      *'''''''''''''''''''''''''''''''''''''''''''''''
     C     START2        TAG
N03  C                   IF        WSGN = *BLANKS
     C  N30              Z-ADD     3             LINNBR
N03  C                   END
     C  N30              IF        ((WSGN2 = *BLANKS) OR (WSGN4 <> *BLANKS))
     C  N30              Z-ADD     13            POSNBR
     C                   END
     C     ST21          TAG
      *
     C                   EXSR      TSTOPL
      *
     C                   EXFMT     SVX061D2
     C                   MOVEA     '00000000'    *IN(92)
     C                   MOVEA     '00000000'    *IN(84)
     C                   SETOFF                                       30
      *
      *  04 = SØK AVSENDER/MOTTAKER/HOVEDANSVARLIG
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      ST21
     C                   END
      *
      *  07 = SØKE OPPDRAG
     C   07              DO
     C                   MOVE      'S'           UTYPES            1
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPES
     C                   PARM                    UAVD
     C                   PARM      WSTDN         UTDN
     C                   PARM                    WSSG
     C                   GOTO      START2
     C                   END
      *
      *  10 = SE OPPLYSNIGER OM GODKJENNELSE FRA TOLLVESENET (KUN KOMMUNIKASJON)
     C   10              DO
     C                   EXSR      VISTOL
     C                   GOTO      START2
     C                   END
      *
      *  12 = AVBRYT, FRIGJØR E-MERKING OG GÅ TIL SVX061D1
     C   12              DO
     C     UTYPE         IFNE      'DSP'
     C     SVHK          CHAIN     SVNH                               33
     C                   MOVE      ' '           TIST
     C  N33              UPDATE    SVNHR
     C                   END
     C     UTYPE         IFEQ      'CR2'
     C                   MOVE      *ZEROS        WSTDN
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      START2
     C                   END
      *
     C     UTYPE         IFEQ      'DSP'
     C                   GOTO      START3
     C                   END
      *
      * ----------- T E S T   B I L D E 0 2 ----------
     C                   EXSR      TESTB2
     C   30              GOTO      START2
      *
      * ----- INGEN FEIL HITTIL     OPPDATER SVUH -----
     C                   EXSR      OPDTRH
      *
      *===============================================
      *
     C     START3        TAG
     C                   EXSR      TOTRV
     C   12              GOTO      START2
     C     UTYPE         IFEQ      'CR2'
     C     *IN17         OREQ      '1'
     C                   MOVE      *ZEROS        WSTDN
     C  N03              DO
     C                   MOVE      *ZEROS        TITDN
     C                   MOVE      *ZEROS        WSTRNR
     C                   MOVE      *ZEROS        WSGN
     C                   MOVE      *BLANKS       WSGNSK
     C                   GOTO      START2
     C                   END
     C                   GOTO      START
     C                   END
      *
     C     SLUTT         TAG
     C     *IN12         IFEQ      '1'
     C                   Z-ADD     1             UFLAGG
     C                   ELSE
     C                   Z-ADD     0             UFLAGG
     C                   END
     C                   CLOSE     SVX061D
     C                   RETURN
      *
     C***********************************************
     C     SØKDT2        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      * GODSREGISTRERING
     C     LINNBR        IFEQ      3
     C     LINNBR        OREQ      4
     C     POSNBR        IFLT      47
     C                   MOVEL     'SYGODS  '    PRODNA           15
     C     PRODNA        CHAIN     SYPROD                             33
     C  N33PRINST        IFEQ      'J'
     C                   MOVE      'P'           UPLUKK            1
     C                   MOVEL     WSGN          XXXGN            15
     C                   MOVEL     *BLANKS       XXXMOT           15
     C                   MOVEL     WSTRNR        XXXMRN           18
     C                   CALL      'SYTL01CL'
     C                   PARM                    UPLUKK
     C                   PARM                    XXXGN
     C                   PARM                    XXXMOT
     C                   PARM                    XXXMRN
     C     XXXGN         IFNE      *BLANKS
     C                   MOVEL     XXXGN         WSGN
     C                   MOVEL     XXXMRN        WSTRNR
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     13            POSNBR
     C                   END
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C                   END
      * SPRÅKKODE TIL GODSNR
S04  C*    LINNBR        IFEQ      4
N04  C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     62
     C     POSNBR        ANDLE     63
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSGNSK        UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2
     C                   MOVEL     UKODE         WSGNSK
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * AVSENDERSLANDKODE
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     14
     C                   CALL      'SVT003R'
     C                   PARM                    SVKD_TYP
     C                   PARM                    SVKD_IE
     C                   PARM                    WDT
     C                   PARM                    UKD              10
     C                   IF        UKD <> *BLANKS
     C                   EVAL      WSALK = UKD
     C                   END
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK
     C                   END
N04   * SPRÅKKODE TIL GODSNR
N04  C     LINNBR        IFEQ      7
N04  C     POSNBR        ANDGE     77
N04  C     POSNBR        ANDLE     78
N04  C                   MOVE      '012'         UUNIK
N04  C                   MOVE      *BLANKS       UKODE
N04  C                   MOVEL     WSALSS        UKODE
N04  C                   CALL      'SVX002R'
N04  C                   PARM                    UUNIK
N04  C                   PARM                    UKODE
N04  C                   PARM                    UTYPE2
N04  C                   MOVEL     UKODE         WSALSS
N04  C                   Z-ADD     8             LINNBR
N04  C                   Z-ADD     13            POSNBR
N04  C                   GOTO      SLSØK
N04  C                   END
      * FREMLEGGELSES TOLLSTED
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     20
     C                   MOVE      '106'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSTSB         UKODE
     C                   MOVE      'ANK'         UTYPE2            3
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2
     C                   MOVEL     UKODE         WSTSB
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * SPRÅKKODE TIL FREMLEGGELSESTOLLSTED
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     32
     C     POSNBR        ANDLE     33
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSSKB         UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2
     C                   MOVEL     UKODE         WSSKB
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * NÆRINGSLIV
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     20
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKN
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * LANDKODE TIL NÆRINSLIV
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     14
     C                   CALL      'SVT003R'
     C                   PARM                    SVKD_TYP
     C                   PARM                    SVKD_IE
     C                   PARM                    WDT
     C                   PARM                    UKD              10
     C                   IF        UKD <> *BLANKS
     C                   EVAL      WSLK = UKD
     C                   END
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * SPRÅKKODE TIL HOVEDANSVARLIG
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     32
     C     POSNBR        ANDLE     33
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSSK          UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2
     C                   MOVEL     UKODE         WSSK
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
      *** TEST AVDELING
     C     UAVD          CHAIN(N)  SVNSTD                             95
     C  N95              DO
     C                   MOVE      *BLANKS       TIST
     C                   MOVE      *ZEROS        TITDN
     C                   END
     C   95              DO
     C                   MOVE      'SPA0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   GOTO      SLTB1
     C                   END
      *** TEST TARIFFØR
     C     WSSG          CHAIN     SVTHA                              99
     C   99              DO
     C                   MOVE      'SPS0001'     MSGNR
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB1
     C                   END
      *
      *** TEST OM TASTET TOLLDEKNR. ER RIKTIG
      * WSTDN = 0  --> HENT STANDARD SAD-OPPLYSNINGER
     C     UTYPE         IFEQ      'CPY'                                        1<-B
     C     SVHKK         CHAIN(N)  SVNH                               33
     C                   ELSE                                                   1
     C     WSTDN         IFNE      0                                             2<-B
     C     SVHK          CHAIN     SVNH                               33
     C  N33UTYPE         IFEQ      'DSP'                                          3<-B
     C                   UPDATE    SVNHR
     C                   GOTO      STTB1
     C                   END                                                      3<-E
      * TIST = ' ' --> ÅPEN TRANSITTERING
      *        'A' --> HOLD PÅ Å SENDE UT
      *        'B' --> SENDT TIL IBM
      *        'C' --> SENDT TIL TOLLVESENET
      *        'E' --> HOLD PÅ Å BLI ENDRET
      *        'M' --> FEILMELDING FRA TOLLVESENET
      *        'P' --> TRANSITTERING AVSLUTTET
      *        'F' --> FEIL VED SIGILERING/TEKNISK
      *        'Q' --> I UTGÅENDE POSTKASSE
      *        'U' --> HAR FÅTT LOSSETILLATELSE
     C  N33TIST          IFNE      ' '                                            3<-B
     C     TIST          ANDNE     'M'
     C     TIST          COMP      'P'                                9898
     C   98TIST          COMP      'Q'                                9898
     C                   END                                                      3<-E
     C  N33
     CANN98TIST          IFEQ      'A'                                            3<-B
     C     TIWS          COMP      UWS                                9898
     C                   END                                                      3<-E
      *
     C  N33
     CANN98              DO                                                       3<-B
     C                   EXSR      TSTM
     C   98              UPDATE    SVNHR
     C   98              GOTO      SLTB1
     C                   END                                                      3<-E
     C  N33
     CANN98              MOVE      'E'           TIST
     C  N33              UPDATE    SVNHR
      *
     C   98              DO                                                       3<-B
     C                   MOVE      'SPT0028'     MSGNR
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     34            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB1
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C  N30
     CAN 33              MOVE      WSTDN         UTDN
      *
      *** FLYTT DATA FRA FIL-VARIABLER TIL WS-VARIABLER
     C     STTB1         TAG
     C  N30              EXSR      MOVW2
      *
     C     SLTB1         ENDSR
      *
     C***********************************************
     C     TSTM          BEGSR
     C***********************************************
      *
      * Test om det finnes sending i "postkasse"
     C     TVINMK        SETGT     EDIM1
     C     STTSTM        TAG
     C     TVINMK        READPE    EDIM1                                  98
     C  N98MSR           IFEQ      'S'
     C     M1001         ANDEQ     'STI'
     C     M1N07         ANDEQ     '007'
     C   10              DELETE    EDIMR
     C   10              GOTO      SLTSTM
     C                   UPDATE    EDIMR
     C                   MOVE      'SPT0043'     MSGNR
     C                   SETON                                        3098
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   GOTO      SLTSTM
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   GOTO      STTSTM
     C                   END
      *
      * Test om det har fått "lossetillatelse"/"transittering avslutt"
     C     TVIM4K        SETLL     EDIM4                              98
     C     STTST2        TAG
     C     TVI41K        READPE    EDIM4                                  98
     C  N98MST           IFEQ      'D'
     C     M1001         ORNE      'STI'
     C                   GOTO      STTST2
     C                   ELSE
     C     M1N07         IFEQ      '043'
     C     M1N07         OREQ      '025'
     C     M1N07         OREQ      '058'
     C     M1225         OREQ      '044'
     C     M1N07         ANDEQ     '999'
     C                   MOVE      'SVX1762'     MSGNR
     C                   SETON                                        3098
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   GOTO      SLTSTM
     C                   END
     C                   END
     C                   MOVE      '0'           *IN98
      *
     C     SLTSTM        ENDSR
      *
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C     WSGN          COMP      *BLANKS                                98
     C   98              MOVE      'SVX1764'     MSGNR
     C   98              SETON                                        30
      *
     C     WSTRNR        COMP      *BLANKS                                99
     C  N99              MOVEL     WSTRNR        XAN01             1
     C  N99XAN01         IFLT      '0'
     C     XAN01         ORGT      '9'
     C                   MOVE      *ON           *IN99
     C                   END
     C  N99WSTRNR        CHAIN     SVNH05                             33
     C  N99
     CANN33WSTDN         IFEQ      0
     C     WSTDN         ORNE      TITDN
     C                   MOVE      '1'           *IN99
     C                   END
     C  N99              MOVE      WSTRNR        XAN01             1
     C  N99XAN01         COMP      *BLANKS                                99
     C   99
     CANN30              MOVE      'SVX1763'     MSGNR
     C   99              SETON                                        30
      *
     C     WSGNSK        IFEQ      *BLANKS
     C                   MOVE      'SV'          WSGNSK
     C                   ELSE
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSGNSK        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          97
     C   97
     CANN30              MOVE      'SVX0810'     MSGNR
     C   97              SETON                                        30
     C                   END
      *
     C     WSALK         IFEQ      *BLANKS
     C                   MOVEL     WSTRNR        XAN04             4
     C                   MOVE      XAN04         WSALK
     C                   END
     C                   EVAL      SVKD_KD = WSALK
     C     SVTKDK        CHAIN     SVTKD                              96
     C   96
     CANN30              MOVE      'SPL0001'     MSGNR
     C   96              SETON                                        30
      *
     C     WSENKL        IFEQ      'J'
     C     WSALSK        COMP      *BLANKS                            9595
     C   95
     CANN30              MOVE      'SVX1765'     MSGNR
     C   95              SETON                                        30
     C     WSALS         COMP      *BLANKS                            9494
     C   94
     CANN30              MOVE      'SVX1765'     MSGNR
     C   94              SETON                                        30
     C     WSACTS        COMP      *BLANKS                            9191
     C   91
     CANN30              MOVE      'SVX1765'     MSGNR
     C   91              SETON                                        30
      *
      * TEST PÅ GODKJENT LAGRINGSSTED VED SENERE VERSJON (ETTER 3.1)
     C                   ELSE
     C     WSGLSK        COMP      *BLANKS                            9292
     C   92
     CANN30              MOVE      'SVX1766'     MSGNR
     C   92              SETON                                        30
      *
      * TEST PÅ AVTALT LAGRINGSSTED/KONTROLL STED VED SENERE VERSJON
     C                   END
      *
     C                   SELECT
     C     WSALS         WHENEQ    *BLANKS
     C     WSGLSK        ANDEQ     *BLANKS
     C     WSACTS        ANDEQ     *BLANKS
      * OK FOR VERSJON 3.1
     C     WSALS         WHENNE    *BLANKS
     C     WSGLSK        ANDEQ     *BLANKS
     C     WSACTS        ANDEQ     *BLANKS
     C     WSALS         WHENEQ    *BLANKS
     C     WSGLSK        ANDNE     *BLANKS
     C     WSACTS        ANDEQ     *BLANKS
     C     WSALS         WHENEQ    *BLANKS
     C     WSGLSK        ANDEQ     *BLANKS
     C     WSACTS        ANDNE     *BLANKS
     C                   OTHER
     C  N30              MOVE      'SVX1767'     MSGNR
     C                   MOVE      '1'           *IN96
     C                   MOVE      '1'           *IN94
     C                   MOVE      '1'           *IN92
     C                   MOVE      '1'           *IN30
     C                   ENDSL
      *
     C     WSALSK        IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSALSK        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          93
     C   93
     CANN30              MOVE      'SVX0810'     MSGNR
     C   93              SETON                                        30
     C                   END
      *
     C                   MOVE      '106'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSTSB         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          90
     C   90
     CANN30              MOVE      'SVX1768'     MSGNR
     C   90              SETON                                        30
      *
     C     WSSKB         IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSSKB         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          89
     C   89
     CANN30              MOVE      'SVX0810'     MSGNR
     C   89              SETON                                        30
     C                   END
      *
     C     WSKN          IFNE      0
     C                   EXSR      TESTKN
     C                   END
      *
     C     WSENKL        IFEQ      'J'
     C     WSTIN         COMP      *BLANKS                                87
     C   87
     CANN30              MOVE      'SVX0812'     MSGNR
     C   87              SETON                                        30
     C                   END
      *
     C     WSNA          COMP      *BLANKS                                86
     C   86
     CANN30              MOVE      'SPK0037'     MSGNR
     C   86              SETON                                        30
      *
     C     WSENKL        IFEQ      'N'
     C     WSLK          ORNE      *BLANKS
     C                   EVAL      SVKD_KD = WSLK
     C     SVTKDK        CHAIN     SVTKD                              85
     C   85
     CANN30              MOVE      'SPL0001'     MSGNR
     C   85              SETON                                        30
     C                   END
      *
     C     WSSK          IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSSK          YKODE
     C     SVK01K        CHAIN     SVXKODL01                          84
     C   84
     CANN30              MOVE      'SVX0810'     MSGNR
     C   84              SETON                                        30
     C                   END
      *
     C   30              EXSR      SETCUR
      *
     C                   ENDSR
      *
     C***********************************************
     C     SETCUR        BEGSR
     C***********************************************
     C   84              Z-ADD     18            LINNBR
     C   84              Z-ADD     32            POSNBR
     C   85              Z-ADD     18            LINNBR
     C   85              Z-ADD     13            POSNBR
     C   86              Z-ADD     14            LINNBR
     C   86              Z-ADD     13            POSNBR
     C   87              Z-ADD     13            LINNBR
     C   87              Z-ADD     22            POSNBR
     C   88              Z-ADD     13            LINNBR
     C   88              Z-ADD     13            POSNBR
     C   89              Z-ADD     11            LINNBR
     C   89              Z-ADD     32            POSNBR
     C   90              Z-ADD     11            LINNBR
     C   90              Z-ADD     13            POSNBR
     C   91              Z-ADD     9             LINNBR
     C   91              Z-ADD     13            POSNBR
     C   92              Z-ADD     8             LINNBR
     C   92              Z-ADD     13            POSNBR
     C   93              Z-ADD     7             LINNBR
     C   93              Z-ADD     77            POSNBR
     C   94              Z-ADD     7             LINNBR
     C   94              Z-ADD     31            POSNBR
     C   95              Z-ADD     7             LINNBR
     C   95              Z-ADD     13            POSNBR
     C   96              Z-ADD     5             LINNBR
     C   96              Z-ADD     13            POSNBR
     C   97              Z-ADD     4             LINNBR
     C   97              Z-ADD     62            POSNBR
     C   99              Z-ADD     4             LINNBR
     C   99              Z-ADD     13            POSNBR
     C   98              Z-ADD     4             LINNBR
     C   98              Z-ADD     13            POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVW2         BEGSR
     C***********************************************
     C                   MOVE      TIDT          WSDT
     C                   MOVE      TIDTF         WSDTF
     C                   MOVE      TITRNR        WSTRNR
     C                   MOVE      TIGN          WSGN
     C*                  IF        ((WSGN2 <> *BLANKS) AND (WSGN3 = *BLANKS))
S03  C*                  IF        ((*IN33 = *OFF) AND *IN33)
S03   * HENT DAGNR
S03  C*                  CALL      'SYGE15C'
S03  C*                  PARM                    WDT
S03  C*                  PARM                    WTM
S03  C*                  MOVE      WDT           XIDAG
S03  C*                  MOVE      XIDAGÅ        XIDAG2Å
S03  C*                  MOVE      XIDAGM        XIDAG2M
S03  C*                  MOVE      XIDAGD        XIDAG2D
S03  C*                  MOVE      XIDAG2        UDATO             6
S03  C*                  CALL      'SYGE25CL'
S03  C*                  PARM                    UDATO
S03  C*                  PARM                    UDAGPA            3
S03  C*                  MOVE      XIDAGÅ        WSGN1
S03  C*                  MOVE      UDAGPA        WSGN3
S03  C*                  Z-ADD     25            POSNBR
S03  C*                  END
N03  C                   IF        WSTDN = 0
N03  C                   IF        WSGN <> *BLANKS AND %SUBST(WSGN:4:4) = *BLANKS
N03  C                   CALL      'SYGE15C'
N03  C                   PARM                    WDT
N03  C                   PARM                    WTM
N03  C                   EVAL      %SUBST(WSGN:4:1) = '-'
N03  C                   EVAL      %SUBST(WSGN:5:2) = %SUBST(WDT:3:2)
N03  C                   EVAL      %SUBST(WSGN:7:1) = '-'
N03  C                   END
N03  C                   Z-ADD     4             LINNBR
N03  C                   Z-ADD     13            POSNBR
N03  C                   END
N03   *
     C                   MOVE      TIGNSK        WSGNSK
     C                   MOVE      TIALSK        WSALSK
     C                   MOVE      TIALS         WSALS
     C                   MOVE      TIALSS        WSALSS
     C                   MOVE      TIGLSK        WSGLSK
     C                   MOVE      TIACTS        WSACTS
     C                   MOVE      TISKB         WSSKB
     C                   MOVE      TITSB         WSTSB
     C                   MOVE      TIKN          WSKN
     C                   MOVE      TITIN         WSTIN
     C                   MOVE      TINA          WSNA
     C                   MOVE      TIAD1         WSAD1
     C                   MOVE      TIPN          WSPN
     C                   MOVE      TIPS          WSPS
     C                   MOVE      TILK          WSLK
     C                   MOVE      TISK          WSSK
     C     WSSG          CHAIN     SVTHA                              33
     C                   MOVEL     SVTH_NAMN     WSTARF
     C                   MOVE      TIALK         WSALK
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVTRH        BEGSR
     C***********************************************
     C                   MOVE      UAVD          TIAVD
     C                   MOVE      WSTDN         TITDN
     C                   MOVE      WSSG          TISG
     C                   MOVE      WSENKL        TIENKL
     C                   MOVE      WSTRNR        TITRNR
     C                   MOVE      WSGN          TIGN
     C                   MOVE      WSGNSK        TIGNSK
     C                   MOVE      WSALSK        TIALSK
     C                   MOVE      WSALS         TIALS
     C                   MOVE      WSALSS        TIALSS
     C                   MOVE      WSGLSK        TIGLSK
     C                   MOVE      WSACTS        TIACTS
     C                   MOVE      WSSKB         TISKB
     C                   MOVE      WSTSB         TITSB
     C                   MOVE      WSTARF        TITARF
     C                   MOVE      *BLANKS       TIWS
     C                   MOVE      WSKN          TIKN
     C                   MOVE      WSTIN         TITIN
     C                   MOVE      WSNA          TINA
     C                   MOVE      WSAD1         TIAD1
     C                   MOVE      WSPN          TIPN
     C                   MOVE      WSPS          TIPS
     C                   MOVE      WSLK          TILK
     C                   MOVE      WSSK          TISK
     C                   MOVE      *BLANKS       TIMF
     C                   MOVE      *ZEROS        TIMP
     C                   MOVE      *BLANKS       TIKDV
     C                   MOVE      *BLANKS       TI0035
     C                   MOVE      WSALK         TIALK
N05  C                   MOVE      '007'         TIMF
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVTH2        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       TIDK
     C                   MOVE      *ZEROS        TIKNA
     C                   MOVE      *BLANKS       TINAA
     C                   MOVE      *BLANKS       TIADA1
     C                   MOVE      *BLANKS       TIPNA
     C                   MOVE      *BLANKS       TIPSA
     C                   MOVE      *BLANKS       TILKA
     C                   MOVE      *BLANKS       TISKA
     C                   MOVE      *BLANKS       TITINA
     C                   MOVE      *ZEROS        TIKNS
     C                   MOVE      *BLANKS       TINAS
     C                   MOVE      *BLANKS       TIADS1
     C                   MOVE      *BLANKS       TIPNS
     C                   MOVE      *BLANKS       TIPSS
     C                   MOVE      *BLANKS       TILKS
     C                   MOVE      *BLANKS       TISKS
     C                   MOVE      *BLANKS       TITINS
     C                   MOVE      *ZEROS        TIKNK
     C                   MOVE      *BLANKS       TINAK
     C                   MOVE      *BLANKS       TIADK1
     C                   MOVE      *BLANKS       TIPNK
     C                   MOVE      *BLANKS       TIPSK
     C                   MOVE      *BLANKS       TILKK
     C                   MOVE      *BLANKS       TISKK
     C                   MOVE      *BLANKS       TITINK
     C                   MOVE      *BLANKS       TIBLK
     C                   MOVE      *BLANKS       TITAID
     C                   MOVE      *BLANKS       TITASK
     C                   MOVE      *BLANKS       TITALK
     C                   MOVE      *BLANKS       TIKDC
     C                   MOVE      *ZEROS        TITRDT
     C                   MOVE      *ZEROS        TILSTL
     C                   MOVE      *ZEROS        TIVPOS
     C                   MOVE      *ZEROS        TINTK
     C                   MOVE      *ZEROS        TIVKB
     C                   MOVE      *BLANKS       TICATS
     C                   MOVE      *ZEROS        TIDANT
     C                   MOVE      *BLANKS       TIDFKD
     C                   MOVE      *BLANKS       TIDFSK
      *
     C                   MOVE      *ZEROS        NIVPOS
     C                   MOVE      *ZEROS        NINTK
     C                   MOVE      *ZEROS        NIVKB
     C                   MOVE      *BLANKS       NIDFST
     C                   MOVE      *ZEROS        NIDANT
     C                   MOVE      *BLANKS       NIDFKD
     C                   MOVE      *BLANKS       NIDFSK
     C                   MOVE      *BLANKS       NIMN1
     C                   MOVE      *BLANKS       NIMN2
     C                   MOVE      *BLANKS       NIMNSK
     C                   MOVE      *ZEROS        NIKONF
     C                   MOVE      *ZEROS        NIFULF
     C                   MOVE      *ZEROS        NIDTL
     C                   MOVE      *BLANKS       NICTB
     C                   MOVE      *BLANKS       NICTB2
     C                   MOVE      *BLANKS       NICTSK
     C                   MOVE      *BLANKS       NICTP
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDTRH        BEGSR
     C***********************************************
     C     WSTDN         IFEQ      0
     C     UAVD          CHAIN     SVNSTD                             33
     C                   MOVE      TITDN         WSTDN
     C                   ADD       1             TITDN
     C                   UPDATE    SVNSTDR
     C                   END
      *
     C     SVHK          CHAIN     SVNH                               33
     C                   EXSR      MOVTRH
      *
     C                   MOVE      'E'           TIST
     C   33              DO
     C                   MOVE      UAVD          TIAVD
     C                   MOVE      WSTDN         TITDN
     C                   MOVE      WSSG          TISG
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           TIDT
     C                   MOVE      TIDT          WSDT
     C                   MOVE      *ZEROS        TIDTF
N03   *
N03  C                   IF        %SUBST(TIGN:1:7) <> *BLANKS AND
N03  C                             %SUBST(TIGN:8:5) = *BLANKS
N03  C                   EVAL      GFLBKO = %SUBST(TIGN:1:3)
N03  C     GFLBKO        CHAIN     GODSFI                             33
N03  C                   IF        *IN33 = *OFF
N03  C                   EVAL      GSEGN1 = %SUBST(TIGN:1:7)
N03  C     GSEGN1        CHAIN     GODSGFSE                           33
N03  C                   IF        *IN33
N03  C                   Z-ADD     2             XNR05             5 0
N03  C                   MOVE      XNR05         GSEGN2
N03  C                   WRITE     GODSGFSER
N03  C                   ELSE
N03  C                   MOVE      GSEGN2        XNR05
N03  C                   ADD       1             XNR05
N03  C                   MOVE      XNR05         GSEGN2
N03  C                   UPDATE    GODSGFSER
N03  C                   END
N03  C                   SUB       1             XNR05
N03  C                   MOVE      XNR05         GSEGN2
N03  C                   EVAL      %SUBST(TIGN:8:5) = GSEGN2
N03  C                   EVAL      WSGN   = TIGN
N03  C                   EVAL      GOGN   = TIGN
N03  C                   EVAL      GOTRNR = TITRNR
N03  C                   EVAL      GOTRDT = TIDT
N03  C                   EVAL      GOGRDT = TIDT
N03  C                   WRITE     GODSJR
N03  C                   END
N03  C                   EVAL      *IN33 = *ON
N03  C                   END
N03   *
     C                   EXSR      MOVTH2
     C     UTYPE         IFEQ      'CPY'
     C     KAVD          ANDNE     0
     C                   EXSR      CPYTRV
     C                   MOVE      *ZEROS        KAVD
     C                   END
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      *BLANKS       TITUID
     C                   END
     C                   CALL      'SVG001R'
     C                   PARM                    U_TITUID         10
     C                   MOVE      UYEAR         XÅR               2
     C                   EVAL      TITUID = 'SE' + XÅR + U_TITUID
     C                   EVAL      TISGME = 'SD'
     C                   MOVEL     SVTH_ANNN     TISGID
     C                   WRITE     SVNHR
      *
     C                   END
      *
     C  N33              IF        TITUID = *BLANKS
     C                   CALL      'SVG001R'
     C                   PARM                    U_TITUID
     C                   MOVE      UYEAR         XÅR
     C                   EVAL      TITUID = 'SE' + XÅR + U_TITUID
     C                   END
     C  N33              UPDATE    SVNHR
      *
     C                   ENDSR
      *
     C***********************************************
     C     CPYTRV        BEGSR
     C***********************************************
     C     SVHKK         SETLL     SVNV
     C     SVHKK         READE     SVNV                                   33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      TIAVD         TVAVD
     C                   MOVE      TITDN         TVTDN
     C                   WRITE     SVNVR
     C     SVHKK         READE     SVNV                                   33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     TOTRV         BEGSR
     C***********************************************
      *
     C                   MOVE      *IN27         UIN27
     C                   CALL      'SVX062R'
     C     UPARM2        PARM      UPARM2        UPARM1          128
     C                   PARM                    UFLAGG            1 0
     C                   IF        UTYPE <> 'DSP'
     C     SVHK          CHAIN     SVNH                               33
     C                   MOVE      ' '           TIST
     C                   UPDATE    SVNHR
     C                   END
      *
     C     UFLAGG        COMP      1                                      12
     C     UFLAGG        COMP      2                                      17
     C     UFLAGG        COMP      3                                      03
      *
     C                   ENDSR
      *
     C***********************************************
     C     VISTOL        BEGSR
     C***********************************************
      *________________________
      * Call på eksternt CL-pgm
      *""""""""""""""""""""""""
     C                   MOVE      '6'           WIN03             1
     C                   CALL      'SVX006R'
     C                   PARM      TIAVD         UAVD
     C                   PARM      TITDN         UTDN2             7 0
     C                   PARM                    WIN03
      *
     C                   ENDSR
      *
     C***********************************************
     C     TESTKN        BEGSR
     C***********************************************
     C                   MOVE      WSKN          KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            97
     C     *IN97         IFEQ      '1'
     C  N30              MOVE      'SPK0001'     MSGNR
     C  N30              Z-ADD     13            LINNBR
     C  N30              Z-ADD     13            POSNBR
     C                   SETON                                        30
     C                   ELSE
     C                   MOVE      KNAVN         WSNA
     C                   MOVE      ADR1          WSAD1
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSPN
     C                   MOVEL     POSTNR        WSPN
     C                   ELSE
     C                   MOVEL     SYPOGE        WSPN
     C                   END
     C                   MOVE      ADR3          WSPS
     C     SYLAND        IFNE      *BLANKS
     C                   MOVE      SYLAND        WSLK
     C                   END
     C     WSTIN         IFEQ      *BLANKS
     C                   SELECT
     C                   WHEN      EORI = *BLANKS
     C                   IF        ((SYFOR9 <> *BLANKS) AND (SYFOR9 <> *ZEROS))
     C                   IF        WSLK = *BLANKS
     C                   EVAL      WSTIN = 'SE' + SYFOR9
     C                   ELSE
     C                   EVAL      WSTIN = WSLK + SYFOR9
     C                   END
     C                   END
     C                   OTHER
     C                   EVAL      WSTIN = EORI
     C                   ENDSL
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'L'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     SVHK          KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     SVHKK         KLIST
     C                   KFLD                    KAVD
     C                   KFLD                    KTDN
     C     SVSTDK        KLIST
     C                   KFLD                    UAVD
     C     SVK01K        KLIST
     C                   KFLD                    YUNIK             3
     C                   KFLD                    YKODE            10
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     SVTKDK        KLIST
     C                   KFLD                    SVKD_IE
     C                   KFLD                    SVKD_TYP
     C                   KFLD                    SVKD_KD
     C     TVINMK        KLIST
     C                   KFLD                    YST
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C     TVIM4K        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
     C                   KFLD                    MAX0B
     C                   KFLD                    MAX0C
     C                   KFLD                    MAX0D
     C     TVI41K        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    WSTDN
      *
     C     *LIKE         DEFINE    TITDN         UTDN
     C     *LIKE         DEFINE    TISG          USG
     C     *LIKE         DEFINE    TIWS          UWS
     C     *ENTRY        PLIST
     C                   PARM                    UAVD
     C     WSTDN         PARM      WSTDN         UTDN
     C     WSSG          PARM                    USG
     C                   PARM                    UTYPE             3
     C     UWS2          PARM      UWS2          UWS
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      *ZEROS        TIAVD
     C                   MOVE      *ZEROS        TITDN
     C                   MOVE      '0'           UIN27
     C                   MOVE      *BLANKS       U1N07
     C                   MOVE      *BLANKS       UUNIK             3
     C                   MOVE      *BLANKS       UKODE            10
      *
     C     UTYPE         COMP      'DSP'                                  27
     C     UTYPE         COMP      'CHG'                                  31
     C     UTYPE         COMP      'CHG'                                  32
     C  N32UTYPE         COMP      'CPY'                                  32
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      UAVD          KAVD              4 0
     C                   MOVE      WSTDN         KTDN              7 0
     C                   MOVE      *ZEROS        WSTDN
     C                   END
      *
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      *ZEROS        KUNDNR            8 0
     C                   MOVE      'GCY'         SVKD_TYP
     C                   MOVE      'A'           SVKD_IE
     C                   MOVE      ' '           YST               1
     C                   MOVE      '99999999'    MAX0B             8 0
     C                   MOVE      '999999'      MAX0C             6 0
     C                   MOVE      '99'          MAX0D             2 0
     C                   MOVE      'R'           XSR1              1
     C                   MOVE      *ZEROS        WSDT              8 0
     C                   MOVE      *ZEROS        TIDT
     C                   MOVE      *ZEROS        WSDTF
     C                   MOVE      *ZEROS        TIDTF
      *
S01  C*                  Z-ADD     1             SOANTK            1 0
S01  C*                  MOVE      'NÆRINGSL'    SOTXT1            8
S01  C*                  MOVE      *BLANKS       SOTXT2            8
S01  C*                  MOVE      *BLANKS       SOTXT3            8
S01  C*                  MOVE      *BLANKS       SOTXT4            8
S01  C*                  MOVE      *BLANKS       SOTXT5            8
S01  C*                  MOVE      *BLANKS       SOTXT6            8
S01  C*                  MOVE      *BLANKS       SOTXT7            8
S01  C*                  MOVE      *BLANKS       SOTXT8            8
S01  C*                  MOVE      *ZEROS        SOKNR2            8 0
S01  C*                  MOVE      *ZEROS        SOKNR3            8 0
S01  C*                  MOVE      *ZEROS        SOKNR4            8 0
S01  C*                  MOVE      *ZEROS        SOKNR5            8 0
S01  C*                  MOVE      *ZEROS        SOKNR6            8 0
S01  C*                  MOVE      *ZEROS        SOKNR7            8 0
S01  C*                  MOVE      *ZEROS        SOKNR8            8 0
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     UAVD          CHAIN(N)  SVNSTD                             33
      *
     C                   MOVE      TIENKL        WSENKL
     C                   MOVE      *IN36         UIN36
      *
     C                   ENDSR
      *
      *
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      * NÆRINGSLIV
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     13
     C     POSNBR        ANDLE     20
     C     WSKN          ANDGT     0
     C                   MOVE      WSKN          XSKKNR
     C                   GOTO      STVISO
     C                   END
      *
      *
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
      *
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR            8 0
     C                   PARM                    XSKMOT            8
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
      *
     C     SLVISO        ENDSR
      *
     C***********************************************
     C     TSTOPL        BEGSR
     C***********************************************
     C                   MOVE      '0'           *IN37
      *** TEST OM NÆRINGSLIV OPPLYSNING. HVIS DET, SETT 37 PÅ
     C                   MOVE      WSKN          FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        37
      *
     C                   ENDSR
      *
