      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED NY VAREBESKRIVELSE         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 06-11 13-24
      *** LEDIGE INDIKATORER 28 29 31 32 34-88 95-97
      ***********************************************************
      *
     FSVNLVT    UF A E           K DISK
     FTR076D    CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C     UTVT          IFNE      *BLANKS
     C     UNVT          ORNE      *BLANKS
     C                   MOVE      UTVT          TVVT
     C                   MOVE      UNVT          NVVT
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     SVNVTK        SETLL     SVNLVT
     C     SVNVTK        READE(N)  SVNLVT                                 94
      *
     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     SVNVTK        READE(N)  SVNLVT                                 94
     C  N94              END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     ZRECNO        IFGT      0
     C                   Z-ADD     1             ZRECNO
     C                   END
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C                   MOVEA     '00'          *IN(89)
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              DO
     C  N27              EXSR      OPDFIL
     C                   GOTO      START
     C                   END
      *
     C  N27W2NR          IFEQ      '1'
     C                   EXSR      CRTVT
     C                   GOTO      START3
     C                   END
      *
     C  N27ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C  N27              EXSR      OPDFIL
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     OPDFIL        BEGSR
     C***********************************************
     C     SVNVTK        SETLL     SVNLVT
     C     SVNVTK        READE     SVNLVT                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    SVNLVTR
     C     SVNVTK        READE     SVNLVT                                 33
     C  N33              ENDDO
      *
     C                   MOVE      *BLANKS       UTVT
     C                   MOVE      *BLANKS       UNVT
     C                   MOVE      *ZEROS        XANTL             3 0
     C     YRECNO        IFGT      0
     C     1             CHAIN     SUBFIL                             33
     C     NVVT          IFNE      '*DELETE'
     C                   MOVE      NVVT          UNVT
     C                   MOVE      TVVT          UTVT
     C                   ADD       1             XANTL
     C                   END
     C     2             DO        YRECNO        ZRECNO
     C     ZRECNO        CHAIN     SUBFIL                             33
     C     NVVT          IFNE      '*DELETE'
     C     XANTL         IFEQ      0
     C                   MOVE      TVVT          UTVT
     C                   MOVE      NVVT          UNVT
     C                   ADD       1             XANTL
     C                   ELSE
     C                   ADD       1             XANTL
     C                   WRITE     SVNLVTR
     C                   END
     C                   END
     C                   ENDDO
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              MOVE      '0'           *IN98
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '2'
     C     NVVT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGVT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     NVVT          COMP      '*DELETE'                              98
     C  N98TVVT          COMP      *BLANKS                            9898
     C   98              GOTO      SLHENT
     C                   EXSR      DLTVT
     C                   END
     C  N98WSNR          IFEQ      '9'
     C     NVVT          COMP      '*DELETE'                              98
     C  N98TVVT          COMP      *BLANKS                                98
     C   98              GOTO      SLHENT
     C                   EXSR      ANGVT
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     CRTVT         BEGSR
     C***********************************************
     C     W2VT          IFEQ      *BLANKS
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN90
     C                   MOVE      'YBC0828'     MSGNR
     C                   GOTO      SLCRT
     C                   END
      *
     C                   MOVE      W2VT          NVVT
     C                   MOVE      *BLANKS       TVVT
     C                   ADD       1             YRECNO
     C                   MOVE      YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   MOVE      *BLANKS       W2NR
     C                   MOVE      *BLANKS       W2VT
      *
     C     SLCRT         ENDSR
      *
     C***********************************************
     C     CHGVT         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   MOVE      NVVT          WSVT
      *
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00'          *IN(89)
     C                   MOVE      '0'           *IN30
     C   12              GOTO      SLCHG
      *
     C     WSVT          IFEQ      *BLANKS
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN90
     C                   MOVE      'YBC0828'     MSGNR
     C                   GOTO      STCHG
     C                   END
      *
     C                   MOVE      WSVT          NVVT
      *
     C     SLCHG         TAG
     C                   MOVE      *BLANKS       WSNR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     DLTVT         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   EVAL      NVVT = '*DELETE'
     C                   MOVE      *BLANKS       TVVT
     C                   MOVE      *BLANKS       W2NR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     ANGVT         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
      * KUN SLETTE NY LINJE
     C                   MOVE      *BLANKS       NVVT
     C                   MOVE      *BLANKS       W2NR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SVNVTK        KLIST
     C                   KFLD                    TVAVD
     C                   KFLD                    TVTDN
     C                   KFLD                    TVLI
      *
     C     *ENTRY        PLIST
     C                   PARM                    TVAVD
     C                   PARM                    TVTDN
     C                   PARM                    TVLI
     C                   PARM                    UNVT             70
     C                   PARM                    UTVT             70
     C                   PARM                    UTYPE             3
      *
     C                   WRITE     WINDOWSZ
     C     UTYPE         COMP      'DSP'                                  27
      *
     C                   ENDSR
      *
