********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FONT
10XXX * 02 JOV PTF10 KOPLAS F (AFP) ER LIKEVERDIG MED P
10XXX * 03 YBC PTF10 NØKKEL EDIM2K
10XXX * 04 YBC PTF10 IKKE ALLOKERE REKORD
10XXX * 05 CB  PTF10 Endre statuskode hvis ikke treff i EDIM-logg
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 06 YBC PTF11 FEIL VED NAVN/ADRESSE PÅ LINJER. VED KUN 1 MOTTAKER
********************************************************************
      *
      ***********************************************************
      *
      * !!! PROGRAM KOMPILERES MED OVERSTYRER SVX014PVA/B TIL SVX014PV !!!
      *                                       SVX014PFA/B     SVX014PF
      *
      *** PROGRAM SKAL SKRIVE UT EL. TRANSITTERING            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 1-26                             ***
      *** LEDIGE INDIKATORER 31 37 51-95
      ***********************************************************
     H DECEDIT('0,') DATEDIT(*DMY.)
     FARKTXT    IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FARKIVL03  IF A E           K DISK
     FKODTFM    IF   E           K DISK
     FSVXSTD    IF   E           K DISK
     FSVXH      UF   E           K DISK
     FSVXH06    IF   E           K DISK
     F                                     RENAME(SVXHR:SVXH06R)
     FSVXHFV    IF   E           K DISK
     FSVXHL     IF   E           K DISK
     FSVXHGB    IF   E           K DISK
     FSVXV      UF   E           K DISK
     FSVXVFV    IF   E           K DISK
     FSVXVAM    IF   E           K DISK
     FSVXVCN    IF   E           K DISK
     FSVXVDK    IF   E           K DISK
     FSVXVFS    IF   E           K DISK
     FSVXVMN    IF   E           K DISK
     FSVXVTD    IF   E           K DISK
     FSVXVVT    IF   E           K DISK
     FSVXKODL01 IF   E           K DISK
     FHEADF     UF   E           K DISK
     FTURER14   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSVTAR2    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTA     IF   E           K DISK
     FKODTP     IF   E           K DISK
     FSVTKD     IF   E           K DISK
     FEDIM2     IF   E           K DISK
     FEDIM4     IF   E           K DISK    PREFIX(M4_)
     F                                     RENAME(EDIMR:EDIMR4)
     FSVX014PFB O    E             PRINTER USROPN
     F                                     RENAME(SVX014F1:SVX014FB1)
     F                                     RENAME(SVX014F2:SVX014FB2)
     F                                     RENAME(SVX014F3:SVX014FB3)
     F                                     RENAME(SVX014F4:SVX014FB4)
     F                                     RENAME(SVX014F5:SVX014FB5)
S01  F*                                    RENAME(SVX014F6P:SVX014FB6P)
N01  F                                     RENAME(SVX014F6:SVX014FB6)
     F                                     RENAME(SVX014F7:SVX014FB7)
     FSVX014PFA O    E             PRINTER USROPN
     FSVX014PL  O    E             PRINTER USROPN
     FSVX014PR  O    E             PRINTER USROPN
     FSVX014PVB O    E             PRINTER USROPN
     F                                     RENAME(SVX014V1:SVX014VB1)
     F                                     RENAME(SVX014V2:SVX014VB2)
     F                                     RENAME(SVX014V3:SVX014VB3)
     F                                     RENAME(SVX014V4:SVX014VB4)
     F                                     RENAME(SVX014V5:SVX014VB5)
     F                                     RENAME(SVX014V6:SVX014VB6)
     F                                     RENAME(SVX014V7:SVX014VB7)
     F                                     RENAME(SVX014V8:SVX014VB8)
     F                                     RENAME(SVX014V9:SVX014VB9)
     F                                     RENAME(SVX014VA:SVX014VBA)
     F                                     RENAME(SVX014VB:SVX014VBB)
     F                                     RENAME(SVX014VC:SVX014VBC)
     F                                     RENAME(SVX014VD:SVX014VBD)
     FSVX014PVA O    E             PRINTER USROPN
     FSVX014PFS O    E             PRINTER USROPN
     FSVX014PVS O    E             PRINTER USROPN
     D UCMD            DS          1024
     D                 DS
     D XCMD11          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PFA) -
     D                                     TOFILE(SVX014PF) -
     D                                     PRTQLTY(*NLQ) -
     D                                     FNTRSL(300) -
     D                                     OUTQ(')
     D XCMD12          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PFB) -
     D                                     TOFILE(SVX014PF) -
     D                                     PRTQLTY(*NLQ) -
     D                                     FNTRSL(300) -
     D                                     OUTQ(')
     D XCMD13          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PVA) -
     D                                     TOFILE(SVX014PV) -
     D                                     PRTQLTY(*NLQ) -
     D                                     FNTRSL(300) -
     D                                     OUTQ(')
     D XCMD14          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PVB) -
     D                                     TOFILE(SVX014PV) -
     D                                     PRTQLTY(*NLQ) -
     D                                     FNTRSL(300) -
     D                                     OUTQ(')
     D XCMD15          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PR) -
     D                                     OUTQ(')
     D XCMD16          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PL) -
     D                                     TOFILE(SVX014PL) -
     D                                     OUTQ(')
     D XCMD17          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PFS) -
     D                                     TOFILE(SVX014PFS) -
     D                                     PRTQLTY(*NLQ) -
     D                                     FNTRSL(300) -
     D                                     OUTQ(')
     D XCMD18          C                   CONST('OVRPRTF -
     D                                     FILE(SVX014PVS) -
     D                                     TOFILE(SVX014PVS) -
     D                                     OUTQ(')
     D XCMD21          C                   CONST('PAGESIZE(70 120) -
     D                                     CPI(15) -
     D                                     OVRFLW(69) -
     D                                     USRDTA(')
     D XCMD21P         C                   CONST('PAGESIZE(70 120) -
     D                                     CPI(15) -
     D                                     OVRFLW(69) -
     D                                     USRDTA(')
     D XCMD22          C                   CONST('PAGESIZE(70 120) -
     D                                     CPI(15) -
     D                                     OVRFLW(65) -
     D                                     USRDTA(')
     D XCMD23          C                   CONST('PAGESIZE(70 120) -
     D                                     CPI(15) -
     D                                     OVRFLW(70) -
     D                                     USRDTA(')
     D XCMD24          C                   CONST('PAGESIZE(70 80) -
     D                                     CPI(10) -
     D                                     OVRFLW(69) -
     D                                     USRDTA(')
     D XCMD25          C                   CONST('PAGESIZE(70 160) -
     D                                     CPI(20) -
     D                                     OVRFLW(65) -
     D                                     USRDTA(')
     D XCMD31          C                   CONST(') COPIES(')
     D XCMD41          C                   CONST(') FORMTYPE(')
     D XCMDPDF         C                   CONST('DEVTYPE(')
     D XCMDPDF1        C                   CONST('FRONTOVL(NCTS1 0 0.1)')
     D XCMDPDF2        C                   CONST('FRONTOVL(NCTS2 0 0.1)')
     D XCMDPDF12       C                   CONST('FRONTOVL(NCTS1 0.14 0.25)')
     D XCMDPDF22       C                   CONST('FRONTOVL(NCTS2 0.14 0.25)')
     D XCMDPDF3        C                   CONST('FRONTOVL(TSADNO)')
     D XCMDPDF3PDF     C                   CONST('FRONTOVL(TSADNO 0.18 0.000)')
     D R401            S             52    DIM(20)
     D R441            S             50    DIM(20)
     D CNR             S             17    DIM(20)
     D DFKD            S             20    DIM(20)
     D                SDS
     D  UUSER                254    263
     D                 DS
     D  TVVNT                  1      6  0
     D  X_TVVNT                1     10
     D                 DS
     D  THNTTD                 1      1  0
     D  XHNTTD                 1      1
     D                 DS
     D  THNTLL                 1      1  0
     D  XHNTLL                 1      1
     D                 DS
     D  DTWS                   1     10
     D  DTUSER                11     20
     D  DTIN39                21     21
     D  DTDTA                  1    128
     D                 DS
     D  TUDTD                  1      4  0
     D  TUDTM                  5      6  0
     D  TUDTÅ                  7      8  0
     D  TUDT                   1      8  0
     D                 DS
     D  XUDTD                  1      2  0
     D  XUDTM                  3      4  0
     D  XUDTÅ                  5      6  0
     D  XUDT                   1      6  0
     D                 DS
     D  XHGBGU                 1     30
     D  XGU                    1     30
     D                                     DIM(10)
     D                 DS
     D  XFFM1                  1     75
     D  ST1                    1     75
     D                                     DIM(75)
     D                 DS
     D  THTRNR                 1     18
     D  XHTRNR                 1     18
     D  XHTRNR2                1     18
     D  XHTRNR3                1     18
     D  ST2                    1     18
     D                                     DIM(18)
     D                 DS
     D  THCNA                  1     22
     D  XHCNA                  1     17
     D                 DS
     D  THCNR                  1     17
     D  XHCNR1                 1      6
     D  XHCNR2                 7     12
     D                 DS
     D  TVEXKD                 1      1  0
     D  XTVEXKD                1      1
     D                 DS
     D  XKTXT1                 1     25
     D  XKTXT1S                1     18
     D                 DS
     D  XKTXT2                 1     25
     D  XKTXT2S                1     18
     D                 DS
     D  XKTXT3                 1     25
     D  XKTXT3S                1     18
     D                 DS
     D  XKTXT4                 1     25
     D  XKTXT4S                1     18
     D                 DS
     D  XKTXT5                 1     25
     D  XKTXT5S                1     18
     D                 DS
     D  XKTXT6                 1     25
     D  XKTXT6S                1     18
      *
     C                   MOVEL     'SVX014RQ'    UDTAQ            10
     C                   MOVEL     '*LIBL'       ULIBL            10
     C                   Z-ADD     128           ULENGT            5 0
     C                   MOVE      *BLANKS       UDTA            128
     C                   Z-SUB     99999         UWAIT             5 0
     C                   Z-ADD     1024          UCMDL            15 5
     C                   BITON     '123457'      GRAAPP            1
     C                   BITOFF    '06'          GRAAPP
     C                   MOVE      *BLANKS       FIFIRM
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C     START0        TAG
     C     ARKIVER       IFEQ      'J'
     C                   CALL      'ARC002CLB'
     C                   PARM                    ARTYPE
     C                   PARM                    ARUSER
     C                   END
     C                   EXSR      INIT
      *
      * SPESIALBEHANDLING VED MANUELL PRINTING
      *
     C     PRTTYP        IFEQ      'M'
     C     PRTTYP        OREQ      'E'
     C                   MOVE      PRTAVD        THAVD
     C                   MOVE      PRTTDN        THTDN
     C     SVHK          CHAIN(N)  SVXH                               30
     C     *IN30         IFEQ      '0'
     C                   OPEN      SVX014PFA
     C                   OPEN      SVX014PVA
     C                   OPEN      SVX014PFB
     C                   OPEN      SVX014PVB
     C                   OPEN      SVX014PL
     C                   OPEN      SVX014PR
     C                   OPEN      SVX014PFS
     C                   OPEN      SVX014PVS
     C                   EXSR      PRINT
     C                   CLOSE     SVX014PFA
     C                   CLOSE     SVX014PVA
     C                   CLOSE     SVX014PFB
     C                   CLOSE     SVX014PVB
     C                   CLOSE     SVX014PL
     C                   CLOSE     SVX014PR
     C                   CLOSE     SVX014PFS
     C                   CLOSE     SVX014PVS
     C                   END
     C                   GOTO      SLUTT
     C                   END
      *
      *** LES TOLLDEK. FRA SVXH-REGISTER. OG TEST OM AVDELING ER SAMMEN
      ***   SOM FORRIGE TOLLDEK. HVIS IKKE, HENTES AVDELINGSDATA OG GÅ
      ***   UT PROGRAM FOR Å ORDNE ALLE PRINTERSTYRING (SETT UIN02='1')
      ***   SÅ GÅ TILBAKE TIL PROGRAM.
      *
     C     SVH06K        SETLL     SVXH06                             30
     C     START         TAG
     C     SVH06K        READE     SVXH06                                 30
     C  N30              DO
     C     THAVD         CABNE     UAVD          START0
     C                   OPEN      SVX014PFA
     C                   OPEN      SVX014PVA
     C                   OPEN      SVX014PFB
     C                   OPEN      SVX014PVB
     C                   OPEN      SVX014PL
     C                   OPEN      SVX014PR
     C                   OPEN      SVX014PFS
     C                   OPEN      SVX014PVS
     C                   EXSR      PRINT
     C                   CLOSE     SVX014PFA
     C                   CLOSE     SVX014PVA
     C                   CLOSE     SVX014PFB
     C                   CLOSE     SVX014PVB
     C                   CLOSE     SVX014PL
     C                   CLOSE     SVX014PR
     C                   CLOSE     SVX014PFS
     C                   CLOSE     SVX014PVS
      *** FERDIG Å BEHANDLE EN TOLLDEK. OG GÅ TIL NESTE TOLLDEK.
     C                   GOTO      START
     C                   END
      *
     C                   GOTO      START0
     C     SLUTT         TAG
     C     arkiver       ifeq      'J'
     C                   call      'ARC002CLB'
     C                   parm                    artype
     C                   parm                    aruser
     C                   end
     C                   MOVE      '1'           *INLR
      *
      ***********************************************
     C     PRINT         BEGSR
      ***********************************************
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDT80             8 0
S04  C*    PRTTYP        IFEQ      'M'
S04  C*    PRTTYP        OREQ      'E'
     C     SVHK          CHAIN(N)  SVXH                               33
S04  C*                  ELSE
S04  C*    SVHK          CHAIN     SVXH                               33
S04  C*                  END
     C   33              GOTO      SLPRI
      *** IND. 32 PÅ BETYR AT DET SKAL KOMME UT UTSKRIFT.
     C     THPKL         COMP      'J'                                    32
     C  N32              GOTO      STPRT1
      *
     C     THENKL        IFEQ      'N'
     C     THLSTL        ANDEQ     0
     C     THTRNR        IFNE      *BLANKS
     C                   EXSR      TSTIE29
     C     XIE29         CABEQ     'J'           STPRTTDOK
     C                   EXSR      PRINT1
     C                   END
     C                   GOTO      STPRT1
     C     STPRTTDOK     TAG
     C                   END
      *
     C     THWS          IFNE      'TVINR'
      * VENT 2 SEKUNDER I TILFELLE SVX011R IKKE REKER Å OPPDATERE SVXH
     C                   Z-ADD     2             USEC              3 0
     C                   CALL      'DLYJBSEC'
     C                   PARM                    USEC
     C                   END
     C                   MOVE      *BLANKS       XHGBGU
     C                   MOVE      *ZEROS        XN                3 0
     C     SVHK          SETLL     SVXHGB
     C     SVHK          READE     SVXHGB                                 33
     C     *IN33         DOWEQ     '0'
     C                   ADD       1             XN
     C                   MOVEL     TGGBGU        XGU(XN)
     C     SVHK          READE     SVXHGB                                 33
     C  N33              ENDDO
      *
     C                   EVAL      SVKD_KD = THALK
S01  C*    SVTKDK        CHAIN     SVTKD                              92
N01  C     SVTKDK        CHAIN     SVTKD                              33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     SVKD_KBS      XXALKT           17
     C                   ELSE
     C                   MOVE      *BLANKS       XXALKT
     C                   MOVEL     THALK         XXALKT
     C                   END
     C                   EVAL      SVKD_KD = THBLK
S01  C*    SVTKDK        CHAIN     SVTKD                              92
N01  C     SVTKDK        CHAIN     SVTKD                              33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     SVKD_KBS      XXBLKT           17
     C                   ELSE
     C                   MOVE      *BLANKS       XXBLKT
     C                   MOVEL     THBLK         XXBLKT
     C                   END
     C                   MOVE      '047'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     THDKR         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          33
     C                   MOVE      TKTXTN        XHDKR
      *
      *** NÅR VAREPOSTER>1 ELLER CONTAINERE, KOLLI, ... BRUKER MER ENN EN GANG,
      *** SKRIV FØLGESEDDEL SOM FORSIDE TIL VARELISTE OG ALLE OPPLYSNINGER SKRIVES PÅ VARELISTE.
     C     SVHK          SETLL     SVXVCN
     C     SVHK          READE     SVXVCN                                 33
     C   33SVHK          SETLL     SVXVDK
     C   33SVHK          READE     SVXVDK                                 33
     C   33SVHK          SETLL     SVXVFS
     C   33SVHK          READE     SVXVFS                                 33
     C   33SVHK          SETLL     SVXVMN
     C   33SVHK          READE     SVXVMN                                 33
     C   33SVHK          SETLL     SVXVTD
     C   33SVHK          READE     SVXVTD                                 33
     C   33SVHK          SETLL     SVXVVT
     C   33SVHK          READE     SVXVVT                                 33
      *
     C     XXALKT        COMP      *BLANKS                                41
     C     XXBLKT        COMP      *BLANKS                                42
     C     THTAID        COMP      *BLANKS                                43
     C     THTALK        COMP      *BLANKS                                44
     C     THOMD         COMP      0                                      46
     C     THDANT        COMP      0                                      47
     C     THBIND        COMP      *BLANKS                                48
     C     THGFT1        COMP      *BLANKS                                49
     C                   MOVE      '106'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     THTSD1        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT1
     C   34              EVAL      XKTXT1 = THTSD1
     C                   MOVEL     THTSD1        XHTSD1
     C                   MOVEL     THTSD2        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT2
     C   34              EVAL      XKTXT2 = THTSD2
     C                   MOVEL     THTSD2        XHTSD2
     C                   MOVEL     THTSD3        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT3
     C   34              EVAL      XKTXT3 = THTSD3
     C                   MOVEL     THTSD3        XHTSD3
     C                   MOVEL     THTSD4        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT4
     C   34              EVAL      XKTXT4 = THTSD4
     C                   MOVEL     THTSD4        XHTSD4
     C                   MOVEL     THTSD5        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT5
     C   34              EVAL      XKTXT5 = THTSD5
     C                   MOVEL     THTSD5        XHTSD5
     C                   MOVEL     THTSD6        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXT6
     C   34              EVAL      XKTXT6 = THTSD6
     C                   MOVEL     THTSD6        XHTSD6
     C                   MOVEL     THTSB         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C  N34              MOVEL     TKTXTN        XKTXTB
     C  N34              MOVEL     TKTXTN        XKTXTB2
     C   34              EVAL      XKTXTB = THTSB
     C   34              EVAL      XKTXTB2 = THTSB
     C                   MOVEL     THTSB         XXTSB
     C     THGBGI        IFEQ      1
     C                   MOVE      'EU'          XHGBGI
     C                   ELSE
     C                   MOVE      '  '          XHGBGI
     C                   END
      *
     C     XFMPOS        IFNE      0
     C                   Z-ADD     XFMPOS        XN
     C                   MOVE      PFFM1         XFFM1
     C     1             DO        18            X2                3 0
     C                   MOVE      ST2(X2)       ST1(XN)
     C                   ADD       1             XN
     C                   END
     C                   MOVE      XFFM1         PFFM1
     C                   MOVE      PFFM12        XFFM1
     C                   Z-ADD     XFMPOS        XN
     C     1             DO        18            X2
     C                   MOVE      ST2(X2)       ST1(XN)
     C                   ADD       1             XN
     C                   END
     C                   MOVE      XFFM1         PFFM12
     C                   END
      *
     C     XFMPOV        IFNE      0
     C                   Z-ADD     XFMPOV        XN
     C                   MOVE      PVFM1         XFFM1
     C     1             DO        18            X2                3 0
     C                   MOVE      ST2(X2)       ST1(XN)
     C                   ADD       1             XN
     C                   END
     C                   MOVE      XFFM1         PVFM1
     C                   Z-ADD     XFMPOV        XN
     C                   MOVE      PVFM12        XFFM1
     C     1             DO        18            X2                3 0
     C                   MOVE      ST2(X2)       ST1(XN)
     C                   ADD       1             XN
     C                   END
     C                   MOVE      XFFM1         PVFM12
     C                   END
      *
     C     SVHK          CHAIN     SVXHFV                             34
      *
     C                   SELECT
     C     THLSTL        WHENGT    0
     C                   MOVE      '1'           *IN29
     C                   EXSR      PRINT2
     C                   EXSR      PRINT4
     C     *IN34         WHENEQ    '0'
     C                   EXSR      PRINT5
     C     THVPOS        WHENLE    1
     C     *IN33         ANDEQ     '1'
     C                   MOVE      '0'           *IN29
     C                   EXSR      PRINT2
     C                   OTHER
     C                   MOVE      '0'           *IN29
     C                   EXSR      PRINT3
     C                   ENDSL
      *
      *** OPPDATERE SVXH-/HEAD-REGISTER
     C     STPRT1        TAG
     C  N32              MOVE      'Q'           THST
      * VED THWS<>TVINR OG TH0035=2 --> SENDE TOLLDEK. I TESTPERIODE
     C   32THWS          IFNE      'TVINR'
     C     TH0035        ANDEQ     '2'
     C                   MOVE      'Q'           THST
     C                   ELSE
     C     EDIM2K        SETLL     EDIM2
     C     EDIM2K1       READPE    EDIM2                                  33
      *
     C                   DOW       *IN33 = *OFF
     C                   SELECT
     C                   WHEN      M1N07 = '045'
     C                   MOVE      'Z'           THST
     C                   LEAVE
     C                   WHEN      M1N07 = '028'
     C                   MOVE      'U'           THST
     C                   LEAVE
     C                   WHEN      M1N07 = '029'
     C                   MOVE      'P'           THST
     C                   LEAVE
     C                   ENDSL
     C     EDIM2K1       READPE    EDIM2                                  33
     C                   ENDDO
N05  C   33              EVAL      THST='X'
      *
     C                   END
     C                   MOVE      *BLANKS       THWS
     C     PRTTYP        IFNE      'M'
     C     PRTTYP        ANDNE     'E'
     C                   exsr      arkivsr
N04  C                   MOVE      THST          XTHST             1
N04  C     SVHK          CHAIN     SVXH                               33
N04  C                   MOVE      XTHST         THST
N04  C                   MOVE      *BLANKS       THWS
     C                   EXCEPT    UPDSVH
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              MOVE      'P'           HEPK6
     C  N33              UPDATE    HEADFR
     C                   END
      *
     C     SLPRI         ENDSR
      *
     C***********************************************
     C     TSTIE29       BEGSR
     C***********************************************
     C                   MOVE      'N'           XIE29             1
     C                   MOVE      'R'           XSR1              1
     C                   MOVE      '99999999'    MAX0B             8 0
     C     EDIM4K1       KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
     C                   KFLD                    MAX0B
     C     EDIM4K2       KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
     C     EDIM4K1       SETLL     EDIM4
     C     EDIM4K2       READPE    EDIM4                                  33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((M4_MST <> 'D') AND (M4_M1001 = 'STE'))
     C                   IF        (((M4_M1N07 = '029') OR
     C                               (M4_M1N07 = '045')) OR
     C                               (M4_M1N07 = 'CTL'))
     C                   MOVE      'J'           XIE29
     C                   END
     C                   LEAVE
     C                   END
     C     EDIM4K2       READPE    EDIM4                                  33
     C                   ENDDO
      *
     C                   ENDSR
      *
      ***********************************************
     C     PRINT1        BEGSR
      ***********************************************
     C                   MOVE      '106'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVE      *BLANKS       TKTXTN
     C                   MOVEL     THCATS        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVE      TKTXTN        XHCATS
     C                   MOVE      *BLANKS       TKTXTN
     C                   MOVEL     THTSB         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVE      TKTXTN        XHTSB
     C     THWS          COMP      'TVINR'                                28
     C                   WRITE     SVX014R1
      *
     C                   ENDSR
      *
      ***********************************************
     C     PRINT2        BEGSR
      ***********************************************
     C     SVHK          SETLL     SVXV
     C     SVHK          READE     SVXV                                   33
     C                   Z-ADD     1             TVLN
     C                   EXCEPT    UPDSVV
      *
     C                   EXSR      TSTAM
     C                   EXSR      HENTOP
      *
     C                   Z-ADD     1             XSIDEN            3 0
     C                   Z-ADD     1             XSIDET            3 0
     C                   WRITE     SVX014F1
     C                   WRITE     SVX014F2
     C                   WRITE     SVX014F3
     C                   WRITE     SVX014F5
S01  C*                  WRITE     SVX014F6P
N01  C                   WRITE     SVX014F6
     C                   WRITE     SVX014F7
      * VED PAPIRBASERT LASTELISTE PRINTES ALLTID RETUR EKSEMPLAR
      * ELLER TEST OM RETUR EKSAMPLAR SKAL PRINTERS
     C  N97THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C     THLSTL        ORGT      0
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014FB1
     C                   WRITE     SVX014FB2
     C                   WRITE     SVX014FB3
     C                   WRITE     SVX014FB5
S01  C*                  WRITE     SVX014FB6P
N01  C                   WRITE     SVX014FB6
     C                   WRITE     SVX014FB7
     C                   MOVE      '0'           *IN96
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     PRINT3        BEGSR
      ***********************************************
     C                   EXSR      TSTAM
     C                   EXSR      SJTOTS
      *
     C                   IF        XULIK = 'J'
     C                   MOVE      THTINS        XTINS            17
     C                   MOVE      THNAS         XNAS             30
     C                   MOVE      THADS1        XADS1            30
     C                   MOVE      THPNS         XPNS              9
     C                   MOVE      THPSS         XPSS             24
     C                   MOVE      THLKS         XLKS              2
     C                   EVAL      THTINS = *BLANKS
     C                   EVAL      THNAS  = 'FORSKJELLIG'
     C                   EVAL      THADS1 = *BLANKS
     C                   EVAL      THPNS  = *BLANKS
     C                   EVAL      THPSS  = *BLANKS
     C                   EVAL      THLKS  = *BLANKS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   MOVE      THTINK        XTINK            17
     C                   MOVE      THNAK         XNAK             30
     C                   MOVE      THADK1        XADK1            30
     C                   MOVE      THPNK         XPNK              9
     C                   MOVE      THPSK         XPSK             24
     C                   MOVE      THLKK         XLKK              2
     C                   EVAL      THTINK = *BLANKS
     C                   EVAL      THNAK  = 'FORSKJELLIG'
     C                   EVAL      THADK1 = *BLANKS
     C                   EVAL      THPNK  = *BLANKS
     C                   EVAL      THPSK  = *BLANKS
     C                   EVAL      THLKK  = *BLANKS
     C                   END
      *
      * SKRIV UT FØLGESEDDEL SOM FORSIDE TIL VARELISTE
     C                   Z-ADD     1             XSIDEN            3 0
     C                   WRITE     SVX014F1
     C                   WRITE     SVX014F2
     C                   WRITE     SVX014F4
     C                   WRITE     SVX014F5
S01  C*                  WRITE     SVX014F6P
N01  C                   WRITE     SVX014F6
     C                   WRITE     SVX014F7
     C  N97THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014FB1
     C                   WRITE     SVX014FB2
     C                   WRITE     SVX014FB4
     C                   WRITE     SVX014FB5
S01  C*                  WRITE     SVX014FB6P
N01  C                   WRITE     SVX014FB6
     C                   WRITE     SVX014FB7
     C                   MOVE      '0'           *IN96
     C                   END
      *
     C                   IF        XULIK = 'J'
     C                   MOVE      XTINS         THTINS
     C                   MOVE      XNAS          THNAS
     C                   MOVE      XADS1         THADS1
     C                   MOVE      XPNS          THPNS
     C                   MOVE      XPSS          THPSS
     C                   MOVE      XLKS          THLKS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   MOVE      XTINK         THTINK
     C                   MOVE      XNAK          THNAK
     C                   MOVE      XADK1         THADK1
     C                   MOVE      XPNK          THPNK
     C                   MOVE      XPSK          THPSK
     C                   MOVE      XLKK          THLKK
     C                   END
      *
     C                   ADD       1             XSIDEN            3 0
     C                   MOVE      *ZEROS        XLINNR            3 0
     C                   MOVE      *ZEROS        XLN
     C                   WRITE     SVX014V1
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VB1
     C                   MOVE      '0'           *IN96
     C                   END
      *
     C     SVHK          SETLL     SVXV
     C     SVHK          READE     SVXV                                   33
     C     *IN33         DOWEQ     '0'
     C                   ADD       1             XLN
     C                   MOVE      XLN           TVLN
     C                   EXCEPT    UPDSVV
     C     TVNT          IFEQ      0
     C                   MOVE      TVNTEH        TVNT
     C                   END
      *
     C                   EXSR      HENTOP
      *
     C                   MOVE      '0'           *IN98
     C                   MOVE      '017'         YUNIK
     C                   EVAL      YKODE = TVEH
     C     SVK01K        CHAIN     SVXKODL01                          33
     C  N33              IF        TVNTEH = 0
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   ELSE
     C                   EVAL      XTKTXTE = 'PIECES'
     C                   END
     C   33              MOVEL     *BLANKS       XTKTXTE
      *
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
      *
     C                   IF        *IN33 = *OFF
     C                   MOVE      *ZEROS        TVNT
     C                   MOVE      *BLANKS       TVMN
     C                   MOVE      *BLANKS       TVCNR
     C                   MOVE      *BLANKS       TVVT
     C                   SELECT
     C                   WHEN      XTKTXTE = 'PIECES'
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
     C                   WHEN      TKTXTE <> '.'
     C                   MOVEL     TKTXTE        XTKTXTE
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
     C                   ENDSL
     C                   END
      *
      * LES ANTALL EKSTRA MERKE & NR, CONTAINERNR OG VAREBESKRIVELSE
     C     SVVK          SETLL     SVXVMN
     C     SVVK          SETLL     SVXVCN
     C     SVVK          SETLL     SVXVVT
     C                   MOVEA     '000'         *IN(34)
     C     STPR31        TAG
     C  N34SVVK          READE     SVXVMN                                 34
     C  N35SVVK          READE     SVXVCN                                 35
     C  N36SVVK          READE     SVXVVT                                 36
     C  N34
     CORN35
     CORN36              DO
     C   34              MOVE      *BLANKS       TVMN
     C   35              MOVE      *BLANKS       TVCNR
     C   36              MOVE      *BLANKS       TVVT
     C                   MOVE      '017'         YUNIK
     C                   EVAL      YKODE = TVEH
     C     SVK01K        CHAIN     SVXKODL01                          33
     C  N33              IF        TVNTEH = 0
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   ELSE
     C                   EVAL      XTKTXTE = 'PIECES'
     C                   END
     C   33              MOVEL     *BLANKS       XTKTXTE
      *
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
      *
     C                   IF        *IN33 = *OFF
     C                   MOVE      *ZEROS        TVNT
     C                   MOVE      *BLANKS       TVMN
     C                   MOVE      *BLANKS       TVCNR
     C                   MOVE      *BLANKS       TVVT
     C                   SELECT
     C                   WHEN      XTKTXTE = 'PIECES'
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
     C                   WHEN      TKTXTE <> '.'
     C                   MOVEL     TKTXTE        XTKTXTE
     C                   WRITE     SVX014V2
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB2
     C                   END
     C                   EXSR      NYSIDE
     C                   ENDSL
     C                   END
      *
     C                   GOTO      STPR31
     C                   ENDDO
      *
     C                   EXSR      SKILLE
      *
     C                   MOVE      '0'           *IN98
     C     TVDK          IFEQ      *BLANKS
     C                   MOVE      '---'         TVDK
     C                   END
      *
     C                   WRITE     SVX014V4
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB4
     C                   END
     C     TVDK          IFEQ      '---'
     C                   MOVE      *BLANKS       TVDK
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
      *
      * LES ANTALL EKSTRA FØLSOMME VARE, TIDLIGERE DOKUMENT
     C     SVVK          SETLL     SVXVFS
     C     SVVK          SETLL     SVXVTD
     C                   MOVEA     '00'          *IN(34)
     C     STPR32        TAG
     C  N34SVVK          READE     SVXVFS                                 34
     C  N35SVVK          READE     SVXVTD                                 35
     C  N34
     CORN35              DO
     C   34              MOVE      *BLANKS       TVFV
     C   34              MOVE      *ZEROS        TVFVNT
     C   35              MOVE      *BLANKS       TVTDT
     C   35              MOVE      *BLANKS       TVTDR
      *
     C                   WRITE     SVX014V4
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB4
     C                   END
     C                   EXSR      NYSIDE
     C                   GOTO      STPR32
     C                   ENDDO
      *
     C                   EXSR      SKILLE
      *
     C                   MOVE      '0'           *IN98
     C     TVDTY         IFNE      *BLANKS
     C     TVDO          OREQ      *BLANKS
     C     TVTLO         ANDEQ     *BLANKS
     C     TVMTXT        ANDEQ     *BLANKS
     C                   MOVE      X2DTY         XVDTY            28
      *
     C                   WRITE     SVX014V5
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB5
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
     C                   GOTO      STPR36
     C                   END
      *
     C     STPR33        TAG
     C                   MOVE      XXDO          TVDO
     C     TVDO          IFNE      *BLANKS
      *
     C                   WRITE     SVX014V6
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB6
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
     C                   GOTO      STPR37
     C                   END
      *
     C     STPR34        TAG
     C                   MOVE      XXTLO         TVTLO
     C                   MOVE      XXEXKD        TVEXKD
     C                   MOVE      XXEXLK        TVEXLK
     C     TVTLO         IFNE      *BLANKS
     C                   MOVE      X2TLO         XVTLO            35
     C                   MOVE      X2EXKD        XVEXKD            2
      *
     C                   WRITE     SVX014V7
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB7
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
     C                   GOTO      STPR38
     C                   END
      *
     C     STPR35        TAG
     C                   MOVE      XXMTXT        TVMTXT
     C     TVMTXT        IFNE      *BLANKS
      *
     C                   WRITE     SVX014V8
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB8
     C                   END
     C                   EXSR      NYSIDE
     C                   MOVE      '1'           *IN98
     C                   END
     C                   GOTO      STPR39
      *
     C     STPR36        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVDTY         IFNE      *BLANKS
     C                   MOVE      '013'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVDTY         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        XVDTY
      *
     C                   WRITE     SVX014V5
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB5
     C                   END
     C                   EXSR      NYSIDE
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STPR33
      *
     C     STPR37        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVDO          IFNE      *BLANKS
      *
     C                   WRITE     SVX014V6
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB6
     C                   END
     C                   EXSR      NYSIDE
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STPR34
      *
     C     STPR38        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVTLO         IFNE      *BLANKS
     C                   MOVE      '039'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVTLO         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        XVTLO
     C     TVEXKD        IFEQ      1
     C                   MOVE      'EU'          XVEXKD
     C                   ELSE
     C                   MOVE      *BLANKS       XVEXKD
     C                   END
      *
     C                   WRITE     SVX014V7
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB7
     C                   END
     C                   EXSR      NYSIDE
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STPR35
      *
     C     STPR39        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVMTXT        IFNE      *BLANKS
      *
     C                   WRITE     SVX014V8
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB8
     C                   END
     C                   EXSR      NYSIDE
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
      *
     C                   EXSR      SKILLE
      *
     C                   WRITE     SVX014V9
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB9
     C                   END
     C                   EXSR      NYSIDE
     C     TVADS1        IFNE      *BLANKS
     C     TVADK1        ORNE      *BLANKS
      *
     C                   WRITE     SVX014VA
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VBA
     C                   END
     C     TVPNS         IFEQ      *BLANKS
     C     TVPNK         ANDEQ     *BLANKS
     C     TVPSS         ANDEQ     *BLANKS
     C     TVPSK         ANDEQ     *BLANKS
     C     XLN           ANDEQ     THVPOS
     C                   ELSE
     C                   EXSR      NYSIDE
     C                   END
     C                   END
     C     TVPNS         IFNE      *BLANKS
     C     TVPNK         ORNE      *BLANKS
      *
     C                   WRITE     SVX014VB
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VBB
     C                   END
     C                   IF        XLN < THVPOS
     C                   EXSR      NYSIDE
     C                   END
     C                   END
     C     TVPNS         IFEQ      *BLANKS
     C     TVPNK         ANDEQ     *BLANKS
     C     TVPSS         IFNE      *BLANKS
     C     TVPSK         ORNE      *BLANKS
      *
     C                   WRITE     SVX014VC
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VBC
     C                   END
     C                   IF        XLN < THVPOS
     C                   EXSR      NYSIDE
     C                   END
     C                   END
     C                   END
      *
     C                   IF        XLN = THVPOS
     C                   MOVE      'S'           XSISTL
     C                   END
     C                   EXSR      SKILLE
      *
     C     XLN           IFEQ      THVPOS
     C                   WRITE     SVX014VD
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VBD
     C                   MOVE      '0'           *IN96
     C                   END
     C                   ELSE
     C                   MOVE      'J'           XSISTL            1
     C                   EXSR      SKILLE
     C                   MOVE      'N'           XSISTL
     C                   END
      *
     C     SVHK          READE     SVXV                                   33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
      ***********************************************
     C     PRINT4        BEGSR
      ***********************************************
     C     KODTAK        CHAIN     KODTA                              33
     C                   MOVE      KOAKNR        YKN
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              DO                                                     1<-B
     C                   MOVE      KNAVN         XKNAVN
     C                   MOVE      ADR1          XKAD1
     C                   MOVE      ADR2          XKAD2
     C                   MOVE      *BLANKS       XKAD3
     C     POSTNR        IFEQ      0                                             2<-B
     C                   MOVEL     ADR3          XKAD3
     C                   ELSE                                                    2
     C                   MOVEL     POSTNR        XKAD3
     C                   MOVE      ADR3          XKAD3
     C                   END                                                     2<-E
     C                   END
     C     THPRO         CHAIN     TURER14                            33
     C                   MOVE      TUDTD         XUDTD
     C                   MOVE      TUDTM         XUDTM
     C                   MOVE      TUDTÅ         XUDTÅ
     C                   MOVE      TUKNA         YKN
     C     KUND1K        CHAIN     CUNDL01                            33
     C                   MOVE      KNAVN         XANAVN           30
      *
     C     THFMLL        COMP      'J'                                    27
     C                   Z-ADD     0             XLN
     C                   Z-ADD     21            XANTL             2 0
     C                   Z-ADD     1             XSIDE             2 0
     C                   WRITE     SVX014L1
      *
     C     SVHK          SETLL     SVXHL
     C     SVHK          READE     SVXHL                                  33
     C     *IN33         DOWEQ     '0'                                          1<-B
     C     TLTLKU        COMP      'X'                                    28
     C     SVHLK         CHAIN(N)  HEADF                              99
     C     HEVS2         COMP      *BLANKS                                99
     C   99HEGM2         COMP      *BLANKS                                99
     C   99              ADD       1             XANTL
     C  N99              ADD       2             XANTL
     C     TLTXT         COMP      *BLANKS                                98
     C  N98              ADD       1             XANTL
     C     XANTL         IFGE      62                                            2<-B
     C  N99
     CAN 27XANTL         IFEQ      62                                             3<-B
     C                   WRITE     SVX014L5
     C                   END                                                      3<-E
     C                   WRITE     SVX014L6
     C                   ADD       1             XSIDE
     C                   WRITE     SVX014L1
     C                   Z-ADD     22            XANTL
     C  N99              ADD       1             XANTL
     C                   END                                                     2<-E
     C                   ADD       1             XLN
     C                   WRITE     SVX014L2
     C  N99              WRITE     SVX014L3
     C  N98              WRITE     SVX014L4
      *
     C     SVHK          READE     SVXHL                                  33
     C  N33              ENDDO                                                  1<-E
      *
     C   27XANTL         DOWLE     62                                           1<-B
     C                   WRITE     SVX014L5
     C                   ADD       1             XANTL
     C                   END                                                    1<-E
     C                   WRITE     SVX014L6
      *
     C                   ENDSR
      *
      ***********************************************
     C     PRINT5        BEGSR
      ***********************************************
     C                   EXSR      TSTAM
     C                   EXSR      TSTAMS
     C                   EXSR      SJTOTS2
      *
     C                   IF        XULIK = 'J'
     C                   MOVE      THTINS        XTINS            17
     C                   MOVE      THNAS         XNAS             30
     C                   MOVE      THADS1        XADS1            30
     C                   MOVE      THPNS         XPNS              9
     C                   MOVE      THPSS         XPSS             24
     C                   MOVE      THLKS         XLKS              2
     C                   EVAL      THTINS = *BLANKS
     C                   EVAL      THNAS  = 'FORSKJELLIG'
     C                   EVAL      THADS1 = *BLANKS
     C                   EVAL      THPNS  = *BLANKS
     C                   EVAL      THPSS  = *BLANKS
     C                   EVAL      THLKS  = *BLANKS
     C                   END
     C                   IF        XULIKS = 'J'
     C                   MOVE      THTINSS       XTINSS           17
     C                   MOVE      THNASS        XNASS            30
     C                   MOVE      THADSS1       XADSS1           30
     C                   MOVE      THPNSS        XPNSS             9
     C                   MOVE      THPSSS        XPSSS            24
     C                   MOVE      THLKSS        XLKSS             2
     C                   EVAL      THTINSS = *BLANKS
     C                   EVAL      THNASS  = 'FORSKJELLIG'
     C                   EVAL      THADSS1 = *BLANKS
     C                   EVAL      THPNSS  = *BLANKS
     C                   EVAL      THPSSS  = *BLANKS
     C                   EVAL      THLKSS  = *BLANKS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   MOVE      THTINK        XTINK            17
     C                   MOVE      THNAK         XNAK             30
     C                   MOVE      THADK1        XADK1            30
     C                   MOVE      THPNK         XPNK              9
     C                   MOVE      THPSK         XPSK             24
     C                   MOVE      THLKK         XLKK              2
     C                   EVAL      THTINK = *BLANKS
     C                   EVAL      THNAK  = 'FORSKJELLIG'
     C                   EVAL      THADK1 = *BLANKS
     C                   EVAL      THPNK  = *BLANKS
     C                   EVAL      THPSK  = *BLANKS
     C                   EVAL      THLKK  = *BLANKS
     C                   END
     C                   IF        XULIKSM = 'J'
     C                   MOVE      THTINKS       XTINKS           17
     C                   MOVE      THNAKS        XNAKS            30
     C                   MOVE      THADKS1       XADKS1           30
     C                   MOVE      THPNKS        XPNKS             9
     C                   MOVE      THPSKS        XPSKS            24
     C                   MOVE      THLKKS        XLKKS             2
     C                   EVAL      THTINKS = *BLANKS
     C                   EVAL      THNAKS  = 'FORSKJELLIG'
     C                   EVAL      THADKS1 = *BLANKS
     C                   EVAL      THPNKS  = *BLANKS
     C                   EVAL      THPSKS  = *BLANKS
     C                   EVAL      THLKKS  = *BLANKS
     C                   END
      *
      * SKRIV UT FØLGESEDDEL SOM FORSIDE TIL VARELISTE
     C                   Z-ADD     1             XSIDEN            3 0
     C                   WRITE     SVX014FF1
     C                   WRITE     SVX014FF2
     C                   WRITE     SVX014FF3
     C                   WRITE     SVX014FF4
     C                   WRITE     SVX014FF5
      *
     C                   IF        XULIK = 'J'
     C                   MOVE      XTINS         THTINS
     C                   MOVE      XNAS          THNAS
     C                   MOVE      XADS1         THADS1
     C                   MOVE      XPNS          THPNS
     C                   MOVE      XPSS          THPSS
     C                   MOVE      XLKS          THLKS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   MOVE      XTINK         THTINK
     C                   MOVE      XNAK          THNAK
     C                   MOVE      XADK1         THADK1
     C                   MOVE      XPNK          THPNK
     C                   MOVE      XPSK          THPSK
     C                   MOVE      XLKK          THLKK
     C                   END
      *
     C                   IF        XULIKS = 'J'
     C                   MOVE      XTINSS        THTINSS
     C                   MOVE      XNASS         THNASS
     C                   MOVE      XADSS1        THADSS1
     C                   MOVE      XPNSS         THPNSS
     C                   MOVE      XPSSS         THPSSS
     C                   MOVE      XLKSS         THLKSS
     C                   END
     C                   IF        XULIKSM = 'J'
     C                   MOVE      XTINKS        THTINKS
     C                   MOVE      XNAKS         THNAKS
     C                   MOVE      XADKS1        THADKS1
     C                   MOVE      XPNKS         THPNKS
     C                   MOVE      XPSKS         THPSKS
     C                   MOVE      XLKKS         THLKKS
     C                   END
      *
     C                   ADD       1             XSIDEN            3 0
     C                   MOVE      *ZEROS        XLINNR            3 0
     C                   MOVE      *ZEROS        XLN
     C                   WRITE     SVX014FV1
      *
     C     SVHK          SETLL     SVXV
     C     SVHK          READE     SVXV                                   33
     C     *IN33         DOWEQ     '0'
     C     SVVK          CHAIN     SVXVFV                             33
     C                   IF        (*IN33 OR (TVTKBM  = *BLANKS))
     C                   EVAL      TVTKBM  = THTKBM
     C                   END
     C                   IF        (*IN33 OR (TVKREF  = *BLANKS))
     C                   EVAL      TVKREF  = THKREF
     C                   END
     C                   IF        XULIK = 'J'
     C                   IF        TVNAS  = *BLANKS
     C                   EVAL      TVS1 = %TRIM(THTINS) + ' '
     C                             + %TRIM(THNAS)
     C                   EVAL      TVS2 = %TRIM(THADS1) + ' '
     C                             + %TRIM(THLKS)
     C                   EVAL      TVS3 = %TRIM(THPNS) + ' '
     C                             + %TRIM(THPSS)
     C                   ELSE
     C                   EVAL      TVS1 = %TRIM(TVTINS) + ' '
     C                             + %TRIM(TVNAS)
     C                   EVAL      TVS2 = %TRIM(TVADS1) + ' '
     C                             + %TRIM(TVLKS)
     C                   EVAL      TVS3 = %TRIM(TVPNS) + ' '
     C                             + %TRIM(TVPSS)
     C                   END
     C                   ELSE
     C                   EVAL      TVS1 = *BLANKS
     C                   EVAL      TVS2 = *BLANKS
     C                   EVAL      TVS3 = *BLANKS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   IF        TVNAK  = *BLANKS
     C                   EVAL      TVK1 = %TRIM(THTINK) + ' '
     C                             + %TRIM(THNAK)
     C                   EVAL      TVK2 = %TRIM(THADK1) + ' '
     C                             + %TRIM(THLKK)
     C                   EVAL      TVK3 = %TRIM(THPNK) + ' '
     C                             + %TRIM(THPSK)
     C                   ELSE
     C                   EVAL      TVK1 = %TRIM(TVTINK) + ' '
     C                             + %TRIM(TVNAK)
     C                   EVAL      TVK2 = %TRIM(TVADK1) + ' '
     C                             + %TRIM(TVLKK)
     C                   EVAL      TVK3 = %TRIM(TVPNK) + ' '
     C                             + %TRIM(TVPSK)
     C                   END
     C                   ELSE
     C                   EVAL      TVK1 = *BLANKS
     C                   EVAL      TVK2 = *BLANKS
     C                   EVAL      TVK3 = *BLANKS
     C                   END
     C                   IF        XULIKS = 'J'
     C                   IF        (*IN33 OR
     C                             (((TVNASS  = *BLANKS) AND (TVNAS = THNAS)) OR
     C                             ((TVNASS  = *BLANKS) AND (TVNAS = *BLANKS))))
     C                   EVAL      TVSS1 = %TRIM(THTINSS) + ' '
     C                             + %TRIM(THNASS)
     C                   EVAL      TVSS2 = %TRIM(THADSS1) + ' '
     C                             + %TRIM(THLKSS)
     C                   EVAL      TVSS3 = %TRIM(THPNSS) + ' '
     C                             + %TRIM(THPSSS)
     C                   ELSE
     C                   EVAL      TVSS1 = %TRIM(TVTINSS) + ' '
     C                             + %TRIM(TVNASS)
     C                   EVAL      TVSS2 = %TRIM(TVADSS1) + ' '
     C                             + %TRIM(TVLKSS)
     C                   EVAL      TVSS3 = %TRIM(TVPNSS) + ' '
     C                             + %TRIM(TVPSSS)
     C                   END
     C                   ELSE
     C                   EVAL      TVSS1 = *BLANKS
     C                   EVAL      TVSS2 = *BLANKS
     C                   EVAL      TVSS3 = *BLANKS
     C                   END
     C                   IF        XULIKSM = 'J'
     C                   IF        (*IN33 OR
     C                             (((TVNAKS  = *BLANKS) AND (TVNAK = THNAK)) OR
     C                             ((TVNAKS  = *BLANKS) AND (TVNAK = *BLANKS))))
     C                   EVAL      TVKS1 = %TRIM(THTINKS) + ' '
     C                             + %TRIM(THNAKS)
     C                   EVAL      TVKS2 = %TRIM(THADKS1) + ' '
     C                             + %TRIM(THLKKS)
     C                   EVAL      TVKS3 = %TRIM(THPNKS) + ' '
     C                             + %TRIM(THPSKS)
     C                   ELSE
     C                   EVAL      TVKS1 = %TRIM(TVTINKS) + ' '
     C                             + %TRIM(TVNAKS)
     C                   EVAL      TVKS2 = %TRIM(TVADKS1) + ' '
     C                             + %TRIM(TVLKKS)
     C                   EVAL      TVKS3 = %TRIM(TVPNKS) + ' '
     C                             + %TRIM(TVPSKS)
     C                   END
     C                   ELSE
     C                   EVAL      TVKS1 = *BLANKS
     C                   EVAL      TVKS2 = *BLANKS
     C                   EVAL      TVKS3 = *BLANKS
     C                   END
      *
     C                   ADD       1             XLN
     C                   MOVE      XLN           TVLN
     C                   EXCEPT    UPDSVV
     C     TVNT          IFEQ      0
     C                   MOVE      TVNTEH        TVNT
     C                   END
      *
     C                   EXSR      HENTOP
      *
     C                   MOVE      '0'           *IN98
     C                   WRITE     SVX014FV2
     C                   EXSR      NYSIDE2
     C                   MOVE      '1'           *IN98
      *
     C                   EXSR      SKILLE2
      *
      * AVSENDER/MOTTAKER
     C                   WRITE     SVX014FV4
     C                   EXSR      NYSIDE2
     C                   IF        ((XULIK = 'J') OR (XULIKM = 'J'))
     C                   WRITE     SVX014FV5
     C                   ADD       1             XLINNR
     C                   EXSR      NYSIDE2
     C                   END
      *
     C                   EXSR      SKILLE2
      *
      * AVSENDER/MOTTAKER SIKKERHET
     C                   WRITE     SVX014FV6
     C                   EXSR      NYSIDE2
     C                   IF        ((XULIKS = 'J') OR (XULIKSM = 'J'))
     C                   WRITE     SVX014FV7
     C                   ADD       2             XLINNR
     C                   EXSR      NYSIDE2
     C                   END
      *
     C                   EXSR      SKILLE2
      *
      * LES ANTALL EKSTRA MERKE & NR, CONTAINERNR OG VAREBESKRIVELSE
     C                   MOVE      *BLANKS       R441
     C                   MOVE      *BLANKS       R401
      *
     C                   Z-ADD     1             XN                3 0
     C                   EVAL      R401(1) = %TRIM(TVTDR) + %TRIM(TVTDO)
      * XN1 ER SISTE TIDLIGERE DOK. I TAB R401
     C                   IF        R401(1) = *BLANKS
     C                   Z-ADD     0             XN1               3 0
     C                   ELSE
     C     SVVK          SETLL     SVXVTD
     C     SVVK          READE     SVXVTD                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((TVTDR <> *BLANKS) OR (TVTDO <> *BLANKS))
     C                   ADD       1             XN
     C                   EVAL      R401(1) = %TRIM(TVTDR) + ' ' + %TRIM(TVTDO)
     C                   END
     C     SVVK          READE     SVXVTD                                 33
     C                   ENDDO
     C                   EVAL      XN1 = XN
     C                   END
      *
     C                   Z-ADD     XN1           XN2               3 0
     C*                  EVAL      R441(1) = %TRIM(TVDREF) + %TRIM(TVDO)
     C                   EVAL      R441(1) = %TRIM(TVDTY) + ' ' + %TRIM(TVDREF)
     C                             + ' ' + %TRIM(TVDO)
     C                   IF        TVMTXT <> *BLANKS
     C                   ADD       1             XN2
     C                   EVAL      R401(XN2) = %TRIM(XTVEXKD) + ' '
     C                             + %TRIM(TVEXLK) + ' '
     C                             + %TRIM(TVTLO) + ' ' + %TRIM(TVMTXT)
     C                   END
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((TVDREF <> *BLANKS) OR (TVDO <> *BLANKS))
     C                   ADD       1             XN
     C                   EVAL      R441(XN) = %TRIM(TVDTY) + ' ' + %TRIM(TVDREF)
     C                             + ' ' + %TRIM(TVDO)
     C                   END
     C                   IF        TVMTXT <> *BLANKS
     C                   ADD       1             XN2
     C                   EVAL      R401(XN2) = %TRIM(XTVEXKD) + ' '
     C                             + %TRIM(TVEXLK) + ' '
     C                             + %TRIM(TVTLO) + ' ' + %TRIM(TVMTXT)
     C                   END
     C     SVVK          READE     SVXVDK                                 33
     C                   ENDDO
      *
     C                   EVAL      XR441 = R441(1)
     C                   EVAL      XR401 = R401(1)
     C                   WRITE     SVX014FV8
     C                   IF        XN1 <= 1
     C                   IF        ((R401(2) = *BLANKS) AND (R441(2) = *BLANKS))
     C                   WRITE     SVX014FV8A
     C                   ELSE
     C                   WRITE     SVX014FV8B
     C                   END
     C                   END
     C                   EXSR      NYSIDE2
     C     2             DO        20            XN
     C                   IF        ((R441(XN) = *BLANKS) AND
     C                              (R401(XN) = *BLANKS))
     C                   LEAVE
     C                   END
     C                   EVAL      XR441 = R441(XN)
     C                   EVAL      XR401 = R401(XN)
     C                   WRITE     SVX014FV8
     C                   IF        XN = XN1
     C                   EVAL      XN2 = XN1 + 1
     C                   IF        ((R401(XN2)=*BLANKS) AND (R441(XN2)=*BLANKS))
     C                   WRITE     SVX014FV8A
     C                   ELSE
     C                   WRITE     SVX014FV8B
     C                   END
     C                   END
     C                   EXSR      NYSIDE2
     C                   ENDDO
      *
     C                   EXSR      SKILLE2
      *
     C                   IF        TVKREF = *BLANKS
     C                   EVAL      TVKREF = THKREF
     C                   END
     C                   EVAL      XVKREF = TVKREF
     C                   WRITE     SVX014FV9
     C                   EXSR      NYSIDE2
      *
     C                   EXSR      SKILLE2
      *
     C                   MOVE      *BLANKS       CNR
     C                   IF        TVCNR <> *BLANKS
     C                   Z-ADD     1             XN
     C                   EVAL      CNR(1) = TVCNR
     C     SVVK          SETLL     SVXVCN
     C     SVVK          READE     SVXVCN                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN
     C                   EVAL      CNR(XN) = TVCNR
     C     SVVK          READE     SVXVCN                                 33
     C                   ENDDO
     C                   END
      *
     C                   MOVE      *BLANKS       DFKD
     C                   IF        THDFKD <> *BLANKS
     C                   Z-ADD     1             XN
     C                   EVAL      DFKD(1) = THDFKD
     C     SVHK          SETLL     SVXVFS
     C     SVHK          READE     SVXVFS                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN
     C                   EVAL      DFKD(XN) = THDFKD
     C     SVHK          READE     SVXVFS                                 33
     C                   ENDDO
     C                   END
      *
     C                   EVAL      XHTGID = THTGID
     C                   EVAL      XHTGLK = THTGLK
     C                   EVAL      XHDFKD = DFKD(1)
     C                   EVAL      XVCNR  = CNR(1)
     C                   WRITE     SVX014FVA
     C                   EXSR      NYSIDE2
     C                   EVAL      XHTGID = *BLANKS
     C                   EVAL      XHTGLK = *BLANKS
     C     2             DO        20            XN
     C                   IF        ((CNR(XN)=*BLANKS) AND (DFKD(XN)=*BLANKS))
     C                   LEAVE
     C                   END
     C                   EVAL      XHDFKD = DFKD(XN)
     C                   EVAL      XVCNR  = CNR(XN)
     C                   WRITE     SVX014FVA
     C                   EXSR      NYSIDE2
     C                   ENDDO
      *
     C                   EXSR      SKILLE2
      *
     C                   WRITE     SVX014FVB
     C                   EXSR      NYSIDE2
      *
     C                   EXSR      SKILLE2
      *
     C                   WRITE     SVX014FVC
     C                   EXSR      NYSIDE2
      *
     C                   EXSR      SKILLE2
      *
     C     XLN           IFEQ      THVPOS
     C                   WRITE     SVX014FVD
     C                   ELSE
     C                   MOVE      'J'           XSISTL            1
     C                   EXSR      SKILLE2
     C                   MOVE      'N'           XSISTL
     C                   END
      *
     C     SVHK          READE     SVXV                                   33
     C  N33              ENDDO
      *
     C                   IF        XULIK = 'J'
     C                   MOVE      XTINS         THTINS
     C                   MOVE      XNAS          THNAS
     C                   MOVE      XADS1         THADS1
     C                   MOVE      XPNS          THPNS
     C                   MOVE      XPSS          THPSS
     C                   MOVE      XLKS          THLKS
     C                   END
     C                   IF        XULIKS = 'J'
     C                   MOVE      XTINSS        THTINSS
     C                   MOVE      XNASS         THNASS
     C                   MOVE      XADSS1        THADSS1
     C                   MOVE      XPNSS         THPNSS
     C                   MOVE      XPSSS         THPSSS
     C                   MOVE      XLKSS         THLKSS
     C                   END
     C                   IF        XULIKM = 'J'
     C                   MOVE      XTINK         THTINK
     C                   MOVE      XNAK          THNAK
     C                   MOVE      XADK1         THADK1
     C                   MOVE      XPNK          THPNK
     C                   MOVE      XPSK          THPSK
     C                   MOVE      XLKK          THLKK
     C                   END
     C                   IF        XULIKSM = 'J'
     C                   MOVE      XTINKS        THTINKS
     C                   MOVE      XNAKS         THNAKS
     C                   MOVE      XADKS1        THADKS1
     C                   MOVE      XPNKS         THPNKS
     C                   MOVE      XPSKS         THPSKS
     C                   MOVE      XLKKS         THLKKS
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     NYSIDE        BEGSR
      ***********************************************
     C                   ADD       1             XLINNR
     C     XLINNR        IFGE      46
     C     XSISTL        IFNE      'J'
     C                   WRITE     SVX014V3
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB3
     C                   END
     C                   END
     C                   WRITE     SVX014VD
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VBD
     C                   MOVE      '0'           *IN96
     C                   END
     C                   MOVE      *ZEROS        XLINNR
     C                   ADD       1             XSIDEN
     C                   WRITE     SVX014V1
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VB1
     C                   MOVE      '0'           *IN96
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     NYSIDE2       BEGSR
      ***********************************************
     C                   ADD       1             XLINNR
     C     XLINNR        IFGE      44
     C     XSISTL        IFNE      'J'
     C                   WRITE     SVX014FV3
     C                   END
     C                   WRITE     SVX014FVD
     C                   MOVE      *ZEROS        XLINNR
     C                   ADD       1             XSIDEN
     C                   WRITE     SVX014FV1
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     SKILLE        BEGSR
      ***********************************************
     C     XLINNR        IFGT      0
     C     XLINNR        ANDLE     46
     C                   WRITE     SVX014V3
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   WRITE     SVX014VB3
     C                   END
     C     XLINNR        IFEQ      46
     C     XSISTL        ANDNE     'S'
     C                   WRITE     SVX014VD
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VBD
     C                   MOVE      '0'           *IN96
     C                   END
     C                   MOVE      *ZEROS        XLINNR
     C                   ADD       1             XSIDEN
     C                   WRITE     SVX014V1
     C     THTET         IFEQ      1
     C     PRTTYP        ANDNE     'E'
     C                   MOVE      '1'           *IN96
     C                   WRITE     SVX014VB1
     C                   MOVE      '0'           *IN96
     C                   END
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     SKILLE2       BEGSR
      ***********************************************
     C     XLINNR        IFGT      0
     C     XLINNR        ANDLE     44
     C                   WRITE     SVX014FV3
     C     XLINNR        IFEQ      44
     C                   WRITE     SVX014FVD
     C                   MOVE      *ZEROS        XLINNR
     C                   ADD       1             XSIDEN
     C                   WRITE     SVX014FV1
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     SJTOTS        BEGSR
      ***********************************************
      * 1 SIDE FOR T-DOK OG 1 SIDE FOR 1. VARELISTE
     C                   Z-ADD     0             XTOTL             5 0
     C                   Z-ADD     1             XSIDET
     C                   MOVE      '017'         YUNIK
      *
     C     SVHK          SETLL     SVXV
     C     SVHK          READE(N)  SVXV                                   33
     C     *IN33         DOWEQ     '0'
      *
     C                   ADD       1             XTOTL
     C                   EVAL      YKODE = TVEH
     C     SVK01K        CHAIN     SVXKODL01                          33
     C  N33              IF        TVNTEH = 0
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   ELSE
     C                   EVAL      XTKTXTE = 'PIECES'
     C                   END
     C   33              MOVEL     *BLANKS       XTKTXTE
     C                   IF        *IN33 = *OFF
     C                   MOVE      *ZEROS        TVNT
     C                   MOVE      *BLANKS       TVMN
     C                   MOVE      *BLANKS       TVCNR
     C                   MOVE      *BLANKS       TVVT
     C                   SELECT
     C                   WHEN      XTKTXTE = 'PIECES'
     C                   ADD       1             XTOTL
     C                   WHEN      TKTXTE <> '.'
     C                   ADD       1             XTOTL
     C                   MOVEL     TKTXTE        XTKTXTE
     C                   ENDSL
     C                   END
      *
     C     SVVK          SETLL     SVXVMN
     C     SVVK          SETLL     SVXVCN
     C     SVVK          SETLL     SVXVVT
     C                   MOVEA     '000'         *IN(34)
     C     STSJ31        TAG
     C  N34SVVK          READE     SVXVMN                                 34
     C  N35SVVK          READE     SVXVCN                                 35
     C  N36SVVK          READE     SVXVVT                                 36
     C  N34
     CORN35
     CORN36              DO
     C   34              MOVE      *BLANKS       TVMN
     C   35              MOVE      *BLANKS       TVCNR
     C   36              MOVE      *BLANKS       TVVT
     C                   MOVE      '017'         YUNIK
     C                   EVAL      YKODE = TVEH
     C     SVK01K        CHAIN     SVXKODL01                          33
     C  N33              IF        TVNTEH = 0
     C                   MOVEL     TKTXTN        XTKTXTE
     C                   ELSE
     C                   EVAL      XTKTXTE = 'PIECES'
     C                   END
     C   33              MOVEL     *BLANKS       XTKTXTE
      *
     C                   ADD       1             XTOTL
      *
     C                   IF        *IN33 = *OFF
     C                   MOVE      *ZEROS        TVNT
     C                   MOVE      *BLANKS       TVMN
     C                   MOVE      *BLANKS       TVCNR
     C                   MOVE      *BLANKS       TVVT
     C                   SELECT
     C                   WHEN      XTKTXTE = 'PIECES'
     C                   ADD       1             XTOTL
     C                   WHEN      TKTXTE <> '.'
     C                   ADD       1             XTOTL
     C                   ENDSL
     C                   END
      *
     C                   GOTO      STSJ31
     C                   ENDDO
      *
     C                   ADD       1             XTOTL
N08  C                   ADD       1             XTOTL
      *
     C     SVVK          SETLL     SVXVFS
     C     SVVK          SETLL     SVXVTD
     C                   MOVEA     '00'          *IN(34)
     C     STSJ32        TAG
     C  N34SVVK          READE     SVXVFS                                 34
     C  N35SVVK          READE     SVXVTD                                 35
     C  N34
     CORN35              DO
     C   34              MOVE      *BLANKS       TVFV
     C   34              MOVE      *ZEROS        TVFVNT
     C   35              MOVE      *BLANKS       TVTDT
     C   35              MOVE      *BLANKS       TVTDR
      *
     C                   ADD       1             XTOTL
     C                   GOTO      STSJ32
     C                   ENDDO
      *
     C                   MOVE      '0'           *IN98
     C     TVDTY         IFNE      *BLANKS
     C     TVDO          OREQ      *BLANKS
     C     TVTLO         ANDEQ     *BLANKS
     C     TVMTXT        ANDEQ     *BLANKS
     C                   MOVE      X2DTY         XVDTY            28
      *
     C                   ADD       1             XTOTL
     C                   MOVE      '1'           *IN98
     C                   GOTO      STSJ36
     C                   END
      *
     C     STSJ33        TAG
     C                   MOVE      XXDO          TVDO
     C     TVDO          IFNE      *BLANKS
      *
     C                   ADD       1             XTOTL
     C                   MOVE      '1'           *IN98
     C                   GOTO      STSJ37
     C                   END
      *
     C     STSJ34        TAG
     C                   MOVE      XXTLO         TVTLO
     C                   MOVE      XXEXKD        TVEXKD
     C                   MOVE      XXEXLK        TVEXLK
     C     TVTLO         IFNE      *BLANKS
     C                   MOVE      X2TLO         XVTLO            35
     C                   MOVE      X2EXKD        XVEXKD            2
      *
     C                   ADD       1             XTOTL
     C                   MOVE      '1'           *IN98
     C                   GOTO      STSJ38
     C                   END
      *
     C     STSJ35        TAG
     C                   MOVE      XXMTXT        TVMTXT
     C     TVMTXT        IFNE      *BLANKS
      *
     C                   ADD       1             XTOTL
     C                   MOVE      '1'           *IN98
     C                   END
     C                   GOTO      STSJ39
      *
     C     STSJ36        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVDTY         IFNE      *BLANKS
     C                   MOVE      '013'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVDTY         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        XVDTY
      *
     C                   ADD       1             XTOTL
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STSJ33
      *
     C     STSJ37        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVDO          IFNE      *BLANKS
     C                   ADD       1             XTOTL
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STSJ34
      *
     C     STSJ38        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVTLO         IFNE      *BLANKS
     C                   MOVE      '039'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVTLO         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        XVTLO
     C     TVEXKD        IFEQ      1
     C                   MOVE      'EU'          XVEXKD
     C                   ELSE
     C                   MOVE      *BLANKS       XVEXKD
     C                   END
      *
     C                   ADD       1             XTOTL
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
     C                   GOTO      STSJ35
      *
     C     STSJ39        TAG
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 34
     C     *IN34         DOWEQ     '0'
     C     TVMTXT        IFNE      *BLANKS
      *
     C                   ADD       1             XTOTL
     C                   END
     C     SVVK          READE     SVXVDK                                 34
     C  N34              ENDDO
      *
     C                   ADD       1             XTOTL
      *
     C     TVADS1        IFNE      *BLANKS
     C     TVADK1        ORNE      *BLANKS
     C                   ADD       1             XTOTL
     C                   END
     C     TVPNS         IFNE      *BLANKS
     C     TVPNK         ORNE      *BLANKS
     C                   ADD       1             XTOTL
     C                   END
     C     TVPNS         IFEQ      *BLANKS
     C     TVPNK         ANDEQ     *BLANKS
     C     TVPSS         IFNE      *BLANKS
     C     TVPSK         ORNE      *BLANKS
     C                   ADD       1             XTOTL
     C                   END
     C                   END
      *
     C                   DOW       XTOTL >= 46
     C                   ADD       1             XSIDET
     C                   SUB       46            XTOTL
     C                   ENDDO
      *
     C     SVHK          READE(N)  SVXV                                   33
     C  N33              ENDDO
      *
     C                   IF        XTOTL > 0
     C                   ADD       1             XSIDET
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     SJTOTS2       BEGSR
      ***********************************************
      * FOR HVER POST TRENGES MINST 4 LINJER TIL DATA OG 4 SKILLELINJER.
     C                   MOVE      *ZEROS        XTOTL             5 0
     C                   Z-ADD     2             XSIDET
      *
     C     SVHK          SETLL     SVXV
     C     SVHK          READE(N)  SVXV                                   33
     C     *IN33         DOWEQ     '0'
     C                   ADD       4             XTOTL             5 0
      * AVSENDER/MOTTAKER
     C                   IF        ((XULIK = 'J') OR (XULIKM = 'J'))
     C                   ADD       3             XTOTL
     C                   ELSE
     C                   ADD       1             XTOTL
     C                   END
      * AVSENDER/MOTTAKER SIKKERHET
     C                   IF        ((XULIKS = 'J') OR (XULIKSM = 'J'))
     C                   ADD       3             XTOTL
     C                   ELSE
     C                   ADD       1             XTOTL
     C                   END
      *
      * LES ANTALL EKSTRA MERKE & NR, CONTAINERNR OG VAREBESKRIVELSE
      *
     C                   Z-ADD     1             XN                3 0
     C                   EVAL      R401(1) = %TRIM(TVTDR) + %TRIM(TVTDO)
      * XN1 ER SISTE TIDLIGERE DOK. I TAB R401
     C                   IF        R401(1) = *BLANKS
     C                   Z-ADD     0             XN1               3 0
     C                   ELSE
     C     SVVK          SETLL     SVXVTD
     C     SVVK          READE     SVXVTD                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN
     C     SVVK          READE     SVXVTD                                 33
     C                   ENDDO
     C                   EVAL      XN1 = XN
     C                   END
      *
     C                   Z-ADD     XN1           XN2               3 0
     C                   Z-ADD     0             XN                3 0
     C                   IF        TVMTXT <> *BLANKS
     C                   ADD       1             XN2
     C                   END
     C     SVVK          SETLL     SVXVDK
     C     SVVK          READE     SVXVDK                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((TVDREF <> *BLANKS) OR (TVDO <> *BLANKS))
     C                   ADD       1             XN
     C                   END
     C                   IF        TVMTXT <> *BLANKS
     C                   ADD       1             XN2
     C                   END
     C     SVVK          READE     SVXVDK                                 33
     C                   ENDDO
     C                   IF        XN > XN2
     C                   ADD       XN            XTOTL
     C                   ELSE
     C                   ADD       XN2           XTOTL
     C                   END
      *
     C                   Z-ADD     1             XN
     C                   IF        TVCNR <> *BLANKS
     C     SVVK          SETLL     SVXVCN
     C     SVVK          READE     SVXVCN                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN
     C     SVVK          READE     SVXVCN                                 33
     C                   ENDDO
     C                   END
      *
     C                   Z-ADD     1             XN2
     C                   IF        THDFKD <> *BLANKS
     C     SVHK          SETLL     SVXVFS
     C     SVHK          READE     SVXVFS                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN2
     C     SVHK          READE     SVXVFS                                 33
     C                   ENDDO
     C                   END
     C                   IF        XN > XN2
     C                   ADD       XN            XTOTL
     C                   ELSE
     C                   ADD       XN2           XTOTL
     C                   END
      *
     C                   DOW       XTOTL >= 44
     C                   ADD       1             XSIDET
     C                   SUB       44            XTOTL
     C                   ENDDO
      *
     C     SVHK          READE(N)  SVXV                                   33
     C  N33              ENDDO
      *
     C                   ENDSR
      ***********************************************
     C     HENTOP        BEGSR
      ***********************************************
     C                   MOVE      '017'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVE      *BLANKS       XVEHT
     C                   MOVEL     TVEH          YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVE      TKTXTN        XVEHT
     C     TVFV          COMP      *BLANKS                                45
      *
     C     TVVNT         COMP      0                                      27
      *
     C     SVVK          CHAIN     SVXVAM                             34
S06  C*    *IN34         IFEQ      '1'
N06  C                   IF        *IN34 OR XULIK = 'N'
     C                   MOVE      *ZEROS        TVKNS
     C                   MOVE      *BLANKS       TVNAS
     C                   MOVE      *BLANKS       TVADS1
     C                   MOVE      *BLANKS       TVPNS
     C                   MOVE      *BLANKS       TVPSS
     C                   MOVE      *BLANKS       TVLKS
     C                   MOVE      *BLANKS       TVSKS
     C                   MOVE      *BLANKS       TVTINS
N06  C                   END
N06  C                   IF        *IN34 OR XULIKM = 'N'
     C                   MOVE      *ZEROS        TVKNK
     C                   MOVE      *BLANKS       TVNAK
     C                   MOVE      *BLANKS       TVADK1
     C                   MOVE      *BLANKS       TVPNK
     C                   MOVE      *BLANKS       TVPSK
     C                   MOVE      *BLANKS       TVLKK
     C                   MOVE      *BLANKS       TVSKK
     C                   MOVE      *BLANKS       TVTINK
     C                   END
     C                   SELECT
     C     TVNAS         WHENEQ    *BLANKS
     C     TVNAK         ANDEQ     *BLANKS
     C     TVAVD2        IFEQ      0
     C                   IF        XULIK = 'N'
     C                   MOVEL     '---'         TVNAS
     C                   ELSE
     C                   MOVE      THNAS         TVNAS
     C                   MOVE      THADS1        TVADS1
     C                   MOVE      THPNS         TVPNS
     C                   MOVE      THPSS         TVPSS
     C                   END
     C                   IF        XULIKM = 'N'
     C                   MOVEL     '---'         TVNAK
     C                   ELSE
     C                   MOVE      THNAK         TVNAK
     C                   MOVE      THADK1        TVADK1
     C                   MOVE      THPNK         TVPNK
     C                   MOVE      THPSK         TVPSK
     C                   END
     C                   ELSE
     C     HEDFKV        CHAIN(N)  HEADF                              34
N06  C                   IF        XULIK = 'N'
N06  C                   EVAL      TVNAS = '---'
N06  C                   ELSE
     C                   MOVE      HENAS         TVNAS
     C     HEADS1        IFEQ      *BLANKS
     C                   MOVE      HEADS2        TVADS1
     C                   ELSE
     C                   MOVE      HEADS1        TVADS1
     C                   END
     C     HEADS3        IFEQ      *BLANKS
     C     HEADS1        ANDNE     *BLANKS
     C                   MOVEL     HEADS2        TVPSS
     C                   ELSE
     C                   MOVEL     HEADS3        TVPSS
     C                   END
N06  C                   END
N06  C                   IF        XULIKM = 'N'
N06  C                   EVAL      TVNAK = '---'
N06  C                   ELSE
     C                   MOVE      HENAK         TVNAK
     C     HEADK1        IFEQ      *BLANKS
     C                   MOVE      HEADK2        TVADK1
     C                   ELSE
     C                   MOVE      HEADK1        TVADK1
     C                   END
     C     HEADK3        IFEQ      *BLANKS
     C     HEADK1        ANDNE     *BLANKS
     C                   MOVEL     HEADK2        TVPSK
     C                   ELSE
     C                   MOVEL     HEADK3        TVPSK
     C                   END
N06  C                   END
     C                   END
N06  C                   OTHER
S06  C*    TVNAS         WHENEQ    *BLANKS
     C                   IF        XULIK = 'N'
     C                   MOVEL     '---'         TVNAS
     C                   ELSE
N06  C                   IF        TVNAS = *BLANKS AND XULIK = 'J'
     C                   MOVE      THKNS         TVKNS
     C                   MOVE      THNAS         TVNAS
     C                   MOVE      THADS1        TVADS1
     C                   MOVE      THPNS         TVPNS
     C                   MOVE      THPSS         TVPSS
     C                   MOVE      THLKS         TVLKS
     C                   MOVE      THSKS         TVSKS
     C                   MOVE      THTINS        TVTINS
N06  C                   END
     C                   END
S06  C*    TVNAK         WHENEQ    *BLANKS
     C                   IF        XULIKM = 'N'
     C                   MOVEL     '---'         TVNAK
     C                   ELSE
N06  C                   IF        TVNAK = *BLANKS AND XULIKM = 'J'
     C                   MOVE      THKNK         TVKNK
     C                   MOVE      THNAK         TVNAK
     C                   MOVE      THADK1        TVADK1
     C                   MOVE      THPNK         TVPNK
     C                   MOVE      THPSK         TVPSK
     C                   MOVE      THLKK         TVLKK
     C                   MOVE      THSKK         TVSKK
     C                   MOVE      THTINK        TVTINK
N06  C                   END
     C                   END
     C                   ENDSL
      *
     C     TVNT          IFEQ      0
     C                   Z-ADD     TVNTEH        TVNT
     C                   END
      *
      *** TESTE OM VARESLAG = BLANK. HVIS DET, FLYTTER TESKT FRA
      *** TOLLTARIFF INN.
     C     TVVT          IFEQ      *BLANKS
     C     TVVNT         COMP      0                                      34
     C  N34X_TVVNT       CHAIN     SVTAR2                             89
     C   34              DO
     C     HEADFK        CHAIN(N)  HEADF                              34
     C  N34HEVS1         IFNE      *BLANKS
     C                   MOVEL     HEVS1         TVVT
     C                   MOVE      HEVS2         TVVT
     C                   END
     C                   END
     C                   END
      *
     C                   MOVE      TVDO          XXDO             26
     C                   MOVE      TVTLO         XXTLO             5
     C                   MOVE      TVEXKD        XXEXKD            1 0
     C                   MOVE      TVEXLK        XXEXLK            2
     C                   MOVE      TVMTXT        XXMTXT           48
      *
     C     TVDTY         IFEQ      *BLANKS
     C                   MOVE      *BLANKS       X2DTY            28
     C                   ELSE
     C                   MOVE      '013'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVDTY         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        X2DTY
     C                   END
      *
     C     TVTLO         IFEQ      *BLANKS
     C                   MOVE      *BLANKS       X2TLO            35
     C                   ELSE
     C                   MOVE      '039'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     TVTLO         YKODE
     C     SVK01K        CHAIN     SVXKODL01                          34
     C                   MOVEL     TKTXTN        X2TLO
     C     TVEXKD        IFEQ      1
     C                   MOVE      'EU'          X2EXKD            2
     C                   ELSE
     C                   MOVE      *BLANKS       X2EXKD
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    PRTTYP            1
     C                   PARM                    PRTAVD            4
     C                   PARM                    PRTTDN            7
     C     prttyp        comp      'E'                                    50
     C     SVHK          KLIST
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
     C     SVH06K        KLIST
     C                   KFLD                    UWS
     C                   KFLD                    XST
     C                   MOVE      'K'           XST               1
     C     SVHLK         KLIST
     C                   KFLD                    TLAVD2
     C                   KFLD                    TLTDN2
     C     SVVK          KLIST
     C                   KFLD                    TVAVD
     C                   KFLD                    TVTDN
     C                   KFLD                    TVLI
     C     SVSTDK        KLIST
     C                   KFLD                    UAVD
     C     SVK01K        KLIST
     C                   KFLD                    YUNIK             3
     C                   KFLD                    YKODE            10
     C     HEADFK        KLIST
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
     C     HEDFKV        KLIST
     C                   KFLD                    TVAVD2
     C                   KFLD                    TVTDN2
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI
     C                   KFLD                    WOPAVD
     C                   KFLD                    WOPLNR
     C     SVTKDK        KLIST
     C                   KFLD                    SVKD_IE
     C                   KFLD                    SVKD_TYP
     C                   KFLD                    SVKD_KD
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    YKN
     C     KODTAK        KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    THAVD
     C     EDIM2K        KLIST
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
S03  C*                  KFLD                    M0068A
S03  C*                  MOVE      99999999      M0068A
N03  C                   KFLD                    XM0068A
N03  C                   MOVE      99999999      XM0068A           8 0
     C     EDIM2K1       KLIST
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
      *
     C                   GOTO      STINI2
     C     STINIT        TAG
     C                   CALL      'QRCVDTAQ'
     C                   PARM                    UDTAQ
     C                   PARM                    ULIBL
     C                   PARM                    ULENGT
     C                   PARM                    UDTA
     C                   PARM                    UWAIT
      *
     C                   MOVE      UDTA          DTDTA
     C                   MOVE      DTWS          UWS              10
      *** UIN39=0 -> KOMMER FRA TOLLDE.REGISTRERING    (U4 I S/36)
      *** UIN39=1 -> KOMMER FRA KOMMUNIKASJON
     C                   MOVE      DTIN39        *IN39
     C     STINI2        TAG
     C     PRTTYP        IFEQ      'M'
     C     PRTTYP        OREQ      'E'
     C                   MOVE      PRTAVD        UAVD              4 0
     C                   ELSE
     C     SVH06K        SETLL     SVXH06
     C     SVH06K        READE     SVXH06                                 33
     C   33              GOTO      STINIT
     C                   MOVE      THAVD         UAVD              4 0
     C                   END
     C     SVSTDK        CHAIN     SVXSTD                             33
     C                   MOVE      'P'           WOPUNI
      *
     C                   EXSR      OVRF
      *
     C                   MOVE      'A'           KOAUNI
     C                   MOVE      'GCY'         SVKD_TYP
     C                   MOVE      'A'           SVKD_IE
     C                   MOVE      *BLANKS       X_TVVNT
     C                   MOVE      *ZEROS        THAVD
     C                   MOVE      *ZEROS        THTDN
     C                   MOVE      *ZEROS        YKN               8 0
     C     *LIKE         DEFINE    KOPAVD        WOPAVD
     C     *LIKE         DEFINE    KOPUNI        WOPUNI
     C     *LIKE         DEFINE    KOPLNR        WOPLNR
     C                   Z-ADD     0             WOPAVD
     C                   Z-ADD     0             WOPLNR
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           XIDAG
     C                   MOVE      WTM           XTID
      *
     C                   ENDSR
      ***********************************************
     C     OVRF          BEGSR
      ***********************************************
     C                   MOVE      '0'           *IN97
      * Printerstyring for hovedark (A)
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     255           WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PFFM1
     C                   MOVE      *BLANKS       PFFM2
     C                   MOVE      *BLANKS       PFFM3
     C                   MOVE      *ZEROS        XFMPOS            3 0
     C                   MOVE      *ZEROS        XFMPOV            3 0
     C     *IN33         IFEQ      '1'
     C                   MOVE      '1'           *IN97
     C                   MOVE      *BLANKS       KOPNVN
     C                   MOVEL     '*JOB'        KOPNVN
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C     *IN33         IFEQ      '1'
     C     KFMT1         OREQ      *BLANKS
     C                   MOVE      '1'           *IN97
     C                   ELSE
     C                   MOVE      KFMT1         PFFM1
     C                   MOVE      KFMT2         PFFM2
     C                   MOVE      KFMT3         PFFM3
     C                   Z-ADD     KFMPOS        XFMPOS
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD11        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C     KOPLAS        IFEQ      'P'
N02  C     KOPLAS        OREQ      'F'
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*AFPDS)':0   UCMD
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   CAT       XCMDPDF12:1   UCMD
     C                   ELSE
     C                   CAT       XCMDPDF1:1    UCMD
     C                   END
     C                   CAT       XCMD21P:1     UCMD
     C                   ELSE
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*SCS)':0     UCMD
     C                   CAT       XCMD21:1      UCMD
     C                   END
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD31:0      UCMD
     C                   CAT       XHNTTD:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      * Printerstyring for hovedark (B)
     C                   MOVE      *BLANKS       PFFM12
     C                   MOVE      *BLANKS       PFFM22
     C                   MOVE      *BLANKS       PFFM32
     C     *IN33         IFEQ      '0'
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      KFMT1         PFFM12
     C                   MOVE      KFMT2         PFFM22
     C                   MOVE      KFMT3         PFFM32
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD12        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C     KOPLAS        IFEQ      'P'
N02  C     KOPLAS        OREQ      'F'
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*AFPDS)':0   UCMD
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   CAT       XCMDPDF22:1   UCMD
     C                   ELSE
     C                   CAT       XCMDPDF2:1    UCMD
     C                   END
     C                   CAT       XCMD21P:1     UCMD
     C                   ELSE
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*SCS)':0     UCMD
     C                   CAT       XCMD21:1      UCMD
     C                   END
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD31:0      UCMD
     C                   CAT       XHNTTD:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
      * Printerstyring for lasteliste
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     95            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PLFM1            75
     C                   MOVE      *BLANKS       PLFM2            75
     C                   MOVE      *BLANKS       PLFM3            75
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       KOPNVN
     C                   MOVEL     '*JOB'        KOPNVN
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      KFMT1         PLPFM1
     C                   MOVE      KFMT2         PLPFM2
     C                   MOVE      KFMT3         PLPFM3
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD16        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CAT       XCMD23:1      UCMD
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD31:0      UCMD
     C                   CAT       XHNTLL:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
      * Printerstyring for frigivelse (normal prosedyre)
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     96            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PRFM1            75
     C                   MOVE      *BLANKS       PRFM2            75
     C                   MOVE      *BLANKS       PRFM3            75
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       KOPNVN
     C                   MOVEL     '*JOB'        KOPNVN
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      KFMT1         PRPFM1
     C                   MOVE      KFMT2         PRPFM2
     C                   MOVE      KFMT3         PRPFM3
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD15        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CAT       XCMD24:1      UCMD
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
      * Printerstyring for vareliste (A)
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     256           WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PVFM1            75
     C                   MOVE      *BLANKS       PVFM2            75
     C                   MOVE      *BLANKS       PVFM3            75
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       KOPNVN
     C                   MOVEL     '*JOB'        KOPNVN
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      KFMT1         PVFM1
     C                   MOVE      KFMT2         PVFM2
     C                   MOVE      KFMT3         PVFM3
     C                   Z-ADD     KFMPOS        XFMPOV
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD13        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*AFPDS)':0   UCMD
     C                   CAT       XCMD25:1      UCMD
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD31:0      UCMD
     C                   CAT       XHNTTD:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
      * Printerstyring for vareliste (B)
     C                   MOVE      *BLANKS       PVFM12           75
     C                   MOVE      *BLANKS       PVFM22           75
     C                   MOVE      *BLANKS       PVFM32           75
     C     *IN33         IFEQ      '0'
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      KFMT1         PVFM12
     C                   MOVE      KFMT2         PVFM22
     C                   MOVE      KFMT3         PVFM32
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'                                 ARKIV
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD14        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CAT       XCMD25:1      UCMD
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      * Printerstyring for kombindert forhåndsvarsel
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     257           WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PFSFM1
     C                   MOVE      *BLANKS       PFSFM2
     C                   MOVE      *BLANKS       PFSFM3
     C                   MOVE      *ZEROS        XFMPOS            3 0
     C                   MOVE      *ZEROS        XFMPOV            3 0
     C     *IN33         IFEQ      '1'
     C                   EVAL      KOPNVN = '*JOB'
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C     *IN33         IFEQ      '1'
     C     KFMT1         OREQ      *BLANKS
     C                   ELSE
     C                   MOVE      KFMT1         PFSFM1
     C                   MOVE      KFMT2         PFSFM2
     C                   MOVE      KFMT3         PFSFM3
     C                   Z-ADD     KFMPOS        XFMPOS
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD17        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
      *
      * VED PDF
      *
     C     KOPLAS        IFEQ      'P'
N02  C     KOPLAS        OREQ      'F'
     C     DTUSER        OREQ      'ARKIV'
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*AFPDS)':0   UCMD
     C                   IF        PRTTYP = 'E'
     C                   CAT       XCMDPDF3PDF:1 UCMD
     C                   ELSE
     C                   CAT       XCMDPDF3:1    UCMD
     C                   END
     C                   CAT       XCMD23:1      UCMD
     C                   ELSE
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*SCS)':0     UCMD
     C                   CAT       XCMD23:1      UCMD
     C                   END
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD31:0      UCMD
     C                   CAT       XHNTTD:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
      * Printerstyring for vareliste TSAD
     C                   Z-ADD     258           WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       PVSFM1
     C                   MOVE      *BLANKS       PVSFM2
     C                   MOVE      *BLANKS       PVSFM3
     C     *IN33         IFEQ      '1'
     C                   EVAL      KOPNVN = '*JOB'
     C                   MOVE      *BLANKS       KOPTY
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   MOVE      *BLANKS       PVSFM1           75
     C                   MOVE      *BLANKS       PVSFM2           75
     C                   MOVE      *BLANKS       PVSFM3           75
     C                   Z-ADD     KFMPOS        XFMPOV
     C                   END
     C                   ENDIF
     C                   IF        PRTTYP = 'E'
     C                   EVAL      KOPNVN = 'OUTMAIL'
     C                   END
     C                   MOVE      *BLANKS       UCMD
     C     XCMD18        CAT       KOPNVN:0      UCMD
     C                   CAT       ')':0         UCMD
     C     KOPLAS        IFEQ      'P'
N02  C     KOPLAS        OREQ      'F'
     C     DTUSER        OREQ      'ARKIV'
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*AFPDS)':0   UCMD
     C                   CAT       XCMD22:1      UCMD
     C                   ELSE
     C                   CAT       XCMDPDF:1     UCMD
     C                   CAT       '*SCS)':0     UCMD
     C                   CAT       XCMD22:1      UCMD
     C                   END
     C                   CAT       DTUSER:0      UCMD
     C                   CAT       XCMD41:0      UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       KOPTY:0       UCMD
     C                   CAT       GRAAPP:0      UCMD
     C                   CAT       ')':0         UCMD
     C                   CALL      'QCMDEXC'                            34
     C                   PARM                    UCMD
     C                   PARM                    UCMDL
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TEST OM VARELINJER HAR FORSKJELLIGE AVSENDER/MOTTAKER    /
      *////////////////////////////////////////////////////////////
     C     TSTAM         BEGSR
     C                   MOVE      'N'           XULIK             1
     C                   MOVE      'N'           XULIKM            1
     C     THVPOS        IFGT      1
     C                   MOVE      'J'           X1VP              1
     C     SVHK          SETLL     SVXV
     C     SVHK          READE(N)  SVXV                                   33
     C     *IN33         DOWEQ     '0'
     C     SVVK          CHAIN     SVXVAM                             34
     C     *IN34         IFEQ      '0'
     C     TVNAS         IFEQ      *BLANKS
     C                   MOVEL     THNAS         XNAA
     C                   MOVEL     THADS1        XADA1
     C                   ELSE
     C                   MOVEL     TVNAS         XNAA
     C                   MOVEL     TVADS1        XADA1
     C                   END
     C     TVNAK         IFEQ      *BLANKS
     C                   MOVEL     THNAK         XNAM
     C                   MOVEL     THADK1        XADM1
     C                   ELSE
     C                   MOVEL     TVNAK         XNAM
     C                   MOVEL     TVADK1        XADM1
     C                   END
     C                   ELSE
     C     TVAVD2        IFEQ      0
     C                   MOVEL     THNAS         XNAA             30
     C                   MOVEL     THADS1        XADA1            30
     C                   MOVEL     THNAK         XNAM             30
     C                   MOVEL     THADK1        XADM1            30
     C                   ELSE
     C     HEADFK        CHAIN(N)  HEADF                              34
     C                   MOVE      HENAS         XNAA
     C                   MOVE      HEADS1        XADA1
     C                   MOVE      HENAK         XNAM
     C                   MOVE      HEADK1        XADM1
     C                   END
     C                   END
     C     X1VP          IFEQ      'J'
     C                   MOVE      XNAA          X2NAA            30
     C                   MOVE      XADA1         X2ADA1           30
     C                   MOVE      XNAM          X2NAM            30
     C                   MOVE      XADM1         X2ADM1           30
     C                   MOVE      'N'           X1VP
     C                   END
     C     XNAA          IFNE      X2NAA
     C     XADA1         ORNE      X2ADA1
     C                   MOVE      'J'           XULIK
     C                   END
     C     XNAM          IFNE      X2NAM
     C     XADM1         ORNE      X2ADM1
     C                   MOVE      'J'           XULIKM
     C                   END
     C     SVHK          READE(N)  SVXV                                   33
     C  N33              ENDDO
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  TEST OM VARELINJER HAR FORSKJELLIGE AVSENDER/MOTTAKER    /
      *////////////////////////////////////////////////////////////
     C     TSTAMS        BEGSR
     C                   MOVE      'N'           XULIKS            1
     C                   MOVE      'N'           XULIKSM           1
     C     THVPOS        IFGT      1
     C                   MOVE      'J'           X1VPS             1
     C     SVHK          SETLL     SVXV
     C     SVHK          READE(N)  SVXV                                   33
     C     *IN33         DOWEQ     '0'
     C     SVVK          CHAIN     SVXVFV                             34
     C     *IN34         IFEQ      '0'
     C     TVNASS        IFEQ      *BLANKS
     C                   MOVEL     THNASS        XNAAS
     C                   MOVEL     THADSS1       XADAS1
     C                   ELSE
     C                   MOVEL     TVNASS        XNAAS
     C                   MOVEL     TVADSS1       XADAS1
     C                   END
     C     TVNAKS        IFEQ      *BLANKS
     C                   MOVEL     THNAKS        XNAMS
     C                   MOVEL     THADKS1       XADMS1
     C                   ELSE
     C                   MOVEL     TVNAKS        XNAMS
     C                   MOVEL     TVADKS1       XADMS1
     C                   END
     C                   ELSE
     C                   MOVEL     THNASS        XNAAS            30
     C                   MOVEL     THADSS1       XADAS1           30
     C                   MOVEL     THNAKS        XNAMS            30
     C                   MOVEL     THADKS1       XADMS1           30
     C                   END
     C     X1VPS         IFEQ      'J'
     C                   MOVE      XNAAS         X2NAAS           30
     C                   MOVE      XADAS1        X2ADAS1          30
     C                   MOVE      XNAMS         X2NAMS           30
     C                   MOVE      XADMS1        X2ADMS1          30
     C                   MOVE      'N'           X1VPS
     C                   END
     C     XNAAS         IFNE      X2NAAS
     C     XADAS1        ORNE      X2ADAS1
     C                   MOVE      'J'           XULIKS
     C                   END
     C     XNAM          IFNE      X2NAM
     C     XADM1         ORNE      X2ADM1
     C                   MOVE      'J'           XULIKSM
     C                   END
     C     SVHK          READE(N)  SVXV                                   33
     C  N33              ENDDO
     C                   END
      *
     C                   ENDSR
      *=====================================================================
      *  Oppdater arkivfil
      *=====================================================================
     C     arkivsr       begsr
      *=====================================================================
     C                   move      'N'           arkiver           1
     C     KEYARK        KLIST
     C                   KFLD                    ARTYPE
     C                   KFLD                    ARAVD
     C                   KFLD                    AROPD
     C                   clear                   arkivr
     C                   MOVE      'ne'          ARTYPE
     C                   MOVE      THAVD         ARAVD
     C                   MOVE      THTDN         AROPD
     C     keyark        chain     arkivl03                           33
     C     *IN33         IFEQ      '1'
     C     FIFIRM        CHAIN     FIRMARC                            33
     C     *IN33         IFEQ      '0'
     C     'ne'          chain     arktxt                             33
     C     *IN33         IFEQ      '0'
     C     arkjn         andeq     'J'
      *
     C                   MOVE      FIFIRM        ARFIRM
     C     SVHK          CHAIN     SVXHFV                             34
     C                   IF        *IN34
     C                   MOVE      THENKL        ARUNDE
     C                   MOVEl     THPRO         ARUNDE
     C                   ELSE
     C                   MOVE      'S'           ARUNDE
     C                   END
     C                   MOVE      UUSER         ARUSER
     C                   MOVE      WDT           ARDATE
     C                   MOVE      WTM           ARTIME
     C                   MOVE      THKNS         ARKUND
     C                   WRITE     ARKIVR
     C                   move      'J'           arkiver           1
     C                   END
     C                   END
     C                   END
     C                   ENDSR
      *
      *
     OSVXHR     E            UPDSVH
     O                       THST
     O                       THWS
N04  O          E            UPDSVHD
     OSVXVR     E            UPDSVV
     O                       TVLN
