      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED EL.TRANSIT LINJE-OPPLYSNING***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 05 06 08 09 11 13 16 18-26
      *** LEDIGE INDIKATORER 40-47
      ***        INDIKATOR   27 PÅ = SPØRRING                 ***
      ***        INDIKATOR   34 BRUKES FOR TVINN              ***
      *** ALLE VARIABLER SOM STARTER MED 'X' ER ARBERDSVAR.   ***
      ***   OG DEFINERES I PROGRAM                            ***
      ***********************************************************
      *
     FSVXVFV    UF A E           K DISK
     FSVXKODL01 IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSVTKD     IF   E           K DISK
     FSVX012DA  CF   E             WORKSTN INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               382    383B 0
     D  WSSUBN               378    379B 0
      *
     D                 DS
     D  SYRG                   1     14
     D  SYFOR9                 1      9
     D  SYFORE                 1     11
      *
     C                   EXSR      INIT
      *
      *...............................................
      * BILDE-1 INNLESING AV HOVED OPPL. FORH.VARSLING
      *'''''''''''''''''''''''''''''''''''''''''''''''
     C     START         TAG
     C  N30              Z-ADD     2             LINNBR
     C  N30              Z-ADD     15            POSNBR
      *
     C     START1        TAG
     C                   EXFMT     SVX012DA1
     C                   MOVEA     '0000000'     *IN(93)
     C                   MOVE      '0'           *IN(30)
      *
      *  04 = SØK AVSENDER/MOTTAKER/HOVEDANSVARLIG
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START1
     C                   END
      *
      *  12 = AVBRYT, FRIGJØR E-MERKING OG GÅ TIL TR011D02
     C   12              GOTO      SLUTT
      *
     C   27              GOTO      SLUTT
      *
      * ----------- T E S T   B I L D E --------------
     C                   EXSR      TESTB
     C   30              GOTO      START
      *
      * ----- INGEN FEIL HITTIL  OPPDATER SVXVFV -----
     C                   EXSR      OPDSVV
      *
     C     SLUTT         TAG
     C     *IN12         IFEQ      '1'
     C                   Z-ADD     1             UFLAGG
     C                   ELSE
     C                   Z-ADD     0             UFLAGG
     C                   END
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
      * TRANSPORTKOSTNADS BETALINGSMÅTE
     C     LINNBR        IFEQ      2
     C     POSNBR        ANDGE     15
     C     POSNBR        ANDLE     15
     C                   MOVE      '116'         UUNIK             3
     C                   MOVE      *BLANKS       UKODE            10
     C                   MOVEL     WSTKBM        UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE             3
     C                   MOVEL     UKODE         WSTKBM
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * AVSENDERSNR SIKKERHET
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     22
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNSS
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN
     C                   IF        WSKNSS <> 0
     C                   EXSR      TESTSS
     C                   END
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * LANDKODE TIL AVSENDER SIKKERHET
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     12
     C     POSNBR        ANDLE     13
     C                   CALL      'SVT003R'
     C                   PARM                    SVKD_TYP
     C                   PARM                    SVKD_IE
     C                   PARM                    WDT
     C                   PARM                    UKD              10
     C                   IF        UKD <> *BLANKS
     C                   EVAL      WSLKSS = UKD
     C                   END
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * SPRÅKKODE TIL AVSENDER SIKKERHET
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     32
     C     POSNBR        ANDLE     33
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSSKSS        UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE
     C                   MOVEL     UKODE         WSSKSS
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * MOTTAKERSNR SIKKERHET
     C     LINNBR        IFEQ      9
     C     POSNBR        ANDGE     22
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNKS
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN
     C                   IF        WSKNKS <> 0
     C                   EXSR      TESTKK
     C                   END
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * LANDKODE TIL MOTTAKER SIKKERHET
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     12
     C     POSNBR        ANDLE     13
     C                   CALL      'SVT003R'
     C                   PARM                    SVKD_TYP
     C                   PARM                    SVKD_IE
     C                   PARM                    WDT
     C                   PARM                    UKD              10
     C                   IF        UKD <> *BLANKS
     C                   EVAL      WSLKKS = UKD
     C                   END
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
      * SPRÅKKODE TIL MOTTAKER SIKKERHET
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     32
     C     POSNBR        ANDLE     33
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSSKKS        UKODE
     C                   CALL      'SVX002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE
     C                   MOVEL     UKODE         WSSKKS
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
      ***********************************************
     C     TESTB         BEGSR
      ***********************************************
      *
     C                   IF        WSTKBM <> *BLANKS
     C                   MOVE      '116'         YUNIK
     C                   EVAL      YKODE = WSTKBM
     C     SVK01K        CHAIN     SVXKODL01                          99
     C   99              MOVE      'SVX1945'     MSGNR
     C   99              SETON                                        30
     C                   END
      *
     C                   IF        WSKNSS <> 0
     C                   MOVE      WSKNSS        KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            98
     C                   IF        *IN98
     C  N30              MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   ELSE
     C                   MOVE      KNAVN         WSNASS
     C                   MOVE      ADR1          WSADSS1
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSPNSS
     C                   MOVEL     POSTNR        WSPNSS
     C                   ELSE
     C                   MOVEL     SYPOGE        WSPNSS
     C                   END
     C                   MOVE      ADR3          WSPSSS
     C                   IF        SYLAND = *BLANKS
     C                   MOVE      'SE'          WSLKSS
     C                   ELSE
     C                   MOVE      SYLAND        WSLKSS
     C                   END
     C                   IF        WSTINSS = *BLANKS
     C                   IF        EORI = *BLANKS
     C                   IF        ((SYFOR9 <> *BLANKS) AND (SYFOR9 <> *ZEROS))
     C                   EVAL      WSTINSS = WSLKSS + SYFOR9
     C                   ELSE
     C                   EVAL      WSTINSS = *BLANKS
     C                   END
     C                   ELSE
     C                   EVAL      WSTINSS = EORI
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C                   IF        ((WSNASS <> *BLANKS) AND (WSADSS1 = *BLANKS))
     C                   EVAL      WSADSS1 = '.'
     C                   END
      *
     C                   IF        WSLKSS <> *BLANKS
     C                   EVAL      SVKD_KD = WSLKSS
     C     SVTKDK        CHAIN     SVTKD                              97
     C   97
     CANN30              MOVE      'SPL0001'     MSGNR
     C   97              SETON                                        30
     C                   END
      *
     C                   IF        WSSKSS <> *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVEL     WSSKSS        YKODE
     C     SVK01K        CHAIN     SVXKODL01                          96
     C   96
     CANN30              MOVE      'SVX0810'     MSGNR
     C   96              SETON                                        30
     C                   END
      *
     C                   IF        WSKNKS <> 0
     C                   MOVE      WSKNKS        KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            95
     C                   IF        *IN95
     C  N30              MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   ELSE
     C                   MOVE      KNAVN         WSNAKS
     C                   MOVE      ADR1          WSADKS1
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSPNKS
     C                   MOVEL     POSTNR        WSPNKS
     C                   ELSE
     C                   MOVEL     SYPOGE        WSPNKS
     C                   END
     C                   MOVE      ADR3          WSPSKS
     C                   IF        SYLAND = *BLANKS
     C                   MOVE      'SE'          WSLKKS
     C                   ELSE
     C                   MOVE      SYLAND        WSLKKS
     C                   END
     C                   IF        WSTINKS = *BLANKS
     C                   IF        EORI = *BLANKS
     C                   IF        ((SYFOR9 <> *BLANKS) AND (SYFOR9 <> *ZEROS))
     C                   EVAL      WSTINKS = WSLKKS + SYFOR9
     C                   ELSE
     C                   EVAL      WSTINKS = *BLANKS
     C                   END
     C                   ELSE
     C                   EVAL      WSTINKS = EORI
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C                   IF        ((WSNAKS <> *BLANKS) AND (WSADKS1 = *BLANKS))
     C                   EVAL      WSADKS1 = '.'
     C                   END
      *
     C                   IF        WSLKKS <> *BLANKS
     C                   EVAL      SVKD_KD = WSLKKS
     C     SVTKDK        CHAIN     SVTKD                              94
     C   94
     CANN30              MOVE      'SPL0001'     MSGNR
     C   94              SETON                                        30
     C                   END
      *
     C                   IF        WSSKKS <> *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   EVAL      YKODE = WSSKKS
     C     SVK01K        CHAIN     SVXKODL01                          93
     C   93
     CANN30              MOVE      'SVX0810'     MSGNR
     C   93              SETON                                        30
     C                   END
      *
     C   30              EXSR      SETCUR
      *
     C                   ENDSR
      *
      ***********************************************
     C     SETCUR        BEGSR
      ***********************************************
     C   93              Z-ADD     13            LINNBR
     C   93              Z-ADD     32            POSNBR
     C   94              Z-ADD     13            LINNBR
     C   94              Z-ADD     12            POSNBR
     C   95              Z-ADD     9             LINNBR
     C   95              Z-ADD     22            POSNBR
     C   96              Z-ADD     8             LINNBR
     C   96              Z-ADD     32            POSNBR
     C   97              Z-ADD     8             LINNBR
     C   97              Z-ADD     12            POSNBR
     C   98              Z-ADD     4             LINNBR
     C   98              Z-ADD     22            POSNBR
     C   99              Z-ADD     2             LINNBR
     C   99              Z-ADD     15            POSNBR
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVW          BEGSR
      ***********************************************
     C                   MOVE      TVTKBM        WSTKBM
     C                   MOVEL     TVKREF        WSKREF
     C                   MOVE      TVFGKD        WSFGKD
     C                   MOVE      TVKNSS        WSKNSS
     C                   MOVE      TVTINSS       WSTINSS
     C                   MOVE      TVNASS        WSNASS
     C                   MOVE      TVADSS1       WSADSS1
     C                   MOVE      TVPNSS        WSPNSS
     C                   MOVE      TVPSSS        WSPSSS
     C                   MOVE      TVLKSS        WSLKSS
     C                   MOVE      TVSKSS        WSSKSS
     C                   MOVE      TVKNKS        WSKNKS
     C                   MOVE      TVTINKS       WSTINKS
     C                   MOVE      TVNAKS        WSNAKS
     C                   MOVE      TVADKS1       WSADKS1
     C                   MOVE      TVPNKS        WSPNKS
     C                   MOVE      TVPSKS        WSPSKS
     C                   MOVE      TVLKKS        WSLKKS
     C                   MOVE      TVSKKS        WSSKKS
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVTRV        BEGSR
      ***********************************************
     C                   MOVE      UAVD          TVAVD
     C                   MOVE      UTDN          TVTDN
     C                   MOVE      ULI           TVLI
     C                   MOVE      WSTKBM        TVTKBM
     C                   MOVEL     WSKREF        TVKREF
     C                   MOVE      WSFGKD        TVFGKD
     C                   MOVE      WSKNSS        TVKNSS
     C                   MOVE      WSTINSS       TVTINSS
     C                   MOVE      WSNASS        TVNASS
     C                   MOVE      WSADSS1       TVADSS1
     C                   MOVE      WSPNSS        TVPNSS
     C                   MOVE      WSPSSS        TVPSSS
     C                   MOVE      WSLKSS        TVLKSS
     C                   MOVE      WSSKSS        TVSKSS
     C                   MOVE      WSKNKS        TVKNKS
     C                   MOVE      WSTINKS       TVTINKS
     C                   MOVE      WSNAKS        TVNAKS
     C                   MOVE      WSADKS1       TVADKS1
     C                   MOVE      WSPNKS        TVPNKS
     C                   MOVE      WSPSKS        TVPSKS
     C                   MOVE      WSLKKS        TVLKKS
     C                   MOVE      WSSKKS        TVSKKS
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDSVV        BEGSR
     C***********************************************
     C     SVXVFVK       CHAIN     SVXVFV                             33
     C                   EXSR      MOVTRV
      *
     C   33              WRITE     SVXVFVR
     C  N33              UPDATE    SVXVFVR
      *
     C                   ENDSR
      *
      ***********************************************
     C     TESTSS        BEGSR
      ***********************************************
     C                   MOVE      WSKNSS        KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            98
     C                   IF        *IN98
     C  N30              MOVE      'SPK0001'     MSGNR
     C  N30              Z-ADD     4             LINNBR
     C  N30              Z-ADD     22            POSNBR
     C                   SETON                                        30
     C                   ELSE
     C                   MOVE      KNAVN         WSNASS
     C                   MOVE      ADR1          WSADSS1
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSPNSS
     C                   MOVEL     POSTNR        WSPNSS
     C                   ELSE
     C                   MOVEL     SYPOGE        WSPNSS
     C                   END
     C                   MOVE      ADR3          WSPSSS
     C                   IF        SYLAND = *BLANKS
     C                   MOVE      'SE'          WSLKSS
     C                   ELSE
     C                   MOVE      SYLAND        WSLKSS
     C                   END
     C                   IF        WSTINSS = *BLANKS
     C                   IF        EORI = *BLANKS
     C                   IF        ((SYFOR9 <> *BLANKS) AND (SYFOR9 <> *ZEROS))
     C                   EVAL      WSTINSS = WSLKSS + SYFOR9
     C                   ELSE
     C                   EVAL      WSTINSS = *BLANKS
     C                   END
     C                   ELSE
     C                   EVAL      WSTINSS = EORI
     C                   END
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     TESTKK        BEGSR
      ***********************************************
     C                   MOVE      WSKNKS        KUNDNR
     C     CUND1K        CHAIN     CUNDL01                            95
     C                   IF        *IN95
     C  N30              MOVE      'SPK0001'     MSGNR
     C  N30              Z-ADD     9             LINNBR
     C  N30              Z-ADD     22            POSNBR
     C                   SETON                                        30
     C                   ELSE
     C                   MOVE      KNAVN         WSNAKS
     C                   MOVE      ADR1          WSADKS1
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSPNKS
     C                   MOVEL     POSTNR        WSPNKS
     C                   ELSE
     C                   MOVEL     SYPOGE        WSPNKS
     C                   END
     C                   MOVE      ADR3          WSPSKS
     C                   IF        SYLAND = *BLANKS
     C                   MOVE      'SE'          WSLKKS
     C                   ELSE
     C                   MOVE      SYLAND        WSLKKS
     C                   END
     C                   IF        WSTINKS = *BLANKS
     C                   IF        EORI = *BLANKS
     C                   IF        ((SYFOR9 <> *BLANKS) AND (SYFOR9 <> *ZEROS))
     C                   EVAL      WSTINKS = WSLKKS + SYFOR9
     C                   ELSE
     C                   EVAL      WSTINKS = *BLANKS
     C                   END
     C                   ELSE
     C                   EVAL      WSTINKS = EORI
     C                   END
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SVXVFVK       KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    ULI
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     SVTKDK        KLIST
     C                   KFLD                    SVKD_IE
     C                   KFLD                    SVKD_TYP
     C                   KFLD                    SVKD_KD
     C     SVK01K        KLIST
     C                   KFLD                    YUNIK             3
     C                   KFLD                    YKODE            10
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD
     C                   PARM                    UTDN
     C                   PARM                    ULI
     C                   PARM                    UIN27             1
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      UIN27         *IN(27)
     C                   MOVE      'GCY'         SVKD_TYP
     C                   MOVE      'A'           SVKD_IE
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     SVXVFVK       CHAIN(N)  SVXVFV                             33
     C                   EXSR      MOVW
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
