     FSVXH      UF   E           K DISK
     FSVXHE     UF   E           K DISK
     FSVTHA     IF   E           K DISK
     FSVX041D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    THAVD         UAVD
     C     *LIKE         DEFINE    THTDN         UTDN
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UAVD
     C                   PARM                    UTDN
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVXHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVXHK         CHAIN(N)  SVXH                               90
     C                   EVAL      WSSGDK=THSGDK
     C                   EVAL      WSSGUT=THSGUT
      * Sigiller via keypad eller automatsik ?
     C     THSG          CHAIN     SVTHA
     C     SVTH_DKEYN    IFNE      *BLANKS
     C                   EXSR      SRCC
     C                   ENDIF
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     SVX041DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9

     C     SRB8          TAG
     C     SVXHK         CHAIN     SVXH                               90
     C                   EVAL      THSGDK=WSSGDK
     C                   EVAL      THSGUT=WSSGUT
     C                   UPDATE    SVXHR
      * Slett edifact
     C     SVXHK         SETLL     SVXHE
     C     SVXHK         READE     SVXHE                                  51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVXHER
     C     SVXHK         READE     SVXHE                                  51
     C                   ENDDO
      * Lag edifact pånytt med riktig sigill
     C     THSGDK        IFNE      *BLANKS
     C     THSGDK        ANDNE     '000000'
     C                   CALL      'SVX101R'
     C                   PARM                    THAVD
     C                   PARM                    THTDN
     C                   PARM                    THMF

     C                   ENDIF

     C     SRB9          TAG
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Berækna utstællarsigill                             SRCC /
      *////////////////////////////////////////////////////////////
     C     SRCC          BEGSR
      * Send oppdrag til sigillering
     C                   MOVEL     THAVD         QTFIEL
     C                   MOVE      THTDN         QTFIEL
     C                   CALL      'QSNDDTAQ'
     C                   PARM      'SVGSRQ'      QTNAME           10
     C                   PARM      '*LIBL'       QTLIB            10
     C                   PARM      11            QTLEN             5 0
     C                   PARM                    QTFIEL           11
      * Sigillering
     C                   CALL      'SEALCTL'
     C                   PARM      'SVG003RX  '  QPARM            10
      * Retur fra sigillering
     C                   MOVEL     THAVD         QKEY
     C                   MOVE      THTDN         QKEY
     C                   CALL      'QRCVDTAQ'
     C                   PARM      'SVGSSQ'      QRNAME           10
     C                   PARM      '*LIBL'       QRLIB            10
     C                   PARM      6             QRLEN             5 0
     C                   PARM                    WSSGUT
     C                   PARM      99            QWAIT             5 0
     C                   PARM      'EQ'          QORDER            2
     C                   PARM      11            QKILEN            3 0
     C                   PARM                    QKEY             11
     C                   PARM      10            QSNDRL            3 0
     C                   PARM                    QSNDR            10
     C                   ENDSR
