      ***********************************************************
      * PROGRAM SKAL SENDE EDI-FACT IE026                     ***
      * INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER      ***
      * LEDIGE INDIKATORER 01 02 05-07 09 11 13-16 18-26      ***
      * LEDIGE INDIKATORER 29 30 35-96                        ***
      ***********************************************************
     FSVXGH     UF   E           K DISK
     FSVXSTD    IF   E           K DISK
     FEDIM      O  A E           K DISK
     FEDIC      UF   E             DISK
     FTVIND     UF A E           K DISK
     FSVX033D   CF   E             WORKSTN
     D                 DS
     D  TGAVD                  1      4  0
     D  TGTDN                  5     11  0
     D  TGRN                   1     11  0
     D                 DS
     D  XM0062                 1     14
     D  XM00621                1      6
     D  XM00622                7     12
     D* XM00623               11     14
     D                UDS
     D  UAVD                  15     18  0
      *
     C                   EXSR      INIT
      *
     C                   EXFMT     SVX033D1
      *
     C                   IF        *IN12 = *OFF
     C     UGNR          CHAIN     SVXGH                              33
     C                   MOVE      'Q'           TGST
     C                   UPDATE    SVXGHR
     C                   EXSR      KOMLIN
     C                   END
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
      ***********************************************
     C     KOMLIN        BEGSR
      ***********************************************
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVEL     WDT           M0068A
     C     M0068A        CHAIN     TVIND                              32
     C   32              Z-ADD     M0068A        D0068A
     C   32              Z-ADD     0             D0068B
     C                   ADD       1             D0068B
     C   32              WRITE     TVINDF
     C  N32              UPDATE    TVINDF
     C                   MOVE      D0068B        M0068B
      *
      *** HENTE MELDINGSNR
     C     1             CHAIN     EDIC                               32
     C                   ADD       1             CMN
     C                   UPDATE    EDICR
      *
     C                   MOVE      S0004         M0004
     C                   MOVE      S0010         M0010
     C                   MOVE      W0035         M0035
     C                   MOVE      *BLANKS       M0062
     C                   MOVE      WDT           XM00621
     C                   MOVEL     WTM           XM00622
     C*                  Z-SUB     TGTDN         XTGTDN            7 0
     C*                  MOVE      XTGTDN        XM00623
     C                   MOVEL     XM0062        M0062
     C                   MOVE      'SANCRT'      M0065
     C                   MOVE      *BLANKS       M0068
     C                   MOVEL     UGNR          M0068
     C                   MOVE      *ZEROS        M0068D
     C                   MOVE      *ZEROS        M0068E
     C                   MOVE      *ZEROS        M0068F
     C                   MOVE      'STE'         M1001
     C                   MOVE      *BLANKS       M1004
     C                   MOVE      W1N07         M1225
     C                   MOVE      *ZEROS        M2005B
     C                   MOVE      *ZEROS        M3039D
     C                   MOVE      *ZEROS        M3039E
     C                   MOVE      *ZEROS        M5004D
     C                   MOVE      W1N07         M1N07
     C                   MOVE      *BLANKS       M1N08
      *
     C                   MOVE      *ZEROS        MSN
     C                   Z-ADD     CMN           MMN
     C                   MOVE      'S'           MSR
     C                   MOVE      *BLANKS       MST
     C                   MOVE      *ZEROS        MDT
     C                   MOVE      *ZEROS        MTM
     C                   MOVE      TGAVD         MAVD
     C                   MOVE      TGTDN         MTDN
     C                   MOVE      *ZEROS        MFFBNR
     C                   MOVE      WVEN          MVEN
     C                   WRITE     EDIMR
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UGNR             24
      *
      *
     C     UGNR          CHAIN(N)  SVXGH                              33
     C     UAVD          CHAIN     SVXSTD                             33
     C                   MOVE      S0035         W0035
     C                   MOVE      '026'         W1N07
     C                   MOVE      *BLANKS       WVEN
      *
     C                   ENDSR
      *
