      *
      ***********************************************************
      *** PROGRAM SKAL PLUKKE TET FRA Z-FILER                 ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 06-11 13-24
      *** LEDIGE INDIKATORER 31-49 51-90 95-97
      ***********************************************************
      *
     FZSVXHL01  IF   E           K DISK    RENAME(SVXHR:SVXHR1)
     FZSVXHL02  UF   E           K DISK
     FZSVXHL04  IF   E           K DISK    RENAME(SVXHR:SVXHR4)
     FZSVXHL05  IF   E           K DISK    RENAME(SVXHR:SVXHR5)
     FSVX011DB  CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  XNAK                   1     30
     D  AL                     1     30    DIM(30)
      *
     C                   EXSR      INIT
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   GOTO      START3
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2REFF        YREFF            17
     C                   MOVE      W2KNK         YKNK              8 0
     C                   MOVE      W2NAK         YNAK             30
     C                   MOVE      *BLANKS       W2REFF
     C                   MOVE      *ZEROS        W2KNK
     C                   MOVE      *BLANKS       W2NAK
     C   29              EXSR      FINMAX
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C   27YREFF         SETLL     ZSVXHL01
     C   28YKNK          SETLL     ZSVXHL04
     C   29YNAK          SETLL     ZSVXHL05
     C     START1        TAG
     C   27              READ      ZSVXHL01                               94
     C   28YKNK          READE     ZSVXHL04                               94
     C   29              READ      ZSVXHL05                               94
     C   29
     CANN94THNAK         COMP      XNAK                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        10
     C                   ADD       1             ZRECNO
     C     THST          COMP      'O'                                    50
     C                   WRITE     SUBFIL
     C   27              READ      ZSVXHL01                               94
     C   28YKNK          READE     ZSVXHL04                               94
     C   29              READ      ZSVXHL05                               94
     C   29
     CANN94THNAK         COMP      XNAK                               94
     C                   IF        *IN94 = *OFF
     C                   MOVE      THREFF        XXREFF           17
     C                   MOVE      THUNIK        XXUNIK            9 0
     C                   MOVE      THAVD         XXAVD             4 0
     C                   MOVE      THTDN         XXTDN             7 0
     C                   MOVE      THKNK         XXKNK             8 0
     C                   MOVE      THNAK         XXNAK            30
     C                   MOVE      THST          XXST              1
     C                   END
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              Z-ADD     1             UFLAGG
     C   03
     COR 12              GOTO      SLUTT
      *
     C   04              DO
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    W2KNK
     C                   PARM                    UFIRM
     C                   PARM                    USØKKN
     C                   GOTO      START3
     C                   END
      *** FRISK OPP
     C   05              GOTO      START
      *
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   IF        *IN94 = *OFF
     C                   MOVE      XXREFF        THREFF
     C                   MOVE      XXUNIK        THUNIK
     C                   MOVE      XXAVD         THAVD
     C                   MOVE      XXTDN         THTDN
     C                   MOVE      XXKNK         THKNK
     C                   MOVE      XXNAK         THNAK
     C                   MOVE      XXST          THST
     C                   END
     C                   GOTO      START2
     C                   END
      *
     C                   SELECT
     C                   WHEN      W2REFF <> *BLANKS
     C                   MOVEA     '100'         *IN(27)
     C                   GOTO      START
     C                   WHEN      W2KNK <> 0
     C                   MOVEA     '010'         *IN(27)
     C                   GOTO      START
     C                   WHEN      W2NAK <> *BLANKS
     C                   MOVEA     '001'         *IN(27)
     C                   GOTO      START
     C                   ENDSL
      *
     C                   IF        ZRECNO = 0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C     XOK           CABNE     'J'           START3
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     FINMAX        BEGSR
     C***********************************************
     C                   MOVEL     W2NAK         XNAK
     C                   Z-ADD     30            XN                2 0
     C     STSMAX        TAG
     C     AL(XN)        IFEQ      ' '
     C                   MOVE      '9'           AL(XN)
     C                   SUB       1             XN
     C     XN            IFGE      1
     C                   GOTO      STSMAX
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C     THST          IFEQ      'O'
     C                   EXFMT     BEKREFT
     C                   END
     C     *IN12         IFEQ      '0'
     C                   MOVE      THREFF        UREFF
     C                   MOVE      THUNIK        UUNIK
     C                   MOVE      THAVD         UAVD
     C                   MOVE      THTDN         UTDN
     C                   MOVE      'J'           XOK               1
     C                   GOTO      SLHENT
     C                   ELSE
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     ZSVXHL02K     CHAIN     ZSVXHL02                           33
     C                   MOVE      'O'           THST
     C                   UPDATE    SVXHR
     C                   MOVE      '1'           *IN99
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
      *
     C     *IN99         IFEQ      '1'
     C                   MOVEA     '00'          *IN(98)
     C                   ELSE
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     ZSVXHL02K     KLIST
     C                   KFLD                    THUNIK
     C                   KFLD                    THREFF
      *
     C     *ENTRY        PLIST
     C                   PARM                    UFIRM             2
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    UREFF            17
     C                   PARM                    UUNIK             9 0
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      *ZEROS        UAVD
     C                   MOVE      *ZEROS        UTDN
     C                   MOVE      *BLANKS       UREFF
     C                   MOVE      *ZEROS        UUNIK
     C                   MOVE      *ZEROS        UFLAGG
     C                   MOVEA     '100'         *IN(27)
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
