     FSVNH      UF   E           K DISK
     FSVNHE     UF   E           K DISK
     FSVTHA     IF   E           K DISK
     FSVX081D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *____________________
      * Definiere variabler
      *""""""""""""""""""""
     C     *LIKE         DEFINE    TIAVD         UAVD
     C     *LIKE         DEFINE    TITDN         UTDN
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UAVD
     C                   PARM                    UTDN
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     SVNHK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SVNHK         CHAIN(N)  SVNH                               90
     C                   EVAL      WSSGDK=TISGDK
     C                   EVAL      WSSGUT=TISGUT
      * Sigiller via keypad eller automatsik ?
     C     TISG          CHAIN     SVTHA
     C     SVTH_DKEYN    IFNE      *BLANKS
     C                   EXSR      SRCC
     C                   ENDIF
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     SVX081DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB8
     C     *IN12         CABEQ     *ON           SRB9

     C     SRB8          TAG
     C     SVNHK         CHAIN     SVNH                               90
     C                   EVAL      TISGDK=WSSGDK
     C                   EVAL      TISGUT=WSSGUT
     C                   UPDATE    SVNHR
      * Slett edifact
     C     SVNHK         SETLL     SVNHE
     C     SVNHK         READE     SVNHE                                  51
     C     *IN51         DOWEQ     *OFF
     C                   DELETE    SVNHER
     C     SVNHK         READE     SVNHE                                  51
     C                   ENDDO
      * Lag edifact pånytt med riktig sigill
     C     TISGDK        IFNE      *BLANKS
     C     TISGDK        ANDNE     '000000'
     C                   CALL      'SVX151R'
     C                   PARM                    TIAVD
     C                   PARM                    TITDN
     C                   PARM                    TIMF

     C                   ENDIF

     C     SRB9          TAG
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Berækna utstællarsigill                             SRCC /
      *////////////////////////////////////////////////////////////
     C     SRCC          BEGSR
      * Send oppdrag til sigillering
     C                   MOVEL     TIAVD         QTFIEL
     C                   MOVE      TITDN         QTFIEL
     C                   CALL      'QSNDDTAQ'
     C                   PARM      'SVGSRQ'      QTNAME           10
     C                   PARM      '*LIBL'       QTLIB            10
     C                   PARM      11            QTLEN             5 0
     C                   PARM                    QTFIEL           11
      * Sigillering
     C                   CALL      'SEALCTL'
     C                   PARM      'SVG003RN  '  QPARM            10
      * Retur fra sigillering
     C                   MOVEL     TIAVD         QKEY
     C                   MOVE      TITDN         QKEY
     C                   CALL      'QRCVDTAQ'
     C                   PARM      'SVGSSQ'      QRNAME           10
     C                   PARM      '*LIBL'       QRLIB            10
     C                   PARM      6             QRLEN             5 0
     C                   PARM                    WSSGUT
     C                   PARM      99            QWAIT             5 0
     C                   PARM      'EQ'          QORDER            2
     C                   PARM      11            QKILEN            3 0
     C                   PARM                    QKEY             11
     C                   PARM      10            QSNDRL            3 0
     C                   PARM                    QSNDR            10
     C                   ENDSR
