     FEDIS      IF   E             DISK
     C   20              READ      EDIS                                   20
     C     *LIKE         DEFINE    SSN           WSN
     C                   CALL      'SVX101RH'
     C                   PARM      7755          WSN
     C                   PARM      'F'           WNETW             1
     C                   EVAL      *INLR=*ON
