     FEDIS      O  A E             DISK
     FEDIM      O  A E             DISK
     FEDIC      UF   E             DISK
     FEDISE     O  A E             DISK
      *____________________
      * DS for input string
      *""""""""""""""""""""
     D                 DS
     D  A                      1     70    DIM(70)
     D  ADS                    1     70
      *_____________________
      * DS for output string
      *"""""""""""""""""""""
     D                 DS
     D  B                      1     80    DIM(80)
     D  SDATA                  1     80
     D                 DS
     D  SEMBR                  1     10
     D  SEMBR1                 1      1
     D  SEMBR2                 2     10
      *//////////////
      *  Hodelogikk /
      *//////////////
      * Initiering av variabler og nøkler
     C                   EXSR      SRA
      * LAGE KVITTERINGS FIL
     C                   EXSR      SRC
      *
     C                   EXSR      SREDIM
     C                   EXSR      SREDIS
      *
     C                   MOVE      '1'           *INLR
      *
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
      *_____________
      * Init av felt
      *"""""""""""""
      * Hente dagens dato og klokkeslett.
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
      * Workfields for Array's
     C                   Z-ADD     0             AX                2 0          Index for A
     C                   Z-ADD     1             BX                2 0          Index for B
     C                   Z-ADD     0             AXV               2 0          Leftindx A
     C                   Z-ADD     0             AXH               2 0          Rightindx A
     C                   MOVE      'R'           WDIR              1            Search direction
     C                   MOVE      *BLANKS       WCHAR             1            Test character
     C                   MOVE      'Y'           WCHART            1            Test character
      * Workfields for separation character  '
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UTDN              7
     C                   PARM                    USG               3
     C                   PARM                    UA0004           35
     C                   PARM                    UA0007            4
     C                   PARM                    UA0008           14
     C                   PARM                    UM0010           35
     C                   PARM                    UM0007            4
     C                   PARM                    UM0008           14
     C                   PARM                    U0020            14
     C                   PARM                    U0022            14
     C                   PARM                    U0035             1
     C                   PARM                    U1225             3
      *
     C     1             CHAIN     EDIC                               32
     C                   ADD       1             CMN
     C                   ADD       1             CSN
     C                   UPDATE    EDICR
     C                   MOVE      *BLANKS       SEMBR
     C                   MOVE      'K'           SEMBR1
     C                   MOVEL     CSN           SEMBR2
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Les meldinger                                        SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
      *
     C                   EXSR      UNA00
     C                   EXSR      UNB00
     C                   EXSR      UNH00
     C                   EXSR      UCI00
     C                   EXSR      UNT00
     C                   EXSR      UNZ00
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  SENDINGSTART                                       UNA00 /
      *////////////////////////////////////////////////////////////
     C     UNA00         BEGSR
     C                   EVAL      ADS = 'UNA:+.? ' + WAPSTR
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Sendningsstart                                     UNB00 /
      *////////////////////////////////////////////////////////////
     C     UNB00         BEGSR
      *______________
      * START SEGMENT
      *""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNB+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *______________________
      * SYNTAX IDENTIFIKASJON
      *""""""""""""""""""""""
      * Identifikasjon og versjon
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNOC:3+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________________
      * OVERFØRINGSAVSENDER
      *""""""""""""""""""""
      * Identifikasjon
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     UA0004        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C                   IF        ((UA0007 <> *BLANKS) OR (UA0008 <> *BLANKS))
     C                   EVAL      ADS = ':' + UA0007
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        UA0008 <> *BLANKS
     C                   EVAL      ADS = ':' + UA0008
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________________
      * OVERFØRINGSMOTTAKER
      *""""""""""""""""""""
      * Identifikasjon og Qualifier
     C                   EVAL      ADS = UM0010
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C                   IF        ((UM0007 <> *BLANKS) OR (UM0008 <> *BLANKS))
     C                   EVAL      ADS = ':' + UM0007
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        UM0008 <> *BLANKS
     C                   EVAL      ADS = ':' + UM0008
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________________________________________
      * DATO/TID FOR FREMSTILLING AV OVERFØRINGEN
      *""""""""""""""""""""""""""""""""""""""""""
      * Dato
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WDT           ADS
     C                   Z-ADD     3             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Tid
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WTM           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *________________________
      * OVERFØRINGENS REFERANSE
      *""""""""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     U0020         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *________________________
      * RECIPENT'S REFERENCE
      *""""""""""""""""""""""""
     C                   EVAL      ADS = U0022
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *______________________________________________
      * APPLIKASJONSREFERANSE
      *""""""""""""""""""""""""""""""""""""""""""""""
     C                   EVAL      ADS = 'CONTRLTI-KV'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      *______________
      * TESTINDIKATOR
      *""""""""""""""
     C                   IF        U0035 > '0'                                  <----------I
     C                   EVAL      ADS = '++++'                                            I
     C                   Z-ADD     1             AXV                                       I
     C                   Z-ADD     4             AXH                                       I
     C                   MOVE      'N'           WCHART                                    I
     C                   EXSR      SRÅ                                                     I
      *                                                               I                    I
     C                   MOVE      *BLANKS       ADS                                       I
     C                   MOVEL     U0035         ADS                                       I
     C                   Z-ADD     1             AXV                                       I
     C                   Z-ADD     1             AXH                                       I
     C                   EXSR      SRÅ                                                     I
     C                   END                                                    <----------I
      *______________
      * SLUTT SEGMENT
      *""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Meldingsstart                                      UNH00 /
      *////////////////////////////////////////////////////////////
     C     UNH00         BEGSR
      * Segmentnavn
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNH+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Meldingsreferanse
     C                   EVAL      ADS = UAVD + UTDN + USG
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Meldingstype
      *
     C                   MOVE      *BLANKS       ADS
     C                   EVAL      ADS = 'CONTRL:D:3:UN:SEC02A'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     20            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  INTERCHARGE RESPONSE                               UCI00 /
      *////////////////////////////////////////////////////////////
     C     UCI00         BEGSR
      * Segmentnavn
     C                   EVAL      ADS = 'UCI+' + U0020
     C                   Z-ADD     1             AXV
     C                   Z-ADD     18            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EVAL      ADS = UM0010
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C                   IF        ((UM0007 <> *BLANKS) OR (UM0008 <> *BLANKS))
     C                   EVAL      ADS = ':' + UM0007
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        UM0008 <> *BLANKS
     C                   EVAL      ADS = ':' + UM0008
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EVAL      ADS = UA0004
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C                   IF        ((UA0007 <> *BLANKS) OR (UA0008 <> *BLANKS))
     C                   EVAL      ADS = ':' + UA0007
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        UA0008 <> *BLANKS
     C                   EVAL      ADS = ':' + UA0008
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+7'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Meldingsslutt                                      UNT00 /
      *////////////////////////////////////////////////////////////
     C     UNT00         BEGSR
      * Segmentnavn
     C                   EVAL      ADS = 'UNT+3+' + UAVD + UTDN + USG
     C                   Z-ADD     1             AXV
     C                   Z-ADD     20            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Sendningsslutt                                     UNZ00 /
      *////////////////////////////////////////////////////////////
     C     UNZ00         BEGSR
      * Start segment
     C                   EVAL      ADS = 'UNZ+1+' + U0020
     C                   Z-ADD     1             AXV
     C                   Z-ADD     20            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     BX            IFGT      1
     C                   WRITE     EDISER
     C                   END
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'                                          <-------------I
     C     AXV           DO        AXH           AXV                             <-----------II
     C     A(AXV)        COMP      '0'                                  8383                 II
     C   83              END                                                     <-----------II
      * Find last non-blank position                                     I
     C                   ELSE                                                   <-------------I
      *                                                                  I
     C     SRÅ01         TAG                                                                  I
      *                                                                  I
     C     AXH           IFGT      AXV                                           <-----------II
     C     A(AXH)        IFEQ      *BLANKS                                        <---------III
     C                   SUB       1             AXH                                        III
     C                   GOTO      SRÅ01                                                    III
     C                   END                                                      <---------III
     C                   END                                                     <-----------II
     C                   END                                                    <-------------I
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV                            <-------------I
     C                   MOVE      A(AXV)        WCHAR                                        I
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'                                           <-----------II
     C     WDIR          IFEQ      'R'                                            <---------III
     C     WCHAR         COMP      WAPSTR                                 83                III
     C  N83WCHAR         COMP      '+'                                    83                III
     C  N83WCHAR         COMP      ':'                                    83                III
     C  N83WCHAR         COMP      '?'                                    83                III
     C   83              EXSR      SRÅA                                                     III
     C                   END                                                      <---------III
     C                   END                                                     <-----------II
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)                                        I
     C                   ADD       1             BX                                           I
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80                                            <-----------II
     C                   WRITE     EDISER                                                    II
     C                   Z-ADD     1             BX                                          II
     C                   MOVE      *BLANKS       SDATA                                       II
     C                   END                                                     <-----------II
      *                                                                  I
     C                   END                                                    <-------------I
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80                                           <-------------I
     C                   WRITE     EDISER                                                     I
     C                   Z-ADD     1             BX                                           I
     C                   MOVE      *BLANKS       SDATA                                        I
     C                   END                                                    <-------------I
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * OPPDATER EDIM                                      SREDIM /
      *////////////////////////////////////////////////////////////
     C     SREDIM        BEGSR
      *
     C                   EVAL      M0004 = UA0004
     C                   EVAL      M0010 = UM0010
     C                   EVAL      M0035 = U0035
     C                   EVAL      M0062 = UAVD + UTDN + USG
     C                   EVAL      M0065 = 'CONTRL'
     C                   EVAL      M0068 = UAVD + UTDN + USG
     C                   EVAL      M1001 = 'STE'
     C                   EVAL      M1004 = U0022
     C                   EVAL      M1225 = U1225
     C                   EVAL      MSN   = CSN
     C                   EVAL      MMN   = CMN
     C                   EVAL      MSR   = 'S'
     C                   EVAL      MST   = 'C'
     C                   MOVE      WDT           MDT
     C                   MOVE      WTM           MTM
     C                   EVAL      M1N07 = 'C02'
     C                   MOVE      UAVD          MAVD
     C                   MOVE      UTDN          MTDN
     C                   WRITE     EDIMR
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      * OPPDATER EDIS                                      SREDIS /
      *////////////////////////////////////////////////////////////
     C     SREDIS        BEGSR
      *
     C                   EVAL      S0004 = UA0004
     C                   EVAL      S0010 = UM0010
     C                   EVAL      S0020 = U0020
     C                   EVAL      S0026 = 'CONTRLTI-KV'
     C                   EVAL      S0035 = U0035
     C                   EVAL      S0036 = 1
     C                   EVAL      SSN   = CSN
     C                   EVAL      SSR   = 'S'
     C                   EVAL      SST   = 'A'
     C                   MOVE      SDT           MDT
     C                   MOVE      STM           MTM
     C                   EVAL      SLIB  = '*LIBL'
     C                   EVAL      SFILE = 'EDISE'
     C                   EVAL      SMBR  = SEMBR
     C                   WRITE     EDISR
      *
     C                   ENDSR
      *
