     C                   CALL      'SVX101r'
     C                   PARM      1             UAVD              4 0
     C                   PARM      50146         UTDN              7 0
     C                   PARM      '015'         U1N07             3
     C                   PARM                    UDATA         10000
     C                   EVAL      *INLR=*ON
