     FSVNHE     IF   E           K DISK
     D  XVNH_BYTE      S              7S 0
      */////////////
      * MAIN LOGIC /
      */////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRB
     C                   MOVE      *ON           *INLR
      *////////////////////////////////////////////////////////////
      * SR for init                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
     C     *LIKE         DEFINE    XVNH_BYTE     UVNH_BYTE
     C     *LIKE         DEFINE    SVNHE_SYA     UVNHE_SYA
     C     *LIKE         DEFINE    SVNHE_SYO     UVNHE_SYO
      * INIT AV ARBEIDSFELT
     C                   EVAL      UVNH_BYTE=0
      *________________________
      * Input/output parameters
      *""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UVNHE_SYA
     C                   PARM                    UVNHE_SYO
     C                   PARM                    UVNH_BYTE
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    UVNHE_SYA
     C                   KFLD                    UVNHE_SYO
     C     KEYA          SETLL     SVNHE
     C     KEYA          READE     SVNHE                                  51
     C     ENDINI        ENDSR
      *////////////////////////////////////////////////////////////
      * SR Les og tell                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     *IN51         DOWEQ     *OFF
     C                   ADD       80            UVNH_BYTE
     C     KEYA          READE     SVNHE                                  51
     C                   ENDDO
     C                   SUB       80            UVNH_BYTE
     C     ' '           CHECKR(E) SVNHE_DTA     XVNH_BYTE
     C                   ADD       XVNH_BYTE     UVNH_BYTE
     C                   ENDSR
