     H DEBUG
      * RECEIVER VARIABLE
     D                 DS
     DVARR                     1   1024
     D  VARIPA               878    892
      * BINARY NUMBER DEFINITIONS
     D                 DS
     D  LENDTA                 1      4B 0
      * DEFINITIONS
     C     *LIKE         DEFINE    LENDTA        VARLEN
     C                   Z-ADD     1024          VARLEN
      * PARAMETERS
     C     *ENTRY        PLIST
     C                   PARM                    DEVICE           10
     C                   PARM      VARIPA        IPADR            15
      * RETREIVE DEVICE DESCRIPTION
     C                   CALL      'QDCRDEVD'
     C                   PARM                    VARR
     C                   PARM                    VARLEN
     C                   PARM      'DEVD0600'    VARFMT            8
     C                   PARM      DEVICE        VARDEV           10
     C                   PARM                    VARERR          256
      *
     C                   DUMP
      *
     C                   RETURN
