     FHEAD14    IF   E           K DISK
     C*
     C     TURK          KLIST
     C                   KFLD                    TURNRW            8 0
     C                   Z-ADD     3             UFLAGG
     C*
     C                   Z-ADD     0             TURNRW
     C*
     C     TURK          SETLL     HEAD14
     C     *IN33         DOWEQ     '0'
     C     LES           TAG
     C                   READ      HEAD14                                 33
      * IKKE PRØV Å BEREGNE AGENTLINJER PÅ OPPDRAG UTEN AGENT
     C     *IN33         IFEQ      *OFF
     C     HEKNA         ANDEQ     0
     C                   GOTO      LES
     C                   ENDIF                                                  <*IN33
      *
     C     *IN33         IFEQ      '0'
     C                   MOVE      'NY'          XNYGML
     C                   MOVE      '01'          FIFIRM
     C                   CALL      'SYAM10X'
     C                   PARM                    FIFIRM            2
     C                   PARM                    HEAVD             4 0
     C                   PARM                    HEOPD             7 0
     C                   PARM                    XNYGML            2
     C                   PARM                    KO2UTL            1
     C                   PARM                    XKUTL             4 2
     C                   PARM                    XSUTL             4 2
     C                   PARM                    XKUMIN            2 0
     C                   PARM                    XSUMIN            2 0
     C                   PARM                    KO2MVK            1
     C                   PARM                    KO2MVS            1
     C                   PARM                    UKFRA             7 0
     C                   PARM                    KOVAVR            1
     C                   PARM                    WSMSG            62
     C                   PARM                    WSMELD            1
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    UKODE             1
     C                   PARM                    USECUR            6
     C                   END                                                    <*IN33
     C                   END                                                    <*IN33
     C*
     C*
     C     SLUTT         TAG
     C*
     C                   SETON                                        LR
     C                   RETURN
