********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 åpne close av skjermfil
********************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL SKRIVE UT AMETAAVREGNING                  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER                                     ***
      **************************************************************
      *
     FFIRM      IF   E           K DISK
     FHEADF     IF   E           K DISK
     FVALUAL01  IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FAMHE      UF   E           K DISK
     FAMDE      IF   E           K DISK
ERT  FAMGE      IF   E           K DISK
ERT  FKODTGE    IF   E           K DISK
ERT  FKODTG2    IF   E           K DISK
     FAMANDEL   IF   E           K DISK
     FTURER14   IF   E           K DISK
s01  F*YAM02FM  CF   E             WORKSTN
N01  FSYAM02FM  CF   E             WORKSTN USROPN
     FSYAM02PF  O    E             PRINTER
     FSYAM02P2  O    E             PRINTER
     D                 DS
     D  UEPOS1                 1      7
     D  QEPOS1                 2      4
NV5  D                 DS
NV5  D  HEADAT                 1      6  0
NV5  D  HEADD                  1      2  0
NV5  D  HEAMM                  3      4  0
NV5  D  HEAÅÅ                  5      6  0
NV5  D                 DS
NV5  D  AHADAT                 1      8  0
NV5  D  AHAÅÅ                  1      4  0
NV5  D  AHAMM                  5      6  0
NV5  D  AHADD                  7      8  0
     D                 DS
     D  KSBELA                 1     17  4
     D                 DS
     D  KSBELE                 1     17  4
     D                UDS
     D  WT                   311    566  0
     D                                     DIM(32)
      *
      * UTURNR = 0 BETYR AT DET ER FRITTSTÅENDE UTSKRIFT MED BILDE
      * UTURNR > 0 BETYR AT VI KOMMER FRA 'ARBEIDE MED AMETA' ELLER
      *            'PERIODEAVREGNIG'
      * UFRA='P' BETYR AT VI KOMMER FRA PERIODEAVREGNING
      *
     C     *ENTRY        PLIST
     C                   PARM                    UTURNR            8 0
     C                   PARM                    UKNA              8 0
     C                   PARM                    UFRA              1
     C                   MOVE      UTURNR        W1TNR
     C                   MOVE      UKNA          W1KNA
     C*
     C                   EXSR      INIT
     C     START         TAG
     C*
     C*          UTURNR = 0 BETYR AT DET ER FRITTSTÅENDE UTSKRIFT MED VALG FRA
     C*          SKJERMBILDE. ELLERS KOMMER VI VIA F3 FRA 'ARBEIDE MED AMETA'
     C*
     C     UTURNR        IFEQ      *ZEROS
N01  C                   OPEN      SYAM02FM
     C                   MOVE      'S'           SKJERM            1
     C     CHOISE        TAG
     C                   EXSR      INICLR
     C                   Z-ADD     04            LINNBR
     C                   Z-ADD     29            POSNBR
     C                   EXFMT     BILDE1
     C                   Z-ADD     0             ANTDET
     C*
     C**  AVSLUTT
     C*
     C   03              GOTO      SLUTT
     C*
     C                   EXSR      TESTB1
     C   30              GOTO      CHOISE
N01  C                   CLOSE     SYAM02FM
     C                   ENDIF                                                  <UTURNR
     C*
     C     NYAMET        TAG
     C     UTURNR        IFEQ      *ZEROS
     C                   Z-ADD     W1TNR         ZTUNR
     C                   Z-ADD     W1KNA         ZKNA
     C                   ELSE
     C                   EXSR      INICLR
     C     UFRA          IFNE      '0'
     C                   ADD       1             IX
     C                   Z-ADD     WT(IX)        ZTUNR
     C                   ELSE
     C                   Z-ADD     UTURNR        ZTUNR
     C                   Z-ADD     UKNA          ZKNA
     C                   ENDIF                                                  <UFRA
     C     ZTUNR         IFEQ      *ZEROS
     C                   GOTO      SLUTT
     C                   ENDIF                                                  <ZTUNR
     C                   ENDIF                                                  <UTURNR
     C     AMHEKY        CHAIN     AMHE                               39
     C     *IN39         IFEQ      *OFF
     C     UTURNR        IFNE      *ZEROS
     C     UFRA          IFNE      'P'
     C     AHST          IFNE      '4'
     C                   GOTO      NYAMET
     C                   ELSE
     C                   MOVE      '5'           AHST
     C                   UPDATE    AMHER
     C                   ENDIF                                                  <AHST
     C                   ENDIF                                                  <AFRA
     C                   ENDIF                                                  <UTURNR
     C                   EXSR      HNAVN
     C                   Z-ADD     1             WRUNDE            1 0
     C                   EXSR      LESAME
      *
      * SKRIVER HEADING 1 VED SIDEBRUDD
      *
     C     ANTDET        IFGE      MAXLIN
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD1                                66
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     HEAD1                                66
     C                   WRITE     STREK                                66
     C                   END
      *
      * SKRIVER HEADING 2 VED NOT IN42
      *
     C     *IN42         IFEQ      *OFF
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD2A                               66
     C                   ELSE
     C                   WRITE     HEAD2A                               66
     C                   END
     C                   ENDIF                                                  <*IN42
     C                   CLEAR                   ANTDET
     C                   ENDIF                                                  <ANTDET
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XTREK                                66
     C                   ELSE
     C  N42              WRITE     STREK                                66
     C                   END
     C                   EXSR      NETTOS
     C     AHTYPE        IFEQ      'P'
     C                   Z-ADD     SMAINT        S1AINT
     C                   Z-ADD     SMAUTG        S1AUTG
     C                   Z-ADD     SMEINT        S1EINT
     C                   Z-ADD     SMEUTG        S1EUTG
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XSUMF1                               66
     C   41
     CAN 42              WRITE     XSUMF1                               66
     C                   ELSE
     C  N42              WRITE     PSUMF1                               66
     C   41
     CAN 42              WRITE     PSUMF1                               66
     C                   END
     C                   ELSE
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XUMF                                 66
     C   41
     CAN 42              WRITE     XUMF                                 66
     C  N41
     CAN 42              WRITE     XUMA                                 66
     C                   ELSE
     C  N42              WRITE     SUMF                                 66
     C   41
     CAN 42              WRITE     SUMF                                 66
     C  N41
     CAN 42              WRITE     SUMA                                 66
     C                   END
     C                   ENDIF                                                  <AHTYPE
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XTREK                                66
     C                   ELSE
     C  N42              WRITE     STREK                                66
     C                   END
     C                   EXSR      BSALDO
     C     AHTYPE        IFEQ      'P'
     C                   Z-ADD     2             WRUNDE
     C                   MOVE      *OFF          *IN88
     C                   EXSR      LESAME
     C     AASPES        IFEQ      'S'
     C                   WRITE     XTREK                                66
     C                   WRITE     XSUMF2                               66
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     STREK                                66
     C                   WRITE     PSUMF2                               66
     C                   WRITE     STREK                                66
     C                   END
     C                   EXSR      BGEVP
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEVINSTP                             66
     C                   WRITE     XTREK                                66
     C                   WRITE     XMKE                                 66
     C                   WRITE     XMKP                                 66
     C                   ELSE
     C                   WRITE     GEVINSTP                             66
     C                   WRITE     STREK                                66
     C                   WRITE     OMKE                                 66
     C                   WRITE     OMKP                                 66
     C                   END
     C     S1EINT        DIV       2             H1EINT
     C     AASPES        IFEQ      'S'
     C                   WRITE     XNNE                                 66
     C                   ELSE
     C                   WRITE     INNE                                 66
     C                   END
     C     S1AINT        DIV       2             H1AINT
     C     AASPES        IFEQ      'S'
     C                   WRITE     XNNP                                 66
     C                   ELSE
     C                   WRITE     INNP                                 66
     C                   END
     C     S2EUTG        DIV       2             H2EDIF
     C     AASPES        IFEQ      'S'
     C                   WRITE     XRAE                                 66
     C                   ELSE
     C                   WRITE     FRAE                                 66
     C                   END
     C     S2AUTG        DIV       2             H2ADIF
     C     AASPES        IFEQ      'S'
     C                   WRITE     XRAP                                 66
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     FRAP                                 66
     C                   WRITE     STREK                                66
     C                   END
     C                   EXSR      BRESP
     C     AASPES        IFEQ      'S'
     C                   WRITE     XESKONF                              66
     C                   ELSE
     C                   WRITE     RESKONF                              66
     C                   END
     C                   ELSE
     C     AASPES        IFEQ      'S'
     C                   WRITE     XALDO                                66
     C                   WRITE     XURS                                 66
     C  N42              WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     SALDO                                66
     C                   WRITE     KURS                                 66
     C  N42              WRITE     STREK                                66
     C                   END
     C                   EXSR      BGEV
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XEVINST                              66
     C                   ELSE
     C  N42              WRITE     GEVINST                              66
     C                   END
     C                   EXSR      BDEL
     C     AASPES        IFEQ      'S'
     C  N42              WRITE     XANDEL                               66
     C  N42              WRITE     XTREK                                66
     C                   ELSE
     C  N42              WRITE     PANDEL                               66
     C  N42              WRITE     STREK                                66
     C                   END
     C                   EXSR      BRES
     C     AASPES        IFEQ      'S'
     C  N41
     CAN 42              WRITE     XESKONA                              66
     C  N42              WRITE     XESKONF                              66
     C                   ELSE
     C  N41
     CAN 42              WRITE     RESKONA                              66
     C  N42              WRITE     RESKONF                              66
     C                   END
     C                   ENDIF                                                  <AHTYPE
     C                   ENDIF                                                  <*IN39
     C                   MOVE      'DIV2489'     MSGNR
     C                   SETON                                        30
     C     UFRA          IFEQ      '0'
     C                   GOTO      SLUTT
     C                   ENDIF                                                  <UFRA
     C     UTURNR        IFEQ      *ZEROS
     C                   GOTO      CHOISE
     C                   ELSE
     C                   GOTO      NYAMET
     C                   ENDIF                                                  <UTURNR
     C*
     C     SLUTT         TAG
     C* DUMMY
     C                   MOVE      *OFF          *IN77
     C     *IN77         IFEQ      *ON
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETALJ                               66
     C                   WRITE     XUM                                  66
     C                   ELSE
     C                   WRITE     DETALJ                               66
     C                   WRITE     SUM                                  66
     C                   END
     C                   ENDIF
     C                   SETON                                        LR
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C                   MOVEA     '0'           *IN(30)
     C                   MOVEA     '0'           *IN(70)
     C* BLANK AGENTNUMMER ??
     C     W1KNA         IFEQ      *ZEROS
     C     W1TNR         CHAIN     TURER14                            32
     C     *IN32         IFEQ      *OFF
     C                   MOVE      TUKNA         W1KNA
     C                   ENDIF                                                  <*IN32
     C                   ENDIF                                                  <*IN70
     C* TURNUMMER
     C                   MOVE      W1TNR         ZTUNR
     C                   MOVE      W1KNA         ZKNA
     C     AMHEKY        CHAIN     AMHE                               70
     C     *IN70         IFEQ      *ON
     C                   MOVE      'DIV2488'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   GOTO      SLTB1
     C                   ENDIF                                                  <*IN70
     C*
     C                   EXSR      S9999
     C*
     C     SLTB1         ENDSR
     C***********************************************
     C     LESAME        BEGSR
     C***********************************************
     C* ---------------------------------------------
     C* LES ALLE AMETALINJER
     C* """""""""""""""""""""""""""""""""""""""""""""
     C*
     C                   MOVE      *OFF          *IN49
     C                   MOVE      W1TNR         ZTUNR
     C                   MOVE      W1KNA         ZKNA
     C     AHTYPE        IFEQ      'P'
     C     WRUNDE        IFEQ      1
     C                   MOVE      *LOVAL        ZPOS
     C                   MOVE      *ZEROS        ZUNR
     C                   ELSE
     C                   MOVEL     '9999'        ZPOS
     C                   MOVE      *ZEROS        ZUNR
     C                   CLEAR                   DEAINT
     C                   CLEAR                   DEAUTG
     C                   CLEAR                   DEEINT
     C                   CLEAR                   DEEUTG
     C                   ENDIF                                                  <WRUNDE
     C                   ENDIF                                                  <AHTYPE
     C     AMDEKY        SETLL     AMDE                                   38
     C     AMTAG1        TAG
     C     AMHEKY        READE     AMDE                                   38
     C* POOL - RUNDE NR. 1
     C* POOL - IKKE SKRIV 9999 LINJER SAMMEN MED DETALJER
     C     *IN38         IFEQ      *OFF
     C     AHTYPE        ANDEQ     'P'
     C     WRUNDE        ANDEQ     1
     C     ADPOS         ANDEQ     '9999'
     C                   MOVE      *ON           *IN38
     C                   ENDIF                                                  <*IN38
     C* POOL - RUNDE NR. 2
     C* POOL - SKRIV 9999 LINJER ETTER  TOTAL
     C     *IN38         IFEQ      *OFF
     C     AHTYPE        ANDEQ     'P'
     C     WRUNDE        ANDEQ     2
     C     ADPOS         ANDNE     '9999'
     C                   GOTO      AMTAG1
     C                   ENDIF                                                  <*IN38
     C* POOL - TELL 9999 LINJER
     C     *IN38         IFEQ      *OFF
     C     AHTYPE        ANDEQ     'P'
     C     WRUNDE        ANDEQ     2
     C     ADPOS         ANDEQ     '9999'
     C                   MOVE      *ON           *IN88
     C                   ADD       ADAINT        S2AINT
     C                   ADD       ADAUTG        S2AUTG
     C                   ADD       ADEINT        S2EINT
     C                   ADD       ADEUTG        S2EUTG
     C                   ENDIF                                                  <*IN38
     C*   SLUTT
     C     AHTYPE        IFEQ      'P'
     C     WRUNDE        IFEQ      2
     C     *IN38         ANDEQ     *ON
     C     *IN88         ANDEQ     *OFF
     C                   GOTO      ENDAME
     C                   ENDIF                                                  <WRUNDE
     C                   ENDIF                                                  <AHTYPE
     C     *IN38         IFEQ      *ON
     C     DEPOS         IFEQ      '9999'
     C                   ADD       2             ANTDET
     C                   ENDIF                                                  <DEPOS
     C     DETXT         IFEQ      *BLANKS
     C     DETXT         IFEQ      *BLANKS
     C                   ADD       2             ANTDET
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETALJA                              66
     C                   ELSE
     C                   WRITE     DETALJA                              66
     C                   END
     C                   ELSE
     C                   ADD       3             ANTDET
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETALJB                              66
     C                   ELSE
     C                   WRITE     DETALJB                              66
     C                   END
     C                   ENDIF                                                  <DETXT
     C                   ENDIF                                                  <DEPOS
     C                   EXSR      NETTOD
     C     *IN42         IFEQ      *OFF
     C                   EXSR      FINNVK
     C     UEPOS1        IFEQ      '9999'
     C                   MOVE      *OFF          *IN90
     C                   ELSE
     C                   MOVE      *ON           *IN90
ERT  C                   END                                                    <UEPOS1
ERT  C     AAUTV         IFNE      'J'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ENDIF                                                  <AAUTV
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETF                                 66
     C                   ELSE
     C                   WRITE     DETF                                 66
     C                   END
     C     AASPES        IFEQ      'J'
ERT  C                   EXSR      DETFG
     C                   ENDIF                                                  <AASPES
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETF
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ELSE
     C                   EXSR      FINNVK
     C     *IN41         IFEQ      *ON
     C     DEPOS         IFNE      '9999'
ERT  C     UEPOS1        IFEQ      '9999'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ELSE
ERT  C                   MOVE      *ON           *IN90
ERT  C                   ENDIF                                                  <UEPOS1
ERT  C     AAUTV         IFNE      'J'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ENDIF                                                  <AAUTV
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETF                                 66
     C                   ELSE
     C                   WRITE     DETF                                 66
     C                   END
     C     AASPES        IFEQ      'J'
ERT  C                   EXSR      DETFG
     C                   ENDIF                                                  <AASPES
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETF
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ENDIF                                                  <DEPOS
     C                   ELSE
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETA                                 66
     C                   ELSE
     C                   WRITE     DETA                                 66
     C                   END
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETA
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ENDIF                                                  <*IN41
     C                   ENDIF                                                  <*IN42
     C                   GOTO      ENDAME
     C                   ENDIF                                                  <*IN38
     C*
     C                   EXSR      S9999
      *
      * SKRIVER HEADING 1 VED IN49 OG SIDEBRUDD
      * 49 VIL SI EN LINJE SKREVET
      *
     C     *IN49         IFEQ      *ON
     C     ANTDET        IFGE      MAXLIN
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD1                                66
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     HEAD1                                66
     C                   WRITE     STREK                                66
     C                   END
     C     *IN42         IFEQ      *OFF
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD2A                               66
     C                   ELSE
     C                   WRITE     HEAD2A                               66
     C                   END
     C                   ENDIF                                                  <*IN42
     C     AASPES        IFEQ      'S'
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     STREK                                66
     C                   END
     C                   CLEAR                   ANTDET
     C                   END                                                    <ANTDET
     C     DEPOS         IFEQ      '9999'
     C                   ADD       2             ANTDET
     C                   ENDIF                                                  <DEPOS
     C     DEPOS         IFNE      '9999'
     C     DETXT         IFEQ      *BLANKS
     C                   ADD       2             ANTDET
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETALJA                              66
     C                   ELSE
     C                   WRITE     DETALJA                              66
     C                   END
     C                   ELSE
     C                   ADD       3             ANTDET
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETALJB                              66
     C                   ELSE
     C                   WRITE     DETALJB                              66
     C                   END
     C                   ENDIF                                                  <DETXT
     C                   ENDIF                                                  <DEPOS
     C                   EXSR      NETTOD
     C     *IN42         IFEQ      *OFF
     C                   EXSR      FINNVK
ERT  C     UEPOS1        IFEQ      '9999'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ELSE
ERT  C                   MOVE      *ON           *IN90
ERT  C                   ENDIF                                                  <UEPOS1
ERT  C     AAUTV         IFNE      'J'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ENDIF                                                  <AAUTV
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETF                                 66
     C                   ELSE
     C                   WRITE     DETF                                 66
     C                   END
     C     AASPES        IFEQ      'J'
ERT  C                   EXSR      DETFG
     C                   ENDIF                                                  <AASPES
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETF
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ELSE
     C                   EXSR      FINNVK
     C     *IN41         IFEQ      *ON
     C     DEPOS         IFNE      '9999'
ERT  C     UEPOS1        IFEQ      '9999'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ELSE
ERT  C                   MOVE      *ON           *IN90
ERT  C                   ENDIF                                                  <UEPOS1
ERT  C     AAUTV         IFNE      'J'
ERT  C                   MOVE      *OFF          *IN90
ERT  C                   ENDIF                                                  <AAUTV
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETF                                 66
     C                   ELSE
     C                   WRITE     DETF                                 66
     C                   END
     C     AASPES        IFEQ      'J'
ERT  C                   EXSR      DETFG
     C                   ENDIF                                                  <AASPES
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETF
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ENDIF                                                  <DEPOS
     C                   ELSE
     C     AASPES        IFEQ      'S'
     C                   WRITE     XETA                                 66
     C                   ELSE
     C                   WRITE     DETA                                 66
     C                   END
     C                   MOVE      *IN43         WIN43             1
     C                   MOVE      *IN44         WIN44             1
     C                   CLEAR                   DETA
     C                   MOVE      WIN43         *IN43
     C                   MOVE      WIN44         *IN44
     C                   ENDIF                                                  <*IN41
     C                   ENDIF                                                  <*IN42
     C                   CLEAR                   DEVKT
     C                   CLEAR                   DEM3
     C                   CLEAR                   DEAINT
     C                   CLEAR                   DEAUTG
     C                   CLEAR                   DEEINT
     C                   CLEAR                   DEEUTG
     C                   ENDIF                                                  <*IN49
     C                   MOVE      *ON           *IN49
     C                   EXSR      MOVDE
     C* FLERE AMETALINJER PÅ DENNE TUR
     C                   GOTO      AMTAG1
     C*
     C     ENDAME        TAG
     C                   ENDSR
ERT  C*
ERT  C******************************************
ERT  C     DETFG         BEGSR
ERT  C******************************************
ERT  C*
ERT  C* LES GEBYRER PÅ DETALJLINJE
ERT  C*
ERT  C                   MOVE      UEPOS1        ZPOS
ERT  C     ZPOS          IFNE      '9999'
ERT  C     AMGEKY        SETLL     AMGE                               40
ERT  C     *IN40         DOWEQ     *OFF
ERT  C     AMGEKY        READE     AMGE                                   40
ERT  C                   MOVE      *BLANKS       WGETXT
ERT   * ENGELSK
ERT  C     SPRAAK        IFEQ      'E'
ERT  C     KODGEK        CHAIN     KODTGE                             31
ERT  C  N31              MOVE      KGEENT        WGETXT
ERT  C                   ENDIF                                                  <SPRAAK
ERT   * TYSK
ERT  C     SPRAAK        IFEQ      'T'
ERT  C     KODG2K        CHAIN     KODTG2                             31
ERT  C  N31              MOVE      KG2TYT        WGETXT
ERT  C                   ENDIF                                                  <SPRAAK
ERT  C  N40              WRITE     DETFGEB                              66
ERT  C                   ENDDO
ERT  C                   ENDIF                                                  <ZPOS
ERT  C*
ERT  C                   ENDSR
     C*
     C******************************************
     C     FINNVK        BEGSR
     C******************************************
     C*
     C* FINNER FRAKTBEREGNINGSVEKT
     C*
     C     *LIKE         DEFINE    HEVKT         WVKT
     C     *LIKE         DEFINE    HELM          WLM
     C     *LIKE         DEFINE    HEM3          WM3
     C     HELM          MULT      AALKG         XFBV1             9 0
     C     HEM3          MULT      AAKKG         XFBV2             9 0
     C*
     C* BRUK VEKT/LM/M3  FRA AMETAAVREGNING - IKKE OPPDRAG
     C*
     C                   Z-ADD     0             WLM
     C                   Z-ADD     0             WM3
     C*
     C                   Z-ADD     DEVKT         WVKT
     C     DEVTXT        IFEQ      'LM'
     C                   Z-ADD     DEM3          WLM
     C                   ENDIF                                                  <DEVTXT
     C     DEVTXT        IFEQ      'M3'
     C                   Z-ADD     DEM3          WM3
     C                   ENDIF                                                  <DEVTXT
     C*
     C     WVKT          IFGE      XFBV1
     C                   Z-ADD     WVKT          UEFBV             9 0
     C                   ELSE
     C                   Z-ADD     XFBV1         UEFBV
     C                   ENDIF                                                  <WVKT
     C     UEFBV         IFLT      XFBV2
     C                   Z-ADD     XFBV2         UEFBV
     C                   ENDIF                                                  <UEFBV
     C*
     C* SJEKKER OM FELT FRA HEADF ER OVERSTYRT I AMDE
     C*
     C     DEPOS         IFNE      HEPOS1
     C                   MOVEL     DEPOS         UEPOS1
     C                   ELSE
     C                   MOVEL     HEPOS1        UEPOS1
     C                   ENDIF                                                  <DEPOS
     C     DEVKT         IFNE      HEVKT
     C                   Z-ADD     DEVKT         UEVKT
     C                   ELSE
     C                   Z-ADD     HEVKT         UEVKT
     C                   ENDIF                                                  <DEVKT
     C                   ADD       UEVKT         SMVKT
     C                   ADD       UEFBV         SMFBV
     C     DEM3          IFNE      HEM3
     C                   Z-ADD     DEM3          UEM3
     C                   MOVEL     DEVTXT        ULMM3
     C                   ELSE
     C                   Z-ADD     HEM3          UEM3
     C                   ENDIF                                                  <DEM3
     C     DEFR          IFNE      HEFR
     C                   MOVEL     DEFR          UEFR
     C                   ELSE
     C                   MOVEL     HEFR          UEFR
     C                   ENDIF                                                  <DEFR
     C*
     C                   ENDSR
     C***********************************************
     C     MOVHE         BEGSR
     C***********************************************
     C                   MOVE      AHAREF        HEAREF
     C                   MOVE      AHEREF        HEEREF
     C                   MOVE      KNAVN         HENAVN
     C                   MOVE      SYLAND        HELAND
     C                   MOVE      SYPOGE        HEPONR
     C                   MOVE      ADR3          HESTED
     C                   MOVE      AHBILN        HEBILN
SV5  C*                    MOVE AHADAT    HEADAT
NV5  C                   MOVE      AHADD         HEADD
NV5  C                   MOVE      AHAMM         HEAMM
NV5  C                   MOVE      AHAÅÅ         HEAÅÅ
     C                   ENDSR
     C***********************************************
     C     MOVDE         BEGSR
     C***********************************************
ERT  C                   Z-ADD     ADAVD         ZEAVD
ERT  C                   Z-ADD     ADOPD         ZEOPD
ERT  C                   MOVE      ADUNR         ZEUNR
     C                   Z-ADD     ADOPD         UEOPD
     C                   MOVEL     ADPOS         DEPOS
     C*                    MOVE ADUNR     DEUNR
     C                   ADD       ADVKT         DEVKT
     C                   ADD       ADM3          DEM3
     C                   MOVE      ADVTXT        DEVTXT
     C                   MOVE      ADFR          DEFR
     C                   MOVEL     *BLANKS       DENAS
     C                   MOVEL     *BLANKS       DENAK
     C                   MOVE      ADAVD         HEAVD
     C                   MOVE      ADOPD         HEOPD
     C     ADPOS         IFNE      '9999'
     C                   ADD       1             SMPOS
     C     HEADKY        CHAIN     HEADF                              65
     C     *IN65         IFEQ      *OFF
     C                   MOVEL     HENAS         DENAS
     C                   MOVEL     HENAK         DENAK
     C                   MOVEL     HENAS         UENASF
     C                   MOVEL     HENAK         UENAKF
     C                   MOVEL     HERFA         UERFA
     C                   Z-ADD     0             UEM3
     C                   MOVEL     '  '          ULMM3
     C     HELM          IFNE      *ZEROS
     C                   Z-ADD     HELM          UEM3
     C                   MOVEL     'LM'          ULMM3
     C                   ENDIF                                                  <HELM
     C     HEM3          IFNE      *ZEROS
     C                   Z-ADD     HEM3          UEM3
     C                   MOVEL     'M3'          ULMM3
     C                   ENDIF                                                  <HEM3
     C                   ENDIF                                                  <*IN65
     C                   ENDIF                                                  <ADPOS
     C     ADPOS         IFEQ      '9999'
     C                   MOVE      *ON           *IN44
     C                   MOVEL     ADTXT         DETXT
     C                   ELSE
     C                   MOVE      *OFF          *IN44
     C                   ENDIF                                                  <ADPOS
     C                   MOVEL     ADTXT         DETXT
     C                   ADD       ADAINT        DEAINT
     C                   ADD       ADAUTG        DEAUTG
     C                   ADD       ADEINT        DEEINT
     C                   ADD       ADEUTG        DEEUTG
     C                   ADD       ADAINT        SMAINT
     C                   ADD       ADAUTG        SMAUTG
     C                   ADD       ADEINT        SMEINT
     C                   ADD       ADEUTG        SMEUTG
     C                   ENDSR
     C*
     C***********************************************
     C     NETTOD        BEGSR
     C***********************************************
     C* AGENTNETTO
     C     DEAINT        SUB       DEAUTG        NEDIFF           13 2
     C     NEDIFF        IFLT      *ZERO
     C     NEDIFF        MULT      -1            NEAUTG
     C                   MOVE      *ZEROS        NEAINT
     C                   ELSE
     C                   MOVE      *ZEROS        NEAUTG
     C                   MOVE      NEDIFF        NEAINT
     C                   ENDIF                                                  <NEDIFF
     C* EGEN NETTO
     C     DEEINT        SUB       DEEUTG        NEDIFF           13 2
     C     NEDIFF        IFLT      *ZERO
     C     NEDIFF        MULT      -1            NEEUTG
     C                   MOVE      *ZEROS        NEEINT
     C                   ELSE
     C                   MOVE      *ZEROS        NEEUTG
     C                   MOVE      NEDIFF        NEEINT
     C                   ENDIF                                                  <NEDIFF
     C                   ENDSR
     C*
     C***********************************************
     C     NETTOS        BEGSR
     C***********************************************
     C* AGENTNETTO
     C     SMAINT        SUB       SMAUTG        NMDIFF           13 2
     C     NMDIFF        IFLT      *ZERO
     C     NMDIFF        MULT      -1            NMAUTG
     C                   MOVE      *ZEROS        NMAINT
     C                   ELSE
     C                   MOVE      *ZEROS        NMAUTG
     C                   MOVE      NMDIFF        NMAINT
     C                   ENDIF                                                  <NMDIFF
     C* EGEN NETTO
     C     SMEINT        SUB       SMEUTG        NMDIFF           13 2
     C     NMDIFF        IFLT      *ZERO
     C     NMDIFF        MULT      -1            NMEUTG
     C                   MOVE      *ZEROS        NMEINT
     C                   ELSE
     C                   MOVE      *ZEROS        NMEUTG
     C                   MOVE      NMDIFF        NMEINT
     C                   ENDIF                                                  <NMDIFF
     C                   ENDSR
     C*
     C***********************************************
     C     BSALDO        BEGSR
     C***********************************************
     C*
     C*  BEREGNER SALDO OG OMREGNET TIL KURS
     C*
     C     AHVALE        IFNE      'NOK'
     C                   Z-ADD     AHKURE        KSKURS
     C                   MOVE      AHVALE        ZVALKO
     C                   ELSE
     C                   Z-ADD     AHKURA        KSKURS
     C                   MOVE      AHVALA        ZVALKO
     C                   END                                                    <W2VALE
     C* HENT VALUTAKURS - AGENT
ERT  C                   MOVE      AHVALS        WVALA
ERT  C                   MOVE      AHVALS        WVALF
     C     VALKEY        CHAIN     VALUAL01                           34
     C     *IN34         IFEQ      *ON
     C                   MOVE      100           OMRFAK
     C                   ENDIF                                                  <*IN34
      * AGENT RESULTAT
     C     SMAINT        SUB       SMAUTG        SLADIF           13 2
     C     AHVALA        IFEQ      AHVALS
     C     SLADIF        MULT      1             KSBELA
     C                   ELSE
      * AGENT VALUTA = 'NOK'
     C     AHVALA        IFEQ      'NOK'
     C                   Z-ADD     AHKURA        KSKURS
     C     SLADIF        MULT      OMRFAK        KSBELA
     C     KSBELA        DIV       KSKURS        KSBELA
     C                   ELSE
      * AGENT VALUTA  IKKE = 'NOK'
     C                   Z-ADD     AHKURA        KSKURS
     C     SLADIF        MULT      KSKURS        KSBELA
     C     KSBELA        DIV       OMRFAK        KSBELA
     C                   ENDIF                                                  <AHVALA
     C                   ENDIF                                                  <AHVALA
     C     SLADIF        IFGT      *ZERO
     C                   Z-ADD     SLADIF        SLAINT
     C                   Z-ADD     0             SLAUTG
     C                   Z-ADD     KSBELA        KSAINT
     C                   Z-ADD     0             KSAUTG
     C                   MOVEA     '10'          *IN(51)
     C                   ELSE
     C*          KSBELA    MULT -1        KSBELA
     C                   Z-ADD     0             SLAINT
     C                   Z-ADD     SLADIF        SLAUTG
     C                   Z-ADD     0             KSAINT
     C                   Z-ADD     KSBELA        KSAUTG
     C                   MOVEA     '01'          *IN(51)
     C                   ENDIF                                                  <SLADIF
      * EGET RESULTAT
     C     SMEINT        SUB       SMEUTG        SLEDIF           13 2
     C     AHVALE        IFEQ      AHVALS
     C     SLEDIF        MULT      1             KSBELE
     C                   ELSE
      * EGEN VALUTA = 'NOK'
     C     AHVALE        IFEQ      'NOK'
     C     SLEDIF        MULT      OMRFAK        KSBELE
     C     KSBELE        DIV       KSKURS        KSBELE
     C                   ELSE
      * EGEN VALUTA IKKE = 'NOK'
     C     SLEDIF        MULT      KSKURS        KSBELE
     C     KSBELE        DIV       OMRFAK        KSBELE
     C                   ENDIF                                                  <AHVALE
     C                   ENDIF                                                  <AHVALE
     C     SLEDIF        IFGT      *ZERO
     C                   Z-ADD     SLEDIF        SLEINT
     C                   Z-ADD     0             SLEUTG
     C                   Z-ADD     KSBELE        KSEINT
     C                   Z-ADD     0             KSEUTG
     C                   MOVEA     '10'          *IN(53)
     C                   ELSE
     C*          KSBELE    MULT -1        KSBELE
     C                   Z-ADD     0             SLEINT
     C                   Z-ADD     SLEDIF        SLEUTG
     C                   Z-ADD     0             KSEINT
     C                   Z-ADD     KSBELE        KSEUTG
     C                   MOVEA     '01'          *IN(53)
     C                   ENDIF                                                  <SLEDIF
     C                   ENDSR
     C*
     C***********************************************
     C     BGEV          BEGSR
     C***********************************************
     C     AHTYPE        IFNE      'P'
     C                   Z-ADD     KSAINT        GTDIFF           13 2
     C                   ADD       KSAUTG        GTDIFF
     C                   ADD       KSEINT        GTDIFF
     C                   ADD       KSEUTG        GTDIFF
     C                   ELSE
     C     SMEINT        SUB       SM9999        GTDIFF
     C                   ENDIF                                                  <AHTYPE
     C     GTDIFF        IFGT      *ZERO
     C                   MOVE      *OFF          *IN50
     C                   ELSE
     C                   MOVE      *ON           *IN50
     C                   END                                                    <GTDIFF
     C                   Z-ADD     GTDIFF        GTBEL1
     C                   ENDSR
     C*
     C***********************************************
     C     BGEVP         BEGSR
     C***********************************************
     C                   Z-ADD     S2AUTG        S2ADIF           13 2
     C                   Z-ADD     S2EUTG        S2EDIF           13 2
     C     S2ADIF        ADD       S2EDIF        S2DIFF           13 2
     C*
     C     S1AINT        ADD       S1EINT        S1SUM            13 2
     C     S1SUM         SUB       S2DIFF        GTDIFF
     C     GTDIFF        IFGT      *ZERO
     C                   MOVE      *OFF          *IN50
     C                   ELSE
     C                   MOVE      *ON           *IN50
     C                   ENDIF                                                  <GTDIFF
     C                   Z-ADD     GTDIFF        GTBEL1
     C                   ENDSR
     C*
     C***********************************************
     C     BDEL          BEGSR
     C***********************************************
     C                   Z-ADD     AHDEL         PAPRO1
     C                   Z-ADD     AHDEL         PAPRO2
ERT  C     GTDIFF        MULT      AHDEL         PADEL            15 2
     C     PADEL         DIV       100           PADEL
     C                   MVR                     WREST             2 0868785
     C                   Z-ADD     PADEL         PABEL1
     C                   ENDSR
     C*
     C***********************************************
     C     BRES          BEGSR
     C***********************************************
     C     AHTYPE        IFNE      'P'
ERT  C     PADEL         SUB       KSBELA        RSDIFF           13 2
     C                   ELSE
     C     PADEL         SUB       SMEUTG        RSDIFF
     C     RSDIFF        ADD       SM9999        RSDIFF
     C                   ENDIF                                                  <AHTYPE
     C* ALTERNATIV
     C     *IN42         IFEQ      *ON
     C     SMEUTG        MULT      -1            RSDIFF
     C                   ENDIF                                                  <*IN42
ERT  C     RSDIFF        IFGT      0
     C                   Z-ADD     RSDIFF        RSBEL
     C                   MOVEA     '10'          *IN(55)
     C                   ELSE
ERT  C     RSDIFF        MULT      -1            RSBEL
     C                   MOVEA     '01'          *IN(55)
     C                   ENDIF                                                  <GTDIFF
     C                   ENDSR
     C*
     C***********************************************
     C     BRESP         BEGSR
     C***********************************************
     C                   Z-ADD     S1EUTG        RSDIFF
     C     RSDIFF        SUB       S1AUTG        RSDIFF
     C     RSDIFF        SUB       H1EINT        RSDIFF
     C     RSDIFF        ADD       H1AINT        RSDIFF
     C     RSDIFF        ADD       H2EDIF        RSDIFF
     C     RSDIFF        SUB       H2ADIF        RSDIFF
     C*
     C     RSDIFF        IFGT      0
     C                   Z-ADD     RSDIFF        RSBEL
     C                   MOVEA     '01'          *IN(55)
     C                   ELSE
     C     RSDIFF        MULT      -1            RSBEL
     C                   MOVEA     '10'          *IN(55)
     C                   ENDIF                                                  <GTDIFF
     C                   ENDSR
     C***********************************************
     C     HNAVN         BEGSR
     C***********************************************
     C*
     C* SJEKK OM NETTO SKAL SKRIVES
     C                   MOVE      *OFF          *IN41
     C                   MOVE      *OFF          *IN42
     C                   MOVE      *OFF          *IN43
     C                   MOVE      AHKNA         ZKUNDN
     C     ANDELK        CHAIN     AMANDEL                            35
     C     *IN35         IFEQ      *OFF
      *
      * MAX LINJE LIGGENDE STÅENDE
      *
     C     AASPES        IFEQ      'S'
     C                   Z-ADD     45            MAXLIN            2 0
     C                   ELSE
     C                   Z-ADD     25            MAXLIN            2 0
     C                   END
     C* BRUTTO   AANETT = BLANK
     C*
     C* NETTO
     C     AANETT        IFEQ      'N'
     C                   MOVE      *ON           *IN43
     C                   ENDIF                                                  <AANETT
     C* ALTERNATIV
     C     AANETT        IFEQ      'A'
     C                   MOVE      *ON           *IN42
     C                   ENDIF                                                  <AANETT
     C* PERIODEAVREGNING
     C     AANETT        IFEQ      'P'
     C                   MOVE      *ON           *IN41
     C                   MOVE      *ON           *IN42
     C                   ENDIF                                                  <AANETT
     C                   ENDIF                                                  <*IN35
     C* HENT AGENTNAVN
     C                   MOVE      FIFIRM        ZFIRMA
     C                   MOVE      AHKNA         ZKUNDN
     C* SETT DEFAULT SPRÅK TIL ENGELSK
     C                   MOVEA     '01'          *IN(81)
     C     KUNKEY        CHAIN     CUNDL01                            35
     C* SETT RIKTIG SPRÅK INDIKATOR
     C     *IN35         IFEQ      *OFF
     C     SPRAAK        IFEQ      'T'
     C                   MOVEA     '10'          *IN(81)
     C                   ENDIF                                                  <SPRAAK
     C     SPRAAK        IFEQ      'E'
     C                   MOVEA     '01'          *IN(81)
     C                   ENDIF                                                  <SPRAAK
     C                   MOVE      KNAVN         HENAVN
     C                   MOVE      SYLAND        HELAND
     C                   MOVE      SYPOGE        HEPONR
     C                   MOVE      ADR3          HESTED
     C                   ELSE
     C                   MOVEA     '01'          *IN(81)
     C                   CLEAR                   HENAVN
     C                   ENDIF                                                  <*IN35
     C                   EXSR      MOVHE
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD1                                66
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     HEAD1                                66
     C                   WRITE     STREK                                66
     C                   END
     C     *IN42         IFEQ      *OFF
     C     AASPES        IFEQ      'S'
     C                   WRITE     XEAD2A                               66
     C                   ELSE
     C                   WRITE     HEAD2A                               66
     C                   END
     C                   ENDIF                                                  <*IN42
     C     AASPES        IFEQ      'S'
     C                   WRITE     XTREK                                66
     C                   ELSE
     C                   WRITE     STREK                                66
     C                   END
     C                   ENDSR
     C***********************************************
     C     S9999         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        SM9999           13 2
     C* TR.KOSTN
     C     AHTRKP        IFEQ      'A'
     C                   SUB       AHTRKO        SM9999
     C                   ELSE
     C                   ADD       AHTRKO        SM9999
     C                   ENDIF                                                  <AHTRKP
     C* FERJE
     C     AHFERP        IFEQ      'A'
     C                   SUB       AHFERJ        SM9999
     C                   ELSE
     C                   ADD       AHFERJ        SM9999
     C                   ENDIF                                                  <AHFERP
     C* TREKKING
     C     AHTREP        IFEQ      'A'
     C                   SUB       AHTREK        SM9999
     C                   ELSE
     C                   ADD       AHTREK        SM9999
     C                   ENDIF                                                  <AHTREP
     C* DIVERSE
     C     AHDIVP        IFEQ      'A'
     C                   SUB       AHDIV         SM9999
     C                   ELSE
     C                   ADD       AHDIV         SM9999
     C                   ENDIF                                                  <AHDIVP
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    OMRFAK        WXFAK
     C                   Z-ADD     0             ANTDET            2 0
ERT  C     KODGEK        KLIST
ERT  C                   KFLD                    YGEUNI
ERT  C                   KFLD                    AGVK
ERT  C     KODG2K        KLIST
ERT  C                   KFLD                    YG2UNI
ERT  C                   KFLD                    AGVK
ERT  C                   MOVE      'GE'          YGEUNI            2
ERT  C                   MOVE      'G2'          YG2UNI            2
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL VALUAL01
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    VALKOD        ZVALKO
     C     VALKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    ZVALKO
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL CUNDL01
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     *LIKE         DEFINE    KUNDNR        ZKUNDN
     C     KUNKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    ZKUNDN
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL AMHE
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    AHTUNR        ZTUNR
     C     *LIKE         DEFINE    AHKNA         ZKNA
     C     AMHEKY        KLIST
     C                   KFLD                    ZTUNR
     C                   KFLD                    ZKNA
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL AMDE
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    ADPOS         ZPOS
     C     *LIKE         DEFINE    ADUNR         ZUNR
     C     AMDEKY        KLIST
     C                   KFLD                    ZTUNR
     C                   KFLD                    ZKNA
     C                   KFLD                    ZPOS
     C                   KFLD                    ZUNR
ERT  C*--------------------------------------------------------------
ERT  C* DEFINERER NØKKEL TIL AMGE
ERT  C*--------------------------------------------------------------
ERT  C     *LIKE         DEFINE    AGAVD         ZEAVD
ERT  C     *LIKE         DEFINE    AGOPD         ZEOPD
ERT  C     *LIKE         DEFINE    AGUNR         ZEUNR
ERT  C     AMGEKY        KLIST
ERT  C                   KFLD                    ZTUNR
ERT  C                   KFLD                    ZKNA
ERT  C                   KFLD                    ZPOS
ERT  C                   KFLD                    ZEUNR
ERT  C                   KFLD                    ZEAVD
ERT  C                   KFLD                    ZEOPD
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL AMANDEL
     C*--------------------------------------------------------------
     C     ANDELK        KLIST
     C                   KFLD                    ZKUNDN
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL HEADF
     C*--------------------------------------------------------------
     C     HEADKY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C*--------------------------------------------------------------
     C                   Z-ADD     0             IX                2 0
     C*
     C                   READ      FIRM                                   33
     C     UFRA          IFEQ      'P'
     C                   CLEAR                   WT
     C                   Z-ADD     UTURNR        WT(1)
     C                   Z-ADD     UKNA          ZKNA
     C                   ENDIF                                                  <UFRA
     C     UTI           ENDSR
     C***********************************************
     C     INICLR        BEGSR
     C                   MOVE      *IN30         WIN30             1
     C                   CLEAR                   *IN
     C                   MOVE      WIN30         *IN30
     C                   CLEAR                   ZPOS
     C                   CLEAR                   ZUNR
     C                   CLEAR                   DEAINT
     C                   CLEAR                   DEAUTG
     C                   CLEAR                   DEEINT
     C                   CLEAR                   DEEUTG
     C                   CLEAR                   SMAINT
     C                   CLEAR                   SMAUTG
     C                   CLEAR                   SMEINT
     C                   CLEAR                   SMEUTG
     C                   CLEAR                   S1AINT
     C                   CLEAR                   S1AUTG
     C                   CLEAR                   S1EINT
     C                   CLEAR                   S1EUTG
     C                   CLEAR                   S2AINT
     C                   CLEAR                   S2AUTG
     C                   CLEAR                   S2EINT
     C                   CLEAR                   S2EUTG
     C                   CLEAR                   SLAINT
     C                   CLEAR                   SLAUTG
     C                   CLEAR                   SLEINT
     C                   CLEAR                   SLEUTG
     C                   CLEAR                   KSAINT
     C                   CLEAR                   KSAUTG
     C                   CLEAR                   GTBEL1
     C                   CLEAR                   PABEL1
     C                   CLEAR                   RSBEL
     C                   CLEAR                   RSBEL1
     C                   CLEAR                   RSBEL2
     C                   CLEAR                   SMPOS
     C                   CLEAR                   SMVKT
     C                   CLEAR                   SMFBV
     C     INIEND        ENDSR
     C***********************************************
