      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAGSTYPE FRA-TIL      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-86 95-97    ***
      ***********************************************************
      *
     FAMANDEL   UF A E           K DISK
     FAMGEBYR   UF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     F                                     RENAME(KUNDR:CUNDR)
     FKUNDL01   IF   E           K DISK
     FSYAM03FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSTST                  1      8
     D  WSKNA                  1      8  0
     D                 DS
     D  SFTST                  1      8
     D  SFKNA                  1      8  0
     D                 DS
     D  DSNVN                  1     30
     D  DSNVN1                 1     10
     D  DSNVN2                11     11
     D  DSNVN3                12     30
     IKUNDR
     I              SFAKT                       SFAKTK
     ICUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   CLEAR                   SFKNA
     C                   CLEAR                   SFNVN
      *_____________
      * Fyll
      *"""""""""""""
     C     SFKEY         SETLL     AMANDEL
     C     START1        TAG
     C                   READ      AMANDEL                                94
     C  N94              MOVE      AAKNA         SFKNA
     C  N94              MOVE      AADEL         SFDEL
     C  N94              MOVE      AAVAL         SFVAL
     C  N94              MOVE      AAVALA        SFVALA
     C  N94              Z-ADD     AAKURA        SFKURA
     C  N94              MOVE      AAVALE        SFVALE
     C  N94              Z-ADD     AAKURE        SFKURE
     C  N94              MOVE      AATYPE        SFTYPE
     C  N94              MOVE      AAUTV         SFUTV
     C  N94              MOVE      AALIMT        SFLIMT
     C  N94              MOVE      AANETT        SFNETT
     C  N94              MOVE      AASPES        SFSPES
     C  N94              MOVE      AALOSS        SFLOSS
     C  N94              MOVE      AALKG         SFLKG
     C  N94              MOVE      AAKKG         SFKKG
     C  N94              MOVE      AAKNA         ZKNA
     C  N94KUNKEY        CHAIN     CUNDL01                            95
     C  N94
     CANN95              CLEAR                   DSNVN
     C  N94
     CANN95              MOVEL     KNAVN         DSNVN1
     C  N94
     CANN95              MOVEL     '/'           DSNVN2
     C  N94
     CANN95              MOVEL     ADR3          DSNVN3
     C  N94
     CANN95              MOVEL     DSNVN         SFNVN
     C  N94
     CANN95              MOVE      SYLAND        SFLAND
     C  N94
     CAN 95              MOVE      *BLANKS       SFNVN
     C  N94
     CAN 95              MOVE      *BLANKS       SFLAND
     C  N94KUNKEY        CHAIN     KUNDL01                            95
     C  N94
     CANN95              MOVE      KGRENS        SFGREN
     C  N94
     CAN 95              MOVE      *ZEROS        SFGREN
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      AMANDEL                                94
     C  N94              MOVE      AAKNA         SFKNA
     C  N94              MOVE      AADEL         SFDEL
     C  N94              MOVE      AAAVSL        SFAVSL
     C  N94              MOVE      AAVAL         SFVAL
     C  N94              MOVE      AAVALA        SFVALA
     C  N94              Z-ADD     AAKURA        SFKURA
     C  N94              MOVE      AAVALE        SFVALE
     C  N94              Z-ADD     AAKURE        SFKURE
     C  N94              MOVE      AATYPE        SFTYPE
     C  N94              MOVE      AAUTV         SFUTV
     C  N94              MOVE      AALIMT        SFLIMT
     C  N94              MOVE      AANETT        SFNETT
     C  N94              MOVE      AASPES        SFSPES
     C  N94              MOVE      AALOSS        SFLOSS
     C  N94              MOVE      AALKG         SFLKG
     C  N94              MOVE      AAKKG         SFKKG
     C  N94              MOVE      AAKNA         ZKNA
     C  N94KUNKEY        CHAIN     CUNDL01                            95
     C  N94
     CANN95              CLEAR                   DSNVN
     C  N94
     CANN95              MOVEL     KNAVN         DSNVN1
     C  N94
     CANN95              MOVEL     '/'           DSNVN2
     C  N94
     CANN95              MOVEL     ADR3          DSNVN3
     C  N94
     CANN95              MOVEL     DSNVN         SFNVN
     C  N94
     CANN95              MOVE      SYLAND        SFLAND
     C  N94
     CAN 95              MOVE      *BLANKS       SFNVN
     C  N94
     CAN 95              MOVE      *BLANKS       SFLAND
     C  N94KUNKEY        CHAIN     KUNDL01                            95
     C  N94
     CANN95              MOVE      KGRENS        SFGREN
     C  N94
     CAN 95              MOVE      *ZEROS        SFGREN
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       999830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE
     C   06              DO
     C                   CLEAR                   VARELI
     C                   Z-ADD     21            LINNBR
     C                   Z-ADD     06            POSNBR
     C                   MOVE      *ON           *IN44
     C                   MOVE      *ON           *IN70
     C                   Z-ADD     21            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   GOTO      START5
     C                   END
     C*** FORRIGE
     C*  12                GOTO CHOISE
     C   12              GOTO      SLUTT
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94SFKEY         SETLL     AMANDEL
     C     START4        TAG
     C  N94              READ      AMANDEL                                94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*                    GOTO START
     C*
     C*** NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C     *IN04         IFEQ      *ON
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    UKUNDN            8 0
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
     C                   MOVE      UKUNDN        WSKNA
     C                   MOVE      UKUNDN        ZKNA
     C     KUNKEY        CHAIN     CUNDL01                            95
     C  N95              CLEAR                   DSNVN
     C  N95              MOVEL     KNAVN         DSNVN1
     C  N95              MOVEL     '/'           DSNVN2
     C  N95              MOVEL     ADR3          DSNVN3
     C  N95              MOVEL     DSNVN         WSNVN
     C   95              MOVE      *BLANKS       WSNVN
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   END                                                    <ZRECNO
     C                   END                                                    <*IN04
     C*
     C                   MOVEA     '00000'       *IN(86)
     C                   SETOFF                                           30
     C   12              EXSR      MOVBWS
     C     *IN12         IFEQ      *OFF
     C     *IN70         ANDEQ     *ON
     C     WSUTV         ANDEQ     'J'
     C                   MOVE      *OFF          *IN70
     C                   GOTO      START5
     C                   ENDIF                                                  <*IN12
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*          N40 = NY
     C*           40 = ENDRING
     C*
     C                   MOVE      WSKNA         ZKNA
     C     KUNKEY        CHAIN     CUNDL01                            35
     C     *IN35         IFEQ      '1'
     C                   MOVE      '1'           *IN30
     C                   MOVE      'DIV2480'     MSGNR
     C                   GOTO      SLTB
     C                   END                                                    <*IN35
     C*
     C  N40WSKEY         CHAIN     AMANDEL                            33
     C*
     C*  TEST OM KUNDE FINNES FRA FØR VED ENDRING
     C*
     C     *IN40         IFEQ      '1'
     C     WSTST         IFNE      SFTST
     C     WSKEY         CHAIN     AMANDEL                            33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'DIV2492'     MSGNR
     C                   Z-ADD     06            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C                   END                                                    <WSTST
     C                   END                                                    <*IN40
     C*
     C   40SFKEY         CHAIN     AMANDEL                            33
     C*
     C*  TEST OM KUNDE FINNES FRA FØR VED NYREGISTRERING
     C*
     C     *IN33         IFEQ      '0'
     C     *IN40         ANDEQ     '0'
     C                   MOVE      'DIV2492'     MSGNR
     C                   Z-ADD     06            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C*
     C                   EXSR      MOVWKA
     C  N33              UPDATE    AMANDELR                             38
     C   33              WRITE     AMANDELR
     C*
     C                   MOVE      AAKNA         ZKNA
     C                   MOVE      AAAVSL        SFAVSL
     C     KUNKEY        CHAIN     CUNDL01                            95
     C  N95              CLEAR                   DSNVN
     C  N95              MOVEL     KNAVN         DSNVN1
     C  N95              MOVEL     '/'           DSNVN2
     C  N95              MOVEL     ADR3          DSNVN3
     C  N95              MOVEL     DSNVN         WSNVN
     C  N95              MOVE      SYLAND        SFLAND
     C   95              MOVE      *BLANKS       WSNVN
     C   95              MOVE      *BLANKS       SFLAND
     C     KUNKEY        CHAIN     KUNDL01                            95
     C  N95              MOVE      KGRENS        SFGREN
     C   95              MOVE      *ZEROS        SFGREN
     C                   EXSR      MOVWSF
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   EXSR      MOVBWS
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              MOVE      '1'           *IN30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              4 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      *OFF          *IN44
     C                   MOVE      ' '           WSNR
     C     SFNVN         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30                    30
     C   98              GOTO      SLHENT
     C                   EXSR      CHGST
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     SFNVN         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30
     C   98              GOTO      SLHENT
     C                   EXSR      DLTST
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '5'
     C                   MOVE      ' '           WSNR
     C                   MOVE      'I'           SFIMEX            1
     C     SFNVN         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30
     C   98              GOTO      SLHENT
     C     SFUTV         IFNE      'J'
     C                   MOVE      'TRO0463'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   ENDIF                                                  <SFUTV
     C                   CALL      'SYAM04'
     C                   PARM      SFKNA         SFKNA
     C                   PARM      SFIMEX        SFIMEX
     C                   UPDATE    SUBFIL
     C                   GOTO      SLHENT
     C                   END                                                    <WSNR
     C     WSNR          IFEQ      '6'
     C                   MOVE      ' '           WSNR
     C                   MOVE      'E'           SFIMEX
     C     SFNVN         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30
     C   98              GOTO      SLHENT
     C     SFUTV         IFNE      'J'
     C                   MOVE      'TRO0463'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   ENDIF                                                  <SFUTV
     C                   CALL      'SYAM04'
     C                   PARM      SFKNA         SFKNA
     C                   PARM      SFIMEX        SFIMEX
     C                   UPDATE    SUBFIL
     C                   GOTO      SLHENT
     C                   END                                                    <WSNR
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   MOVE      *ON           *IN44
     C                   ENDSR
     C*
     C***********************************************
     C     DLTST         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   EXFMT     VAREL3
     C  N12              DO
     C     SFKEY         CHAIN     AMANDEL                            33
     C     *IN33         IFEQ      *OFF
     C                   DELETE    AMANDEL
     C*******************
     C                   MOVE      'E'           SFIMEX            1
     C     SFKEYE        SETLL     AMGEBYR
     C     DLTST1        TAG
     C     SFKEYE        READE     AMGEBYR                                34
     C     *IN34         IFEQ      *OFF
     C                   DELETE    AMGEBYRR
     C                   GOTO      DLTST1
     C                   ENDIF                                                  <*IN34
     C*
     C                   MOVE      *OFF          *IN34
     C                   MOVE      'I'           SFIMEX            1
     C     SFKEYE        SETLL     AMGEBYR
     C     DLTST2        TAG
     C     SFKEYE        READE     AMGEBYR                                34
     C     *IN34         IFEQ      *OFF
     C                   DELETE    AMGEBYRR
     C                   GOTO      DLTST2
     C                   ENDIF                                                  <*IN34
     C                   ENDIF                                                  <*IN33
     C*
     C********************
     C                   EXSR      MOVBSF
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGST         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   MOVE      '1'           *IN99
     C     STCHG         TAG
     C                   SUB       1             LINNBR
     C     STCHG2        TAG
     C                   MOVE      WSUTV         XXUTV             1
     C                   EXFMT     VARELI
     C                   MOVEA     '0000'        *IN(87)
     C                   SETOFF                                       30
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVBWS
     C                   END
     C     *IN12         IFEQ      *OFF
     C     *IN70         ANDEQ     *ON
     C     WSUTV         ANDEQ     'J'
     C     XXUTV         ANDNE     'J'
     C                   MOVE      *OFF          *IN70
     C                   Z-ADD     21            LINNBR
     C                   Z-ADD     69            POSNBR
     C                   GOTO      STCHG2
     C                   ENDIF                                                  <*IN12
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      SFKNA         WSKNA
     C                   MOVEL     SFNVN         WSNVN
     C                   MOVE      SFDEL         WSDEL
     C                   MOVE      SFVAL         WSVAL
     C                   MOVE      SFVALA        WSVALA
     C                   MOVE      SFKURA        WSKURA
     C                   MOVE      SFVALE        WSVALE
     C                   MOVE      SFKURE        WSKURE
     C                   MOVE      SFTYPE        WSTYPE
     C                   MOVE      SFUTV         WSUTV
     C                   MOVE      *ON           *IN70
     C     SFUTV         IFEQ      'J'
     C                   MOVE      *OFF          *IN70
     C                   ENDIF                                                  <SFUTV
     C                   MOVE      SFNETT        WSNETT
     C                   MOVE      SFSPES        WSSPES
     C                   MOVE      SFLOSS        WSLOSS
     C                   MOVE      SFLKG         WSLKG
     C                   MOVE      SFKKG         WSKKG
     C                   MOVE      '1'           *IN40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     41            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWKA        BEGSR
     C***********************************************
     C*                    MOVE W1KNR     AAKNR
     C                   MOVE      WSKNA         AAKNA
     C                   MOVE      WSDEL         AADEL
     C                   MOVE      WSVAL         AAVAL
     C                   MOVE      WSVALA        AAVALA
     C                   MOVE      WSKURA        AAKURA
     C                   MOVE      WSVALE        AAVALE
     C                   MOVE      WSKURE        AAKURE
     C                   MOVE      WSTYPE        AATYPE
     C                   MOVE      WSUTV         AAUTV
     C*                    MOVE WSLIMT    AALIMT
     C                   MOVE      WSNETT        AANETT
     C                   MOVE      WSSPES        AASPES
     C                   MOVE      WSLOSS        AALOSS
     C                   MOVE      WSLKG         AALKG
     C                   MOVE      WSKKG         AAKKG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C                   MOVE      WSKNA         SFKNA
     C                   MOVEL     WSNVN         SFNVN
     C                   MOVE      WSDEL         SFDEL
     C                   MOVE      WSVAL         SFVAL
     C                   MOVE      WSVALA        SFVALA
     C                   MOVE      WSKURA        SFKURA
     C                   MOVE      WSVALE        SFVALE
     C                   MOVE      WSKURE        SFKURE
     C                   MOVE      WSTYPE        SFTYPE
     C                   MOVE      WSUTV         SFUTV
     C                   MOVE      WSNETT        SFNETT
     C                   MOVE      WSSPES        SFSPES
     C                   MOVE      WSLOSS        SFLOSS
     C                   MOVE      WSLKG         SFLKG
     C                   MOVE      WSKKG         SFKKG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBSF        BEGSR
     C***********************************************
     C                   CLEAR                   SFKNA
     C                   CLEAR                   SFNVN
     C                   MOVEL     '*DELETE*'    SFNVN
     C                   CLEAR                   SFDEL
     C                   CLEAR                   SFVAL
     C                   CLEAR                   SFVALA
     C                   CLEAR                   SFVALE
     C                   CLEAR                   SFTYPE
     C                   CLEAR                   SFUTV
     C                   CLEAR                   SFLIMT
     C                   CLEAR                   SFNETT
     C                   CLEAR                   SFSPES
     C                   CLEAR                   SFLOSS
     C                   CLEAR                   SFLKG
     C                   CLEAR                   SFKKG
     C                   CLEAR                   SFAVSL
     C                   CLEAR                   SFLAND
     C                   CLEAR                   SFGREN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBWS        BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSKNA
     C                   MOVE      *BLANKS       WSNVN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SFKEYE        KLIST
     C                   KFLD                    SFKNA
     C                   KFLD                    SFIMEX
     C*
     C     AMDTKY        KLIST
     C                   KFLD                    AAKNA
     C*
     C     SFKEY         KLIST
     C                   KFLD                    SFKNA
     C*
     C     WSKEY         KLIST
     C                   KFLD                    WSKNA
     C*
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     *LIKE         DEFINE    KUNDNR        ZKNA
     C     KUNKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    ZKNA
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        ZFIRMA
     C*
     C                   ENDSR
     C*
