     FHEAD14    IF   E           K DISK
     FSYAM80FM  CF   E             WORKSTN
     C*
     C     TURK          KLIST
     C                   KFLD                    TURNRW            8 0
     C                   Z-ADD     3             UFLAGG
     C     START         TAG
     C*
     C                   EXFMT     BILDE01
     C   03              GOTO      SLUTT
     C                   Z-ADD     TURNR         TURNRW
     C     TURNR         IFEQ      0
     C                   GOTO      START
     C                   END
     C*
     C*
     C     TURK          SETLL     HEAD14
     C     *IN33         DOWEQ     '0'
     C     TURK          READE     HEAD14                                 33
     C     *IN33         IFEQ      '0'
     C                   ADD       1             ANTALL
     C                   MOVE      'NY'          XNYGML
     C                   MOVE      '01'          FIFIRM
     C                   CALL      'SYAM10X'
     C                   PARM                    FIFIRM            2
     C                   PARM                    HEAVD             4 0
     C                   PARM                    HEOPD             7 0
     C                   PARM                    XNYGML            2
     C                   PARM                    KO2UTL            1
     C                   PARM                    XKUTL             4 2
     C                   PARM                    XSUTL             4 2
     C                   PARM                    XKUMIN            2 0
     C                   PARM                    XSUMIN            2 0
     C                   PARM                    KO2MVK            1
     C                   PARM                    KO2MVS            1
     C                   PARM                    UKFRA             7 0
     C                   PARM                    KOVAVR            1
     C                   PARM                    WSMSG            62
     C                   PARM                    WSMELD            1
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    UKODE             1
     C                   PARM                    USECUR            6
     C                   END
     C                   END
     C                   GOTO      START
     C*
     C*
     C     SLUTT         TAG
     C*
     C                   SETON                                        LR
     C                   RETURN
