      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAGSTYPE FRA-TIL      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-86 95-97    ***
      ***********************************************************
      *
     FAMGEBYR   UF A E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTGE    IF   E           K DISK
     FKODTFR    IF   E           K DISK
     FSYAM04FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSTST                  1      8
     D  WSKNA                  1      8  0
     D                 DS
     D  SFTST                  1      8
     D  SFKNA                  1      8  0
     D                 DS
     D  DSNVN                  1     30
     D  DSNVN1                 1     10
     D  DSNVN2                11     11
     D  DSNVN3                12     30
     C*
     C     *ENTRY        PLIST
     C                   PARM      UKNA          UKNA              8
     C                   PARM      UIMEX         UIMEX             1
     C                   EXSR      INIT
     C                   MOVE      UKNA          SFKNA
     C                   MOVE      UKNA          WSKNA
     C                   MOVE      UKNA          ZKNA
     C                   MOVE      UIMEX         SFIMEX            1
     C                   MOVE      UIMEX         WSIMEX            1
     C     SFIMEX        IFEQ      'I'
     C                   MOVE      *OFF          *IN75
     C                   ELSE
     C                   MOVE      *ON           *IN75
     C                   ENDIF                                                  <SFIMEX
     C     KUNKEY        CHAIN     CUNDL01                            95
     C  N94
     CANN95              CLEAR                   DSNVN
     C  N94
     CANN95              MOVEL     KNAVN         DSNVN1
     C  N94
     CANN95              MOVEL     '/'           DSNVN2
     C  N94
     CANN95              MOVEL     ADR3          DSNVN3
     C  N94
     CANN95              MOVEL     DSNVN         SFNVN
     C   95              MOVE      *BLANKS       SFNVN
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   CLEAR                   SFVK
     C                   CLEAR                   SFIK
     C                   CLEAR                   SFIKAG
      *_____________
      * Fyll
      *"""""""""""""
     C     SFKEYE        SETLL     AMGEBYR
     C     START1        TAG
     C     SFKEYE        READE     AMGEBYR                                94
     C     *IN94         IFEQ      '0'
     C                   MOVE      AGVK          SFVK
     C                   MOVE      AGIK          SFIK
     C                   MOVE      AGIKAG        SFIKAG
     C                   MOVE      AGFR01        SFFR01
     C                   MOVE      AGFR02        SFFR02
     C                   MOVE      AGFR03        SFFR03
     C                   MOVE      AGFR04        SFFR04
     C                   MOVE      AGFR05        SFFR05
     C                   MOVE      AGFR06        SFFR06
     C                   MOVE      AGFR07        SFFR07
     C                   MOVE      AGFR08        SFFR08
     C                   MOVE      AGFR09        SFFR09
     C                   MOVE      AGFR10        SFFR10
     C                   MOVE      AGFR11        SFFR11
     C                   MOVE      AGFR12        SFFR12
     C                   MOVE      AGFR13        SFFR13
     C                   MOVE      AGFR14        SFFR14
     C                   MOVE      AGFR15        SFFR15
     C                   MOVE      AGFR16        SFFR16
     C                   MOVE      AGFR17        SFFR17
     C                   MOVE      AGFR18        SFFR18
     C                   MOVE      AGFR19        SFFR19
     C                   MOVE      AGFR20        SFFR20
     C                   MOVE      *BLANKS       SFDEL
     C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     SFKEYE        READE     AMGEBYR                                94
     C     *IN94         IFEQ      '0'
     C                   MOVE      AGVK          SFVK
     C                   MOVE      AGIK          SFIK
     C                   MOVE      AGIKAG        SFIKAG
     C                   MOVE      AGFR01        SFFR01
     C                   MOVE      AGFR02        SFFR02
     C                   MOVE      AGFR03        SFFR03
     C                   MOVE      AGFR04        SFFR04
     C                   MOVE      AGFR05        SFFR05
     C                   MOVE      AGFR06        SFFR06
     C                   MOVE      AGFR07        SFFR07
     C                   MOVE      AGFR08        SFFR08
     C                   MOVE      AGFR09        SFFR09
     C                   MOVE      AGFR10        SFFR10
     C                   MOVE      AGFR11        SFFR11
     C                   MOVE      AGFR12        SFFR12
     C                   MOVE      AGFR13        SFFR13
     C                   MOVE      AGFR14        SFFR14
     C                   MOVE      AGFR15        SFFR15
     C                   MOVE      AGFR16        SFFR16
     C                   MOVE      AGFR17        SFFR17
     C                   MOVE      AGFR18        SFFR18
     C                   MOVE      AGFR19        SFFR19
     C                   MOVE      AGFR20        SFFR20
     C                   MOVE      *BLANKS       SFDEL
     C                   END
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       999830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE
     C   06              DO
     C                   CLEAR                   VARELI
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     07            POSNBR
     C                   MOVE      *ON           *IN44
     C                   GOTO      START5
     C                   END
     C*** FORRIGE
     C*  12                GOTO CHOISE
     C   12              GOTO      SLUTT
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94SFKEY         SETLL     AMGEBYR
     C     START4        TAG
     C  N94SFKEYE        READE     AMGEBYR                                94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C     *IN04         IFEQ      *ON
     C                   CALL      'SYFI10D'
     C                   PARM                    WSGEBY            3
     C                   MOVE      WSGEBY        WSVK
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   MOVE      *OFF          *IN44
     C                   END
     C                   GOTO      START5
     C                   END                                                    <*IN04
     C  N12              EXSR      TESTLI
     C     *IN30         IFEQ      '1'
     C                   GOTO      START5
     C                   END                                                    <*IN30
     C*
     C                   MOVEA     '00000'       *IN(86)
     C                   SETOFF                                           30
     C   12              EXSR      MOVBWS
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*          N40 = NY
     C*           40 = ENDRING
     C*
     C  N40WSKEY         CHAIN     AMGEBYR                            33
     C*
     C*  TEST OM KUNDE FINNES FRA FØR VED ENDRING
     C*
     C     *IN40         IFEQ      '1'
     C     WSTST         IFNE      SFTST
     C     WSKEY         CHAIN     AMGEBYR                            33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'TGI0028'     MSGNR
     C                   Z-ADD     07            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C                   END                                                    <WSTST
     C                   END                                                    <*IN40
     C*
     C   40SFKEY         CHAIN     AMGEBYR                            33
     C*
     C*  TEST OM KUNDE FINNES FRA FØR VED NYREGISTRERING
     C*
     C     *IN33         IFEQ      '0'
     C     *IN40         ANDEQ     '0'
     C                   MOVE      'TGI0028'     MSGNR
     C                   Z-ADD     07            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C*
     C                   EXSR      MOVWKA
     C  N33              UPDATE    AMGEBYRR                             38
     C   33              WRITE     AMGEBYRR
     C*
     C                   EXSR      MOVWSF
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   EXSR      MOVBWS
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              MOVE      '1'           *IN30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       7             LINNBR
     C                   MVR                     XLIN              4 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     7             LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      *OFF          *IN44
     C                   MOVE      ' '           WSNR
     C     SFDEL         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30                    30
     C   98              GOTO      SLHENT
     C                   EXSR      CHGST
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     SFDEL         COMP      '*DELETE*'                             98
     C   98              MOVE      'SPS0029'     MSGNR
     C   98              MOVE      '1'           *IN30
     C   98              GOTO      SLHENT
     C                   EXSR      DLTST
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   MOVE      *ON           *IN44
     C                   ENDSR
     C*
     C***********************************************
     C     DLTST         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   EXFMT     VAREL3
     C  N12              DO
     C     SFKEY         CHAIN     AMGEBYR                            33
     C  N33              DELETE    AMGEBYR
     C                   EXSR      MOVBSF
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     7             LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGST         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   MOVE      '1'           *IN99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVBWS
     C                   GOTO      SLCHG
     C                   END
     C                   EXSR      TESTLI
     C     *IN30         IFEQ      '1'
     C                   GOTO      STCHG
     C                   END                                                    <*IN30
     C                   MOVEA     '0000'        *IN(87)
     C                   SETOFF                                       30
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     7             LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C     SLCHG         ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      SFKNA         WSKNA             8 0
     C                   MOVE      SFVK          WSVK
     C                   MOVE      SFIK          WSIK
     C                   MOVE      SFIKAG        WSIKAG
     C                   MOVE      SFFR01        WSFR01
     C                   MOVE      SFFR02        WSFR02
     C                   MOVE      SFFR03        WSFR03
     C                   MOVE      SFFR04        WSFR04
     C                   MOVE      SFFR05        WSFR05
     C                   MOVE      SFFR06        WSFR06
     C                   MOVE      SFFR07        WSFR07
     C                   MOVE      SFFR08        WSFR08
     C                   MOVE      SFFR09        WSFR09
     C                   MOVE      SFFR10        WSFR10
     C                   MOVE      SFFR11        WSFR11
     C                   MOVE      SFFR12        WSFR12
     C                   MOVE      SFFR13        WSFR13
     C                   MOVE      SFFR14        WSFR14
     C                   MOVE      SFFR15        WSFR15
     C                   MOVE      SFFR16        WSFR16
     C                   MOVE      SFFR17        WSFR17
     C                   MOVE      SFFR18        WSFR18
     C                   MOVE      SFFR19        WSFR19
     C                   MOVE      SFFR20        WSFR20
     C                   MOVE      '1'           *IN40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     22            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWKA        BEGSR
     C***********************************************
     C*                    MOVE W1KNR     AGKNR
     C                   MOVE      WSKNA         AGKNA
     C                   MOVE      WSIMEX        AGIMEX
     C                   MOVE      WSVK          AGVK
     C                   MOVE      WSIK          AGIK
     C                   MOVE      WSIKAG        AGIKAG
     C                   MOVE      WSFR01        AGFR01
     C                   MOVE      WSFR02        AGFR02
     C                   MOVE      WSFR03        AGFR03
     C                   MOVE      WSFR04        AGFR04
     C                   MOVE      WSFR05        AGFR05
     C                   MOVE      WSFR06        AGFR06
     C                   MOVE      WSFR07        AGFR07
     C                   MOVE      WSFR08        AGFR08
     C                   MOVE      WSFR09        AGFR09
     C                   MOVE      WSFR10        AGFR10
     C                   MOVE      WSFR11        AGFR11
     C                   MOVE      WSFR12        AGFR12
     C                   MOVE      WSFR13        AGFR13
     C                   MOVE      WSFR14        AGFR14
     C                   MOVE      WSFR15        AGFR15
     C                   MOVE      WSFR16        AGFR16
     C                   MOVE      WSFR17        AGFR17
     C                   MOVE      WSFR18        AGFR18
     C                   MOVE      WSFR19        AGFR19
     C                   MOVE      WSFR20        AGFR20
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C                   MOVE      *BLANK        SFDEL
     C                   MOVE      WSVK          SFVK
     C                   MOVE      WSIK          SFIK
     C                   MOVE      WSIKAG        SFIKAG
     C                   MOVE      WSFR01        SFFR01
     C                   MOVE      WSFR02        SFFR02
     C                   MOVE      WSFR03        SFFR03
     C                   MOVE      WSFR04        SFFR04
     C                   MOVE      WSFR05        SFFR05
     C                   MOVE      WSFR06        SFFR06
     C                   MOVE      WSFR07        SFFR07
     C                   MOVE      WSFR08        SFFR08
     C                   MOVE      WSFR09        SFFR09
     C                   MOVE      WSFR10        SFFR10
     C                   MOVE      WSFR11        SFFR11
     C                   MOVE      WSFR12        SFFR12
     C                   MOVE      WSFR13        SFFR13
     C                   MOVE      WSFR14        SFFR14
     C                   MOVE      WSFR15        SFFR15
     C                   MOVE      WSFR16        SFFR16
     C                   MOVE      WSFR17        SFFR17
     C                   MOVE      WSFR18        SFFR18
     C                   MOVE      WSFR19        SFFR19
     C                   MOVE      WSFR20        SFFR20
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBSF        BEGSR
     C***********************************************
     C                   MOVE      '*DELETE*'    SFDEL
     C                   CLEAR                   SFFR01
     C                   CLEAR                   SFFR02
     C                   CLEAR                   SFFR03
     C                   CLEAR                   SFFR04
     C                   CLEAR                   SFFR05
     C                   CLEAR                   SFFR06
     C                   CLEAR                   SFFR07
     C                   CLEAR                   SFFR08
     C                   CLEAR                   SFFR09
     C                   CLEAR                   SFFR10
     C                   CLEAR                   SFFR11
     C                   CLEAR                   SFFR12
     C                   CLEAR                   SFFR13
     C                   CLEAR                   SFFR14
     C                   CLEAR                   SFFR15
     C                   CLEAR                   SFFR16
     C                   CLEAR                   SFFR17
     C                   CLEAR                   SFFR18
     C                   CLEAR                   SFFR19
     C                   CLEAR                   SFFR20
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBWS        BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTLI        BEGSR
     C***********************************************
     C* GEBYR
     C                   MOVE      '0'           *IN30
     C     KODGEK        CHAIN     KODTGE                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2487'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     07            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C* FRANKATUR
     C     WSFR01        IFNE      *BLANKS
     C                   MOVE      WSFR01        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     22            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR01
     C*
     C     WSFR02        IFNE      *BLANKS
     C                   MOVE      WSFR02        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     27            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR02
     C*
     C     WSFR03        IFNE      *BLANKS
     C                   MOVE      WSFR03        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     32            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR03
     C*
     C     WSFR04        IFNE      *BLANKS
     C                   MOVE      WSFR04        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     37            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR04
     C*
     C     WSFR05        IFNE      *BLANKS
     C                   MOVE      WSFR05        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     42            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR05
     C*
     C     WSFR06        IFNE      *BLANKS
     C                   MOVE      WSFR06        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     47            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR06
     C*
     C     WSFR07        IFNE      *BLANKS
     C                   MOVE      WSFR07        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     52            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR07
     C*
     C     WSFR08        IFNE      *BLANKS
     C                   MOVE      WSFR08        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     57            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR08
     C*
     C     WSFR09        IFNE      *BLANKS
     C                   MOVE      WSFR09        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     62            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR09
     C*
     C     WSFR10        IFNE      *BLANKS
     C                   MOVE      WSFR10        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     67            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR10
     C*
     C     WSFR11        IFNE      *BLANKS
     C                   MOVE      WSFR11        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     22            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR11
     C*
     C     WSFR12        IFNE      *BLANKS
     C                   MOVE      WSFR12        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     27            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR12
     C*
     C     WSFR13        IFNE      *BLANKS
     C                   MOVE      WSFR13        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     32            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR13
     C*
     C     WSFR14        IFNE      *BLANKS
     C                   MOVE      WSFR14        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     37            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR14
     C*
     C     WSFR15        IFNE      *BLANKS
     C                   MOVE      WSFR15        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     42            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR15
     C*
     C     WSFR16        IFNE      *BLANKS
     C                   MOVE      WSFR16        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     47            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR16
     C*
     C     WSFR17        IFNE      *BLANKS
     C                   MOVE      WSFR17        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     52            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR17
     C*
     C     WSFR18        IFNE      *BLANKS
     C                   MOVE      WSFR18        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     57            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR18
     C*
     C     WSFR19        IFNE      *BLANKS
     C                   MOVE      WSFR19        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     62            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR19
     C*
     C     WSFR10        IFNE      *BLANKS
     C                   MOVE      WSFR10        ZFRAN
     C     KODFRK        CHAIN     KODTFR                             36
     C     *IN36         IFNE      '0'
     C                   MOVE      'DIV2482'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     67            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN36
     C                   GOTO      SLTLI
     C                   END                                                    <*IN36
     C                   END                                                    <WSFR10
     C     SLTLI         ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     SFKEYE        KLIST
     C                   KFLD                    SFKNA
     C                   KFLD                    SFIMEX
     C*
     C     SFKEY         KLIST
     C                   KFLD                    SFKNA
     C                   KFLD                    SFIMEX
     C                   KFLD                    SFVK
     C                   KFLD                    SFIK
     C                   KFLD                    SFIKAG
     C*
     C     WSKEY         KLIST
     C                   KFLD                    WSKNA
     C                   KFLD                    WSIMEX
     C                   KFLD                    WSVK
     C                   KFLD                    WSIK
     C                   KFLD                    WSIKAG
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL KODTGE
     C*--------------------------------------------------------------
     C     KODGEK        KLIST
     C                   KFLD                    YGEUNI
     C                   KFLD                    WSVK
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL KODTFR
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    WSFR01        ZFRAN
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    ZFRAN
     C*
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     *LIKE         DEFINE    KUNDNR        ZKNA
     C     KUNKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    ZKNA
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        ZFIRMA
     C                   MOVE      'GE'          YGEUNI            2
     C                   MOVE      'FR'          YFRUNI            2
     C*
     C                   ENDSR
     C*
