      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE SAKSBEHANDLER(SIGNATUR) SAD  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97       ***
      **************************************************************
      *
     FAMWSAML   UF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSYAM27FA  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSNAVN                 1     30
     D  XDLT                   1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSI1        SETLL     AMWSAML
     C     START1        TAG
     C                   READ      AMWSAML                                94
     C  N94              UPDATE    SAMLR
     C  N94              MOVE      SAAVD         YSAVD
     C  N94              MOVE      SAFIRM        YSFIRM
     C  N94              MOVE      SAKN          YSKN
     C  N94              MOVE      SAPRO         YSPRO
     C  N94              MOVE      SAOPD         YSOPD
     C  N94              MOVE      SASK          YSSK
     C  N94              MOVE      SAXXX         YSXXX
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   EXSR      MOFIWS
     C     KUNKEY        CHAIN     CUNDL01                            77
     C                   MOVE      KNAVN         WSNAVN
     C                   WRITE     SUBFIL
     C                   READ      AMWSAML                                94
     C  N94              UPDATE    SAMLR
     C  N94              MOVE      SAAVD         YSAVD
     C  N94              MOVE      SAFIRM        YSFIRM
     C  N94              MOVE      SAKN          YSKN
     C  N94              MOVE      SAPRO         YSPRO
     C  N94              MOVE      SAOPD         YSOPD
     C  N94              MOVE      SASK          YSSK
     C  N94              MOVE      SAXXX         YSXXX
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C   12              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODSI3        SETLL     AMWSAML
     C  N94              READ      AMWSAML                                94
     C  N94              UPDATE    SAMLR
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C   12              MOVE      'Y'           URETUR
     C                   SETON                                        LR
     C                   RETURN
     C*
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSI
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     5             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSI         BEGSR
     C***********************************************
     C                   SETON                                        99
     C  N12              DO
     C     KODSIK        CHAIN     AMWSAML                            33
     C  N33              DELETE    SAMLR
     C                   EXSR      MOBLWS
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     MOBLWS        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSAVD
     C                   MOVE      *BLANKS       WSFIRM
     C                   MOVE      *ZEROS        WSKN
     C                   MOVE      *ZEROS        WSPRO
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *BLANKS       WSSK
     C                   MOVE      *BLANKS       WSXXX
     C                   MOVE      *BLANKS       WSNAVN
     C                   MOVEL     '*DELETE'     WSNAVN
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     MOFIWS        BEGSR
     C***********************************************
     C                   MOVE      SAAVD         WSAVD
     C                   MOVE      SAFIRM        WSFIRM
     C                   MOVE      SAKN          WSKN
     C                   MOVE      SAPRO         WSPRO
     C                   MOVE      SAOPD         WSOPD
     C                   MOVE      SASK          WSSK
     C                   MOVE      SAXXX         WSXXX
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     39            POSNBR
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    URETUR            1
     C                   MOVE      'N'           URETUR
     C     *LIKE         DEFINE    SAAVD         YSAVD
     C     *LIKE         DEFINE    SAFIRM        YSFIRM
     C     *LIKE         DEFINE    SAKN          YSKN
     C     *LIKE         DEFINE    SAPRO         YSPRO
     C     *LIKE         DEFINE    SAOPD         YSOPD
     C     *LIKE         DEFINE    SASK          YSSK
     C     *LIKE         DEFINE    SAXXX         YSXXX
     C     *LIKE         DEFINE    SAFIRM        Y2FIRM
     C     KUNKEY        KLIST
     C                   KFLD                    SAFIRM
     C                   KFLD                    SAKN
     C     KODSIK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSKN
     C                   KFLD                    WSXXX
     C                   KFLD                    WSPRO
     C                   KFLD                    WSOPD
     C                   KFLD                    WSSK
     C     KODSI1        KLIST
     C                   KFLD                    Y2AVD
     C                   KFLD                    Y2FIRM
     C                   KFLD                    Y2KN
     C                   KFLD                    Y2XXX             4
     C                   KFLD                    Y2PRO
     C                   KFLD                    Y2OPD
     C                   KFLD                    Y2SK
     C     KODSI3        KLIST
     C                   KFLD                    YSAVD
     C                   KFLD                    YSFIRM
     C                   KFLD                    YSKN
     C                   KFLD                    YSXXX
     C                   KFLD                    YSPRO
     C                   KFLD                    YSOPD
     C                   KFLD                    YSSK
     C*
     C*
     C                   ENDSR
     C*
