********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 antall fakturaer redusert til 30
********************************************************************
      *
      *
      ***********************************************************
      *** PROGRAM SKAL SKRIVE UT KOPI AV BORDEREAU            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-26                      ***
      *** LEDIGE INDIKATORER 27-29 31 32 35 38 51-56 58-69    ***
      ***                    74-78 80-87 89-99                ***
      ***********************************************************
      *
     FHEADF     IF   E           K DISK
     FFAIN      IF   E           K DISK
     FSYAM22FM  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UDT                   30     35  0
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  WSFN1                101    107  0
     D  WSFN2                108    114  0
     D  WSFN3                115    121  0
     D  WSFN4                122    128  0
     D  WSFN5                129    135  0
     D  WSFN6                136    142  0
     D  WSFN7                143    149  0
     D  WSFN8                150    156  0
     D  WSFN9                157    163  0
     D  WSFN10               164    170  0
     D  WSFN11               171    177  0
     D  WSFN12               178    184  0
     D  WF                   101    310  0
     D                                     DIM(30)
     D  UGN                  981    995
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       30
     C   03              GOTO      SLUTT
     C                   EXSR      TEST
     C   30              GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TEST          BEGSR
     C***********************************************
     C                   Z-ADD     1             XN                2 0
     C*
s01  C*    XN            DOWLE     35
n01  C     XN            DOWLE     30
     C     WF(XN)        IFNE      0
     C                   Z-ADD     WF(XN)        YFN
     C     FAINK         CHAIN     FAIN                               30
     C  N30HEADFK        CHAIN     HEADF                              30
     C  N30HEST          COMP      ' '                                    30
     C   30              MOVE      'SPF0026'     MSGNR
     C   30              GOTO      SLTB
     C                   END
     C                   ADD       1             XN
     C                   END
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    BORD              1
     C     FAINK         KLIST
     C                   KFLD                    YFN
     C     HEADFK        KLIST
     C                   KFLD                    FIAVD
     C                   KFLD                    FIOPD
     C*
     C                   MOVE      *ZEROS        WF
     C                   ENDSR
     C*
