      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE UT      ***
      ***                   AMETASKJEMA                        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-97                             ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FSYAMDKFM  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  KOVFIR                 3      4
     D  KOVPRO                13     13
     D  UAVD                  15     18  0
     D  UAVDA                 15     18
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  UPRT11               681    690
     D  UPT11                691    700
     I* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     I* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
     I*
     C*
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPLNR
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    PPRT             10
     C                   PARM                    PPRTP            10
     C                   PARM                    PROG              2
     C     PROG          IFEQ      '30'
     C                   MOVE      *ON           *IN44
     C                   ELSE
     C                   MOVE      *OFF          *IN44
     C                   ENDIF                                                  <PROG
     C                   MOVE      '0'           UIN01
     C*
     C                   TESTN                   UAVDA                55
     C  N55              CLEAR                   UAVD
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'SF'          WSFUNI            2
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C*
     C     FIFIRM        CHAIN     FIRM                               99
     C                   READ      FIRM                                   99
     C                   MOVE      FIFIRM        UFIRM
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       309998
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C* AMETASKJEMA
     C                   Z-ADD     70            WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT11
     C  N99              MOVE      KOPNVN        PPRT
     C  N99              MOVE      KOPTY         UPT11
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C* PERIODESKJEMA
     C                   Z-ADD     75            WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        PPRTP
     C     WSSG          IFNE      'ALL'
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C                   END
     C*
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSSG          USG
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT11
     C                   MOVE      WSPRT         PPRT
     C                   END
     C     WSPRTP        IFNE      *BLANKS
     C                   MOVE      WSPRTP        PPRTP
     C                   END
     C     UPRT11        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT11
     C                   END
     C     UPT11         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT11
     C                   END
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
