      *
      ************************************************************
      *** PROGRAM SKAL SKRIVE UT STAUSLISTE - AMETAAVREGNING   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01-26                             ***
      *** LEDIGE INDIKATORER 27-29 31-89 91-99                 ***
      ************************************************************
      *
     FAMTURWRK  IF   E           K DISK
     FSYAM11PF  O    E             PRINTER OFLIND(*IN90)
     D                 DS
     D  DSDATO                 1      6  0
     D  DSDTD                  1      2  0
     D  DSDTM                  3      4  0
     D  DSDTÅ                  5      6  0
NV5  D                 DS
NV5  D  ATDT                   1      8  0
NV5  D  ATDTÅ                  1      4  0
NV5  D  ATDTM                  5      6  0
NV5  D  ATDTD                  7      8  0
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL AMTURWRK
     C*--------------------------------------------------------------
     C     AMTURK        KLIST
     C                   KFLD                    ATST
     C                   KFLD                    ATTUNR
     C                   KFLD                    ATKNA
SV5  C*                    KFLD           ATDTÅ
SV5  C*                    KFLD           ATDTM
SV5  C*                    KFLD           ATDTD
     C*
     C  N30              MOVE      ' '           XST               1
     C  N30              SETON                                        30
     C*
     C                   CLEAR                   ATST
     C                   CLEAR                   ATTUNR
     C                   CLEAR                   ATKNA
     C                   CLEAR                   ATDTÅ
     C                   CLEAR                   ATDTM
     C                   CLEAR                   ATDTD
     C     AMTURK        SETLL     AMTURWRK
     C                   SETON                                        90
     C     START         TAG
     C                   READ      AMTURWRK                               30
     C  N30              DO
     C   90              WRITE     HEADER
     C   90              SETOFF                                       90
     C*
     C     ATST          IFGT      XST
     C*
     C     ATST          IFEQ      '0'
     C                   WRITE     BRUDD0
     C                   ENDIF                                                  <ATST
     C*
     C     ATST          IFEQ      '1'
     C                   WRITE     BRUDDR
     C                   ENDIF                                                  <ATST
     C*
     C     ATST          IFEQ      '2'
     C                   WRITE     BRUDDW
     C                   ENDIF                                                  <ATST
     C*
     C     ATST          IFEQ      '3'
     C     ATST          OREQ      '4'
     C     ATST          OREQ      '5'
     C                   WRITE     BRUDDF
     C                   ENDIF                                                  <ATST
     C*
     C     ATST          IFEQ      '6'
     C                   WRITE     BRUDDK
     C                   ENDIF                                                  <ATST
     C*
     C                   MOVE      ATST          XST
     C                   ENDIF                                                  <THST
     C*
     C                   MOVE      ATDTD         DSDTD
     C                   MOVE      ATDTM         DSDTM
     C                   MOVE      ATDTÅ         DSDTÅ
     C*
     C                   WRITE     DETALJ
     C                   GOTO      START
     C                   END                                                    <ENDDO N30
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
