     F**************************************************************
     F*** PROGRAM SKAL STYRE PRIINT AV UTSKRIFT                  ***
     FSYAVINFM  CF   E             WORKSTN
      *
     C     *ENTRY        PLIST
     C                   PARM                    PRINTE           10
     C                   PARM                    BEVAR             4
     C                   PARM                    HOLD              4
     C                   PARM                    ANTALL            1
     C                   PARM                    AVBRYT            1
     C                   PARM                    FORFAL            6
     C                   MOVE      PRINTE        DEV
     C                   MOVE      'N'           BEV
     C                   MOVE      'N'           HOL
     C                   MOVE      '1'           ANT
     C                   EXFMT     BILDE1
     C     DEV           IFEQ      *BLANKS
     C                   MOVEL     '*JOB'        PRINTE
     C                   ELSE
     C                   MOVEL     DEV           PRINTE
     C                   END
     C     BEV           IFEQ      'J'
     C                   MOVEL     '*YES'        BEVAR
     C                   ELSE
     C                   MOVEL     '*NO'         BEVAR
     C                   END
     C     HOL           IFEQ      'J'
     C                   MOVEL     '*YES'        HOLD
     C                   ELSE
     C                   MOVEL     '*NO'         HOLD
     C                   END
     C     ANT           IFLE      0
     C                   MOVE      '1'           ANTALL
     C                   ELSE
     C                   MOVE      ANT           ANTALL
     C                   END
NV5  C     FFDATO        IFEQ      0
NV5  C                   MOVE      '010151'      FORFAL
NV5  C                   ELSE
     C                   MOVE      FFDATO        FORFAL
NV5  C                   END
     C                   SETON                                        LR
     C                   RETURN
