     f*
     f* lager code128 barkode med start og slutttegn
     f*
     Fliste     o    f  132        printer
      *_____________________
      * DS for output string
      *"""""""""""""""""""""
     D TABINN          S              3  0 DIM(150) CTDATA PERRCD(1) ASCEND
     D TABUTT          S              3  0 DIM(150) ALT(TABINN)
     D                 DS
     D  n                      1     57  0
     D                                     DIM(19)                              Output string
     D                 DS
     d  nra                    1     16
     D  NR                     1     16  0
     D                                     DIM(16)                              Output string
     D                 DS
     d  startt                 1      1
     d  parain                 2     19
     d  modulus               20     20
     d  sluttt                21     21
     d  dataut                 1     21
      *
     c     *entry        plist
     c                   parm                    unr              18
     c                   parm                    udatau           21
     c                   move      unr           parain
     c                   move      unr           nra
      *
      * BEREGNINGSLOGIKK
      *
     c                   z-add     1             x                 3 0
     c                   z-add     0             y                 3 0
      *TEGNSETT B
     C                   Z-ADD     104           N(x)
      *BOKSTAV N
     c                   add       1             x
     c                   add       1             y
     C     46            mult      y             N(x)
      *bOKSTAV O
     c                   add       1             y
     c                   add       1             x
     C     47            mult      y             N(x)
      *NESTE 15 TEGN
      *GÅ I LØKKE
     C     1             DO        16            nu                2 0
     c     nr(nu)        add       16            nrn               3 0
     c                   add       1             y
     c                   add       1             x
     C     nrn           mult      y             N(x)
     c                   end
      *
     c     1             do        19            nu
     c                   add       n(nu)         total             9 0
     c     total         div       103           totalx            9 0
     c                   mvr                     rest              3 0
     c                   enddo
      *
      * finner decimalverdi fra tabell i bunn
      *
     C     rest          LOOKUP    TABINN        TABUTT                   33
     c                   move      tabutt        dec               3 0
     c*
     c* finner ebcdic-verdi som skal ligge i
     c*
     c                   exsr      decsr
     c                   move      tegn          modulus
     c*
     c* finn   starttag
     c*
     c                   z-add     204           dec
     c                   exsr      decsr
     c                   move      tegn          startt
     c*
     c* finn   slutttag
     c*
     c                   z-add     206           dec
     c                   exsr      decsr
     c                   move      tegn          sluttt
     c                   move      dataut        udatau
     c                   except    det
     C                   SETON                                        LR
     C                   RETURN
     c**************************************************************
     c     decsr         begsr
     c**************************************************************
     c     dec           ifeq      0
     c                   move      X'00'         tegn              1
     c                   end
     c     dec           ifeq      1
     c                   move      X'01'         tegn
     c                   end
     c     dec           ifeq      2
     c                   move      X'02'         tegn
     c                   end
     c     dec           ifeq      3
     c                   move      X'03'         tegn
     c                   end
     c     dec           ifeq      4
     c                   move      X'37'         tegn
     c                   end
     c     dec           ifeq      5
     c                   move      X'2D'         tegn
     c                   end
     c     dec           ifeq      6
     c                   move      X'2E'         tegn
     c                   end
     c     dec           ifeq      7
     c                   move      X'2F'         tegn
     c                   end
     c     dec           ifeq      8
     c                   move      X'16'         tegn
     c                   end
     c     dec           ifeq      9
     c                   move      X'05'         tegn
     c                   end
     c     dec           ifeq      10
     c                   move      X'25'         tegn
     c                   end
     c     dec           ifeq      11
     c                   move      X'0B'         tegn
     c                   end
     c     dec           ifeq      12
     c                   move      X'0C'         tegn
     c                   end
     c     dec           ifeq      13
     c                   move      X'0D'         tegn
     c                   end
     c     dec           ifeq      14
     c                   move      X'0E'         tegn
     c                   end
     c     dec           ifeq      15
     c                   move      X'0F'         tegn
     c                   end
     c     dec           ifeq      16
     c                   move      X'10'         tegn
     c                   end
     c     dec           ifeq      17
     c                   move      X'11'         tegn
     c                   end
     c     dec           ifeq      18
     c                   move      X'12'         tegn
     c                   end
     c     dec           ifeq      19
     c                   move      X'13'         tegn
     c                   end
     c     dec           ifeq      20
     c                   move      X'3C'         tegn
     c                   end
     c     dec           ifeq      21
     c                   move      X'3D'         tegn
     c                   end
     c     dec           ifeq      22
     c                   move      X'32'         tegn
     c                   end
     c     dec           ifeq      23
     c                   move      X'26'         tegn
     c                   end
     c     dec           ifeq      24
     c                   move      X'18'         tegn
     c                   end
     c     dec           ifeq      25
     c                   move      X'19'         tegn
     c                   end
     c     dec           ifeq      26
     c                   move      X'3F'         tegn
     c                   end
     c     dec           ifeq      27
     c                   move      X'27'         tegn
     c                   end
     c     dec           ifeq      28
     c                   move      X'22'         tegn
     c                   end
     c     dec           ifeq      29
     c                   move      X'1D'         tegn
     c                   end
     c     dec           ifeq      30
     c                   move      X'35'         tegn
     c                   end
     c     dec           ifeq      31
     c                   move      X'1F'         tegn
     c                   end
     c     dec           ifeq      32
     c                   move      X'40'         tegn
     c                   end
     c     dec           ifeq      33
     c                   move      X'5A'         tegn
     c                   end
     c     dec           ifeq      34
     c                   move      X'7F'         tegn
     c                   end
     c     dec           ifeq      35
     c                   move      X'7B'         tegn
     c                   end
     c     dec           ifeq      36
     c                   move      X'5B'         tegn
     c                   end
     c     dec           ifeq      37
     c                   move      X'6C'         tegn
     c                   end
     c     dec           ifeq      38
     c                   move      X'50'         tegn
     c                   end
     c     dec           ifeq      39
     c                   move      X'7D'         tegn
     c                   end
     c     dec           ifeq      40
     c                   move      X'4D'         tegn
     c                   end
     c     dec           ifeq      41
     c                   move      X'5D'         tegn
     c                   end
     c     dec           ifeq      42
     c                   move      X'5C'         tegn
     c                   end
     c     dec           ifeq      43
     c                   move      X'4E'         tegn
     c                   end
     c     dec           ifeq      44
     c                   move      X'6B'         tegn
     c                   end
     c     dec           ifeq      45
     c                   move      X'60'         tegn
     c                   end
     c     dec           ifeq      46
     c                   move      X'4B'         tegn
     c                   end
     c     dec           ifeq      47
     c                   move      X'61'         tegn
     c                   end
     c     dec           ifeq      48
     c                   move      X'F0'         tegn
     c                   end
     c     dec           ifeq      49
     c                   move      X'F1'         tegn
     c                   end
     c     dec           ifeq      50
     c                   move      X'F2'         tegn
     c                   end
     c     dec           ifeq      51
     c                   move      X'F3'         tegn
     c                   end
     c     dec           ifeq      52
     c                   move      X'F4'         tegn
     c                   end
     c     dec           ifeq      53
     c                   move      X'F5'         tegn
     c                   end
     c     dec           ifeq      54
     c                   move      X'F6'         tegn
     c                   end
     c     dec           ifeq      55
     c                   move      X'F7'         tegn
     c                   end
     c     dec           ifeq      56
     c                   move      X'F8'         tegn
     c                   end
     c     dec           ifeq      57
     c                   move      X'F9'         tegn
     c                   end
     c     dec           ifeq      58
     c                   move      X'7A'         tegn
     c                   end
     c     dec           ifeq      59
     c                   move      X'5E'         tegn
     c                   end
     c     dec           ifeq      60
     c                   move      X'4C'         tegn
     c                   end
     c     dec           ifeq      61
     c                   move      X'7E'         tegn
     c                   end
     c     dec           ifeq      62
     c                   move      X'6E'         tegn
     c                   end
     c     dec           ifeq      63
     c                   move      X'6F'         tegn
     c                   end
     c     dec           ifeq      64
     c                   move      X'7C'         tegn
     c                   end
     c     dec           ifeq      65
     c                   move      X'C1'         tegn
     c                   end
     c     dec           ifeq      66
     c                   move      X'C2'         tegn
     c                   end
     c     dec           ifeq      67
     c                   move      X'C3'         tegn
     c                   end
     c     dec           ifeq      68
     c                   move      X'C4'         tegn
     c                   end
     c     dec           ifeq      69
     c                   move      X'C5'         tegn
     c                   end
     c     dec           ifeq      70
     c                   move      X'C6'         tegn
     c                   end
     c     dec           ifeq      71
     c                   move      X'C7'         tegn
     c                   end
     c     dec           ifeq      72
     c                   move      X'C8'         tegn
     c                   end
     c     dec           ifeq      73
     c                   move      X'C9'         tegn
     c                   end
     c     dec           ifeq      74
     c                   move      X'D1'         tegn
     c                   end
     c     dec           ifeq      75
     c                   move      X'D2'         tegn
     c                   end
     c     dec           ifeq      76
     c                   move      X'D3'         tegn
     c                   end
     c     dec           ifeq      77
     c                   move      X'D4'         tegn
     c                   end
     c     dec           ifeq      78
     c                   move      X'D5'         tegn
     c                   end
     c     dec           ifeq      79
     c                   move      X'D6'         tegn
     c                   end
     c     dec           ifeq      80
     c                   move      X'D7'         tegn
     c                   end
     c     dec           ifeq      81
     c                   move      X'D8'         tegn
     c                   end
     c     dec           ifeq      82
     c                   move      X'D9'         tegn
     c                   end
     c     dec           ifeq      83
     c                   move      X'E2'         tegn
     c                   end
     c     dec           ifeq      84
     c                   move      X'E3'         tegn
     c                   end
     c     dec           ifeq      85
     c                   move      X'E4'         tegn
     c                   end
     c     dec           ifeq      86
     c                   move      X'E5'         tegn
     c                   end
     c     dec           ifeq      87
     c                   move      X'E6'         tegn
     c                   end
     c     dec           ifeq      88
     c                   move      X'E7'         tegn
     c                   end
     c     dec           ifeq      89
     c                   move      X'E8'         tegn
     c                   end
     c     dec           ifeq      90
     c                   move      X'E9'         tegn
     c                   end
     c     dec           ifeq      91
     c                   move      X'AD'         tegn
     c                   end
     c     dec           ifeq      92
     c                   move      X'E0'         tegn
     c                   end
     c     dec           ifeq      93
     c                   move      X'BD'         tegn
     c                   end
     c     dec           ifeq      94
     c                   move      X'5F'         tegn
     c                   end
     c     dec           ifeq      95
     c                   move      X'6D'         tegn
     c                   end
     c     dec           ifeq      96
     c                   move      X'79'         tegn
     c                   end
     c     dec           ifeq      97
     c                   move      X'81'         tegn
     c                   end
     c     dec           ifeq      98
     c                   move      X'82'         tegn
     c                   end
     c     dec           ifeq      99
     c                   move      X'83'         tegn
     c                   end
     c     dec           ifeq      100
     c                   move      X'84'         tegn
     c                   end
     c     dec           ifeq      101
     c                   move      X'85'         tegn
     c                   end
     c     dec           ifeq      102
     c                   move      X'86'         tegn
     c                   end
     c     dec           ifeq      103
     c                   move      X'87'         tegn
     c                   end
     c     dec           ifeq      104
     c                   move      X'88'         tegn
     c                   end
     c     dec           ifeq      105
     c                   move      X'89'         tegn
     c                   end
     c     dec           ifeq      106
     c                   move      X'91'         tegn
     c                   end
     c     dec           ifeq      107
     c                   move      X'92'         tegn
     c                   end
     c     dec           ifeq      108
     c                   move      X'93'         tegn
     c                   end
     c     dec           ifeq      109
     c                   move      X'94'         tegn
     c                   end
     c     dec           ifeq      110
     c                   move      X'95'         tegn
     c                   end
     c     dec           ifeq      111
     c                   move      X'96'         tegn
     c                   end
     c     dec           ifeq      112
     c                   move      X'97'         tegn
     c                   end
     c     dec           ifeq      113
     c                   move      X'93'         tegn
     c                   end
     c     dec           ifeq      114
     c                   move      X'99'         tegn
     c                   end
     c     dec           ifeq      115
     c                   move      X'A2'         tegn
     c                   end
     c     dec           ifeq      116
     c                   move      X'A3'         tegn
     c                   end
     c     dec           ifeq      117
     c                   move      X'A4'         tegn
     c                   end
     c     dec           ifeq      118
     c                   move      X'A5'         tegn
     c                   end
     c     dec           ifeq      119
     c                   move      X'A6'         tegn
     c                   end
     c     dec           ifeq      120
     c                   move      X'A7'         tegn
     c                   end
     c     dec           ifeq      121
     c                   move      X'A8'         tegn
     c                   end
     c     dec           ifeq      122
     c                   move      X'A9'         tegn
     c                   end
     c     dec           ifeq      123
     c                   move      X'C0'         tegn
     c                   end
     c     dec           ifeq      124
     c                   move      X'4F'         tegn
     c                   end
     c     dec           ifeq      125
     c                   move      X'D0'         tegn
     c                   end
     c     dec           ifeq      126
     c                   move      X'A1'         tegn
     c                   end
     c     dec           ifeq      127
     c                   move      X'07'         tegn
     c                   end
     c     dec           ifeq      128
     c                   move      X'00'         tegn
     c                   end
     c     dec           ifeq      129
     c                   move      X'01'         tegn
     c                   end
     c     dec           ifeq      130
     c                   move      X'02'         tegn
     c                   end
     c     dec           ifeq      131
     c                   move      X'03'         tegn
     c                   end
     c     dec           ifeq      132
     c                   move      X'37'         tegn
     c                   end
     c     dec           ifeq      133
     c                   move      X'2D'         tegn
     c                   end
     c     dec           ifeq      134
     c                   move      X'2E'         tegn
     c                   end
     c     dec           ifeq      135
     c                   move      X'2F'         tegn
     c                   end
     c     dec           ifeq      136
     c                   move      X'16'         tegn
     c                   end
     c     dec           ifeq      137
     c                   move      X'05'         tegn
     c                   end
     c     dec           ifeq      138
     c                   move      X'25'         tegn
     c                   end
     c     dec           ifeq      139
     c                   move      X'0B'         tegn
     c                   end
     c     dec           ifeq      140
     c                   move      X'0C'         tegn
     c                   end
     c     dec           ifeq      141
     c                   move      X'0D'         tegn
     c                   end
     c     dec           ifeq      142
     c                   move      X'0E'         tegn
     c                   end
     c     dec           ifeq      143
     c                   move      X'0F'         tegn
     c                   end
     c     dec           ifeq      144
     c                   move      X'10'         tegn
     c                   end
     c     dec           ifeq      145
     c                   move      X'11'         tegn
     c                   end
     c     dec           ifeq      146
     c                   move      X'12'         tegn
     c                   end
     c     dec           ifeq      147
     c                   move      X'13'         tegn
     c                   end
     c     dec           ifeq      148
     c                   move      X'3C'         tegn
     c                   end
     c     dec           ifeq      149
     c                   move      X'3D'         tegn
     c                   end
     c     dec           ifeq      150
     c                   move      X'32'         tegn
     c                   end
     c     dec           ifeq      151
     c                   move      X'26'         tegn
     c                   end
     c     dec           ifeq      152
     c                   move      X'18'         tegn
     c                   end
     c     dec           ifeq      153
     c                   move      X'19'         tegn
     c                   end
     c     dec           ifeq      154
     c                   move      X'3F'         tegn
     c                   end
     c     dec           ifeq      155
     c                   move      X'27'         tegn
     c                   end
     c     dec           ifeq      156
     c                   move      X'22'         tegn
     c                   end
     c     dec           ifeq      157
     c                   move      X'1D'         tegn
     c                   end
     c     dec           ifeq      158
     c                   move      X'35'         tegn
     c                   end
     c     dec           ifeq      159
     c                   move      X'1F'         tegn
     c                   end
     c     dec           ifeq      160
     c                   move      X'40'         tegn
     c                   end
     c     dec           ifeq      161
     c                   move      X'5A'         tegn
     c                   end
     c     dec           ifeq      162
     c                   move      X'7F'         tegn
     c                   end
     c     dec           ifeq      163
     c                   move      X'7B'         tegn
     c                   end
     c     dec           ifeq      164
     c                   move      X'5B'         tegn
     c                   end
     c     dec           ifeq      165
     c                   move      X'6C'         tegn
     c                   end
     c     dec           ifeq      166
     c                   move      X'50'         tegn
     c                   end
     c     dec           ifeq      167
     c                   move      X'7D'         tegn
     c                   end
     c     dec           ifeq      168
     c                   move      X'4D'         tegn
     c                   end
     c     dec           ifeq      169
     c                   move      X'5D'         tegn
     c                   end
     c     dec           ifeq      170
     c                   move      X'5C'         tegn
     c                   end
     c     dec           ifeq      171
     c                   move      X'4E'         tegn
     c                   end
     c     dec           ifeq      172
     c                   move      X'6B'         tegn
     c                   end
     c     dec           ifeq      173
     c                   move      X'60'         tegn
     c                   end
     c     dec           ifeq      174
     c                   move      X'4B'         tegn
     c                   end
     c     dec           ifeq      175
     c                   move      X'61'         tegn
     c                   end
     c     dec           ifeq      176
     c                   move      X'F0'         tegn
     c                   end
     c     dec           ifeq      177
     c                   move      X'F1'         tegn
     c                   end
     c     dec           ifeq      178
     c                   move      X'F2'         tegn
     c                   end
     c     dec           ifeq      179
     c                   move      X'F3'         tegn
     c                   end
     c     dec           ifeq      180
     c                   move      X'F4'         tegn
     c                   end
     c     dec           ifeq      181
     c                   move      X'F5'         tegn
     c                   end
     c     dec           ifeq      182
     c                   move      X'F6'         tegn
     c                   end
     c     dec           ifeq      183
     c                   move      X'F7'         tegn
     c                   end
     c     dec           ifeq      184
     c                   move      X'F8'         tegn
     c                   end
     c     dec           ifeq      185
     c                   move      X'F9'         tegn
     c                   end
     c     dec           ifeq      186
     c                   move      X'7A'         tegn
     c                   end
     c     dec           ifeq      187
     c                   move      X'5E'         tegn
     c                   end
     c     dec           ifeq      188
     c                   move      X'4C'         tegn
     c                   end
     c     dec           ifeq      189
     c                   move      X'7E'         tegn
     c                   end
     c     dec           ifeq      190
     c                   move      X'6E'         tegn
     c                   end
     c     dec           ifeq      191
     c                   move      X'6F'         tegn
     c                   end
     c     dec           ifeq      192
     c                   move      X'7C'         tegn
     c                   end
     c     dec           ifeq      193
     c                   move      X'C1'         tegn
     c                   end
     c     dec           ifeq      194
     c                   move      X'62'         tegn
     c                   end
     c     dec           ifeq      195
     c                   move      X'66'         tegn
     c                   end
     c     dec           ifeq      196
     c                   move      X'63'         tegn
     c                   end
     c     dec           ifeq      197
     c                   move      X'5B'         tegn
     c                   end
     c     dec           ifeq      198
     c                   move      X'7B'         tegn
     c                   end
     c     dec           ifeq      199
     c                   move      X'6B'         tegn
     c                   end
     c     dec           ifeq      200
     c                   move      X'74'         tegn
     c                   end
     c     dec           ifeq      201
     c                   move      X'71'         tegn
     c                   end
     c     dec           ifeq      202
     c                   move      X'72'         tegn
     c                   end
     c     dec           ifeq      203
     c                   move      X'73'         tegn
     c                   end
     c     dec           ifeq      204
     c                   move      X'78'         tegn
     c                   end
     c     dec           ifeq      205
     c                   move      X'75'         tegn
     c                   end
     c     dec           ifeq      206
     c                   move      X'76'         tegn
     c                   end
     c     dec           ifeq      207
     c                   move      X'D6'         tegn
     c                   end
     c     dec           ifeq      208
     c                   move      X'D7'         tegn
     c                   end
     c     dec           ifeq      209
     c                   move      X'D8'         tegn
     c                   end
     c     dec           ifeq      210
     c                   move      X'D9'         tegn
     c                   end
     c     dec           ifeq      211
     c                   move      X'E2'         tegn
     c                   end
     c     dec           ifeq      212
     c                   move      X'E3'         tegn
     c                   end
     c     dec           ifeq      213
     c                   move      X'E4'         tegn
     c                   end
     c     dec           ifeq      214
     c                   move      X'E5'         tegn
     c                   end
     c     dec           ifeq      215
     c                   move      X'E6'         tegn
     c                   end
     c     dec           ifeq      216
     c                   move      X'E7'         tegn
     c                   end
     c     dec           ifeq      217
     c                   move      X'E8'         tegn
     c                   end
     c     dec           ifeq      218
     c                   move      X'E9'         tegn
     c                   end
     c     dec           ifeq      219
     c                   move      X'AD'         tegn
     c                   end
     c     dec           ifeq      220
     c                   move      X'E0'         tegn
     c                   end
     c     dec           ifeq      221
     c                   move      X'BD'         tegn
     c                   end
     c     dec           ifeq      222
     c                   move      X'5F'         tegn
     c                   end
     c     dec           ifeq      223
     c                   move      X'6D'         tegn
     c                   end
     c     dec           ifeq      224
     c                   move      X'79'         tegn
     c                   end
     c     dec           ifeq      225
     c                   move      X'81'         tegn
     c                   end
     c     dec           ifeq      226
     c                   move      X'82'         tegn
     c                   end
     c     dec           ifeq      227
     c                   move      X'83'         tegn
     c                   end
     c     dec           ifeq      228
     c                   move      X'84'         tegn
     c                   end
     c     dec           ifeq      229
     c                   move      X'85'         tegn
     c                   end
     c     dec           ifeq      230
     c                   move      X'86'         tegn
     c                   end
     c     dec           ifeq      231
     c                   move      X'87'         tegn
     c                   end
     c     dec           ifeq      232
     c                   move      X'88'         tegn
     c                   end
     c     dec           ifeq      233
     c                   move      X'89'         tegn
     c                   end
     c     dec           ifeq      234
     c                   move      X'91'         tegn
     c                   end
     c     dec           ifeq      235
     c                   move      X'92'         tegn
     c                   end
     c     dec           ifeq      236
     c                   move      X'93'         tegn
     c                   end
     c     dec           ifeq      237
     c                   move      X'94'         tegn
     c                   end
     c     dec           ifeq      238
     c                   move      X'95'         tegn
     c                   end
     c     dec           ifeq      239
     c                   move      X'96'         tegn
     c                   end
     c     dec           ifeq      240
     c                   move      X'97'         tegn
     c                   end
     c     dec           ifeq      241
     c                   move      X'98'         tegn
     c                   end
     c     dec           ifeq      242
     c                   move      X'99'         tegn
     c                   end
     c     dec           ifeq      243
     c                   move      X'A2'         tegn
     c                   end
     c     dec           ifeq      244
     c                   move      X'A3'         tegn
     c                   end
     c     dec           ifeq      245
     c                   move      X'A4'         tegn
     c                   end
     c     dec           ifeq      246
     c                   move      X'A5'         tegn
     c                   end
     c     dec           ifeq      247
     c                   move      X'A6'         tegn
     c                   end
     c     dec           ifeq      248
     c                   move      X'A7'         tegn
     c                   end
     c     dec           ifeq      249
     c                   move      X'A8'         tegn
     c                   end
     c     dec           ifeq      250
     c                   move      X'A9'         tegn
     c                   end
     c     dec           ifeq      251
     c                   move      X'C0'         tegn
     c                   end
     c     dec           ifeq      252
     c                   move      X'4F'         tegn
     c                   end
     c     dec           ifeq      253
     c                   move      X'D0'         tegn
     c                   end
     c     dec           ifeq      254
     c                   move      X'A1'         tegn
     c                   end
     c     dec           ifeq      255
     c                   move      X'07'         tegn
     c                   end
     c                   endsr
     Oliste     e            det              05
     O                       dec                 10
     Oliste     e            det              08
     O                       modulus             10
**
000194
001033
002034
003035
004036
005037
006038
007039
008040
009041
010042
011043
012044
013045
014046
015047
016048
017049
018050
019051
020052
021053
022054
023055
024056
025057
026058
027059
028060
029061
030062
031063
032064
033065
034066
035067
036068
037069
038070
039071
040072
041073
042074
043075
044076
045077
046078
047079
048080
049081
050082
051083
052084
053085
054086
055087
056088
057089
058090
059091
060092
061093
062094
063095
064096
065097
066098
067099
068100
069101
070102
071103
072104
073105
074106
075107
076108
077109
078110
079111
080112
081113
082114
083115
084116
085117
086118
087119
088120
089121
090122
091123
092124
093125
094126
095195
096196
097197
098198
099199
100200
101201
102202
103203
104204
105205
999206
