      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ OPPDRAG (VISE FAKTURA)       ***
      ***        (KOMPLIMERT)                                 ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 04 05 08 11 13-24                ***
      *** LEDIGE INDIKATORER 34-49 51-90 95-97                ***
      ***********************************************************
     FFIRM      IF   E           K DISK
     FHEADFCMP  IF   E           K DISK
     F                                     RENAME(HEADFRCMP:HEADFRCM)
     FFAK2CMP   IF   E           K DISK
     FSYCM21FB  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D*
     D*** HØ, LE, BR, AN  BRUKES PGA. KALLER PÅ SYEF10B
     D HØ              S              3  2 DIM(12)
     D LE              S              3  2 DIM(12)
     D BR              S              3  2 DIM(12)
     D AN              S              3  0 DIM(12)
     D*
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSDTOD                 1      2  0
     D  WSDTOM                 3      4  0
     D  WSDTOÅ                 5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D  FADTÅ                  1      4  0
     D  FADTM                  5      6  0
     D  FADTD                  7      8  0
     D  FADATO                 1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDATO                 1      6  0
     D                 DS
     D  FADTDF                 1      4  0
     D  FADTMF                 5      6  0
     D  FADTÅF                 7      8  0
     D  FADAFF                 1      8  0
     D                 DS
     D  WSDTDF                 1      2  0
     D  WSDTMF                 3      4  0
     D  WSDTÅF                 5      6  0
     D  WSDAFF                 1      6  0
     D                 DS
     D  WSVT                   1     20
     D  WSVT2                  1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   EXSR      KDTFM1
     C                   WRITE     SUBCTL
     C                   EXSR      KDTFM1
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     1             DSPRCN
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     FAK2K         SETLL     FAK2CMP
     C     START1        TAG
     C     UAVD          READE     FAK2CMP                                94
     C  N94UOPD          COMP      FAOPD                              9494
     C                   MOVE      *ZEROS        FORIGE            6 0
     C                   MOVE      *BLANK        FORISK            1
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        36
     C                   ADD       1             ZRECNO            4 0
     C                   EXSR      MOVDAT
     C                   EXSR      KDTFM2
     C                   Z-ADD     FAMOMS        WSMOMS
     C                   WRITE     SUBFIL
     C     UAVD          READE     FAK2CMP                                94
     C  N94UOPD          COMP      FAOPD                              9494
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C                   EXSR      KDTFM1
     C     ZRECNO        IFEQ      0
     C                   WRITE     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   END
     C                   EXSR      KDTFM1
     C                   EXFMT     BUNN
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       3098
     C                   MOVE      *ZEROS        UFLAGG
     C   01              ADD       1             UFLAGG
     C   02              ADD       2             UFLAGG
     C   03              ADD       3             UFLAGG
     C   12              ADD       9             UFLAGG
     C*
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
     C*
     C* IF NO F-KEYS WORK WITH SUBFILE
     C*
     C  N01
     CANN02
     CANN03
     CANN11
     CANN12              DO
     C     ZRECNO        IFNE      0
     C                   EXSR      FAHENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C                   END
     C*
     C   11              EXSR      SAD
     C   30              GOTO      START3
     C                   EXSR      TESTFL
     C*
     C  N01
     CANN02
     CANN03
     CANN12              GOTO      START3
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     FAHENT        BEGSR
     C***********************************************
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              SETON                                            30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       13            LINNBR
     C                   MVR                     LINNBR
     C                   MOVE      LINNBR        XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     13            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C  N98WSNR          IFEQ      '5'
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   SETON                                        99
     C                   EXFMT     VAREL3
     C                   END
     C   12              GOTO      SLHENT
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       7             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SAD           BEGSR
     C***********************************************
     C* ASKED FOR DECLARATION
     C                   CALL      'SAD005A'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      0
     C                   CALL      'SAD023A'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C                   END
     C* HVEN RETURN TEST IF NOT FOUND DECLARATION
     C     UFLAGG        IFEQ      0
     C                   MOVE      'SPD0015'     MSGNR
     C                   SETON                                        30
     C                   END
     C                   ENDSR
     C***********************************************
     C     TESTFL        BEGSR
     C***********************************************
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      2                                      02
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      9                                      12
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     MOVDAT        BEGSR
     C***********************************************
     C                   MOVE      FADTD         WSDTD
     C                   MOVE      FADTM         WSDTM
     C                   MOVE      FADTÅ         WSDTÅ
     C                   MOVE      FADTDF        WSDTDF
     C                   MOVE      FADTMF        WSDTMF
     C                   MOVE      FADTÅF        WSDTÅF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     FAK2K         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C                   KFLD                    XSK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UFIRM             2
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAGG            1 0
     C*
     C                   MOVE      ' '           XSK               1
     C*
     C     UFIRM         CHAIN     FIRM                               33
     C     HEADFK        CHAIN     HEADFCMP                           33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM1        BEGSR
     C***********************************************
     C                   MOVE      HEDTD         UDT1              2 0
     C                   MOVE      HEDTM         UDT2              2 0
     C                   MOVE      HEDTÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTOD
     C                   MOVE      UDT2          WSDTOM
     C                   MOVE      UDT3          WSDTOÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM2        BEGSR
     C***********************************************
     C                   MOVE      WSDTD         UDT1
     C                   MOVE      WSDTM         UDT2
     C                   MOVE      WSDTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C                   MOVE      WSDTDF        UDT1
     C                   MOVE      WSDTMF        UDT2
     C                   MOVE      WSDTÅF        UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTDF
     C                   MOVE      UDT2          WSDTMF
     C                   MOVE      UDT3          WSDTÅF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
