      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ OPPDRAG (VISE OPPDRAG)       ***
      ***         (KOMPLIMERT)                                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 04-11 13-26                      ***
      *** LEDIGE INDIKATORER 29-32 34-99                      ***
      *** INDIKATOR 27 PÅ = KALLE FRA SYFA93 (SLETT OPPDRAG)  ***
      ***           28 PÅ = KALLE FRA SYFF53 (TURNUMMER IMP.) ***
      ***        27,28 AV = KALLE FRA SYFM21 (SPØRRE OPPDRAG) ***
      ***********************************************************
      *
     FHEADFCMP  IF   E           K DISK
     F                                     RENAME(HEADFRCMP:HEADFRCM)
     FKODTFS    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FSYFM21FA  CF   E             WORKSTN
NRFA D                 DS
NRFA D  HERFA                  1     35
NRFA D  HERFA15                1     15
     D                 DS
     D  WSVALP                 1      3  1
     D  HEVALP                 1      3  3
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTRD                 1      2  0
     D  WSDTRM                 3      4  0
     D  WSDTRÅ                 5      6  0
     D  WSDTR                  1      6  0
     D                 DS
     D  TRFDÅ                  1      4  0
     D  TRFDM                  5      6  0
     D  TRFDD                  7      8  0
     D  TRSDFD                 1      8  0
     D                 DS
     D  WSFDÅ                  1      2  0
     D  WSFDM                  3      4  0
     D  WSFDD                  5      6  0
     D  WSSDFD                 1      6  0
     D                 DS
     D  TRTDÅ                  1      4  0
     D  TRTDM                  5      6  0
     D  TRTDD                  7      8  0
     D  TRSDTD                 1      8  0
     D                 DS
     D  WSTDÅ                  1      2  0
     D  WSTDM                  3      4  0
     D  WSTDD                  5      6  0
     D  WSSDTD                 1      6  0
     D                 DS
     D  TRFFÅ                  1      4  0
     D  TRFFM                  5      6  0
     D  TRFFD                  7      8  0
     D  TRSFFD                 1      8  0
     D                 DS
     D  WSFFÅ                  1      2  0
     D  WSFFM                  3      4  0
     D  WSFFD                  5      6  0
     D  WSSFFD                 1      6  0
     D                 DS
     D  TRVTÅ                  1      4  0
     D  TRVTM                  5      6  0
     D  TRVTD                  7      8  0
     D  TRSVTD                 1      8  0
     D                 DS
     D  WSVTÅ                  1      2  0
     D  WSVTM                  3      4  0
     D  WSVTD                  5      6  0
     D  WSSVTD                 1      6  0
     C*
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    YKN
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    HEKNT
     C     KODFSK        KLIST
     C                   KFLD                    YFSUNI
     C                   KFLD                    HEKNF
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UFIRM             2
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      27
     C     UFLAGG        COMP      2                                      28
     C*
     C                   MOVE      'FS'          YFSUNI            2
     C                   MOVE      *ZEROS        HEVALP
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSDFD
     C                   MOVE      *ZEROS        TRSDTD
     C                   MOVE      *ZEROS        TRSVTD
     C*
     C     HEADFK        CHAIN     HEADFCMP                           33
     C                   MOVE      *BLANKS       WSTRNV           18
     C     HEUR          IFEQ      'A'
     C     HEUR          OREQ      'B'
     C     HEUR          OREQ      'C'
     C     HEUR          OREQ      'F'
     C     HEUR          OREQ      'G'
     C     TRANK         CHAIN     TRAN                               33
     C  N33              MOVEL     VMNAVN        WSTRNV
     C                   END
     C*
     C                   MOVE      HEKNSF        YKN               8 0
     C     KUND1K        CHAIN     CUNDL01                            33
     C   33              MOVE      *BLANKS       HENASF
     C  N33              MOVEL     KNAVN         HENASF
     C                   MOVE      HEKNKF        YKN               8 0
     C     KUND1K        CHAIN     CUNDL01                            33
     C   33              MOVE      *BLANKS       HENAKF
     C  N33              MOVEL     KNAVN         HENAKF
     C*
     C                   EXSR      KDTFM
     C     HEUR          IFEQ      'A'
     C                   EXFMT     BILDEFA
     C                   END
     C     HEUR          IFEQ      'B'
     C                   EXFMT     BILDEEX
     C                   END
     C     HEUR          IFEQ      'C'
     C                   EXFMT     BILDEFI
     C                   END
     C     HEUR          IFEQ      'E'
     C     HEUR          OREQ      'D'
     C     HEKNT         IFEQ      0
     C                   MOVE      *BLANKS       KFSNAV
     C                   ELSE
     C                   MOVE      HEKNT         HEKNF
     C     KODFSK        CHAIN     KODTFS                             33
     C                   END
     C                   END
     C     HEUR          IFEQ      'E'
     C                   EXFMT     BILDEIN
     C                   END
     C     HEUR          IFEQ      'D'
     C                   EXFMT     BILDEEF
     C                   END
     C     HEUR          IFEQ      'F'
     C                   EXFMT     BILDESJ
     C                   END
     C     HEUR          IFEQ      'G'
     C                   EXFMT     BILDESE
     C                   END
     C     HEUR          IFEQ      'H'
     C                   EXFMT     BILDETR
     C                   END
     C*
     C                   Z-ADD     0             UFLAGG
     C   01              ADD       1             UFLAGG
     C   02              ADD       2             UFLAGG
     C   03              ADD       3             UFLAGG
     C   05              ADD       5             UFLAGG
     C   12              ADD       9             UFLAGG
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     KDTFM         BEGSR
     C***********************************************
     C                   MOVE      HEDTRD        UDT1              2 0
     C                   MOVE      HEDTRM        UDT2              2 0
     C                   MOVE      HEDTRÅ        UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTRD
     C                   MOVE      UDT2          WSDTRM
     C                   MOVE      UDT3          WSDTRÅ
      *
     C                   MOVE      HEDTD         UDT1
     C                   MOVE      HEDTM         UDT2
     C                   MOVE      HEDTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
      *
     C                   MOVE      TRFDD         UDT1
     C                   MOVE      TRFDM         UDT2
     C                   MOVE      TRFDÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSFDD
     C                   MOVE      UDT2          WSFDM
     C                   MOVE      UDT3          WSFDÅ
      *
     C                   MOVE      TRTDD         UDT1
     C                   MOVE      TRTDM         UDT2
     C                   MOVE      TRTDÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSTDD
     C                   MOVE      UDT2          WSTDM
     C                   MOVE      UDT3          WSTDÅ
      *
     C                   MOVE      TRFFD         UDT1
     C                   MOVE      TRFFM         UDT2
     C                   MOVE      TRFFÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSFFD
     C                   MOVE      UDT2          WSFFM
     C                   MOVE      UDT3          WSFFÅ
      *
     C                   MOVE      TRVTD         UDT1
     C                   MOVE      TRVTM         UDT2
     C                   MOVE      TRVTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSVTD
     C                   MOVE      UDT2          WSVTM
     C                   MOVE      UDT3          WSVTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
