      *
      ***********************************************************
      *** PROGRAM skjekker om prestartjobber er aktive        ***
      ***********************************************************
      *
     Fprestartf UF   E           K DISK
     FSYdr01fm  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  SYTXT                  1     30
     D  XDLT                   1      4
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      sysbs         Ysbs
     C                   MOVE      syjob         Yjob
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     keyst         SETLL     prestartf
     C     START1        TAG
     C                   READ(n)   prestartf                              94
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     c                   setoff                                       70
     c     sybru         ifeq      'J'
     c     syakt         andeq     'N'
     c                   seton                                        70
     c                   end
     C                   write     SUBFIL
     C                   READ(n)   prestartf                              94
     C  N94              MOVE      sysbs         Ysbs
     C  N94              MOVE      syjob         Yjob
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   SETOFF                                       9998
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   MOVE      *blanks       wsSBS
     C                   MOVE      *blanks       WSjob
     C                   GOTO      START5
     C                   END
     C*** SØK FRA AVDELING
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94keyrol        SETLL     prestartf
     C  N94              READ(n)   prestartf                              94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C  N98              GOTO      START
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE
     C     START5        TAG
     C                   GOTO      START3
     C*
     C*** SØK FRA AVDELING
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       7             LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          MULT      2             XLIN
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 02 = endre
      *
     C     WSNR          IFEQ      '2'
     c                   exsr      endre
     c                   seton                                        99
     c                   setoff                                       70
     c     sybru         ifeq      'J'
     c     syakt         andeq     'N'
     c                   seton                                        70
     c                   end
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C*
     C     SLHENT        TAG
     C   99              SETOFF                                       98
     C                   Z-add     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    usbs             10
     c                   parm                    ulib             10
     C     keye          KLIST
     C                   KFLD                    SYSBS            10
     C                   KFLD                    SYJOB            10
     C     keyst         KLIST
     C                   KFLD                    WSSBS            10
     C                   KFLD                    WSJOB            10
     C     keyrol        KLIST
     C                   KFLD                    ysbs             10
     C                   KFLD                    yjob             10
     C*
     c                   exsr      test
     C                   ENDSR
     C*
     C***********************************************
     C     test          BEGSR
     C***********************************************
     c                   setoff                                       33
     c     keyst         setll     prestartf
     c     *in(33)       doweq     '0'
     c                   read      prestartf                              33
     c     *in(33)       ifeq      '0'
     c                   move      usbs          sysbs
     c                   move      ulib          sylib
     c                   call      'SYDR01T'
     c                   parm                    sysbs
     c                   parm                    sypgm
     c                   parm                    sylib
     c                   parm                    syakt
     c                   update    prestartr
     c                   end
     c                   end
     c                   endsr
     C***********************************************
     C     endre         BEGSR
     C***********************************************
     c                   move      sybru         wsbru
     c                   exfmt     vareli
     c  N12              do
     c     keye          chain     prestartf                          33
     c                   move      wsbru         sybru
     c                   update    prestartr
     C                   END
     c                   endsr
