      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE BASISRATER  EKSPORT       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-69 71-90    ***
      ***                    95-97 99                         ***
      ***********************************************************
      *
     FKODTPB    UF A E           K DISK
     FSTED2     IF   E           K DISK
     FSYEF18FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  WSSD                   1      3
     D  WSSD5                  1      5
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2SD          YPBSD             3
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODPB1        SETLL     KODTPB
     C     START1        TAG
     C     YPBUNI        READE     KODTPB                                 94
     C  N94              UPDATE    KODTPBR
     C   94              MOVE      *BLANKS       KPBSD
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     YPBUNI        READE     KODTPB                                 94
     C  N94              UPDATE    KODTPBR
     C  N94              MOVE      KPBSD         YPBSD
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY BASISRATER
     C   06              GOTO      START5
     C*** SØK FRA BASISRATER
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODPB3        SETLL     KODTPB
     C  N94YPBUNI        READE     KODTPB                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT BASISRATER
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODPB2        CHAIN     KODTPB                             33
     C  N33              DELETE    KODTPBR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DL'         KPBSD
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE BASISRATER
     C     START5        TAG
     C                   SETOFF                                       30
     C                   EXFMT     VARELI
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSSD5         CHAIN     STED2                              70
     C   70              SETON                                        30
     C   70              GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODPBK        CHAIN     KODTPB                             33
     C                   EXSR      MOVWPB
     C  N33              UPDATE    KODTPBR
     C   33              WRITE     KODTPBR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     KPBSD         COMP      '*DL'                                  98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVPBW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     KPBSD         COMP      '*DL'                                  98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       KPBSD
     C                   MOVE      *ZEROS        KPBBPR
     C                   MOVE      *ZEROS        KPBRPR
     C                   MOVE      *ZEROS        KPBBAN
     C                   MOVE      *ZEROS        KPBRAN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSSD
     C                   MOVE      *ZEROS        WSBPR
     C                   MOVE      *ZEROS        WSRPR
     C                   MOVE      *ZEROS        WSBAN
     C                   MOVE      *ZEROS        WSRAN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVPBW        BEGSR
     C***********************************************
     C                   MOVE      KPBSD         WSSD
     C                   MOVE      KPBBPR        WSBPR
     C                   MOVE      KPBRPR        WSRPR
     C                   MOVE      KPBBAN        WSBAN
     C                   MOVE      KPBRAN        WSRAN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWPB        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      YPBUNI        KPBUNI
     C                   MOVE      WSSD          KPBSD
     C                   MOVE      *BLANKS       KPBXXX
     C                   END
     C*
     C                   MOVE      WSBPR         KPBBPR
     C                   MOVE      WSRPR         KPBRPR
     C                   MOVE      WSBAN         KPBBAN
     C                   MOVE      WSRAN         KPBRAN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODPBK        KLIST
     C                   KFLD                    YPBUNI
     C                   KFLD                    WSSD
     C     KODPB1        KLIST
     C                   KFLD                    YPBUNI
     C                   KFLD                    W2SD
     C     KODPB2        KLIST
     C                   KFLD                    YPBUNI
     C                   KFLD                    KPBSD
     C     KODPB3        KLIST
     C                   KFLD                    YPBUNI
     C                   KFLD                    YPBSD
     C*
     C                   MOVE      'PB'          YPBUNI            2
     C*
     C                   ENDSR
     C*
