********************************************************************
      *   PRINT av Merkelapper i PDF
     FKODTFS    IF   E           K DISK
     FSAMLB     IF   E           K DISK
     FHEADF     IF   E           K DISK
     FHEAD19    IF   E           K DISK
     F                                     RENAME(HEADFR:HEAD19R)
     FDOKEF     IF   E           K DISK
     FDOKEM     IF   E           K DISK
     FSYEF14MP  O    E             PRINTER
     D                 DS
     D  DFROC1                 1      2  0
     D  XFROC1                 1      2
     D                 DS
     D  HEHAWB12               1     12
     D  SMSDF                  1      3
     D  HEHAWB                 4     12
     D                 DS
     D  DFROC2                 1      2  0
     D  XFROC2                 1      2
     D                 DS
     D  DFROC3                 1      2  0
     D  XFROC3                 1      2
     D                 DS
     D  HEGN                   1     15
     D  HEGN11                 5     15
     D  HEGN3                  5      7
     D  HEGN8                  8     15
     D                 DS
     D  STRE16                 1     16
     D                 DS
     D  HEGN12                 1     12
     D  HEGN3B                 1      3
     D  BINDE                  4      4
     D  HEGN8B                 5     12
      *
     C                   EXSR      INIT
      *
     c     samlast       ifne      'J'
     c                   exsr      singel
     c                   else
     c                   exsr      samle
     c                   end
     c                   seton                                        lr
     c                   return
      ********************************************************************************
     c     singel        begsr
      ********************************************************************************
     c     dokefk        chain     dokef                              33
     c  N33headfk        chain     headf                              33
     c     *in33         ifeq      '0'
     c                   do        dfntt
     c                   add       1             n5                5 0
N02  C                   eval      ROUT1= DFROA1 + '  '
N02  c                             +DFROB1 + ' / ' + XFROC1
     c     dfroa2        ifne      *blanks
N02  C                   eval      ROUT2= DFROA2 + '  '
N02  c                             +DFROB2 + ' / ' + XFROC2
     c                   end
     c     dfroa3        ifne      *blanks
N02  C                   eval      ROUT3= DFROA3 + '  '
N02  c                             +DFROB3 + ' / ' + XFROC3
     c                   end
     c                   z-add(h)  DFVKTT        DFVKTTH
     c                   move      *zeros        stre16
     c                   movel     hegn11        stre16
     c                   move      n5            stre16
     c                   movel     hegn3         hegn3b
     c                   movel     hegn8         hegn8b
     c                   movel     hesdf         hesdf3
     c                   movel     hesdt         hesdt3
     c                   movel     hegn3         kfsfnr
     c     kodtfsk       chain     kodtfs                             44
     c  N44              movel     kfsnav        fly25
     c                   write     label
     c                   write     box
     c                   end
     c                   end
     c                   endsr
      ********************************************************************************
     c     samle         begsr
      ********************************************************************************
     c     dokeMk        chain     dokem                              33
     c  n33samlk         chain     samlb                              33
     C     *IN33         IFEQ      '0'
     c     USAML         SETLL     head19
     C     *IN33         DOWEQ     '0'
     c     USAML         READE     head19                                 33
     c     *in33         ifeq      '0'
     c                   do        hent
     c                   add       1             n5                5 0
N02  C                   eval      ROUT1= DFROA1 + '  '
N02  c                             +DFROB1 + ' / ' + XFROC1
     c     dfroa2        ifne      *blanks
N02  C                   eval      ROUT2= DFROA2 + '  '
N02  c                             +DFROB2 + ' / ' + XFROC2
     c                   end
     c     dfroa3        ifne      *blanks
N02  C                   eval      ROUT3= DFROA3 + '  '
N02  c                             +DFROB3 + ' / ' + XFROC3
     c                   end
     c                   movel     smsdf         hesdf3
     c                   movel     smsd          hesdt3
     c                   z-add(h)  DFVKTT        DFVKTTH
     c                   move      *zeros        stre16
     c                   movel     hegn11        stre16
     c                   move      n5            stre16
     c                   movel     hegn3         hegn3b
     c                   movel     hegn3         kfsfnr
     c     kodtfsk       chain     kodtfs                             44
     c  N44              movel     kfsnav        fly25
     c                   movel     hegn8         hegn8b
     c                   write     label
     c                   write     labelm
     c                   write     box
     c                   end
     c                   end
     c                   end
     c                   end
     c                   endsr
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
     C                   PARM                    ULOPE             3
     C                   PARM                    USAML             6
     c     USAML         ifne      *blanks
     c     USAML         andne     *zeros
     c                   move      'J'           samlast           1
     c                   end
     C     DOKEFK        KLIST
     C                   KFLD                    DFRI
     C                   KFLD                    DFAVD
     C                   KFLD                    DFOPD
     C                   KFLD                    DFLOP
     C                   MOVE      'F'           DFRI              1
     C                   MOVE      uavd          dfavd
     C                   MOVE      uopd          dfopd
     C                   MOVE      ulope         dflop
     C     SAMLK         KLIST
     C                   KFLD                    DFSD
     C                   KFLD                    DFLNR
     C     KODTFSK       KLIST
     C                   KFLD                    KFSUNI
     C                   KFLD                    KFSFNR
     C                   MOVE      'FS'          KFSUNI
     C     DOKEMK        KLIST
     C                   KFLD                    DFRI2
     C                   KFLD                    DFSD
     C                   KFLD                    DFLNR
     C                   MOVE      'M'           DFRI2             1
     C                   MOVEL     USAML         DFSD
     C                   MOVE      USAML         DFLNR
     C     HEADFK        KLIST
     C                   KFLD                    DFAVD
     C                   KFLD                    DFOPD
     c                   move      '-'           BINDE
     C                   ENDSR
