      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE soner                     ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 90 95-97 ***
      ***********************************************************
      *
     FAIRSONE   UF A E           K DISK
     FSTED2D    IP   E           K DISK
     D                 DS
     D  ST2KOD                 1      5
     D  ST2K01                 1      1
     D  ST2K02                 2      2
     D  ST2K03                 3      3
     D  ST2K04                 4      4
     D  ST2K05                 5      5
     C*
     C                   EXSR      INIT
     C*
     C     st2k05        ifeq      ' '
     C     st2k04        andeq     ' '
     C     st2k03        andge     'A'
     C     st2k03        andle     'Z'
     C     st2k02        andge     'A'
     C     st2k02        andle     'Z'
     C     st2k01        andge     'A'
     C     st2k01        andle     'Z'
     c                   move      st2kod        airpor
     c                   move      st2lk         airlan
     c                   move      *blanks       airson
     c     airlin        ifeq      74
     c     airlin        oreq      57
     c                   movel     st2sol        airson
     c                   end
     C     key           chain     airsone                            33
     C   33              WRITE     airsoner
     C                   end
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UFLY              3 0
     c                   z-add     ufly          AIRLIN            3 0
     c     key           klist
     c                   kfld                    AIRLIN
     c                   kfld                    AIRLAN
     c                   kfld                    AIRPOR
     C                   ENDSR
     C*
