********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 LAGRE OGSA KODE A  ....
10XXX * 02 SH  PTF10 ENDRET Å TIL A I VARIABELNAVN IKKE MERKET
********************************************************************
     FDOKOTHM   UF A E           K DISK
     FSYEF10FO  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
      *
     D FBAREA          DS
     D  WSCLOC               382    383B 0
      *
     D                 DS
     D  A01                    1      9    DIM(9)
     D  A01A                   1      1
     D  A01B                   2      2
     D  A01C                   3      3
     D  A01D                   4      4
     D  A01E                   5      5
     D  A01F                   6      6
     D  A01G                   7      7
     D  A01H                   8      8
     D  A01I                   9      9
     D                 DS
     D  A02                    1     18    DIM(9)
     D  A02A                   1      2
     D  A02B                   3      4
     D  A02C                   5      6
     D  A02D                   7      8
     D  A02E                   9     10
     D  A02F                  11     12
     D  A02G                  13     14
     D  A02H                  15     16
     D  A02I                  17     18
     D                 DS
     D  A03                    1      9    DIM(9)
     D  A03A                   1      1
     D  A03B                   2      2
     D  A03C                   3      3
     D  A03D                   4      4
     D  A03E                   5      5
     D  A03F                   6      6
     D  A03G                   7      7
     D  A03H                   8      8
     D  A03I                   9      9
     D                 DS
     D  A04                    1     99  2 DIM(9)
     D  A04A                   1     11  2
     D  A04B                  12     22  2
     D  A04C                  23     33  2
     D  A04D                  34     44  2
     D  A04E                  45     55  2
     D  A04F                  56     66  2
     D  A04G                  67     77  2
     D  A04H                  78     88  2
     D  A04I                  89     99  2
      *
     C     OTHKEY        KLIST
     C                   KFLD                    WSD
     C                   KFLD                    WLNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    PSD
     C                   PARM                    PLNR
     C                   PARM                    PFLAG             1 0
      *
     C     *LIKE         DEFINE    DOSD          PSD
     C     *LIKE         DEFINE    DOLNR         PLNR
     C     *LIKE         DEFINE    DOSD          WSD
     C     *LIKE         DEFINE    DOLNR         WLNR
     C                   Z-ADD     1             X                 3 0
     C                   Z-ADD     0             WX                3 0
     C                   MOVEA     *ZEROS        A04
     C     PFLAG         IFEQ      1
     C                   MOVE      *ON           *IN88
     C                   ENDIF
      *
     C                   MOVE      PSD           WSD
     C                   Z-ADD     PLNR          WLNR
      * Sjekker først om det finnes noen verdier å vise
     C     OTHKEY        SETLL     DOKOTHM
     C     OTHKEY        READE(N)  DOKOTHM                                90
     C     *IN90         DOWEQ     *OFF
     C                   MOVEA     DO1322        A01(X)
     C                   MOVEA     DO1331        A02(X)
     C                   MOVEA     DO1332        A03(X)
     C                   MOVEA     DO1333        A04(X)
     C                   ADD       1             X
     C     X             IFGT      9
     C                   LEAVE
     C                   ENDIF
     C     OTHKEY        READE(N)  DOKOTHM                                90
     C                   ENDDO
      * Viser bilde
     C     TAG01         TAG
     C                   EXFMT     BILDE1
      * F4=Søk kode
     C     *IN04         IFEQ      *ON
     C     WSCLOC        DIV       256           LINNBR            3 0
     C                   MOVEL     'AIROTH'      XTYPE
     C                   CALL      'SYKUKD'
     C                   PARM                    XTYPE            10
     C                   PARM      ' '           XUPDAT            1
     C                   PARM                    XKODE             5
     C     LINNBR        IFGT      3
     C     LINNBR        ANDLT     20
     C     LINNBR        SUB       3             X
     C     XKODE         IFNE      *BLANKS
     C                   MOVEL     XKODE         A02(X)
     C                   ENDIF
     C                   GOTO      TAG01
     C                   ENDIF
     C                   ENDIF
     C     *IN12         CABEQ     *ON           SLUTT
     C     *IN88         CABEQ     *ON           SLUTT
      * Enter medfører oppdatering, først sletting og deretter WRITE
     C     OTHKEY        SETLL     DOKOTHM
     C     OTHKEY        READE     DOKOTHM                                90
     C     *IN90         DOWEQ     *OFF
     C                   DELETE    DOKOTR
     C     OTHKEY        READE     DOKOTHM                                90
     C                   ENDDO
      * Skriver så alle poster til fil.
      * Skriver også blanke linjer, men ikke når det er bare blanke
     C                   Z-ADD     1             X
     C                   Z-ADD     0             WX
     C                   DO        9
     C     A01(X)        IFNE      *BLANKS
     C                   Z-ADD     X             WX
     C                   ENDIF
     C                   ADD       1             X
     C                   ENDDO
     C                   Z-ADD     1             X
     C     WX            IFGT      0
     C                   DO        9
     C                   MOVE      WSD           DOSD
     C                   Z-ADD     WLNR          DOLNR
     C                   MOVEA     A01(X)        DO1322
     C                   MOVEA     A02(X)        DO1331
S01  C*                  MOVEL     'C'           DO1332
N01  C                   MOVEL     A03(X)        DO1332
     C                   MOVEA     A04(X)        DO1333
     C     A01(X)        IFNE      *BLANKS
     C     A02(X)        ANDNE     *BLANKS
     C                   WRITE     DOKOTR
     C                   ENDIF
     C     X             IFGE      WX
     C                   LEAVE
     C                   ENDIF
     C                   ADD       1             X
     C                   ENDDO
     C                   ENDIF
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
