     FSYEF14MTP O    E             PRINTER
     c                   write     box
     c                   seton                                        lr
     c                   return
