     FDOKOTH    IF   E             DISK
     C     *LIKE         DEFINE    DOAVD         PAVD
     C     *LIKE         DEFINE    DOOPD         POPD
     C     1             CHAIN     DOKOTH                             51
     C                   Z-ADD     1             PAVD
     C                   Z-ADD     1             POPD
     C                   Z-ADD     0             PFLAG
     C                   CALL      'SYEF10O'
     C                   PARM                    PAVD
     C                   PARM                    POPD
     C                   PARM                    PFLAG             1 0
     C                   SETON                                        LR
