      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE         ***
      ***                   MERKELAPP                          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-97                             ***
      ************************************************************
     FKODTP     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FSYEFPMFM  CF   E             WORKSTN
     D                UDS
     D  UAVD                  15     18
     D*
     D* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     D* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
     D  XBLA1                 70    256
     D  XBLA2                257    510
     D  UPRT2                601    610
     D  UPT2                 611    620
     I*
     C*
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPLNR
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSAVD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   MOVE      '0'           UIN01
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      UAVD          WSAVD
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C                   MOVE      *BLANKS       XBLA1
     C                   MOVE      *BLANKS       XBLA2
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       3099
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99              Z-ADD     2             WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT2
     C  N99              MOVE      KOPTY         UPT2
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C*
     C                   MOVE      WSAVD         UAVD
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT2
     C                   END
     C     UPRT2         IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT2
     C                   END
     C     UPT2          IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT2
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
