      *
      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE DIVERSE GEBYRER (FLY)      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01-11 13-26                       ***
      *** LEDIGE INDIKATORER 27-29 31-99                       ***
      ************************************************************
      *
     FKODTDIS   UF A E           K DISK
     FSYEF24FM  CF   E             WORKSTN
     C*
     C                   MOVE      'DISPU'       KDSUNI
     C     KDSUNI        CHAIN     KODTDIS                            30
     C                   MOVE      KDSBL1        WSSBL1
     C                   MOVE      KDSBL2        WSSBL2
     C                   MOVE      KDSPRO        WSSPRO
     C                   MOVE      KDSBL3        WSSBL3
     C                   MOVE      KDSBL4        WSSBL4
     C                   MOVE      KDSBL5        WSSBL5
     C*
     C                   EXFMT     BILDE01
     C  N12              DO
     C                   MOVE      WSSBL1        KDSBL1
     C                   MOVE      WSSBL2        KDSBL2
     C                   MOVE      WSSPRO        KDSPRO
     C                   MOVE      WSSBL3        KDSBL3
     C                   MOVE      WSSBL4        KDSBL4
     C                   MOVE      WSSBL5        KDSBL5
     C   30              WRITE     KODTDISR
     C  N30              UPDATE    KODTDISR
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
