      *
      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE LOGO FRAKTBREV             ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                 ***
      *** LEDIGE INDIKATORER 27-98                             ***
      ************************************************************
     FHLOGO     UF A E           K DISK
     FELOGO     UF A E           K DISK
     FSYEF16FM  CF   E             WORKSTN
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C*
     C   03              GOTO      SLUTT
     C*
     C                   SELECT
     C     WSFNR         WHENNE    *ZEROS
     C                   CLEAR                   *IN27
     C     WSFNR         CHAIN     ELOGO                              99
     C  N99              DO
     C                   MOVE      ELFNR         WSFNR
     C                   MOVE      ELT1          WST1
     C                   MOVE      ELT2          WST2
     C                   MOVE      ELT3          WST3
     C                   MOVE      ELT4          WST4
     C                   MOVE      ELT5          WST5
     C                   MOVE      ELT6          WST6
     C                   ENDDO
     C     WSFNR         WHENEQ    *ZEROS
     C                   MOVE      *ON           *IN27
     C     WSTAB         CHAIN     HLOGO                              99
     C  N99              DO
     C                   MOVE      HLTABH        WSTAB
     C                   MOVE      HLT1          WST1
     C                   MOVE      HLT2          WST2
     C                   MOVE      HLT3          WST3
     C                   MOVE      HLT4          WST4
     C                   MOVE      HLT5          WST5
     C                   MOVE      HLT6          WST6
     C                   ENDDO
     C                   ENDSL
     C*
     C   99              DO
     C                   MOVE      *BLANKS       WST1
     C                   MOVE      *BLANKS       WST2
     C                   MOVE      *BLANKS       WST3
     C                   MOVE      *BLANKS       WST4
     C                   MOVE      *BLANKS       WST5
     C                   MOVE      *BLANKS       WST6
     C                   END
     C*
     C                   EXFMT     BILDE02
     C*
     C  N12              DO
     C                   SELECT
     C     *IN27         WHENEQ    *OFF
     C                   MOVE      WSFNR         ELFNR
     C                   MOVE      WST1          ELT1
     C                   MOVE      WST2          ELT2
     C                   MOVE      WST3          ELT3
     C                   MOVE      WST4          ELT4
     C                   MOVE      WST5          ELT5
     C                   MOVE      WST6          ELT6
     C  N99              UPDATE    ELOGOR
     C   99              WRITE     ELOGOR
     C     *IN27         WHENEQ    *ON
     C                   MOVE      WSTAB         HLTABH
     C                   MOVE      WST1          HLT1
     C                   MOVE      WST2          HLT2
     C                   MOVE      WST3          HLT3
     C                   MOVE      WST4          HLT4
     C                   MOVE      WST5          HLT5
     C                   MOVE      WST6          HLT6
     C  N99              UPDATE    HLOGOR
     C   99              WRITE     HLOGOR
     C                   ENDSL
     C                   ENDDO
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
