      *
      ***********************************************************
      *** PROGRAM SKAL VISE FLYFRAKT-PRISER                   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-04 06 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-90 95-97 99                   ***
      ***********************************************************
      *
     FKODTPF    IF   E           K DISK
     FSYEF10FA  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODPF1        SETLL     KODTPF
     C     START1        TAG
     C     YPFUNI        READE     KODTPF                                 94
     C  N94USDT          COMP      KPFSD                              9494
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   EXSR      TSTNET
     C                   WRITE     SUBFIL
     C     YPFUNI        READE     KODTPF                                 94
     C  N94USDT          COMP      KPFSD                              9494
     C  N94USDF          COMP      KPFSDF                             9494
     C  N94              END
     C                   END
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   12              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** SØK FRA FLYFRAKT-PRISER
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C                   GOTO      START3
     C*
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODPF1        KLIST
     C                   KFLD                    YPFUNI
     C                   KFLD                    W2SDF
     C                   KFLD                    W2SD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    USDF              3
     C                   PARM                    USDT              3
     C                   MOVE      USDT          W2SD
     C                   MOVE      USDF          W2SDF
     C*
     C                   MOVE      'PF'          YPFUNI            2
     C*
     C                   MOVE      'DIV1121'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     4             XMSGL             4 0          LENGDE PÅ MELDING
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    WSMSG1            4
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C                   MOVE      'DIV1122'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     4             XMSGL
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    WSMSG2            4
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     TSTNET        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        DIFFM
     C                   MOVE      *ZEROS        DIFFN
     C                   MOVE      *ZEROS        DIFF45
     C                   MOVE      *ZEROS        DIFF10
     C                   MOVE      *ZEROS        DIFF30
     C                   MOVE      *ZEROS        DIFF50
     C                   MOVE      *ZEROS        DIFF1
     C     KPFFK         IFEQ      'N'
     C     KPFIM         SUB       KPFFM         DIFFM
     C                   ELSE
     C     KPFIM         MULT      KPFFM         WORK             15 4
     C     WORK          DIV(H)    100           DIFFM
     C                   END
     C*
     C     KPFFK2        IFEQ      'N'
     C     KPFIN         SUB       KPFFN         DIFFN
     C                   ELSE
     C     KPFIN         MULT      KPFFN         WORK
     C     WORK          DIV(H)    100           DIFFN
     C                   END
     C     KPFFK3        IFEQ      'N'
     C     KPFI45        SUB       KPFF45        DIFF45
     C                   ELSE
     C     KPFI45        MULT      KPFF45        WORK
     C     WORK          DIV(H)    100           DIFF45
     C                   END
     C     KPFFK4        IFEQ      'N'
     C     KPFI10        SUB       KPFF10        DIFF10
     C                   ELSE
     C     KPFI10        MULT      KPFF10        WORK
     C     WORK          DIV(H)    100           DIFF10
     C                   END
     C     KPFFK5        IFEQ      'N'
     C     KPFI30        SUB       KPFF30        DIFF30
     C                   ELSE
     C     KPFI30        MULT      KPFF30        WORK
     C     WORK          DIV(H)    100           DIFF30
     C                   END
     C     KPFFK6        IFEQ      'N'
     C     KPFI50        SUB       KPFF50        DIFF50
     C                   ELSE
     C     KPFI50        MULT      KPFF50        WORK
     C     WORK          DIV(H)    100           DIFF50
     C                   END
     C     KPFFK6        IFEQ      'N'
     C     KPFI1         SUB       KPFF1         DIFF1
     C                   ELSE
     C     KPFI1         MULT      KPFF1         WORK
     C     WORK          DIV(H)    100           DIFF1
     C                   END
     C                   ENDSR
