      *
      ***********************************************************
      *** VEDLIKEHOLD AV ANBEFALT ROUTING FLY                ***
      ***********************************************************
     FKODTAR    UF A E           K DISK
     FSTED2     IF   E           K DISK
     FSYEF11FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  WSSD                   1      3
     D  WSSD5                  1      5
     D                 DS
     D  WSSDF                  1      3
     D  WSSDF5                 1      5
     D                 DS
     D  WSRA1                  1      3
     D  WSRA15                 1      5
     D                 DS
     D  WSRA2                  1      3
     D  WSRA25                 1      5
     D                 DS
     D  WSRA3                  1      3
     D  WSRA35                 1      5
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2SDF         YARSDF            3
     C                   MOVE      W2SD          YARSD             3
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODAR1        SETLL     KODTAR
     C     START1        TAG
     C     YARUNI        READE     KODTAR                                 94
     C   94              MOVE      *BLANKS       KARRB1
     C   94              MOVE      *BLANKS       WSNR
     C  N94              UPDATE    KODTARR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        13
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     YARUNI        READE     KODTAR                                 94
     C  N94              UPDATE    KODTARR
     C  N94              MOVE      KARSD         YARSD
     C  N94              MOVE      KARSDF        YARSDF
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY ANBEFALT ROUTING
     C   06              GOTO      START5
     C*** SØK FRA ANBEFALT ROUTING
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODAR3        SETLL     KODTAR
     C  N94YARUNI        READE     KODTAR                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT ANBEFALT ROUTING
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODAR2        CHAIN     KODTAR                             33
     C  N33              DELETE    KODTARR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DLT  '      KARRB1
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE ANBEFALT ROUTING
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       30
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSSDF5        CHAIN     STED2                              71
     C   71              SETON                                        30
     C   71              MOVE      'SPS0030'     MSGNR
     C   71              GOTO      SLTB
     C     WSSD5         CHAIN     STED2                              70
     C   70              SETON                                        30
     C   70              MOVE      'SPS0030'     MSGNR
     C   70              GOTO      SLTB
     C                   END
     C*
     C     WSRA15        CHAIN     STED2                              69
     C   69              SETON                                        30
     C   69              MOVE      'SPS0030'     MSGNR
     C   69              GOTO      SLTB
     C     WSRB1         COMP      *BLANKS                                68
     C   68              MOVE      'SPS0031'     MSGNR
     C   68              SETON                                        30
     C   68              GOTO      SLTB
     C*
     C     WSRA2         IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSRB2
     C                   ELSE
     C     WSRA25        CHAIN     STED2                              67
     C   67              SETON                                        30
     C   67              MOVE      'SPS0030'     MSGNR
     C   67              GOTO      SLTB
     C     WSRB2         COMP      *BLANKS                                66
     C   66              SETON                                        30
     C   66              MOVE      'SPS0031'     MSGNR
     C   66              GOTO      SLTB
     C                   END
     C*
     C     WSRA3         IFEQ      *BLANKS
     C                   MOVE      *BLANKS       WSRB3
     C                   ELSE
     C     WSRA35        CHAIN     STED2                              65
     C   65              MOVE      'SPS0030'     MSGNR
     C   65              SETON                                        30
     C   65              GOTO      SLTB
     C     WSRB3         COMP      *BLANKS                                64
     C   64              SETON                                        30
     C   64              MOVE      'SPS0031'     MSGNR
     C   64              GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODARK        CHAIN     KODTAR                             33
     C   33
     CAN 40
     CORN33
     CANN40              GOTO      SLTB
     C                   EXSR      MOVWAR
     C  N33              UPDATE    KODTARR
     C   33              WRITE     KODTARR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     KARRB1        COMP      '*DLT  '                               98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVARW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     KARRB1        COMP      '*DLT  '                               98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       KARSD
     C                   MOVE      *BLANKS       KARSDF
     C                   MOVE      *BLANKS       KARRA1
     C                   MOVE      *BLANKS       KARRB1
     C                   MOVE      *BLANKS       KARRA2
     C                   MOVE      *BLANKS       KARRB2
     C                   MOVE      *BLANKS       KARRA3
     C                   MOVE      *BLANKS       KARRB3
     C                   MOVE      *BLANKS       KARTXT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSSD
     C                   MOVE      *BLANKS       WSSDF
     C                   MOVE      *BLANKS       WSRA1
     C                   MOVE      *BLANKS       WSRB1
     C                   MOVE      *BLANKS       WSRA2
     C                   MOVE      *BLANKS       WSRB2
     C                   MOVE      *BLANKS       WSRA3
     C                   MOVE      *BLANKS       WSRB3
     C                   MOVE      *BLANKS       WSTXT
     C                   MOVE      *ZEROS        WSETD1
     C                   MOVE      *ZEROS        WSETA1
     C                   MOVE      *ZEROS        WSETD2
     C                   MOVE      *ZEROS        WSETA2
     C                   MOVE      *ZEROS        WSETD3
     C                   MOVE      *ZEROS        WSETA3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVARW        BEGSR
     C***********************************************
     C                   MOVE      KARSD         WSSD
     C                   MOVE      KARSDF        WSSDF
     C                   MOVE      KARRA1        WSRA1
     C                   MOVE      KARRB1        WSRB1
     C                   MOVE      KARRA2        WSRA2
     C                   MOVE      KARRB2        WSRB2
     C                   MOVE      KARRA3        WSRA3
     C                   MOVE      KARRB3        WSRB3
     C                   MOVE      KARTXT        WSTXT
     C                   MOVE      KAETD1        WSETD1
     C                   MOVE      KAETA1        WSETA1
     C                   MOVE      KAETD2        WSETD2
     C                   MOVE      KAETA2        WSETA2
     C                   MOVE      KAETD3        WSETD3
     C                   MOVE      KAETA3        WSETA3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWAR        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      YARUNI        KARUNI
     C                   MOVE      WSSD          KARSD
     C                   MOVE      WSSDF         KARSDF
     C                   END
     C*
     C                   MOVE      WSRA1         KARRA1
     C                   MOVE      WSRB1         KARRB1
     C                   MOVE      WSRA2         KARRA2
     C                   MOVE      WSRB2         KARRB2
     C                   MOVE      WSRA3         KARRA3
     C                   MOVE      WSRB3         KARRB3
     C                   MOVE      WSTXT         KARTXT
     C                   MOVE      WSETD1        KAETD1
     C                   MOVE      WSETA1        KAETA1
     C                   MOVE      WSETD2        KAETD2
     C                   MOVE      WSETA2        KAETA2
     C                   MOVE      WSETD3        KAETD3
     C                   MOVE      WSETA3        KAETA3
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODARK        KLIST
     C                   KFLD                    YARUNI
     C                   KFLD                    WSSDF
     C                   KFLD                    WSSD
     C     KODAR1        KLIST
     C                   KFLD                    YARUNI
     C                   KFLD                    W2SDF
     C                   KFLD                    W2SD
     C     KODAR2        KLIST
     C                   KFLD                    YARUNI
     C                   KFLD                    KARSDF
     C                   KFLD                    KARSD
     C     KODAR3        KLIST
     C                   KFLD                    YARUNI
     C                   KFLD                    YARSDF
     C                   KFLD                    YARSD
     C*
     C                   MOVE      'AR'          YARUNI            2
     C*
     C                   ENDSR
     C*
