      *
     FESPXREF   IF   E           K DISK
     FESPXREF1  IF   E           K DISK
     F                                     RENAME(ESPXREFR:ESPXREF1R)
     FKOFAST    IF   E           K DISK
     FSYES04D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27W2KODE        SETLL     ESPXREF
     C   27W2PROD        SETLL     ESPXREF1
     C  N27              READ      ESPXREF                                94
     C   27              READ      ESPXREF1                               94
      *
     C     *in94         DOWEQ     '0'
     C     KOFASK        CHAIN     KOFAST                             33
     c     *IN55         ifeq      '1'
     c                   eval      KFTXT = KFTXTE                               VISURL
     c                   end
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27              READ      ESPXREF                                94
     C   27              READ      ESPXREF1                               94
     C                   END
      *
      *
n01  c                   z-add     1             ZRECNO
     C     *IN29         IFEQ      '0'
     C     *IN94         ANDEQ     '0'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NEWREC
     C                   ELSE
     C                   WRITE     BOTREC
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *** LAGE NY
     C   06              DO
     C                   CALL      'SYFAKD'
     C                   PARM                    UTYP
     C                   PARM                    UUPDAT
     C                   PARM                    W2KODE
     C                   GOTO      START
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2KODE        ANDNE     *BLANKS
     C                   MOVE      W2KODE        UKOD
     C                   GOTO      SLUTT
     C                   END
     C     W2KODE        IFNE      *BLANKS
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     *in10         ifeq      '1'
     c     *IN55         ifeq      '1'
     c                   move      '0'           *IN55
     c                   else
     c                   move      '1'           *IN55                          VISURL
     c                   end
     C                   GOTO      START
     C                   END
     C     *in07         ifeq      '1'
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2PROD        IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C     *in09         ifeq      '1'
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
      * enter uten endring i toplinja...   opsjon ??
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      ESKODE        UKOD
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUPDAT            1
     C                   PARM                    UKOD
      * UUPDAT = ' '  ->  IKKE LOV Å VEDLIKEHOLDE KODER
     C     UUPDAT        COMP      ' '                                3131
      *
      *
     C                   MOVE      UKOD          W2KODE
     C     KOFASK        KLIST
     C                   KFLD                    UTYP
     C                   KFLD                    ESKODE
     C                   movel     'ESPEDPARM'   UTYP             10
     C     *LIKE         DEFINE    KFKOD         UKOD
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
