      *
      *** PROGRAM FOR UTSKRIFT AV ETIKETTER                   ***
      *
     FFIRM      IF   E           K DISK
     FSYET01FM  CF   E             WORKSTN
     FETIKETT   O    F   40        PRINTER OFLIND(*INOF)
     F                                     FORMLEN(6)
     F                                     FORMOFL(6)
     FKUNDL02   IP   E           K DISK
     C  N99              EXSR      INIT
     C  N99              SETON                                        99
     C  N12KJIAAR        IFGT      KJOP
     C     FIFIRM        IFEQ      FIRMA
     C     POSTNR        COMP      *ZEROS                                 44
     C                   EXCEPT    PETT
     C                   END
     C                   END
     C   12              SETON                                        LR
     C     INIT          BEGSR
     C                   READ      FIRM                                   33
     C     START         TAG
     C                   EXFMT     BILDE01
     C  N03
     CANN12              GOTO      START
     C                   ENDSR
     OETIKETT   E            PETT             02
     O                       KNAVN               35
     O          E            PETT             03
     O                       ADR1                35
     O          E            PETT             04
     O                       ADR2                35
     O          E            PETT             05
     O              N44      POSTNR               9
     O              N44      ADR3                35
     O               44      ADR3                29
