      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE UT      ***
      ***                   GODSLISTE                          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-97                             ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTH     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FSYEXC2FM  CF   E             WORKSTN
SV5  D*           DS
SV5  D*                                       1   20UDAG
SV5  D*                                       3   40UMND
SV5  D*                                       5   60UAAR
SV5  D*                                       1   60UDATO
     D                UDS
     D  UFIRM                  1      2
     D  KOVFIR                 3      4
     D  KOVPRO                13     13
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  KOPI                 100    100
     D  KOPI1                101    107  0
     D  KOPI2                108    114  0
     D  KOPI3                115    121  0
     D  KOPI4                122    128  0
     D  KOPI5                129    135  0
     D  KOPI6                136    142  0
     D  KOPI7                143    149  0
     D  KOPI8                150    156  0
     D  UPRT24               561    570
     D  UPT24                571    580
      *
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPLNR
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSAVD
     C     KODTHK        KLIST
     C                   KFLD                    WSHUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
      *
     C     *ENTRY        PLIST
     C                   PARM                    UJBKØ             1
     C                   PARM                    UIN03             1
     C                   PARM                    UIN04             1
     C                   PARM                    UIN01             1
     C                   MOVE      'J'           KOPI
     C                   MOVE      *ZEROS        KOPI1
     C                   MOVE      *ZEROS        KOPI2
     C                   MOVE      *ZEROS        KOPI3
     C                   MOVE      *ZEROS        KOPI4
     C                   MOVE      *ZEROS        KOPI5
     C                   MOVE      *ZEROS        KOPI6
     C                   MOVE      *ZEROS        KOPI7
     C                   MOVE      *ZEROS        KOPI8
     C                   MOVE      '0'           UIN01
     C                   MOVE      'N'           UJBKØ
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'W'           WSWUNI            1
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'H'           WSHUNI            1
     C                   MOVE      'SF'          WSFUNI            2
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
SV5  C*                    MOVE UDAY      UDAG
SV5  C*                    MOVE UMONTH    UMND
SV5  C*                    MOVE UYEAR     UAAR
     C*
     C     FIFIRM        CHAIN     FIRM                               99
     C                   READ      FIRM                                   99
     C                   MOVE      FIFIRM        UFIRM
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C  N99KODTHK        CHAIN     KODTH                              99
     C  N99              Z-ADD     24            WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
      * VIDERE ENDRING AV UPRT13/UPT13 UTEN MERKING
     C  N99              MOVE      KOPNVN        UPRT24
     C  N99              MOVE      KOPTY         UPT24
     C   99              GOTO      START
     C     WSSG          IFNE      'ALL'
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              GOTO      START
     C                   END
     C*
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSSG          USG
     C                   MOVE      WSJBK         UJBKØ
     C     KOHLS1        IFEQ      'L'                                                      TÅENDE')
     C                   MOVE      '0'           UIN03
     C                   ELSE
     C                   MOVE      '1'           UIN03
     C                   END
     C     KOH421        IFEQ      'J'
     C                   MOVE      '1'           UIN04
     C                   ELSE
     C                   MOVE      '0'           UIN04
     C                   END
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT24
     C                   END
     C*
     C     UPRT24        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT24
     C                   END
     C     UPT24         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT24
     C                   END
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
