      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE AVDELINGSOPPLYSNINGER     ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-86 90 95-97 ***
      ***********************************************************
      *
     FKODTP     UF   E           K DISK
     FKODTW     UF   E           K DISK
     FKODTA     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTV     uF A E           K DISK
     FSYFA28FI  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KOANVN                 1     33
     D  XDLT                   1      4
     D                 DS
     D  S0004                  1     35
     D  NODI10                 1     10
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2AAVD        YAAVD             4 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODTA1        SETLL     KODTA
     C     START1        TAG
     C                   READ      KODTA                                  94
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   MOVE      KOAAVD        KOVAVD
     C     KODTAw        CHAIN(n)  KODTw                              33
     C     KUNDfK        CHAIN     CUNDL01                            33
     C                   WRITE     SUBFIL
     C  N94              MOVE      KOAAVD        YAAVD
     C                   READ      KODTA                                  94
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   SETOFF                                       9998
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY AVDELING
     C   06              DO
     C                   MOVE      *ZEROS        WSAAVD
     C                   GOTO      START5
     C                   END
     C*** SØK FRA AVDELING
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94KODTA3        SETLL     KODTA
     C  N94              READ      KODTA                                  94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C  N98              GOTO      START
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE AVDELING
     C     START5        TAG
     C                   MOVE      *ZEROS        gmavd
     C                   CALL      'SYFA28'
     C                   PARM                    NEI
     C                   PARM                    NULAVD
     C                   PARM                    gmavd
     C                   GOTO      START3
     C*
     C*** SØK FRA AVDELING
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     C     W2AAVD        IFEQ      0
     C                   Z-ADD     1             W2AAVD
     C                   END
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       7             LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          MULT      2             XLIN
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 02 = endre
      *
     C     WSNR          IFEQ      '2'
     c                   seton                                        99
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   MOVE      'E'           MODE              1
     C                   CALL      'SYFA28'
     c                   parm                    nei
     C                   PARM                    kovavd
     C                   PARM                    nulavd            4 0
     C                   MOVE      kovavd        W2AAVD
     C                   GOTO      SLHENT
     C                   END
      *
      *
      * 03 = kopiere
      *
     C     WSNR          IFEQ      '3'
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     C                   exsr      kopisr
     C                   GOTO      SLHENT
     C                   END
      *
      * 04 = sletting
      *
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     c                   update    subfil
     c                   exsr      delsr
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C   99              SETOFF                                       98
     C                   Z-add     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     delsr         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     VAREL3
     C   23              DO
     C     KODTDE        CHAIN     kodtv                              33
     C  N33              DELETE    kovr
     C     KODTAw        CHAIN     KODTw                              33
     C  N33              DELETE    kowr
     C                   END
     C                   SETOFF                                       33
     C     KODTAP        SETLL     KODTP
     C     *IN(33)       DOWEQ     '0'
     C     KODTAP        READE     KODTP                                  33
     C     *IN(33)       IFEQ      '0'
     C                   DELETE    KOPR
     C                   END
     C                   END
     C                   MOVE      kovavd        W2AAVD
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     kopisr        BEGSR
     C***********************************************
     C                   SETON                                        99
     c                   setoff                                       70
     C                   WRITE     WINDOWSZ
     c     stkopi        tag
     C                   EXFMT     BILDE01
     C                   SETOFF                                       3070
     c   12              goto      utkopi
      *
      * TIL AVDELING MÅ VÆRE OPPRETTET
      *
     c     kodtat        chain     kodta                              70
     c     *in(70)       ifeq      '1'
     c                   move      'SHU0987'     msgnr
     c                   seton                                        30
     c                   goto      stkopi
     c                   end
      *
      * FRA OG TIL KAN IKKE VÆRE LIKE
      *
     c     kovavd        IFEQ      WSAVDT
     c                   SETON                                        3070
     c                   move      'SHU0988'     msgnr
     c                   goto      stkopi
     c                   end
      *
      * til avd kan ikke finnes fra før
      *
     c                   move      kovavd        gmavd             4 0
     c     kodtat2       chain(n)  KODTV                              33
     c     *in(33)       ifeq      '0'
     c     gmavdk        chain(n)  KODTV                              33
     c                   seton                                        3070
     c                   move      'SHU0989'     msgnr
     c                   goto      stkopi
     c                   end
     c     kodtde        chain(n)  KODTV                              33
     c     *in(33)       ifeq      '0'
     c                   move      wsavdT        kovavd
     C                   CALL      'SYFA28'
     C                   PARM                    NEI
     C                   PARM                    KOVAVD
     C                   PARM                    gmavd
     C                   MOVE      kovavd        W2AAVD
     c                   end
     C     utkopi        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTAK        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    WSAAVD            4 0
     C     KODTAT        KLIST
     C                   KFLD                    WSAUN2
     C                   KFLD                    WSavdt
     C     KODTAT2       KLIST
     C                   KFLD                    WSAUNi
     C                   KFLD                    WSavdt
     C     KODTA1        KLIST
     C                   KFLD                    WSAUN2
     C                   KFLD                    W2AAVD
     C     KODTA2        KLIST
     C                   KFLD                    WSAUN2
     C                   KFLD                    kovavd
     C     KODTAW        KLIST
     C                   KFLD                    WSAUNw
     C                   KFLD                    kovavd
     C     KODTAP        KLIST
     C                   KFLD                    WSAUNP
     C                   KFLD                    kovavd
     C     KODTde        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    kovavd
     C     gmavdk        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    gmavd
     C     KODTA3        KLIST
     C                   KFLD                    WSAUN2
     C                   KFLD                    YAAVD
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSAKNR            8 0
     C*
     C     KUNDFK        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
     C                   MOVE      'V'           WSAUNI            1
     C                   MOVE      'A'           WSAUN2            1
     C                   MOVE      'W'           WSAUNW            1
     C                   MOVE      'P'           WSAUNP            1
     C                   MOVE      'N'           nei               1
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
