      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE RATE CLASS CODE           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FRATCDF    UF A E           K DISK
     FSYFA74FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSSUBN               378    379B 0
     D                 DS
     D  RABESK                 1     30
     D  RABES7                 1      7
     C     *ENTRY        PLIST
     C                   PARM                    PLUKK             1
     C                   PARM                    WRCCDE            1
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2RACD        YSRACD            1
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W2RACD        SETLL     RATCDF
     C     START1        TAG
     C                   READ(N)   RATCDF                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      RATCDF                                 94
     C  N94              UPDATE    RATCDR
     C  N94              MOVE      RARACD        YSRACD
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   MOVE      *BLANKS       WSBESK
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94YSRACD        SETLL     RATCDF
     C  N94              READ(N)   RATCDF                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C     *IN03         CABEQ     '1'           SLUTT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSRACD        COMP      *BLANKS                                90
     C   90              MOVE      'BBA0098'     MSGNR
     C  N90WSRACD        CHAIN     RATCDF                             33
     C  N90
     CANN33              DO
     C                   UPDATE    RATCDR
     C                   SETON                                        90
     C                   MOVE      'BBA0099'     MSGNR
     C                   END
     C   90              SETON                                        30
     C                   END
     C*
     C     WSBESK        COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'BBA0100'     MSGNR
     C   89              SETON                                        30
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     WSRACD        CHAIN     RATCDF                             33
     C                   EXSR      MOVWSF
     C  N33              UPDATE    RATCDR
     C   33              WRITE     RATCDR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '1'                                          PLUKKE
     C     PLUKK         ANDEQ     'P'
     C                   MOVE      RARACD        WRCCDE
     C                   MOVE      *ON           *IN03
     C                   GOTO      SLHENT
     C                   ENDIF
     C     WSNR          IFEQ      '1'                                          PLUKKE
     C     PLUKK         ANDNE     'P'
     C                   MOVE      *BLANK        WSNR
     C                   UPDATE    SUBFIL
     C                   ENDIF
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     RABES7        COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSF
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     RABES7        COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSF
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSF         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      RARACD        WSRACD
     C                   EXFMT     VAREL3
     C  N12              DO
     C     WSRACD        CHAIN     RATCDF                             33
     C  N33              DELETE    RATCDR
     C                   EXSR      MOVB1
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       RARACD
     C                   MOVE      *BLANKS       RABESK
     C                   MOVEL     '*DELETE'     RABES7
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSRACD
     C                   MOVE      *BLANKS       WSBESK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      RARACD        WSRACD
     C                   MOVE      RABESK        WSBESK
     C                   SETON                                        40
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      WSRACD        RARACD
     C                   END
     C*
     C                   MOVE      WSBESK        RABESK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C                   ENDSR
     C*
