      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE LEVERANDØRERS KUNDER      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-86 95-97    ***
      ***********************************************************
      *
     FKUNKO     UF A E           K DISK
     FKUNKO1    IF   E           K DISK
     F                                     RENAME(KUNKOR:KUNKOR1)
     FKUNKO2    IF   E           K DISK
     F                                     RENAME(KUNKOR:KUNKOR2)
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FVADR      UF   E           K DISK
     FSYFA81FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KADR3                  1     30
     D  KADR3B                 6     30
     D  VAPNR1                 1      1
     D  VAPNR2                 2      2
     D  VAPNR3                 3      3
     D  VAPNR4                 4      4
     D                 DS
     D  W2PNR                  1      4
     D  W2PNR1                 1      1
     D  W2PNR2                 2      2
     D  W2PNR3                 3      3
     D  W2PNR4                 4      4
     D                 DS
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZ')
     D                 DS
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyz')
      *
     C                   EXSR      INIT
     C     UUKUN         IFNE      *ZEROS
     C                   GOTO      PLUKK
     C                   END
     C*
     C     CHOISE        TAG
     C                   Z-ADD     11            LINNBR
     C                   Z-ADD     17            POSNBR
     C                   EXFMT     BILDE1
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   SETOFF                                       9930
     C*
     C**  AVSLUTT
     C*
     C     *IN03         IFEQ      '1'
     C                   MOVE      *ZEROS        UUKUN
     C                   GOTO      SLUTT
     C                   END                                                    <*IN03
     C*
     C**  SØK
     C*
     C     *IN04         IFEQ      '1'
     C                   EXSR      SØKUNR
     C                   MOVE      KUNDE         KUKUN1
     C     KUNKEY        CHAIN     CUNDL01                            99
     C     *IN99         IFEQ      '1'
     C                   MOVE      *ZEROS        KUKUN1
     C                   SETOFF                                       99
     C                   GOTO      CHOISE
     C                   END                                                    <*IN99
     C                   END                                                    <*IN04
     C*
     C     PLUKK         TAG
     C     KUNKEY        CHAIN     CUNDL01                            35
     C     *IN35         IFEQ      '0'
     C                   MOVE      KNAVN         W1NAVN
     C                   ELSE
     C                   MOVE      '1'           *IN30
     C                   MOVE      'DIV2480'     MSGNR
     C                   GOTO      CHOISE
     C                   END                                                    <*IN35
     C*
     C     START         TAG
     C                   CLEAR                   SFKUN2
     C                   CLEAR                   SFINTN
     C                   CLEAR                   SFALFA
     C     STARTF        TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     *IN29         IFEQ      *ON
     C     SFKEY1        SETLL     KUNKO1
     C                   ELSE
     C     SFKEY2        SETLL     KUNKO2
     C                   ENDIF                                                  <*IN29
      *
     C     START1        TAG
     C                   DO        7
     C     NEXT          TAG
     C     *IN29         IFEQ      *ON
     C     KUKUN1        READE     KUNKO1                                 94
     C                   ELSE
     C     KUKUN1        READE     KUNKO2                                 94
     C                   ENDIF                                                  <*IN29
     C     *IN94         IFEQ      '0'
     C                   MOVE      KUKUN2        SFKUN2
     C                   MOVE      KUINTN        SFINTN
     C                   MOVE      KUALFA        SFALFA
     C                   MOVE      KUVADR        SFVADR
     C     KUNKE3        CHAIN     CUNDL01                            25
     C  N25              MOVEL     POSTNR        KADR3
     C  N25              MOVEL     ADR3          KADR3B
     C     SFVADR        IFNE      *ZEROS
     C     KUNK3V        CHAIN(N)  VADR                               25
     C  N25              MOVE      VADRNA        KNAVN
     C  N25              MOVEL     VADRN2        KADR3
     C                   END
     C     W2PNR         IFNE      *BLANKS
     C                   EXSR      TSTPNR
     C     PNROK         CABEQ     'N'           NEXT
     C                   END
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END                                                    <*IN94
     C  N94              ENDDO
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYKUNDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   Z-ADD     WSSUBN        XRECNO
     C                   EXFMT     BUNN
     C                   END
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C*
     C                   SETOFF                                       999830
     C*** AVSLUTT
     C     *IN03         IFEQ      '1'
     C                   MOVE      *ZEROS        UUKUN
     C                   GOTO      SLUTT
     C                   END                                                    <*IN03
     C*** FRISK OPP
     C     *IN05         IFEQ      '1'
     C                   GOTO      START
     C                   END                                                    <*IN05
     C     *IN10         IFEQ      '1'
     C                   MOVE      KUKUN1        XXKUN             8 0
     C                   CALL      'SYFA05'
     C                   PARM                    XXKUN
     C                   END                                                    <*IN10
     C*** LAGE
     C     *IN06         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   GOTO      START5
     C                   END                                                    <*IN06
     C*** SØK
     C     *IN08         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     24            POSNBR
     C                   GOTO      START6
     C                   END                                                    <*IN08
     C*
     C*** FORRIGE
     C     *IN12         IFEQ      '1'
     C                   GOTO      CHOISE
     C                   END                                                    <*IN12
     C*** BLA VIDERE
     C     *IN25         IFEQ      '1'
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C     *IN94         IFEQ      '0'
     C     *IN29         IFEQ      *ON
     C     SFKEY1        SETLL     KUNKO1
     C                   ELSE
     C     SFKEY2        SETLL     KUNKO2
     C                   ENDIF                                                  <*IN29
     C                   END                                                    <*IN94
     C     START4        TAG
     C     *IN94         IFEQ      '0'
     C     *IN29         IFEQ      *ON
     C                   READ      KUNKO1                                 94
     C                   ELSE
     C                   READ      KUNKO2                                 94
     C                   ENDIF                                                  <*IN29
     C                   GOTO      START1
     C                   END                                                    <*IN94
     C                   END                                                    <*IN25
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C     UUKUN         IFNE      *ZEROS
     C     WSNR          ANDEQ     '1'
     C                   GOTO      SLUTT
     C                   END
     C                   END                                                    <ZRECNO
     C     *IN98         IFEQ      '1'
     C     XRECNO        ANDNE     0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END                                                    <*IN98
     C                   GOTO      START3
     C***
     C*** NY
     C***
     C     START5        TAG
     C                   EXFMT     VARELI
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C   03              MOVE      *ZEROS        UUKUN
     C   03              GOTO      SLUTT
     C   04              DO
     C     POSNBR        IFLT      35
     C                   EXSR      SØKUNR
     C                   MOVE      KUNDE         WSKUN2
     C                   ELSE
     C                   EXSR      SØKVAD
     C                   MOVE      UADRNR        WSVADR
     C                   END
     C                   END
     C                   MOVEA     '00000'       *IN(86)
     C                   SETOFF                                           30
     C     *IN12         IFEQ      '1'
     C                   EXSR      MOVBWS
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   END                                                    <*IN12
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C     *IN40         IFEQ      *ON
     C                   SETOFF                                       40
     C                   GOTO      START3
     C                   ELSE
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   GOTO      START5
     C                   ENDIF                                                  <*IN40
     C*** SØK FRA AVDELING
     C     START6        TAG
     C                   EXFMT     VAREL2
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     *IN12         IFNE      '1'
     C                   MOVE      WSKUN2        SFKUN2
     C                   MOVE      WSINTN        SFINTN
     C                   MOVE      WSALFA        SFALFA
     C                   MOVE      WSPNR         W2PNR
     C     WSALFA        IFNE      *BLANKS
     C                   MOVE      *ON           *IN29
     C                   ELSE
     C                   MOVE      *OFF          *IN29
     C                   ENDIF                                                  <WSALFA
     C                   GOTO      STARTF
     C                   END                                                    <*IN12
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TSTPNR        BEGSR
     C***********************************************
     C* TEST KUN NÅR W2PNR/YPNR ULIK BALNK
     C                   MOVE      'N'           PNROK             1
     C     W2PNR1        IFNE      ' '
     C     W2PNR1        ANDNE     VAPNR1
     C                   GOTO      UTPNR
     C                   END
     C     W2PNR2        IFNE      ' '
     C     W2PNR2        ANDNE     VAPNR2
     C                   GOTO      UTPNR
     C                   END
     C     W2PNR3        IFNE      ' '
     C     W2PNR3        ANDNE     VAPNR3
     C                   GOTO      UTPNR
     C                   END
     C     W2PNR4        IFNE      ' '
     C     W2PNR4        ANDNE     VAPNR4
     C                   GOTO      UTPNR
     C                   END
      * ALLE TESTER BESTÅTT..
     C                   MOVE      'J'           PNROK
     C*
     C     UTPNR         ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*          N40 = NY
     C*           40 = ENDRING
     C*
     C*  TEST FOR GYLDIG KUNDE
     C*
     C     KUNKE2        CHAIN     CUNDL01                            30
     C   30              DO
     C                   MOVE      'TRO0158'     MSGNR
     C                   Z-ADD     06            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <WSSK
     C*
     C*
     C     WSKEY         CHAIN     KUNKO                              33
     C*
     C*  TEST OM KUNDE FINNES    VED      NY
     C*
     C     *IN40         IFEQ      '0'
     C     *IN33         ANDEQ     '0'
     C                   MOVE      'TRO0157'     MSGNR
     C                   Z-ADD     025           POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
     C*
     C*
     C*
     C*
     C*  TEST OM KUNDE IKKE FINS VED ENDRING
     C*
     C     *IN40         IFEQ      '1'
     C     *IN33         ANDEQ     '1'
     C                   MOVE      'TRO0157'     MSGNR
     C                   Z-ADD     25            POSNBR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB
     C                   END                                                    <*IN33
      *
      * TESTER OM VAREADRESSE FINNES VED VADR ULIK 0
      *
     C     WSVADR        IFNE      *ZEROS
     C     WSKEYV        CHAIN(N)  VADR                               30
     C   30              DO
     C                   MOVE      'SHU0520'     MSGNR
     C                   Z-ADD     35            POSNBR
     C                   GOTO      SLTB
     C                   END                                                    <*IN30
     C                   END                                                    <WSVADR
     C     WSALFA        IFEQ      *BLANKS
     C                   MOVEL     SONAVN        WSALFA
     C                   END
     C*
     C                   EXSR      MOVWKA
     C     *IN33         IFEQ      '1'
     C                   WRITE     KUNKOR
     C                   ELSE
     C                   UPDATE    KUNKOR                               38
     C                   END                                                    <*IN33
     C  N33KUKUN1        IFEQ      KUKUN2
     C     KUVADR        ANDNE     *ZEROS
     C     KUNK3V        CHAIN     VADR                               44
     C                   MOVE      KUINTN        VAKURE
     C  N44              UPDATE    VADRR
     C                   END
     C*
     C                   EXSR      MOVWSF
     C     KUNKE3        CHAIN     CUNDL01                            25
     C  N25              MOVEL     POSTNR        KADR3
     C  N25              MOVEL     ADR3          KADR3B
     C     SFVADR        IFNE      *ZEROS
     C     KUNK3V        CHAIN(N)  VADR                               25
     C  N25              MOVE      VADRNA        KNAVN
     C  N25              MOVEL     VADRN3        KADR3
     C                   END
     C     *IN40         IFEQ      '1'
     C                   UPDATE    SUBFIL
     C                   ELSE
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   END                                                    <*IN40
     C                   WRITE     SUBCTL
     C                   EXSR      MOVBWS
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   ENDDO
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              4 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C*
     C     WSNR          IFEQ      '1'
     C                   MOVE      SFKUN2        UUKUN
     C                   GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     SFINTN        IFEQ      '*DE'
     C                   MOVE      'SPS0029'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   END                                                    <SFFRAN
     C                   EXSR      CHGST
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLHENT
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR
     C*
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     SFINTN        IFEQ      '*DE'
     C                   MOVE      'SPS0029'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLHENT
     C                   END                                                    <SFFRAN
     C                   EXSR      DLTST
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLHENT
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR
     C                   ENDDO
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTST         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   MOVE      SFINTN        KUINTN
     C                   MOVE      SFKUN2        KUKUN2
     C                   EXFMT     VAREL3
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     *IN12         IFEQ      '0'
     C     SFKEY         CHAIN     KUNKOR                             33
     C  N33              DELETE    KUNKOR
     C  N33KUKUN1        IFEQ      KUKUN2
     C     KUVADR        ANDNE     *ZEROS
     C     KUNK3V        CHAIN     VADR                               44
     C                   MOVE      *BLANKS       VAKURE
     C  N44              UPDATE    VADRR
     C                   END
     C                   EXSR      MOVBSF
     C                   END                                                    <*IN12
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGST         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   MOVE      '1'           *IN99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   MOVEA     '0000'        *IN(87)
     C                   SETOFF                                       30
     C   04              DO
     C     POSNBR        IFLT      35
     C                   EXSR      SØKUNR
     C                   MOVE      KUNDE         WSKUN2
     C                   ELSE
     C                   EXSR      SØKVAD
     C                   MOVE      UADRNR        WSVADR
     C                   END
     C                   END
     C     *IN12         IFEQ      '1'
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVBWS
     C                   ELSE
     C                   MOVE      '1'           *IN40
     C                   EXSR      TESTB1
     C   30              GOTO      STCHG
     C                   END                                                    <*IN12
     C                   MOVE      '0'           *IN40
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      SFVADR        WSVADR
     C                   MOVE      SFKUN2        WSKUN2
     C                   MOVE      SFINTN        WSINTN
     C                   MOVE      SFALFA        WSALFA
     C                   MOVE      '1'           *IN40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     06            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWKA        BEGSR
     C***********************************************
     C                   MOVE      WSKUN2        KUKUN2
     C                   MOVE      WSINTN        KUINTN
     C                   MOVE      WSALFA        KUALFA
     C                   MOVE      WSVADR        KUVADR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C                   MOVE      WSKUN2        SFKUN2
     C                   MOVE      WSINTN        SFINTN
     C                   MOVE      WSALFA        SFALFA
     C                   MOVE      WSVADR        SFVADR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBSF        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        SFKUN2
     C                   MOVE      *BLANKS       SFALFA
     C                   MOVE      *BLANKS       SFINTN
     C                   MOVE      *BLANKS       SFVADR
     C                   MOVEL     '*DEL '       SFINTN
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBWS        BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSKUN2
     C                   MOVE      *BLANKS       WSINTN
     C                   MOVE      *BLANKS       WSALFA
     C                   MOVE      *BLANKS       WSVADR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UUKUN             8 0
     C     KAVTKY        KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    KUKUN2
     C                   KFLD                    KUVADR
     C*
     C     SFKEY         KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    SFKUN2
     C                   KFLD                    SFVADR
     C*
     C     SFKEY1        KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    SFALFA
     C*
     C     SFKEY2        KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    SFINTN
     C     WSKEY         KLIST
     C                   KFLD                    KUKUN1
     C                   KFLD                    WSKUN2
     C                   KFLD                    WSVADR
     C*
     C     WSKEYV        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    WSKUN2
     C                   KFLD                    WSVADR
      *
     C     *LIKE         DEFINE    FIRMA         ZFIRMA
     C     KUNKEY        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    KUKUN1
     C     KUNKE2        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    WSKUN2
     C     KUNKE3        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    SFKUN2
     C     KUNK3V        KLIST
     C                   KFLD                    ZFIRMA
     C                   KFLD                    SFKUN2
     C                   KFLD                    SFVADR
     C*
     C*
     C                   Z-ADD     UUKUN         KUKUN1
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        ZFIRMA
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     SØKUNR        BEGSR
     C***********************************************
     C*
     C                   MOVE      *BLANKS       USØKKN           30
     C                   MOVE      *ZEROS        KUNDE
     C                   CALL      'SOEKKUN'
     C                   PARM                    KUNDE             8 0
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKVAD        BEGSR
     C***********************************************
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    WSKUN2
     C                   PARM                    WSNAK            30
     C                   PARM                    WSADK1           30
     C                   PARM                    WSADK2           30
     C                   PARM                    WSADK3           30
     C                   PARM                    WSLAND            2
     C                   PARM                    UADRNR            5
     C*
     C                   ENDSR
