      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ GEBYRAVTALER (BRUTTO)        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-40 45-98          ***
      ***********************************************************
      *
     FPRIK1     IF   E           K DISK
     FKODTFR    IF   E           K DISK
     FKODTOTY   IF   E           K DISK
     FSYFA89FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN43
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(43)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      ' '           YAVTN
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     PRIK1K        SETLL     PRIK1
     C                   MOVE      '9'           YAVTN
     C     START1        TAG
     C     YKNR          READE     PRIK1                                  44
     C  N44              EXSR      GETTXT
      *
     C     START2        TAG
      *
     C  N44              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     YKNR          READE     PRIK1                                  44
     C  N44              EXSR      GETTXT
     C  N44              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     4             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(41)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C                   SETOFF                                       30
     C*
     C*** EXIT
     C   03              GOTO      SLUTT
     C*
     C*** REFRESH
     C   05              GOTO      START
     C*** SEARCH
     C   08              GOTO      START6
     C*
     C*** ROLL
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C     UFLAGG        IFEQ      3
     C                   GOTO      SLUTT
     C                   END
     C   30XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** SEARCH
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     GETTXT        BEGSR
     C***********************************************
     C     KODFRK        CHAIN     KODTFR                             33
     C   33              MOVE      *BLANKS       KFRNTX
     C     KODOTK        CHAIN     KODTOTY                            33
     C   33              MOVE      *BLANKS       KO1NTX
     C                   MOVE      PKFR01        W2FR01
     C                   MOVE      PKOT01        W2OT01
     C     PRIK1K        SETLL     PRIK1
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   SETOFF                                       414299
     C     *IN30         DOWEQ     '0'
     C                   READC     SUBFIL                                 30
     C   30              DO
     C   99              SETOFF                                       30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '5'
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   SETON                                        99
     C                   CALL      'SYFA89A'
     C                   PARM                    PKFR01
     C                   PARM                    PKOT01
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C     UFLAGG        OREQ      3
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     4             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     PRIK1K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    W2FR01
     C                   KFLD                    W2OT01
     C                   KFLD                    YAVTN
     C                   KFLD                    YGEBY
     C                   KFLD                    YLNR
     C     KODOTK        KLIST
     C                   KFLD                    YOTUNI
     C                   KFLD                    PKOT01
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    PKFR01
     C*
     C                   MOVE      '    ALLE'    YKNR              8
     C                   MOVE      ' '           YAVTN             1
     C                   MOVE      '   '         YGEBY             3
     C                   MOVE      *ZEROS        YLNR              4 0
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      'FR'          YFRUNI            2
     C*
     C                   WRITE     NYWRK
     C                   EXFMT     VAREL2
     C*
     C                   ENDSR
     C*
