********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      *-------------------------------------------------------------
10XXX * 01 sh  PTF11 både kunde/leverandør
10XXX * 02 sh  PTF11 i trafikk gidtas *IMP *EKS *INN *TRA
10XXX * 03 sh  PTF11 *PRO i trafikk er produktkode
10XXX * 04 sh  PTF11 FJERNET ALLE FILER FOR PRJOIN
10XXX * 04 sh  PTF11 FJERNET MASSE HELT DA DET BARE ER FORVIRRENDE
10XXX * 05 sh  PTF11 godta *FRTI = FRA - TIL i stedskode
10XXX * 06 JOV PTF11 *TIL i trafikk er Tillegg - tillegg 1,2,3,4,5,
10XXX * 07 sh  PTF11 *AVD i trafikk er avdelinger
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDL. INNHOLD AV GEBYR PRISAVT. KUNDE  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-03 05-11 13-26                ***
      *** LEDIGE INDIKATORER 27    31 32 34                   ***
      ***********************************************************
      *
     FCDTRAFL2  IF   E           K DISK
     FPRIK      UF A E           K DISK
     FPRIK2     IF   E           K DISK
     F                                     RENAME(PRIKR:PRIK2R)
     FSTED2     IF   E           K DISK
     FKODTGE    IF   E           K DISK
     FKODSAM    IF   E           K DISK
     FKODTFR    IF   E           K DISK
     FKODTOTY   IF   E           K DISK
     FKODTLK    IF   E           K DISK
     FKOFAST    IF   E           K DISK
     FPRIS      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FVALUL01   IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSYFA09FA  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  PKDTÅ                  1      4  0
     D  PKDTM                  5      6  0
     D  PKDTD                  7      8  0
     D  PKDT                   1      8  0
     D                 DS
     D  WKDTD                  1      2  0
     D  WKDTM                  3      4  0
     D  WKDTÅ                  5      6  0
     D  WKDT                   1      6  0
     C*
     C                   EXSR      INIT
     C*
     C     UFLAGG        IFEQ      1
     C                   Z-ADD     0             UFLAGG
     C                   EXSR      KDTFM2
     C                   EXFMT     BILDE02
     C  N12              EXSR      DELFIL
     C                   ELSE
     C                   Z-ADD     0             UFLAGG
     C     START         TAG
     C  N30
     CANN04
     CANN40              Z-ADD     4             LINNBR
     C  N30
     CANN04
     CANN40              Z-ADD     15            POSNBR
     C  N30
     CANN04
     CAN 40              Z-ADD     6             LINNBR
     C  N30
     CANN04
     CAN 40              Z-ADD     15            POSNBR
     C                   EXSR      KDTFM1
     C                   EXFMT     BILDE01
     C                   EXSR      KDTFM1
     C                   SETOFF                                       30
     C                   MOVEA     '00000000000' *IN(17)
     C                   MOVEA     '00000000'    *IN(92)
     C                   MOVEA     '00000000'    *IN(92)
     C                   MOVEA     '00000000'    *IN(84)
     C                   MOVEA     '00000000'    *IN(76)
     C                   MOVEA     '00000000'    *IN(68)
     C                   MOVEA     '0000000'     *IN(61)
     C                   MOVEA     '00000000'    *IN(53)
     C                   MOVEA     '00000000'    *IN(45)
     C                   MOVEA     '0000'        *IN(41)
     C                   MOVEA     '00000'       *IN(35)
     C                   MOVEA     '0'           *IN(29)
     C*
     C   04              DO
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
     C  N12              DO
     C                   EXSR      TESTB1
     C   30              GOTO      START
     C                   MOVE      WSGEBY        UGEBY
     C                   MOVE      WSAVTT        UAVTT
     C                   MOVE      WSTNR         UTNR
     C                   MOVE      WSMVA         UMVA
     C                   MOVE      WSINT         UINT
     C                   MOVE      WSLNR         ULNR
     C                   MOVE      WSBELØ        UBELØ
     C                   MOVE      WSPPR         UPPR
     C                   MOVE      WSKOLL        UKOLL
     C                   MOVE      WSTEGN        UTEGN
     C                   MOVE      WSJUST        UJUST
     C                   MOVE      WSFVAL        UFVAL
     C                   MOVE      WSSAMM        USAMM
     C                   END
     C                   END
     C*
     C     SLUTT         TAG
     C   12              Z-ADD     1             UFLAGG
     c                   seton                                        lr
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     KODGEK        CHAIN     KODTGE                             99
     C   99              MOVE      'SPG0002'     MSGNR
     C   99              SETON                                        30
     C     WSAVTT        COMP      ' '                                    98
     C   98
     CANN30              MOVE      'SPA0014'     MSGNR
     C   98              SETON                                        30
     C                   END
     C*
     C  N30WSAVTT        IFEQ      'T'
     C     WSAVTT        OREQ      'Y'
     C     WSAVTT        OREQ      'G'
     C     WSINT         COMP      0                                      60
     C                   ELSE
     C     PRISKY        SETLL     PRIS
     C     WSTNR         READE     PRIS                                   97
     C  N97WSGEBY        COMP      PRGEBY                             9797
     C     WSAVTT        IFEQ      'P'
     C     WSAVTT        OREQ      'X'
     C     WSAVTT        OREQ      'H'
     C     WSINT         COMP      0                                  6060
     C     WSBELØ        COMP      0                                      59
     C                   END
     C     WSAVTT        IFEQ      'B'
     C     WSINT         COMP      0                                  6060
     C     WSBELØ        COMP      0                                  5959
     C                   END
     C                   END
     C*
     C     WSMVA         COMP      ' '                                    96
     C*
     C   97
     CANN30              MOVE      'SPT0010'     MSGNR
     C   97              SETON                                        30
     C   96
     CANN30              MOVE      'SPM0006'     MSGNR
     C   96              SETON                                        30
     C   60
     CANN30              MOVE      'SPI0002'     MSGNR
     C   60              SETON                                        30
     C   59
     CANN30              MOVE      'SPB0002'     MSGNR
     C   59              SETON                                        30
     C*
     C     WSFVAL        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSFVAL
     C                   ELSE
     C     VALU1K        CHAIN     VALUL01                            58
     C   58
     CANN30              MOVE      'SPV0001'     MSGNR
     C   58              SETON                                        30
     C                   END
     C     WSSAMM        IFNE      ' '
     C     WSSAMM        CHAIN     KODSAM                             29
     C   29
     CANN30              MOVE      'SHU0309'     MSGNR
     C   29              SETON                                        30
     C                   END
     C*
     C*
     C     WSDT          IFNE      0
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTD         UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAG2            1 0
     C     UFLAG2        COMP      1                                      95
     C   95
     CANN30              MOVE      'SPD0001'     MSGNR
     C   95              SETON                                        30
     C                   END
     C*
     C     WSURIO        IFEQ      ' '
     C     WSUR01        COMP      ' '                                9494
     C  N94WSUR02        COMP      ' '                                9494
     C  N94WSUR03        COMP      ' '                                9494
     C  N94WSUR04        COMP      ' '                                9494
     C  N94WSUR05        COMP      ' '                                9494
     C  N94WSUR06        COMP      ' '                                9494
     C  N94WSUR07        COMP      ' '                                9494
     C  N94WSUR08        COMP      ' '                                9494
     C  N94WSUR09        COMP      ' '                                9494
     C  N94WSUR10        COMP      ' '                                9494
     C   94
     CANN30              MOVE      'SPU0007'     MSGNR
     C   94
     CANN30              Z-ADD     7             POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR01        IFNE      ' '
     C     WSURIO        ORNE      ' '
     C                   MOVEL     WSUR01        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     20            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR02        IFNE      ' '
     C                   MOVEL     WSUR02        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     26            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR03        IFNE      ' '
     C                   MOVEL     WSUR03        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     32            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR04        IFNE      ' '
     C                   MOVEL     WSUR04        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     38            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR05        IFNE      ' '
     C                   MOVEL     WSUR05        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     44            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR06        IFNE      ' '
     C                   MOVEL     WSUR06        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     50            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR07        IFNE      ' '
     C                   MOVEL     WSUR07        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     56            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR08        IFNE      ' '
     C                   MOVEL     WSUR08        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     62            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR09        IFNE      ' '
     C                   MOVEL     WSUR09        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     68            POSNBR
     C   94              SETON                                        30
     C                   END
     C     WSUR10        IFNE      ' '
     C                   MOVEL     WSUR10        KFKOD
     C     URKEY         CHAIN     KOFAST                             94
     C   94
     CANN30              MOVE      'JOV0580'     MSGNR
     C   94
     CANN30              Z-ADD     74            POSNBR
     C   94              SETON                                        30
     C                   END
     C*
     C     WSFRIO        IFEQ      ' '
     C     WSFR01        COMP      '   '                              5757
     C  N57WSFR02        COMP      '  '                               5757
     C  N57WSFR03        COMP      '  '                               5757
     C  N57WSFR04        COMP      '  '                               5757
     C  N57WSFR05        COMP      '  '                               5757
     C  N57WSFR06        COMP      '  '                               5757
     C  N57WSFR07        COMP      '  '                               5757
     C  N57WSFR08        COMP      '  '                               5757
     C  N57WSFR09        COMP      '  '                               5757
     C  N57WSFR10        COMP      '  '                               5757
     C   57
     CANN30              MOVE      'SPF0011'     MSGNR
     C   57              SETON                                        30
     C                   END
     C*
     C     WSFR01        IFNE      '   '
     C     WSFRIO        ORNE      ' '
     C                   MOVE      WSFR01        YFR
     C     KODFRK        CHAIN     KODTFR                             56
     C   56
     CANN30              MOVE      'SPF0006'     MSGNR
     C   56              SETON                                        30
     C                   END
     C     WSFR02        IFNE      '   '
     C                   MOVE      WSFR02        YFR
     C     KODFRK        CHAIN     KODTFR                             55
     C   55
     CANN30              MOVE      'SPF0006'     MSGNR
     C   55              SETON                                        30
     C                   END
     C     WSFR03        IFNE      '   '
     C                   MOVE      WSFR03        YFR
     C     KODFRK        CHAIN     KODTFR                             54
     C   54
     CANN30              MOVE      'SPF0006'     MSGNR
     C   54              SETON                                        30
     C                   END
     C     WSFR04        IFNE      '   '
     C                   MOVE      WSFR04        YFR
     C     KODFRK        CHAIN     KODTFR                             53
     C   53
     CANN30              MOVE      'SPF0006'     MSGNR
     C   53              SETON                                        30
     C                   END
     C     WSFR05        IFNE      '   '
     C                   MOVE      WSFR05        YFR
     C     KODFRK        CHAIN     KODTFR                             52
     C   52
     CANN30              MOVE      'SPF0006'     MSGNR
     C   52              SETON                                        30
     C                   END
     C     WSFR06        IFNE      '   '
     C                   MOVE      WSFR06        YFR
     C     KODFRK        CHAIN     KODTFR                             51
     C   51
     CANN30              MOVE      'SPF0006'     MSGNR
     C   51              SETON                                        30
     C                   END
     C     WSFR07        IFNE      '   '
     C                   MOVE      WSFR07        YFR
     C     KODFRK        CHAIN     KODTFR                             50
     C   50
     CANN30              MOVE      'SPF0006'     MSGNR
     C   50              SETON                                        30
     C                   END
     C     WSFR08        IFNE      '   '
     C                   MOVE      WSFR08        YFR
     C     KODFRK        CHAIN     KODTFR                             49
     C   49
     CANN30              MOVE      'SPF0006'     MSGNR
     C   49              SETON                                        30
     C                   END
     C     WSFR09        IFNE      '   '
     C                   MOVE      WSFR09        YFR
     C     KODFRK        CHAIN     KODTFR                             48
     C   48
     CANN30              MOVE      'SPF0006'     MSGNR
     C   48              SETON                                        30
     C                   END
     C     WSFR10        IFNE      '   '
     C                   MOVE      WSFR10        YFR
     C     KODFRK        CHAIN     KODTFR                             47
     C   47
     CANN30              MOVE      'SPF0006'     MSGNR
     C   47              SETON                                        30
     C                   END
     C*
     C     WSOTIO        IFEQ      ' '
     C     WSOT01        COMP      '  '                               4646
     C  N46WSOT02        COMP      '  '                               4646
     C  N46WSOT03        COMP      '  '                               4646
     C  N46WSOT04        COMP      '  '                               4646
     C  N46WSOT05        COMP      '  '                               4646
     C  N46WSOT06        COMP      '  '                               4646
     C  N46WSOT07        COMP      '  '                               4646
     C  N46WSOT08        COMP      '  '                               4646
     C  N46WSOT09        COMP      '  '                               4646
     C  N46WSOT10        COMP      '  '                               4646
     C   46
     CANN30              MOVE      'SPO0014'     MSGNR
     C   46              SETON                                        30
     C                   END
     C*
     C     WSOT01        IFNE      '  '
     C     WSOTIO        ORNE      ' '
     C                   MOVE      WSOT01        YOT
     C     KODOTK        CHAIN     KODTOTY                            45
     C   45
     CANN30              MOVE      'SPO0007'     MSGNR
     C   45              SETON                                        30
     C                   END
     C     WSOT02        IFNE      '  '
     C                   MOVE      WSOT02        YOT
     C     KODOTK        CHAIN     KODTOTY                            44
     C   44
     CANN30              MOVE      'SPO0007'     MSGNR
     C   44              SETON                                        30
     C                   END
     C     WSOT03        IFNE      '  '
     C                   MOVE      WSOT03        YOT
     C     KODOTK        CHAIN     KODTOTY                            43
     C   43
     CANN30              MOVE      'SPO0007'     MSGNR
     C   43              SETON                                        30
     C                   END
     C     WSOT04        IFNE      '  '
     C                   MOVE      WSOT04        YOT
     C     KODOTK        CHAIN     KODTOTY                            42
     C   42
     CANN30              MOVE      'SPO0007'     MSGNR
     C   42              SETON                                        30
     C                   END
     C     WSOT05        IFNE      '  '
     C                   MOVE      WSOT05        YOT
     C     KODOTK        CHAIN     KODTOTY                            41
     C   41
     CANN30              MOVE      'SPO0007'     MSGNR
     C   41              SETON                                        30
     C                   END
     C     WSOT06        IFNE      '  '
     C                   MOVE      WSOT06        YOT
     C     KODOTK        CHAIN     KODTOTY                            39
     C   39
     CANN30              MOVE      'SPO0007'     MSGNR
     C   39              SETON                                        30
     C                   END
     C     WSOT07        IFNE      '  '
     C                   MOVE      WSOT07        YOT
     C     KODOTK        CHAIN     KODTOTY                            38
     C   38
     CANN30              MOVE      'SPO0007'     MSGNR
     C   38              SETON                                        30
     C                   END
     C     WSOT08        IFNE      '  '
     C                   MOVE      WSOT08        YOT
     C     KODOTK        CHAIN     KODTOTY                            37
     C   37
     CANN30              MOVE      'SPO0007'     MSGNR
     C   37              SETON                                        30
     C                   END
     C     WSOT09        IFNE      '  '
     C                   MOVE      WSOT09        YOT
     C     KODOTK        CHAIN     KODTOTY                            36
     C   36
     CANN30              MOVE      'SPO0007'     MSGNR
     C   36              SETON                                        30
     C                   END
     C     WSOT10        IFNE      '  '
     C                   MOVE      WSOT10        YOT
     C     KODOTK        CHAIN     KODTOTY                            35
     C   35
     CANN30              MOVE      'SPO0007'     MSGNR
     C   35              SETON                                        30
     C                   END
     C*
     C     WSLKIO        IFEQ      ' '
     C     WSLK01        COMP      '  '                               9393
     C  N93WSLK02        COMP      '  '                               9393
     C  N93WSLK03        COMP      '  '                               9393
     C  N93WSLK04        COMP      '  '                               9393
     C  N93WSLK05        COMP      '  '                               9393
     C  N93WSLK06        COMP      '  '                               9393
     C  N93WSLK07        COMP      '  '                               9393
     C  N93WSLK08        COMP      '  '                               9393
     C  N93WSLK09        COMP      '  '                               9393
     C  N93WSLK10        COMP      '  '                               9393
     C   93
     CANN30              MOVE      'SPL0004'     MSGNR
     C   93              SETON                                        30
     C                   END
     C*
     C     WSLK01        IFNE      '  '
     C     WSLKIO        ORNE      ' '
     C                   MOVE      WSLK01        YLK
     C     KODLKK        CHAIN     KODTLK                             92
     C   92
     CANN30              MOVE      'SPL0001'     MSGNR
     C   92              SETON                                        30
     C                   END
     C     WSLK02        IFNE      '  '
     C                   MOVE      WSLK02        YLK
     C     KODLKK        CHAIN     KODTLK                             91
     C   91
     CANN30              MOVE      'SPL0001'     MSGNR
     C   91              SETON                                        30
     C                   END
     C     WSLK03        IFNE      '  '
     C                   MOVE      WSLK03        YLK
     C     KODLKK        CHAIN     KODTLK                             90
     C   90
     CANN30              MOVE      'SPL0001'     MSGNR
     C   90              SETON                                        30
     C                   END
     C     WSLK04        IFNE      '  '
     C                   MOVE      WSLK04        YLK
     C     KODLKK        CHAIN     KODTLK                             89
     C   89
     CANN30              MOVE      'SPL0001'     MSGNR
     C   89              SETON                                        30
     C                   END
     C     WSLK05        IFNE      '  '
     C                   MOVE      WSLK05        YLK
     C     KODLKK        CHAIN     KODTLK                             88
     C   88
     CANN30              MOVE      'SPL0001'     MSGNR
     C   88              SETON                                        30
     C                   END
     C     WSLK06        IFNE      '  '
     C                   MOVE      WSLK06        YLK
     C     KODLKK        CHAIN     KODTLK                             87
     C   87
     CANN30              MOVE      'SPL0001'     MSGNR
     C   87              SETON                                        30
     C                   END
     C     WSLK07        IFNE      '  '
     C                   MOVE      WSLK07        YLK
     C     KODLKK        CHAIN     KODTLK                             86
     C   86
     CANN30              MOVE      'SPL0001'     MSGNR
     C   86              SETON                                        30
     C                   END
     C     WSLK08        IFNE      '  '
     C                   MOVE      WSLK08        YLK
     C     KODLKK        CHAIN     KODTLK                             85
     C   85
     CANN30              MOVE      'SPL0001'     MSGNR
     C   85              SETON                                        30
     C                   END
     C     WSLK09        IFNE      '  '
     C                   MOVE      WSLK09        YLK
     C     KODLKK        CHAIN     KODTLK                             84
     C   84
     CANN30              MOVE      'SPL0001'     MSGNR
     C   84              SETON                                        30
     C                   END
     C     WSLK10        IFNE      '  '
     C                   MOVE      WSLK10        YLK
     C     KODLKK        CHAIN     KODTLK                             83
     C   83
     CANN30              MOVE      'SPL0001'     MSGNR
     C   83              SETON                                        30
     C                   END
     C*
     C     WSFSIO        IFEQ      ' '
     C     WSFS01        COMP      '     '                            8282
     C  N82WSFS02        COMP      '     '                            8282
     C  N82WSFS03        COMP      '     '                            8282
     C  N82WSFS04        COMP      '     '                            8282
     C  N82WSFS05        COMP      '     '                            8282
     C  N82WSFS06        COMP      '     '                            8282
     C  N82WSFS07        COMP      '     '                            8282
     C  N82WSFS08        COMP      '     '                            8282
     C  N82WSFS09        COMP      '     '                            8282
     C  N82WSFS10        COMP      '     '                            8282
     C   82
     CANN30              MOVE      'SPS0022'     MSGNR
     C   82              SETON                                        30
     C                   END
     C*
N05  C     WSFS01        IFNE      '*FRTI'
     C     WSFS01        IFNE      '     '
     C     WSFSIO        ORNE      ' '
     C     WSFS01        CHAIN     STED2                              81
     C   81
     CANN30              MOVE      'SPS0012'     MSGNR
     C   81              SETON                                        30
     C                   END
N05  C                   END
     C     WSFS02        IFNE      '     '
     C     WSFS02        CHAIN     STED2                              80
     C   80
     CANN30              MOVE      'SPS0012'     MSGNR
     C   80              SETON                                        30
     C                   END
     C     WSFS03        IFNE      '     '
     C     WSFS03        CHAIN     STED2                              78
     C   79
     CANN30              MOVE      'SPS0012'     MSGNR
     C   79              SETON                                        30
     C                   END
     C     WSFS04        IFNE      '     '
     C     WSFS04        CHAIN     STED2                              78
     C   78
     CANN30              MOVE      'SPS0012'     MSGNR
     C   78              SETON                                        30
     C                   END
     C     WSFS05        IFNE      '     '
     C     WSFS05        CHAIN     STED2                              77
     C   77
     CANN30              MOVE      'SPS0012'     MSGNR
     C   77              SETON                                        30
     C                   END
     C     WSFS06        IFNE      '     '
     C     WSFS06        CHAIN     STED2                              76
     C   76
     CANN30              MOVE      'SPS0012'     MSGNR
     C   76              SETON                                        30
     C                   END
     C     WSFS07        IFNE      '     '
     C     WSFS07        CHAIN     STED2                              75
     C   75
     CANN30              MOVE      'SPS0012'     MSGNR
     C   75              SETON                                        30
     C                   END
     C     WSFS08        IFNE      '     '
     C     WSFS08        CHAIN     STED2                              74
     C   74
     CANN30              MOVE      'SPS0012'     MSGNR
     C   74              SETON                                        30
     C                   END
     C     WSFS09        IFNE      '     '
     C     WSFS09        CHAIN     STED2                              73
     C   73
     CANN30              MOVE      'SPS0012'     MSGNR
     C   73              SETON                                        30
     C                   END
     C     WSFS10        IFNE      '     '
     C     WSFS10        CHAIN     STED2                              72
     C   72
     CANN30              MOVE      'SPS0012'     MSGNR
     C   72              SETON                                        30
     C                   END
     C*
     C*tester trafikk
     C     WTRAIO        IFEQ      ' '
     C     WTRA01        COMP      '    '                             1717
     C  N17WTRA02        COMP      '    '                             1717
     C  N17WTRA03        COMP      '    '                             1717
     C  N17WTRA04        COMP      '    '                             1717
     C  N17WTRA05        COMP      '    '                             1717
     C  N17WTRA06        COMP      '    '                             1717
     C  N17WTRA07        COMP      '    '                             1717
     C  N17WTRA08        COMP      '    '                             1717
     C  N17WTRA09        COMP      '    '                             1717
     C  N17WSFS10        COMP      '    '                             1717
     C   17
     CANN30              MOVE      'SHU1174'     MSGNR
     C   17              SETON                                        30
     C                   END
     C*
N03  C     WTRA01        IFNE      '*PRO'
N06  C     WTRA01        andne     '*TIL'
N07  C     WTRA01        andne     '*AVD'
     C     WTRA01        IFNE      '    '
     C     WTRAIO        ORNE      ' '
N02  C     WTRA01        IFNE      '*IMP'
N02  C     WTRA01        ANDNE     '*EKS'
N02  C     WTRA01        ANDNE     '*INN'
N02  C     WTRA01        ANDNE     '*TRA'
     C                   MOVE      WTRA01        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           18
     C   18
     CANN30              MOVE      'SHU1174'     MSGNR
     C   18              SETON                                        30
     C                   END
N02  C                   END
     C     WTRA02        IFNE      '    '
N02  C     WTRA02        ANDNE     '*IMP'
N02  C     WTRA02        ANDNE     '*EKS'
N02  C     WTRA02        ANDNE     '*INN'
N02  C     WTRA02        ANDNE     '*TRA'
     C                   MOVE      WTRA02        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           19
     C   19
     CANN30              MOVE      'SHU1174'     MSGNR
     C   19              SETON                                        30
     C                   END
     C     WTRA03        IFNE      '     '
N02  C     WTRA03        ANDNE     '*IMP'
N02  C     WTRA03        ANDNE     '*EKS'
N02  C     WTRA03        ANDNE     '*INN'
N02  C     WTRA03        ANDNE     '*TRA'
     C                   MOVE      WTRA03        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           20
     C   20
     CANN30              MOVE      'SHU1174'     MSGNR
     C   20              SETON                                        30
     C                   END
     C     WTRA04        IFNE      '    '
N02  C     WTRA04        ANDNE     '*IMP'
N02  C     WTRA04        ANDNE     '*EKS'
N02  C     WTRA04        ANDNE     '*INN'
N02  C     WTRA04        ANDNE     '*TRA'
     C                   MOVE      WTRA04        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           21
     C   21
     CANN30              MOVE      'SHU1174'     MSGNR
     C   21              SETON                                        30
     C                   END
     C     WTRA05        IFNE      '    '
N02  C     WTRA05        ANDNE     '*IMP'
N02  C     WTRA05        ANDNE     '*EKS'
N02  C     WTRA05        ANDNE     '*INN'
N02  C     WTRA05        ANDNE     '*TRA'
     C                   MOVE      WTRA05        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           22
     C   22
     CANN30              MOVE      'SHU1174'     MSGNR
     C   22              SETON                                        30
     C                   END
     C     WTRA06        IFNE      '    '
N02  C     WTRA06        ANDNE     '*IMP'
N02  C     WTRA06        ANDNE     '*EKS'
N02  C     WTRA06        ANDNE     '*INN'
N02  C     WTRA06        ANDNE     '*TRA'
     C                   MOVE      WTRA06        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           23
     C   23
     CANN30              MOVE      'SHU1174'     MSGNR
     C   23              SETON                                        30
     C                   END
     C     WTRA07        IFNE      '    '
N02  C     WTRA07        ANDNE     '*IMP'
N02  C     WTRA07        ANDNE     '*EKS'
N02  C     WTRA07        ANDNE     '*INN'
N02  C     WTRA07        ANDNE     '*TRA'
     C                   MOVE      WTRA07        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           24
     C   24
     CANN30              MOVE      'SHU1174'     MSGNR
     C   24              SETON                                        30
     C                   END
     C     WTRA08        IFNE      '    '
N02  C     WTRA08        ANDNE     '*IMP'
N02  C     WTRA08        ANDNE     '*EKS'
N02  C     WTRA08        ANDNE     '*INN'
N02  C     WTRA08        ANDNE     '*TRA'
     C                   MOVE      WTRA08        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           25
     C   25
     CANN30              MOVE      'SHU1174'     MSGNR
     C   25              SETON                                        30
     C                   END
     C     WTRA09        IFNE      '    '
N02  C     WTRA09        ANDNE     '*IMP'
N02  C     WTRA09        ANDNE     '*EKS'
N02  C     WTRA09        ANDNE     '*INN'
N02  C     WTRA09        ANDNE     '*TRA'
     C                   MOVE      WTRA09        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           26
     C   26
     CANN30              MOVE      'SHU1174'     MSGNR
     C   26              SETON                                        30
     C                   END
     C     WTRA10        IFNE      '    '
N02  C     WTRA10        ANDNE     '*IMP'
N02  C     WTRA10        ANDNE     '*EKS'
N02  C     WTRA10        ANDNE     '*INN'
N02  C     WTRA10        ANDNE     '*TRA'
     C                   MOVE      WTRA10        TRANR
     C     TRAKEY        CHAIN     CDTRAFL2                           27
     C   27
     CANN30              MOVE      'SHU1174'     MSGNR
     C   27              SETON                                        30
     C                   END
N03  C                   END
     C     WSTSIO        IFEQ      ' '
     C     WSTS01        COMP      '     '                            7171
     C  N71WSTS02        COMP      '     '                            7171
     C  N71WSTS03        COMP      '     '                            7171
     C  N71WSTS04        COMP      '     '                            7171
     C  N71WSTS05        COMP      '     '                            7171
     C  N71WSTS06        COMP      '     '                            7171
     C  N71WSTS07        COMP      '     '                            7171
     C  N71WSTS08        COMP      '     '                            7171
     C  N71WSTS09        COMP      '     '                            7171
     C  N71WSTS10        COMP      '     '                            7171
     C   71
     CANN30              MOVE      'SPS0023'     MSGNR
     C   71              SETON                                        30
     C                   END
     C*
N05  C     WSTS01        IFNE      '*FRTI'
     C     WSTS01        IFNE      '     '
     C     WSTSIO        ORNE      ' '
     C     WSTS01        CHAIN     STED2                              70
     C   70
     CANN30              MOVE      'SPS0013'     MSGNR
     C   70              SETON                                        30
     C                   END
N05  C                   END
     C     WSTS02        IFNE      '     '
     C     WSTS02        CHAIN     STED2                              69
     C   69
     CANN30              MOVE      'SPS0013'     MSGNR
     C   69              SETON                                        30
     C                   END
     C     WSTS03        IFNE      '     '
     C     WSTS03        CHAIN     STED2                              68
     C   68
     CANN30              MOVE      'SPS0013'     MSGNR
     C   68              SETON                                        30
     C                   END
     C     WSTS04        IFNE      '     '
     C     WSTS04        CHAIN     STED2                              67
     C   67
     CANN30              MOVE      'SPS0013'     MSGNR
     C   67              SETON                                        30
     C                   END
     C     WSTS05        IFNE      '     '
     C     WSTS05        CHAIN     STED2                              66
     C   66
     CANN30              MOVE      'SPS0013'     MSGNR
     C   66              SETON                                        30
     C                   END
     C     WSTS06        IFNE      '     '
     C     WSTS06        CHAIN     STED2                              65
     C   65
     CANN30              MOVE      'SPS0013'     MSGNR
     C   65              SETON                                        30
     C                   END
     C     WSTS07        IFNE      '     '
     C     WSTS07        CHAIN     STED2                              64
     C   64
     CANN30              MOVE      'SPS0013'     MSGNR
     C   64              SETON                                        30
     C                   END
     C     WSTS08        IFNE      '     '
     C     WSTS08        CHAIN     STED2                              63
     C   63
     CANN30              MOVE      'SPS0013'     MSGNR
     C   63              SETON                                        30
     C                   END
     C     WSTS09        IFNE      '     '
     C     WSTS09        CHAIN     STED2                              62
     C   62
     CANN30              MOVE      'SPS0013'     MSGNR
     C   62              SETON                                        30
     C                   END
     C     WSTS10        IFNE      '     '
     C     WSTS10        CHAIN     STED2                              61
     C   61
     CANN30              MOVE      'SPS0013'     MSGNR
     C   61              SETON                                        30
     C                   END
     C*
     C  N30WSLSIO        IFEQ      ' '
     C     WSLS01        ANDNE     *BLANKS
     C                   SETON                                        3028
     C                   MOVE      'JOV0581'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     7             POSNBR
     C                   END
     C  N30WSLSIO        IFNE      ' '
     C     WSLS01        ANDEQ     *BLANKS
     C                   SETON                                        3028
     C                   MOVE      'JOV0581'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     19            POSNBR
     C                   END
     C*
     C  N30              EXSR      UPDFIL
     C   30              EXSR      SETCUR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     UPDFIL        BEGSR
     C***********************************************
     C*
     C*** GET RECORD NO. (PKLNR)
     C  N40              DO
     C     PRIK2K        SETLL     PRIK2
     C                   SETOFF                                       33
     C                   READP     PRIK2                                  33
     C  N33              MOVE      PKLNR         WSLNR
     C                   ADD       1             WSLNR
     C                   END
     C*
     C     PRIKK         CHAIN     PRIK                               33
     C  N40              DO
     C                   MOVE      WSLNR         PKLNR
     C                   MOVE      YKNR          PKKNR
     C                   MOVE      WSAVTN        PKAVTN
     C                   MOVE      WSGEBY        PKGEBY
     C                   MOVE      WSAVTT        PKAVTT
     C                   MOVE      WSINT         PKINT
     C                   END
     C*
     C                   MOVE      WSBELØ        PKBELØ
     C                   MOVE      WSPPR         PKPPR
     C                   MOVE      WSTEGN        PKTEGN
     C                   MOVE      WSJUST        PKJUST
     C                   MOVE      WSTNR         PKTNR
     C                   MOVE      WSMVA         PKMVA
     C                   MOVE      WSKOLL        PKKOLL
     C                   MOVE      WSFVAL        PKFVAL
     C                   MOVE      WSSAMM        PKSAMM
     C     WSDT          IFEQ      0
     C                   MOVE      *ZEROS        PKDT
     C                   ELSE
     C                   MOVE      WSDTD         PKDTD
     C                   MOVE      WSDTM         PKDTM
     C                   MOVE      WSDTÅ         PKDTÅ
     C     WSDTÅ         IFGT      50
     C                   MOVEL     '19'          PKDTÅ
     C                   ELSE
     C                   MOVEL     '20'          PKDTÅ
     C                   END
     C                   END
     C                   MOVE      WSURIO        PKURIO
     C                   MOVE      WSUR01        PKUR01
     C                   MOVE      WSUR02        PKUR02
     C                   MOVE      WSUR03        PKUR03
     C                   MOVE      WSUR04        PKUR04
     C                   MOVE      WSUR05        PKUR05
     C                   MOVE      WSUR06        PKUR06
     C                   MOVE      WSUR07        PKUR07
     C                   MOVE      WSUR08        PKUR08
     C                   MOVE      WSUR09        PKUR09
     C                   MOVE      WSUR10        PKUR10
     C                   MOVE      WSFRIO        PKFRIO
     C                   MOVE      WSFR01        PKFR01
     C                   MOVE      WSFR02        PKFR02
     C                   MOVE      WSFR03        PKFR03
     C                   MOVE      WSFR04        PKFR04
     C                   MOVE      WSFR05        PKFR05
     C                   MOVE      WSFR06        PKFR06
     C                   MOVE      WSFR07        PKFR07
     C                   MOVE      WSFR08        PKFR08
     C                   MOVE      WSFR09        PKFR09
     C                   MOVE      WSFR10        PKFR10
     C                   MOVE      WSOTIO        PKOTIO
     C                   MOVE      WSOT01        PKOT01
     C                   MOVE      WSOT02        PKOT02
     C                   MOVE      WSOT03        PKOT03
     C                   MOVE      WSOT04        PKOT04
     C                   MOVE      WSOT05        PKOT05
     C                   MOVE      WSOT06        PKOT06
     C                   MOVE      WSOT07        PKOT07
     C                   MOVE      WSOT08        PKOT08
     C                   MOVE      WSOT09        PKOT09
     C                   MOVE      WSOT10        PKOT10
     C                   MOVE      WSLKIO        PKLKIO
     C                   MOVE      WSLK01        PKLK01
     C                   MOVE      WSLK02        PKLK02
     C                   MOVE      WSLK03        PKLK03
     C                   MOVE      WSLK04        PKLK04
     C                   MOVE      WSLK05        PKLK05
     C                   MOVE      WSLK06        PKLK06
     C                   MOVE      WSLK07        PKLK07
     C                   MOVE      WSLK08        PKLK08
     C                   MOVE      WSLK09        PKLK09
     C                   MOVE      WSLK10        PKLK10
     C                   MOVE      WSFSIO        PKFSIO
     C                   MOVE      WSFS01        PKFS01
     C                   MOVE      WSFS02        PKFS02
     C                   MOVE      WSFS03        PKFS03
     C                   MOVE      WSFS04        PKFS04
     C                   MOVE      WSFS05        PKFS05
     C                   MOVE      WSFS06        PKFS06
     C                   MOVE      WSFS07        PKFS07
     C                   MOVE      WSFS08        PKFS08
     C                   MOVE      WSFS09        PKFS09
     C                   MOVE      WSFS10        PKFS10
     C                   MOVE      WSTSIO        PKTSIO
     C                   MOVE      WSTS01        PKTS01
     C                   MOVE      WSTS02        PKTS02
     C                   MOVE      WSTS03        PKTS03
     C                   MOVE      WSTS04        PKTS04
     C                   MOVE      WSTS05        PKTS05
     C                   MOVE      WSTS06        PKTS06
     C                   MOVE      WSTS07        PKTS07
     C                   MOVE      WSTS08        PKTS08
     C                   MOVE      WSTS09        PKTS09
     C                   MOVE      WSTS10        PKTS10
     C                   MOVE      WSLSIO        PKLSIO
     C                   MOVE      WSLS01        PKLS01
     C                   MOVE      WSLS02        PKLS02
     C                   MOVE      WSLS03        PKLS03
     C                   MOVE      WSLS04        PKLS04
     C                   MOVE      WSLS05        PKLS05
     C                   MOVE      WSL2IO        PKL2IO
     C                   MOVE      WSL201        PKL201
     C                   MOVE      WSL202        PKL202
     C                   MOVE      WSL203        PKL203
     C                   MOVE      WSL204        PKL204
     C                   MOVE      WSL205        PKL205
     C                   MOVE      WTRAIO        PTRAIO
     C                   MOVE      WTRA01        PTRA01
     C                   MOVE      WTRA02        PTRA02
     C                   MOVE      WTRA03        PTRA03
     C                   MOVE      WTRA04        PTRA04
     C                   MOVE      WTRA05        PTRA05
     C                   MOVE      WTRA06        PTRA06
     C                   MOVE      WTRA07        PTRA07
     C                   MOVE      WTRA08        PTRA08
     C                   MOVE      WTRA09        PTRA09
     C                   MOVE      WTRA10        PTRA10
     C   33              WRITE     PRIKR
     C  N33              UPDATE    PRIKR
     C                   SETOFF                                       3033
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DELFIL        BEGSR
     C***********************************************
     C     PRIKK         CHAIN     PRIK                               33
     C  N33              DO
     C                   DELETE    PRIKR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SETCUR        BEGSR
     C***********************************************
     C* TRAFIKK
     C   17
     COR 18
     COR 19
     COR 20
     COR 21              Z-ADD     23            LINNBR
     C   22
     COR 23
     COR 24
     COR 25
     COR 26
     COR 27              Z-ADD     23            LINNBR
     C   61
     COR 62
     COR 63
     COR 64
     COR 65
     COR 66              Z-ADD     21            LINNBR
     C   67
     COR 68
     COR 69
     COR 70
     COR 71              Z-ADD     21            LINNBR
     C*
     C   72
     COR 73
     COR 74
     COR 75
     COR 76              Z-ADD     20            LINNBR
     C   77
     COR 78
     COR 79
     COR 80
     COR 81
     COR 82              Z-ADD     20            LINNBR
     C*
     C   83
     COR 84
     COR 85
     COR 86
     COR 87              Z-ADD     19            LINNBR
     C   88
     COR 89
     COR 90
     COR 91
     COR 92
     COR 93              Z-ADD     19            LINNBR
     C*
     C   35
     COR 36
     COR 37
     COR 38
     COR 39              Z-ADD     18            LINNBR
     C   41
     COR 42
     COR 43
     COR 44
     COR 45
     COR 46              Z-ADD     18            LINNBR
     C*
     C   47
     COR 48
     COR 49
     COR 50
     COR 51              Z-ADD     17            LINNBR
     C   52
     COR 53
     COR 54
     COR 55
     COR 56
     COR 57              Z-ADD     17            LINNBR
     C*
     C*
     C   94              Z-ADD     16            LINNBR
     C   95              Z-ADD     14            LINNBR
     C   29              Z-ADD     12            LINNBR
     C   58              Z-ADD     11            LINNBR
     C   59              Z-ADD     9             LINNBR
     C   60              Z-ADD     8             LINNBR
     C   96              Z-ADD     7             LINNBR
     C   97              Z-ADD     6             LINNBR
     C   98              Z-ADD     5             LINNBR
     C   99              Z-ADD     4             LINNBR
     C*
     C   27              Z-ADD     74            POSNBR
     C   26              Z-ADD     68            POSNBR
     C   25              Z-ADD     62            POSNBR
     C   24              Z-ADD     56            POSNBR
     C   23              Z-ADD     50            POSNBR
     C   22              Z-ADD     44            POSNBR
     C   21              Z-ADD     38            POSNBR
     C   20              Z-ADD     32            POSNBR
     C   19              Z-ADD     26            POSNBR
     C   18              Z-ADD     20            POSNBR
     C   17              Z-ADD     7             POSNBR
     C*
     C*
     C   61              Z-ADD     74            POSNBR
     C   62              Z-ADD     68            POSNBR
     C   63              Z-ADD     62            POSNBR
     C   64              Z-ADD     56            POSNBR
     C   65              Z-ADD     50            POSNBR
     C   66              Z-ADD     44            POSNBR
     C   67              Z-ADD     38            POSNBR
     C   68              Z-ADD     32            POSNBR
     C   69              Z-ADD     26            POSNBR
     C   70              Z-ADD     20            POSNBR
     C   71              Z-ADD     7             POSNBR
     C*
     C   72              Z-ADD     74            POSNBR
     C   73              Z-ADD     68            POSNBR
     C   74              Z-ADD     62            POSNBR
     C   75              Z-ADD     56            POSNBR
     C   76              Z-ADD     50            POSNBR
     C   77              Z-ADD     44            POSNBR
     C   78              Z-ADD     38            POSNBR
     C   79              Z-ADD     32            POSNBR
     C   80              Z-ADD     26            POSNBR
     C   81              Z-ADD     20            POSNBR
     C   82              Z-ADD     7             POSNBR
     C*
     C   83              Z-ADD     74            POSNBR
     C   84              Z-ADD     68            POSNBR
     C   85              Z-ADD     62            POSNBR
     C   86              Z-ADD     56            POSNBR
     C   87              Z-ADD     50            POSNBR
     C   88              Z-ADD     44            POSNBR
     C   89              Z-ADD     38            POSNBR
     C   90              Z-ADD     32            POSNBR
     C   91              Z-ADD     26            POSNBR
     C   92              Z-ADD     20            POSNBR
     C   93              Z-ADD     7             POSNBR
     C*
     C   35              Z-ADD     74            POSNBR
     C   36              Z-ADD     68            POSNBR
     C   37              Z-ADD     62            POSNBR
     C   38              Z-ADD     56            POSNBR
     C   39              Z-ADD     50            POSNBR
     C   41              Z-ADD     44            POSNBR
     C   42              Z-ADD     38            POSNBR
     C   43              Z-ADD     32            POSNBR
     C   44              Z-ADD     26            POSNBR
     C   45              Z-ADD     20            POSNBR
     C   46              Z-ADD     7             POSNBR
     C*
     C   47              Z-ADD     74            POSNBR
     C   48              Z-ADD     68            POSNBR
     C   49              Z-ADD     62            POSNBR
     C   50              Z-ADD     56            POSNBR
     C   51              Z-ADD     50            POSNBR
     C   52              Z-ADD     44            POSNBR
     C   53              Z-ADD     38            POSNBR
     C   54              Z-ADD     32            POSNBR
     C   55              Z-ADD     26            POSNBR
     C   56              Z-ADD     20            POSNBR
     C   57              Z-ADD     7             POSNBR
     C*
     C   95              Z-ADD     19            POSNBR
     C   29              Z-ADD     21            POSNBR
     C   58              Z-ADD     61            POSNBR
     C   59              Z-ADD     15            POSNBR
     C   60              Z-ADD     15            POSNBR
     C   96
     COR 97
     COR 98
     COR 99              Z-ADD     15            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C  N40LINNBR        IFEQ      4
     C     POSNBR        ANDGE     15
     C     POSNBR        ANDLE     17
     C                   CALL      'SYFI10D'
     C                   PARM                    WSGEBY
     C                   Z-ADD     6             LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDEQ     15
     C                   CALL      'SYFA07'
     C                   PARM                    WSTNR
     C                   Z-ADD     7             LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     61
     C     POSNBR        ANDLE     63
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSFVAL
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     21            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDEQ     21
     C                   CALL      'SYFA06A'
     C                   PARM                    WSSAMM
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     19            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      16
     C                   MOVE      *BLANKS       RETURK
     C                   CALL      'SYFAKDA'
     C                   PARM                    UTYP             10
     C                   PARM                    VEDL              1
     C                   PARM                    RETURK            5
     C     RETURK        IFNE      *BLANKS
     C     WSUR01        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR01
     C                   ELSE
     C     WSUR02        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR02
     C                   ELSE
     C     WSUR03        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR03
     C                   ELSE
     C     WSUR04        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR04
     C                   ELSE
     C     WSUR05        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR05
     C                   ELSE
     C     WSUR06        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR06
     C                   ELSE
     C     WSUR07        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR07
     C                   ELSE
     C     WSUR08        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR08
     C                   ELSE
     C     WSUR09        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR09
     C                   ELSE
     C     WSUR10        IFEQ      *BLANKS
     C                   MOVEL     RETURK        WSUR10
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      17
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     22
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR01
     C                   PARM                    USPED
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     28
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR02
     C                   PARM                    USPED
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     34
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR03
     C                   PARM                    USPED
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     40
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR04
     C                   PARM                    USPED
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     46
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR05
     C                   PARM                    USPED
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     52
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR06
     C                   PARM                    USPED
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     58
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR07
     C                   PARM                    USPED
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     64
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR08
     C                   PARM                    USPED
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     70
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR09
     C                   PARM                    USPED
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     76
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR10
     C                   PARM                    USPED
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     7             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C     LINNBR        IFEQ      18
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     21
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT01
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     27
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT02
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     33
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT03
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     39
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT04
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     45
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT05
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     51
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT06
     C                   Z-ADD     56            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     57
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT07
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     63
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT08
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     69
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT09
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     75
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT10
     C                   Z-ADD     19            LINNBR
     C                   Z-ADD     7             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C     LINNBR        IFEQ      19
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     21
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK01
     C                   PARM                    USPED
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     27
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK02
     C                   PARM                    USPED
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     33
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK03
     C                   PARM                    USPED
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     39
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK04
     C                   PARM                    USPED
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     45
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK05
     C                   PARM                    USPED
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     51
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK06
     C                   PARM                    USPED
     C                   Z-ADD     56            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     57
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK07
     C                   PARM                    USPED
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     63
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK08
     C                   PARM                    USPED
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     69
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK09
     C                   PARM                    USPED
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     75
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK10
     C                   PARM                    USPED
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     7             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C     LINNBR        IFEQ      20
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     24
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS01
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     30
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS02
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     36
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS03
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     42
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS04
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     48
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS05
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     54
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS06
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     56            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     60
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS07
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     66
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS08
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     72
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS09
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     78
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFS10
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     17            LINNBR
     C                   Z-ADD     7             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C     LINNBR        IFEQ      21
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     24
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS01
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     30
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS02
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     36
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS03
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     42
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS04
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     48
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS05
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     54
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS06
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     56            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     60
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS07
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     66
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS08
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     72
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS09
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     78
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTS10
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C* LOSSE STED
     C*
     C     LINNBR        IFEQ      22
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     39
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLS01
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      41
     C     POSNBR        ANDLE     60
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLS02
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     81
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLS03
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      83
     C     POSNBR        ANDLE     102
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLS04
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      104
     C     POSNBR        ANDLE     123
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLS05
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C* LOSSE STED
     C*
     C     LINNBR        IFEQ      23
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     39
     C                   CALL      'SYFI10J'
     C                   PARM                    WSL201
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      41
     C     POSNBR        ANDLE     60
     C                   CALL      'SYFI10J'
     C                   PARM                    WSL202
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     81
     C                   CALL      'SYFI10J'
     C                   PARM                    WSL203
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      83
     C     POSNBR        ANDLE     102
     C                   CALL      'SYFI10J'
     C                   PARM                    WSL204
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      104
     C     POSNBR        ANDLE     123
     C                   CALL      'SYFI10J'
     C                   PARM                    WSL205
     C                   SETOFF                                       04
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C* TRAFIKK
     C     LINNBR        IFEQ      24
     C     POSNBR        IFGE      20
     C     POSNBR        ANDLE     23
     C                   CALL      'SYSJ17A'
     C                   PARM                    xxknr             8 0
     C                   PARM                    WTRA01
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      26
     C     POSNBR        ANDLE     31
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA02
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA02 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'                                       *TIL=2,3,4=Tillegg
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA02
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA02 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM                    xxknr
     C                   PARM                    WTRA02
N06  C                   endsl
     C                   Z-ADD     32            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      32
     C     POSNBR        ANDLE     35
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA03
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA03 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA03
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA03 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM                    xxknr
     C                   PARM                    WTRA03
N06  C                   endsl
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      38
     C     POSNBR        ANDLE     41
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA04
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA04 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA04
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA04 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM                    xxknr
     C                   PARM                    WTRA04
N06  C                   endsl
     C                   Z-ADD     44            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      44
     C     POSNBR        ANDLE     47
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA05
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA05 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA05
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA05 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA05
N06  C                   endsl
     C                   Z-ADD     50            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      50
     C     POSNBR        ANDLE     53
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA06
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA06 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA06
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA06 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA06
N06  C                   endsl
     C                   Z-ADD     56            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      56
     C     POSNBR        ANDLE     59
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA07
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA07 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA07
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA07 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA07
N06  C                   endsl
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      62
     C     POSNBR        ANDLE     65
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA08
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA08 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA08
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA08 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA08
N06  C                   endsl
     C                   Z-ADD     68            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      68
     C     POSNBR        ANDLE     71
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA09
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA09 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA09
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA09 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA09
N06  C                   endsl
     C                   Z-ADD     74            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C     POSNBR        IFGE      74
     C     POSNBR        ANDLE     77
N06  c                   select
N06  C     WTRA01        wheneq    '*PRO'                                       *PRO=2,3,4=ProdType
N06  C                   MOVEL     'PRODTYPE'    UTYP             10
N06  c                   eval      WKUKOD = WTRA10
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA10 = WKUKOD
N06  C     WTRA01        wheneq    '*TIL'
N06  C                   MOVEL     'AVTTIL'      UTYP             10
N06  c                   eval      WKUKOD = WTRA10
N06  C                   CALL      'SYKUKD'
N06  C                   PARM                    UTYP
N06  C                   PARM      'N'           UUPDAT            1
N06  C                   PARM                    WKUKOD            5
N06  c                   eval      WTRA10 = WKUKOD
N06  C                   other
     C                   CALL      'SYSJ17A'
     C                   PARM      WSKNR         xxknr
     C                   PARM                    WTRA10
N06  C                   endsl
     C                   Z-ADD     26            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     PRIKK         KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    WSGEBY
     C                   KFLD                    WSAVTT
     C                   KFLD                    WSINT
     C                   KFLD                    WSLNR
     C     PRIK2K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    YLNR
     C     PHELPK        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    PKAVTN
     C                   KFLD                    PKLNR
     C     KODGEK        KLIST
     C                   KFLD                    YGEUNI
     C                   KFLD                    WSGEBY
     C     KODLKK        KLIST
     C                   KFLD                    YLKUNI
     C                   KFLD                    YLK
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    YFR
     C     KODOTK        KLIST
     C                   KFLD                    YOTUNI
     C                   KFLD                    YOT
     C     PRISKY        KLIST
     C                   KFLD                    WSTNR
     C                   KFLD                    WSGEBY
     C                   KFLD                    YINT
     C     VALU1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFVAL
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNR
     C     TRAKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    TRANR             4
     C     URKEY         KLIST
     C                   KFLD                    KFTYP
     C                   KFLD                    KFKOD
     C                   MOVEL     'HEUR'        KFTYP
     C*
     C     *ENTRY        PLIST
N01  C                   PARM                    Ukule             1
     C                   PARM                    UKNR              8 0
     C                   PARM                    UAVTN             1
     C                   PARM                    UGEBY             3
     C                   PARM                    UAVTT             1
     C                   PARM                    UTNR              1
     C                   PARM                    UMVA              1
     C                   PARM                    UINT              5 0
     C                   PARM                    ULNR              4 0
     C                   PARM                    UBELØ            10 3
     C                   PARM                    UPPR              5 0
     C                   PARM                    UKOLL             1
     C                   PARM                    UTEGN             1
     C                   PARM                    UJUST            10 3
     C                   PARM                    UFVAL             3
     C                   PARM                    USAMM             1
     C                   PARM                    UFLAGG            1 0
     C*
     C                   MOVEL     'HEUR'        UTYP
     C                   MOVE      'J'           USØK              1
     C                   MOVE      UKNR          YKNR              8
     C                   MOVE      *ZEROS        YINT              5 0
     C                   MOVE      9999          YLNR              4 0
     C                   MOVE      'GE'          YGEUNI            2
     C                   MOVE      'LK '         YLKUNI            3
     C                   MOVE      'FR'          YFRUNI            2
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      '   '         YFR               3
     C                   MOVE      '  '          YOT               2
     C                   MOVE      '  '          YLK               2
     C                   MOVE      'J'           USPED             1
     C* SIDEN LR IKKE SETTES PÅ INITIER SKJERMBILDE + FILFORMAT
     C* (IKKE NØDVENDIG Å INITEIERE PRIKR - MISLYKKET CHAIN ->FLYTTES IKKE)
     C                   CLEAR                   BILDE01
     C                   MOVE      UKNR          WSKNR
     C                   MOVE      UAVTN         WSAVTN
n01  c     ukule         comp      'L'                                313132
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     UFLAGG        IFLE      3
     C                   EXSR      GETPK
     C                   END
      * HENTE KUNDENAVN
     C     KUND1K        CHAIN     CUNDL01                            33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     GETPK         BEGSR
     C***********************************************
     C                   MOVE      UGEBY         WSGEBY
     C                   MOVE      UAVTT         WSAVTT
     C                   MOVE      UINT          WSINT
     C                   MOVE      ULNR          WSLNR             4 0
     C     PRIKK         CHAIN(N)  PRIK                               33
     C  N33              DO
     C                   MOVE      PKDTD         WSDTD
     C                   MOVE      PKDTM         WSDTM
     C                   MOVE      PKDTÅ         WSDTÅ
     C     KODGEK        CHAIN     KODTGE                             33
     C     UFLAGG        IFGE      2
     C     UFLAGG        IFEQ      2
     C                   SETON                                        40
     C                   ELSE
     C                   MOVE      *ZEROS        WSLNR
     C                   END
     C                   MOVE      PKBELØ        WSBELØ
     C                   MOVE      PKPPR         WSPPR
     C                   MOVE      PKTEGN        WSTEGN
     C                   MOVE      PKJUST        WSJUST
     C                   MOVE      PKTNR         WSTNR
     C                   MOVE      PKMVA         WSMVA
     C                   MOVE      PKKOLL        WSKOLL
     C                   MOVE      PKFVAL        WSFVAL
     C                   MOVE      PKSAMM        WSSAMM
     C                   MOVE      PKURIO        WSURIO
     C                   MOVE      PKUR01        WSUR01
     C                   MOVE      PKUR02        WSUR02
     C                   MOVE      PKUR03        WSUR03
     C                   MOVE      PKUR04        WSUR04
     C                   MOVE      PKUR05        WSUR05
     C                   MOVE      PKUR06        WSUR06
     C                   MOVE      PKUR07        WSUR07
     C                   MOVE      PKUR08        WSUR08
     C                   MOVE      PKUR09        WSUR09
     C                   MOVE      PKUR10        WSUR10
     C                   MOVE      PKFRIO        WSFRIO
     C                   MOVE      PKFR01        WSFR01
     C                   MOVE      PKFR02        WSFR02
     C                   MOVE      PKFR03        WSFR03
     C                   MOVE      PKFR04        WSFR04
     C                   MOVE      PKFR05        WSFR05
     C                   MOVE      PKFR06        WSFR06
     C                   MOVE      PKFR07        WSFR07
     C                   MOVE      PKFR08        WSFR08
     C                   MOVE      PKFR09        WSFR09
     C                   MOVE      PKFR10        WSFR10
     C                   MOVE      PKOTIO        WSOTIO
     C                   MOVE      PKOT01        WSOT01
     C                   MOVE      PKOT02        WSOT02
     C                   MOVE      PKOT03        WSOT03
     C                   MOVE      PKOT04        WSOT04
     C                   MOVE      PKOT05        WSOT05
     C                   MOVE      PKOT06        WSOT06
     C                   MOVE      PKOT07        WSOT07
     C                   MOVE      PKOT08        WSOT08
     C                   MOVE      PKOT09        WSOT09
     C                   MOVE      PKOT10        WSOT10
     C                   MOVE      PKLKIO        WSLKIO
     C                   MOVE      PKLK01        WSLK01
     C                   MOVE      PKLK02        WSLK02
     C                   MOVE      PKLK03        WSLK03
     C                   MOVE      PKLK04        WSLK04
     C                   MOVE      PKLK05        WSLK05
     C                   MOVE      PKLK06        WSLK06
     C                   MOVE      PKLK07        WSLK07
     C                   MOVE      PKLK08        WSLK08
     C                   MOVE      PKLK09        WSLK09
     C                   MOVE      PKLK10        WSLK10
     C                   MOVE      PKFSIO        WSFSIO
     C                   MOVE      PKFS01        WSFS01
     C                   MOVE      PKFS02        WSFS02
     C                   MOVE      PKFS03        WSFS03
     C                   MOVE      PKFS04        WSFS04
     C                   MOVE      PKFS05        WSFS05
     C                   MOVE      PKFS06        WSFS06
     C                   MOVE      PKFS07        WSFS07
     C                   MOVE      PKFS08        WSFS08
     C                   MOVE      PKFS09        WSFS09
     C                   MOVE      PKFS10        WSFS10
     C                   MOVE      PKTSIO        WSTSIO
     C                   MOVE      PKTS01        WSTS01
     C                   MOVE      PKTS02        WSTS02
     C                   MOVE      PKTS03        WSTS03
     C                   MOVE      PKTS04        WSTS04
     C                   MOVE      PKTS05        WSTS05
     C                   MOVE      PKTS06        WSTS06
     C                   MOVE      PKTS07        WSTS07
     C                   MOVE      PKTS08        WSTS08
     C                   MOVE      PKTS09        WSTS09
     C                   MOVE      PKTS10        WSTS10
     C                   MOVE      PKLSIO        WSLSIO
     C                   MOVE      PKLS01        WSLS01
     C                   MOVE      PKLS02        WSLS02
     C                   MOVE      PKLS03        WSLS03
     C                   MOVE      PKLS04        WSLS04
     C                   MOVE      PKLS05        WSLS05
     C                   MOVE      PKL2IO        WSL2IO
     C                   MOVE      PKL201        WSL201
     C                   MOVE      PKL202        WSL202
     C                   MOVE      PKL203        WSL203
     C                   MOVE      PKL204        WSL204
     C                   MOVE      PKL205        WSL205
     C                   MOVE      PTRAIO        WTRAIO
     C                   MOVE      PTRA01        WTRA01
     C                   MOVE      PTRA02        WTRA02
     C                   MOVE      PTRA03        WTRA03
     C                   MOVE      PTRA04        WTRA04
     C                   MOVE      PTRA05        WTRA05
     C                   MOVE      PTRA06        WTRA06
     C                   MOVE      PTRA07        WTRA07
     C                   MOVE      PTRA08        WTRA08
     C                   MOVE      PTRA09        WTRA09
     C                   MOVE      PTRA10        WTRA10
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM1        BEGSR
     C***********************************************
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM2        BEGSR
     C***********************************************
     C                   MOVE      PKDTD         UDT1
     C                   MOVE      PKDTM         UDT2
     C                   MOVE      PKDTÅ         UDT3
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          WKDTD
     C                   MOVE      UDT2          WKDTM
     C                   MOVE      UDT3          WKDTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
