********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SPØRRE PÅ STATISTIKK                   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 05 06 08 09 11 14-24
      *** LEDIGE INDIKATORER 67-69 70-90 95 96
      *** OBS! SYFA29A BRUKER SAMME INDIKATORER SOM SYFA29
      ***********************************************************
      *
     FSTATHFL1  IF   E           K DISK
     FSTATHFL2  IF   E           K DISK    RENAME(STATHFR:STATHL2R)
     FSTATOHL1  IF   E           K DISK    RENAME(STATHFR:STATOH1R)
     FSTATOHL2  IF   E           K DISK    RENAME(STATHFR:STATOH2R)
     FSTATDFL1  IF   E           K DISK
     FSTATODL1  IF   E           K DISK    RENAME(STATDFR:STATOD1R)
     FKODTA     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTFR    IF   E           K DISK
     FKODTOTY   IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FBILK      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FSTED2D    IF   E           K DISK    RENAME(STED2R:STED2DR)
     FSIF       IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FAVDGR     IF   E           K DISK
     FSYFA29FM  CF   E             WORKSTN INFDS(FBAREA)
     D DI2             S              9  0 DIM(13)
     D IN2             S              9  0 DIM(13)
     D KS2             S              9  0 DIM(13)
     D F               S             11  0 DIM(12)
     D UIN             S              1    DIM(99)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
N01  D                UDS
N01  D  FIFIRM                 1      2
     D                 DS
     D  WSDTÅC                 1      4  0
     D  WSDTC                  1      2  0
     D  WSDTÅ                  3      4  0
     D                 DS
     D  KOVK1                  1      5  0
     D  WSVK1                  1      5  0
     D  KOVK2                  6     10  0
     D  WSVK2                  6     10  0
     D  KOVK3                 11     15  0
     D  WSVK3                 11     15  0
     D  KOVK4                 16     20  0
     D  WSVK4                 16     20  0
     D  KOVK5                 21     25  0
     D  WSVK5                 21     25  0
     D  KOVK6                 26     30  0
     D  WSVK6                 26     30  0
     D  KOVK7                 31     35  0
     D  WSVK7                 31     35  0
     D  KOVK8                 36     40  0
     D  WSVK8                 36     40  0
     D  KOVK9                 41     45  0
     D  WSVK9                 41     45  0
     D  KOVK10                46     50  0
     D  WSVK10                46     50  0
     D  KOVK11                51     55  0
     D  WSVK11                51     55  0
     D                 DS
     D  WSIN01                 1     11  0
     D  WSIN02                12     22  0
     D  WSIN03                23     33  0
     D  WSIN04                34     44  0
     D  WSIN05                45     55  0
     D  WSIN06                56     66  0
     D  WSIN07                67     77  0
     D  WSIN08                78     88  0
     D  WSIN09                89     99  0
     D  WSIN10               100    110  0
     D  WSIN11               111    121  0
     D  WSIN12               122    132  0
     D  WSIN13               133    143  0
     D  IN                     1    143  0 DIM(13)
     D                 DS
     D  WSKS01                 1     11  0
     D  WSKS02                12     22  0
     D  WSKS03                23     33  0
     D  WSKS04                34     44  0
     D  WSKS05                45     55  0
     D  WSKS06                56     66  0
     D  WSKS07                67     77  0
     D  WSKS08                78     88  0
     D  WSKS09                89     99  0
     D  WSKS10               100    110  0
     D  WSKS11               111    121  0
     D  WSKS12               122    132  0
     D  WSKS13               133    143  0
     D  KS                     1    143  0 DIM(13)
     D                 DS
     D  WSDI01                 1     11  0
     D  WSDI02                12     22  0
     D  WSDI03                23     33  0
     D  WSDI04                34     44  0
     D  WSDI05                45     55  0
     D  WSDI06                56     66  0
     D  WSDI07                67     77  0
     D  WSDI08                78     88  0
     D  WSDI09                89     99  0
     D  WSDI10               100    110  0
     D  WSDI11               111    121  0
     D  WSDI12               122    132  0
     D  WSDI13               133    143  0
     D  DI                     1    143  0 DIM(13)
     D                 DS
     D  WSIN21                 1     11  0
     D  WSIN22                12     22  0
     D  WSIN23                23     33  0
     D  WSIN24                34     44  0
     D  WSIN25                45     55  0
     D  WSIN26                56     66  0
     D  WSIN27                67     77  0
     D  WSIN28                78     88  0
     D  WSIN29                89     99  0
     D  WSIN30               100    110  0
     D  WSIN31               111    121  0
     D  WSIN32               122    132  0
     D  WSIN33               133    143  0
     D  IN1                    1    143  0 DIM(13)
     D                 DS
     D  WSKS21                 1     11  0
     D  WSKS22                12     22  0
     D  WSKS23                23     33  0
     D  WSKS24                34     44  0
     D  WSKS25                45     55  0
     D  WSKS26                56     66  0
     D  WSKS27                67     77  0
     D  WSKS28                78     88  0
     D  WSKS29                89     99  0
     D  WSKS30               100    110  0
     D  WSKS31               111    121  0
     D  WSKS32               122    132  0
     D  WSKS33               133    143  0
     D  KS1                    1    143  0 DIM(13)
     D                 DS
     D  WSDI21                 1     11  0
     D  WSDI22                12     22  0
     D  WSDI23                23     33  0
     D  WSDI24                34     44  0
     D  WSDI25                45     55  0
     D  WSDI26                56     66  0
     D  WSDI27                67     77  0
     D  WSDI28                78     88  0
     D  WSDI29                89     99  0
     D  WSDI30               100    110  0
     D  WSDI31               111    121  0
     D  WSDI32               122    132  0
     D  WSDI33               133    143  0
     D  DI1                    1    143  0 DIM(13)
     D                 DS
     D  STBL01                 1      9  0
     D  STBL02                10     18  0
     D  STBL03                19     27  0
     D  STBL04                28     36  0
     D  STBL05                37     45  0
     D  STBL06                46     54  0
     D  STBL07                55     63  0
     D  STBL08                64     72  0
     D  STBL09                73     81  0
     D  STBL10                82     90  0
     D  STBL11                91     99  0
     D  STBL12               100    108  0
     D  STBL13               109    117  0
     D  BL                     1    117  0 DIM(13)
     D                 DS
     D  WSFB01                 1     11  0
     D  WSFB02                12     22  0
     D  WSFB03                23     33  0
     D  WSFB04                34     44  0
     D  WSFB05                45     55  0
     D  WSFB06                56     66  0
     D  WSFB07                67     77  0
     D  WSFB08                78     88  0
     D  WSFB09                89     99  0
     D  WSFB10               100    110  0
     D  WSFB11               111    121  0
     D  WSFB12               122    132  0
     D  WSFB13               133    143  0
     D  FB                     1    143  0 DIM(13)
     D                 DS
     D  WSFB21                 1     11  0
     D  WSFB22                12     22  0
     D  WSFB23                23     33  0
     D  WSFB24                34     44  0
     D  WSFB25                45     55  0
     D  WSFB26                56     66  0
     D  WSFB27                67     77  0
     D  WSFB28                78     88  0
     D  WSFB29                89     99  0
     D  WSFB30               100    110  0
     D  WSFB31               111    121  0
     D  WSFB32               122    132  0
     D  WSFB33               133    143  0
     D  FB1                    1    143  0 DIM(13)
     D                 DS
     D  STFB01                 1     11  0
     D  STFB02                12     22  0
     D  STFB03                23     33  0
     D  STFB04                34     44  0
     D  STFB05                45     55  0
     D  STFB06                56     66  0
     D  STFB07                67     77  0
     D  STFB08                78     88  0
     D  STFB09                89     99  0
     D  STFB10               100    110  0
     D  STFB11               111    121  0
     D  STFB12               122    132  0
     D  STFB13               133    143  0
     D  FB2                    1    143  0 DIM(13)
     D                 DS
     D  WSV01                  1     11  0
     D  WSV02                 12     22  0
     D  WSV03                 23     33  0
     D  WSV04                 34     44  0
     D  WSV05                 45     55  0
     D  WSV06                 56     66  0
     D  WSV07                 67     77  0
     D  WSV08                 78     88  0
     D  WSV09                 89     99  0
     D  WSV10                100    110  0
     D  WSV11                111    121  0
     D  WSV12                122    132  0
     D  WSV13                133    143  0
     D  V                      1    143  0 DIM(13)
     D                 DS
     D  WSV21                  1     11  0
     D  WSV22                 12     22  0
     D  WSV23                 23     33  0
     D  WSV24                 34     44  0
     D  WSV25                 45     55  0
     D  WSV26                 56     66  0
     D  WSV27                 67     77  0
     D  WSV28                 78     88  0
     D  WSV29                 89     99  0
     D  WSV30                100    110  0
     D  WSV31                111    121  0
     D  WSV32                122    132  0
     D  WSV33                133    143  0
     D  V1                     1    143  0 DIM(13)
     D                 DS
     D  STV01                  1     11  0
     D  STV02                 12     22  0
     D  STV03                 23     33  0
     D  STV04                 34     44  0
     D  STV05                 45     55  0
     D  STV06                 56     66  0
     D  STV07                 67     77  0
     D  STV08                 78     88  0
     D  STV09                 89     99  0
     D  STV10                100    110  0
     D  STV11                111    121  0
     D  STV12                122    132  0
     D  STV13                133    143  0
     D  V2                     1    143  0 DIM(13)
     D                 DS
     D  WSA01                  1     11  0
     D  WSA02                 12     22  0
     D  WSA03                 23     33  0
     D  WSA04                 34     44  0
     D  WSA05                 45     55  0
     D  WSA06                 56     66  0
     D  WSA07                 67     77  0
     D  WSA08                 78     88  0
     D  WSA09                 89     99  0
     D  WSA10                100    110  0
     D  WSA11                111    121  0
     D  WSA12                122    132  0
     D  WSA13                133    143  0
     D  A                      1    143  0 DIM(13)
     D                 DS
     D  WSA21                  1     11  0
     D  WSA22                 12     22  0
     D  WSA23                 23     33  0
     D  WSA24                 34     44  0
     D  WSA25                 45     55  0
     D  WSA26                 56     66  0
     D  WSA27                 67     77  0
     D  WSA28                 78     88  0
     D  WSA29                 89     99  0
     D  WSA30                100    110  0
     D  WSA31                111    121  0
     D  WSA32                122    132  0
     D  WSA33                133    143  0
     D  A1                     1    143  0 DIM(13)
     D                 DS
     D  STA01                  1      9  0
     D  STA02                 10     18  0
     D  STA03                 19     27  0
     D  STA04                 28     36  0
     D  STA05                 37     45  0
     D  STA06                 46     54  0
     D  STA07                 55     63  0
     D  STA08                 64     72  0
     D  STA09                 73     81  0
     D  STA10                 82     90  0
     D  STA11                 91     99  0
     D  STA12                100    108  0
     D  STA13                109    117  0
     D  A2                     1    117  0 DIM(13)
     D                 DS
     D  WSAV01                 1     11  0
     D  WSAV02                12     22  0
     D  WSAV03                23     33  0
     D  WSAV04                34     44  0
     D  WSAV05                45     55  0
     D  WSAV06                56     66  0
     D  WSAV07                67     77  0
     D  WSAV08                78     88  0
     D  WSAV09                89     99  0
     D  WSAV10               100    110  0
     D  WSAV11               111    121  0
     D  WSAV12               122    132  0
     D  WSAV13               133    143  0
     D  AV                     1    143  0 DIM(13)
     D                 DS
     D  WSAV21                 1     11  0
     D  WSAV22                12     22  0
     D  WSAV23                23     33  0
     D  WSAV24                34     44  0
     D  WSAV25                45     55  0
     D  WSAV26                56     66  0
     D  WSAV27                67     77  0
     D  WSAV28                78     88  0
     D  WSAV29                89     99  0
     D  WSAV30               100    110  0
     D  WSAV31               111    121  0
     D  WSAV32               122    132  0
     D  WSAV33               133    143  0
     D  AV1                    1    143  0 DIM(13)
     D                 DS
     D  STAV01                 1      9  0
     D  STAV02                10     18  0
     D  STAV03                19     27  0
     D  STAV04                28     36  0
     D  STAV05                37     45  0
     D  STAV06                46     54  0
     D  STAV07                55     63  0
     D  STAV08                64     72  0
     D  STAV09                73     81  0
     D  STAV10                82     90  0
     D  STAV11                91     99  0
     D  STAV12               100    108  0
     D  STAV13               109    117  0
     D  AV2                    1    117  0 DIM(13)
     D                 DS
     D  WSAT01                 1     11  0
     D  WSAT02                12     22  0
     D  WSAT03                23     33  0
     D  WSAT04                34     44  0
     D  WSAT05                45     55  0
     D  WSAT06                56     66  0
     D  WSAT07                67     77  0
     D  WSAT08                78     88  0
     D  WSAT09                89     99  0
     D  WSAT10               100    110  0
     D  WSAT11               111    121  0
     D  WSAT12               122    132  0
     D  WSAT13               133    143  0
     D  AT                     1    143  0 DIM(13)
     D                 DS
     D  WSAT21                 1     11  0
     D  WSAT22                12     22  0
     D  WSAT23                23     33  0
     D  WSAT24                34     44  0
     D  WSAT25                45     55  0
     D  WSAT26                56     66  0
     D  WSAT27                67     77  0
     D  WSAT28                78     88  0
     D  WSAT29                89     99  0
     D  WSAT30               100    110  0
     D  WSAT31               111    121  0
     D  WSAT32               122    132  0
     D  WSAT33               133    143  0
     D  AT1                    1    143  0 DIM(13)
     D                 DS
     D  STAT01                 1      9  0
     D  STAT02                10     18  0
     D  STAT03                19     27  0
     D  STAT04                28     36  0
     D  STAT05                37     45  0
     D  STAT06                46     54  0
     D  STAT07                55     63  0
     D  STAT08                64     72  0
     D  STAT09                73     81  0
     D  STAT10                82     90  0
     D  STAT11                91     99  0
     D  STAT12               100    108  0
     D  STAT13               109    117  0
     D  AT2                    1    117  0 DIM(13)
     D                 DS
     D  WSSS01                 1     11  0
     D  WSSS02                12     22  0
     D  WSSS03                23     33  0
     D  WSSS04                34     44  0
     D  WSSS05                45     55  0
     D  WSSS06                56     66  0
     D  WSSS07                67     77  0
     D  WSSS08                78     88  0
     D  WSSS09                89     99  0
     D  WSSS10               100    110  0
     D  WSSS11               111    121  0
     D  WSSS12               122    132  0
     D  WSSS13               133    143  0
     D  SS                     1    143  0 DIM(13)
     D                 DS
     D  WSSS21                 1     11  0
     D  WSSS22                12     22  0
     D  WSSS23                23     33  0
     D  WSSS24                34     44  0
     D  WSSS25                45     55  0
     D  WSSS26                56     66  0
     D  WSSS27                67     77  0
     D  WSSS28                78     88  0
     D  WSSS29                89     99  0
     D  WSSS30               100    110  0
     D  WSSS31               111    121  0
     D  WSSS32               122    132  0
     D  WSSS33               133    143  0
     D  SS1                    1    143  0 DIM(13)
     D                 DS
     D  STSS01                 1      9  0
     D  STSS02                10     18  0
     D  STSS03                19     27  0
     D  STSS04                28     36  0
     D  STSS05                37     45  0
     D  STSS06                46     54  0
     D  STSS07                55     63  0
     D  STSS08                64     72  0
     D  STSS09                73     81  0
     D  STSS10                82     90  0
     D  STSS11                91     99  0
     D  STSS12               100    108  0
     D  STSS13               109    117  0
     D  SS2                    1    117  0 DIM(13)
     D                 DS
     D  WSVS01                 1     11  0
     D  WSVS02                12     22  0
     D  WSVS03                23     33  0
     D  WSVS04                34     44  0
     D  WSVS05                45     55  0
     D  WSVS06                56     66  0
     D  WSVS07                67     77  0
     D  WSVS08                78     88  0
     D  WSVS09                89     99  0
     D  WSVS10               100    110  0
     D  WSVS11               111    121  0
     D  WSVS12               122    132  0
     D  WSVS13               133    143  0
     D  VS                     1    143  0 DIM(13)
     D                 DS
     D  WSVS21                 1     11  0
     D  WSVS22                12     22  0
     D  WSVS23                23     33  0
     D  WSVS24                34     44  0
     D  WSVS25                45     55  0
     D  WSVS26                56     66  0
     D  WSVS27                67     77  0
     D  WSVS28                78     88  0
     D  WSVS29                89     99  0
     D  WSVS30               100    110  0
     D  WSVS31               111    121  0
     D  WSVS32               122    132  0
     D  WSVS33               133    143  0
     D  VS1                    1    143  0 DIM(13)
     D                 DS
     D  STVS01                 1     11  0
     D  STVS02                12     22  0
     D  STVS03                23     33  0
     D  STVS04                34     44  0
     D  STVS05                45     55  0
     D  STVS06                56     66  0
     D  STVS07                67     77  0
     D  STVS08                78     88  0
     D  STVS09                89     99  0
     D  STVS10               100    110  0
     D  STVS11               111    121  0
     D  STVS12               122    132  0
     D  STVS13               133    143  0
     D  VS2                    1    143  0 DIM(13)
     D                 DS
     D  WSMS01                 1     10  3
     D  WSMS02                11     20  3
     D  WSMS03                21     30  3
     D  WSMS04                31     40  3
     D  WSMS05                41     50  3
     D  WSMS06                51     60  3
     D  WSMS07                61     70  3
     D  WSMS08                71     80  3
     D  WSMS09                81     90  3
     D  WSMS10                91    100  3
     D  WSMS11               101    110  3
     D  WSMS12               111    120  3
     D  WSMS13               121    130  3
     D  MS                     1    130  3 DIM(13)
     D                 DS
     D  WSMS21                 1     10  3
     D  WSMS22                11     20  3
     D  WSMS23                21     30  3
     D  WSMS24                31     40  3
     D  WSMS25                41     50  3
     D  WSMS26                51     60  3
     D  WSMS27                61     70  3
     D  WSMS28                71     80  3
     D  WSMS29                81     90  3
     D  WSMS30                91    100  3
     D  WSMS31               101    110  3
     D  WSMS32               111    120  3
     D  WSMS33               121    130  3
     D  MS1                    1    130  3 DIM(13)
     D                 DS
     D  STM301                 1      9  3
     D  STM302                10     18  3
     D  STM303                19     27  3
     D  STM304                28     36  3
     D  STM305                37     45  3
     D  STM306                46     54  3
     D  STM307                55     63  3
     D  STM308                64     72  3
     D  STM309                73     81  3
     D  STM310                82     90  3
     D  STM311                91     99  3
     D  STM312               100    108  3
     D  STM313               109    117  3
     D  MS2                    1    117  3 DIM(13)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C     *IN62         IFEQ      '1'
     C     *IN63         OREQ      '1'
     C     *IN64         OREQ      '1'
     C     *IN65         OREQ      '1'
     C     *IN66         OREQ      '1'
     C                   MOVE      W2KN          WSKN
     C                   END
     C                   EXFMT     BILDE1
     C   03              GOTO      SLUTT
     C                   SETOFF                                       30
     C     WSRI          IFEQ      ' '
     C                   GOTO      START
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START
      *
     C     START2        TAG
     C  N30
     CANN04              Z-ADD     8             LINNBR
     C  N30
     CANN04              Z-ADD     28            POSNBR
     C  N30              MOVE      '0'           *IN97
     C                   EXFMT     BILDE2
     C                   SETOFF                                       999897
     C                   SETOFF                                       6030
     C   03              GOTO      SLUTT
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START2
     C                   END
     C   12              DO
     C                   MOVE      ' '           WSRI
     C                   GOTO      START
     C                   END
      *
     C     *IN62         IFEQ      '1'
     C     *IN63         OREQ      '1'
     C     *IN64         OREQ      '1'
     C     *IN65         OREQ      '1'
     C     *IN66         OREQ      '1'
     C                   MOVE      W2KN          WSKN
     C                   END
      *
     C                   EXSR      TESTB2
     C   30              GOTO      START2
      *
     C                   EXSR      HENTST
      *
     C                   MOVEA     '001'         *IN(37)
     C                   EXSR      NESTPR
      *
     C     START3        TAG
     C  N70              EXFMT     BILDE3
     C   70              EXFMT     BILDE3SJ
     C   03              GOTO      SLUTT
     C   07              DO
     C                   CALL      'SYFA29A'
     C                   PARM                    WSRI
     C     WSDTÅ         PARM      WSDTÅ         UDTÅ              2 0
     C                   PARM                    WSAVD
     C                   PARM                    WSAVDG
     C                   PARM                    YK1
     C                   PARM                    YK2
     C                   PARM                    UGR
     C     *IN           PARM      *IN           UIN
     C                   PARM                    WSMNDF
     C                   PARM                    WSMNDT
     C                   PARM                    USORT
     C   03              GOTO      SLUTT
     C   12              GOTO      START3
     C   13              MOVE      ' '           WSRI
     C   13              GOTO      START
     C                   END
     C   10              DO
     C                   EXSR      GRAFIS
     C                   GOTO      START3
     C                   END
     C   13              MOVE      ' '           WSRI
     C   12              GOTO      START2
     C   13              GOTO      START
      *
     C                   EXSR      NESTPR
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C                   MOVEA     '00000000'    *IN(40)
     C                   MOVEA     '00000000'    *IN(48)
     C                   MOVEA     '0000'        *IN(56)
     C                   MOVEA     '000000'      *IN(61)
     C                   MOVE      '0'           *IN71
     C     WSPRO         COMP      'O'                                    28
      *
     C  N29WSRI          COMP      'C'                                    40
     C   40              GOTO      SLTB1
     C     WSRI          COMP      'A'                                    41
     C   41              GOTO      SLTB1
     C  N29WSRI          COMP      'B'                                    42
     C   42              GOTO      SLTB1
     C     WSRI          COMP      'K'                                    43
     C   43              GOTO      SLTB1
     C     WSRI          COMP      'L'                                    44
     C   44              GOTO      SLTB1
     C  N29WSRI          COMP      'O'                                    45
     C   45              GOTO      SLTB1
     C  N29WSRI          COMP      'S'                                    46
     C   46              GOTO      SLTB1
     C     WSRI          COMP      'T'                                    47
     C   47              GOTO      SLTB1
     C     WSRI          COMP      'U'                                    48
     C   48              GOTO      SLTB1
     C     WSRI          COMP      'V'                                    49
     C   49              GOTO      SLTB1
     C     WSRI          COMP      'W'                                    50
     C   50              GOTO      SLTB1
     C  N29WSRI          COMP      'Y'                                    51
     C   51              GOTO      SLTB1
     C  N29WSRI          COMP      'Z'                                    52
     C   52              GOTO      SLTB1
     C  N29WSRI          COMP      'P'                                    53
     C   53              GOTO      SLTB1
     C  N29WSRI          COMP      'Q'                                    54
     C   54              GOTO      SLTB1
     C  N29WSRI          COMP      'N'                                    55
     C   55              GOTO      SLTB1
     C  N29WSRI          COMP      'R'                                    56
     C   56              GOTO      SLTB1
     C     WSRI          COMP      'X'                                    57
     C   57              GOTO      SLTB1
     C  N29WSRI          COMP      'M'                                    58
     C   58              GOTO      SLTB1
     C     WSRI          COMP      'D'                                    59
     C   59              GOTO      SLTB1
     C  N29WSRI          COMP      'F'                                    61
     C   61              GOTO      SLTB1
     C     WSRI          COMP      'G'                                    62
     C   62              GOTO      SLTB1
     C     WSRI          COMP      'J'                                    63
     C   63              GOTO      SLTB1
     C     WSRI          COMP      'H'                                    64
     C   64              GOTO      SLTB1
     C     WSRI          COMP      'I'                                    65
     C   65              GOTO      SLTB1
     C     WSRI          COMP      'E'                                    66
     C   66              GOTO      SLTB1
     C                   SETON                                        30
     C*
     C     SLTB1         TAG
     C  N44
     CANN48
     CANN49
     CANN55
     CANN57
     CANN58
     CANN59
     CANN62
     CANN66
     CANN64
     CANN65              MOVE      '1'           *IN71
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C     WSDTÅ         IFGT      50
     C                   MOVE      '19'          WSDTC
     C                   ELSE
     C                   MOVE      '20'          WSDTC
     C                   END
     C*
     C     *IN53         IFEQ      '1'
     C     *IN54         OREQ      '1'
     C     WSSTLK        IFEQ      *BLANKS
     C     WSSTED        CHAIN     STED2                              99
     C  N99              MOVE      ST2LK         WSSTLK
     C                   END
     C                   END
      *
     C     *IN42         IFEQ      '0'
     C     WSAVD         ORNE      0
     C                   MOVE      *BLANKS       WSAVDG
     C                   END
      *
     C     *IN42         IFEQ      '1'                                          1<-B
     C     WSAVDG        ANDNE     *BLANKS
     C     WSAVDG        SETLL     AVDGR
     C     WSAVDG        READE     AVDGR                                  97
     C     *IN97         IFEQ      '1'                                           2<-B
     C                   SETON                                        30
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   MOVE      'TRO0248'     MSGNR
     C                   GOTO      SLTB2
     C                   END                                                     2<-E
     C                   MOVE      AAVD          WSAVD
     C                   END                                                    1<-E
      *
     C     WSAVD         COMP      0                                      31
     C                   EXSR      LAGKEY
     C   31
     CANN28STAT2K        SETLL     STATHFL2
     C   31
     CAN 28STAT2K        SETLL     STATOHL2
     C     STTB2         TAG
     C                   EXSR      LESPOS
      *
     C   42
     CAN 60WSAVDG        IFNE      *BLANKS                                      1<-B
      * LES NESTE AVDELING I AVDELINGSGRUPPE
     C     WSAVDG        READE     AVDGR                                  97
     C     *IN97         IFEQ      '1'                                           2<-B
     C                   SETON                                        30
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   MOVE      'TRO0248'     MSGNR
     C                   GOTO      SLTB2
     C                   END                                                     2<-E
     C                   MOVE      AAVD          WSAVD
     C                   MOVEL     WSAVD         YK1
     C                   GOTO      STTB2
     C                   END                                                    1<-E
      *
     C     *IN60         IFEQ      '1'                                          1<-B
     C                   SETON                                        9930
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     28            POSNBR
     C                   MOVE      'SPS0003'     MSGNR
     C                   ELSE                                                   1
     C     WSMNDF        IFGT      WSMNDT                                        2<-B
     C                   SETON                                        9830
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   MOVE      'YBC0323'     MSGNR
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     SLTB2         ENDSR
     C*
     C***********************************************
     C     LAGKEY        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       YK1
     C                   MOVE      *BLANKS       YK2
     C   40              MOVE      WSRUND        YK1
     C   41              MOVE      WSKN          YK1
     C   42
     CANN31              MOVEL     WSAVD         YK1
     C   42
     CAN 31              MOVEL     '0001'        YK1
     C   43              MOVE      WSKN          YK1
     C   44              MOVEL     WSLKF         YK1X4             4
     C   44              MOVE      WSLKT         YK1X4
     C   44              MOVEL     YK1X4         YK1
     C   45              MOVEL     WSOT          YK1
     C   46              MOVEL     WSSG          YK1
     C   47              MOVE      WSKN          YK1
     C   48              MOVE      WSKN          YK1
     C   48              MOVEL     WSLK1         YK2X4             4
     C   48              MOVE      WSLK2         YK2X4
     C   48              MOVE      YK2X4         YK2
     C   49              MOVE      WSKN          YK1
     C   49              MOVE      WSKNA         YK2
     C   50              MOVE      WSKN          YK1
     C   51              MOVE      WSBILN        YK1
     C   52              MOVEL     WSBILK        YK1
     C   53              MOVEL     WSSTLK        YK1
     C   53              MOVE      WSSTED        YK1
     C   54              MOVEL     WSSTLK        YK1
     C   54              MOVE      WSSTED        YK1
     C   55              MOVEL     WSLKFS        YK1
     C   55              MOVE      WSSDF         YK1
     C   55              MOVEL     WSLKTS        YK2
     C   55              MOVE      WSSDT         YK2
     C   56              MOVE      WSTUR         YK1
     C   57              MOVE      WSKN          YK1
     C   57              MOVEL     WSRG1         YK2X4             4
     C   57              MOVE      WSRG2         YK2X4
     C   57              MOVE      YK2X4         YK2
     C   58              MOVEL     WSRGF         YK1X4             4
     C   58              MOVE      WSRGT         YK1X4
     C   58              MOVEL     YK1X4         YK1
     C   59              MOVEL     WSKN          YK1
     C   59              MOVE      WSOT2         YK2
     C   61              MOVEL     WSFR          YK1
     C   62              MOVEL     WSKN          YK1
     C   62              MOVE      WSFR2         YK2
     C   63              MOVEL     WSKN          YK1
     C   64
     COR 65              MOVEL     WSKN          YK1
     C   64
     COR 65              MOVEL     WSLKTS        YK2
     C   64
     COR 65              MOVE      WSSDT         YK2
     C   66              MOVEL     WSKN          YK1
     C   66              MOVE      WSFR2         YK2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     LESPOS        BEGSR
     C***********************************************
     C     *IN31         IFEQ      '0'                                          1<-B
     C  N28STAT1K        CHAIN     STATHFL1                           60
     C   28STAT1K        CHAIN     STATOHL1                           60
     C                   ELSE                                                   1
     C  N42
     CANN28STAT2K        READE     STATHFL2                               60
     C  N42
     CAN 28STAT2K        READE     STATOHL2                               60
     C   42
     CANN28STAT21        READE     STATHFL2                               60
     C   42
     CAN 28STAT21        READE     STATOHL2                               60
     C                   END                                                    1<-E
      *
     C     *IN60         IFEQ      '0'                                          1<-B
     C                   MOVE      *ZEROS        KS2
     C                   MOVE      *ZEROS        IN2
     C                   MOVE      *ZEROS        DI2
     C     *IN29         IFEQ      '0'                                           2<-B
     C  N28STADXK        CHAIN     STATDFL1                           33
     C   28STADXK        CHAIN     STATODL1                           33
     C     *IN33         IFEQ      '0'                                            3<-B
     C                   MOVEA     BL            KS2
     C                   MOVEA     BL            DI2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C  N28STADXI        CHAIN     STATDFL1                           33
     C   28STADXI        CHAIN     STATODL1                           33
     C     *IN33         IFEQ      '0'                                           2<-B
     C                   MOVEA     BL            IN2
     C                   ADD       BL            DI2
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTST        BEGSR
     C***********************************************
     C                   EXSR      HENTHE
     C*
     C                   EXSR      MOVST
     C     *IN31         IFEQ      '1'
     C     STHENT        TAG
     C                   EXSR      LESPOS
     C  N60              DO
     C                   EXSR      ADDST
     C                   GOTO      STHENT
     C                   END
     C                   END
      *
      * LES STATISTIKK FRA ANDRE AVDELINGER I SAMME AVDELINGSGRUPPE
     C   42WSAVDG        IFNE      *BLANKS
     C     STHT2         TAG
     C     WSAVDG        READE     AVDGR                                  97
     C     *IN97         IFEQ      '0'
     C                   MOVE      AAVD          WSAVD
     C                   MOVEL     WSAVD         YK1
     C                   EXSR      LESPOS
     C  N60              EXSR      ADDST
     C                   GOTO      STHT2
     C                   END
     C                   END
      *
     C                   EXSR      MOVST1
      *
     C     WSMNDF        IFGT      1                                            1<-B
     C     WSMNDT        ORLT      12
      * IKKE VIS ANTALL I VEKTGRUPPE.  (*IN32 PÅ)
     C                   MOVE      '1'           *IN32
     C     WSMNDF        SUB       1             XNF               3 0
     C     WSMNDT        ADD       1             XNT               3 0
     C     1             DO        XNF           XN                3 0           2<-B
     C                   MOVE      *ZEROS        IN(XN)
     C                   MOVE      *ZEROS        KS(XN)
     C                   MOVE      *ZEROS        DI(XN)
     C                   MOVE      *ZEROS        FB(XN)
     C                   MOVE      *ZEROS        V(XN)
     C                   MOVE      *ZEROS        A(XN)
     C                   MOVE      *ZEROS        AV(XN)
     C                   MOVE      *ZEROS        SS(XN)
     C                   MOVE      *ZEROS        AT(XN)
     C                   MOVE      *ZEROS        VS(XN)
     C                   MOVE      *ZEROS        MS(XN)
     C                   END                                                     2<-E
     C     XNT           DO        12            XN                              2<-B
     C                   MOVE      *ZEROS        IN(XN)
     C                   MOVE      *ZEROS        KS(XN)
     C                   MOVE      *ZEROS        DI(XN)
     C                   MOVE      *ZEROS        FB(XN)
     C                   MOVE      *ZEROS        V(XN)
     C                   MOVE      *ZEROS        A(XN)
     C                   MOVE      *ZEROS        AV(XN)
     C                   MOVE      *ZEROS        SS(XN)
     C                   MOVE      *ZEROS        AT(XN)
     C                   MOVE      *ZEROS        VS(XN)
     C                   MOVE      *ZEROS        MS(XN)
     C                   END                                                     2<-E
     C                   MOVE      *ZEROS        IN(13)
     C                   MOVE      *ZEROS        KS(13)
     C                   MOVE      *ZEROS        DI(13)
     C                   MOVE      *ZEROS        FB(13)
     C                   MOVE      *ZEROS        V(13)
     C                   MOVE      *ZEROS        A(13)
     C                   MOVE      *ZEROS        AV(13)
     C                   MOVE      *ZEROS        SS(13)
     C                   MOVE      *ZEROS        AT(13)
     C                   MOVE      *ZEROS        VS(13)
     C                   MOVE      *ZEROS        MS(13)
     C     WSMNDF        DO        WSMNDT        XN                              2<-B
     C                   ADD       IN(XN)        IN(13)
     C                   ADD       KS(XN)        KS(13)
     C                   ADD       DI(XN)        DI(13)
     C                   ADD       FB(XN)        FB(13)
     C                   ADD       V(XN)         V(13)
     C                   ADD       A(XN)         A(13)
     C                   ADD       AV(XN)        AV(13)
     C                   ADD       SS(XN)        SS(13)
     C                   ADD       AT(XN)        AT(13)
     C                   ADD       VS(XN)        VS(13)
     C                   ADD       MS(XN)        MS(13)
     C                   END                                                     2<-E
     C                   ELSE
     C                   MOVE      '0'           *IN32
     C                   END                                                    1<-E
      *
     C                   SUB       1             WSDTÅC
      *
      * LES STATISTIKK FRA FØRSTE AVDELING I SAMME AVDELINGSGRUPPE
     C     *IN42         IFEQ      '1'                                          1<-B
     C     WSAVDG        ANDNE     *BLANKS
     C     WSAVDG        SETLL     AVDGR                              97
     C     STNT3         TAG
     C     WSAVDG        READE     AVDGR                                  97
     C     *IN97         IFEQ      '0'                                           2<-B
     C                   MOVE      AAVD          WSAVD
     C                   MOVEL     WSAVD         YK1
     C                   EXSR      LESPOS
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C   31
     CANN28STAT2K        SETLL     STATHFL2
     C   31
     CAN 28STAT2K        SETLL     STATOHL2
     C                   EXSR      LESPOS
     C                   END                                                    1<-E
      *
     C   60              DO
     C                   MOVE      *ZEROS        IN1
     C                   MOVE      *ZEROS        KS1
     C                   MOVE      *ZEROS        DI1
     C                   MOVE      *ZEROS        FB1
     C                   MOVE      *ZEROS        V1
     C                   MOVE      *ZEROS        A1
     C                   MOVE      *ZEROS        AV1
     C                   MOVE      *ZEROS        SS1
     C                   MOVE      *ZEROS        AT1
     C                   MOVE      *ZEROS        VS1
     C                   MOVE      *ZEROS        MS1
     C     *IN42         IFEQ      '1'                                           2<-B
     C     WSAVDG        ANDNE     *BLANKS
     C                   GOTO      STHT3
     C                   ELSE                                                    2
     C                   GOTO      SLHENT
     C                   END                                                     2<-E
     C                   END
      *
     C  N31              EXSR      MOVST
     C   31              DO
     C                   EXSR      MOVST
     C     STHEN2        TAG
     C                   EXSR      LESPOS
     C  N60              DO
     C                   EXSR      ADDST
     C                   GOTO      STHEN2
     C                   END
     C                   END
      *
      * LES STATISTIKK FRA ANDRE AVDELINGER I SAMME AVDELINGSGRUPPE
     C   42WSAVDG        IFNE      *BLANKS
     C     STHT3         TAG
     C     WSAVDG        READE     AVDGR                                  97
     C     *IN97         IFEQ      '0'
     C                   MOVE      AAVD          WSAVD
     C                   MOVEL     WSAVD         YK1
     C                   EXSR      LESPOS
     C  N60              EXSR      ADDST
     C                   GOTO      STHT3
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C                   ADD       1             WSDTÅC
     C   42WSAVDG        IFNE      *BLANKS
     C                   MOVE      *ZEROS        WSAVD
     C                   END
      *
     C     WSMNDF        IFGT      1
     C     WSMNDT        ORLT      12
     C     WSMNDF        SUB       1             XNF               3 0
     C     WSMNDT        ADD       1             XNT               3 0
     C     1             DO        XNF           XN                3 0
     C                   MOVE      *ZEROS        IN1(XN)
     C                   MOVE      *ZEROS        KS1(XN)
     C                   MOVE      *ZEROS        DI1(XN)
     C                   MOVE      *ZEROS        FB1(XN)
     C                   MOVE      *ZEROS        V1(XN)
     C                   MOVE      *ZEROS        A1(XN)
     C                   MOVE      *ZEROS        AV1(XN)
     C                   MOVE      *ZEROS        SS1(XN)
     C                   MOVE      *ZEROS        AT1(XN)
     C                   MOVE      *ZEROS        VS1(XN)
     C                   MOVE      *ZEROS        MS1(XN)
     C                   END
     C     XNT           DO        12            XN
     C                   MOVE      *ZEROS        IN1(XN)
     C                   MOVE      *ZEROS        KS1(XN)
     C                   MOVE      *ZEROS        DI1(XN)
     C                   MOVE      *ZEROS        FB1(XN)
     C                   MOVE      *ZEROS        V1(XN)
     C                   MOVE      *ZEROS        A1(XN)
     C                   MOVE      *ZEROS        AV1(XN)
     C                   MOVE      *ZEROS        SS1(XN)
     C                   MOVE      *ZEROS        AT1(XN)
     C                   MOVE      *ZEROS        VS1(XN)
     C                   MOVE      *ZEROS        MS1(XN)
     C                   END
     C                   MOVE      *ZEROS        IN1(13)
     C                   MOVE      *ZEROS        KS1(13)
     C                   MOVE      *ZEROS        DI1(13)
     C                   MOVE      *ZEROS        FB1(13)
     C                   MOVE      *ZEROS        V1(13)
     C                   MOVE      *ZEROS        A1(13)
     C                   MOVE      *ZEROS        AV1(13)
     C                   MOVE      *ZEROS        SS1(13)
     C                   MOVE      *ZEROS        AT1(13)
     C                   MOVE      *ZEROS        VS1(13)
     C                   MOVE      *ZEROS        MS1(13)
     C     WSMNDF        DO        WSMNDT        XN
     C                   ADD       IN1(XN)       IN1(13)
     C                   ADD       KS1(XN)       KS1(13)
     C                   ADD       DI1(XN)       DI1(13)
     C                   ADD       FB1(XN)       FB1(13)
     C                   ADD       V1(XN)        V1(13)
     C                   ADD       A1(XN)        A1(13)
     C                   ADD       AV1(XN)       AV1(13)
     C                   ADD       SS1(XN)       SS1(13)
     C                   ADD       AT1(XN)       AT1(13)
     C                   ADD       VS1(XN)       VS1(13)
     C                   ADD       MS1(XN)       MS1(13)
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTHE        BEGSR
     C***********************************************
     C   41
     COR 43
     COR 48
     COR 49
     COR 50
     COR 57
     COR 59
     COR 66
     COR 62              DO
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              MOVE      KNAVN         WSNA
     C   33              MOVE      *BLANKS       WSNA
     C                   END
     C   63              DO
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              MOVE      KNAVN         WSNA
     C   33              MOVE      *BLANKS       WSNA
     C                   END
     C   42WSAVDG        IFEQ      *BLANKS
     C     KODTAK        CHAIN     KODTA                              33
     C  N33              MOVEL     KOANVN        WSNA
     C   33              MOVE      *BLANKS       WSNA
     C                   ELSE
     C                   MOVE      *BLANKS       WSNA
     C                   MOVEL     WSAVDG        WSNA
     C                   END
     C   45              DO
     C     KODOTK        CHAIN     KODTOTY                            33
     C                   MOVE      *BLANKS       WSNA
     C  N33              MOVEL     KO1NTX        WSNA
     C                   END
     C   46              DO
     C     KODSFK        CHAIN     KODTSF                             33
     C                   MOVE      *BLANKS       WSNA
     C  N33              MOVEL     KOSFNV        WSNA
     C                   END
     C   47              DO
     C     TRANK         CHAIN     TRAN                               33
     C  N33              MOVE      VMNAVN        WSNA
     C   33              MOVE      *BLANKS       WSNA
     C                   END
     C   53
     COR 54              DO
     C     STEDK         CHAIN     STED2D                             33
     C                   MOVE      *BLANKS       WSNA
     C  N33              MOVEL     ST2NVN        WSNA
     C                   END
     C   52              DO
     C     WSBILK        CHAIN     BILK                               33
     C                   MOVE      *BLANKS       WSNA
     C  N33              MOVEL     BKTXT         WSNA
     C                   END
     C   61              DO
     C     KODFRK        CHAIN     KODTFR                             33
     C                   MOVE      *BLANKS       WSNA
     C  N33              MOVEL     KFRNTX        WSNA
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVST         BEGSR
     C***********************************************
     C     1             DO        13            XN                3 0
     C                   Z-ADD     DI2(XN)       DI1(XN)
     C                   Z-ADD     IN2(XN)       IN1(XN)
     C                   Z-ADD     KS2(XN)       KS1(XN)
     C                   ENDDO
     C                   MOVE      FB2           FB1
     C                   MOVE      V2            V1
     C                   MOVE      A2            A1
     C                   MOVE      AV2           AV1
     C                   MOVE      SS2           SS1
     C                   MOVE      AT2           AT1
     C                   MOVE      VS2           VS1
     C                   MOVE      MS2           MS1
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVST1        BEGSR
     C***********************************************
     C                   MOVE      IN1           IN
     C                   MOVE      KS1           KS
     C                   MOVE      DI1           DI
     C                   MOVE      FB1           FB
     C                   MOVE      V1            V
     C                   MOVE      A1            A
     C                   MOVE      AV1           AV
     C                   MOVE      SS1           SS
     C                   MOVE      AT1           AT
     C                   MOVE      VS1           VS
     C                   MOVE      MS1           MS
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     ADDST         BEGSR
     C***********************************************
     C                   ADD       IN2           IN1
     C                   ADD       KS2           KS1
     C                   ADD       DI2           DI1
     C                   ADD       FB2           FB1
     C                   ADD       V2            V1
     C                   ADD       A2            A1
     C                   ADD       AV2           AV1
     C                   ADD       SS2           SS1
     C                   ADD       AT2           AT1
     C                   ADD       VS2           VS1
     C                   ADD       MS2           MS1
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     NESTPR        BEGSR
     C***********************************************
     C                   SELECT                                                 1<-B
      * PERIODE 09-12
     C     WSMNDF        WHENGT    8
     C                   MOVEA     '001'         *IN(37)
      * PERIODE 05-12
     C     WSMNDF        WHENGT    4
     C     WSMNDT        ANDGT     8
     C     *IN39         IFEQ      '1'                                           2<-B
     C                   MOVEA     '010'         *IN(37)
     C                   ELSE                                                    2
     C                   MOVEA     '001'         *IN(37)
     C                   END                                                     2<-E
      * PERIODE 05-08
     C     WSMNDF        WHENGT    4
     C     WSMNDT        ANDLE     8
     C                   MOVEA     '010'         *IN(37)
      * PERIODE 01-04
     C     WSMNDT        WHENLT    5
     C                   MOVEA     '100'         *IN(37)
      * PERIODE 01-08
     C     WSMNDT        WHENLT    9
     C     *IN37         IFEQ      '1'                                           2<-B
     C                   MOVEA     '010'         *IN(37)
     C                   ELSE                                                    2
     C                   MOVEA     '100'         *IN(37)
     C                   END                                                     2<-E
      * PERIODE 01-12
     C     *IN37         WHENEQ    '1'
     C                   MOVEA     '010'         *IN(37)
     C     *IN38         WHENEQ    '1'
     C                   MOVEA     '001'         *IN(37)
     C                   OTHER
     C                   MOVEA     '100'         *IN(37)
     C                   ENDSL                                                  1<-E
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     31
     C                   CALL      'SYFA14B'
     C                   PARM                    WSAVD
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     34
     C                   CALL      'SYFA59A'
     C                   PARM                    WSAVDG
     C                   GOTO      SLSØK
     C                   END
      *
     C   41
     COR 43
     COR 48
     COR 49
     COR 50
     COR 57
     COR 59
     COR 66
     COR 62LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     35
     C                   EXSR      SØKKUN
     C                   GOTO      SLSØK
     C                   END
N01   *
N01  C   49LINNBR        IFEQ      14
N01  C     POSNBR        ANDGE     28
N01  C     POSNBR        ANDLE     35
N01  C                   EXSR      SØKKUN
N01  C                   GOTO      SLSØK
N01  C                   END
N01   *
     C   64
     COR 65
     COR 63LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     35
     C                   EXSR      SØKKUN
     C                   GOTO      SLSØK
     C                   END
      *
     C   44LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKF
     C                   PARM                    USPED
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   47LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     35
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKN
     C                   GOTO      SLSØK
     C                   END
      *
     C   53
     COR 54LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     32
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSTED
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     46            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   53
     COR 54LINNBR        IFEQ      12
     C     POSNBR        ANDGE     46
     C     POSNBR        ANDLE     47
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSSTLK
     C                   PARM                    USPED
     C                   GOTO      SLSØK
     C                   END
      *
     C   55LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKFS
     C                   PARM                    USPED
     C                   Z-ADD     58            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   55LINNBR        IFEQ      12
     C     POSNBR        ANDGE     58
     C     POSNBR        ANDLE     62
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDF
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   45LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   61LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     30
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   58LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSRGF
     C                   PARM                    USPED
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   44LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKT
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   48LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK1
     C                   PARM                    USPED
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   64
     COR 65
     COR 55LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKTS
     C                   PARM                    USPED
     C                   Z-ADD     58            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   64
     COR 65
     COR 55LINNBR        IFEQ      14
     C     POSNBR        ANDGE     58
     C     POSNBR        ANDLE     62
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDT
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   57LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSRG1
     C                   PARM                    USPED
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   58LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSRGT
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   59LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT2
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   62LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     30
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR2
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   66LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     30
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR2
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   48LINNBR        IFEQ      16
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLK2
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   57LINNBR        IFEQ      16
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSRG2
     C                   PARM                    USPED
     C                   Z-ADD     28            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     SØKKUN        BEGSR
     C***********************************************
     C     *IN62         IFEQ      '1'
     C     *IN63         OREQ      '1'
     C     *IN64         OREQ      '1'
     C     *IN65         OREQ      '1'
     C     *IN66         OREQ      '1'
     C                   MOVE      W2KN          WSKN
     C                   END
S01  C* N49              Z-ADD     1             SOANTK
S01  C*  49              Z-ADD     2             SOANTK
S01  C*                  CALL      'SOEKUN'
S01  C*                  PARM                    FIFIRM
S01  C*                  PARM                    SOANTK
S01  C*                  PARM                    SOTXT1
S01  C*                  PARM                    WSKN
S01  C*                  PARM                    SOTXT2
S01  C*                  PARM                    WSKNA
S01  C*                  PARM                    SOTXT3
S01  C*                  PARM                    SOKNR3
S01  C*                  PARM                    SOTXT4
S01  C*                  PARM                    SOKNR4
S01  C*                  PARM                    SOTXT5
S01  C*                  PARM                    SOKNR5
S01  C*                  PARM                    SOTXT6
S01  C*                  PARM                    SOKNR6
S01  C*                  PARM                    SOTXT7
S01  C*                  PARM                    SOKNR7
S01  C*                  PARM                    SOTXT8
S01  C*                  PARM                    SOKNR8
N01   *
N01  C     LINNBR        IFEQ      12
N01  C     POSNBR        ANDGE     28
N01  C     POSNBR        ANDLE     35
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKN
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   END
N01   *
N01  C     LINNBR        IFEQ      14
N01  C     POSNBR        ANDGE     28
N01  C     POSNBR        ANDLE     35
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNA
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   END
      *
     C     *IN62         IFEQ      '1'
     C     *IN63         OREQ      '1'
     C     *IN64         OREQ      '1'
     C     *IN65         OREQ      '1'
     C     *IN66         OREQ      '1'
     C                   MOVE      WSKN          W2KN
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     STAT1K        KLIST
     C                   KFLD                    WSRI
     C                   KFLD                    WSDTC
     C                   KFLD                    WSDTÅ
     C                   KFLD                    WSAVD
     C                   KFLD                    YK1
     C                   KFLD                    YK2
     C     STAT2K        KLIST
     C                   KFLD                    WSRI
     C                   KFLD                    WSDTC
     C                   KFLD                    WSDTÅ
     C                   KFLD                    YK1
     C                   KFLD                    YK2
     C     STAT21        KLIST
     C                   KFLD                    WSRI
     C                   KFLD                    WSDTC
     C                   KFLD                    WSDTÅ
     C     STADXK        KLIST
     C                   KFLD                    STSTNR
     C                   KFLD                    XGRKX
     C                   MOVE      'XK'          XGRKX             2
     C     STADXI        KLIST
     C                   KFLD                    STSTNR
     C                   KFLD                    XGRKI
     C                   MOVE      'XI'          XGRKI             2
     C     KODTAK        KLIST
     C                   KFLD                    YAUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    KOVUNI
     C                   KFLD                    KOVAVD
     C     KODOTK        KLIST
     C                   KFLD                    YOTUNI
     C                   KFLD                    WSOT
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    WSFR
     C     KODSFK        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    WSSG
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKN
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKN
     C     STEDK         KLIST
     C                   KFLD                    WSSTLK
     C                   KFLD                    WSSTED
      *
     C     *ENTRY        PLIST
     C                   PARM                    USJØ              1
     C*
     C     USJØ          COMP      'J'                                    70
      *
     C                   MOVE      *ZEROS        WSKN
     C                   CALL      'SYFA29CA'
     C                   PARM                    UUSRID           10
     C     UUSRID        CHAIN     SIF                                27
     C  N27              MOVE      '1'           *IN29
     C  N27              MOVE      IKN           WSKN
     C     FIFIRM        SETLL     FIRM                               27
     C                   READ      FIRM                                   27
      *
     C                   MOVE      *ZEROS        WSDTÅC
     C                   MOVE      UYEAR         WSDTÅ
     C                   MOVEL     'JJJJJJJJ'    UGR              10
     C                   MOVE      'JJ'          UGR
     C                   MOVE      '1'           USORT             1
     C                   Z-ADD     1             WSMNDF
     C                   Z-ADD     12            WSMNDT
     C                   MOVE      *BLANKS       YK1               8
     C                   MOVE      *BLANKS       YK2               8
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      'FR'          YFRUNI            2
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      'SF'          YSFUNI            2
     C                   MOVE      *ZEROS        IN
     C                   MOVE      *ZEROS        IN1
     C                   MOVE      *ZEROS        IN2
     C                   MOVE      *ZEROS        KS
     C                   MOVE      *ZEROS        KS1
     C                   MOVE      *ZEROS        KS2
     C                   MOVE      *ZEROS        DI
     C                   MOVE      *ZEROS        DI1
     C                   MOVE      *ZEROS        DI2
     C                   MOVE      *ZEROS        BL
     C                   MOVE      *ZEROS        FB
     C                   MOVE      *ZEROS        FB1
     C                   MOVE      *ZEROS        FB2
     C                   MOVE      *ZEROS        V
     C                   MOVE      *ZEROS        V1
     C                   MOVE      *ZEROS        V2
     C                   MOVE      *ZEROS        A
     C                   MOVE      *ZEROS        A1
     C                   MOVE      *ZEROS        A2
     C                   MOVE      *ZEROS        AV
     C                   MOVE      *ZEROS        AV1
     C                   MOVE      *ZEROS        AV2
     C                   MOVE      *ZEROS        AT
     C                   MOVE      *ZEROS        AT1
     C                   MOVE      *ZEROS        AT2
     C                   MOVE      *ZEROS        SS
     C                   MOVE      *ZEROS        SS1
     C                   MOVE      *ZEROS        SS2
     C                   MOVE      *ZEROS        VS
     C                   MOVE      *ZEROS        VS1
     C                   MOVE      *ZEROS        VS2
     C                   MOVE      *ZEROS        MS
     C                   MOVE      *ZEROS        MS1
     C                   MOVE      *ZEROS        MS2
     C                   MOVE      'V'           KOVUNI
     C                   MOVE      *ZEROS        KOVAVD
     C     KODTVK        CHAIN     KODTV                              27
     C     KOVPRO        COMP      'B'                                2727
     C   27              MOVE      KOVPRO        WSPRO
     C*
S01  C*                  Z-ADD     2             SOANTK            1 0
S01  C*                  MOVE      *BLANKS       SOTXT1            8
S01  C*                  MOVE      *BLANKS       SOTXT2            8
S01  C*                  MOVE      *BLANKS       SOTXT3            8
S01  C*                  MOVE      *BLANKS       SOTXT4            8
S01  C*                  MOVE      *BLANKS       SOTXT5            8
S01  C*                  MOVE      *BLANKS       SOTXT6            8
S01  C*                  MOVE      *BLANKS       SOTXT7            8
S01  C*                  MOVE      *BLANKS       SOTXT8            8
S01  C*                  MOVE      *ZEROS        SOKNR3            8 0
S01  C*                  MOVE      *ZEROS        SOKNR4            8 0
S01  C*                  MOVE      *ZEROS        SOKNR5            8 0
S01  C*                  MOVE      *ZEROS        SOKNR6            8 0
S01  C*                  MOVE      *ZEROS        SOKNR7            8 0
S01  C*                  MOVE      *ZEROS        SOKNR8            8 0
S01  C*
S01  C*                  EXSR      MSGHE
     C*
     C                   ENDSR
     C*
S01  C***********************************************
S01  C*    MSGHE         BEGSR
S01  C***********************************************
S01  C*                  MOVE      'DIV0487'     XMSGNR            7            MELDING-ID
S01  C*                  Z-ADD     3             XLEVEL            1 0          NIVÅ
S01  C*                  Z-ADD     0             XRETUR            1 0          RETURKODE
S01  C*                  Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
S01  C*                  CALL      'SUBR23R3'
S01  C*                  PARM                    XMSGNR
S01  C*                  PARM                    SOTXT1
S01  C*                  PARM                    XLEVEL
S01  C*                  PARM                    XRETUR
S01  C*                  PARM                    XMSGL
S01  C*                  MOVE      'DIV0488'     XMSGNR            7            MELDING-ID
S01  C*                  Z-ADD     3             XLEVEL            1 0          NIVÅ
S01  C*                  Z-ADD     0             XRETUR            1 0          RETURKODE
S01  C*                  CALL      'SUBR23R3'
S01  C*                  PARM                    XMSGNR
S01  C*                  PARM                    SOTXT2
S01  C*                  PARM                    XLEVEL
S01  C*                  PARM                    XRETUR
S01  C*                  PARM                    XMSGL
S01  C*
S01  C*                  ENDSR
S01  C*
     C******************************************
     C     GRAFIS        BEGSR
     C******************************************
      *
      * FINNER HØYESTE VERDI
     C     STGRAF        TAG
     C                   EXFMT     GRAFIKK
     C   12              GOTO      UTGRAF
     C     GRAFNR        IFLT      1
     C     GRAFNR        ORGT      8
     C                   GOTO      STGRAF
     C                   END
     C                   Z-ADD     40            XMSGL             4 0          LENGDE PÅ MELDING
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
      *
     C     1             DO        12            NR                2 0
     C                   SELECT
     C     GRAFNR        WHENEQ    1
     C                   MOVE      'YBC0329'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     IN(NR)        F(NR)
     C     GRAFNR        WHENEQ    2
     C                   MOVE      'YBC0330'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     KS(NR)        F(NR)
     C     GRAFNR        WHENEQ    3
     C                   MOVE      'DIV1303'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     FB(NR)        F(NR)
     C     GRAFNR        WHENEQ    4
     C                   MOVE      'DIV1304'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     V(NR)         F(NR)
     C     GRAFNR        WHENEQ    5
     C                   MOVE      'DIV1305'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     A(NR)         F(NR)
     C     GRAFNR        WHENEQ    6
     C                   MOVE      'DIV1306'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     AV(NR)        F(NR)
     C     GRAFNR        WHENEQ    7
     C                   GOTO      STGRAF
     C                   OTHER
     C                   MOVE      'DIV2050'     XMSGNR            7            MELDING-ID
     C                   EXSR      GRAF01
     C                   Z-ADD     DI(NR)        F(NR)
     C                   ENDSL
     C                   END
      *
     C                   Z-ADD     GRAFNR        GNR               2 0
     C                   CALL      'SYSP01'
     C                   PARM                    F(1)
     C                   PARM                    F(2)
     C                   PARM                    F(3)
     C                   PARM                    F(4)
     C                   PARM                    F(5)
     C                   PARM                    F(6)
     C                   PARM                    F(7)
     C                   PARM                    F(8)
     C                   PARM                    F(9)
     C                   PARM                    F(10)
     C                   PARM                    F(11)
     C                   PARM                    F(12)
     C                   PARM                    TEXTGR
     C                   GOTO      STGRAF
      *
     C     UTGRAF        ENDSR
      *
     C******************************************
     C     GRAF01        BEGSR
     C******************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    TEXTGR           40
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
      *
     C                   ENDSR
      *
