********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 TOLLSTEDSKODE ER ENDRET 4.0
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SKRIVE UT FORPASSING                   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26                            ***
      *** LEDIGE INDIKATORER 27-32 34 35 37-40 42-54 56-99    ***
      ***********************************************************
      *
     FHEADF     UF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FDOKUT     UF   E           K DISK
     FDOKUT1    IF   E           K DISK    RENAME(DOKUTR:DOKUT1R)
     FKODTTST   IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FKODTA     IF   E           K DISK
     FTOLLDEK   O    F   85        PRINTER
     F                                     FORMLEN(72)
     F                                     FORMOFL(72)
     FKODTP     IF   E           K DISK
     FKODTFM    IF   E           K DISK
     D MN              S             17    DIM(20)
     D VS              S             25    DIM(20)
     D F1              S             75    DIM(9)
     D F2              S             75    DIM(9)
     D                 DS
     D  IDAG                   1      8  0
     D  IDAGÅ                  1      4  0
     D  IDAGM                  5      6  0
     D  IDAGD                  7      8  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  UDT                   64     69  0
V10  D  UOPD                  82     88  0
     D  UGN                  981    995
     C*
     C                   EXSR      INIT
     C*
     C     ' '           SETLL     DOKUT1
     C     START         TAG
     C     ' '           READE     DOKUT1                                 33
     C   33              GOTO      SLUTT
     C     DTSG          IFNE      USG
     C                   GOTO      START
     C                   END
     C     HEADFK        CHAIN     HEADF                              36
     C   36              GOTO      START
     C                   UPDATE    HEADFR
     C     USG           IFNE      'ALL'
     C     USG           ANDNE     HESG
     C                   GOTO      START
     C                   END
     C     UAVD          IFNE      HEAVD
     C                   GOTO      START
     C                   END
     C*
     C* SKJEKKER OM TURNR ER TASTET
     C*
     C     UPRO          IFNE      0
     C     UPRO          ANDNE     HEPRO
V10  C*    UPRO          ANDNE     HEOPD
V10  C     UOPD          ANDEQ     0
V10  C     UOPD          ORNE      0
V10  C     UOPD          ANDNE     HEOPD
V10  C     UPRO          ANDEQ     0
     C                   GOTO      START
     C                   END
     C*
     C* SKJEKKER OM GODSNR ER TASTET
     C*
     C     UGN           IFNE      *BLANKS
     C     UGN           IFNE      HEGN
     C                   GOTO      START
     C                   END
     C     UDT           IFNE      0
     C     UDT8          ANDGT     HEDTR
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C                   EXSR      TOLL
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   MOVE      XPRANT        UPRANT
     C                   SETON                                        LR
     C                   RETURN
     C*
     C******************************************
     C     TOLL          BEGSR
     C******************************************
     C     DOKUTK        CHAIN     DOKUT                              41
     C  N41DTTOLL        IFEQ      *BLANKS
     C                   SETON                                        41
     C                   ELSE
     C                   MOVE      DTTOLL        YTOLL
     C     KODTSK        CHAIN     KODTTST                            41
     C                   END
     C  N41USG           IFNE      'ALL'
     C                   MOVE      USG           HESG
     C                   END
     C  N41KODSFK        CHAIN     KODTSF                             41
     C   41              GOTO      SLTOLL
     C*
     C     HEKNS         IFNE      0
     C                   MOVE      HEKNS         YKN
     C     KUND1K        CHAIN     CUNDL01                            55
     C  N55DKUND         IFEQ      ' '
     C                   MOVEL     KNAVN         HENAS
     C                   MOVEL     ADR1          HEADS1
     C                   MOVEL     ADR2          HEADS2
     C                   MOVE      *BLANKS       HEADS3
     C                   MOVEL     POSTNR        HEADS3
     C                   MOVE      ADR3          HEADS3
     C                   END
     C                   END
     C*
     C                   MOVE      *BLANKS       MN
     C                   MOVE      *BLANKS       VS
     C     HEUR          IFEQ      'F'
     C     HEUR          OREQ      'G'
     C                   CALL      'SAD61PBL'
     C                   PARM      HEAVD         UAVD2             4 0
     C                   PARM      HEOPD         UOPD2             7 0
     C                   PARM                    UNR               2 0
     C                   PARM                    MN
     C                   PARM                    UNR2              2 0
     C                   PARM                    VS
     C                   END
     C     MN(1)         IFEQ      *BLANKS
     C                   MOVE      HEGM1         MN(1)
     C                   MOVE      HEGM2         MN(2)
     C                   END
     C     VS(1)         IFEQ      *BLANKS
     C                   MOVE      HEVS1         VS(1)
     C                   MOVE      HEVS2         VS(2)
     C                   END
     C*
     C*** SKRIVE UT HOVEDARK
     C                   MOVE      *BLANKS       KFMT1
     C                   MOVE      *BLANKS       KFMT2
     C     F1(1)         IFEQ      *BLANKS                                      1<-B
     C                   EXCEPT    DEL1
     C                   ELSE                                                   1
     C                   MOVE      *ZEROS        YN                3 0
     C     YN            DOWLT     9                                             2<-B
     C                   ADD       1             YN
     C     F1(YN)        IFEQ      *BLANKS                                        3<-B
     C                   ADD       10            YN
     C                   ELSE                                                     3
     C                   MOVE      F1(YN)        KFMT1
     C                   MOVE      F2(YN)        KFMT2
     C                   EXCEPT    DEL1
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C                   ADD       1             XPRANT
     C*
     C     HEADFK        CHAIN     HEADF                              41
     C  N41              MOVE      'P'           HEPK2
     C  N41              UPDATE    HEADFR
     C                   MOVE      'P'           DTST
     C                   UPDATE    DOKUTR
     C*
     C     SLTOLL        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     HEADFK        KLIST
     C                   KFLD                    DTAVD
     C                   KFLD                    DTOPD
     C     DOKUTK        KLIST
     C                   KFLD                    DTRI
     C                   KFLD                    DTAVD
     C                   KFLD                    DTOPD
     C                   KFLD                    DTFBNR
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    YKN
     C     KODTAK        KLIST
     C                   KFLD                    YAUNI
     C                   KFLD                    UAVD
     C     KODTSK        KLIST
     C                   KFLD                    YTSUNI
     C                   KFLD                    YTOLL
     C     KODSFK        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    HESG
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI            1
     C                   KFLD                    WOPAVD            4 0
     C                   KFLD                    WOPLNR            3 0
     C*
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UPRANT            2
     C                   MOVE      *ZEROS        XPRANT            2 0
     C*
     C     UDT           IFGT      501231
     C     UDT           ADD       19000000      UDT8              8 0
     C                   ELSE
     C     UDT           ADD       20000000      UDT8
     C                   END
     C                   MOVE      *ZEROS        YKN               8 0
S01  C*                  MOVE      *ZEROS        YTOLL             2 0
N01  C                   MOVE      *ZEROS        YTOLL             4 0
     C                   MOVE      'TST'         YTSUNI            3
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      'SF'          YSFUNI            2
     C                   MOVE      'P'           WOPUNI
     C*
      * Printerstyring for hovedark
     C                   Z-ADD     UAVD          WOPAVD
     C                   Z-ADD     80            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C                   MOVE      *BLANKS       F1
     C                   MOVE      *BLANKS       F2
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       KOPNVN
     C                   MOVEL     '*JOB'        KOPNVN
     C                   ELSE
     C     KOPFM         SETLL     KODTFM                             33
     C                   MOVE      *ZEROS        YN
     C     STFM1         TAG
     C     KOPFM         READE     KODTFM                                 33
     C  N33KFMT1         IFNE      *BLANKS
     C                   ADD       1             YN
     C                   MOVE      KFMT1         F1(YN)
     C                   MOVE      KFMT2         F2(YN)
     C                   END
     C  N33              GOTO      STFM1
     C                   ENDIF
     C     KODTAK        CHAIN     KODTA                              33
     C                   MOVE      KOAKNR        YKN
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              DO
     C                   MOVE      *BLANKS       KOANVN
     C                   MOVEL     KNAVN         KOANVN
     C                   MOVE      ADR1          XADR1            30
     C                   MOVE      POSTNR        XPOSTN            4 0
     C                   MOVE      ADR3          XADR3            24
     C                   MOVEL     ADR3          XADR32           12
     C                   END
     C*
     C                   MOVE      UDAY          IDAGD
     C                   MOVE      UMONTH        IDAGM
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          IDAGÅ
     C                   ELSE
     C     UYEAR         ADD       2000          IDAGÅ
     C                   END
     C*
     C                   ENDSR
     C*
     OTOLLDEK   E            DEL1             01
     O                       KFMT1               75
     OTOLLDEK   E            DEL1             03
     O                                            5 '**'
     O          E            DEL1             04
     O                                            5 '**'
     O                                           47 'FO'
     O          E            DEL1             08
     O                       HENTVS        Z     49
     O                       HENT          Z     57
     O                                           69 '    /     '
     O                       HEAVD               63
     O                       HEOPD               71
     O                       HESG                77
     O          E            DEL1             10
     O                       HENAK               39
     O          E            DEL1             11
     O                       HEADK1              39
     O          E            DEL1             12
     O                       HEADK2              39
     O          E            DEL1             13
     O                       HEADK3              39
     O          E            DEL1             20
     O                       HETRC               43
     O          E            DEL1             22
     O                       HETRI               43
     O          E            DEL1             24
     O                       HETRM         Z     11
     O          E            DEL1             25
     O                                            5 '**'
     O          E            DEL1             26
     O                                            5 '**'
     O          E            DEL1             28
     O                       HETRCN              25
     O          E            DEL1             29
     O                       HENT          Z     30
     O                       MN(1)               25
     O                       VS(1)               56
     O          E            DEL1             30
     O                       MN(2)               25
     O                       VS(2)               56
     O                       HEVKT         Z     73
     O          E            DEL1             31
     O                       MN(3)               25
     O                       VS(3)               54
     O          E            DEL1             32
     O                       MN(4)               25
     O                       VS(4)               54
     O          E            DEL1             33
     O                       MN(5)               25
     O                       VS(5)               54
     O          E            DEL1             34
     O                       MN(6)               25
     O                       VS(6)               54
     O          E            DEL1             35
     O                       MN(7)               25
     O                       VS(7)               54
     O          E            DEL1             42
     O                       HEGN                72
     O                                           73 '/'
     O                       HEPOS1              80
     O          E            DEL1             52
     O                       KOANVN              42
     O          E            DEL1             53
     O                       XADR1               39
     O          E            DEL1             54
     O                       XPOSTN              13
     O                       XADR3               38
     O          E            DEL1             55
     O                       KOSFNV              55
     O          E            DEL1             56
     O                       XADR32              27
     O                                           38 '  .  .  '
     O                       IDAG                32 '    .  .  '
     O          E            DEL1             60
     O                       KTSNAV              72
     O*
     O          E            DEL1             70
     O                       KFMT2               75
     OTOLLDEK   E            DEL1             01
     O                       KFMT1               75
     O          E            DEL1             03
     O                                            8 '**'
     O          E            DEL1             04
     O                                            8 '**'
     O                                           47 'FO'
     O          E            DEL1             08
     O                       HENTVS        Z     49
     O                       HENT          Z     57
     O                                           69 '    /     '
     O                       HEAVD               63
     O                       HEOPD               71
     O                       HESG                77
     O          E            DEL1             10
     O                       HENAK               39
     O          E            DEL1             11
     O                       HEADK1              39
     O          E            DEL1             12
     O                       HEADK2              39
     O          E            DEL1             13
     O                       HEADK3              39
     O          E            DEL1             20
     O                       HETRC               43
     O          E            DEL1             22
     O                       HETRI               43
     O          E            DEL1             24
     O                       HETRM         Z     11
     O          E            DEL1             25
     O                                            8 '**'
     O          E            DEL1             26
     O                                            8 '**'
     O          E            DEL1             28
     O                       HETRCN              25
     O          E            DEL1             29
     O                       HENT          Z     28
     O                       MN(1)               25
     O                       VS(1)               54
     O                       HEVKT         Z     73
     O          E            DEL1             30
     O                       MN(2)               25
     O                       VS(2)               54
     O          E            DEL1             31
     O                       MN(3)               25
     O                       VS(3)               54
     O          E            DEL1             32
     O                       MN(4)               25
     O                       VS(4)               54
     O          E            DEL1             33
     O                       MN(5)               25
     O                       VS(5)               54
     O          E            DEL1             34
     O                       MN(6)               25
     O                       VS(6)               54
     O          E            DEL1             35
     O                       MN(7)               25
     O                       VS(7)               54
     O          E            DEL1             42
     O                       HEGN                72
     O                                           73 '/'
     O                       HEPOS1              80
     O          E            DEL1             52
     O                       KOANVN              42
     O          E            DEL1             53
     O                       XADR1               39
     O          E            DEL1             54
     O                       XPOSTN              13
     O                       XADR3               38
     O          E            DEL1             55
     O                       KOSFNV              60
     O          E            DEL1             56
     O                       XADR32              27
     O                                           38 '  .  .  '
     O                       IDAG                32 '    .  .  '
     O          E            DEL1             60
     O                       KTSNAV              72
     O          E            DEL1             70
     O                       KFMT2               75
