      *
      ************************************************************
      *** PROGRAM SKAL VELGE PRINTER FOR STATISTIKK            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      ************************************************************
      *
     FFIRM      IF   E           K DISK
     FSYFA46FX  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  UDT2                  64     69  0
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    UPRT             10
     C                   PARM                    WSCOP             1
     C     UPRT          IFEQ      '*WRKSTN'
     C                   MOVEL     'QPRINT '     WSPRT
     C                   ELSE
     C                   MOVE      UPRT          WSPRT
     C                   END
     C                   MOVE      '1'           WSCOP
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       30
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT
     C                   END
     C*
     C     FIFIRM        SETLL     FIRM                               33
     C                   READ      FIRM                                   33
     C                   MOVE      FIFIRM        UFIRM
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
