********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 POSISJON FLYTTING I UDS
********************************************************************
      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE UT      ***
      ***                  LASTELISTE INNLAND                  ***
      ************************************************************
      *
     FTURER14   IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTH     IF   E           K DISK
     FSYFAGLFM  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  KOVFIR                 3      4
     D  KOVPRO                13     13
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     D* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
     D  XBLA1                 30    256
     D  XBLA2                257    510
     D  CMR                   30     30
     D  INS1                  56     85
     D  STAR                  55     55
     D  ULKOD                 56     60
     D  LASGOD                61     61
     D  UNYE                  62     62
S01  D* VED2                  96    125
S01  D* INS2                 126    155
S01  D* VED3                 156    185
S01  D* INS3                 186    215
S01  D* INS4                 216    245
S01  D* CFRANK               246    248
N01  D  VED2                  86    115
N01  D  INS2                 116    145
N01  D  VED3                 146    175
N01  D  INS3                 176    205
N01  D  INS4                 206    235
N01  D  CFRANK               236    238
     D* SYINN 200689 - LEV.ADRESSE STYRES FRA BESTILLINGSBILDE
     D  LEV1                 265    294
     D  LEV2                 295    324
     D  LEV3                 325    354
     D  LEV4                 355    384
     D  CSTED                385    410
     D  CDATO                411    416  0
     D  VED1                 417    446
     D  UPRT11               821    830
     D  UPT11                831    840
     D  UPRT12               841    850
     D  UPT12                851    860
     D  UPRT13               861    870
     D  UPT13                871    880
     D  BRUDDA               961    961
     I*
     C*
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    UAVD
     C                   KFLD                    WSPLNR
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    UAVD
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    UAVD
     C     KODTHK        KLIST
     C                   KFLD                    WSHUNI
     C                   KFLD                    UAVD
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    USG
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN03             1
     C                   PARM                    UIN01             1
     C                   PARM                    UUAVD             4
     C                   PARM                    UUTUR             8
     C                   MOVE      '0'           UIN01
     C                   MOVE      'N'           WSNYE
     C                   MOVE      '*ALL '       WSLKOD
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'W'           WSWUNI            1
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'H'           WSHUNI            1
     C                   MOVE      'SF'          WSFUNI            2
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C                   MOVE      *BLANKS       XBLA1
     C                   MOVE      *BLANKS       XBLA2
     C                   MOVE      '*'           STAR
     C                   MOVE      'L'           LASGOD
     C*
     C*
     C                   MOVE      UUTUR         WSPRO
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
      *
      * TURENS AVD BESTEMMER UAVD-> PRINTERVALG M.M.
     C     WSPRO         CHAIN     TURER14                            97
     C   97              GOTO      START
     C                   MOVE      TUAVD         UAVD
     C                   MOVE      TUAVD         UUAVD
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C  N99KODTHK        CHAIN     KODTH                              99
     C  N99              Z-ADD     20            WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT11
     C  N99              MOVE      KOPTY         UPT11
     C  N99              Z-ADD     21            WSPLNR
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT12
     C  N99              MOVE      KOPTY         UPT12
     C   99              GOTO      START
     C*
     C* ALLE TESTER OK -
     C*
     C*
     C                   MOVE      WSPRO         UPRO
     C                   MOVE      WSPRO         UUTUR
     C     KOHLS1        IFEQ      'L'                                                      TÅENDE')
     C                   MOVE      '0'           UIN03
     C                   ELSE
     C                   MOVE      '1'           UIN03
     C                   END
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT11
     C                   MOVE      WSPRT         UPRT12
     C                   END
     C     UPRT11        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT11
     C                   END
     C     UPT11         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT11
     C                   END
     C     UPRT12        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT12
     C                   END
     C     UPT12         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT12
     C                   END
     C*
     C*
     C*
     C     SLUTT         TAG
     C* BENYTTER VISSE UDS-POSISJONER FOR "LASTELISTE-FILTER"
     C                   MOVE      WSNYE         UNYE
     C                   MOVE      WSLKOD        ULKOD
     C                   SETON                                        LR
     C                   RETURN
     C*
     C*
