     FKODTCA    UF A E             DISK
     FSYFA80FM  CF   E             WORKSTN
      *
     C     1             CHAIN     KODTCA                             51
      *
     C     *IN51         IFEQ      *OFF
     C                   Z-ADD     KODTCALN      WODTCALN
     C                   MOVEL     KODTCASG      WODTCASG
     C                   MOVEL     KODTCAFE      WODTCAFE
     C                   MOVEL     KODTCAFN      WODTCAFN
     C                   MOVEL     KODTCAMV      WODTCAMV
     C                   MOVEL     KODTCAOV      WODTCAOV
     C                   MOVEL     KODTCAP1      WODTCAP1
     C                   MOVEL     KODTCAP2      WODTCAP2
     C                   MOVEL     KODTCAP3      WODTCAP3
     C                   MOVEL     KODTCAP4      WODTCAP4
     C                   ELSE
     C                   Z-ADD     0             WODTCALN
     C                   MOVE      *BLANKS       WODTCASG
     C                   MOVE      *BLANKS       WODTCAFE
     C                   MOVE      *BLANKS       WODTCAFN
     C                   MOVE      *BLANKS       WODTCAMV
     C                   MOVE      *BLANKS       WODTCAOV
     C                   MOVEL     'QPRINT'      WODTCAP1
     C                   MOVEL     '*LIBL'       WODTCAP2
     C                   MOVEL     'Y'           WODTCAP3
     C                   MOVEL     'Y'           WODTCAP4
     C                   ENDIF
      *
     C                   EXFMT     BILDE01
      *
     C                   Z-ADD     WODTCALN      KODTCALN
     C                   MOVEL     WODTCASG      KODTCASG
     C                   MOVEL     WODTCAFE      KODTCAFE
     C                   MOVEL     WODTCAFN      KODTCAFN
     C                   MOVEL     WODTCAMV      KODTCAMV
     C                   MOVEL     WODTCAOV      KODTCAOV
     C                   MOVEL     WODTCAP1      KODTCAP1
     C                   MOVEL     WODTCAP2      KODTCAP2
     C                   MOVEL     WODTCAP3      KODTCAP3
     C                   MOVEL     WODTCAP4      KODTCAP4
     C     *IN51         IFEQ      *OFF
     C                   UPDATE    KODTCAR
     C                   ELSE
     C                   WRITE     KODTCAR
     C                   ENDIF
      *
     C                   MOVE      *ON           *INLR
