      *__________________________________________________________
      * I-LINJER/INTERNBELASTNINGER
      * LESER OPPDRAG OG ADDERER POSTER TIL PROSJEKTREG
      * (BRUKES KUN AV NORTRAIL - DE VIL HA OGSÅ INTRENOVERFØRINGER I PROSJ-REGNSKAP)
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     FFAK5      IF   E           K DISK
     FHEADF     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FPROSL01   IF A E           K DISK
     FSYSRL01   UF   E           K DISK
     D                 DS
     D  FADOCN                 1     11
     D  FADOCN5_11             5     11
     D                 DS
     D  TEKST                  1     30
     D  HEGN                   1     15
     D  XEDTD                 17     18  0
     D  XEDTM                 19     20  0
     D  XEDTÅ                 21     22  0
     D                 DS
     D  HEDTOP                 1      8  0
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
      *
     C     *LIKE         DEFINE    FAOPKO        YYOPKO
     C     *LIKE         DEFINE    FASK          YYSK
     C     KEYFA5        KLIST
     C                   KFLD                    YYOPKO
     C                   KFLD                    YYSK
      *
     C     KEYHEA        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C     PROKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    HEPRO
     C* DEFINERER NØKKEL TIL SYSRL01
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    FIRMA         XFIRMA
     C     *LIKE         DEFINE    REGNAV        XREGNA
     C     SYSRKE        KLIST
     C                   KFLD                    XFIRMA
     C                   KFLD                    XREGNA
      *
     C     *loval        setll     FIRM
     C                   read      FIRM
      *
     C                   MOVE      'G'           YYOPKO
     C                   MOVE      'I'           YYSK
     C     KEYFA5        SETLL     FAK5
     C     KEYFA5        READE     FAK5                                   33
     C     *in33         doweq     '0'
      * Oppdraget der Ilinja ligger
     C                   MOVE      FAAVD         HEAVD
N01  C                   MOVE      FAOPD         HEOPD
     C     KEYHEA        CHAIN     HEADF                              44
     C  N44              EXSR      HOVED
      * MOT-oppdraget - direkte fra linja
     c     FAAVDR        ifne      *zeros
N01  c     FADOCN5_11    andne     *blanks
N01  C                   TESTN                   FADOCN5_11           34
     C     *IN34         IFEQ      '1'
     C                   MOVE      FAAVDR        HEAVD
N01  C                   MOVE      FADOCN5_11    HEOPD
     C     KEYHEA        CHAIN     HEADF                              44
     C  N44              EXSR      HOVED
     c                   end
     c                   end
      * MOT-oppdraget - Innh/utk-dup
     c     TRAVD0        ifne      *zeros
N01  c     TROPD0        andne     *zeros
     C                   MOVE      TRAVD0        HEAVD
N01  C                   MOVE      TROPD0        HEOPD
     C     KEYHEA        CHAIN     HEADF                              44
     C  N44              EXSR      HOVED
     c                   end
     C     KEYFA5        READE     FAK5                                   33
     c                   enddo
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      ******************************************
     C     HOVED         BEGSR
      ******************************************
     C                   MOVE      HEDTD         XEDTD
     C                   MOVE      HEDTM         XEDTM
     C                   MOVE      HEDTÅ         XEDTÅ
     C     HEUR          IFEQ      'H'
     C                   MOVE      TRRUND        HEPRO
     C                   END
     C     HEPRO         IFNE      *ZEROS
      * OPPRETTER NYTT PROSJEKT HVIS IKKE FINNES FRA FØR
     C     PROKEY        CHAIN     PROSL01                            33
     C  N33              GOTO      EHOVED
     C                   MOVE      'A'           AKTKOD
     C                   Z-ADD     99999         JOURNR
     C                   MOVE      FIFIRM        FIRMA
     C                   Z-ADD     HEPRO         PROSNR
     C                   MOVEL     TEKST         PROSNA
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          STDAAR
     C                   ELSE
     C     UYEAR         ADD       2000          STDAAR
     C                   END
     C                   MOVE      UMONTH        STDMND
     C                   MOVE      UDAY          STDDAG
     C                   MOVE      *ZEROS        SLDAAR
     C                   MOVE      *ZEROS        SLDMND
     C                   MOVE      *ZEROS        SLDDAG
     C                   MOVE      *ZEROS        BUDP
     C                   MOVE      *ZEROS        SALDOP
     C                   MOVE      *BLANKS       STOPP
     C                   MOVE      *BLANKS       PRGRUP
     C                   MOVE      HEAVD         KSTED
     C                   WRITE     PROSR
     C* OPPDATERER ANTALL BRUKTE POSTER FOR PROS
     C*
     C                   MOVE      FIFIRM        XFIRMA
     C                   MOVE      'PROSF '      XREGNA
     C     SYSRKE        CHAIN     SYSRL01                            30
     C  N30              ADD       1             ANTBRU
     C  N30              UPDATE    SYSRR
     C*
     C                   END
     C     EHOVED        ENDSR
