********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL SLETTE SIGNATURS PRINTERSTYRING  ***
      *
     FKODTPUSR  UF A E           K DISK
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C                   EXSR      INIT
     C     KEY           SETLL     KODTPUSR
     C     *IN94         DOWEQ     '0'
     C     KEY           READE     KODTPUSR                               94
     C  N94              DELETE    KOPUSRR
     C                   END
      *
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KEY           KLIST
     C                   KFLD                    WSSG
     C*
      *
     C     *ENTRY        PLIST
     C                   PARM                    USG               3
     c                   move      usg           wssg              3
     C                   ENDSR
     C*
