      *
      ***********************************************************
      * SØKE PÅ SKRIVERE
      ***********************************************************
      *
     FKODTPL2   UF A E           K DISK
     FFIRM      IF   E           K DISK
     FSYFA75FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D LN              S              2  0 DIM(20)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     C     ST1           TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   Z-ADD     *ZEROS        YLNR              3 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     *LOVAL        SETLL     KODTPL2
     C     ST2           TAG
     C                   READ      KODTPL2                                94
      *
     C     ST3           TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C     kopty         ifne      'ELTRON'
     C     kopty         andne     'STRIPE'
     c                   move      *blanks       kopty
     c                   end
     C                   WRITE     SUBFIL
     C     ST31          TAG
     C     KOPNVN        SETGT     KODTPL2
     C                   READ      KODTPL2                                94
     C  N94              MOVE      KOPNVN        KOPNVNG          10
     C  N94              END
     C                   END
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     ST4           TAG
     C                   MOVEA     '11'          *IN(91)
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       98
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      ST1
     C*** GÅ TIL BILDE02
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KOPNVNG       SETGT     KODTPL2
     C  N94              READ      KODTPL2                                94
     C                   GOTO      ST3
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      ST4
     C*
     C*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C*
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
