      *  eks 10000038 ->  0100 00038
     C                   MOVE      'SY'          UFIRM             2
     C                   MOVE      'HZ'          VMLAYO            2
     C                   MOVE      0100          DFAVD             4 0
     C                   MOVE      00038         DFOPD             7 0
     C                   MOVE      0             DFFBNR            3 0
     C                   MOVE      ' '           UUKOPI            1
     C                   CALL      'SYFA12SN'
     C                   PARM                    UFIRM             2
     C                   PARM                    VMLAYO            2
     C                   PARM                    DFAVD             4 0
     C                   PARM                    DFOPD             7 0
     C                   PARM                    DFFBNR            3 0
     C                   PARM                    UUKOPI            1
     c                   seton                                        LR
     c                   return
