********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
      *-------------------------------------------------------------
10XXX * 02 sh  PTF11 både kunde/leverandør
10XXX * 03 sh  PTF11 feil ved lesing firma
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE GEBYRS PRISAVT. (KUNDER)  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-40 45-97          ***
      ***********************************************************
      *
     FPRIK      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FKODTGE    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYFA09FM  CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
s01  D*               UDS
s01  D* FIFIRM                 1      2
     C*
     C                   EXSR      INIT
     C     UKNR          IFNE      0
     C                   GOTO      TSTPA
     C                   END
     C*
     C     BG1           TAG
     C  N30
     CANN04              Z-ADD     9             LINNBR
     C  N30
     CANN04              Z-ADD     20            POSNBR
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309998
     C*
     C   03              GOTO      SLUTT
     C   04              DO
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   EXSR      SØKDTA
     C                   GOTO      BG1
     C                   END
     C*
     C     TSTPA         TAG
     C                   EXSR      TESTB1
     C   30              GOTO      BG1
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN43
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(43)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   EXSR      MOVBY
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     PRIK1K        SETLL     PRIK
     C     START1        TAG
     C     YKNR          READE     PRIK                                   44
     C  N44WSAVTN        COMP      PKAVTN                             4444
      *
     C     START2        TAG
      *
     C  N44              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
     C                   WRITE     SUBFIL
     C     YKNR          READE     PRIK                                   44
     C  N44WSAVTN        COMP      PKAVTN                             4444
     C  N44              EXSR      MOVPY
     C  N44              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(41)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C                   SETOFF                                       30
     C*
     C*** EXIT
     C   03              GOTO      SLUTT
     C*
     C*** REFRESH
     C   05              GOTO      START
     C*
     C*** CREATE
     C   06              DO
     C                   EXSR      CRTPR
     C                   GOTO      START3
     C                   END
     C*** OLJETILLEGG M.M.
     C   07              DO
     C                   CALL      'SYFA23B'
     C                   PARM                    WSKNR
     C                   GOTO      START3
     C                   END
     C*** SEARCH
     C   08              GOTO      START6
     C*** DELETE
     C   10              GOTO      START7
     C*** CANCEL
     C   12              GOTO      BG1
     C*
     C*** ROLL
     C   25              DO
     C                   SETOFF                                       2544
     C                   Z-ADD     YRECNO        ZRECNO
     C*** READ FIRST RECORD FROM FILE THAT IS NOT AT SUBFILE
     C     PRIK3K        SETLL     PRIK
     C     YKNR          READE     PRIK                                   44
     C  N44WSAVTN        COMP      PKAVTN                             4444
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
     C*
     C*** SEARCH
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C*** DELETE
     C     START7        TAG
     C                   EXFMT     DLTAVT
     C   12              GOTO      START3
     C  N05              GOTO      START7
     C                   CALL      'SYFA09C'
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   SETOFF                                       10
     C                   GOTO      BG1
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C                   MOVE      WSKNR         YKNR
     C     KUND1K        CHAIN     CUNDL01                            99
     C   99              DO
     C                   MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
     C     WSAVTN        COMP      ' '                                    98
     C   98              DO
     C  N30              MOVE      'SPA0013'     MSGNR
     C  N30              Z-ADD     11            LINNBR
     C  N30              Z-ADD     20            POSNBR
     C                   SETON                                        30
     C                   END
     C*
     C*** WSKNRK <> 0  -->  KOPIERING AV AVTALE
     C     WSKNRK        IFNE      0
     C     PRIK4K        SETLL     PRIK
     C     YKNR          READE     PRIK                                   33
     C  N33              DO
     C     WSAVTN        COMP      PKAVTN                                 33
     C   33              DO
     C                   MOVE      'SPK0048'     MSGNR
     C                   SETON                                        9930
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
     C                   END
     C*
     C                   MOVE      WSKNRK        YKNR
     C     KUND1K        CHAIN     CUNDL01                            97
     C   97              DO
     C                   MOVE      'SPK0001'     MSGNR
     C                   SETON                                        30
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     20            POSNBR
     C                   END
     C     WSAVTK        COMP      ' '                                    96
     C   96
     CANN30              MOVE      'SPA0013'     MSGNR
     C  N96              DO
     C     PRIK4K        SETLL     PRIK
     C     YKNR          READE     PRIK                                   96
     C  N96WSAVTK        COMP      PKAVTN                             9696
     C   96
     CANN30              MOVE      'SPA0028'     MSGNR
     C                   END
     C   96              DO
     C  N30              Z-ADD     18            LINNBR
     C  N30              Z-ADD     20            POSNBR
     C                   SETON                                        30
     C                   END
     C  N30              EXSR      AVTKP
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     AVTKP         BEGSR
     C***********************************************
     C                   CALL      'SYFA09B'
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    WSKNRK
     C                   PARM                    WSAVTK
     C                   MOVE      WSKNR         YKNR
     C                   MOVE      *ZEROS        WSKNRK
     C                   MOVE      ' '           WSAVTK
     C                   MOVE      '0'           WSAVTK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(41)
     C     *IN30         DOWEQ     '0'
     C                   READC     SUBFIL                                 30
     C  N30WSNR          IFEQ      '2'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      CHGPR                                        CHANGE
     C                   GOTO      SLHENT
     C                   END
     C  N30WSNR          IFEQ      '3'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      CPYPR                                        COPY
     C                   GOTO      SLHENT
     C                   END
     C  N30WSNR          IFEQ      '4'
     C     PKGEBY        COMP      '*DL'                                  30
     C  N30              EXSR      DELPR                                        DELETE
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C   30              MOVE      'DIV0012'     MSGNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DELPR         BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C                   MOVE      ' '           WSNR
     C     UFLAGG        IFNE      1
     C                   MOVE      '*DL'         PKGEBY
     C                   MOVE      *BLANKS       KGENOT
     C                   MOVE      *BLANKS       PKAVTT
     C                   MOVE      *BLANKS       PKTNR
     C                   MOVE      *BLANKS       PKMVA
     C                   MOVE      *ZEROS        PKINT
     C                   MOVE      *ZEROS        PKLNR
     C                   MOVE      *ZEROS        PKBELØ
     C                   MOVE      *ZEROS        PKPPR
     C                   MOVE      *BLANKS       PKKOLL
     C                   MOVE      *BLANKS       PKTEGN
     C                   MOVE      *ZEROS        PKJUST
     C                   MOVE      *BLANKS       PKFVAL
     C                   MOVE      *BLANKS       PKSAMM
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGPR         BEGSR
     C***********************************************
     C                   Z-ADD     2             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CPYPR         BEGSR
     C***********************************************
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   Z-ADD     3             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C     UFLAGG        IFNE      1
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
     C                   WRITE     SUBFIL
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CRTPR         BEGSR
     C***********************************************
     C                   Z-ADD     9             UFLAGG            1 0
     C                   CALL      'SYFA09A'
N02  C                   PARM                    Ukule             1
     C                   PARM                    WSKNR
     C                   PARM                    WSAVTN
     C                   PARM                    PKGEBY
     C                   PARM                    PKAVTT
     C                   PARM                    PKTNR
     C                   PARM                    PKMVA
     C                   PARM                    PKINT
     C                   PARM                    PKLNR
     C                   PARM                    PKBELØ
     C                   PARM                    PKPPR
     C                   PARM                    PKKOLL
     C                   PARM                    PKTEGN
     C                   PARM                    PKJUST
     C                   PARM                    PKFVAL
     C                   PARM                    PKSAMM
     C                   PARM                    UFLAGG
     C*
     C     UFLAGG        IFNE      1
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C     KODGEK        CHAIN     KODTGE                             33
     C   33              MOVE      *BLANKS       KGENOT
     C                   WRITE     SUBFIL
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVBY         BEGSR
     C***********************************************
     C                   MOVE      W2GEBY        YGEBY
     C                   MOVE      W2AVTT        YAVTT
     C                   MOVE      W2INT         YINT
     C                   MOVE      W2LNR         YLNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVPY         BEGSR
     C***********************************************
     C                   MOVE      PKGEBY        YGEBY
     C                   MOVE      PKAVTT        YAVTT
     C                   MOVE      PKINT         YINT
     C                   MOVE      PKLNR         YLNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
S01  C*                  CALL      'SOEKUN'
S01  C*                  PARM                    FIFIRM
S01  C*                  PARM                    SOANTK
S01  C*                  PARM                    SOTXT1
S01  C*                  PARM                    WSKNR
S01  C*                  PARM                    SOTXT2
S01  C*                  PARM                    WSKNRK
S01  C*                  PARM                    SOTXT3
S01  C*                  PARM                    SOKNR3
S01  C*                  PARM                    SOTXT4
S01  C*                  PARM                    SOKNR4
S01  C*                  PARM                    SOTXT5
S01  C*                  PARM                    SOKNR5
S01  C*                  PARM                    SOTXT6
S01  C*                  PARM                    SOKNR6
S01  C*                  PARM                    SOTXT7
S01  C*                  PARM                    SOKNR7
S01  C*                  PARM                    SOTXT8
S01  C*                  PARM                    SOKNR8
S01  C*                  Z-ADD     11            LINNBR
S01  C*                  GOTO      SLSØK
N01   *
N01  C     LINNBR        IFEQ      9
N01  C     POSNBR        ANDGE     20
N01  C     POSNBR        ANDLE     27
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNR
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   Z-ADD     11            LINNBR
N01  C                   Z-ADD     20            POSNBR
N01  C                   GOTO      SLSØK
N01  C                   END
N01   *
N01  C     LINNBR        IFEQ      11
N01  C     POSNBR        ANDGE     20
N01  C     POSNBR        ANDLE     27
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNRK
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N01  C                   Z-ADD     18            LINNBR
N01  C                   Z-ADD     20            POSNBR
N01  C                   GOTO      SLSØK
N01  C                   END
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
N02  C                   PARM                    Ukule             1
     C                   PARM                    UKNR              8 0
     C                   MOVE      UKNR          WSKNR
n02  c     ukule         comp      'L'                                282827
     C     PRIK1K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    W2GEBY
     C                   KFLD                    W2AVTT
     C                   KFLD                    W2INT
     C                   KFLD                    W2LNR
     C     PRIK2K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    PKGEBY
     C                   KFLD                    PKAVTT
     C                   KFLD                    PKINT
     C                   KFLD                    PKLNR
     C     PRIK3K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTN
     C                   KFLD                    YGEBY
     C                   KFLD                    YAVTT
     C                   KFLD                    YINT
     C                   KFLD                    YLNR
     C     PRIK4K        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    WSAVTK
     C                   KFLD                    YGEBY
     C                   KFLD                    YAVTT
     C                   KFLD                    YINT
     C                   KFLD                    YLNR
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNR
     C     KODGEK        KLIST
     C                   KFLD                    YGEUNI
     C                   KFLD                    PKGEBY
     C*
     C                   MOVE      '        '    YKNR              8
     C                   MOVE      '   '         YGEBY             3
     C                   MOVE      ' '           YAVTT             1
     C                   MOVE      *ZEROS        YINT              5 0
     C                   MOVE      *ZEROS        YLNR              4 0
     C                   MOVE      *ZEROS        W2LNR             4 0
     C                   MOVE      'GE'          YGEUNI            2
     C*
     C                   MOVE      '0'           WSAVTK
     C                   MOVE      '0'           WSAVTN
     C*
S03  C*    FIFIRM        SETLL     FIRM
n03  C     *loval        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
S01  C*                  Z-ADD     2             SOANTK            1 0
S01  C*                  MOVE      *BLANKS       SOTXT3            8
S01  C*                  MOVE      *BLANKS       SOTXT4            8
S01  C*                  MOVE      *BLANKS       SOTXT5            8
S01  C*                  MOVE      *BLANKS       SOTXT6            8
S01  C*                  MOVE      *BLANKS       SOTXT7            8
S01  C*                  MOVE      *BLANKS       SOTXT8            8
S01  C*                  MOVE      *ZEROS        SOKNR3            8 0
S01  C*                  MOVE      *ZEROS        SOKNR4            8 0
S01  C*                  MOVE      *ZEROS        SOKNR5            8 0
S01  C*                  MOVE      *ZEROS        SOKNR6            8 0
S01  C*                  MOVE      *ZEROS        SOKNR7            8 0
S01  C*                  MOVE      *ZEROS        SOKNR8            8 0
S01  C*                  MOVE      'DIV1188'     XMSGNR            7            MELDING-ID
S01  C*                  Z-ADD     3             XLEVEL            1 0          NIVÅ
S01  C*                  Z-ADD     0             XRETUR            1 0          RETURKODE
S01  C*                  Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
S01  C*                  CALL      'SUBR23R3'
S01  C*                  PARM                    XMSGNR
S01  C*                  PARM                    SOTXT1            8
S01  C*                  PARM                    XLEVEL
S01  C*                  PARM                    XRETUR
S01  C*                  PARM                    XMSGL
S01  C*                  MOVE      SOTXT1        SOTXT2            8
     C*
     C                   ENDSR
     C*
