********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
10XXX * 02 YBC PTF10 TOLLSTEDSKODE ER ENDRET TIL 4.0
10XXX * 03 JOV PTF10 HENT KUNDEINFO ETTER SØK (EXSR TESTKU)
10XXX * 04 YBC PTF10 IKKE BLANKE NAVN VED SØKING AV KUNDENR
10XXX * 05 jov PTF10 ved *NY* set inn ÅR i godsnr kun ved blank (kan være fra edi...)
10XXX * 06 JOV PTF10 Søk på "gamlemåten"(alle 8 nr)dersom cursor i pos 2-8
10XXX * 07 YBC PTF09 HENT BRUKER-ID FRA SDS
10166 * 08 JOV PTF10 Kall på FR-till-prog også ved blank av geb/sats (før kun ved ny..)
10172 * 09 SH  PTF10 norsk text til Track and trace
10172 * 10 SH  PTF10 kreditgrense ta med din ordre
10172 * 11 SH  PTF10 rettet på flytting til fakturapart
      *%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
10XXX * 12 JOV PTF11 Nye parametre SYIN10B
10XXX * 13 JOV PTF11 ptf11 tilbakeført/erstattet med IKKE autokopi til fakt-part ved X=ikke fakt
10XXX * 14 SH  PTF11 sette tilbake status
11132 * 15 YBC PTF11 3 DESIMALER PÅ KALKULATOR
11132 * 16 SH  PTF11 F17 er nå over til arkiv
11132 * 17 SH  PTF11 tatt bort F19/F20/F21 fax    RÅTT
********************************************************************
      *
      *****************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAG (LAND-IMPORT)           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 01 02 06 08 10 11 13 19 22 23
      *** LEDIGE INDIKATORE0 35-52 64 73
      *** INDIKATOR 31 32 34 PÅ BETYR KALLE FRA SYFF10 (ENDRE OPD.) ***
      *** 53 PÅ VED POSTNUMMERLOGIKK FRAKTBEREGNING
      *****************************************************************
      *
     FFORDEL5   UF   E           K DISK
     FTRACKF    O  A E           K DISK
     FTRACKT    O  A E           K DISK
     FSTATVF    O  A E           K DISK
     FHEADF     UF A E           K DISK
     FHEDUMMY   IF   E           K DISK
     F                                     RENAME(HEADFR:HEAD2R)
     FHEAD8     IF   E           K DISK
     F                                     RENAME(HEADFR:HEAD8R)
     FKODTU     IF   E           K DISK
     FOAVT      IF   E           K DISK
     FDOKUF     UF A E           K DISK
     FDOKUT     UF A E           K DISK
     FMULTKODT  IF   E           K DISK
     FKODTS2    IF   E           K DISK
     FVALUL01   IF   E           K DISK
     FKODTS4    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSTED2D    IF A E           K DISK
     FSTEDIL01  IF   E           K DISK
     FFRATXT    IF   E           K DISK
     FTELL      UF   E           K DISK
     FVADR      IF   E           K DISK
     FVADR3     IF   E           K DISK
     F                                     RENAME(VADRR:VADRR3)
     FCUNDL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FFREETXT   IF   E           K DISK
     FTURER     IF   E           K DISK
     FENADSF    IF   E           K DISK
     FKUNKO2    IF   E           K DISK
     FKOFAST    IF   E           K DISK
     FKUFAST    IF   E           K DISK
     F                                     RENAME(KOFASTR:KUFASTR)
     FUTLLOGF   IF A E           K DISK
     FCUOTI     IF   E           K DISK
     FFRISOK    UF A E           K DISK
     FKODFRI    IF   E           K DISK
     FSYFA10FM  CF   E             WORKSTN USROPN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D HØ              S              3  2 DIM(12)
     D LE              S              3  2 DIM(12)
     D BR              S              3  2 DIM(12)
     D AN              S              3  0 DIM(12)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
NRFA D                 DS
NRFA D  HERFA                  1     35
NRFA D  HERFA15                1     15
     D                 DS
     D  WSVALP                 1      3  1
     D  XVALP                  1      3  3
     D                 DS
     D  XMÅL1                  6      9
     D  XMÅL2                 11     13
     D  XMÅL                   1     13
     D                 DS
     D  WSMSG                  1     62
     D  XKN                    7     14
     D  XLIKOD                31     31
     D  XLINAV                33     62
     D                 DS
     D  WSFT1                  1     51
     D  WSFT1A                 1     30
     D  WSFT1B                31     45
     D                 DS
     D  HEFT1                  1     51
     D  HEFT1A                 1     30
     D  HEFT1B                31     45
     D                 DS
     D  WSSDL                  1     20
     D  WSSDL1                 1      1
     D  WSSDL2                 2     20
     D                 DS
     D  HEPOS1                 1      7
     D  HEPOS13                1      3
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  TUDTÅ                  1      4  0
     D  TUDTM                  5      6  0
     D  TUDTD                  7      8  0
     D  TUDT                   1      8  0
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  WEDTD                  1      2  0
     D  WEDTM                  3      4  0
     D  WEDTÅ                  5      6  0
     D  WEDTOP                 1      6  0
     D                 DS
     D  ENGAD3                 1     30
     D  SYPOGE                 1      9
     D  ADR3                  11     34
     D                 DS
     D  QDATA                  1    109
     D  QDA01                  1      2
     D  QDA02                  3      6
     D  QDA03                  7     13
s01  D* QDA04                 14     14
n01  D  QDA04                 14     15
     D  QDA05                 16     16
     D  QDA06                 17     20
     D  QDA07                 21     24
     D  QDA08                 25     26
     D  QDA09                 27     28
     D  QDA10                 29     29
     D  QDA11                 30     30
     D  QDA12                 31     37
     D  QDA13                 38     38
     D  QDA14                 39    100
     D  QDA15                101    101
     D  QDA16                102    102
     D  QDA17                103    103
     D  QDA18                104    109
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  WSGN                   1     15
     D  WSGNA                  1      4
     D  WSGNB                  5      9
     D  WSGNC                 10     15
     D                 DS
     D  HEGN                   1     15
     D  HEGN11                 5     15
     D                 DS
     D  HEGNN                  1     15
     D  HEGNNW                 5     15
     D                 DS
     D  DSTID                  1     14  0
     D  DSCENT                11     14  0
     D                 DS
     D  WSNAK                  1     30
      * SØK VIA KUNDES KUNDENR...
     D  WSSTJ1                 1      1
     D  WSKURE                 2     18
      * SØK VIA KUNDEREGISTER (IKKE VADR)
     D  WSNAKA                 1      2
     D  WSNAKB                 3     30
S12  D* ds for avd/opd (fbr) som param til syin10b)
S12  D*                DS
S12  D* HØXX                   1     36  2
S12  D*                                    DIM(12)
S12  D* xxavopfb               1     14  0
S12  D* XXAV                   1      4  0
S12  D* XXOP                   5     11  0                                      7 lang !!
S12  D* XXFB                  12     14  0
     D                UDS
     D  UUSR                 301    310
N07  D                SDS
N07  D  ZUSER                254    263
      *
     C                   OPEN      SYFA10FM
     C                   EXSR      INIT
     C                   GOTO      START1
      *
     C     START         TAG
     C  N30              DO
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       279998
     C                   END
     C     STB1A         TAG
     C*
     C     TURSOK        IFEQ      'J'
     C                   EXSR      TURSR
     C  N12              GOTO      START1
     C                   GOTO      SLUTT
     C                   END
     C*
     C                   EXFMT     BILDE01
     C     UDUMMY        IFEQ      'J'
     C   12              GOTO      SLUTT
     C                   MOVE      *ZEROS        WSOPD
     C                   EXSR      TESTB1
     C                   MOVE      *ZEROS        WSDT
     C                   SETOFF                                       30
     C                   GOTO      ST21
     C                   END
     C                   SETOFF                                       30
     C                   MOVEA     '0000'        *IN(96)
     C                   MOVE      *BLANKS       WSMSG
     C*
     C   07              DO
     C                   EXSR      GETOPD
     C     UAVDE         IFEQ      0
     C     UOPDE         OREQ      0
     C                   GOTO      STB1A
     C                   END
     C                   END
     C   12              GOTO      SLUTT
     C     START1        TAG
     C   04              DO
     C                   EXSR      TURSR
     C   12              GOTO      SLUTT
     C                   SETOFF                                       04
     C                   END
     C                   EXSR      TESTB1
     C*
     C   30UTYPE         IFEQ      'CR2'
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C     MSGNR         IFNE      'YBC0036'
     C                   MOVE      'DIV0000'     MSGNR
     C                   END
     C*
     C*** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE FAKTURA)
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      TESTB2
     C                   GOTO      START3                                       TIL FAKTURA
     C                   END
     C*
     C* 05 DIREKTE TIL FAKTURA
     C*
     C   05              DO
     C                   EXSR      TESTB2
     C                   GOTO      START3                                       TIL FAKTURA
     C                   END
     C*
     C     START2        TAG
     C   16              DO
     C                   EXSR      MOVB1
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       5763
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   MOVE      'NY'          XNYGML            2
     C                   END
     C  N30
     CANN16              Z-ADD     2             LINNBR
     C  N30
     CANN16              Z-ADD     8             POSNBR
     C*
     C     ST21          TAG
     C*
     C                   EXSR      TSTOPL
     C*
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE02
     C                   EXSR      KDTFMT
     C     UDUMMY        IFEQ      'J'
     C                   EXSR      OPDHEA
     C                   GOTO      SLUTT
     C                   END
     C                   SETOFF                                       30
     C                   MOVEA     '00000000'    *IN(90)
     C                   MOVEA     '00000000'    *IN(82)
     C                   MOVEA     '00000000'    *IN(74)
     C                   MOVEA     '00000000'    *IN(65)
     C                   MOVEA     '00000'       *IN(59)
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C* VIS F-TASTER
     C*
     C   24              DO
     C                   EXSR      UTCMDL
     C                   GOTO      ST21
     C                   END
     C*
     C* TILDEL TURNUMMER
     C*
     C   09WSPRO         IFEQ      *ZEROS
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C  N33              MOVE      TETURN        WSPRO
     C  N33              ADD       1             TETURN
     C  N33              UPDATE    TELLR
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     17            POSNBR
     C                   GOTO      ST21
     C                   END
     C* 06 = BEREGN KUBIKK
     C   06              DO
     C                   EXSR      KUBIKK
     C                   GOTO      ST21
     C                   END
     C*
     C* GÅ TIL SPØRREPROGRAM
     C*
     C   07              DO
     C                   MOVE      'S'           UTYPE2
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   GOTO      ST21
     C                   END
     C* FREETEXT
     C   18              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SPO0106'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      VISFRE
     C                   GOTO      ST21
     C                   END
     C* FRI SØKEVEI
     C                   EXSR      TESTKT
     C   15              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0126'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   GOTO      ST21
     C                   END
     C* SE PÅ NAD ADRESSER
     C   22              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0126'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   CALL      'EDI90R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      ST21
     C                   END
     C* DUPOPPDRAG INNHENT/UTKJØRING
     C   11              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'JOV0802'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      OPDHEA
     C                   Move      'J'           XXVIS             1
     C                   CALL      'SYTR11'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XXFBNR            3 0
     C                   PARM                    XXVIS
     C                   GOTO      ST21
     C                   END
     C* SEARCH CUSTOMER
     C   04              DO
     C                   EXSR      SØKDTA
     C   30              GOTO      ST21
     C     UFLAGG        IFEQ      1
     C                   GOTO      ST21
     C                   END
     C     UTYPE         IFEQ      'CHO'
     C*** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C                   GOTO      ST21
     C                   END
     C                   END
     C   12              DO
     C     HEADFK        CHAIN     HEADF                              33
S14  C* N33              MOVE      ' '           HEST
N14  C  N33              MOVE      GMST          HEST
     C  N33              UPDATE    HEADFR
     C     TURSOK        IFEQ      'J'
     C                   GOTO      STB1A
     C                   END
     C                   GOTO      SLUTT
     C                   END
     C*FINN LEV.ADR VIA KUNDENS KUNDENUMMER  (I VADR..)
     C     WSSTJ1        IFEQ      '*'
     C                   EXSR      SOKUKU
     C                   GOTO      ST21
     C                   END
      * FINN LEV.ADR VIA KUNDEREGISTER (VED AVVIK FRA KJØPER..)
     C     WSNAKA        IFEQ      'K*'
     C                   EXSR      SØKVAD
     C                   GOTO      ST21
     C                   END
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      START2
     C                   END
     C*
     C                   EXSR      TESTB2
     C   30              GOTO      ST21
     C* KALLER FORDELINGSRUTINEN
     C*
     C   17              DO
S16  C*                  EXSR      OPDHEA
S16  C*                  CALL      'SYFO01CL'
S16  C*                  PARM                    WSAVD
S16  C*                  PARM                    WSOPD
S16  C*                  PARM                    KOAKNR
S16  C*                  PARM                    XTRNV
S16  C*                  PARM                    W2KDME
S16  C*                  PARM                    W2KDE
S16  C*                  PARM                    W2TOLL
N16  C     WSOPD         IFEQ      *ZEROS
N16  C                   MOVE      'SHU1678'     MSGNR
N16  C                   SETON                                        30
N16  C                   GOTO      ST21
N16  C                   END
N16  C                   CALL      'ARC003'
N16  C                   PARM                    WSAVD
N16  C                   PARM                    WSOPD
N16  C                   PARM                    WSRUNDE          10
     C                   GOTO      ST21
     C                   END
     C*
     C* OPDATERER NYE OPPDRAG
     C*
     C  N03
     CANN05
     CANN16WSOPD         IFEQ      *ZEROS
     C                   EXSR      OPDHEA
     C                   END
     C*
     C*** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C  N03
     CANN05
     CANN16UTYPE         IFNE      'CHO'
     C                   GOTO      START2
     C                   END
     C*
     C                   EXSR      OPDHEA
     C*
     C*** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C     UTYPE         IFEQ      'CHO'
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** FORPASSING PÅ SAD-BLANKETT
     C     WSPK2         IFEQ      'J'
     C     DOKUTK        CHAIN     DOKUT                              33
     C                   EXSR      MOVWDT
     C   33              WRITE     DOKUTR
     C  N33              UPDATE    DOKUTR
     C                   MOVE      *ZEROS        W2TOLL
     C                   END
     C*
     C     WSPK1         IFEQ      'J'
     C     DOKUFK        CHAIN(N)  DOKUF                              33
     C   03
     CAN 33
     COR 16
     CAN 33              EXSR      MOVWDF
     C*
     C*** REGISTRERE FRAKTBREV
     C  N03
     CANN16              EXSR      FRABR
     C   12              GOTO      START2                                       TIL OPPDRAG
     C                   END
     C*
     C*** FAKTURA
     C     START3        TAG
     C     XNYGML        IFEQ      'NY'
     C                   MOVE      ' '           XKODE
     C                   EXSR      FAKTUR
     C                   ELSE
     C   05              EXSR      FAKTUR
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      FAKTUR
     C                   GOTO      SLUTT
     C                   ELSE
     C     HEADFK        CHAIN     HEADF                              33
S14  C* N33              MOVE      ' '           HEST
N14  C  N33              MOVE      GMST          HEST
     C  N33              UPDATE    HEADFR
     C                   END
     C                   END
     C*
     C   03UTYPE         IFEQ      'CR2'
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       300503
     C                   MOVEA     '0000'        *IN(96)
     C                   MOVE      '1'           *IN58
     C                   GOTO      START1
     C                   ELSE
     C     TURSOK        IFEQ      'J'
     C                   GOTO      START
     C                   ELSE
N14  C     HEADFK        CHAIN     HEADF                              33
N14  C  N33              MOVE      GMST          HEST
N14  C  N33              UPDATE    HEADFR
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C   16
     COR 12              GOTO      START2
     C     SLUTT         TAG
     C                   CLOSE     SYFA10FM
     C                   RETURN
     C*
     C***********************************************
     C     GETOPD        BEGSR
     C***********************************************
     C                   MOVE      'E'           UTYPE2            1
     C                   MOVE      WSAVD         UAVDE             4 0
     C                   MOVE      *ZEROS        UOPDE             7 0
     C                   MOVE      *BLANKS       USGE              3
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    UAVDE
     C                   PARM                    UOPDE
     C                   PARM                    USGE
     C     UAVDE         IFNE      0                                            1<-B
     C     UOPDE         ANDNE     0
     C     UTYPE2        IFEQ      'E'                                           2<-B
     C                   MOVE      UAVDE         WSAVD
     C                   MOVE      UOPDE         WSOPD
     C                   MOVE      USGE          WSSG
     C                   ELSE                                                    2
     C                   MOVE      UAVDE         HEAVD
     C                   MOVE      UOPDE         HEOPD
     C     WSSG          IFEQ      *BLANKS                                        3<-B
     C                   MOVE      USGE          WSSG
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
N14  C                   MOVE      ' '           GMST              1
     C                   MOVE      'DIV0000'     MSGNR
     C     WSOPD         IFGT      0
     C     HEOPD         IFGT      0
     C     HEAVD         ORGT      0
     C                   MOVE      'SPO0015'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      SLT1
     C                   END
     C                   END
     C     HEOPD         COMP      0                                  28
     C  N28HEAVD         COMP      0                                  28
     C*
     C**** TEST SAKSBEHANDLER
     C     XKODE         IFEQ      'Z'
     C                   MOVE      'NY'          XNYGML
     C                   ELSE
     C                   MOVE      'GM'          XNYGML
     C                   END
     C     KODSFK        CHAIN     KOSFR                              99
     C   99              MOVE      'SPS0011'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      SLT1
     C*
     C*** TEST AVDELING
     C     KODTAK        CHAIN     KOAR                               98
     C     KOAPOS        COMP      'J'                                    53
     C  N98FIRAVD        CHAIN     CUNDL01                            98
     C  N98KODTVK        CHAIN     KOVR                               98
     C  N98              DO
     C     WSAVD         CHAIN(N)  TELL                               98
     C   98AVDZER        CHAIN(N)  TELL                               98
     C                   END
     C   98              MOVE      'SPA0006'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      SLT1
     C* KUN EKSPORT PÅ DENNE AVDELING?
     C     KOAIE         COMP      'E'                                    98
     C   98              MOVE      'JOV0076'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      SLT1
     C*
     C*** TEST OPPDRAGSNR
     C  N28              DO
     C     WSOPD         COMP      *ZEROS                                 33
     C  N33HEADFK        CHAIN     HEADF                              97
N14  C  N97
N14  CANN33              MOVE      HEST          GMST
     C   33
     CAN 05              SETON                                        97
     C   97              MOVE      'SPO0002'     MSGNR
     C   97              SETON                                        30
     C   97              GOTO      SLT1
     C  N33
     CANN09HESG          IFEQ      'DUP'
     C                   MOVE      USG           HESG
     C                   MOVE      USG           WSSG
     C                   END
     C  N33
     CANN09WSSG          IFNE      HESG
     C                   MOVE      HESG          WSSG
     C                   MOVE      'YBC0036'     MSGNR
     C                   END
     C  N33
     CANN99HEST          COMP      ' '                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'C'                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'U'                                9797
     C  N33
     CANN97
     CANN99HEUR          IFNE      'A'
     C     HEUR          IFNE      'C'
     C                   SETON                                        97
     C                   END
     C                   END
     C   97              MOVE      'SPO0006'     MSGNR
     C   99              MOVE      'SPS0014'     MSGNR
     C   97
     COR 99              SETON                                        30
     C   30              UPDATE    HEADFR
     C   30              MOVE      *ZEROS        HEAVD
     C   30              MOVE      *ZEROS        HEOPD
     C   97
     COR 99              GOTO      SLT1
     C   33              MOVE      KOABÆR        WSSTD
     C                   END
     C*
     C*** TEST AVDELING+OPPDRAGSNR FOR KOPIERING
     C   28              DO
     C     HEADKK        CHAIN(N)  HEADF                              33
     C  N33              MOVE      KOABÆR        WSSTD
     C   33              SETON                                        9630
     C   96              MOVE      'SPA0007'     MSGNR
     C* DIRECT TO INVOICE NOT ALLOWED
     C   05              MOVE      'SPO0029'     MSGNR
     C   05              SETON                                        9630
     C   96              GOTO      SLT1
     C                   MOVE      *ZEROS        WSOPD
     C                   END
     C*
     C  N33
     CANN28              DO
     C                   MOVE      'X'           HEST
     C   09              MOVE      WSSG          HESG
     C                   UPDATE    HEADFR
     C                   END
     C*
     C     WSOPD         IFEQ      0
     C                   MOVE      'NY'          XNYGML
     C  N28HEADFK        CHAIN     HEDUMMY                            33
     C  N28
     CANN33              SETON                                        28
     C   28              EXSR      MOVHFW
     C  N28              EXSR      MOVB1
     C                   ELSE
     C                   EXSR      MOVHFW
     C                   END
     C*
     C     SLT1          ENDSR
     C*
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C                   MOVE      'DIV0000'     MSGNR
      *
      * TAR SIGNATUR FRA UDS HVIS LIK 0
      *
     C     WSSG          IFEQ      *BLANKS
     C                   MOVE      USG           WSSG
     C                   END
      *
      * TAR AVDELING FRA UDS HVIS LIK 0
      *
     C     WSAVD         IFEQ      0
     C                   MOVE      UAVD          WSAVD
     C                   END
      *
      * TESTER AVDELING SETTER PÅ 53 VED POSTNUMMERLOGIKK
      *
     C     KODTAK        CHAIN     KOAR                               33
      * KUN EKSPORT PÅ DENNE AVDELING?
     C  N33KOAIE         COMP      'E'                                    33
     C   33              MOVE      UAVD          WSAVD
     C   33KODTAK        CHAIN     KOAR                               33
     C     KOAPOS        COMP      'J'                                    53
     C  N33FIRAVD        CHAIN     CUNDL01                            33
      *
      *** TEST PROSJEKTNR.
      *
     C     KOVPRO        IFEQ      'J'                                          1<-B
     C     WSPRO         IFEQ      0                                             2<-B
     C     WSPLAN        COMP      'X'                                9797
     C                   ELSE                                                    2
     C     WSPLAN        IFNE      'R'                                            3<-B
     C     WSPRO         COMP      *ZEROS                                 97
     C  N97              DO
     C     WSAVD         CHAIN(N)  TELL                               97
     C   97AVDZER        CHAIN(N)  TELL                               97
     C                   END
     C  N97WSPRO         COMP      TETMIN                               97
     C  N97WSPRO         COMP      TETURN                             97  97
     C                   END                                                      3<-E
     C                   END                                                     2<-2
     C   97              MOVE      'SPT0002'     MSGNR
     C   97              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** TEST DATO
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTD         UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      96
     C   96
     CANN30              MOVE      'SPD0001'     MSGNR
     C   96              SETON                                        30
     C*
     C*** TEST STED TIL
     C* IKKE VED POSTNUMMERLOGIKK
     C  N53WSSDT         IFNE      *BLANKS
     C     WSLKK         IFNE      *BLANKS
     C                   MOVE      WSLKK         FIRLK
     C                   END
     C     WSSDTK        CHAIN     STED2D                             94
     C                   END
      *
      * TEST STED FRA
      * IKKE VED POSTNUMMERLOGIKK
      *
     C  N53WSSDF         IFNE      *BLANKS
     C     WSSDFK        CHAIN     STED2D                             95
     C  N95WSLKS         IFEQ      '  '
     C                   MOVE      WSLKA         WSLKS
     C                   END
     C                   END
     C   95
     CANN30              MOVE      'SPS0012'     MSGNR
     C   95              SETON                                        30
     C   94
     CANN30              MOVE      'SPS0013'     MSGNR
     C   94              SETON                                        30
     C*
     C*** TEST TILLEGGS FRAKT
     C     WSVALT        IFNE      *BLANKS
     C     KODGEK        CHAIN     KOGER                              76
     C   76
     CANN30              MOVE      'SPV0006'     MSGNR
     C   76              SETON                                        30
     C                   END
     C*
     C*** TEST LANDKODE IKKE VED POSTNUMMER-LOGIKK RETTELSE 14
     C* IKKE VED POSTNUMMER LOGIKK
     C     WSLKA         IFEQ      *BLANKS
     C                   MOVE      WSLKS         WSLKA
     C                   END
     C  N53KODLKK        CHAIN     KODTLKR                            93
     C   93
     CANN30              MOVE      'SPL0001'     MSGNR
     C   93              SETON                                        30
     C*
     C*** HENTE LOSSESTED
     C     WSSDL2        IFEQ      *BLANKS
     C     KODTEK        CHAIN     KOTMR                              33
     C  N33              MOVE      KOTMNV        WSSDL
     C                   END
     C*
     C*** TEST TRANSPORTMÅTE
     C     WSTRM         IFNE      0
     C     KODS4K        CHAIN     KODTS4                             92
     C   92
     CANN30              MOVE      'SPT0003'     MSGNR
     C   92              SETON                                        30
     C                   END
     C*
     C*** TEST LANDKODE TIL TRANSPORTIDENTITET
     C     WSTRI         IFNE      *BLANKS
     C     KODS2K        CHAIN     KODTS2                             91
     C   91
     CANN30              MOVE      'SPL0003'     MSGNR
     C   91              SETON                                        30
     C                   END
     C*
     C*** TEST CONTAINER
     C     WSTRC         IFEQ      1
     C     WSTRCN        COMP      *BLANKS                                90
     C   90
     CANN30              MOVE      'SPC0001'     MSGNR
     C   90              SETON                                        30
     C                   END
     C   30              GOTO      SLT2
     C*
     C*** TEST AGENT, TRANSPORTØR, SELGER OG KJØPER
     C                   EXSR      TESTKU
     C   30              GOTO      SLT2
      *
      * HVIS POSTAL FORSØK Å HENTE POSTNR FRA HENTE/LEVADR.
      * START POSTNUMMERLOGIKK
      *
     C     KOAPOS        IFEQ      'J'                                          B1
     C* FORFRAKT FRA
     C     WSSDFF        IFEQ      *BLANKS                                       B2
     C     WSADS3        ANDNE     *BLANKS                                       B2
     C                   MOVEL     WSADS3        TESTN5            5
     C                   TESTN                   TESTN5               33
     C     *IN33         IFEQ      '1'                                            B3
     C                   MOVEL     TESTN5        WSSDFF
     C                   ELSE                                                     X3
     C                   MOVEL     WSADS3        TESTN4            4
     C                   TESTN                   TESTN4               33
     C     *IN33         IFEQ      '1'                                             B4
     C                   MOVEL     TESTN4        WSSDFF
     C                   END                                                       E4
     C                   END                                                      E3
     C                   END                                                     E2
     C* VIDEREFRAKT TIL
     C     WSSDVT        IFEQ      *BLANKS                                       B2
     C     WSADK3        ANDNE     *BLANKS                                       B2
     C                   MOVEL     WSADK3        TESTN5            5
     C                   TESTN                   TESTN5               33
     C     *IN33         IFEQ      '1'                                            B3
     C                   MOVEL     TESTN5        WSSDVT
     C                   ELSE                                                     X3
     C                   MOVEL     WSADK3        TESTN4            4
     C                   TESTN                   TESTN4               33
     C     *IN33         IFEQ      '1'                                             B4
     C                   MOVEL     TESTN4        WSSDVT
     C                   END                                                       E4
     C                   END                                                      E3
     C                   END                                                     E2
      * HVIS REN IMP/EKS (ELLER INNLAND) KAN LANDKODE SETTES???
     C                   SELECT
     C     KOAIE         WHENEQ    'I'
     C* IMPORT
     C     WSLKS         IFEQ      *BLANKS
     C                   MOVE      KOALK         WSLKS
     C                   END
     C     WSLKK         IFEQ      *BLANKS
     C                   MOVE      FILAND        WSLKK
     C                   END
      *EKSPORT
     C     KOAIE         WHENEQ    'E'
     C     WSLKS         IFEQ      *BLANKS
     C                   MOVE      FILAND        WSLKS
     C                   END
     C     WSLKK         IFEQ      *BLANKS
     C                   MOVE      KOALK         WSLKK
     C                   END
      *INNLAND
     C     KOAIE         WHENEQ    'D'
     C     WSLKS         IFEQ      *BLANKS
     C                   MOVE      FILAND        WSLKS
     C                   END
     C     WSLKK         IFEQ      *BLANKS
     C                   MOVE      FILAND        WSLKK
     C                   END
     C                   ENDSL
     C*
     C                   MOVE      '0'           *IN30
     C*
     C                   END
      *
      * SLUTT POSTNUMMERLOGIKK
      *
     C*** TEST FORFRAKT FRA
     C     STFF          TAG
     C     WSSDFF        IFNE      *BLANKS
     C     *IN53         OREQ      '1'
     C     WKSDFF        CHAIN     STED2D                             84
     C  N84              MOVE      ST2NVN        WSPNFR
     C*AUTOMATISK OPPDATERING
     C   84KOAPOS        IFEQ      'J'
     C     WKSDFF        SETLL     STEDIL01
     C     WSLKS         READE     STEDIL01                               84
      * Utenfor gyldige postnrsoner...
     C   84
     CANN30              MOVE      'SHU0120'     MSGNR
     C*
     C  N84STINPF        IFLE      WSSDFF
     C*
      * Innenfor gyldige postnrsoner...
     C     WSPNFR        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WSLKS         IFEQ      GSLKS
     C     WSSDFF        ANDEQ     GSSDFF
     C                   MOVE      *BLANKS       GSLKS             2
     C                   MOVE      *BLANKS       GSSDFF            5
     C                   CLEAR                   STED2R
     C                   MOVE      WSLKS         ST2LK
     C                   MOVE      WSPNFR        ST2NVN
     C                   MOVE      WSSDFF        ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STED2R
     C                   GOTO      STFF
     C                   ELSE
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
      * Utenfor gyldige postnrsoner...
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
     C*
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN84         IFEQ      *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WSLKS         GSLKS             2
     C                   MOVE      WSSDFF        GSSDFF            5
     C                   END
     C                   END
     C                   ELSE
     C   84
     CANN30              MOVE      'SPS0016'     MSGNR
     C                   END
     C   84              SETON                                        30
     C  N84WSADK3        IFEQ      *BLANKS
     C     WSKNS         IFEQ      *ZEROS
     C                   MOVE      ST2NVN        WSADS3
     C                   END
     C                   END
     C  N84KOAPOS        IFEQ      'J'
     C                   MOVE      ST2KO2        WSSDF
     C                   MOVE      ST2LK         WSLKA
     C                   END
     C                   END
     C*
     C*** TEST VIDEREFRAKT TIL
     C     STVT          TAG
     C     WSSDVT        IFNE      *BLANKS
     C     *IN53         OREQ      '1'
     C     WKSDVT        CHAIN     STED2D                             83
     C  N83              MOVE      ST2NVN        WSPNTI
     C*AUTOMATISK OPPDATERING
     C   83KOAPOS        IFEQ      'J'
     C     WKSDVT        SETLL     STEDIL01
     C     WSLKK         READE     STEDIL01                               83
      * Utenfor gyldige postnrsoner...
     C   83
     CANN30              MOVE      'SHU0120'     MSGNR
     C  N83STINPF        IFLE      WSSDVT
      * Innenfor gyldige postnrsoner...
     C     WSPNTI        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WSLKK         IFEQ      GSLKK
     C     WSSDVT        ANDEQ     GSSDVT
     C                   MOVE      *BLANKS       GSLKK             2
     C                   MOVE      *BLANKS       GSSDVT            5
     C                   CLEAR                   STED2R
     C                   MOVE      WSLKK         ST2LK
     C                   MOVE      WSPNTI        ST2NVN
     C                   MOVE      WSSDVT        ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STED2R
     C                   GOTO      STVT
     C                   ELSE
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
      * Utenfor gyldige postnrsoner...
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN83         IFEQ      *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WSLKK         GSLKK             2
     C                   MOVE      WSSDVT        GSSDVT            5
     C                   END
     C                   END
     C                   ELSE
     C   83
     CANN30              MOVE      'SPS0017'     MSGNR
     C                   END
     C   83              SETON                                        30
     C  N83WSADK3        IFEQ      *BLANKS
     C     WSKNK         IFEQ      *ZEROS
     C                   MOVE      ST2NVN        WSADK3
     C                   END
     C                   END
     C  N83KOAPOS        IFEQ      'J'
     C                   MOVE      ST2KO2        WSSDT
     C                   END
     C                   END
     C*
     C*** TEST OPPDRAGSTYPE
     C     KODOTK        CHAIN     KOOTYR                             89
     C   89
     CANN30              MOVE      'SPO0007'     MSGNR
     C   89              SETON                                        30
     C*
     C*** TEST FRANKATUR
     C     KODFRK        CHAIN     KOFRR                              88
     C   88
     CANN30              MOVE      'SPF0006'     MSGNR
     C   88              SETON                                        30
     C*
     C*** TEST ANTALL KOLLI
     C     WSNT          COMP      0                                      87
     C   87
     CANN30              MOVE      'SPN0003'     MSGNR
     C   87              SETON                                        30
     C*
     C*** TEST ENHET/VARESLAG
     C     WSVS1         COMP      *BLANKS                                86
     C   86
     CANN30              MOVE      'SPV0005'     MSGNR
     C   86              SETON                                        30
     C*
     C*** TEST VEKT
     C     WSVKT         COMP      0                                      85
     C   85
     CANN30              MOVE      'SPV0002'     MSGNR
     C   85              SETON                                        30
     C*
     C*** TEST OM PRODUKTSKODE
     C                   MOVEL     WSKDPL        XUKOD
     C     KUFASK        CHAIN     KUFAST                             72
     C  N30*IN72         IFEQ      '1'
     C                   MOVE      'YBC0360'     MSGNR
     C                   SETON                                        30
     C                   END
     C*
     C*** TEST OM TASTET VALUTAKODEN VAREVERDI          RIKTIG
     C     WSVERV        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVERV        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            71
     C   71
     CANN30              MOVE      'SPV0001'     MSGNR
     C   71              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** HENTE PRINTERKODE
     C     KODO2K        CHAIN     KOOT2R                             33
     C  N33              DO
     C     WSPK1         IFEQ      ' '
     C                   MOVE      KO2FB         WSPK1
     C                   END
     C     WSPK2         IFEQ      ' '
     C                   MOVE      KO2FPS        WSPK2
     C                   END
     C     WSPK3         IFEQ      ' '
     C                   MOVE      KO2KK         WSPK3
     C                   END
     C     WSPK4         IFEQ      ' '
     C                   MOVE      KO2TI         WSPK4
     C                   END
     C                   END
     C*
     C*** TEST PRINTKODE FOR FRAKTBREV
     C     WSPK1         COMP      ' '                                    82
     C   82
     CANN30              MOVE      'SPP0002'     MSGNR
     C   82              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR FORPASSING
     C     WSPK2         COMP      ' '                                    81
     C   81
     CANN30              MOVE      'SPP0003'     MSGNR
     C   81              SETON                                        30
     C*
     C*** TEST PRINTEKODE FOR KJØREKVITERING
     C     WSPK3         COMP      ' '                                    80
     C   80
     CANN30              MOVE      'SPP0004'     MSGNR
     C   80              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR TOLLDEKRALASJON
     C     WSPK4         COMP      ' '                                    79
     C   79
     CANN30              MOVE      'SPP0005'     MSGNR
     C   79              SETON                                        30
     C*
     C*** TEST TOLLSTED OG VAREPOST
     C     W2TOLL        IFNE      0
     C     KODTSK        CHAIN     KOTSTR                             78
     C   78
     CANN30              MOVE      'SPT0001'     MSGNR
     C   78              SETON                                        30
     C                   END
     C  N78WSPK2         IFEQ      'J'
     C     W2TOLL        COMP      0                                      78
     C   78
     CANN30              MOVE      'SPT0004'     MSGNR
     C   78              SETON                                        30
     C     WSNTVS        COMP      0                                      77
     C   77
     CANN30              MOVE      'SPN0004'     MSGNR
     C   77              SETON                                        30
     C                   END
     C*
     C*** HENTE UTLEVERINGSFORBEHOLD
     C     WSKF          IFNE      '  '
     C     WSKF          CHAIN     KODTU                              74
     C   74
     CANN30              MOVE      'YBC0487'     MSGNR
     C   74              SETON                                        30
     C  N74WSFT1A        IFEQ      *BLANKS
     C                   MOVE      KUTX          WSFT1A
     C                   END
     C  N74WSKFT1        IFEQ      ' '
     C                   MOVE      KUKD2         WSKFT1
     C                   END
     C                   END
      *
      *** TEST OM UTLEVERINGSFORBEHOLD ER AKTIV
     C                   MOVEL     WSKFT1        XKFKOD
     C     KOFASK        CHAIN     KOFAST                             75
     C   75
     CANN30              MOVE      'YBC0488'     MSGNR
     C   75              SETON                                        30
     C*
     C*** BEREGN FRAKTBREGNETVEKT
     C                   EXSR      FINNVK
     C* FINN EVT DFT FOR FRAKT-TILLEGG (VAL/OLJ..., MEN KUN VED NY)
     C  N30              EXSR      GETFRT
     C*
     C     SLT2          TAG
     C   30              EXSR      SETCUR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SETCUR        BEGSR
     C***********************************************
     C   78
     COR 77              Z-ADD     21            LINNBR
     C   82
     COR 81
     COR 80
     COR 79              Z-ADD     20            LINNBR
     C   71              Z-ADD     19            LINNBR
     C   72              Z-ADD     18            LINNBR
     C   74
     COR 75              Z-ADD     18            LINNBR
     C   89
     COR 88
     COR 87
     COR 86
     COR 85              Z-ADD     16            LINNBR
     C   83              Z-ADD     14            LINNBR
     C   62
     COR 61
     COR 60
     COR 59              Z-ADD     11            LINNBR
     C   84              Z-ADD     10            LINNBR
     C   68
     COR 67
     COR 66
     COR 65              Z-ADD     7             LINNBR
     C   92
     COR 91
     COR 90              Z-ADD     5             LINNBR
     C   70
     COR 69              Z-ADD     4             LINNBR
     C   95
     COR 94
     COR 76
     COR 93              Z-ADD     3             LINNBR
     C   96
     COR 97              Z-ADD     2             LINNBR
     C*
     C   77              Z-ADD     56            POSNBR
     C   78              Z-ADD     2             POSNBR
     C   79              Z-ADD     12            POSNBR
     C   80              Z-ADD     9             POSNBR
     C   81              Z-ADD     6             POSNBR
     C   82              Z-ADD     2             POSNBR
     C   71              Z-ADD     19            POSNBR
     C   74              Z-ADD     9             POSNBR
     C   75              Z-ADD     12            POSNBR
     C   72              Z-ADD     80            POSNBR
     C   85              Z-ADD     60            POSNBR
     C   86              Z-ADD     33            POSNBR
     C   87              Z-ADD     25            POSNBR
     C   88              Z-ADD     5             POSNBR
     C   89              Z-ADD     2             POSNBR
     C   83              Z-ADD     22            POSNBR
     C   59              Z-ADD     42            POSNBR
     C   60              Z-ADD     33            POSNBR
     C   62
     COR 61              Z-ADD     8             POSNBR
     C   84              Z-ADD     22            POSNBR
     C   65              Z-ADD     42            POSNBR
     C   66              Z-ADD     33            POSNBR
     C   68
     COR 67              Z-ADD     8             POSNBR
     C   90              Z-ADD     43            POSNBR
     C   91              Z-ADD     21            POSNBR
     C   92              Z-ADD     8             POSNBR
     C   69              Z-ADD     54            POSNBR
     C   70              Z-ADD     8             POSNBR
     C   93              Z-ADD     8             POSNBR
     C   76              Z-ADD     34            POSNBR
     C   94              Z-ADD     27            POSNBR
     C   95              Z-ADD     16            POSNBR
     C   96              Z-ADD     37            POSNBR
     C   97              Z-ADD     8             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTKU        BEGSR
     C***********************************************
     C*
     C*** TEST AGENT
     C     WSKNA         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       WSNAA
     C                   ELSE                                                   1
     C                   MOVE      WSKNA         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            70
     C   70              MOVE      'SPK0008'     MSGNR
     C   70              SETON                                        30
     C  N70              MOVE      KNAVN         WSNAA
     C                   END                                                    1<-E
     C*
     C*** TRANSPORTØR
     C     WSKNT         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       XTRNV
     C                   MOVE      *BLANKS       WSTRNV
     C                   ELSE                                                   1
     C     TRANK         CHAIN     TRAN                               69
     C   69
     CANN30              MOVE      'SPK0009'     MSGNR
     C   69              SETON                                        30
     C  N69              MOVE      VMNAVN        XTRNV
     C  N69              MOVEL     VMNAVN        WSTRNV
     C                   END                                                    1<-E
     C*
     C*** TEST SELGER
     C*** SYINN JOV   301089 - BRUK RIKTIG KUNDE VED E/B I 'F?'
     C* AVVIKENDE SATS/MINIMUM FOR UTLEGGSPROVISJON
     C     WSKDFS        IFEQ      'B'                                          1<-B
     C     WSKDFK        IFEQ      'E'                                           2<-B
     C                   MOVE      WSKNK         KUNDNR
     C                   ELSE                                                    2
     C                   MOVE      WSKNKF        KUNDNR
     C                   END                                                     2<-E
     C                   ELSE                                                    1
     C     WSKDFS        IFEQ      'E'                                           2<-B
     C                   MOVE      WSKNS         KUNDNR
     C                   ELSE                                                    2
     C                   MOVE      WSKNSF        KUNDNR
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C     KUND1K        CHAIN     CUNDL01                            33
     C* ORDNE SATS OG MINIMUM UTL.PROVISJON
     C  N33SYUTLP        IFEQ      0                                            1<-B
     C                   MOVE      FIUPS         XSUTL             4 2
     C                   MOVE      FIUPM         XSUMIN            2 0
     C                   ELSE                                                   1
     C                   Z-ADD     SYUTLP        XSUTL
     C                   Z-ADD     SYMINU        XSUMIN
     C                   END                                                    1<-E
     C     XSUTL         IFEQ      99.99                                        1<-B
     C                   MOVE      *ZEROS        XSUTL
     C                   END                                                    1<-E
     C*
     C*** SYUT  JOV   301089
     C                   MOVE      *BLANKS       WSMSG
     C                   SETOFF                                       9998
     C     WSKNS         IFEQ      0                                            1<-B
     C     WSNAS         COMP      *BLANKS                                67
     C   67
     CANN30              MOVE      'SPN0005'     MSGNR
     C   67              SETON                                        30
     C                   MOVE      *ZEROS        FMOT
     C                   ELSE                                                   1
     C*
     C                   MOVE      WSKNS         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            68
     C   68
     CANN30              MOVE      'SPK0010'     MSGNR
     C   68              SETON                                        30
     C  N68WSNAS         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      KNAVN         WSNAS
     C                   MOVE      ADR1          WSADS1
     C                   MOVE      ADR2          WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C     POSTNR        IFEQ      0                                              3<-B
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADS3
     C                   ELSE                                                     3
     C                   MOVE      ENGAD3        WSADS3
     C                   END
     C                   ELSE                                                     3
     C                   MOVEL     POSTNR        WSADS3
     C                   MOVE      ADR3          WSADS3
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C  N68WSKNSF        IFEQ      0                                             2<-B
N13  C     WSKDFS        andne     'X'
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNS         WSKNSF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNSF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
S13  C*    WSKDFS        IFEQ      'X'
s13  C*                  MOVE      *ZEROS        WSKNSF
s13  C*                  END                                                    1<-E
     C*                                                                 d
     C*** TEST OM TASTET VALUTAKODEN TIL SELGERSMOT. ER RIKTIG
     C     WSVALS        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVALS        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            66
     C   66
     CANN30              MOVE      'SPV0001'     MSGNR
     C   66              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** TEST SELGERS FAKTURAMOTTAGER
     C     WSKNSF        IFEQ      0                                            1<-B
     C     WSKDFS        COMP      'X'                                6565
     C                   MOVE      *BLANKS       WSNASF
     C                   ELSE                                                   1
     C                   MOVE      WSKNSF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            65
     C     WSKDFS        IFNE      'X'
     C  N65AKTKOD        COMP      'A'                                6565
     C  N65AKTKOD        COMP      'I'                                    65
     C                   END
     C                   END                                                    1<-E
     C   65
     CANN30              MOVE      'SPK0011'     MSGNR
     C   65              SETON                                        30
     C*
     C*** TEST SALDO ER GÅTT OVER KREDITTGRENSE
     C  N65WSKNSF        IFNE      0                                            1<-B
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XKOVER           13 2
N10  C                   movel     wsavd         avdopd           11
N10  C                   move      wsopd         avdopd           11
N10  C                   movel     avdopd        ksaldo
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XKOVER                             65
     C                   END                                                     2<-E
     C   65
     CANN30              MOVE      'SPK0012'     MSGNR
     C   65              SETON                                        30
     C                   MOVE      KNAVN         WSNASF
     C*
     C*** SJEKK VALUTAKODE
     C     WSVALS        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALS
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALS
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*** TEST STOPPEKODE
     C     SYLIKV        COMP      ' '                                6363
     C   63              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG          WSMSG
     C  N33              MOVE      WSKNSF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     KLISTO        IFEQ      'J'
     C                   SETON                                        30
     C   30              GOTO      SLTKU
     C                   END
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C*
     C*** TEST KJØPER
     C     WSKDFK        IFEQ      'B'                                          1<-B
     C     WSKDFS        IFEQ      'E'                                           2<-B
     C                   MOVE      WSKNS         KUNDNR
     C                   ELSE                                                    2
     C                   MOVE      WSKNSF        KUNDNR
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C     WSKDFK        IFEQ      'E'                                           2<-B
     C                   MOVE      WSKNK         KUNDNR
     C                   ELSE                                                    2
     C                   MOVE      WSKNKF        KUNDNR
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C     KUND1K        CHAIN     CUNDL01                            33
     C*** ORDNE UTLEGSSPROV SATS OG MINIMUM
     C  N33SYUTLP        IFEQ      0                                            1<-B
     C                   MOVE      FIUPS         XKUTL             4 2
     C                   MOVE      FIUPM         XKUMIN            2 0
     C                   ELSE                                                   1
     C                   Z-ADD     SYUTLP        XKUTL
     C                   Z-ADD     SYMINU        XKUMIN
     C                   END                                                    1<-E
     C     XKUTL         IFEQ      99.99                                        1<-B
     C                   MOVE      *ZEROS        XKUTL
     C                   END                                                    1<-E
     C*
     C                   MOVE      *BLANKS       XKTLF            15
     C     WSKNK         IFEQ      0                                            1<-B
     C     WSNAK         COMP      *BLANKS                                62
     C   62
     CANN30              MOVE      'SPN0006'     MSGNR
     C   62              SETON                                        30
     C                   MOVE      *ZEROS        FMOT
     C                   ELSE                                                   1
     C*
     C                   MOVE      WSKNK         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            61
     C   61
     CANN30              MOVE      'SPK0013'     MSGNR
     C   61              SETON                                        30
     C  N61              MOVE      TLF           XKTLF
     C  N61WSOT          IFEQ      *BLANKS                                       2<-B
     C                   MOVE      SYOPDT        WSOT
     C                   CALL      'SYFA24'
     C                   PARM      WSKNK         UKNOP             8 0
     C                   PARM                    UUR
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM                    WSOT
     C                   END                                                     2<-E
     C  N61SYKONT        IFEQ      0
     C     WSPK4         ANDEQ     'J'
     C                   MOVEL     MANGLE        WSMSG
     C                   END
     C  N61OAVTKS        CHAIN     OAVT                               33
     C  N61
     CANN33              MOVE      OAOT          WSOT
     C*
     C  N61KOAPOS        IFEQ      'J'
     C     WSLKK         IFEQ      *BLANKS
     C                   MOVE      SYLAND        WSLKK
     C     WSLKK         IFEQ      *BLANKS
     C                   MOVE      FIRLK         WSLKK
     C                   END
     C                   END
     C                   END
     C  N61WSNAK         IFEQ      *BLANKS                                       2<-B
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      *BLANKS       WSADK3
     C  N33              DO                                                       3<-B
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C                   END                                                      3<-E
     C   33              DO                                                       3<-B
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0                                               4<-B
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE                                                     3
     C                   MOVE      ENGAD3        WSADK3
     C                   END
     C                   ELSE                                                      4
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*
     C     WSKNKF        IFEQ      0                                             2<-B
N13  C     WSKDFK        andne     'X'
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNK         WSKNKF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNKF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*
     C                   END                                                    1<-E
s13  C*    WSKDFK        IFEQ      'X'
s13  C*                  MOVE      *ZEROS        WSKNKF
s13  C*                  END                                                     2<-E
     C*** END PÅ <WSKNK IFEQ 0>
     C*
     C*
     C*** TEST OM TASTET VALUTAKODEN TIL KJØPERSMOT. ER RIKTIG
     C     WSVALK        IFNE      *BLANKS
     C                   MOVE      WSVALK        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            60
     C   60
     CANN30              MOVE      'SPV0001'     MSGNR
     C   60              SETON                                        30
     C                   END
     C*
     C*** TEST KJØPERS FAKTURAMOTTAGER
     C     WSKNKF        IFEQ      0                                            1<-B
     C     WSKDFK        COMP      'X'                                5959
     C                   MOVE      *BLANKS       WSNAKF
     C                   ELSE                                                   1
     C                   MOVE      WSKNKF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            59
     C     WSKDFK        IFNE      'X'
     C  N59AKTKOD        COMP      'A'                                5959
     C  N59AKTKOD        COMP      'I'                                    59
     C                   END
     C  N59              MOVE      KNAVN         WSNAKF
     C                   END                                                    1<-E
     C   59
     CANN30              MOVE      'SPK0014'     MSGNR
     C   59              SETON                                        30
     C*
     C*** TEST OM KREDITGRENSE ER PASSERT
     C  N59WSKNKF        IFNE      0                                            1<-B
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XOVER            13 2
N10  C                   movel     wsavd         avdopd           11
N10  C                   move      wsopd         avdopd           11
N10  C                   movel     avdopd        ksaldo
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XOVER                              59
     C   59
     CANN30              MOVE      'SPK0015'     MSGNR
     C   59              SETON                                        30
     C                   END                                                     2<-E
     C*** SJEKK VALUTAKODE
     C     WSVALK        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALK
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALK
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*** TEST STOPPEKODE
     C     SYLIKV        COMP      ' '                                5757
     C   57              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG          WSMSG
     C  N33              MOVE      WSKNKF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     KLISTO        IFEQ      'J'
     C                   SETON                                        30
     C                   END
     C                   END                                                     2<-E
     C*
     C                   END                                                    1<-E
     C*** END PÅ  <WSKNKF IFEQ 0>
     C*
     C*
     C     SLTKU         TAG
     C     WSMSG         COMP      *BLANKS                            2727
     C*
     C                   ENDSR
     C*
     C******************************************
     C     FINNVK        BEGSR
     C******************************************
     C*
     C* FINNER FRAKTBEREGNINGSVEKT
     C*
     C     WSLM          MULT      KOVLKG        XFBV1             9 0
     C     WSM3          MULT      KOVKKG        XFBV2             9 0
     C     WSVKT         IFGE      XFBV1
     C                   Z-ADD     WSVKT         WSFBV             9 0
     C                   ELSE
     C                   Z-ADD     XFBV1         WSFBV
     C                   END
     C     WSFBV         IFLT      XFBV2
     C                   Z-ADD     XFBV2         WSFBV
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     GETFRT        BEGSR
     C***********************************************
      * SR SOM HENTER VERDI FOR FRAKTTILLEGG (OLJE/VAL...)
S08  C*    WSOPD         IFEQ      *ZEROS
S08  C*    WSVALT        ANDEQ     *BLANKS
N08  C     WSVALT        ifeq      *BLANKS
     C                   MOVE      *ZEROS        UVALP
     C     WSKNKF        IFNE      *ZEROS
     C     WSKDFK        ANDNE     'X'                                          VED IMPORT..
     C                   MOVE      WSKNKF        UKNOP                          PRIM. KJØPER
     C                   ELSE
     C                   MOVE      WSKNSF        UKNOP                          SEK. SELGER
     C                   END
     C                   CALL      'SYFA24B'
     C                   PARM                    UUR               1
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM                    UKNOP             8 0
     C                   PARM                    WSVALT
     C                   PARM                    UVALP             3 1
     C                   MOVE      UVALP         WSVALP
     C     WSVALT        IFNE      *BLANKS
     C     KODGEK        CHAIN     KOGER                              76
     C   76              SETON                                        30
     C                   END
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     MOVHFW        BEGSR
     C***********************************************
     C  N28              MOVE      HESTD         WSSTD
     C                   MOVE      HEPRO         WSPRO
     C                   MOVE      HEPLAN        WSPLAN
     C                   MOVE      HEPOS1        WSPOS1
     C                   MOVE      HEPOS2        WSPOS2
     C                   MOVE      HEDTD         WSDTD
     C                   MOVE      HEDTM         WSDTM
     C                   MOVE      HEDTÅ         WSDTÅ
     C     WSDT          IFEQ      *ZEROS
     C                   MOVE      UDAY          WSDTD
     C                   MOVE      UMONTH        WSDTM
     C                   MOVE      UYEAR         WSDTÅ
     C                   END
     C                   MOVE      HEGN          WSGN
     C     XNYGML        IFEQ      'NY'
N05  C     WSGN          andeq     *blanks
     C                   TIME                    DSTID            14 0
     C                   MOVE      DSCENT        WSGNA
     C                   ENDIF
NRFA C*                  MOVE      HERFA         WSRFA
NRFA C                   MOVEL     HERFA         WSRFA
     C                   MOVE      HESDF         WSSDF
     C                   MOVE      HESDT         WSSDT
     C     KOAPOS        IFNE      'J'
     C                   MOVE      HELKK         FIRLK
     C     HELKK         IFEQ      *BLANKS
     C                   MOVE      FILAND        FIRLK
     C                   END
     C                   END
     C                   MOVE      HEVALT        WSVALT
     C                   MOVE      HEVALP        XVALP
     C                   MOVE      HEHAWB        WSHAWB
     C                   MOVE      HELKA         WSLKA
     C                   MOVE      HELKK         WSLKK
     C                   MOVE      HELKS         WSLKS
     C                   MOVE      HESDL         WSSDL
     C                   MOVE      HEKNA         WSKNA
     C                   MOVE      HENAA         WSNAA
     C                   MOVE      HEKNT         WSKNT
     C     TRANK         CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       XTRNV            30
     C  N33              MOVE      VMNAVN        XTRNV
     C                   MOVEL     XTRNV         WSTRNV
     C                   MOVE      HETRM         WSTRM
     C                   MOVE      HETRI         WSTRI
     C                   MOVE      HETRC         WSTRC
     C                   MOVE      HETRCN        WSTRCN
     C                   MOVE      HEKNS         WSKNS
     C                   MOVE      HEANS         WSANS
     C                   MOVE      HEKDFS        WSKDFS
     C                   MOVE      HEVALS        WSVALS
     C                   MOVE      HEKNSF        WSKNSF
     C                   MOVE      HENASF        WSNASF
     C                   MOVE      HENAS         WSNAS
     C                   MOVE      HEADS1        WSADS1
     C                   MOVE      HEADS2        WSADS2
     C                   MOVE      HEADS3        WSADS3
     C                   MOVE      HEKNK         WSKNK
     C                   MOVE      HEANK         WSANK
     C                   MOVE      HEKDFK        WSKDFK
     C                   MOVE      HEVALK        WSVALK
     C                   MOVE      HEKNKF        WSKNKF
     C                   MOVE      HENAKF        WSNAKF
     C                   MOVE      HENAK         WSNAK
     C                   MOVE      HEADK1        WSADK1
     C                   MOVE      HEADK2        WSADK2
     C                   MOVE      HEADK3        WSADK3
     C                   MOVE      HEOT          WSOT
     C                   MOVE      HEFR          WSFR
     C                   MOVE      HEGM1         WSGM1
     C                   MOVE      HENT          WSNT
     C                   MOVE      HEVS1         WSVS1
     C                   MOVE      HEVKT         WSVKT
     C                   MOVE      HELM          WSLM
     C                   MOVE      HEM3          WSM3
     C                   MOVE      HEFBV         WSFBV
     C                   MOVE      HEGM2         WSGM2
     C                   MOVE      HEVS2         WSVS2
     C                   MOVE      HESDFF        WSSDFF
     C                   MOVE      HESDVT        WSSDVT
     C                   MOVE      HEKDPL        WSKDPL
     C                   MOVE      HEKDL         WSKDL
     C                   MOVE      HEPK1         WSPK1
     C                   MOVE      HEPK2         WSPK2
     C                   MOVE      HEPK3         WSPK3
     C                   MOVE      HEPK4         WSPK4
     C                   MOVE      *ZEROS        W2TOLL
     C                   MOVE      ' '           W2KDME
     C                   MOVE      ' '           W2KDE
     C                   MOVE      HENTVS        WSNTVS
     C                   MOVE      HEKF          WSKF
     C                   MOVE      HEKFT1        WSKFT1
     C                   MOVE      HEFT1         WSFT1
     C                   MOVE      TRVERV        WSVERV
     C                   MOVE      TRVERB        WSVERB
     C*
     C   28              DO
     C                   MOVE      UDAY          WSDTD
     C                   MOVE      UMONTH        WSDTM
     C                   MOVE      UYEAR         WSDTÅ
     C                   MOVE      ' '           WSPK1
     C                   MOVE      ' '           WSPK2
     C                   MOVE      ' '           WSPK3
     C                   MOVE      ' '           WSPK4
     C                   MOVE      ' '           HE01
     C                   MOVE      *ZEROS        HENTF
     C                   MOVE      *BLANKS       HEKDTM
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      *BLANKS       HEGNN
     C                   END
     C*
      *
     C                   MOVE      *BLANKS       WSUSR
     C     WSOPD         IFNE      0
     C     UTLLGK        SETGT     UTLLOGF
     C     UTLL2K        READPE    UTLLOGF                                33
     C  N33              MOVE      ULUSR         WSUSR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSOPD
     C  N16              MOVE      *ZEROS        WSPRO
     C  N16              MOVE      ' '           WSPLAN
     C  N16              MOVE      *BLANKS       WSPOS1
     C   16WSPOS2        IFEQ      *ZEROS
     C                   CALL      'SYFA10C'
     C                   PARM                    WSPOS1
     C                   ELSE
     C                   ADD       1             WSPOS2
     C                   END
     C  N16              MOVE      *ZEROS        WSPOS2
     C  N16              MOVE      *BLANKS       WSGN
     C  N16              MOVE      UDAY          WSDTD
     C  N16              MOVE      UMONTH        WSDTM
     C  N16              MOVE      UYEAR         WSDTÅ
     C  N16              MOVE      *BLANKS       WSRFA
     C  N16              MOVE      *BLANKS       WSSDF
     C  N16              MOVE      *BLANKS       WSSDT
     C  N16              MOVE      *BLANKS       WSVALT
     C  N16              MOVE      *ZEROS        WSVALP
     C  N16              MOVE      *BLANKS       WSHAWB
     C  N16              MOVE      *BLANKS       WSLKA
     C  N16              MOVE      *BLANKS       WSLKK
     C  N16              MOVE      *BLANKS       WSLKS
     C  N16              MOVE      *BLANKS       WSSDL
     C  N16              MOVE      *ZEROS        WSKNA
     C  N16              MOVE      *BLANKS       WSNAA
     C  N16              MOVE      *ZEROS        WSKNT
     C  N16              MOVE      *BLANKS       XTRNV
     C  N16              MOVEL     XTRNV         WSTRNV
     C  N16              MOVE      *ZEROS        WSTRM
     C  N16              MOVE      *BLANKS       WSTRI
     C  N16              MOVE      *ZEROS        WSTRC
     C  N16              MOVE      *BLANKS       WSTRCN
     C                   MOVE      *BLANKS       WSPNTI
     C                   MOVE      *BLANKS       WSPNFR
     C                   MOVE      *ZEROS        WSKNS
     C                   MOVE      *ZEROS        WSANS
     C  N16              MOVE      *BLANKS       WSKDFS
     C                   MOVE      *BLANKS       WSVALS
     C                   MOVE      *ZEROS        WSKNSF
     C                   MOVE      *BLANKS       WSNASF
     C                   MOVE      *BLANKS       WSNAS
     C                   MOVE      *BLANKS       WSADS1
     C                   MOVE      *BLANKS       WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C                   MOVE      *ZEROS        WSKNK
     C                   MOVE      *ZEROS        WSANK
     C                   MOVE      *BLANKS       WSKDFK
     C                   MOVE      *BLANKS       WSVALK
     C                   MOVE      *ZEROS        WSKNKF
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      *BLANKS       WSNAK
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      *BLANKS       WSOT
     C                   MOVE      *BLANKS       WSFR
     C                   MOVE      *BLANKS       WSGM1
     C                   MOVE      *ZEROS        WSNT
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *ZEROS        WSVKT
     C                   MOVE      *ZEROS        WSLM
     C                   MOVE      *ZEROS        WSM3
     C                   MOVE      *ZEROS        WSFBV
     C                   MOVE      *BLANKS       WSGM2
     C                   MOVE      *BLANKS       WSVS2
     C                   MOVE      *BLANKS       WSSDFF
     C                   MOVE      *BLANKS       WSSDVT
     C                   MOVE      *BLANKS       WSKDPL
     C                   MOVE      *BLANKS       WSKDL
     C                   MOVE      *BLANKS       WSKF
     C                   MOVE      *BLANKS       WSKFT1
     C                   MOVE      *BLANKS       WSFT1
     C                   MOVE      *BLANKS       WSPK1
     C                   MOVE      *BLANKS       WSPK2
     C                   MOVE      *BLANKS       WSPK3
     C                   MOVE      *BLANKS       WSPK4
     C                   MOVE      *ZEROS        W2TOLL
     C                   MOVE      *BLANKS       W2KDME
     C                   MOVE      *BLANKS       W2KDE
     C                   MOVE      *ZEROS        WSNTVS
     C                   MOVE      *ZEROS        WSVERB
     C                   MOVE      *BLANKS       WSVERV
     C                   MOVE      *BLANKS       WSUSR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDHEA        BEGSR
     C***********************************************
     C     HEADFK        CHAIN     HEADF                              33
      * OPPDATER STATISTIKK HVIS OPPDRAG ER ALLEREDE OPPDATERT PÅ STAT.
     C  N33HE01          IFEQ      'J'
     C                   WRITE     STATVFR
     C                   MOVE      WSAVD         USTAVD            4
     C                   MOVE      WSOPD         USTOPD            7
     C                   CALL      'SYST35CA'
     C                   PARM                    USTAVD
     C                   PARM                    USTOPD
     C                   END
      *
     C  N33WSKF          IFNE      HEKF
     C     WSKFT1        ORNE      HEKFT1
     C     WSFT1A        ORNE      HEFT1A
     C     WSFT1B        ORNE      HEFT1B
     C                   EXSR      OPDLOG
     C                   EXSR      DOPPD                                        DIST.OPPD.
     C                   END
      *
     C                   EXSR      MOVWHF
     C  N33              UPDATE    HEADFR
     C   33              DO
     C     UDUMMY        IFNE      'J'
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C                   UPDATE    TELLR
     C                   END
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          HEDTRÅ
     C                   ELSE
     C     UYEAR         ADD       2000          HEDTRÅ
     C                   END
     C                   MOVE      UMONTH        HEDTRM
     C                   MOVE      UDAY          HEDTRD
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      'A'           HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD         HEAVD
     C                   MOVE      WSSTD         HESTD
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      ' '           HETLKU
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      *BLANKS       TRSLAG
     C                   MOVE      ' '           HEPK5
     C                   MOVE      ' '           HEPK6
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *zeros        HEKLMO
     C                   MOVE      ' '           HEPK7
     C                   MOVE      ' '           HEPK8
     C                   MOVE      ' '           HEPK9
     C                   MOVE      *BLANKS       HEGNN
     C                   MOVE      *ZEROS        TRRUND
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSFFK
     C                   MOVE      *ZEROS        TRSDFD
     C                   MOVE      *ZEROS        TRSDFK
     C                   MOVE      *ZEROS        TRSDTD
     C                   MOVE      *ZEROS        TRSDTK
     C                   MOVE      *ZEROS        TRSVTD
     C                   MOVE      *ZEROS        TRSVTK
     C                   MOVE      *ZEROS        TRFRAB
     C                   MOVE      *BLANKS       TRSLAG
     C                   MOVE      *BLANKS       TRKDAK
     C                   MOVE      *BLANKS       TRKDFF
     C                   MOVE      *BLANKS       TRFRAK
     C                   MOVE      *BLANKS       TRFRAV
     C                   MOVE      *BLANKS       TRMVA
     C     WSKF          IFNE      *BLANKS
     C     WSKFT1        ORNE      *BLANKS
     C     WSFT1A        ORNE      *BLANKS
     C     WSFT1B        ORNE      *BLANKS
     C                   EXSR      OPDLOG
     C                   END
     C                   WRITE     HEADFR
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
     C                   END
      *
     C                   MOVE      HEAVD         UAVD
     C                   MOVE      HEOPD         UOPD
     C                   MOVE      HESG          USG
     C                   MOVE      '0'           *IN58
      * OPPDATER OPPDRAGSDATO PÅ ALLE FRISØKEVEIER
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      HEDTOP        FSDTOP
     C                   UPDATE    FRISOKR
     C     HEADFK        READE     FRISOK                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDLOG        BEGSR
     C***********************************************
     C                   MOVE      HEAVD         ULAVD
     C                   MOVE      HEOPD         ULOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      XULTM         ULTID
S07  C*                  MOVE      UUSR          ULUSR
N07  C                   MOVE      ZUSER         ULUSR
     C                   MOVE      WSKF          ULKF
     C                   MOVE      WSKFT1        ULKFT1
     C                   MOVE      WSFT1A        ULFT1A
     C                   MOVE      WSFT1B        ULFT1B
     C                   WRITE     UTLLOGR
S07  C*                  MOVE      UUSR          WSUSR
N07  C                   MOVE      ZUSER         WSUSR
      *
     C                   ENDSR
      *
      ***********************************************
     C     DOPPD         BEGSR
      ***********************************************
     C     WSKFT1        IFNE      ' '                                          1<-B
     C     HEADFK        CHAIN     FORDEL5                            30
     C     *IN30         IFEQ      '0'                                           2<-B
     C     FOAVDV        IFEQ      0                                              3<-B
     C     FOOPDV        ANDEQ     0
     C                   MOVE      'G'           FOSTAT
     C     WSKFT1        IFEQ      'Y'                                             4<-B
     C                   MOVE      '9999'        FOAVDV
     C                   MOVE      '9999999'     FOOPDV
     C                   ELSE                                                      4
     C                   MOVE      WSKDPL        UFKDPL
     C                   MOVE      *ZEROS        UFAVDV
     C                   MOVE      '0'           UFIN10
     C                   MOVE      *ZEROS        XXXFBN            3 0
     C                   CALL      'SYFO02'
     C                   PARM      HEAVD         UFAVD             4 0
     C                   PARM      HEOPD         UFOPD             7 0
     C                   PARM                    UFAVDV            4 0
     C                   PARM                    UFOPDV            7 0
     C                   PARM                    UFIN10            1
     C                   PARM                    UFKDPL            1
     C                   PARM                    FICURR
     C                   PARM                    XXXFBN
     C                   MOVE      UFAVDV        FOAVDV
     C                   MOVE      UFOPDV        FOOPDV
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   UPDATE    FORDR
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVWHF        BEGSR
     C***********************************************
     C     UDUMMY        IFEQ      'J'
     C                   MOVE      ' '           HEST
     C                   ELSE
     C                   MOVE      'X'           HEST
     C                   END
     C                   MOVE      WSSG          HESG
     C                   MOVE      WSNTVS        HENTVS
     C                   MOVE      WSSTD         HESTD
     C                   MOVE      WSPRO         HEPRO
     C                   MOVE      XVALP         HEVALP
     C                   MOVE      WSVALT        HEVALT
     C                   MOVE      WSDTD         HEDTD
     C                   MOVE      WSDTM         HEDTM
     C     WSDTÅ         IFGT      50
     C     WSDTÅ         ADD       1900          HEDTÅ
     C                   ELSE
     C     WSDTÅ         ADD       2000          HEDTÅ
     C                   END
     C                   MOVE      WSGN          HEGN
     C                   MOVE      WSSDF         HESDF
     C                   MOVE      WSSDT         HESDT
     C                   MOVE      WSKNA         HEKNA
     C                   MOVE      WSNAA         HENAA
     C                   MOVE      WSKNS         HEKNS
     C                   MOVE      WSKDFS        HEKDFS
     C                   MOVE      WSVALS        HEVALS
     C                   MOVE      WSNAS         HENAS
     C                   MOVE      WSADS1        HEADS1
     C                   MOVE      WSADS2        HEADS2
     C                   MOVE      WSADS3        HEADS3
     C                   MOVE      WSKNSF        HEKNSF
     C                   MOVE      WSANS         HEANS
     C                   MOVE      WSNASF        HENASF
     C                   MOVE      WSKNK         HEKNK
     C                   MOVE      WSKDFK        HEKDFK
     C                   MOVE      WSVALK        HEVALK
     C                   MOVE      WSNAK         HENAK
     C                   MOVE      WSADK1        HEADK1
     C                   MOVE      WSADK2        HEADK2
     C                   MOVE      WSADK3        HEADK3
     C                   MOVE      WSKNKF        HEKNKF
     C                   MOVE      WSANK         HEANK
     C                   MOVE      WSNAKF        HENAKF
     C                   MOVE      WSOT          HEOT
     C                   MOVE      WSPOS1        HEPOS1
     C                   MOVE      WSFR          HEFR
     C                   MOVE      WSNT          HENT
     C                   MOVE      WSVS1         HEVS1
     C                   MOVE      WSVKT         HEVKT
     C                   MOVE      WSLM          HELM
     C                   MOVE      WSM3          HEM3
     C                   MOVE      WSSDFF        HESDFF
     C                   MOVE      WSSDVT        HESDVT
     C                   MOVE      WSPK1         HEPK1
     C                   MOVE      WSPK2         HEPK2
     C                   MOVE      WSPK3         HEPK3
     C                   MOVE      WSPK4         HEPK4
     C                   MOVE      WSKNT         HEKNT
     C                   MOVE      WSLKA         HELKA
     C                   MOVE      WSLKK         HELKK
     C                   MOVE      WSLKS         HELKS
     C                   MOVE      WSPLAN        HEPLAN
     C                   MOVE      WSKDPL        HEKDPL
     C                   MOVE      WSHAWB        HEHAWB
     C                   MOVE      WSTRM         HETRM
     C                   MOVE      WSTRI         HETRI
     C                   MOVE      WSTRC         HETRC
     C                   MOVE      WSTRCN        HETRCN
     C                   MOVE      WSFBV         HEFBV
NRFA C*                  MOVE      WSRFA         HERFA
NRFA C                   MOVEL     WSRFA         HERFA
     C                   MOVE      WSSDL         HESDL
     C                   MOVE      WSPOS2        HEPOS2
     C                   MOVE      WSGM1         HEGM1
     C                   MOVE      WSGM2         HEGM2
     C                   MOVE      WSVS2         HEVS2
     C                   MOVE      WSKDL         HEKDL
     C                   MOVE      WSKF          HEKF
     C                   MOVE      WSKFT1        HEKFT1
     C                   MOVE      WSFT1         HEFT1
     C                   MOVE      WSVERV        TRVERV
     C                   MOVE      WSVERB        TRVERB
      * SETT OPPDRAGSGIVER (WEB-SPØR/STATISTIKK) ETTER MODUL
     C                   CALL      'SYOP10'
     C                   PARM      'A'           XXXUR             1
     C                   PARM                    HEKNK
     C                   PARM                    HEKNKF
     C                   PARM                    HEKNS
     C                   PARM                    HEKNSF
     C                   PARM                    TRKNFA
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWDT        BEGSR
     C***********************************************
     C                   MOVE      ' '           DTST
     C                   MOVE      W2TOLL        DTTOLL
     C                   MOVE      WSSG          DTSG
     C                   MOVE      'T'           DTRI
     C                   MOVE      WSAVD         DTAVD
     C                   MOVE      WSOPD         DTOPD
     C                   MOVE      XFBNR         DTFBNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWDF        BEGSR
     C***********************************************
     C                   CLEAR                   DOKUFR
     C                   MOVE      ' '           DFST
     C                   MOVEL     KOVXXX        DFBELA
     C     DFBELA        IFEQ      ' '
     C     FILFB         IFEQ      'S'
     C     FILFB         OREQ      'M'
     C                   MOVE      FILFB         DFBELA
     C                   END
     C                   END
     C                   MOVE      KOAKNR        DFKNSS
     C                   MOVEL     WSNAS         DFFASE
     C     FIRAVD        CHAIN     CUNDL01                            34
     C     *IN34         IFEQ      '0'
     C                   MOVE      KNAVN         DFNAVS
     C                   MOVE      ADR1          DFAD1S
     C                   MOVE      *BLANKS       DFAD2S
     C                   MOVEL     ADR3          DFAD3S
     C                   MOVE      POSTNR        DFPNLS
     C                   END
     C                   MOVE      WSNT          DFNTLA
     C                   MOVE      W2TOLL        DFTOLL
     C                   MOVE      WSNAK         DFNAVL
     C                   MOVE      WSADK1        DFAD1L
     C                   MOVE      *BLANKS       DFAD2L
     C                   MOVEL     WSADK3        TMPPUL            4
     C                   TESTN                   TMPPUL               77
     C     *IN77         IFEQ      '1'
     C                   MOVE      TMPPUL        DFPOUL                          UTL.POSTNR
     C                   MOVE      WSADK3        TMPAD3           25
     c                   movel     tmpad3        testbl            1
     c     testbl        ifeq      *blanks
     C                   MOVE      WSADK3        TMPAD3b          24
     C                   MOVEL     TMPAD3b       DFADUL                          UTL.STED
     c                   else
     C                   MOVEL     TMPAD3        DFADUL                          UTL.STED
     c                   end
     C                   ELSE
     C                   MOVEL     WSADK3        DFADUL
     C                   END
     C                   MOVEL     XTRNV         DFNAT
     C                   MOVE      W2KDE         DFKDE
     C                   MOVE      W2KDME        DFKDME
     C                   MOVE      WSKNK         DFKNSM
     C                   MOVE      WSNAK         DFNAVM
     C                   MOVE      WSADK1        DFAD1M
     C                   MOVE      WSADK3        DFAD3M
     C                   MOVEL     WSGM1         DFGM
     C                   MOVE      WSNT          DFNT
     C                   MOVE      WSVS1         DFVS
     C                   MOVE      WSVKT         DFVKT
     C                   MOVE      WSLM          DFLM
     C                   MOVE      WSM3          DFM3
     C                   MOVEL     WSGM2         DFGM2
     C                   MOVEL     WSVS2         DFVS2
     C                   MOVE      WSFBV         DFVKTF
     C                   MOVE      WSSG          DFSG
     C                   MOVE      'F'           DFRI
     C                   MOVE      WSAVD         DFAVD
     C                   MOVE      WSOPD         DFOPD
     C                   MOVE      XFBNR         DFFBNR
     C                   MOVE      DFKNSS        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNS
     C                   MOVE      DFKNSM        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNM
     C*
     C                   WRITE     DOKUFR
     C*
     C                   ENDSR
     C*
N06  C***********************************************
N06  C     SØKKUN        BEGSR
N06  C***********************************************
N06  C   32              MOVE      WSKNK         XKNK              8 0
N06  C   34              MOVE      WSKNS         XKNS              8 0
N06  C                   CALL      'SOEKUN'
N06  C                   PARM                    FIFIRM
N06  C                   PARM                    SOANTK
N06  C                   PARM                    SOTXT1
N06  C                   PARM                    WSKNA
N06  C                   PARM                    SOTXT2
N06  C                   PARM                    WSKNS
N06  C                   PARM                    SOTXT3
N06  C                   PARM                    WSKNSF
N06  C                   PARM                    SOTXT4
N06  C                   PARM                    WSKNK
N06  C                   PARM                    SOTXT5
N06  C                   PARM                    WSKNKF
N06  C                   PARM                    SOTXT6
N06  C                   PARM                    SOKNR6
N06  C                   PARM                    SOTXT7
N06  C                   PARM                    SOKNR7
N06  C                   PARM                    SOTXT8
N06  C                   PARM                    SOKNR8
N06  C   32              MOVE      XKNK          WSKNK
N06  C   34              MOVE      XKNS          WSKNS
N06  C     LINNBR        IFNE      4
N06  C                   Z-ADD     0             UFLAGG
N06  C                   ELSE
N06  C                   Z-ADD     5             LINNBR
N06  C                   Z-ADD     8             POSNBR
N06  C                   Z-ADD     1             UFLAGG
N06  C                   EXSR      TESTKU
N06  C                   END
N06  C
N06  C                   ENDSR
N06  C
     C***********************************************
     C     TSTOPL        BEGSR
     C***********************************************
     C                   SETOFF                                       299899
     C                   SETOFF                                       545556
     C*** TEST OM DET ER OPPLYSNINGER TIL OPPDRAG
     C     FREETK        SETLL     FREETXT
     C     FREETK        READE     FREETXT                                29
     C*** TEST OM AGENT OPPLYSNING. HVIS DET, SETT 56 PÅ
     C                   MOVE      WSKNA         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        56
     C*** TEST OM SELGER OPPLYSNING. HVIS DET, SETT 55 PÅ
     C                   MOVE      WSKNS         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        55
     C*
     C*** TEST OM SELGERSMOTTAGER HAR OPPLYSNING. HVIS DET, SETT 99 PÅ
     C                   MOVE      WSKNSF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        99
     C*** TEST OM KJØPER OPPLYSNING. HVIS DET, SETT 54 PÅ
     C                   MOVE      WSKNK         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        54
     C*** TEST OM KJØPERSMOTTAGER HAR OPPLYSNING. HVIS DET, SETT 98 PÅ
     C                   MOVE      WSKNKF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        98
     C*** TEST OM DET FINNES NAD ADRESSER. HVIS DET, SETT 57 PÅ
     C     HEADFK        SETLL     ENADSF                                 33
     C                   IF        *IN33
     C     HEADFK        READE     ENADSF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        N3039 <> *BLANKS
     C                   IF        NKN = 0
     C                   EVAL      *IN57 = *ON
     C                   LEAVE
     C                   ELSE
     C                   EVAL      KUINTN = N3039
     C     KUNKO2K       CHAIN     KUNKO2                             34
     C   34              LEAVE
     C                   END
     C                   END
     C     HEADFK        READE     ENADSF                                 33
     C                   ENDDO
     C  N33              EVAL      *IN57 = *ON
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      18
     C     WSOPD         ANDNE     0
     C                   CALL      'SYFA19R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      SLVISO
     C                   END
      *
     C* OPPDRAGSNOTAT...
     C  N29LINNBR        IFEQ      1
     C                   EXSR      VISFRE
     C                   GOTO      SLVISO
     C                   END
     C* KUNDE NOTAT...
     C     POSNBR        IFGE      8
     C     POSNBR        ANDLE     40
     C                   SELECT
     C     LINNBR        WHENEQ    4
     C   56              MOVE      SOTXT1        XSKMOT            8
     C   56              MOVE      WSKNA         XSKKNR            8 0
     C   56              GOTO      STVISO
     C     LINNBR        WHENGE    7
     C     LINNBR        ANDLE     9
     C   55              MOVE      SOTXT2        XSKMOT            8
     C   55              MOVE      WSKNS         XSKKNR            8 0
     C   55              GOTO      STVISO
     C     LINNBR        WHENGE    11
     C     LINNBR        ANDLE     13
     C   54              MOVE      SOTXT4        XSKMOT
     C   54              MOVE      WSKNK         XSKKNR
     C   54              GOTO      STVISO
     C                   ENDSL
     C                   END
     C*
     C     POSNBR        IFGE      42
     C     POSNBR        ANDLE     80
     C                   SELECT
     C     LINNBR        WHENGE    7
     C     LINNBR        ANDLE     9
     C   99              MOVE      SOTXT3        XSKMOT            8
     C   99              MOVE      WSKNSF        XSKKNR            8 0
     C   99              GOTO      STVISO
     C     LINNBR        WHENGE    11
     C     LINNBR        ANDLE     13
     C   98              MOVE      SOTXT5        XSKMOT
     C   98              MOVE      WSKNKF        XSKKNR
     C   98              GOTO      STVISO
     C                   ENDSL
     C                   END
     C*
     C* HVIS F14 ER TRYKKET I UDEFINERT OMRÅDE VISES FØRSTE
     C* OG BESTE, HVIS DET FINNES NOE
     C                   SELECT
     C     *IN56         WHENEQ    '1'                                           AGENT
     C                   MOVE      SOTXT1        XSKMOT            8
     C                   MOVE      WSKNA         XSKKNR
     C                   GOTO      STVISO
     C     *IN55         WHENEQ    '1'                                           SELGER
     C                   MOVE      SOTXT2        XSKMOT            8
     C                   MOVE      WSKNS         XSKKNR
     C                   GOTO      STVISO
     C     *IN99         WHENEQ    '1'                                           SELGERS MOTAGER
     C                   MOVE      SOTXT3        XSKMOT            8
     C                   MOVE      WSKNSF        XSKKNR
     C                   GOTO      STVISO
     C     *IN54         WHENEQ    '1'                                           KJØPER
     C                   MOVE      SOTXT4        XSKMOT
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C     *IN98         WHENEQ    '1'                                           KJØPERS MOTAGER
     C                   MOVE      SOTXT5        XSKMOT
     C                   MOVE      WSKNKF        XSKKNR
     C                   GOTO      STVISO
     C                   ENDSL
     C*
     C*
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
     C*
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR
     C                   PARM                    XSKMOT
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
     C*
     C*
     C     SLVISO        ENDSR
     C*
     C***********************************************
     C     VISFRE        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   ENDSR
     C*
     C***********************************************
     C     SØKVAD        BEGSR
     C***********************************************
      * 'K*XXXXX  = SØK I KUNDEREGISTER..
     C     WSNAKA        IFEQ      'K*'
     C                   MOVE      *ZEROS        XXXKN             8 0
     C                   MOVEL     WSNAKB        XXXNA            30
     C                   CALL      'SOEKKUN'
     C                   PARM                    XXXKN
     C                   PARM                    FIFIRM
     C                   PARM                    XXXNA
     C     XXXKN         IFNE      *ZEROS
     C                   MOVE      XXXKN         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C     *IN33         IFEQ      *OFF                                           3<-B
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0                                               4<-B
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE                                                     3
     C                   MOVE      ENGAD3        WSADK3
     C                   END
     C                   ELSE                                                      4
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END
     C                   ELSE
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    WSKNK
     C                   PARM                    WSNAK
     C                   PARM                    WSADK1
     C                   PARM                    WSADK2
     C                   PARM                    WSADK3
     C                   PARM                    WSLAND            2
     C                   PARM                    UADRNR            5
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKVA2        BEGSR
     C***********************************************
     C                   MOVE      WSKNS         UUKNR
     C                   CALL      'SYFA81'
     C                   PARM                    UUKNR             8 0
     C     UUKNR         IFNE      *ZEROS
     C                   MOVE      UUKNR         WSKNK
     C                   EXSR      TESTKU
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FRABR         BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFI10P'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   PARM                    XFBNR
     C                   PARM                    TEST              1
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C*
     C     TEST          IFEQ      '2'
     C                   CALL      'SYFI10A'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XFBNR
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   PARM                    TEST
     C                   MOVE      *BLANKS       TEST
     C                   END
     C*                    Z-ADD1         XFBNR
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FAKTUR        BEGSR
     C***********************************************
      * SJEKK OM TVUNGET (ELLER FRITT) VEDLIKEHOLD AV FRIE SØKEVEIER
      * BASERT PÅ KUNDENR. (OPPDR.GIVERS OG FAKT.MOTT. KUNDENR)
     C                   EXSR      TESTKT
     C                   MOVE      'N'           OTIAUT            1              KRAV=auto
     C*
     C     OTIKU1        IFNE      *ZEROS
     C* FØRST KUNDE 1
     C                   MOVE      OTIKU1        OTIKNR
     C     OTI0          TAG
     C                   MOVE      WSAVD         OTIAVD
     C     OTI1          TAG
     C                   MOVE      'N'           OTIJN             1
     C     OTIKEY        SETLL     CUOTI
     C     OTIKEY        READE     CUOTI                                  33
     C     *IN33         DOWEQ     '0'
      * Kundespesif. søkevei.. Finnes koden fra før/hvis ikke lag den
     C                   MOVE      'J'           OTIJN
     C                   MOVE      WSAVD         FSAVD
     C                   MOVE      WSOPD         FSOPD
     C                   MOVE      COKODE        FSKODE
     C     FSOKEY        CHAIN     FRISOK                             33
     C  N33              UPDATE    FRISOKR
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       FSSOK
     C     FSKODE        CHAIN     KODFRI                             33
     C                   MOVE      KFSODK        FSDOKK
     C                   MOVE      HEDTOP        FSDTOP
     C                   WRITE     FRISOKR
     C                   END
      *  Hvis kravfelt.. er det utfyllt ...  hvis ikke AUTO INN..
     C     COKRAV        IFEQ      '1'
     C     COKRAV        OREQ      '2'
     C     FSSOK         IFEQ      *BLANKS
     C                   MOVE      'J'           OTIAUT                           KRAV=AUTO
     C                   END
     C                   END
     C     OTIKEY        READE     CUOTI                                  33
     C                   END
      * Hvis ingenting fantes på spesifik avdeling, prøv med 0 i avd.
     C     OTIJN         IFEQ      'N'
     C     OTIAVD        ANDNE     *ZEROS
     C                   MOVE      *ZEROS        OTIAVD
     C                   GOTO      OTI1
     C                   END
      * DERETTER KUNDE 2  HVIS FORSKJ. FRA KUNDE 1
     C     OTIKU2        IFNE      *ZEROS
     C                   MOVE      OTIKU2        OTIKNR
     C                   MOVE      *ZEROS        OTIKU2
     C                   GOTO      OTI0
     C                   END
      *
     C* HVIS UTILFREDSSTILTE KRAVFELT - AUTO-VIS FRIE SØKEV.
     C     OTIAUT        IFEQ      'J'
     c                   move      WSKNSF        OTIKU1
     C                   MOVE      *ZEROS        OTIKU2
     C     WSKNKF        IFNE      *zeros
     C     WSKNKF        andne     WSKNSF
     C     OTIKU1        ifeq      *zeros
     C                   MOVE      WSKNKF        OTIKU1
     C                   else
     C                   MOVE      WSKNKF        OTIKU2
     C                   end
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   END
     C*
     C                   END
     C*
     C                   Z-ADD     0             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   16              Z-ADD     6             UFLAGG
     C                   MOVE      *ZEROS        UKFRA             7 0
     C                   MOVE      ' '           WSMELD            1
     C     UFLAGG        IFEQ      3
     C     UFLAGG        OREQ      6
     C                   GOTO      BAT
     C                   END
     C                   CALL      'SYFI10X'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XNYGML
     C                   PARM                    KO2UTL
     C                   PARM                    XKUTL
     C                   PARM                    XSUTL
     C                   PARM                    XKUMIN
     C                   PARM                    XSUMIN
     C                   PARM                    KO2MVK
     C                   PARM                    KO2MVS
     C                   PARM                    UKFRA
     C                   PARM                    KOVAVR
     C                   PARM                    WSMSG
     C                   PARM                    WSMELD
     C                   PARM                    UFLAGG
     C                   PARM                    UKODE
     C                   PARM                    USECUR            6
     C                   GOTO      UTFAK
     C     BAT           TAG
     C                   MOVEL     FIFIRM        QDA01
     C                   MOVEL     WSAVD         QDA02
     C                   MOVEL     WSOPD         QDA03
     C                   MOVEL     XNYGML        QDA04
     C                   MOVEL     KO2UTL        QDA05
     C                   MOVEL     XKUTL         QDA06
     C                   MOVEL     XSUTL         QDA07
     C                   MOVEL     XKUMIN        QDA08
     C                   MOVEL     XSUMIN        QDA09
     C                   MOVEL     KO2MVK        QDA10
     C                   MOVEL     KO2MVS        QDA11
     C                   MOVEL     UKFRA         QDA12
     C                   MOVEL     KOVAVR        QDA13
     C                   MOVEL     WSMSG         QDA14
     C                   MOVEL     WSMELD        QDA15
     C                   MOVEL     UFLAGG        QDA16
     C                   MOVEL     UKODE         QDA17
     C                   MOVEL     USECUR        QDA18
     C                   MOVEL     'SYFI10XQ'    QDTAQ            10
     C                   MOVEL     '*LIBL'       QLIB             10
     C                   Z-ADD     109           QRLEN             5 0
     C                   CALL      'QSNDDTAQ'
     C                   PARM                    QDTAQ
     C                   PARM                    QLIB
     C                   PARM                    QRLEN
     C                   PARM                    QDATA
     C     UTFAK         TAG
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C   16              MOVE      HEOPD         WSOPDG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG
     C     LINNBR        IFEQ      2
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     17
     C                   SETOFF                                       97
     C     TURKEY        CHAIN     TURER                              33
     C  N33              MOVE      TUDTÅ         WSDTÅ
     C  N33              MOVE      TUDTM         WSDTM
     C  N33              MOVE      TUDTD         WSDTD
     C  N33              MOVEL     TUTARF        WSRFA
     C  N33              MOVE      TUKNA         WSKNA
     C  N33              MOVE      *BLANKS       WSNAA
     C  N33              MOVEL     TUBILN        WSHAWB
     C  N33              MOVE      TULK          WSTRI
     C  N33              MOVE      TUTRMA        WSTRM
     C  N33              Z-ADD     23            POSNBR
     C   33              Z-ADD     8             POSNBR
     C   33              SETON                                        97
     C                   GOTO      SLSØK
     C                   END
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N06  C     POSNBR        IFGT      8
N06  C                   EXSR      SØKKUN
N06  C                   else
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNA
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N01  C                   Z-ADD     54            POSNBR
N06  C                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     54
     C     POSNBR        ANDLE     61
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
E01  C  N34LINNBR        IFEQ      7
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N06  C     POSNBR        IFGT      8
N06  C                   EXSR      SØKKUN
N06  C                   else
N04  C                   MOVE      WSNAS         UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNS
N01  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAS
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N01  C                   Z-ADD     42            POSNBR
N06  C                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
N06  C     POSNBR        IFGT      42
N06  C                   EXSR      SØKKUN
N06  C                   else
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNSF
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N01  C                   Z-ADD     10            LINNBR
N01  C                   Z-ADD     19            POSNBR
N06  C                   endif
     C                   GOTO      SLSØK
     C                   END
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     37
     C                   EXSR      SØKVA2
     C                   GOTO      SLSØK
     C                   END
     C*
E01  C  N32LINNBR        IFEQ      11
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N06  C     POSNBR        IFGT      8
N06  C                   EXSR      SØKKUN
N06  C                   else
N04  C                   MOVE      WSNAK         UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNK
N01  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAK
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N01  C                   Z-ADD     42            POSNBR
N06  C                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
N06  C     POSNBR        IFGT      42
N06  C                   EXSR      SØKKUN
N06  C                   else
N01  C                   MOVE      *BLANKS       UKNAVN           30
N01  C                   CALL      'SOEKKUN'
N01  C                   PARM                    WSKNKF
N01  C                   PARM                    FIFIRM
N01  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N01  C                   Z-ADD     14            LINNBR
N01  C                   Z-ADD     19            POSNBR
N06  C                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     37
     C                   EXSR      SØKVAD
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     19            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* LOSSESTED
     C*
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     27
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDL
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* IKKE VED POSTNUMMERLOGIKK
     C*
     C  N53LINNBR        IFEQ      3
     C     POSNBR        ANDGE     16
     C     POSNBR        ANDLE     20
     C                   MOVE      *BLANKS       UNVN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDF
     C                   PARM                    UNVN             30
     C                   PARM                    WSLKA
     C                   MOVE      WSLKA         WSLKS
     C                   Z-ADD     27            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* IKKE VED POSTNUMMERLOGIKK
     C*
     C  N53LINNBR        IFEQ      3
     C     POSNBR        ANDGE     24
     C     POSNBR        ANDLE     31
     C                   MOVE      *BLANKS       UNVN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDT
     C                   PARM                    UNVN             30
     C                   PARM                    FIRLK
     C                   MOVE      FIRLK         WSLKK
     C                   Z-ADD     34            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C* IKKE VED POSTNUMMERLOGIKK
     C*
     C  N53LINNBR        IFEQ      3
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKA
     C                   PARM                    USPED
     C                   Z-ADD     16            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* TRANSPORTMÅTE
     C*
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   CALL      'SAD061I'
     C                   PARM                    WSTRM
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     21
     C     POSNBR        ANDLE     22
     C                   MOVE      'N'           USPED
     C                   CALL      'SYFI10L'
     C                   PARM                    WSTRI
     C                   PARM                    USPED
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALS
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALK
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     3
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT
     C                   Z-ADD     5             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     5
     C     POSNBR        ANDLE     7
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR
     C                   PARM                    USPED
     C                   Z-ADD     9             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* FORFRAKT LAND
     C*
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     19
     C     POSNBR        ANDLE     20
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKS
     C                   PARM                    USPED
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*FORFRAKT FRA
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     22
     C     POSNBR        ANDLE     26
     C                   MOVE      *BLANKS       UNVN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDFF
     C                   PARM                    UNVN             30
     C                   PARM                    WSLKS
     C                   Z-ADD     08            POSNBR
     C                   ADD       1             LINNBR
     C                   GOTO      SLSØK
     C                   END
     C* VIDEREFRAKT TIL
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     19
     C     POSNBR        ANDLE     20
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKK
     C                   PARM                    USPED
     C                   Z-ADD     22            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     22
     C     POSNBR        ANDLE     26
     C                   MOVE      *BLANKS       UNVN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDVT
     C                   PARM                    UNVN             30
     C                   PARM                    WSLKK
     C                   Z-ADD     2             POSNBR
     C                   ADD       2             LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     9
     C     POSNBR        ANDLE     10
     C                   CALL      'SYFA71A'
     C                   PARM                    WSKF
     C                   Z-ADD     12            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDEQ     12
     C                   MOVE      *BLANKS       XKFKOD
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP
     C                   PARM                    UUPDAT            1
     C                   PARM                    XKFKOD
     C                   MOVEL     XKFKOD        WSKFT1
     C                   Z-ADD     15            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDEQ     80
     C                   MOVEL     WSKDPL        XUKOD
     C                   CALL      'SYKUKD'
     C                   PARM                    XUTYP
     C                   PARM                    UUPDAT
     C                   PARM                    XUKOD
     C                   MOVEL     XUKOD         WSKDPL
     C                   Z-ADD     19            LINNBR
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     31
     C     POSNBR        ANDLE     33
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALS
     C                   Z-ADD     35            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      21
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     3
     C                   CALL      'SYFI10H'
     C                   PARM                    W2TOLL
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR ANTALL
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     31
S15  C*                  Z-ADD     WSNT          UNU132           13 2
N15  C                   Z-ADD     WSNT          UNU133           13 3
     C                   CALL      'SYGE11'
S15  C*                  PARM                    UNU132
N15  C                   PARM                    UNU133
S15  C*                  Z-ADD     UNU132        WSNT
N15  C                   Z-ADD(H)  UNU133        WSNT
     C                   Z-ADD     33            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR BRUTTOVEKT
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     59
     C     POSNBR        ANDLE     67
S15  C*                  Z-ADD     WSVKT         UNU132           13 2
N15  C                   Z-ADD     WSVKT         UNU133           13 3
     C                   CALL      'SYGE11'
S15  C*                  PARM                    UNU132
N15  C                   PARM                    UNU133
S15  C*                  Z-ADD     UNU132        WSVKT
N15  C                   Z-ADD(H)  UNU133        WSVKT
     C                   Z-ADD     71            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR KUBIKK
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     71
     C     POSNBR        ANDLE     79
S15  C*                  Z-ADD     WSM3          UNU132           13 2
N15  C                   Z-ADD     WSM3          UNU133           13 3
     C                   CALL      'SYGE11'
S15  C*                  PARM                    UNU132
N15  C                   PARM                    UNU133
S15  C*                  Z-ADD     UNU132        WSM3
N15  C                   Z-ADD(H)  UNU133        WSM3
     C                   Z-ADD     9             POSNBR
     C                   Z-ADD     17            LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR LASTEMETER
     C     LINNBR        IFEQ      17
     C     POSNBR        ANDGE     66
     C     POSNBR        ANDLE     70
S15  C*                  Z-ADD     WSLM          UNU132           13 2
N15  C                   Z-ADD     WSLM          UNU133           13 3
     C                   CALL      'SYGE11'
S15  C*                  PARM                    UNU132
N15  C                   PARM                    UNU133
S15  C*                  Z-ADD     UNU132        WSLM
N15  C                   Z-ADD(H)  UNU133        WSLM
     C                   Z-ADD     9             POSNBR
     C                   Z-ADD     18            LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR VAREVERDI
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     35
     C     POSNBR        ANDLE     48
S15  C*                  Z-ADD     WSVERB        UNU132           13 2
N15  C                   Z-ADD     WSVERB        UNU133           13 3
     C                   CALL      'SYGE11'
S15  C*                  PARM                    UNU132
N15  C                   PARM                    UNU133
S15  C*                  Z-ADD     UNU132        WSVERB
N15  C                   Z-ADD(H)  UNU133        WSVERB
     C                   Z-ADD     66            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     UTCMDL        BEGSR
     C***********************************************
     C     XCMD          IFEQ      0
     C                   MOVE      'DIV0032'     MSGLN1                         F4=SØKING
     C                   MOVE      'DIV0033'     MSGLN2                         F7=GÅ TIL SP
     C                   MOVE      'DIV0024'     MSGLN3                         F12=FORRIGE
     C                   MOVE      'DIV0029'     MSGLN4                         F24=FLERE TA
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      1
     C                   MOVE      'DIV0037'     MSGLN1                         F14=VIS OPPL
     C  N31              MOVE      'DIV0035'     MSGLN2                         F9=NY TURNR.
     C   31              MOVE      'DIV0000'     MSGLN2
     C                   MOVE      'DIV3572'     MSGLN3                         F18=NOTIS
     C  N31              ADD       1             XCMD
     C   31              Z-ADD     0             XCMD
     C                   ELSE
     C     XCMD          IFEQ      2
     C                   MOVE      'DIV0020'     MSGLN1                         F3=AVSLUTT
     C                   MOVE      'DIV0030'     MSGLN2                         F5=VIDERE
     C                   MOVE      'DIV0031'     MSGLN3                         F16=NESTE OP
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C     XCMD          IFEQ      3
     C                   MOVE      'SHU0127'     MSGLN1                         F15=FRIE SØK
     C                   MOVE      'DIV0000'     MSGLN2
     C                   MOVE      'SHU0251'     MSGLN3                         F17=FORDEL O
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      4
     C                   MOVE      'JOV0803'     MSGLN1                         F11=DUP-OPPD
N16  c                   move      'SHU1679'     MSGLN2
s16  C*                  MOVE      'DIV0000'     MSGLN2                         ...LEDIG ...
     C                   MOVE      'DIV0000'     MSGLN3                         ...LEDIG ...
     C                   ADD       1             XCMD
     C                   ELSE
     C                   MOVE      'BBA0122'     MSGLN1
     C                   MOVE      'DIV0041'     MSGLN2                         F6=BEREGN KU
     C                   MOVE      'DIV0000'     MSGLN3
     C                   Z-ADD     0             XCMD
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     FIRAVD        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
     C     OAVTKS        KLIST
     C                   KFLD                    WSKNK
     C                   KFLD                    WSOT
     C     KOTRKE        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    XXKNSY            8 0
     C                   KFLD                    HEKNT
     C*
     C     FREETK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     HEADFK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     TURKEY        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPRO
     C     HEADKK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     DOKUFK        KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     DOKSLK        KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     DOKUTK        KLIST
     C                   KFLD                    XDTSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     KODTAK        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    XVUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    XSFUNI
     C                   KFLD                    WSSG
     C     KODTEK        KLIST
     C                   KFLD                    XTEUNI
     C                   KFLD                    WSSDL1
     C     KODOTK        KLIST
     C                   KFLD                    XOTUNI
     C                   KFLD                    WSOT
     C     KODO2K        KLIST
     C                   KFLD                    XO2UNI
     C                   KFLD                    WSOT
     C     KODLIK        KLIST
     C                   KFLD                    KLIUNI
     C                   KFLD                    KLIKOD
     C     KODTSK        KLIST
     C                   KFLD                    XTSUNI
     C                   KFLD                    W2TOLL
     C     KODGEK        KLIST
     C                   KFLD                    XGEUNI
     C                   KFLD                    WSVALT
     C     KODFRK        KLIST
     C                   KFLD                    XFRUNI
     C                   KFLD                    WSFR
     C     KODLKK        KLIST
     C                   KFLD                    XLKUNI
     C                   KFLD                    WSLKA
     C     WSSDFK        KLIST
     C                   KFLD                    WSLKA
     C                   KFLD                    WSSDF
     C     WSSDTK        KLIST
     C                   KFLD                    FIRLK             2
     C                   KFLD                    WSSDT
     C     WKSDFF        KLIST
     C                   KFLD                    WSLKS
     C                   KFLD                    WSSDFF
     C     WKSDVT        KLIST
     C                   KFLD                    WSLKK
     C                   KFLD                    WSSDVT
     C     KODS2K        KLIST
     C                   KFLD                    XS2UNI
     C                   KFLD                    WSTRI
     C     KODS4K        KLIST
     C                   KFLD                    XS4UNI
     C                   KFLD                    WSTRM
     C     KODVAK        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KVAKOD
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'A'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    XVADRN
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNT
     C     KUFASK        KLIST
     C                   KFLD                    XUTYP
     C                   KFLD                    XUKOD
     C                   MOVEL     'PRODTYPE'    XUTYP
     C     *LIKE         DEFINE    KFTYP         XUTYP
     C     *LIKE         DEFINE    KFKOD         XUKOD
     C                   MOVE      'N'           UUPDAT            1
     C     KOFASK        KLIST
     C                   KFLD                    XKFTYP
     C                   KFLD                    XKFKOD
     C                   MOVEL     'UTLKOD'      XKFTYP
     C     *LIKE         DEFINE    KFTYP         XKFTYP
     C     *LIKE         DEFINE    KFKOD         XKFKOD
     C     UTLLGK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    YUTLDT            8 0
     C                   MOVE      '99999999'    YUTLDT
     C     UTLL2K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     OTIKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    OTIKNR            8 0
     C                   KFLD                    OTIAVD            4 0
     C     FSOKEY        KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
     C     KUNKO2K       KLIST
     C                   KFLD                    NKN
     C                   KFLD                    KUINTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    USG               3
     C                   PARM                    UTYPE             3
     C*** UKODE = 'O' KALLE FRA SYFF10CLO
     C*** UKODE = 'S' KALLE FRA SYFF10CLS
     C*** UKODE = 'K' KALLE FRA SYFF10CLK
     C*** UKODE = 'A' KALLE FRA ?????????
     C*** UKODE = 'Z' KALLE FRA SYOP21R
     C                   PARM                    UKODE             1
     C                   PARM                    UDUMMY            1
     C                   PARM                    UAVDNY            4 0
      *
     C                   CLEAR                   BILDE01
     C                   CLEAR                   BILDE02
     C                   CLEAR                   BUNN
     C                   CLEAR                   HEADFR
     C                   MOVE      *ZEROS        *IN
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C     UKODE         IFEQ      'Z'
     C                   MOVE      UKODE         XKODE             1
     C                   MOVE      ' '           UKODE
     C                   END
     C     UTYPE         IFEQ      'CHG'
     C     UTYPE         OREQ      'CHF'
     C     UTYPE         OREQ      'CHO'
     C     UOPD          IFEQ      -1
     C                   MOVE      *ZEROS        UOPD
     C                   MOVE      '1'           *IN04
     C                   END
     C                   MOVE      UOPD          WSOPD
     C                   ELSE
     C                   MOVE      '1'           *IN58
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      UAVD          HEAVD
     C                   MOVE      UOPD          HEOPD
     C                   MOVE      *ZEROS        UOPD
     C                   MOVE      UAVDNY        WSAVD
     C                   END
     C                   END
      *
     C     UKODE         IFEQ      'A'
     C                   SETON                                        3234
     C                   ELSE
     C     UKODE         COMP      'K'                                    32    KUN KJØPER
     C     UKODE         COMP      'S'                                    34    KUN SELGER
     C                   END
     C*
n06  C                   Z-ADD     5             SOANTK            1 0
n06  C                   MOVE      *BLANKS       SOTXT6            8
n06  C                   MOVE      *BLANKS       SOTXT7            8
n06  C                   MOVE      *BLANKS       SOTXT8            8
n06  C                   MOVE      *ZEROS        SOKNR6            8 0
n06  C                   MOVE      *ZEROS        SOKNR7            8 0
n06  C                   MOVE      *ZEROS        SOKNR8            8 0
     C*
     C     *LIKE         DEFINE    WSAVD         AVDZER
     C                   MOVE      'A'           UUR               1
     C                   MOVE      'J'           USØK              1
     C                   MOVE      'F'           XDFSTA            1
     C                   MOVE      'T'           XDTSTA            1
     C                   MOVE      '001'         XFBNR             3 0
     C                   MOVE      'A'           XAUNI             1
     C                   MOVE      'V'           XVUNI             1
     C                   MOVE      'SF'          XSFUNI            2
     C                   MOVE      'TERM'        XTEUNI            4
     C                   MOVE      'OTY'         XOTUNI            3
     C                   MOVE      'O2Y'         XO2UNI            3
     C                   MOVE      'TST'         XTSUNI            3
     C                   MOVE      'FR'          XFRUNI            2
     C                   MOVE      'GE'          XGEUNI            2
     C                   MOVE      'LK '         XLKUNI            3
     C                   MOVE      'S2 '         XS2UNI            3
     C                   MOVE      'S4 '         XS4UNI            3
     C                   MOVE      'LIKO'        KLIUNI
     C                   MOVE      'VA'          XVAUNI            2
     C                   MOVE      *ZEROS        XFXLNR            2 0
     C                   MOVE      '00001'       XVADRN            5 0
     C                   MOVE      *ZEROS        XVALP
     C                   MOVEL     'M³ =    '    XMÅL
     C                   MOVE      ' ,   '       XMÅL
     C*
     C                   MOVE      'DIV1064'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT1            8
     C*
     C                   MOVE      'SHU0917'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     62            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          MANGLE           62
     C                   MOVE      'DIV1060'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT2            8
     C                   MOVE      'DIV1061'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT3            8
     C                   MOVE      'DIV1062'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT4            8
     C                   MOVE      'DIV1063'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT5            8
     C                   MOVE      'DIV0608'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     62            XMSGL
     C                   EXSR      HENTMS
     C*
     C                   MOVE      *BLANKS       FIFIRM
     C     FIFIRM        SETLL     FIRM                               33
     C                   READ      FIRM                                   33
     C                   MOVE      FILAND        WSLKK
     C                   MOVE      FILAND        FIRLK
     C                   EXSR      UTCMDL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             62
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TURSR         BEGSR
     C***********************************************
     C*
     C                   SETOFF                                       9830
     C                   SETOFF                                       030405
     C                   SETOFF                                       1612
     C     TURSOK        IFEQ      'J'
     C                   GOTO      LESNT
     C                   END
     C*
     C     STTUR         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WSPRO         CABEQ     0             NYTXX
     C     TURKEY        SETLL     HEAD8
     C     STTUR1        TAG
     C     TURKEY        READE     HEAD8                                  94
     C  N94HEUR          IFNE      'A'
     C                   GOTO      STTUR1
     C                   END
     C  N94HEST          IFNE      ' '
     C                   GOTO      STTUR1
     C                   END
      *
     C     STTUR2        TAG
      *
     C  N94              DO
     C                   DO        8
     C                   ADD       1             ZRECNO
     C                   MOVEL     HENAK         WSPOSK
     C                   MOVE      HEDTD         WEDTD
     C                   MOVE      HEDTM         WEDTM
     C                   MOVE      HEDTÅ         WEDTÅ
     C                   WRITE     SUBFIL
     C     ST21B         TAG
     C     TURKEY        READE     HEAD8                                  94
     C  N94HEUR          IFNE      'A'
     C                   GOTO      ST21B
     C                   END
     C  N94HEST          IFNE      ' '
     C                   GOTO      ST21B
     C                   END
     C  N94              END
     C                   END
     C*
     C     NYTXX         TAG
     C                   MOVE      ZRECNO        XRECNO            4 0
     C     STTUR3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   WRITE     NYVARE
     C                   GOTO      ST41
     C                   END
     C                   WRITE     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C                   MOVE      WSPRO         GGGPRO            8 0
     C                   EXFMT     BUNN
     C  N12WSPRO         IFNE      *ZEROS
     C     WSPRO         IFNE      GGGPRO
     C                   GOTO      STTUR
     C                   END
     C                   END
     C*
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     XRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   READP     HEAD8                                  94
     C     TURKEY        READE     HEAD8                                  94
     C                   GOTO      STTUR2
     C                   END
     C   12              MOVE      'N'           TURSOK
     C   12              MOVE      *ZEROS        HEAVD
     C   12              MOVE      *ZEROS        HEOPD
     C   12              GOTO      UT
     C*
     C     LESNT         TAG
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      STTUR3
     C                   ELSE
     C                   EXSR      HHENT
     C   98TURSOK        IFEQ      'J'
     C                   MOVE      'N'           TURSOK
     C                   SETOFF                                       9830
     C                   GOTO      STTUR
     C                   END
     C   98              GOTO      STTUR3
     C                   END
     C*
     C     WSNR          IFEQ      '2'
     C                   MOVE      HEAVD         WSAVD
     C                   MOVE      HEOPD         WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETON                                        09
     C                   END
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   SETOFF                                       94
     C*
     C     UT            ENDSR
     C*
     C***********************************************
     C     HHENT         BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   SETOFF                                       9830
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     WSNR          OREQ      '3'
     C                   MOVE      'J'           TURSOK            1
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     KUBIKK        BEGSR
     C***********************************************
     C                   MOVE      'J'           XFLYTM
     c     WSOPD         ifne      *zeros
     C                   MOVE      'O'           XFLYTM
     C                   clear                   HØ
     C                   clear                   LE
     C                   clear                   BR
     C                   clear                   AN
S12  c*                  clear                   HØXX
S12  c*                  z-add     wsavd         xxav
S12  c*                  z-add     wsopd         xxop
S12  C*                  MOVEA     HØXX          HØ
N12  c                   z-add     wsavd         UUavd
N12  c                   z-add     wsopd         UUopd
     c                   end
     C* SUBROUTINE FOR CUBIKK
     C                   CALL      'SYIN10B'
n12  C                   PARM                    UUavd             4 0
n12  C                   PARM                    UUopd             7 0
n12  C                   PARM                    UUfbn             3 0
     C                   PARM                    XFLYTM            1
     C                   PARM                    UM3               7 3
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C     UM3           IFNE      *ZEROS
     C                   Z-ADD     UM3           WSM3
     C                   END
     C*
     C                   ENDSR
      *
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      'STR'         TTACTI
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
S07  C*                  MOVE      UUSR          TTUSER
N07  C                   MOVE      ZUSER         TTUSER
     C                   MOVEL     'Order en'    XXTEXT           16
     C                   MOVE      'tered   '    XXTEXT
     C                   MOVEL     XXTEXT        TTTEXT
n09  C                   MOVEL     'Ordre op'    XXTEXT           16
n09  C                   MOVE      'prettet '    XXTEXT
n09  C                   MOVEL     XXTEXT        TTTEXL
     C                   WRITE     TRACKFR
      *
      * ETD/ATD - ETA/ATA - TIDSOPPFØLGING. (EGEN FIL TRACKT)
      * (KUNNE TENKES Å VÆRE KUNDESTYRT... RESERVERT KODE I CUOTI???)
     C                   CLEAR                   TRACKTR
     C                   MOVE      HEAVD         TXAVD
     C                   MOVE      HEOPD         TXOPD
     C                   MOVE      *ZEROS        TXETDD
     C                   MOVE      *ZEROS        TXETDK
     C                   MOVE      HEDTOP        TXETAD
     C                   MOVE      *ZEROS        TXETAK
     C                   WRITE     TRACKTR
     C                   ENDSR
     C***********************************************
     C     SOKUKU        BEGSR
     C***********************************************
     C     VADKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    WSKURE
     C     VADKEY        CHAIN     VADR3                              33
     C  N33              DO
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C                   END                                                      3<-E
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     TESTKT        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        OTIKU1            8 0
     C                   MOVE      *ZEROS        OTIKU2            8 0
     C     WSKDFS        IFNE      'X'
     C                   MOVE      WSKNSF        OTIKU1
     C                   END
     C     WSKDFK        IFNE      'X'
     C     OTIKU1        IFEQ      *ZEROS
     C                   MOVE      WSKNKF        OTIKU1
     C                   ELSE
     C                   MOVE      WSKNKF        OTIKU2
     C                   END
     C                   END
     C                   ENDSR
