     FFAK3      UF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UFAKT             6 0
     C     FAKKEY        KLIST
     C                   KFLD                    FAOPKO
     C                   KFLD                    FAFAKT
     C*
     C                   MOVE      'F'           FAOPKO
     C                   Z-ADD     UFAKT         FAFAKT
     C                   SETOFF                                       33
     C     FAKKEY        SETLL     FAK3
     C     *IN33         DOWEQ     '0'
     C     FAKKEY        READE     FAK3                                   33
     C     *IN33         IFNE      '1'
     C                   MOVE      FADATO        FADAFF
     C                   UPDATE    FAKTR
     C                   END
     C                   END
     C                   SETON                                        LR
     C                   RETURN
