      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE AWBNUMMERSERIER (FLYINNLAND) ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-67 71-90       ***
      ***                    95-97 99                            ***
      **************************************************************
      *
     FTELLA     UF A E           K DISK
     FKODTFS    IF   E           K DISK
     FSYFA42FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  KFSNAV                 1     30
     D  XFSNAV                 1     20
     D  XFSNA3                 1      3
     C*
     C     START0        TAG
     C                   EXFMT     BILDE01
     C   03              GOTO      SLUTT
     C   12              GOTO      SLUTT
      *
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2FNR         YFNR              3 0
     C                   MOVE      ' '           YTAB              1
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     TELLA1        SETLL     TELLA
     C     START1        TAG
     C     UIEJ          READE     TELLA                                  94
     C   94              MOVE      *BLANKS       KFSNAV
     C   94              MOVE      *BLANKS       WSNR
     C  N94              UPDATE    TELLAR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C     KODFSK        CHAIN     KODTFS                             33
     C   33              MOVE      *BLANKS       KFSNAV
     C     TEATI1        SUB       TEAFR1        WSDIFF
     C                   ADD       1             WSDIFF
     C     WSDIFF        IFLT      0
     C                   MOVE      *ZEROS        WSDIFF
     C                   END
     C                   WRITE     SUBFIL
     C     UIEJ          READE     TELLA                                  94
     C  N94              UPDATE    TELLAR
     C  N94              MOVE      TEAFNR        YFNR
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       3098
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY SAMLASTAVGANG
     C   06              GOTO      START5
     C*** SØK FRA SAMLASTAVGANG
     C   08              GOTO      START6
     C*** TILBAKE
     C   12              GOTO      START0
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94TELLA3        SETLL     TELLA
     C  N94UIEJ          READE     TELLA                                  94
     C                   GOTO      START2
     C                   END
     C*
     C                   EXSR      HENT
     C   98              GOTO      START3
     C*
     C*** SLETT POST
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     TELLA2        CHAIN     TELLA                              33
     C  N33              DELETE    TELLAR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DLT'        KFSNAV
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE POST
     C     START5        TAG
     C                   SETOFF                                       30
     C                   EXFMT     VARELI
     C                   SETOFF                                       686970
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA UTSKRIFTTYPE
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C*
     C* TEST FLYSELSKAPSNR
     C                   MOVE      WSFNR         TEAFNR
     C     KODFSK        CHAIN     KODTFS                             70
     C   70              SETON                                        30
     C   70              MOVE      'SPF0009'     MSGNR
     C   70              GOTO      SLTB
     C                   END
     C*
     C* TEST OM AWBNUMMER
     C     WSFR1         COMP      *ZEROS                                 69
     C   69              SETON                                        30
     C   69              MOVE      'SPA0016'     MSGNR
     C   69              GOTO      SLTB
     C     WSFR1         COMP      WSTI1                              68
     C   68              MOVE      'SPA0017'     MSGNR
     C   68              SETON                                        69
     C   68              SETON                                        30
     C   68              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     TELLAK        CHAIN     TELLA                              33
     C                   EXSR      MOVWTA
     C  N33              UPDATE    TELLAR
     C   33              WRITE     TELLAR
     C     TEATI1        SUB       TEAFR1        WSDIFF
     C                   ADD       1             WSDIFF
     C     WSDIFF        IFLT      0
     C                   MOVE      *ZEROS        WSDIFF
     C                   END
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     XFSNAV        COMP      '*DLT'                                 98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVTAW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     XFSNAV        COMP      '*DLT'                                 98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       KFSNAV
     C                   MOVE      *ZEROS        TEAFNR
     C                   MOVE      *ZEROS        TEAFR1
     C                   MOVE      *ZEROS        TEATI1
     C                   MOVE      *BLANKS       TEAACC
     C                   MOVE      *ZEROS        TEAFR2
     C                   MOVE      *ZEROS        TEATI2
     C                   MOVE      *ZEROS        TEATAB
     C                   MOVE      *ZEROS        WSDIFF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSFNR
     C                   MOVE      *ZEROS        WSFR1
     C                   MOVE      *ZEROS        WSTI1
     C                   MOVE      *BLANKS       WSACC
     C                   MOVE      *ZEROS        WSFR2
     C                   MOVE      *ZEROS        WSTI2
     C                   MOVE      *ZEROS        WSTAB
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVTAW        BEGSR
     C***********************************************
     C                   MOVE      TEAFNR        WSFNR
     C                   MOVE      TEAFR1        WSFR1
     C                   MOVE      TEATI1        WSTI1
     C                   MOVE      TEAACC        WSACC
     C                   MOVE      TEAFR2        WSFR2
     C                   MOVE      TEATI2        WSTI2
     C                   MOVE      TEATAB        WSTAB
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWTA        BEGSR
     C***********************************************
     C   33              MOVE      WSFNR         TEAFNR
     C   33              MOVE      UIEJ          TEAUNI
     C                   MOVE      WSFR1         TEAFR1
     C                   MOVE      WSTI1         TEATI1
     C                   MOVE      WSACC         TEAACC
     C                   MOVE      WSFR2         TEAFR2
     C                   MOVE      WSTI2         TEATI2
     C                   MOVE      WSTAB         TEATAB
     C*
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODFSK        KLIST
     C                   KFLD                    YFSUNI
     C                   KFLD                    TEAFNR
     C     TELLAK        KLIST
     C                   KFLD                    UIEJ
     C                   KFLD                    WSFNR
     C                   KFLD                    WSTAB
     C     TELLA1        KLIST
     C                   KFLD                    UIEJ
     C                   KFLD                    W2FNR
     C                   KFLD                    WSTAB
     C     TELLA2        KLIST
     C                   KFLD                    TEAUNI
     C                   KFLD                    TEAFNR
     C                   KFLD                    TEATAB
     C     TELLA3        KLIST
     C                   KFLD                    TEAUNI
     C                   KFLD                    YFNR
     C                   KFLD                    YTAB
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIEJ              2
     C                   MOVEL     'A'           UIEJ
     C                   MOVE      WSPROD        UIEJ
     C                   MOVEL     'EGENDEF.'    WSTXT
     C*
     C                   MOVE      'FS'          YFSUNI            2
     C     UIEJ          IFEQ      'AI'
     C                   MOVEL     'INNBOUND'    WSTXT
     C                   MOVE      '   '         WSTXT
     C                   END
     C     UIEJ          IFEQ      'AE'
     C                   MOVEL     'EXPORT  '    WSTXT
     C                   MOVE      '   '         WSTXT
     C                   END
     C     UIEJ          IFEQ      'AJ'
     C                   MOVEL     'JETPACK '    WSTXT
     C                   END
     C*
     C                   ENDSR
     C*
