********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10008 * 01 SH  PTF10 skuff og antall kopier
10008 * 02 SH  PTF10 utskuff
********************************************************************
      *
     FKODTP     UP   E             DISK
     FSYFA28FA  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    UUPLNR
     C                   PARM                    UUPTY
     C                   PARM                    UUPNVN
     C                   PARM                    UUPHEA
     C                   PARM                    UUPFM
     C                   PARM                    UULAS
     C                   PARM                    UULPI             1 0
N01  C                   PARM                    UUDRA2            2
N02  C                   PARM                    UUDRU2            2
N01  C                   PARM                    UUCOP2            2
N01  C                   PARM                    UUFOV1
N01  c                   movel     uudra2        uudra
N02  c                   movel     uudru2        uudru
N01  c                   movel     uucop2        uucop
     C     *LIKE         DEFINE    KOPLNR        UUPLNR
     C     *LIKE         DEFINE    KOPTY         UUPTY
     C     *LIKE         DEFINE    KOPNVN        UUPNVN
     C     *LIKE         DEFINE    KOPHEA        UUPHEA
     C     *LIKE         DEFINE    KOPFM         UUPFM
     C     *LIKE         DEFINE    KOPLAS        UULAS
N01  C     *LIKE         DEFINE    KOPDRAW       UUDRA
N02  C     *LIKE         DEFINE    KOPOUTB       UUDRU
N01  C     *LIKE         DEFINE    KOPCOPI       UUCOP
N01  C     *LIKE         DEFINE    KOPFOV1       UUFOV1
      * vis bilde i første syklus
     C     *IN99         IFEQ      *OFF
     C                   MOVE      *ON           *IN99
     C                   MOVE      0001          WSAVDF
     C                   MOVE      9999          WSAVDT
     C                   EXFMT     CPYWND
     C                   END
     C
     C     KOPLNR        IFEQ      UUPLNR
     C     *IN12         ANDNE     *ON
     C     KOPAVD        ANDGE     WSAVDF
     C     KOPAVD        ANDLE     WSAVDT
     C                   MOVE      UUPTY         KOPTY
     C                   MOVE      UUPNVN        KOPNVN
     C                   MOVE      UUPHEA        KOPHEA
     C                   MOVE      UUPFM         KOPFM
     C                   MOVE      UULAS         KOPLAS
     C                   MOVE      *ZEROS        KOPLPI
     C                   MOVE      UULPI         KOPLPI
N01  C                   move      uudra         kopdraw
N02  C                   move      uudru         KOPOUTB
N01  C                   MOVE      UUCOP         KOPCOPI
N01  C                   MOVE      UUFOV1        KOPFOV1
     C                   UPDATE    KOPR
     C                   END
