     FPRIK      UF   E           K DISK
     FSYFA67FC  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D KN              S              8  0 DIM(10)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVE      '0'           *IN50
     C                   MOVEA     '0000000'     *IN(85)
      *
     C   03              GOTO      SLUTT
      *
      *
     C     WSGEB         IFEQ      *BLANKS
     C                   SETON                                        85
     C                   GOTO      START
     C                   END
      *
     C     PLUMIN        IFNE      '+'
     C     PLUMIN        ANDNE     '-'
     C                   SETON                                        86
     C                   GOTO      START
     C                   END
      *
     C     WSAVTY        IFNE      ' '
     C     WSAVTY        ANDNE     'K'
     C     WSAVTY        ANDNE     'B'
     C                   SETON                                        87
     C                   GOTO      START
     C                   END
      *
     C     WSNYSA        IFEQ      *ZEROS
     C                   SETON                                        88
     C                   GOTO      START
     C                   END
      *
      *
     C     kundfr        ifne      *ZEROS
     C     kundti        orne      *ZEROS
     c     kundti        iflt      kundfr
     C                   SETON                                        89
     C                   GOTO      START
     C                   END
     C                   END
      * ALLE PARM. OK - KJØR ENDRING
     C                   EXSR      ENDRE
     C                   MOVE      *blanks       WSGEB
     C                   MOVE      *zeros        WSNYSA
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ****************************************************
     C     ENDRE         BEGSR
      ****************************************************
     c                   move      'J'           serie             1
     C                   SETON                                        50
     C                   MOVE      *ZEROS        ANTLIN
     c                   move      kundfr        kundfa            8
     c                   move      kundti        kundta            8
     c     kundfr        ifeq      0
     c     kundti        andeq     0
     c                   move      'N'           serie
     c                   end
      *
     C     WSAVTY        IFEQ      ' '
     C     WSAVTY        OREQ      'B'
     C                   MOVE      *BLANKS       PKKNR
     C                   ELSE
     C                   MOVE      '00000001'    PKKNR
     C                   END
     C     PKKNR         SETLL     PRIK
     C                   READ      PRIK                                   35
     C     *IN35         DOWEQ     '0'
     C     WSAVTY        IFEQ      'B'
     C     PKKNR         ANDGT     '    ALLE'
     C                   UPDATE    PRIKR
     C                   GOTO      UTLOOP
     C                   END
      *
     C     PKGEBY        IFEQ      WSGEB
     C     PKAVTT        ANDEQ     'P'
     c     SERIE         IFEQ      'J'
     c     PKKNR         andne     '    ALLE'
     C     pkknr         ifge      kundfa
     c     pkknr         andle     kundta
     c                   goto      neste
     c                   end
     c                   end
     C                   ADD       1             ANTLIN
     C     PLUMIN        IFEQ      '+'
     C                   ADD       WSNYSA        PKBELØ
     C                   ELSE
     C                   SUB       WSNYSA        PKBELØ
     C                   end
     C                   END
     C                   UPDATE    PRIKR
      *
     c     NESTE         TAG
     C                   READ      PRIK                                   35
     C                   END
      *
     C     UTLOOP        ENDSR
