     FSYFAKDFV  CF   E             WORKSTN
     FKOFAST    UF A E           K DISK
      *
      *
     C                   EXSR      INIT
     C                   EXSR      HOVED
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *
      *////////////////////////////////////////////////////////////
     C     INIT          BEGSR
      *////////////////////////////////////////////////////////////
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    UTYP             10
     C                   PARM                    UKOD              5
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEY           KLIST
     C                   KFLD                    UTYP
     C                   KFLD                    UKOD
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
      *
      *////////////////////////////////////////////////////////////
     C     HOVED         BEGSR
      *////////////////////////////////////////////////////////////
     C     KEY           CHAIN(N)  KOFAST                             33
     C                   IF        *IN33
     C                   EVAL      WSTXTN = *BLANKS
     C                   EVAL      WSTXTE = *BLANKS
     C                   ELSE
     C                   EVAL      WSTXTN = KFTXT
     C                   EVAL      WSTXTE = KFTXTE
     C                   END
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVEA     '00'          *IN(98)
     C                   MOVE      '0'           *IN(30)
      *
     C     *IN12         CABEQ     '1'           SLHOV
      *
     C                   IF        WSTXTN = *BLANKS
     C                   MOVE      'JOV0477'     ZMSGNO
     C                   MOVE      '1'           *IN99
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      *
     C                   IF        WSTXTE = *BLANKS
     C                   MOVE      'JOV0477'     ZMSGNO
     C                   MOVE      '1'           *IN99
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      *
     C     KEY           CHAIN     KOFAST                             33
     C                   EVAL      KFTXT  = WSTXTN
     C                   EVAL      KFTXTE = WSTXTE
     C                   IF        *IN33
     C                   EVAL      KFTYP  = UTYP
     C                   EVAL      KFKOD  = UKOD
     C                   WRITE     KOFASTR
     C                   ELSE
     C                   UPDATE    KOFASTR
     C                   END
      *
     C     SLHOV         ENDSR
      *
