      *
     FFAK8      IF   E           K DISK
     FSYFA27FE  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL電                 11     14  0
     D                 DS
     D  UL電                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL電         UL電
     C     FAK8K         KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    WSFAKT
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C   03              GOTO      SLUTT
      *
     C     FAK8K         CHAIN     FAK8                               30
     C  N30WSOPD         COMP      *ZEROS                                 30
     C     *IN30         IFEQ      '1'
     C                   MOVE      'JOV1013'     MSGNR
     C                   GOTO      START
     C                   END
      *
     C                   MOVE      '1'           ANTKOK            1
     C                   MOVE      *BLANKS       XKOHE            28            Ko.over.HEAD
     C                   MOVE      'O'           XTYPE             1
     C     FADATO        IFEQ      0
     C                   MOVE      ULDT          FADATO
     C                   MOVE      ULDT          FADAFF
     C                   END
     C                   MOVE      FADATO        XXDATO            6 0
     C                   MOVE      FADAFF        XXDAFF            6 0
     C                   CALL      'SYFA27B'
     C                   PARM                    FAKUNR
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FAFAKT
     C                   PARM                    FACURI
     C                   PARM                    ANTKOK
     C                   PARM                    XKOHE
     C                   PARM                    XXDATO
     C                   PARM                    XXDAFF
     C                   PARM                    XTYPE
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
