********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 undefilene borte
********************************************************************
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE GEBYRS PRISAVT. (KUNDER)  ***
      ***      SLETTING AV HELE AVTALE                        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-24                            ***
      *** LEDIGE INDIKATORER 27-32 34-99                      ***
      ***********************************************************
      *
s01  F*RTR      UF   E           K DISK
     FPRIK      UF   E           K DISK
s01  F*RGE      UF   E           K DISK
s01  F*RLK      UF   E           K DISK
s01  F*RFS      UF   E           K DISK
s01  F*RTS      UF   E           K DISK
s01  F*RLS      UF   E           K DISK
     C*
     C     PRIKK         KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    YAVTN
     C                   KFLD                    YGEBY
     C                   KFLD                    YAVTT
     C                   KFLD                    YINT
     C                   KFLD                    YLNR
     C     PHELPK        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    PKAVTN
     C                   KFLD                    PKLNR
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSKNR             8 0
     C                   PARM                    WSAVTN            1
     C*
     C                   MOVE      WSKNR         YKNR              8
     C                   MOVE      WSAVTN        YAVTN             1
     C                   MOVE      '   '         YGEBY             3
     C                   MOVE      ' '           YAVTT             1
     C                   MOVE      *ZEROS        YINT              5 0
     C                   MOVE      *ZEROS        YLNR              4 0
     C*
     C     PRIKK         SETLL     PRIK
     C                   SETOFF                                       33
     C     STAKP         TAG
     C     YKNR          READE     PRIK                                   33
     C  N33WSAVTN        COMP      PKAVTN                             3333
     C  N33              DO
     C                   DELETE    PRIKR
s01  C*    PHELPK        CHAIN     PRGE                               32
s01  C* N32              DELETE    PRGER
s01  C*    PHELPK        CHAIN     PRLK                               32
s01  C* N32              DELETE    PRLKR
s01  C*    PHELPK        CHAIN     PRFS                               32
s01  C* N32              DELETE    PRFSR
s01  C*    PHELPK        CHAIN     PRTS                               32
s01  C* N32              DELETE    PRTSIR
s01  C*    PHELPK        CHAIN     PRLS                               32
s01  C* N32              DELETE    PRLSR
s01  C*    PHELPK        CHAIN     PRTR                               32
s01  C* N32              DELETE    PRTRR
     C                   GOTO      STAKP
     C                   END
     C*
     C                   RETURN
     C*
