     FPRIK2     UF A E           K DISK
     C                   MOVE      '588'         OILGEB            3            OLJETILLEGG
     C                   MOVE      'CAF'         VALGEB            3            VALUTATILLEG
      *
     C     KEY           KLIST
     C                   KFLD                    GMKNR
     C                   KFLD                    GMAVTN
     C                   KFLD                    GMLNR
     C     *LIKE         DEFINE    PKKNR         GMKNR
     C     *LIKE         DEFINE    PKAVTN        GMAVTN
     C     *LIKE         DEFINE    PKLNR         GMLNR
      *
     C     '00000001'    SETLL     PRIK2
     C                   READ      PRIK2                                  33
     C     *IN33         DOWEQ     '0'
     C     PKAVTT        IFEQ      'T'
     C     PKAVTT        OREQ      'P'
     C     PKAVTT        OREQ      'B'
     C     PKGEBY        IFEQ      VALGEB
     C                   EXSR      ADDGEB
     C                   END
     C                   END
     C                   READ      PRIK2                                  33
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      ***************************************
     C     ADDGEB        BEGSR
      ***************************************
      * FINN HØYESTE LNR PÅ DENNE AVTALE, LEGG TIL 1
     C                   MOVE      PKKNR         GMKNR
     C                   MOVE      PKAVTN        GMAVTN
     C                   Z-ADD     9999          GMLNR
     C     KEY           SETLL     PRIK2
     C                   READP     PRIK2                                  34
     C     PKLNR         ADD       1             GMLNR
      * XXXXXXXXXXXXXXXXX
     C                   CLEAR                   PRIKR
     C                   MOVE      GMKNR         PKKNR
     C                   MOVE      GMAVTN        PKAVTN
     C                   MOVE      GMLNR         PKLNR
     C                   MOVE      'P'           PKAVTT
     C                   MOVE      *ZEROS        PKINT
     C                   MOVE      '1'           PKTNR
     C                   MOVE      'N'           PKMVA
     C                   MOVE      'NOK'         PKFVAL
     C                   MOVE      'I'           PKURIO
     C                   MOVE      'H'           PKUR01
      *
      * SÅ VALUTATILLEGG FOR GB
     C                   MOVE      VALGEB        PKGEBY
     C                   Z-ADD     2.0           PKBELØ
     C                   MOVE      'I'           PKLKIO
     C                   MOVE      'GB'          PKLK01
     C                   WRITE     PRIKR
      *
      *
      *
      * SETT KEY FORBI DENNE KUNDE/AVTNR
     C                   Z-ADD     9999          GMLNR
     C     KEY           SETLL     PRIK2
      *
     C                   ENDSR
      *
