********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 undefilene borte
********************************************************************
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE GEBYRS PRISAVT. (KUNDER)  ***
      ***      KOPIERING AV AVTALE                            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-24                            ***
      *** LEDIGE INDIKATORER 27-31 34-99                      ***
      ***********************************************************
      *
s01  F*RTR      UF A E           K DISK
     FPRIK      UF A E           K DISK
s01  F*RGE      UF A E           K DISK
s01  F*RLK      UF A E           K DISK
s01  F*RFS      UF A E           K DISK
s01  F*RTS      UF A E           K DISK
s01  F*RLS      UF A E           K DISK
     C*
     C     PRIKK         KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    YAVTN
     C     PHELPK        KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    YAVTN
     C                   KFLD                    PKLNR
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSKNR             8 0
     C                   PARM                    WSAVTN            1
     C                   PARM                    WSKNRK            8 0
     C                   PARM                    WSAVTK            1
     C*
     C                   MOVE      WSKNRK        YKNR              8
     C                   MOVE      WSAVTK        YAVTN             1
     C*
     C     PRIKK         SETLL     PRIK
     C                   SETOFF                                       33
     C     STAKP         TAG
     C     PRIKK         READE(N)  PRIK                                   33
     C  N33              DO
     C                   MOVE      WSKNR         PKKNR
     C                   MOVE      WSAVTN        PKAVTN
     C                   WRITE     PRIKR
s01  C*    PHELPK        CHAIN(N)  PRGE                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         APKKNR
s01  C*                  MOVE      WSAVTN        APKAVT
s01  C*                  WRITE     PRGER
s01  C*                  END
s01  C*    PHELPK        CHAIN(N)  PRLK                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         BPKKNR
s01  C*                  MOVE      WSAVTN        BPKAVT
s01  C*                  WRITE     PRLKR
s01  C*                  END
s01  C*    PHELPK        CHAIN(N)  PRTR                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         TRKKNR
s01  C*                  MOVE      WSAVTN        TRKAVT
s01  C*                  WRITE     PRTRR
s01  C*                  END
s01  C*    PHELPK        CHAIN(N)  PRFS                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         CPKKNR
s01  C*                  MOVE      WSAVTN        CPKAVT
s01  C*                  WRITE     PRFSR
s01  C*                  END
s01  C*    PHELPK        CHAIN(N)  PRTS                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         DPKKNR
s01  C*                  MOVE      WSAVTN        DPKAVT
s01  C*                  WRITE     PRTSIR
s01  C*                  END
s01  C*    PHELPK        CHAIN(N)  PRLS                               32
s01  C* N32              DO
s01  C*                  MOVE      WSKNR         EPKKNR
s01  C*                  MOVE      WSAVTN        EPKAVT
s01  C*                  WRITE     PRLSR
s01  C*                  END
     C                   GOTO      STAKP
     C                   END
     C*
     C                   RETURN
     C*
