********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12XXX * 01 SH  PTF12 uniks nummer mangler
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE SAKSBEHANDLER(SIGNATUR)   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
N01  FTELLGE    UF A E           K DISK
     FKODTSF    UF A E           K DISK
     FSYPARL3   UF A E           K DISK
     FSYFA60FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KOSFNV                 1     16
     D  KOSFN7                 1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2SFSI        YSFSI             3
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSF1        SETLL     KODTSF
     C     START1        TAG
     C                   READ      KODTSF                                 94
     C  N94              UPDATE    KOSFR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     c                   move      *blanks       SYUSER
     c                   movel     KOSFSI        SYVRDA
     C     UsrKey        Chain     SYPARL3                            33
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      KODTSF                                 94
     C  N94              UPDATE    KOSFR
     C  N94              MOVE      KOSFSI        YSFSI
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     17            POSNBR
     C                   MOVE      *BLANKS       WSSFSI
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODSF3        SETLL     KODTSF
     C  N94              READ      KODTSF                                 94
     C  N94              UPDATE    KOSFR
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     5             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSSFSI        COMP      *BLANKS                                90
     C   90              MOVE      'SPS0024'     MSGNR
     C  N90KODSFK        CHAIN     KODTSF                             33
     C  N90
     CANN33              DO
     C                   UPDATE    KOSFR
     C                   SETON                                        90
     C                   MOVE      'SPS0025'     MSGNR
     C                   END
     C   90              Z-ADD     17            POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C     WSSFNV        COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'SPN0010'     MSGNR
     C   89
     CANN30              Z-ADD     39            POSNBR
     C   89              SETON                                        30
     C*
     C   30              GOTO      SLTB
     C*
      * Hvis WSUser er fylt ut sjekk/skriv til SYPARF
     c                   exsr      TstUsr
     C     *IN14         IFEQ      '1'
     C     WSUSER        ifeq      *BLANKS
     C                   MOVE      'JOV1486'     MSGNR
     c                   seton                                        3088
     C                   GOTO      SLTB
     C                   else
     C                   CALL      'SYPR03R'
     C                   PARM                    UKUNDA            8
     C                   PARM                    UAVDA             4
     C                   PARM      WSUSER        XXSER            10
     C                   PARM                    XXLAGG            1
     C                   end
     C                   END
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSFK        CHAIN     KODTSF                             33
     C                   EXSR      MOVWSF
     C  N33              UPDATE    KOSFR
     C   33              WRITE     KOSFR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR

     C***********************************************
     C     TstUsr        BEGSR
     C***********************************************
     C*
     c                   movel     WSSFSI        SYVRDA
     C     UsrKey        Chain     SYPARL3                            33
     c     WsUser        ifeq      *blanks
     c  N33              delete    syparfr
     c                   else
     c                   movel     WSUSER        SYUSER
N01  C     *in33         ifeq      '1'
N01  C     'SYPAR   '    CHAIN     TELLGE                             34
N01  C                   MOVE      GENO          SYRECN
N01  C                   ADD       1             GENO
N01  C                   UPDATE    TELLGER
N01  C                   END
     c   33              write     syparfr
     c  N33              update    syparfr
     c                   end
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C   70WSNR          IFEQ      '1'                                          ENDRE
     c                   move      kosfsi        usign
     c                   seton                                        lr
     c                   return
     c                   end
      *
     C  N70WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     KOSFN7        COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSF
     C   12              GOTO      SLHENT
     C                   END
     C  n70WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     KOSFN7        COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSF
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     5             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSF         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      KOSFSI        WSSFSI
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSFK        CHAIN     KODTSF                             33
     C  N33              DELETE    KOSFR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSF         BEGSR
     C***********************************************
     C                   EXSR      MOVSFW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C                   SETOFF                                       88
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       SYUSER
     C                   MOVE      *BLANKS       KOSFSI
     C                   MOVE      *BLANKS       KOSFNV
     C                   MOVEL     '*DELETE'     KOSFN7
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSSFSI
     C                   MOVE      *BLANKS       WSSFNV
     C                   MOVE      *BLANKS       WSUSER
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSFW        BEGSR
     C***********************************************
     C                   MOVE      KOSFSI        WSSFSI
     C                   MOVE      KOSFNV        WSSFNV
     C                   MOVE      SYUSER        WSUSER
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     39            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSF        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      YSFUNI        KOSFUN
     C                   MOVE      WSSFSI        KOSFSI
     C                   END
     C*
     C                   MOVE      WSSFNV        KOSFNV
     C                   MOVE      WSUSER        SYUSER
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *entry        plist
     C                   parm                    ustat             1
     c                   parm                    usign             3
     c     ustat         comp      'P'                                    70
     C     KODSFK        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    WSSFSI
     C     KODSF1        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    W2SFSI
     C     KODSF2        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    KOSFSI
     C     KODSF3        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    YSFSI
     C*
     C                   MOVE      'SF'          YSFUNI            2
     C*
     C     USRKEY        KLIST
     C                   KFLD                    SYPAID
     C                   KFLD                    SYVRDA
     C                   move      'USRID'       SYPAID
     C*
     C                   ENDSR
     C*
