     C                   MOVE      'SY'          UFIRM             2
     C                   MOVE      'HE'          VMLAYO            2
     C                   MOVE      0001          DFAVD             4 0
     C                   MOVE      53786         DFOPD             7 0
     C                   MOVE      0             DFFBNR            3 0
     C                   MOVE      ' '           UUKOPI            1
     C                   CALL      'SYFA12SN'
     C                   PARM                    UFIRM             2
     C                   PARM                    VMLAYO            2
     C                   PARM                    DFAVD             4 0
     C                   PARM                    DFOPD             7 0
     C                   PARM                    DFFBNR            3 0
     C                   PARM                    UUKOPI            1
     c                   seton                                        LR
     c                   return
