      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE NUMMERSERIE TIL POST DANMARK *
      ************************************************************
      *
     FDKPOSTF   UF A E           K DISK
     FFIRM      IF   E           K DISK
     FSYFA33D   CF   E             WORKSTN
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C     FIFIRM        CHAIN(N)  DKPOSTF                            33
     C                   IF        *IN33 = *OFF
     C                   MOVE      DKPNNR        WSPNNR
     C                   MOVE      DKPMNR        WSPMNR
     C                   MOVE      DKPNSN        WSPNSN
     C                   MOVE      DKPNSM        WSPNSM
     C                   END
      *
     C                   WRITE     WINDOWSZ
      *
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   MOVEA     '00'          *IN(98)
     C                   MOVE      '0'           *IN30
     C   03              GOTO      SLUTT
      *
     C     WSPNNR        COMP      0                                    9999
     C  N99WSPNNR        COMP      WSPMNR                             99
     C                   IF        *IN99
     C                   MOVE      'YBC1925'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END
      *
     C                   IF        WSPNSN <> 0
     C     WSPNSN        COMP      0                                    9898
     C  N98WSPNSN        COMP      WSPNSM                             98
     C                   IF        *IN98
     C                   MOVE      'YBC1926'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END
     C                   END
      *
     C     FIFIRM        CHAIN     DKPOSTF                            33
     C                   MOVE      WSPNNR        DKPNNR
     C                   MOVE      WSPMNR        DKPMNR
     C                   MOVE      WSPNSN        DKPNSN
     C                   MOVE      WSPNSM        DKPNSM
     C                   IF        *IN33
     C                   MOVE      FIFIRM        DKPFIR
     C                   WRITE     DKPOSTFR
     C                   ELSE
     C                   UPDATE    DKPOSTFR
     C                   END
      *
     C     SLUTT         TAG
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
