      *
      ***********************************************************
      *** PROGRAM SKAL SØKE LOGG AV UTLEVERINGS FORBEHOLD
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 02 04 07-11 13-24
      *** LEDIGE INDIKATORER 31 32 34-90 95-97 99
      ***********************************************************
      *
     FUTLLOGF   IF   E           K DISK
     FSYFA19D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  ULUSR                  1     10
     D  ULUSR8                 1      8
     D                 DS
     D  ULTID                  1      6  0
     D  ULTID4                 1      4  0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     UTLLK         SETLL     UTLLOGF
     C     START1        TAG
     C     UTLLK         READE     UTLLOGF                                94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        9999
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     UTLLK         READE     UTLLOGF                                94
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     ZRECNO        IFGT      0
     C                   Z-ADD     1             ZRECNO
     C                   END
     C                   Z-ADD     1             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     UTLLK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
