      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE FRITEKSTER                ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 29 31 32 34-39 41-88 95-97       ***
      ***********************************************************
      *
     FKODTFT    UF A E           K DISK
     FFIRM      IF   E           K DISK
     FSYFA25FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XDLT                   1      7
     D  KFTFTX                 1     51
     D                 DS
     D  XF1FTX                 1     51
     D  WF1FT1                 1     37
     D  WF1FT2                38     51
     D                 DS
     D  XF2FTX                 1     51
     D  WF2FT1                 1     37
     D  WF2FT2                38     51
     D                 DS
     D  XF3FTX                 1     51
     D  WF3FT1                 1     37
     D  WF3FT2                38     51
     D                 DS
     D  XF4FTX                 1     51
     D  WF4FT1                 1     37
     D  WF4FT2                38     51
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2TYP         YTYP              2
     C                   Z-ADD     1             YLN
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODFT1        SETLL     KODTFT
     C     START1        TAG
     C                   READ      KODTFT                                 94
     C  N94              UPDATE    KODTFTR
     C  N94              MOVE      KFTTYP        YTYP
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     ST21          TAG
     C                   READ      KODTFT                                 94
     C  N94              UPDATE    KODTFTR
     C  N94KFTTYP        IFEQ      YTYP
     C                   GOTO      ST21
     C                   ELSE
     C                   MOVE      KFTTYP        YTYP
     C                   END
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       989930
     C*
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   MOVE      *BLANKS       WFTTYP
     C                   GOTO      START5
     C                   END
     C*** SØK
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   Z-ADD     1             YLN
     C  N94KODFT3        SETLL     KODTFT
     C  N94              READ      KODTFT                                 94
     C  N94              UPDATE    KODTFTR
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   27WSNR          IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       308990
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C  N12              EXSR      OPDFT
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK
     C     START6        TAG
     C                   EXFMT     SØKFT
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WFTTYP        COMP      *BLANKS                                90
     C   90              MOVE      'SPF0015'     MSGNR
     C  N90              DO
     C                   Z-ADD     1             YLN               1 0
     C                   SETOFF                                       33
     C     KODFTK        SETLL     KODTFT
     C     WFTTYP        READE     KODTFT                                 33
     C  N33              DO
     C                   UPDATE    KODTFTR
     C                   SETON                                        90
     C                   MOVE      'SPF0016'     MSGNR
     C                   END
     C                   END
     C   90              Z-ADD     8             LINNBR
     C   90              Z-ADD     21            POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C   28              MOVE      XF1FTX        WF1FTX
     C   28              MOVE      XF2FTX        WF2FTX
     C   28              MOVE      XF3FTX        WF3FTX
     C   28              MOVE      XF4FTX        WF4FTX
     C*
     C     WF1FTX        COMP      *BLANKS                                89
     C   89WF2FTX        COMP      *BLANKS                                89
     C   89WF3FTX        COMP      *BLANKS                                89
     C   89WF4FTX        COMP      *BLANKS                                89
     C   89
     CANN30              DO
     C                   MOVE      'SPF0017'     MSGNR
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   END
     C   90              SETON                                        30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDFT         BEGSR
     C***********************************************
     C                   Z-ADD     1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C     WF1FTX        IFEQ      *BLANKS
     C  N33              DELETE    KODTFTR
     C                   ELSE
     C                   MOVE      WFTTYP        KFTTYP
     C                   Z-ADD     YLN           KFTLN
     C                   MOVE      WF1SK         KFTSK
     C                   MOVE      WF1FTX        KFTFTX
     C   33              WRITE     KODTFTR
     C  N33              UPDATE    KODTFTR
     C                   END
     C*
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C     WF2FTX        IFEQ      *BLANKS
     C  N33              DELETE    KODTFTR
     C                   ELSE
     C                   MOVE      WFTTYP        KFTTYP
     C                   Z-ADD     YLN           KFTLN
     C                   MOVE      WF2SK         KFTSK
     C                   MOVE      WF2FTX        KFTFTX
     C   33              WRITE     KODTFTR
     C  N33              UPDATE    KODTFTR
     C                   END
     C*
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C     WF3FTX        IFEQ      *BLANKS
     C  N33              DELETE    KODTFTR
     C                   ELSE
     C                   MOVE      WFTTYP        KFTTYP
     C                   Z-ADD     YLN           KFTLN
     C                   MOVE      WF3SK         KFTSK
     C                   MOVE      WF3FTX        KFTFTX
     C   33              WRITE     KODTFTR
     C  N33              UPDATE    KODTFTR
     C                   END
     C*
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C     WF4FTX        IFEQ      *BLANKS
     C  N33              DELETE    KODTFTR
     C                   ELSE
     C                   MOVE      WFTTYP        KFTTYP
     C                   Z-ADD     YLN           KFTLN
     C                   MOVE      WF4SK         KFTSK
     C                   MOVE      WF4FTX        KFTFTX
     C   33              WRITE     KODTFTR
     C  N33              UPDATE    KODTFTR
     C                   END
     C*
     C     WF1FTX        IFNE      *BLANKS
     C                   MOVE      WF1FTX        KFTFTX
     C                   MOVE      WF1SK         KFTSK
     C                   ELSE
     C     WF2FTX        IFNE      *BLANKS
     C                   MOVE      WF2FTX        KFTFTX
     C                   MOVE      WF2SK         KFTSK
     C                   ELSE
     C     WF3FTX        IFNE      *BLANKS
     C                   MOVE      WF3FTX        KFTFTX
     C                   MOVE      WF3SK         KFTSK
     C                   ELSE
     C                   MOVE      WF4FTX        KFTFTX
     C                   MOVE      WF4SK         KFTSK
     C                   END
     C                   END
     C                   END
     C*
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   EXSR      MOVB2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C   98              MOVE      'DIV0012'     MSGNR
     C   98              SETON                                            30
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C   27WSNR          IFEQ      '1'
     C                   MOVE      KFTTYP        UKD
     C                   GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '2'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              MOVE      'SPF0018'     MSGNR
     C   98              SETON                                            30
     C   98              GOTO      SLHENT
     C                   EXSR      CHGFT
     C   12              GOTO      SLHENT
     C                   END
     C  N27WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              MOVE      'SPF0018'     MSGNR
     C   98              SETON                                            30
     C   98              GOTO      SLHENT
     C                   EXSR      DLTFT
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTFT         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      KFTTYP        WFTTYP
     C                   Z-ADD     1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTSK         KF1SK
     C  N33              MOVE      KFTFTX        KF1FTX
     C   33              MOVE      *BLANKS       KF1SK
     C   33              MOVE      *BLANKS       KF1FTX
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTSK         KF2SK
     C  N33              MOVE      KFTFTX        KF2FTX
     C   33              MOVE      *BLANKS       KF2SK
     C   33              MOVE      *BLANKS       KF2FTX
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTSK         KF3SK
     C  N33              MOVE      KFTFTX        KF3FTX
     C   33              MOVE      *BLANKS       KF3SK
     C   33              MOVE      *BLANKS       KF3FTX
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTSK         KF4SK
     C  N33              MOVE      KFTFTX        KF4FTX
     C   33              MOVE      *BLANKS       KF4SK
     C   33              MOVE      *BLANKS       KF4FTX
     C*
     C                   EXFMT     BILDE02
     C  N12              DO
     C                   Z-ADD     1             YLN
     C                   SETOFF                                       33
     C     KODFTK        SETLL     KODTFT
     C     STDLT         TAG
     C     WFTTYP        READE     KODTFT                                 33
     C  N33              DELETE    KODTFTR
     C  N33              GOTO      STDLT
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGFT         BEGSR
     C***********************************************
     C                   EXSR      MOVFTW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       308990
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C  N12              EXSR      OPDFT
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVFTW        BEGSR
     C***********************************************
     C                   MOVE      KFTTYP        WFTTYP
     C                   Z-ADD     1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTSK         WF1SK
     C  N33              MOVE      KFTFTX        WF1FTX
     C   33              MOVE      *BLANKS       WF1SK
     C   33              MOVE      *BLANKS       WF1FTX
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTFTX        WF2FTX
     C  N33              MOVE      KFTSK         WF2SK
     C   33              MOVE      *BLANKS       WF2FTX
     C   33              MOVE      *BLANKS       WF2SK
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTFTX        WF3FTX
     C  N33              MOVE      KFTSK         WF3SK
     C   33              MOVE      *BLANKS       WF3FTX
     C   33              MOVE      *BLANKS       WF3SK
     C                   ADD       1             YLN
     C     KODFTK        CHAIN     KODTFT                             33
     C  N33              UPDATE    KODTFTR
     C  N33              MOVE      KFTFTX        WF4FTX
     C  N33              MOVE      KFTSK         WF4SK
     C   33              MOVE      *BLANKS       WF4FTX
     C   33              MOVE      *BLANKS       WF4SK
     C*
     C   28              MOVE      WF1FTX        XF1FTX
     C   28              MOVE      WF2FTX        XF2FTX
     C   28              MOVE      WF3FTX        XF3FTX
     C   28              MOVE      WF4FTX        XF4FTX
     C                   SETON                                        40
     C                   Z-ADD     10            LINNBR
     C                   Z-ADD     21            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       KFTTYP
     C                   MOVE      *BLANKS       KFTSK
     C                   MOVE      *BLANKS       KFTFTX
     C                   MOVE      '*DELETE'     XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WFTTYP
     C                   MOVE      *BLANKS       WF1SK
     C                   MOVE      *BLANKS       WF1FTX
     C                   MOVE      *BLANKS       XF1FTX
     C                   MOVE      *BLANKS       WF2SK
     C                   MOVE      *BLANKS       WF2FTX
     C                   MOVE      *BLANKS       XF2FTX
     C                   MOVE      *BLANKS       WF3SK
     C                   MOVE      *BLANKS       WF3FTX
     C                   MOVE      *BLANKS       XF3FTX
     C                   MOVE      *BLANKS       WF4SK
     C                   MOVE      *BLANKS       WF4FTX
     C                   MOVE      *BLANKS       XF4FTX
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODFTK        KLIST
     C                   KFLD                    WFTTYP
     C                   KFLD                    YLN
     C     KODFT1        KLIST
     C                   KFLD                    W2TYP
     C                   KFLD                    YLN
     C     KODFT3        KLIST
     C                   KFLD                    YTYP
     C                   KFLD                    YLN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    UKD               2
     C* UFLAGG = 0 ---> CALL FRA VEDLIKEHOLD
     C* UFLAGG = 1 ---> CALL SØKING FRA ET SYSPED-LAND/FLY PROGRAM
     C* UFLAGG = 3 ---> CALL SØKING FRA ET SYSPED-SHIP PROGRAM
     C     UFLAGG        COMP      1                                      27
     C  N27UFLAGG        COMP      3                                      27
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   28
     C     FIURBI        COMP      'J'                                    28
     C  N28FIURBE        COMP      'J'                                    28
     C  N28FIURBL        COMP      'J'                                    28
     C*
     C   27              WRITE     NYWRK
     C   27              EXFMT     SØKFT
     C*
     C                   ENDSR
     C*
