      *
      ****************************************************************
      *** PROGRAM SKAL SPØRRE PÅ FRAKTAVTALER/KUNDER               ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER         ***
      *** LEDIGE INDIKATORER 01 02 06-11 13-24                     ***
      *** LEDIGE INDIKATORER 27-29 31-90 95-98                     ***
      ****************************************************************
      *
     FCUNDL01   IF   E           K DISK
     FFRATN     IF   E           K DISK
     FSYFA49FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  BFT1                   1      3P 0
     D  BFT2                   4      6P 0
     D  BFT3                   7      9P 0
     D  BFT4                  10     12P 0
     D  BFT5                  13     15P 0
     D  BFT6                  16     18P 0
     D  BFT7                  19     21P 0
     D  BFT8                  22     24P 0
     D  BFT9                  25     27P 0
     D  BFT10                 28     30P 0
     D  BFT11                 31     33P 0
     D  BFT12                 34     36P 0
     D  FB01                   1      3P 0
     D  FB02                   4      6P 0
     D  FB03                   7      9P 0
     D  FB04                  10     12P 0
     D  FB05                  13     15P 0
     D  FB06                  16     18P 0
     D  FB07                  19     21P 0
     D  FB08                  22     24P 0
     D  FB09                  25     27P 0
     D  FB10                  28     30P 0
     D  FB11                  31     33P 0
     D  FB12                  34     36P 0
     D                UDS
     D  UFIRM                  1      2
     C*
     C                   EXSR      INIT
     C*
     C     ST1           TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       3099
     C   03              GOTO      SLUTT
     C   04              EXSR      SØKKUN
     C     KUND1K        CHAIN     CUNDL01                            99
     C   99              MOVE      'SPK0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      ST1
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     FRATK         SETLL     FRATN
     C     START1        TAG
     C     WSKN          READE     FRATN                                  94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        8
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     WSKN          READE     FRATN                                  94
     C  N94              END
     C                   END
     C*
     C                   MOVE      ZRECNO        XRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   WRITE     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   END
     C     START4        TAG
     C                   EXFMT     BUNN
     C*
     C   12              Z-ADD     0             WSKN
     C   12              GOTO      ST1
     C   03              GOTO      SLUTT
     C   05              GOTO      START
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     XRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C                   GOTO      START4
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     SØKKUN        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKN
     C                   PARM                    UFIRM
     C                   PARM                    USØKKN           30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     FRATK         KLIST
     C                   KFLD                    WSKN
     C                   KFLD                    YFRAN
     C                   KFLD                    YOPDT
     C                   KFLD                    YSK
     C                   KFLD                    YFRA
     C                   KFLD                    YTIL
     C                   KFLD                    YAVTN
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKN
     C*
     C                   MOVE      '   '         YFRAN             3
     C                   MOVE      '  '          YOPDT             2
     C                   MOVE      ' '           YSK               1
     C                   MOVE      '     '       YFRA              5
     C                   MOVE      '     '       YTIL              5
     C                   Z-ADD     0             YAVTN             1 0
     C                   MOVE      *ZEROS        BFT1
     C                   MOVE      *ZEROS        BFT2
     C                   MOVE      *ZEROS        BFT3
     C                   MOVE      *ZEROS        BFT4
     C                   MOVE      *ZEROS        BFT5
     C                   MOVE      *ZEROS        BFT6
     C                   MOVE      *ZEROS        BFT7
     C                   MOVE      *ZEROS        BFT8
     C                   MOVE      *ZEROS        BFT9
     C                   MOVE      *ZEROS        BFT10
     C                   MOVE      *ZEROS        BFT11
     C                   MOVE      *ZEROS        BFT12
     C                   EXSR      HMSG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HMSG          BEGSR
     C***********************************************
     C                   MOVE      'DIV0745'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     4             XMSGL             4 0          LENGDE PÅ MELDING
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    TXT1
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C                   MOVE      'DIV0746'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     4             XMSGL
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    TXT2
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C                   MOVE      'DIV0747'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     5             XMSGL
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    TXT3
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
