********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 NULLSITLLER NYE FELTER PGA. OPPDRAGSNR
********************************************************************
     FFIRM      IF   E           K DISK
     FKODTA     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTH     IF   E           K DISK
     FTELL      IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FKODTSI    IF   E           K DISK
     FSYFA00FM  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                UDS
     D  FIFIRM                 1      2
     D  KOVFIR                 3      4
     D  KOVPRO                13     13
     D  UDVAVD                15     18
     D  WSSFSI                19     21
     D  UNULL1                22     35
     D  UNULL2                64     69
N01  D  UBLA1                 81     81
N01  D  UNULL3                82     88
     D* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     D* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
E01  D  XBLA1                 92    256
     D  XBLA2                257    508
     D  FILFB                509    509
     D  FILTB                510    510
      *
     C     KODSFK        KLIST
     C                   KFLD                    WSSFUN
     C                   KFLD                    WSSFSI
     C     KODSIK        KLIST
     C                   KFLD                    WSSIUN
     C                   KFLD                    WSSFSI
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSVAVD
     C     KODTAK        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    WSVAVD
     C                   MOVE      'A'           WSAUNI            1
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    WSVAVD
     C                   MOVE      'W'           WSWUNI            1
     C     KODTHK        KLIST
     C                   KFLD                    WSHUNI
     C                   KFLD                    WSVAVD
     C                   MOVE      'H'           WSHUNI            1
     C                   MOVE      *ZEROS        ZERAVD            4 0
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   MOVE      '0'           UIN01
     C*
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'SI'          WSSIUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   TESTN                   UDVAVD               88
     C   88              MOVE      UDVAVD        WSVAVD
     C  N88              MOVE      *ZEROS        WSVAVD
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C                   MOVE      *ZEROS        UNULL1
     C                   MOVE      *ZEROS        UNULL2
N01  C                   MOVE      *BLANKS       UBLA1
N01  C                   MOVE      *ZEROS        UNULL3
     C                   MOVE      *BLANKS       XBLA1
     C                   MOVE      *BLANKS       XBLA2
      *HENT FIRMARECORD
     C                   READ      FIRM                                   98
     C                   MOVE      'N'           KUNSAD            1
     C     FIURLI        IFEQ      'N'
     C     FIURLE        ANDEQ     'N'
     C     FIURFI        ANDEQ     'N'
     C     FIURFE        ANDEQ     'N'
     C     FIURFL        ANDEQ     'N'
     C     FIURBI        ANDEQ     'N'
     C     FIURBE        ANDEQ     'N'
     C     FITRAN        ANDEQ     'N'
     C     FIURSI        ANDEQ     'J'
     C     FIURSE        ANDEQ     'J'
     C                   MOVE      'J'           KUNSAD            1
     C                   END
     C                   GOTO      START2
     C*
     C     START         TAG
     C                   ADD       1             ANTTES            2 0
     C     ANTTES        IFEQ      1
     C                   SETOFF                                       309899
     C                   END
     C     XWIN          IFEQ      ' '
     C                   MOVE      'J'           XWIN              1
     C                   WRITE     WINDOWSZ
     C                   END
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309899
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C   04              DO
     c     linnbr        ifeq      9
     C                   CALL      'SYFA14B'
     C                   PARM                    WSVAVD
     c                   z-add     10            linnbr
     c                   else
     c                   move      'P'           plukk             1
     C                   CALL      'SYFA60'
     C                   PARM                    plukk
     c                   parm                    wssfsi
     c                   end
     C                   END
     C     START2        TAG
     C     WSVAVD        IFEQ      0
     C                   GOTO      START
     C                   END
      *AVDELING
     C     KUNSAD        IFEQ      'J'
     C     KODTAK        CHAIN     KODTA                              99
     C                   ELSE
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTAK        CHAIN     KODTA                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C  N99KODTHK        CHAIN     KODTH                              99
     C     *IN99         IFEQ      '0'
     C     WSVAVD        CHAIN     TELL                               99
     C   99ZERAVD        CHAIN     TELL                               99
     C                   END
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C                   END
      * SIGNATUR
     C     KODSFK        CHAIN     KODTSF                             98
     C   98KODSIK        CHAIN     KODTSI                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C                   MOVE      WSVAVD        UDVAVD
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
