     FFAK8      IF   E           K DISK
     c     *entry        plist
     C                   PARM                    UKUNR             8
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
     C                   PARM                    UFAKT             7
     C                   PARM                    FACURI            3
     C                   PARM                    ANTKOK            1
     C                   PARM                    XKOHE            28
     C                   PARM                    UDAT              6
     C                   PARM                    UDATF             6
     C                   PARM                    XTYPE             1
      *
     c                   move      uavd          faavd
     c                   move      uopd          faopd
     c                   move      ufakt         fafakt
     c                   move      ukunr         fakunr
     C     FAK8K         KLIST
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C                   KFLD                    FAFAKT
     C                   KFLD                    FAKUNR
      *
     c     fak8k         chain     fak8
      *
      * dummy
      *
     c**                 setoff                                       99
     c** 99              read      fak8                                   33
      *
     C                   MOVE      UKUNR         FAKUNR            8 0
     C                   MOVE      UAVD          FAAVD             4 0
     C                   MOVE      UOPD          FAOPD             7 0
     C                   MOVE      ufakt         YYFAKT            7 0
     C                   MOVE      UDAT          XXDATO            6 0
     C                   MOVE      UDATF         XXDAFF            6 0
     C                   CALL      'SYFA27B'
     C                   PARM                    FAKUNR
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    YYFAKT
     C                   PARM                    FACURI
     C                   PARM                    ANTKOK
     C                   PARM                    XKOHE
     C                   PARM                    XXDATO
     C                   PARM                    XXDAFF
     C                   PARM                    XTYPE
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
