      *
      **************************************************************
      * PROGRAMMET KJØRES VED OPPGRADERING TIL NY VERSJON          *
      * OG LEGGER TIL ALLE NYE DEFINISJONER SAMT STANDARDKODER     *
      * FRA SYSPEDS NYE KUFAST (SYFASF/KUFAST) TIL KUNDENS         *
      * REGISTER FOR EGENDEFINERTBARE RENE KODETEKSTER (../KUFAST) *
      **************************************************************
      *
     FKUFASTNY  IP   E             DISK
     F                                     RENAME(KOFASTR:KOFANYR)
     FKUFAST    UF A E           K DISK
      *
     C     KUFASK        KLIST
     C                   KFLD                    KFTYP
     C                   KFLD                    KFKOD
      *
     C     KFKOD         IFEQ      ' DEFN'
     C     KFKOD         OREQ      '     '
      *
      * I VERSJ.4 SKAL FØLGENDE TYPER "INITIERES" OGÅ MED DETALJKODER
     C     KFTYP         OREQ      'STTYPE  '
     C     KFTYP         OREQ      'PRODTYPE'
     C     KFTYP         OREQ      'GRITYPE '
     C     KFTYP         OREQ      'GRKTYPE '
     C     KFTYP         OREQ      'BILAVGGR'
     C     KFTYP         OREQ      'BILKLAUS'
      *
     C     KUFASK        CHAIN     KUFAST                             33
     C     *IN33         IFEQ      '1'
     C                   WRITE     KOFASTR
     C                   END
     C                   END
