     FFAK3      UF   E           K DISK
     FHEADF     UF   E           K DISK
     D                 DS
     D  FAAVD                  1      4  0
     D  FAOPD                  5     11  0
     D  FAAVOP                 1     11  0
     C*--------------------------------------------------------------
     C* DEFINERER NØKKEL TIL FAKTURAREGISTER: FAK3
     C*--------------------------------------------------------------
     C     *LIKE         DEFINE    FAOPKO        XXOPKO
     C     *LIKE         DEFINE    FAFAKT        XXFAKT
     C     *LIKE         DEFINE    FAKUNR        XXKUNR
     C     *LIKE         DEFINE    FAAVD         XXAVD
     C     *LIKE         DEFINE    FAOPD         XXOPD
     C*
     C     KEYFA3        KLIST
     C                   KFLD                    XXOPKO
     C                   KFLD                    XXFAKT
     C                   KFLD                    XXKUNR
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
     C*
     C     KEYHEA        KLIST
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C*
     C* READ ALL INVOICED RECORDS
     C*
     C                   MOVE      'F'           XXOPKO
     C     START0        TAG
     C     KEYFA3        SETLL     FAK3
     C     START         TAG
     C                   READ      FAK3                                   33
     C*  VED BRUDD FAKTURA TESTES OM OPPDRAG HAR STATUS = F
     C  N33FAOPKO        COMP      'F'                                3333
     C  N33FAAVOP        IFNE      GAMMEL
     C     KEYHEA        CHAIN     HEADF                              44
     C*
     C  N44HEST          IFEQ      'F'
     C                   MOVE      'G'           HEST
     C                   UPDATE    HEADFR
     C                   MOVE      FAAVOP        GAMMEL           11 0
     C                   ELSE
     C* HVIS IKKE STATUS = F GÅS TIL NESTE FAKTURA
     C                   MOVE      FAAVOP        GAMMEL
     C     FAFAKT        ADD       1             XXFAKT
     C                   GOTO      START0
     C                   END
     C                   END
     C*
     C  N33              MOVE      'G'           FAOPKO
     C  N33              UPDATE    FAKTR
     C  N33              GOTO      START
     C     UTI           TAG
     C                   SETON                                        LR
     C                   RETURN
