      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å SKRIVE UT      ***
      ***          LAGERLISTE                                  ***
      ************************************************************
      *
     FSYFA95FM  CF   E             WORKSTN
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                UDS
     D  UFIRM                  1      2
     I*
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVDF             4
     C                   PARM                    UAVDT             4
     C                   PARM                    UOT1              2
     C                   PARM                    UOT2              2
     C                   PARM                    UOT3              2
     C                   PARM                    UOT4              2
     C                   PARM                    UOT5              2
     C                   PARM                    UOT6              2
     C                   PARM                    UOT7              2
     C                   PARM                    UOT8              2
     C                   PARM                    UOT9              2
     C                   PARM                    UOT10             2
     C                   PARM                    UDT               6
     C                   PARM                    UPPRT            10
     C                   PARM                    UA4               1
     C                   PARM                    UPIN01            1
     C                   PARM                    UIO               1
     C                   MOVE      '0'           UPIN01
     C*
     C* SØRGER FOR AT DEFAULT ER LIK TIDLIGERE TVUNGEN
     C                   MOVE      'O'           WSIO
     C                   MOVE      UYEAR         WSDTÅ
     C                   MOVE      UMONTH        WSDTM
     C                   MOVE      UDAY          WSDTD
     C*
     C     START         TAG
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE
     C                   EXSR      KDTFMT
     C   03              MOVE      '1'           UPIN01
     C   03              GOTO      SLUTT
     C*
     C     WSAVDF        COMP      WSAVDT                             99
     C   99              DO
     C                   SETON                                        30
     C                   MOVE      'SPA0003'     MSGNR
     C                   GOTO      START
     C                   END
     C*
     C                   MOVE      WSAVDF        UAVDF
     C                   MOVE      WSAVDT        UAVDT
     C                   MOVE      WSOT1         UOT1
     C                   MOVE      WSOT2         UOT2
     C                   MOVE      WSOT3         UOT3
     C                   MOVE      WSOT4         UOT4
     C                   MOVE      WSOT5         UOT5
     C                   MOVE      WSOT6         UOT6
     C                   MOVE      WSOT7         UOT7
     C                   MOVE      WSOT8         UOT8
     C                   MOVE      WSOT9         UOT9
     C                   MOVE      WSOT10        UOT10
     C     WSDT          IFEQ      0
     C                   MOVE      '510101'      UDT
     C                   ELSE
     C                   MOVE      WSDT          UDT
     C                   MOVE      WSDTD         UDT
     C                   MOVEL     WSDTÅ         UDT
     C                   END
     C                   MOVE      WSPRT         UPPRT
     C                   MOVE      WSA4          UA4
     C                   MOVE      WSIO          UIO
     C     UPPRT         IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPPRT
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C*
     C                   ENDSR
     C*
