      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE UTSKRIFTNR.               ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31-39 41-86 95-97          ***
      ***********************************************************
     FUTSKRS    UF A E           K DISK
     FUTSKRL01  IF   E           K DISK
     F                                     RENAME(UTSR:UTSR2)
     FSYFA01FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  UTST1                  1    200
     D  UTST2                201    370
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      WSØK          YTXT             30
     C                   MOVE      *ZEROS        YPNR              3 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WSØKN         IFNE      *ZEROS
     C     WSØKN         SETLL     UTSKRS
     C                   ELSE
     C     WSØK          SETLL     UTSKRL01
     C                   END
     C     START1        TAG
     C     WSØKN         IFNE      *ZEROS
     C                   READ(N)   UTSKRS                                 94
     C                   ELSE
     C                   READ      UTSKRL01                               94
     C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     WSØKN         IFNE      *ZEROS
     C                   READ(N)   UTSKRS                                 94
     C                   ELSE
     C                   READ      UTSKRL01                               94
     C                   END
     C  N94              MOVE      UTPTXT        YTXT
     C  N94              MOVE      UTPNR         YPNR
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     BILDE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       98
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY UTSKRIFT TYPE
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     8             POSNBR
     C                   MOVE      *ZEROS        WSPNR
     C                   GOTO      START5
     C                   END
     C*** SØK FRA UTSKRIFT TYPE
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94UTSKL3        SETLL     UTSKRL01
     C     START4        TAG
     C  N94              READ      UTSKRL01                               94
     C  N94UTPNR         IFNE      YPNR
     C                   GOTO      START4
     C                   END
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY UTSKRIFTTYPE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       30
     C                   MOVEA     '0000'        *IN(87)
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA UTSKRIFTTYPE
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSPNR         COMP      0                                      90
     C   90              MOVE      'SPP0014'     MSGNR
     C  N90WSPNR         CHAIN     UTSKRS                             33
     C  N90
     CANN33              DO
     C                   UPDATE    UTSR
     C                   MOVE      'SPP0013'     MSGNR
     C                   SETON                                        90
     C                   END
     C   90              Z-ADD     8             POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C     WSPTXT        COMP      *BLANKS                                89
     C   89
     CANN30              MOVE      'SPT0013'     MSGNR
     C   89
     CANN30              Z-ADD     14            POSNBR
     C   89              SETON                                        30
     C     WSPL          COMP      *ZEROS                                 88
     C   88
     CANN30              MOVE      'SPL0005'     MSGNR
     C   88
     CANN30              Z-ADD     60            POSNBR
     C   88              SETON                                        30
     C     WSPK          COMP      *ZEROS                                 87
     C   87
     CANN30              MOVE      'SPK0027'     MSGNR
     C   87
     CANN30              Z-ADD     72            POSNBR
     C   87              SETON                                        30
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     WSPNR         CHAIN     UTSKRS                             33
     C                   EXSR      MOVWSU
     C  N33              UPDATE    UTSR
     C   33              WRITE     UTSR
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C   40              UPDATE    SUBFIL
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   EXSR      CHGFR
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGFR         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXSR      MOVUWS
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       30
     C                   MOVEA     '0000'        *IN(87)
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSPNR
     C                   MOVE      *BLANKS       WSPTXT
     C                   MOVE      *BLANKS       WSPTY
     C                   MOVE      *ZEROS        WSPL
     C                   MOVE      *ZEROS        WSPK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVUWS        BEGSR
     C***********************************************
     C                   MOVE      ' '           WSNR
     C                   MOVE      UTPNR         WSPNR
     C                   MOVE      UTPTXT        WSPTXT
     C                   MOVE      UTPTY         WSPTY
     C                   MOVE      UTPL          WSPL
     C                   MOVE      UTPK          WSPK
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     14            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSU        BEGSR
     C***********************************************
     C                   MOVE      WSPNR         UTPNR
     C                   MOVE      WSPTXT        UTPTXT
     C     WSPTY         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        WSPTY
     C                   END
     C                   MOVE      WSPTY         UTPTY
     C                   MOVE      WSPL          UTPL
     C                   MOVE      WSPK          UTPK
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     UTSKRK        KLIST
     C                   KFLD                    WSPNR
     C     UTSKL1        KLIST
     C                   KFLD                    WSØK
     C     UTSKL2        KLIST
     C                   KFLD                    UTPTXT
     C     UTSKL3        KLIST
     C                   KFLD                    YTXT
     C*
     C                   ENDSR
     C*
