      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE PRISTABELL (TRANSPORTØR)     ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-24                ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-69 75-90 95-97 ***
      **************************************************************
      *
     FFRTAB     UF A E           K DISK
     FTRAN      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FSYFB01D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  USD                    1      5
     D  USD2                   1      4
     D                 DS
     D  WSPNF                  1      4  0
     D  WSPNF2                 1      5
     D  WSPNT                  6      9  0
     D  WSPNT2                 6     10
     D                 DS
     D  FPIN01                 1      3P 0
     D  FPIN02                 4      6P 0
     D  FPIN03                 7      9P 0
     D  FPIN04                10     12P 0
     D  FPIN05                13     15P 0
     D  FPIN06                16     18P 0
     D  FPIN07                19     21P 0
     D  FPIN08                22     24P 0
     D  FPIN09                25     27P 0
     D  FPIN10                28     30P 0
     D  FPIN11                31     33P 0
     D  FPIN12                34     36P 0
     D  FPIN13                37     39P 0
     D  FPIN14                40     42P 0
     D  FPIN15                43     45P 0
     D  FPIN16                46     48P 0
     D  FPIN17                49     51P 0
     D  FPIN18                52     54P 0
     D  FPIN19                55     57P 0
     D  FPIN20                58     60P 0
     D  FPINT                  1     60
     D  INF                    1     60P 0
     D                                     DIM(20)
     D                 DS
     D  WSIN01                 1      3P 0
     D  WSIN02                 4      6P 0
     D  WSIN03                 7      9P 0
     D  WSIN04                10     12P 0
     D  WSIN05                13     15P 0
     D  WSIN06                16     18P 0
     D  WSIN07                19     21P 0
     D  WSIN08                22     24P 0
     D  WSIN09                25     27P 0
     D  WSIN10                28     30P 0
     D  WSIN11                31     33P 0
     D  WSIN12                34     36P 0
     D  WSIN13                37     39P 0
     D  WSIN14                40     42P 0
     D  WSIN15                43     45P 0
     D  WSIN16                46     48P 0
     D  WSIN17                49     51P 0
     D  WSIN18                52     54P 0
     D  WSIN19                55     57P 0
     D  WSIN20                58     60P 0
     D  IN                     1     60P 0
     D                                     DIM(20)
     D                 DS
     D  FPPR01                 1      4P 2
     D  FPPR02                 5      8P 2
     D  FPPR03                 9     12P 2
     D  FPPR04                13     16P 2
     D  FPPR05                17     20P 2
     D  FPPR06                21     24P 2
     D  FPPR07                25     28P 2
     D  FPPR08                29     32P 2
     D  FPPR09                33     36P 2
     D  FPPR10                37     40P 2
     D  FPPR11                41     44P 2
     D  FPPR12                45     48P 2
     D  FPPR13                49     52P 2
     D  FPPR14                53     56P 2
     D  FPPR15                57     60P 2
     D  FPPR16                61     64P 2
     D  FPPR17                65     68P 2
     D  FPPR18                69     72P 2
     D  FPPR19                73     76P 2
     D  FPPR20                77     80P 2
     D  FPPR                   1     80
     D  PRF                    1     80P 2
     D                                     DIM(20)
     D                 DS
     D  WSPR01                 1      4P 2
     D  WSPR02                 5      8P 2
     D  WSPR03                 9     12P 2
     D  WSPR04                13     16P 2
     D  WSPR05                17     20P 2
     D  WSPR06                21     24P 2
     D  WSPR07                25     28P 2
     D  WSPR08                29     32P 2
     D  WSPR09                33     36P 2
     D  WSPR10                37     40P 2
     D  WSPR11                41     44P 2
     D  WSPR12                45     48P 2
     D  WSPR13                49     52P 2
     D  WSPR14                53     56P 2
     D  WSPR15                57     60P 2
     D  WSPR16                61     64P 2
     D  WSPR17                65     68P 2
     D  WSPR18                69     72P 2
     D  WSPR19                73     76P 2
     D  WSPR20                77     80P 2
     D  PR                     1     80P 2
     D                                     DIM(20)
     D                 DS
     D  FPMÅ01                 1      3P 0
     D  FPMÅ02                 4      6P 0
     D  FPMÅ03                 7      9P 0
     D  FPMÅ04                10     12P 0
     D  FPMÅ05                13     15P 0
     D  FPMÅ06                16     18P 0
     D  FPMÅ07                19     21P 0
     D  FPMÅ08                22     24P 0
     D  FPMÅ09                25     27P 0
     D  FPMÅ10                28     30P 0
     D  FPMÅ11                31     33P 0
     D  FPMÅ12                34     36P 0
     D  FPMÅ13                37     39P 0
     D  FPMÅ14                40     42P 0
     D  FPMÅ15                43     45P 0
     D  FPMÅ16                46     48P 0
     D  FPMÅ17                49     51P 0
     D  FPMÅ18                52     54P 0
     D  FPMÅ19                55     57P 0
     D  FPMÅ20                58     60P 0
     D  FPMÅTE                 1     60
     D  MÅF                    1     60P 0
     D                                     DIM(20)
     D                 DS
     D  WSMÅ01                 1      3P 0
     D  WSMÅ02                 4      6P 0
     D  WSMÅ03                 7      9P 0
     D  WSMÅ04                10     12P 0
     D  WSMÅ05                13     15P 0
     D  WSMÅ06                16     18P 0
     D  WSMÅ07                19     21P 0
     D  WSMÅ08                22     24P 0
     D  WSMÅ09                25     27P 0
     D  WSMÅ10                28     30P 0
     D  WSMÅ11                31     33P 0
     D  WSMÅ12                34     36P 0
     D  WSMÅ13                37     39P 0
     D  WSMÅ14                40     42P 0
     D  WSMÅ15                43     45P 0
     D  WSMÅ16                46     48P 0
     D  WSMÅ17                49     51P 0
     D  WSMÅ18                52     54P 0
     D  WSMÅ19                55     57P 0
     D  WSMÅ20                58     60P 0
     D  MÅ                     1     60P 0
     D                                     DIM(20)
     D                 DS
     D  FPRB01                 1      2P 1
     D  FPRB02                 3      4P 1
     D  FPRB03                 5      6P 1
     D  FPRB04                 7      8P 1
     D  FPRB05                 9     10P 1
     D  FPRB06                11     12P 1
     D  FPRB07                13     14P 1
     D  FPRB08                15     16P 1
     D  FPRB09                17     18P 1
     D  FPRB10                19     20P 1
     D  FPRB11                21     22P 1
     D  FPRB12                23     24P 1
     D  FPRB13                25     26P 1
     D  FPRB14                27     28P 1
     D  FPRB15                29     30P 1
     D  FPRB16                31     32P 1
     D  FPRB17                33     34P 1
     D  FPRB18                35     36P 1
     D  FPRB19                37     38P 1
     D  FPRB20                39     40P 1
     D  FPRAB                  1     40
     D  RBF                    1     40P 1
     D                                     DIM(20)
     D                 DS
     D  WSRB01                 1      2P 1
     D  WSRB02                 3      4P 1
     D  WSRB03                 5      6P 1
     D  WSRB04                 7      8P 1
     D  WSRB05                 9     10P 1
     D  WSRB06                11     12P 1
     D  WSRB07                13     14P 1
     D  WSRB08                15     16P 1
     D  WSRB09                17     18P 1
     D  WSRB10                19     20P 1
     D  WSRB11                21     22P 1
     D  WSRB12                23     24P 1
     D  WSRB13                25     26P 1
     D  WSRB14                27     28P 1
     D  WSRB15                29     30P 1
     D  WSRB16                31     32P 1
     D  WSRB17                33     34P 1
     D  WSRB18                35     36P 1
     D  WSRB19                37     38P 1
     D  WSRB20                39     40P 1
     D  RB                     1     40P 1
     D                                     DIM(20)
     D                 DS
     D  FPPM01                 1      2P 0
     D  FPPM02                 3      4P 0
     D  FPPM03                 5      6P 0
     D  FPPM04                 7      8P 0
     D  FPPM05                 9     10P 0
     D  FPPM06                11     12P 0
     D  FPPM07                13     14P 0
     D  FPPM08                15     16P 0
     D  FPPM09                17     18P 0
     D  FPPM10                19     20P 0
     D  FPPM11                21     22P 0
     D  FPPM12                23     24P 0
     D  FPPM13                25     26P 0
     D  FPPM14                27     28P 0
     D  FPPM15                29     30P 0
     D  FPPM16                31     32P 0
     D  FPPM17                33     34P 0
     D  FPPM18                35     36P 0
     D  FPPM19                37     38P 0
     D  FPPM20                39     40P 0
     D  FPENDR                 1     40
     D  PMF                    1     40P 0
     D                                     DIM(20)
     D                 DS
     D  WSPM01                 1      2P 0
     D  WSPM02                 3      4P 0
     D  WSPM03                 5      6P 0
     D  WSPM04                 7      8P 0
     D  WSPM05                 9     10P 0
     D  WSPM06                11     12P 0
     D  WSPM07                13     14P 0
     D  WSPM08                15     16P 0
     D  WSPM09                17     18P 0
     D  WSPM10                19     20P 0
     D  WSPM11                21     22P 0
     D  WSPM12                23     24P 0
     D  WSPM13                25     26P 0
     D  WSPM14                27     28P 0
     D  WSPM15                29     30P 0
     D  WSPM16                31     32P 0
     D  WSPM17                33     34P 0
     D  WSPM18                35     36P 0
     D  WSPM19                37     38P 0
     D  WSPM20                39     40P 0
     D  PM                     1     40P 0
     D                                     DIM(20)
     D                UDS
     D  UFIRM                  1      2
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2PNF         YPNF              4 0
     C                   MOVE      W2PNT         YPNT              4 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     FRTABK        SETLL     FRTAB
     C     START1        TAG
     C     W2KNT         READE(N)  FRTAB                                  94
     C  N94              MOVE      FPPNF         YPNF
     C  N94              MOVE      FPPNT         YPNT
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        6
     C                   ADD       1             ZRECNO
     C                   MOVE      *BLANKS       XDLT
     C                   WRITE     SUBFIL
     C     W2KNT         READE(N)  FRTAB                                  94
     C  N94              MOVE      FPPNF         YPNF
     C  N94              MOVE      FPPNT         YPNT
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   MOVE      W2KNT         WSKNT
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     35            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              DO
     C                   Z-ADD     23            LINNBR
     C                   Z-ADD     18            POSNBR
     C                   GOTO      START6
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94              DO
     C                   MOVE      YPNF          W2PNF
     C                   MOVE      YPNT          W2PNT
     C     FRTABK        SETLL     FRTAB
     C     W2KNT         READE(N)  FRTAB                                  94
     C                   END
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   MOVEA     '00000'       *IN(70)
     C                   SETOFF                                       30
     C   12              EXSR      MOVB2
     C**** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START5
     C                   END
     C*
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C  N12WSKNT         IFNE      W2KNT
     C                   MOVE      WSKNT         W2KNT
     C     WSPNF         IFLT      W2PNF
     C                   MOVE      WSPNF         W2PNF
     C                   END
     C     WSPNT         IFLT      W2PNT
     C                   MOVE      WSPNT         W2PNT
     C                   END
     C     TRANK2        CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       VMNAVN
     C                   GOTO      START
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C*** SØKE
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      START6
     C                   END
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C   12              GOTO      START3
     C     TRANK2        CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       VMNAVN
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C* N40 = NY
     C  N40              DO
     C*
     C*** TEST TRANSPORTØR
     C     WSKNT         COMP      0                                      70
     C  N70TRANK         CHAIN     TRAN                               70
     C   70              DO
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   SETON                                        30
     C                   MOVE      'SPT0105'     MSGNR
     C                   GOTO      SLTB
     C                   END
     C*
     C* TEST POSTNR. FRA
     C     WSPNF2        CHAIN     STED2                              71
     C   71              DO
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     15            POSNBR
     C                   SETON                                        30
     C                   MOVE      'SPP0028'     MSGNR
     C                   GOTO      SLTB
     C                   END
     C* TEST POSTNR. TIL
     C     WSPNT2        CHAIN     STED2                              72
     C   72              DO
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     35            POSNBR
     C                   SETON                                        30
     C                   MOVE      'SPP0028'     MSGNR
     C                   GOTO      SLTB
     C                   END
      *
     C                   END
      * TEST POSTNR. TIL 2
     C     WSPNTT        IFNE      0
     C     WSPNTT        COMP      WSPNT                                74
     C   74              DO
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     41            POSNBR
     C                   SETON                                        30
     C                   MOVE      'YBC1799'     MSGNR
     C                   GOTO      SLTB
     C                   END
     C                   END
     C*
     C*** TEST INTERVALER
     C     WSIN01        COMP      0                                      73
     C  N731             DO        19            XN                2 0
     C     XN            ADD       1             XN2               2 0
     C                   SELECT
     C     IN(XN)        WHENEQ    99999
     C                   LEAVE
     C     IN(XN2)       WHENEQ    0
     C                   Z-ADD     99999         IN(XN2)
     C                   MOVE      PR(XN)        PR(XN2)
     C                   MOVE      MÅ(XN)        MÅ(XN2)
     C                   MOVE      RB(XN)        RB(XN2)
     C                   MOVE      PM(XN)        PM(XN2)
     C                   LEAVE
     C                   OTHER
     C     IN(XN)        COMP      IN(XN2)                            73  73
     C   73              LEAVE
     C                   ENDSL
     C                   END
      *
     C   73              DO
     C                   MOVE      'SPI0005'     MSGNR
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     22            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     FRTBK2        CHAIN     FRTAB                              33
     C                   EXSR      MOVWST
     C  N33              UPDATE    FRTABR
     C   33              WRITE     FRTABR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     3             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       6             LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     16            LINNBR
     C                   ELSE
     C     XLIN          MULT      3             LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGTAB
     C   12              GOTO      SLHENT
     C                   END
      *
      * KOPIERING
      *
     C     WSNR          IFEQ      '3'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      COPTAB
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTTAB
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       2             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTTAB        BEGSR
     C***********************************************
     C                   SETON                                        99
     C*
     C                   EXFMT     VAREL3
     C  N12              DO
     C     FRTBK3        CHAIN     FRTAB                              33
     C  N33              DELETE    FRTABR
     C                   EXSR      MOVB1
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGTAB        BEGSR
     C***********************************************
     C                   EXSR      MOVTWS
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   MOVEA     '00000'       *IN(70)
     C                   SETOFF                                       30
     C*
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C**** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      STCHG
     C                   END
     C*
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     16            LINNBR
     C                   ELSE
     C     XLIN          MULT      3             LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     COPTAB        BEGSR
     C***********************************************
     C                   EXSR      MOVTWS
     C                   MOVE      *BLANKS       WSPNT
     C                   MOVE      *BLANKS       WSPNTT
     C                   SETOFF                                       40
     C                   SETON                                        99
     C     STCOP         TAG
     C                   EXFMT     VARELI
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   MOVEA     '00000'       *IN(70)
     C                   SETOFF                                       30
     C*
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C**** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      STCOP
     C                   END
     C*
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCOP
     C     XLIN          IFEQ      0
     C                   Z-ADD     16            LINNBR
     C                   ELSE
     C     XLIN          MULT      3             LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        FPKNT
     C                   MOVE      *ZEROS        FPPNF
     C                   MOVE      *ZEROS        FPPNT
     C                   MOVE      *ZEROS        FPPNTT
     C                   MOVE      *ZEROS        FPMIN
     C                   MOVE      *ZEROS        INF
     C                   MOVE      *ZEROS        PRF
     C                   MOVE      *ZEROS        MÅF
     C                   MOVE      *ZEROS        RBF
     C                   MOVE      *ZEROS        PMF
     C*
     C                   MOVE      '*DELETE'     XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      W2KNT         WSKNT
     C                   MOVE      *ZEROS        WSPNT
     C                   MOVE      *ZEROS        PR
     C                   MOVE      *ZEROS        PM
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVTWS        BEGSR
     C***********************************************
     C                   MOVE      FPKNT         WSKNT
     C                   MOVE      FPPNF         WSPNF
     C                   MOVE      FPPNT         WSPNT
     C                   MOVE      FPPNTT        WSPNTT
     C                   MOVE      FPMIN         WSMIN
     C                   MOVEA     INF           IN
     C                   MOVEA     PRF           PR
     C                   MOVEA     MÅF           MÅ
     C                   MOVEA     RBF           RB
     C                   MOVEA     PMF           PM
     C*
     C                   SETON                                        40
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     73            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWST        BEGSR
     C***********************************************
     C                   MOVE      WSKNT         FPKNT
     C                   MOVE      WSPNF         FPPNF
     C                   MOVE      WSPNT         FPPNT
     C                   MOVE      WSPNTT        FPPNTT
     C                   MOVE      WSMIN         FPMIN
     C                   MOVEA     IN            INF
     C                   MOVEA     PR            PRF
     C                   MOVEA     MÅ            MÅF
     C                   MOVEA     RB            RBF
     C                   MOVEA     PM            PMF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   SELECT
     C     LINNBR        WHENEQ    3
     C     POSNBR        ANDGE     20
     C     POSNBR        ANDLE     27
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLSØK
      *
     C     LINNBR        WHENEQ    4
     C     POSNBR        ANDGE     15
     C     POSNBR        ANDLE     18
     C                   MOVEL     WSPNF         USD
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          WSPNF
     C   33              Z-ADD     35            POSNBR
     C                   GOTO      SLSØK
      *
     C     LINNBR        WHENEQ    4
     C     POSNBR        ANDGE     35
     C     POSNBR        ANDLE     38
     C                   MOVEL     WSPNT         USD
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          WSPNT
     C   33              Z-ADD     41            POSNBR
     C                   GOTO      SLSØK
      *
     C     LINNBR        WHENEQ    4
     C     POSNBR        ANDGE     41
     C     POSNBR        ANDLE     44
     C                   MOVEL     WSPNTT        USD
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          WSPNTT
     C   33              Z-ADD     6             LINNBR
     C   33              Z-ADD     20            POSNBR
     C                   GOTO      SLSØK
     C                   ENDSL
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     SØKDT2        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      23
     C                   SELECT
     C     POSNBR        WHENGE    18
     C     POSNBR        ANDLE     25
     C                   CALL      'SYTR04A'
     C                   PARM                    W2KNT
     C                   Z-ADD     48            POSNBR
     C                   GOTO      SLSØK2
      *
     C     POSNBR        WHENGE    48
     C     POSNBR        ANDLE     51
     C                   MOVEL     W2PNF         USD
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          W2PNF
     C   33              Z-ADD     73            POSNBR
     C                   GOTO      SLSØK2
      *
     C     POSNBR        WHENGE    73
     C     POSNBR        ANDLE     76
     C                   MOVEL     W2PNT         USD
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          W2PNT
     C                   GOTO      SLSØK2
     C                   ENDSL
     C                   END
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK2        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     FRTABK        KLIST
     C                   KFLD                    W2KNT
     C                   KFLD                    W2PNF
     C                   KFLD                    W2PNT
     C     FRTBK2        KLIST
     C                   KFLD                    WSKNT
     C                   KFLD                    WSPNF
     C                   KFLD                    WSPNT
     C     FRTBK3        KLIST
     C                   KFLD                    FPKNT
     C                   KFLD                    FPPNF
     C                   KFLD                    FPPNT
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKNT
     C     TRANK2        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    W2KNT
     C*
     C                   MOVE      'J'           USØK              1
     C                   MOVE      'Min.P'       XMINP
     C                   MOVE      *ZEROS        WSPNF
     C                   MOVE      *ZEROS        WSPNT
     C                   MOVE      *ZEROS        INF
     C                   MOVE      *ZEROS        PRF
     C                   MOVE      *ZEROS        MÅF
     C                   MOVE      *ZEROS        RBF
     C                   MOVE      *ZEROS        PMF
     C                   MOVE      *ZEROS        IN
     C                   MOVE      *ZEROS        PR
     C                   MOVE      *ZEROS        MÅ
     C                   MOVE      *ZEROS        RB
     C                   MOVE      *ZEROS        PM
     C*
     C                   Z-ADD     23            LINNBR
     C                   Z-ADD     18            POSNBR
     C                   WRITE     NYWRK
     C     STINIT        TAG
     C                   EXFMT     VAREL2
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C***
     C**** SØKE ALFA
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      STINIT
     C                   END
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     3             POSNBR
     C     TRANK2        CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       VMNAVN
     C*
     C                   ENDSR
     C*
