********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 xx  PTF11 xxxxxxxxxxxxxx
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KUNDEID TOLLPOST          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-67 71-90    ***
      ***                    95-97 99                         ***
      ***********************************************************
      *
     Ffirm      IF   E           K DISK
     FTRAN      IF   E           K DISK
     FTGUSER    UF A E           K DISK
     FSYFB05FB  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  TGUSR                  1     20
     D  KLKNV4                 1      4
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2KUNR        YKUNR             7
     C                   MOVE      W2TRAN        YTRAN             8 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KEYW2         SETLL     TGUSER
     C     START1        TAG
     C                   READ(N)   TGUSER                                 94
     C   94              MOVE      *BLANKS       TGUSR
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
     c                   move      *blanks       VMNAVN
     c     keytrf        chain     tran                               34
     C                   WRITE     SUBFIL
     C                   READ(N)   TGUSER                                 94
     C  N94              MOVE      TGTRAN        YTRAN
     C  N94              MOVE      TGKUNR        YKUNR
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY LANDKODE
     C   06              GOTO      START5
     C*** SØK FRA LANDKODE
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KEYRO         SETLL     TGUSER
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   EXSR      HENT
     C     *IN27         IFEQ      *ON
     C     WSNR          ANDEQ     '1'
     C                   GOTO      SLUTT
     C                   ENDIF
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT LANDKODE
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KEYPF         CHAIN     TGUSER                             33
     C  N33              DELETE    TGUSERR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DLT'        TGUSR
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE LANDKODE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(68)
     C                   SETOFF                                       30
      *søk transportør
     C     *in04         IFEQ      '1'
     C                   CALL      'SYTR04A'
     C                   PARM                    WSTRAN
     C                   GOTO      START5
     C                   END
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA DESTINASJON
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
      *transportør
     C     KEYTRW        CHAIN     TRAN                               71
     C   71              MOVE      'SPT0133'     MSGNR
     C   71              SETON                                        30
     C   71              GOTO      SLTB
      *kundnummer hos transportør
     C     WSKUNR        COMP      *BLANKS                                70
     C   70              MOVE      'SHU1439'     MSGNR
     C   70              SETON                                        30
     C   70              GOTO      SLTB
     C                   END
     C*
     C     WSUSR         COMP      *BLANKS                                69
n01  C   69              MOVE      'SHU1440'     MSGNR
     C   69              SETON                                        30
     C   69              GOTO      SLTB
     C*
     C     WSPWD         COMP      *BLANKS                                68
     C   68              MOVE      'SHU1441'     MSGNR
     C   68              SETON                                        30
     C   68              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KEYWS         CHAIN     TGUSER                             33
     C                   EXSR      MOVWLK
     C  N33              UPDATE    TGUSERR
     C   33              WRITE     TGUSERR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     KLKNV4        COMP      '*DLT'                                 98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVLKW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     KLKNV4        COMP      '*DLT'                                 98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       TGKUNR
     C                   MOVE      *BLANKS       TGUSR
     C                   MOVE      *BLANKS       TGPWD
     C                   MOVE      *BLANKS       TGFRI
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSTRAN
     C                   MOVE      *BLANKS       WSKUNR
     C                   MOVE      *BLANKS       WSUSR
     C                   MOVE      *BLANKS       WSPWD
     C                   MOVE      *BLANKS       WSFRI
     C                   MOVE      *BLANKS       WSBUD
     C                   MOVE      *zeros        WSlim
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVLKW        BEGSR
     C***********************************************
     C                   MOVE      TGTRAN        WSTRAN
     C                   MOVE      TGKUNR        WSKUNR
     C                   MOVE      TGUSR         WSUSR
     C                   MOVE      TGPWD         WSPWD
     C                   MOVE      TGFRI         WSFRI
     C                   MOVE      TGBUD         WSBUD
     C                   MOVE      TGLIM         WSLIM
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWLK        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      WSTRAN        TGTRAN
     C                   MOVE      WSKUNR        TGKUNR
     C                   END
     C*
     C                   MOVE      WSUSR         TGUSR
     C                   MOVE      WSPWD         TGPWD
     C                   MOVE      WSFRI         TGFRI
     C                   MOVE      WSBUD         TGBUD
     C                   MOVE      WSLIM         TGLIM
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    TGKUNR        UKUNR
      *
      *
     C     KEYWS         KLIST
     C                   KFLD                    WSTRAN
     C                   KFLD                    WSKUNR
     C     KEYW2         KLIST
     C                   KFLD                    W2TRAN
     C                   KFLD                    W2KUNR
     C     KEYPF         KLIST
     C                   KFLD                    TGTRAN
     C                   KFLD                    TGKUNR
     C     KEYRO         KLIST
     C                   KFLD                    YTRAN
     C                   KFLD                    YKUNR
     C*
     c                   read      firm
     C     KEYTRf        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    tgtran
     C     KEYTRW        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    WStran
     C                   ENDSR
     C*
