      *
      ***********************************************************
      *** PROGRAM FOR AVVIK TOLLPOST POSTNR/SONENR.TILHØRIGHET**
      ***************************************************************
     FFRSTIS    UF A E           K DISK
     FSYFB07FM  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     F                                     SFILE(SUBFIL:ZRECNO)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2IPNF        YTIPNF            4
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     W2IPNF        IFEQ      *BLANKS
     C     STIFRA        SETLL     FRSTIS
     C                   ELSE
     C     PRISK1        SETLL     FRSTIS
     C                   MOVE      *BLANKS       W2IPNF
     C                   END
     C     START1        TAG
     C     STIFRA        READE(N)  FRSTIS                                 94
     C   94              MOVE      *BLANKS       STIPNF
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     STIFRA        READE(N)  FRSTIS                                 94
     C  N94              MOVE      STIPNF        YTIPNF
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C                   SETOFF                                       9830
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
      * ER MODUL INSTALLERT ?????
     C     MODOK         IFNE      'J'
     C                   MOVEL     'SYTGSONE'    UMODUL           15
     C                   MOVE      'PRIS   '     UMODUL
     C                   CALL      'SYPRODT'
     C                   PARM                    UMODUL
     C                   PARM                    UMFLAG            1 0
     C     UMFLAG        IFEQ      1
     C                   SETON                                        LR
     C                   RETURN
     C                   END
     C                   MOVE      'J'           MODOK             1
     C                   END
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94PRISK3        SETLL     FRSTIS
     C  N94STIFRA        READE(N)  FRSTIS                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT VARE
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     PRISK2        CHAIN     FRSTIS                             33
     C  N33              DELETE    STIR
     C                   EXSR      MOVB1
     C                   MOVE      '*DEL*'       STIPNF
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
      *
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     17            POSNBR
     C*
     C*** LAGE/ENDRE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00000'       *IN(86)
     C                   SETOFF                                       30
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
      *
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C     NY            IFEQ      'J'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      START5
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C     *IN40         IFEQ      '0'
     C     WSIPNF        COMP      *ZEROS                                 30
     C     *IN30         IFEQ      '1'
     C                   MOVE      'JOV0163'     MSGNR
     C                   ELSE
     C                   MOVE      WSIPNF        WAIPNF            4             ***ALFA
     C     PRISK         CHAIN(N)  FRSTIS                             33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'YBC0351'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   END
     C                   END
     C     *IN30         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     8             POSNBR
     C                   MOVE      '1'           *IN90
     C                   GOTO      SLTB1
     C                   END
     C                   END
      *
     C     WSIPNT        IFLT      WSIPNF
     C     WSIPNT        ANDNE     *ZEROS
     C                   MOVE      'YBC0352'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     17            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN89
     C                   GOTO      SLTB1
     C                   END
      *
     C     WSIHF         ADD       WSIFF         SUMSON            4 0
     C                   ADD       WSIVF         SUMSON
     C     SUMSON        IFEQ      *ZEROS
     C                   MOVE      'JOV0735'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     30            POSNBR
     C                   MOVE      '1'           *IN30
     C                   MOVEA     '111'         *IN(86)
     C                   GOTO      SLTB1
     C                   END
      *
     C*
     C                   MOVE      WSIPNF        WAIPNF            4             ***ALFA
     C     PRISK         CHAIN     FRSTIS                             33
     C*
     C     *IN40         IFEQ      '0'                                          *F6-MODUS
     C     *IN33         ANDEQ     '0'                                          *FINNES
     C                   MOVE      'JOV0164'     MSGNR
     C                   MOVE      '1'           *IN90
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLTB1
     C                   END
     C*
     C                   EXSR      MOVWPR
     C  N33              UPDATE    STIR
     C   33              WRITE     STIR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C   40              MOVE      'N'           NY                1
     C  N40              MOVE      'J'           NY
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB1         ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     STIPNF        COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVPRW
     C                   MOVE      ' '           WSNR
     C                   SETOFF                                       9089
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     STIPNF        COMP      '*DEL*'                                98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWPR        BEGSR
     C***********************************************
     C                   MOVE      WSIPNF        STIPNF
     C                   MOVE      WSIPNT        STIPNT
     C     STIPNT        IFEQ      *ZEROS
     C                   MOVE      STIPNF        STIPNT
     C                   END
     C                   MOVE      WSIHF         STIHF
     C                   MOVE      WSIFF         STIFF
     C                   MOVE      WSIVF         STIVF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVPRW        BEGSR
     C***********************************************
     C                   MOVE      STIPNF        WSIPNF
     C                   MOVE      STIPNT        WSIPNT
     C                   MOVE      STIHF         WSIHF
     C                   MOVE      STIFF         WSIFF
     C                   MOVE      STIVF         WSIVF
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        STIPNF
     C                   MOVE      *ZEROS        STIPNT
     C                   MOVE      *ZEROS        STIHF
     C                   MOVE      *ZEROS        STIFF
     C                   MOVE      *ZEROS        STIVF
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSIPNF
     C                   MOVE      *ZEROS        WSIPNT
     C                   MOVE      *ZEROS        WSIHF
     C                   MOVE      *ZEROS        WSIFF
     C                   MOVE      *ZEROS        WSIVF
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C*
     C                   MOVE      '0101'        STIFRA
     C*
     C     PRISK         KLIST
     C                   KFLD                    STIFRA
     C                   KFLD                    WAIPNF
     C     PRISK1        KLIST
     C                   KFLD                    STIFRA
     C                   KFLD                    W2IPNF
     C     PRISK2        KLIST
     C                   KFLD                    STIFRA
     C                   KFLD                    STIPNF
     C     PRISK3        KLIST
     C                   KFLD                    STIFRA
     C                   KFLD                    YTIPNF
     C*
     C                   Z-ADD     28            POSNBR
     C                   Z-ADD     5             LINNBR
     C                   ENDSR
     C*
