      *
      **************************************************************
      *** PROGRAM SKAL KONVARTERE PRISTABELL/STEDREG. (TOLLPOST) ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 0102 05-26                          ***
      *** LEDIGE INDIKATORER 27-32 35-96                         ***
      **************************************************************
      *
     FFRSTTG    UF A E           K DISK
     FFRTABTG   UF A E           K DISK
     FTPST      IF   E           K DISK
     FTPTAB     IF   F   80        DISK
     FSTED2     IF   E           K DISK
     FTRAN      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYFB11D   CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D PR2             S              4  0 DIM(20)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  USD                    1      5
     D  USD2                   1      4
     D                 DS
     D  TGPR1                  1    240
     D  TGPR2                241    480
     D  PR                     1    480  0
     D                                     DIM(120)
     D                 DS
     D  TPPN                   1      4
     D  TGPNT                  1      4
     D  TPNA                   5     29
     D  TGNA                   5     29
     D  TPEK                  30     44
     D  TGEK                  30     44
     D  TPHE                  45     47
     D  TGHE                  45     47
     D  TPHF                  48     50
     D  TGHF                  48     50
     D  TPFF                  51     53
     D  TGFF                  51     53
     D  TPVF                  54     56
     D  TGVF                  54     56
     D  TPUS                  57     59
     D  TGUS                  57     59
     D  TPUT                  60     60
     D  TGUT                  60     60
     D  TPTV                  61     61
     D  TGTV                  61     61
     D  TPFR                  62     62
     D  TGFR                  62     62
     D  TPFI                  63     63
     D  TGFI                  63     63
     D  TPKO                  64     64
     D  TGKO                  64     64
     D  TPTO                  65     68
     D  TGTO                  65     68
     D  TPPB                  69     69
     D  TGPB                  69     69
     D  TPTS                  70     70
     D  TGTS                  70     70
     D  TPBA                  71     74
     D  TGBA                  71     74
     ITPTAB     AA  01
     I                                  1   80  PR2
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVEA     '000'         *IN(97)
     C   03              GOTO      SLUTT
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C**** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *
     C     TRANK         CHAIN     TRAN                               99
     C   99              GOTO      START
     C                   MOVEL     WSPNF         YPN               5
     C     YPN           CHAIN     STED2                              98
     C   98              GOTO      START
      *
     C     STTGKK        CHAIN     FRSTTG                             33
     C                   MOVE      *ZEROS        TGPNF
     C                   MOVE      '9999'        TGPNT
     C                   MOVEL     WSKNT         TGNA
     C   33              WRITE     FRSTTGR
     C  N33              UPDATE    FRSTTGR
      *
     C                   MOVE      *BLANKS       TPPN
     C                   MOVE      WSPNF         TGPNF
     C                   SETOFF                                       33
     C     TPPN          SETLL     TPST
     C     START2        TAG
     C                   READ      TPST                                   33
     C  N33              DO
     C     STTGK         CHAIN     FRSTTG                             34
     C   34              WRITE     FRSTTGR
     C  N34              UPDATE    FRSTTGR
     C                   GOTO      START2
     C                   END
     C*
     C     1             SETLL     TPTAB
     C                   SETOFF                                       33
     C     START3        TAG
     C                   READ      TPTAB                                  33
     C  N33              DO
     C                   MOVEL     PR2(1)        TGSONE
     C     TGSONE        CHAIN     FRTABTG                            34
     C   34              MOVE      *ZEROS        PR
     C                   MOVEA     PR2(2)        PR(1)
     C                   READ      TPTAB                                  33
     C                   MOVEA     PR2(1)        PR(20)
     C                   READ      TPTAB                                  33
     C                   MOVEA     PR2(1)        PR(40)
     C                   READ      TPTAB                                  33
     C                   MOVEA     PR2(1)        PR(60)
     C                   READ      TPTAB                                  33
     C                   MOVEA     PR2(1)        PR(80)
     C                   READ      TPTAB                                  33
     C                   MOVEA     PR2(1)        PR(100)
     C   34              WRITE     FRTABTGR
     C  N34              UPDATE    FRTABTGR
     C                   GOTO      START3
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   SELECT
     C     LINNBR        WHENEQ    5
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     47
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK
      *
     C     LINNBR        WHENEQ    7
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     43
     C                   MOVEL     WSPNF         USD               5
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          WSPNF
     C                   GOTO      SLSØK
      *
     C                   ENDSL
     C*
     C                   SETON                                        97
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNT
     C     STTGK         KLIST
     C                   KFLD                    TGPNF
     C                   KFLD                    TPPN
     C     STTGKK        KLIST
     C                   KFLD                    YPNF
     C                   KFLD                    YPNT
     C*
     C                   MOVE      *ZEROS        YPNF              4
     C                   MOVE      '9999'        YPNT              4
     C                   MOVE      *ZEROS        PR
     C                   MOVE      *ZEROS        PR2
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
