********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 xx  PTF11 endret transportør til leverandør
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KUNDEID TOLLPOST          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-67 71-90    ***
      ***                    95-97 99                         ***
      ***********************************************************
      *
     Ffirm      IF   E           K DISK
s01  F*RAN      IF   E           K DISK
s01  FLEVEL01   IF   E           K DISK
     FTRAPRAV   UF A E           K DISK
     FSYFB05FD  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  TGUSR                  1     20
     D  KLKNV4                 1      4
     D                 DS
     D  TRVK01                 1      5  0
     D  TRVK02                 6     10  0
     D  TRVK03                11     15  0
     D  TRVK04                16     20  0
     D  TRVK05                21     25  0
     D  TRVK06                26     30  0
     D  TRVK07                31     35  0
     D  TRVK08                36     40  0
     D  TRVK09                41     45  0
     D  TRVK10                46     50  0
     D  TRVK11                51     55  0
     D  TRVK12                56     60  0
     D  TRV                    1     60  0
     D                                     DIM(12)
     D                 DS
     D  TRPA01                 1      3  1
     D  TRPA02                 4      6  1
     D  TRPA03                 7      9  1
     D  TRPA04                10     12  1
     D  TRPA05                13     15  1
     D  TRPA06                16     18  1
     D  TRPA07                19     21  1
     D  TRPA08                22     24  1
     D  TRPA09                25     27  1
     D  TRPA10                28     30  1
     D  TRPA11                31     33  1
     D  TRPA12                34     36  1
     D  TRP                    1     36  1
     D                                     DIM(12)
     D                 DS
     D  WSVK01                 1      5  0
     D  WSVK02                 6     10  0
     D  WSVK03                11     15  0
     D  WSVK04                16     20  0
     D  WSVK05                21     25  0
     D  WSVK06                26     30  0
     D  WSVK07                31     35  0
     D  WSVK08                36     40  0
     D  WSVK09                41     45  0
     D  WSVK10                46     50  0
     D  WSVK11                51     55  0
     D  WSVK12                56     60  0
     D  WSV                    1     60  0
     D                                     DIM(12)
     D                 DS
     D  WSPA01                 1      3  1
     D  WSPA02                 4      6  1
     D  WSPA03                 7      9  1
     D  WSPA04                10     12  1
     D  WSPA05                13     15  1
     D  WSPA06                16     18  1
     D  WSPA07                19     21  1
     D  WSPA08                22     24  1
     D  WSPA09                25     27  1
     D  WSPA10                28     30  1
     D  WSPA11                31     33  1
     D  WSPA12                34     36  1
     D  WSP                    1     36  1
     D                                     DIM(12)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2TRAN        YTRAN             8 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KEYW2         SETLL     TRAPRAV
     C     START1        TAG
     C                   READ(N)   TRAPRAV                                94
     C   94              MOVE      *BLANKS       TGUSR
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
s01  c*                  move      *blanks       VMNAVN
n01  c                   move      *blanks       LNAVN
s01  c*    keytrf        chain     tran                               34
n01  c     keytrf        chain     level01                            34
     C                   WRITE     SUBFIL
     C                   READ(N)   TRAPRAV                                94
     C  N94              MOVE      TRTRAN        YTRAN
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   WRITE     BUNN
     C                   END
     C                   SETOFF                                       98
     C                   EXFMT     SUBCTL
     C*
     C*** AVSLUTT
     C     ST41          TAG
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY LANDKODE
     C   06              GOTO      START5
     C*** SØK FRA LANDKODE
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KEYRO         SETLL     TRAPRAV
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   GOTO      ST41
     C                   ELSE
     C                   EXSR      HENT
     C     *IN27         IFEQ      *ON
     C     WSNR          ANDEQ     '1'
     C                   GOTO      SLUTT
     C                   ENDIF
     C   98              GOTO      START3
     C                   END
     C*
     C*** SLETT LANDKODE
     C     WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KEYPF         CHAIN     TRAPRAV                            33
     C  N33              DELETE    TRAPRAVR
     C                   EXSR      MOVB1
     C                   MOVEL     '*DLT'        TGUSR
     C                   END
     C                   UPDATE    SUBFIL
     C                   GOTO      START3
     C                   END
     C*
     C*** LAGE/ENDRE LANDKODE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(68)
     C                   SETOFF                                       30
      *søk transportør
     C     *in04         IFEQ      '1'
     C                   CALL      'SYTR04A'
     C                   PARM                    WSTRAN
     C                   GOTO      START5
     C                   END
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      START5
     C                   GOTO      START3
     C*
     C*** SØK FRA transportør
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
      *transportør
s01  C*    KEYTRW        CHAIN     TRAN                               71
n01  C     KEYTRW        CHAIN     LEVEL01                            71
s01  C*  71              MOVE      'SPT0133'     MSGNR
N01  C   71              MOVE      'SPL0029'     MSGNR
     C   71              SETON                                        30
     C   71              GOTO      SLTB
     C                   END
     C*
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KEYWS         CHAIN     TRAPRAV                            33
     C                   EXSR      MOVWLK
     C  N33              UPDATE    TRAPRAVR
     C   33              WRITE     TRAPRAVR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C     KLKNV4        COMP      '*DLT'                                 98
     C   98              GOTO      SLHENT
     C                   EXSR      MOVLKW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     KLKNV4        COMP      '*DLT'                                 98
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVEA     *ZEROS        TRV
     C                   MOVEA     *ZEROS        TRP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       WSTRAN
     C                   MOVEA     *ZEROS        WSV
     C                   MOVEA     *ZEROS        WSP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVLKW        BEGSR
     C***********************************************
     C                   MOVE      TRTRAN        WSTRAN
     C                   MOVEA     TRV           WSV
     C                   MOVEA     TRP           WSP
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWLK        BEGSR
     C***********************************************
     C   33              DO
     C                   MOVE      WSTRAN        TRTRAN
     C                   END
     C*
     C                   MOVEA     WSV           TRV
     C                   MOVEA     WSP           TRP
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
      *
     C     KEYWS         KLIST
     C                   KFLD                    WSTRAN
     C     KEYW2         KLIST
     C                   KFLD                    W2TRAN
     C     KEYPF         KLIST
     C                   KFLD                    TRTRAN
     C     KEYRO         KLIST
     C                   KFLD                    YTRAN
     C*
     c                   read      firm
     C     KEYTRf        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    trtran
     C     KEYTRW        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    WStran
     C                   MOVEA     *ZEROS        TRV
     C                   MOVEA     *ZEROS        TRP
     C                   MOVEA     *ZEROS        WSV
     C                   MOVEA     *ZEROS        WSP
     C                   ENDSR
     C*
