      *
      **************************************************************
      *** PROGRAM SKAL KONVARTERE PRISTABELL (LINJEGODS)         ***
      ***       HENTE TRANSPORTØRSNR. OG POSTNR. TIL FRASTED     ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 05-26                         ***
      *** LEDIGE INDIKATORER 27-32 35-96                         ***
      **************************************************************
      *
     FSTED2     IF   E           K DISK
     FTRAN      IF   E           K DISK
     FSYFB12D   CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  USD                    1      5
     D  USD2                   1      4
     D                UDS
     D  UFIRM                  1      2
      *
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKNT
     C     *ENTRY        PLIST
     C                   PARM                    UKNT              8 0
     C                   PARM                    UPNF              4
     C                   PARM                    UIN01             1
     C                   MOVE      '0'           UIN01
      *
     C     START         TAG                                                                --I
     C                   EXFMT     BILDE                                                    --I
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT                                                    --I
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C**** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *                                                                  I
     C     TRANK         CHAIN     TRAN                               99                      I
     C   99              GOTO      START                                                      I
     C                   MOVEL     WSPNF         XPNF              5
     C     XPNF          CHAIN     STED2                              98                      I
     C   98              GOTO      START                                                      I
      *                                                                  I
     C                   MOVE      WSKNT         UKNT                                         I
     C                   MOVE      WSPNF         UPNF                                         I
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   SELECT
     C     LINNBR        WHENEQ    5
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     47
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK
      *
     C     LINNBR        WHENEQ    7
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     43
     C                   MOVEL     WSPNF         USD               5
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    USD
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   SETOFF                                       33
     C                   TESTN                   USD2                 33
     C   33              MOVE      USD2          WSPNF
     C                   GOTO      SLSØK
      *
     C                   ENDSL
     C*
     C                   SETON                                        97
     C*
     C     SLSØK         ENDSR
     C*
