     FFRTABTG   IP   E           K DISK
     FLISTE     O    F  132        PRINTER OFLIND(*INOF)
     D                 DS
     D  TGPR1                  1    240
     D  TGPR2                241    480
     D  PR                     1    480  0
     D                                     DIM(120)
      *
     C  N99              SETON                                        OF
     C  N99              SETON                                        99
     C   OF              EXCEPT    HEAD
     C   OF              SETOFF                                       OF
     C     PR(7)         COMP      *ZEROS                                 50    ENKOLLO
     C                   EXCEPT    DET
      *
     OLISTE     E            HEAD             02
     O                                            5 'SONE'
     O                                         +001 'VG 1'
     O                                         +001 'VG 2'
     O                                         +001 'VG 3'
     O                                         +001 'VG 4'
     O                                         +001 'VG 5'
     O                                         +001 'VG 6'
     O              N50                        +001 'VG 7'
     O              N50                        +001 'VG 8'
     O              N50                        +001 'VG 9'
     O              N50                        +001 'VG10'
     O              N50                        +001 'VG11'
     O              N50                        +001 'VG12'
     O              N50                        +001 'VG13'
     O              N50                        +001 'VG14'
     O              N50                        +001 'VG15'
     O              N50                        +001 'VG16'
     O              N50                        +001 'VG17'
     O              N50                        +001 'VG18'
     O              N50                        +001 'VG19'
     O              N50                        +001 'VG20'
     OLISTE     E            HEAD             04
     O              N50                          10 'VG21'
     O              N50                        +001 'VG22'
     O              N50                        +001 'VG23'
     O              N50                        +001 'VG24'
     O              N50                        +001 'VG25'
     O              N50                        +001 'VG26'
     O              N50                        +001 'VG27'
     O              N50                        +001 'VG28'
     O              N50                        +001 'VG29'
     O              N50                        +001 'VG30'
     O              N50                        +001 'VG31'
     O              N50                        +001 'VG32'
     O              N50                        +001 'VG33'
     O              N50                        +001 'VG34'
     O              N50                        +001 'VG35'
     O              N50                        +001 'VG36'
     O              N50                        +001 'VG37'
     O              N50                        +001 'VG38'
     O              N50                        +001 'VG39'
     O              N50                        +001 'VG40'
     OLISTE     E            HEAD             05
     O              N50                           5 ' '
     O              N50                        +001 'OSV.:(41-60/61-80/81-100'
     O              N50                        +001 '/101-120)'
     OLISTE     E            DET         1  1
     O                       TGSONE               5
     O                       PR(1)             +001
     O                       PR(2)             +001
     O                       PR(3)             +001
     O                       PR(4)             +001
     O                       PR(5)             +001
     O                       PR(6)             +001
     O              N50      PR(7)             +001
     O              N50      PR(8)             +001
     O              N50      PR(9)             +001
     O              N50      PR(10)            +001
     O              N50      PR(11)            +001
     O              N50      PR(12)            +001
     O              N50      PR(13)            +001
     O              N50      PR(14)            +001
     O              N50      PR(15)            +001
     O              N50      PR(16)            +001
     O              N50      PR(17)            +001
     O              N50      PR(18)            +001
     O              N50      PR(19)            +001
     O              N50      PR(20)            +001
     OLISTE     E            DET            1
     O              N50      PR(21)              10
     O              N50      PR(22)            +001
     O              N50      PR(23)            +001
     O              N50      PR(24)            +001
     O              N50      PR(25)            +001
     O              N50      PR(26)            +001
     O              N50      PR(27)            +001
     O              N50      PR(28)            +001
     O              N50      PR(29)            +001
     O              N50      PR(30)            +001
     O              N50      PR(31)            +001
     O              N50      PR(32)            +001
     O              N50      PR(33)            +001
     O              N50      PR(34)            +001
     O              N50      PR(35)            +001
     O              N50      PR(36)            +001
     O              N50      PR(37)            +001
     O              N50      PR(38)            +001
     O              N50      PR(39)            +001
     O              N50      PR(40)            +001
     OLISTE     E            DET            1
     O              N50      PR(41)              10
     O              N50      PR(42)            +001
     O              N50      PR(43)            +001
     O              N50      PR(44)            +001
     O              N50      PR(45)            +001
     O              N50      PR(46)            +001
     O              N50      PR(47)            +001
     O              N50      PR(48)            +001
     O              N50      PR(49)            +001
     O              N50      PR(50)            +001
     O              N50      PR(51)            +001
     O              N50      PR(52)            +001
     O              N50      PR(53)            +001
     O              N50      PR(54)            +001
     O              N50      PR(55)            +001
     O              N50      PR(56)            +001
     O              N50      PR(57)            +001
     O              N50      PR(58)            +001
     O              N50      PR(59)            +001
     O              N50      PR(60)            +001
     OLISTE     E            DET            1
     O              N50      PR(61)              10
     O              N50      PR(62)            +001
     O              N50      PR(63)            +001
     O              N50      PR(64)            +001
     O              N50      PR(65)            +001
     O              N50      PR(66)            +001
     O              N50      PR(67)            +001
     O              N50      PR(68)            +001
     O              N50      PR(69)            +001
     O              N50      PR(70)            +001
     O              N50      PR(71)            +001
     O              N50      PR(72)            +001
     O              N50      PR(73)            +001
     O              N50      PR(74)            +001
     O              N50      PR(75)            +001
     O              N50      PR(76)            +001
     O              N50      PR(77)            +001
     O              N50      PR(78)            +001
     O              N50      PR(79)            +001
     O              N50      PR(80)            +001
     OLISTE     E            DET            1
     O              N50      PR(81)              10
     O              N50      PR(82)            +001
     O              N50      PR(83)            +001
     O              N50      PR(84)            +001
     O              N50      PR(85)            +001
     O              N50      PR(86)            +001
     O              N50      PR(87)            +001
     O              N50      PR(88)            +001
     O              N50      PR(89)            +001
     O              N50      PR(90)            +001
     O              N50      PR(91)            +001
     O              N50      PR(92)            +001
     O              N50      PR(93)            +001
     O              N50      PR(94)            +001
     O              N50      PR(95)            +001
     O              N50      PR(96)            +001
     O              N50      PR(97)            +001
     O              N50      PR(98)            +001
     O              N50      PR(99)            +001
     O              N50      PR(100)           +001
     OLISTE     E            DET            1
     O              N50      PR(101)             10
     O              N50      PR(102)           +001
     O              N50      PR(103)           +001
     O              N50      PR(104)           +001
     O              N50      PR(105)           +001
     O              N50      PR(106)           +001
     O              N50      PR(107)           +001
     O              N50      PR(108)           +001
     O              N50      PR(109)           +001
     O              N50      PR(110)           +001
     O              N50      PR(111)           +001
     O              N50      PR(112)           +001
     O              N50      PR(113)           +001
     O              N50      PR(114)           +001
     O              N50      PR(115)           +001
     O              N50      PR(116)           +001
     O              N50      PR(117)           +001
     O              N50      PR(118)           +001
     O              N50      PR(119)           +001
     O              N50      PR(120)           +001
