      *
      **************************************************************
      *** PROGRAM SKAL ARBEIDE MED BRUKER-ID OG PASSORD          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 0102 05-26                          ***
      *** LEDIGE INDIKATORER 27-32 35-96                         ***
      **************************************************************
      *
     FFRSTTG    UF A E           K DISK
     FTRAN      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYFB11DA  CF   E             WORKSTN
     D                 DS
     D  TGNA                   1     25
     D  TGNA1                  1      8
     D  TGNA2                 16     25
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVEA     '000'         *IN(97)
     C   03              GOTO      SLUTT
      **** SØKE
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START
     C                   END
      *
     C     TRANK         CHAIN     TRAN                               99
     C   99              GOTO      START
     C     WSBRID        COMP      *BLANKS                                98
     C   98              GOTO      START
     C     WSPORD        COMP      *BLANKS                                97
     C   97              GOTO      START
      *
     C     STTGKK        CHAIN     FRSTTG                             33
     C                   MOVE      *ZEROS        TGPNF
     C                   MOVE      '9999'        TGPNT
     C                   MOVE      WSKNT         TGNA1
     C                   MOVE      WSPORD        TGNA2
     C                   MOVE      WSBRID        TGEK
     C   33              WRITE     FRSTTGR
     C  N33              UPDATE    FRSTTGR
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   SELECT
     C     LINNBR        WHENEQ    5
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     47
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK
      *
     C                   ENDSL
      *
     C     SLSØK         ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNT
     C     STTGKK        KLIST
     C                   KFLD                    YPNF
     C                   KFLD                    YPNT
      *
     C                   MOVE      *ZEROS        YPNF              4
     C                   MOVE      '9999'        YPNT              4
     C                   MOVE      *BLANKS       TGNA
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C     STTGKK        CHAIN     FRSTTG                             33
     C                   IF        *IN33 = *OFF
     C                   MOVE      TGNA1         WSKNT
     C                   EVAL      WSPORD = TGNA2
     C                   EVAL      WSBRID = TGEK
     C                   END
      *
     C                   ENDSR
      *
