      *
      ************************************************************
      *** PROGRAM SKAL HENTE PRINTERTYPE                       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01-26                             ***
      *** LEDIGE INDIKATORER 27-98                             ***
      ************************************************************
     FKODTH     IF   E           K DISK
     D                UDS
     D  UAVD                  15     18  0
     I*
     C*
     C     KODTHK        KLIST
     C                   KFLD                    WSHUNI
     C                   KFLD                    UAVD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN03             1
     C                   PARM                    UIN04             1
     C*
     C                   MOVE      'H'           WSHUNI            1
     C     KODTHK        CHAIN     KODTH                              99
     C     KOHLS3        IFEQ      'L'                                                      TÅENDE')
     C                   MOVE      '0'           UIN03
     C                   ELSE
     C                   MOVE      '1'           UIN03
     C                   END
     C     KOH423        IFEQ      'J'
     C                   MOVE      '1'           UIN04
     C                   ELSE
     C                   MOVE      '0'           UIN04
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
