      *
      ***********************************************************
      *** PROGRAM SKAL SØKE FRITEKSTER                        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 07-11 13-24
      *** LEDIGE INDIKATORER 31 32 34-90 96-97
      ***********************************************************
      *
     FKODTFT    IF   E           K DISK
     FKODTFTLF  IF   E           K DISK
     F                                     RENAME(KODTFTR:KODTFTRL)
     FSYFI10FI  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   Z-ADD     *ZEROS        XRECNO            5 0
     C                   MOVE      *BLANKS       XFTTYP            2
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27W2KOD         SETLL     KODTFT
     C   27W2SØK         SETLL     KODTFTLF
     C  N27              READ      KODTFT                                 94
     C   27              READ      KODTFTLF                               94
      *
     C     START2        TAG
     C                   MOVE      *ZEROS        XN                3 0
      *
     C  N94              DO
     C     XN            DOWLT     10
     C  N27KFTTYP        COMP      XFTTYP                                 95
     C   27              MOVE      '0'           *IN95
     C                   ADD       1             ZRECNO
     C                   ADD       1             XN
     C                   WRITE     SUBFIL
     C     *IN27         IFEQ      '1'
     C                   MOVE      '1'           *IN95
     C     KFT02K        CHAIN     KODTFT                             33
     C  N33              ADD       1             ZRECNO
     C  N33              ADD       1             XN
     C  N33              WRITE     SUBFIL
     C     KFT03K        CHAIN     KODTFT                             33
     C  N33              ADD       1             ZRECNO
     C  N33              ADD       1             XN
     C  N33              WRITE     SUBFIL
     C     KFT04K        CHAIN     KODTFT                             33
     C  N33              ADD       1             ZRECNO
     C  N33              ADD       1             XN
     C  N33              WRITE     SUBFIL
     C                   END
     C                   MOVE      KFTTYP        XFTTYP
     C  N27              READ      KODTFT                                 94
     C   27              READ      KODTFTLF                               94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C   27ZRECNO        IFGT      0
     C     ZRECNO        IFLT      10
     C                   Z-ADD     1             ZRECNO
     C                   Z-ADD     1             XRECNO
     C                   ELSE
     C                   DIV       10            ZRECNO
     C                   MULT      10            ZRECNO
     C     ZRECNO        IFEQ      XRECNO
     C     ZRECNO        ANDLT     YRECNO
     C                   ADD       1             ZRECNO
     C                   END
     C                   END
     C                   END
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     5             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C*
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYFA25'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD               2
     C                   GOTO      START
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2KOD         ANDNE     *BLANKS
     C                   MOVE      W2KOD         UKOD
     C                   GOTO      SLUTT
     C                   END
     C     W2KOD         IFNE      *BLANKS
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      KFTTYP        UKOD
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   END
     C*
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KFT02K        KLIST
     C                   KFLD                    KFTTYP
     C                   KFLD                    YFT02             1 0
     C                   Z-ADD     2             YFT02
     C     KFT03K        KLIST
     C                   KFLD                    KFTTYP
     C                   KFLD                    YFT03             1 0
     C                   Z-ADD     3             YFT03
     C     KFT04K        KLIST
     C                   KFLD                    KFTTYP
     C                   KFLD                    YFT04             1 0
     C                   Z-ADD     4             YFT04
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKOD              2
      *
     C                   WRITE     WINDOWSZ
     C*
     C                   ENDSR
     C*
