      *
      ***********************************************************
      *** PROGRAM SKAL KONVERTERE CURSORLOKASJON              ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26                            ***
      *** LEDIGE INDIKATORER 27-32 34-99                      ***
      ***********************************************************
      *
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UCURS1            1
     C                   PARM                    UCURS2            1
     C                   PARM                    URECN1            1
     C                   PARM                    URECN2            1
     C                   PARM                    ULINNR            3 0
     C                   PARM                    UPOSNR            3 0
     C                   PARM                    URECNO            4 0
     C*
     C                   Z-ADD     0             ULINNR
     C                   Z-ADD     0             UPOSNR
     C                   Z-ADD     0             URECNO
     C                   TESTB     '3'           UCURS1                   33
     C   33              ADD       16            ULINNR
     C                   TESTB     '4'           UCURS1                   33
     C   33              ADD       8             ULINNR
     C                   TESTB     '5'           UCURS1                   33
     C   33              ADD       4             ULINNR
     C                   TESTB     '6'           UCURS1                   33
     C   33              ADD       2             ULINNR
     C                   TESTB     '7'           UCURS1                   33
     C   33              ADD       1             ULINNR
     C*
     C                   TESTB     '1'           UCURS2                   33
     C   33              ADD       64            UPOSNR
     C                   TESTB     '2'           UCURS2                   33
     C   33              ADD       32            UPOSNR
     C                   TESTB     '3'           UCURS2                   33
     C   33              ADD       16            UPOSNR
     C                   TESTB     '4'           UCURS2                   33
     C   33              ADD       8             UPOSNR
     C                   TESTB     '5'           UCURS2                   33
     C   33              ADD       4             UPOSNR
     C                   TESTB     '6'           UCURS2                   33
     C   33              ADD       2             UPOSNR
     C                   TESTB     '7'           UCURS2                   33
     C   33              ADD       1             UPOSNR
     C*
     C                   TESTB     '3'           URECN1                   33
     C   33              ADD       4096          URECNO
     C                   TESTB     '4'           URECN1                   33
     C   33              ADD       2048          URECNO
     C                   TESTB     '5'           URECN1                   33
     C   33              ADD       1024          URECNO
     C                   TESTB     '6'           URECN1                   33
     C   33              ADD       512           URECNO
     C                   TESTB     '7'           URECN1                   33
     C   33              ADD       256           URECNO
     C                   TESTB     '0'           URECN2                   33
     C   33              ADD       128           URECNO
     C                   TESTB     '1'           URECN2                   33
     C   33              ADD       64            URECNO
     C                   TESTB     '2'           URECN2                   33
     C   33              ADD       32            URECNO
     C                   TESTB     '3'           URECN2                   33
     C   33              ADD       16            URECNO
     C                   TESTB     '4'           URECN2                   33
     C   33              ADD       8             URECNO
     C                   TESTB     '5'           URECN2                   33
     C   33              ADD       4             URECNO
     C                   TESTB     '6'           URECN2                   33
     C   33              ADD       2             URECNO
     C                   TESTB     '7'           URECN2                   33
     C   33              ADD       1             URECNO
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
