********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF10 feil i datstruktur til faktura i batch
10XXX * 02 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
10XXX * 03 JOV PTF10 HENT KUNDEINFO ETTER SØK (EXSR TESTKU)
10XXX * 04 YBC PTF10 IKKE BLANKE NAVN VED SØKING AV KUNDENR
10XXX * 05 JOV PTF10 Søk på "gamlemåten"(alle 8 nr)dersom cursor i pos 2-8
10XXX * 06 SH  PTF10 innført viderefrakt til forfrakt fra
10166 * 07 JOV PTF10 Kall på FR-till-prog også ved blank av geb/sats (før kun ved ny..)
10172 * 08 SH  PTF10 norsk text til Track and trace
10166 * 09 JOV PTF10 rettelse til ptf 7                                ør kun ved ny..)
10268 * 10 CB  PTF10 Duplikatkontroll på Agentreferanse (AWB-nr)
10XXX * 11 JOV PTF10 Nye parametre SYIN10B
11004 * 12 SH  PTF11 Vareverdi faklt ut
10XXX * 13 SH  PTF11 sette tilbake status
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11132 * 14 YBC PTF11 3 DESIMALER PÅ KALKULATOR
11132 * 15 SH  PTF11 F17 se arkiverte dokument
11132 * 16 SH  PTF11 tatt bort F20/f21   rått
********************************************************************
      *
      *****************************************************************
      *** PROGRAM FOR AIRFREIGHT IMPORT                             ***
      *** INDICATORS  01 - 26 IS FUNCTIONKEYS                       ***
      *** FREE INDICATORS    01 02 06 08 10 11 13 17 22 23 25 26    ***
      ***                    35-53
      *** INDICATORS         31 32 34 ON MEANS CALL FROM SYFF10     ***
      *****************************************************************
      *
     FTRACKF    O  A E           K DISK
     FTRACKT    O  A E           K DISK
     FSTATVF    O  A E           K DISK
     FHEADF     UF A E           K DISK
     FHEDUMMY   IF   E           K DISK
     F                                     RENAME(HEADFR:HEAD2R)
     FDOKUF     UF A E           K DISK
     FOAVT      IF   E           K DISK
     FDOKUT     UF A E           K DISK
     FMULTKODT  IF   E           K DISK
     FKODTS2    IF   E           K DISK
     FVALUL01   IF   E           K DISK
     FKODTS4    IF   E           K DISK
     FFIRM      IF   E           K DISK
S06  F*TED2     IF   E           K DISK
     FSTED2D    IF A E           K DISK
N06  FSTEDIL01  IF   E           K DISK
     FFRATXT    IF   E           K DISK
     FTELL      UF   E           K DISK
     FVADR      IF   E           K DISK
     FVADR3     IF   E           K DISK
     F                                     RENAME(VADRR:VADRR3)
     FCUNDL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FFREETXT   IF   E           K DISK
     FKODTU     IF   E           K DISK
     FKOFAST    IF   E           K DISK
     FKUFAST    IF   E           K DISK
     F                                     RENAME(KOFASTR:KUFASTR)
     FUTLLOGF   IF A E           K DISK
     FCUOTI     IF   E           K DISK
     FFRISOK    UF A E           K DISK
     FKODFRI    IF   E           K DISK
     FGODSFI    IF   E           K DISK
     FENADSF    IF   E           K DISK
     FKUNKO2    IF   E           K DISK
     FSYFI10FM  CF   E             WORKSTN USROPN
     F                                     INFDS(FBAREA)
     D HØ              S              3  2 DIM(12)
     D LE              S              3  2 DIM(12)
     D BR              S              3  2 DIM(12)
     D AN              S              3  0 DIM(12)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
N06  D                 DS
N06  D  WSVALP                 1      3  1
N06  D  XVALP                  1      3  3
     D                 DS
     D  WSMSG                  1     62
     D  XKN                    7     14
     D  XLIKOD                31     31
     D  XLINAV                33     62
     D                 DS
     D  WSSDL                  1     20
     D  WSSDL1                 1      1
     D  WSSDL2                 2     20
     D                 DS
     D  WSGN                   1     15
     D  WSGNAR                 1      4
     D  WSGNBE                 5      9
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  ENGAD3                 1     30
     D  SYPOGE                 1      9
     D  ADR3                  11     34
     D                 DS
     D  QDATA                  1    109
     D  QDA01                  1      2
     D  QDA02                  3      6
     D  QDA03                  7     13
s01  D* QDA04                 14     14
n01  D  QDA04                 14     15
     D  QDA05                 16     16
     D  QDA06                 17     20
     D  QDA07                 21     24
     D  QDA08                 25     26
     D  QDA09                 27     28
     D  QDA10                 29     29
     D  QDA11                 30     30
     D  QDA12                 31     37
     D  QDA13                 38     38
     D  QDA14                 39    100
     D  QDA15                101    101
     D  QDA16                102    102
     D  QDA17                103    103
     D  QDA18                104    109
     D                 DS
     D  WSFT1                  1     51
     D  WSFT1A                 1     30
     D  WSFT1B                31     45
     D                 DS
     D  HEFT1                  1     51
     D  HEFT1A                 1     30
     D  HEFT1B                31     45
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  WSNAK                  1     30
     D  WSSTJ1                 1      1
     D  WSKURE                 2     18
     D                 DS
     D SKTXT1          C                   CONST('Op.giver')
     D LDADS          UDS
     D  UUSR                 301    310
     D  DSTINF               801    872
      *
     C                   OPEN      SYFI10FM
     C                   EXSR      INIT
     C                   GOTO      START1
     C*
     C     START         TAG
     C  N30              DO
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       279998
     C                   END
     C     STB1A         TAG
     C                   EXFMT     BILDE01
     C     UDUMMY        IFEQ      'J'
     C   12              GOTO      SLUTT
     C                   MOVE      *ZEROS        WSOPD
     C                   EXSR      TESTB1
     C                   MOVE      *ZEROS        WSDT
     C                   SETOFF                                       30
     C                   GOTO      ST21
     C                   END
     C                   SETOFF                                       30
     C                   MOVEA     '0000'        *IN(96)
     C                   MOVE      *BLANKS       WSMSG
     C*
     C   07              DO
     C                   EXSR      GETOPD
     C     UAVDE         IFEQ      0
     C     UOPDE         OREQ      0
     C                   GOTO      STB1A
     C                   END
     C                   END
     C   12              GOTO      SLUTT
     C     START1        TAG
     C                   EXSR      TESTB1
      *
      * Det kalles på TDV01R i CALTDV som lager oppdraget og legger
      * oppdragsnummeret i skjermbildefeltet WSOPD og fortsetter på
      * normal måte
     C     *IN20         IFEQ      '1'
     C     WSOPD         ANDEQ     *ZEROS
     C     *IN30         CABEQ     '1'           START
     C                   Z-ADD     *ZEROS        WSOPD
     C                   EXSR      CALTDV
     C                   MOVE      *OFF          *IN20
     C     WSOPD         CABEQ     *ZEROS        START
     C                   EXSR      TESTB1
     C                   ENDIF                                                  <*IN20
      *
     C*
     C   30UTYPE         IFEQ      'CR2'
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C     MSGNR         IFNE      'YBC0036'
     C                   MOVE      'DIV0000'     MSGNR
     C                   END
     C*
     C*** UTYPE = 'CHF/CHO' CALL  FROM SYFF10 (CHANGE INVOICE)
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      TESTB2
     C                   GOTO      START3                                       TIL FAKTURA
     C                   END
     C*
     C   05              DO
     C                   EXSR      TESTB2
     C                   GOTO      START3                                       TIL FAKTURA
     C                   END
     C*
     C                   MOVEA     '000'         *IN(75)
     C                   MOVEA     '0'           *IN(56)
     C     START2        TAG
     C   16              DO
     C                   EXSR      MOVB1
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       5763
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     49            POSNBR
     C                   MOVE      'NY'          XNYGML            2
     C                   END
     C  N30
     CANN16              Z-ADD     2             LINNBR
     C  N30
     CANN16              Z-ADD     8             POSNBR
     C*
     C     ST21          TAG
     C*
     C                   EXSR      TSTOPL
     C*
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE02
     C                   EXSR      KDTFMT
     C     UDUMMY        IFEQ      'J'
     C                   EXSR      OPDHEA
     C                   GOTO      SLUTT
     C                   END
     C                   SETOFF                                       30
     C                   MOVEA     '00000000'    *IN(90)
     C                   MOVEA     '00000000'    *IN(82)
     C                   MOVEA     '0000'        *IN(78)
     C                   MOVEA     '00000000'    *IN(63)
     C                   MOVEA     '0'           *IN(71)
     C                   MOVEA     '00'          *IN(73)
     C                   MOVEA     '0000'        *IN(59)
N06  C                   MOVEA     '0'           *IN(54)
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C   24              DO
     C                   EXSR      UTCMDL
     C                   GOTO      ST21
     C                   END
     C*
     C*
     C* 06 = BEREGN KUBIKK
     C   06              DO
     C                   EXSR      KUBIKK
     C                   GOTO      ST21
     C                   END
     C*
     C   07              DO
     C                   MOVE      'S'           UTYPE2
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   GOTO      ST21
     C                   END
     C*
     C* 17 = arkiv
     C*
N15  C   17              DO
N15  C     WSOPD         IFEQ      *ZEROS
N15  C                   MOVE      'SHU1678'     MSGNR
N15  C                   SETON                                        30
N15  C                   GOTO      ST21
N15  C                   END
N15  C                   CALL      'ARC003'
N15  C                   PARM                    WSAVD
N15  C                   PARM                    WSOPD
N15  C                   PARM                    WSRUNDE          10
     C                   GOTO      ST21
     C                   END
     C* FREETEXT
     C   18              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SPO0106'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      VISFRE
     C                   GOTO      ST21
     C                   END
     C* FRI SØKEVEI
     C                   EXSR      TESTKT
     C   15              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0126'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   GOTO      ST21
     C                   END
     C* DUPOPPDRAG INNHENT/UTKJØRING
     C   11              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'JOV0802'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      OPDHEA
     C                   Move      'J'           XXVIS             1
     C                   CALL      'SYTR11'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XXFBNR            3 0
     C                   PARM                    XXVIS
     C                   GOTO      ST21
     C                   END
     C* SEARCH CUSTOMER
     C   04              DO
     C                   EXSR      SØKDTA
     C   30              GOTO      ST21
     C     UFLAGG        IFEQ      1
     C                   GOTO      ST21
     C                   END
     C     UTYPE         IFEQ      'CHO'
     C*** UTYPE = 'CHF/CHO' CALL FROM SYFF10 (CHANGE ORDER)
     C                   GOTO      ST21
     C                   END
     C                   END
     C*FINNE KUNDENS KUNDENUMMER
     C     WSSTJ1        IFEQ      '*'
     C                   EXSR      SOKUKU
     C                   GOTO      ST21
     C                   END
     C   09              DO
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C  N33              MOVE      TETURN        WSPRO
     C  N33              ADD       1             TETURN
     C  N33              UPDATE    TELLR
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     19            POSNBR
     C                   GOTO      ST21
     C                   END
     C   12              DO
     C     HEADFK        CHAIN     HEADF                              33
S13  C* N33              MOVE      ' '           HEST
N13  C  N33              MOVE      GMST          HEST
     C  N33              UPDATE    HEADFR
     C                   GOTO      SLUTT
     C                   END
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      ST21
     C                   END
     C*
     C                   EXSR      TESTB2
     C   30              GOTO      ST21
N10   * Duplikatkontroll Agentreferanse (AWB-nr)
N10  C     WSRFA         IFNE      *BLANKS
N10  C     WSRFA         IFNE      WSRFAN
N10  C                   EXSR      DUPCTL
N10  C     WSJNAW        IFEQ      'N'
N10  C                   GOTO      ST21
N10  C                   ENDIF
N10  C                   ELSE
N10   * Vil ikke beholde verdi
N10  C     WSJNAW        IFEQ      'N'
N10  C                   EXSR      DUPCTL
N10  C     WSJNAW        IFEQ      'N'
N10  C                   GOTO      ST21
N10  C                   ENDIF
N10  C                   ENDIF
N10  C                   ENDIF
N10  C                   ENDIF
     C*
     C* OPDATERER NYE OPPDRAG
     C*
     C     WSOPD         IFEQ      *ZEROS
     C                   EXSR      OPDHEA
     C                   END
     C*
     C*
     C*** UTYPE = 'CHF/CHO' CALL FROM SYFF10 (CHANGE ORDER)
     C  N03
     CANN05
     CANN16UTYPE         IFNE      'CHO'
     C                   GOTO      START2
     C                   END
     C*
     C                   EXSR      OPDHEA
     C*
     C*** UTYPE = 'CHF/CHO' CALL FROM SYFF10 (CHANGE ORDER)
     C     UTYPE         IFEQ      'CHO'
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** CUSTOM-DOKUMENT
     C     WSPK2         IFEQ      'J'
     C     DOKUTK        CHAIN     DOKUT                              33
     C                   EXSR      MOVWDT
     C   33              WRITE     DOKUTR
     C  N33              UPDATE    DOKUTR
     C                   MOVE      *ZEROS        W2TOLL
     C                   END
     C*
     C     WSPK1         IFEQ      'J'
     C     DOKUFK        CHAIN(N)  DOKUF                              33
     C   03
     CAN 33
     COR 16
     CAN 33              EXSR      MOVWDF
     C*
     C*** REGISTRATE TRUCKBILL
     C  N03
     CANN16              EXSR      FRABR
     C   03
     COR 16              GOTO      START3                                       TO INVOICE
     C   12              GOTO      START2                                       TO ORDER
     C                   END
     C*
     C*** INBOUND AIRWAYBILL
     C  N03WSPK5         IFEQ      'J'
     C     WSPK5         OREQ      'S'
     C                   EXSR      EFRABR
     C   12              GOTO      START2
     C                   END
     C*
     C*** INVOICE
     C     START3        TAG
     C     XNYGML        IFEQ      'NY'
     C                   MOVE      ' '           XKODE
     C                   EXSR      FAKTUR
     C                   ELSE
     C   05              EXSR      FAKTUR
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      FAKTUR
     C                   GOTO      SLUTT
     C                   ELSE
     C     HEADFK        CHAIN     HEADF                              33
S13  C* N33              MOVE      ' '           HEST
N13  C  N33              MOVE      GMST          HEST
     C  N33              UPDATE    HEADFR
     C                   END
     C                   END
     C*
     C   03UTYPE         IFEQ      'CR2'
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       2730
     C                   SETOFF                                       0503
     C                   MOVEA     '0000'        *IN(96)
     C                   MOVE      '1'           *IN58
     C                   GOTO      START1
     C                   ELSE
N13  C     HEADFK        CHAIN     HEADF                              33
N13  C  N33              MOVE      GMST          HEST
N13  C  N33              UPDATE    HEADFR
     C                   GOTO      SLUTT
     C                   END
     C   16
     COR 12              GOTO      START2
     C*
     C     SLUTT         TAG
     C                   CLOSE     SYFI10FM
     C                   RETURN
     C*
     C***********************************************
     C     GETOPD        BEGSR
     C***********************************************
     C                   MOVE      'E'           UTYPE2            1
     C                   MOVE      WSAVD         UAVDE             4 0
     C                   MOVE      *ZEROS        UOPDE             7 0
     C                   MOVE      *BLANKS       USGE              3
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    UAVDE
     C                   PARM                    UOPDE
     C                   PARM                    USGE
     C     UAVDE         IFNE      0                                            1<-B
     C     UOPDE         ANDNE     0
     C     UTYPE2        IFEQ      'E'                                           2<-B
     C                   MOVE      UAVDE         WSAVD
     C                   MOVE      UOPDE         WSOPD
     C                   MOVE      USGE          WSSG
     C                   ELSE                                                    2
     C                   MOVE      UAVDE         HEAVD
     C                   MOVE      UOPDE         HEOPD
     C     WSSG          IFEQ      *BLANKS                                        3<-B
     C                   MOVE      USGE          WSSG
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
N13  C                   MOVE      ' '           GMST              1
     C                   MOVE      'N'           VIADUMMY          1
     C                   MOVE      'DIV0000'     MSGNR
     C     WSOPD         IFGT      0
     C     HEOPD         IFGT      0
     C     HEAVD         ORGT      0
     C                   MOVE      'SPO0015'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      SLT1
     C                   END
     C                   END
      * 28 ON = KOPI AV OPPDRAG
     C     HEOPD         COMP      0                                  28
     C  N28HEAVD         COMP      0                                  28
     C*
     C**** TEST SIGNATURE
     C     XKODE         IFEQ      'Z'
     C                   MOVE      'NY'          XNYGML
     C                   ELSE
     C                   MOVE      'GM'          XNYGML
     C                   END
     C     KODSFK        CHAIN     KOSFR                              99
     C   99              MOVE      'SPS0011'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      SLT1
     C*
     C*** TEST DEPARTMENT
     C     KODTAK        CHAIN     KOAR                               98
N06  C     KOAPOS        COMP      'J'                                    53
     C  N98KODTVK        CHAIN     KOVR                               98
     C  N98              DO
     C     WSAVD         CHAIN(N)  TELL                               98
     C   98AVDZER        CHAIN(N)  TELL                               98
     C                   END
     C   98              MOVE      'SPA0006'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      SLT1
     C* KUN EKSPORT PÅ DENNE AVDELING?
     C     KOAIE         COMP      'E'                                    98
     C   98              MOVE      'JOV0076'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      SLT1
     C*
     C*** TEST ORDERNUMBER
     C  N28              DO
     C     WSOPD         COMP      *ZEROS                                 33
     C   33
     CAN 05              SETON                                        97
     C  N33HEADFK        CHAIN     HEADF                              97
N13  C  N97
N13  CANN33              MOVE      HEST          GMST
     C   97              MOVE      'SPO0002'     MSGNR
     C   97              SETON                                        30
     C   97              GOTO      SLT1
     C  N33
     CANN09HESG          IFEQ      'DUP'
     C                   MOVE      USG           HESG
     C                   MOVE      USG           WSSG
     C                   END
     C  N33
     CANN09WSSG          IFNE      HESG
     C                   MOVE      HESG          WSSG
     C                   MOVE      'YBC0036'     MSGNR
     C                   END
     C  N33
     CANN99HEST          COMP      ' '                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'C'                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'U'                                9797
     C  N33
     CANN97
     CANN99HEUR          IFNE      'C'
     C     HEUR          IFNE      'A'
     C                   SETON                                        97
     C                   END
     C                   END
     C   97              MOVE      'SPO0006'     MSGNR
     C   99              MOVE      'SPS0014'     MSGNR
     C   97
     COR 99              SETON                                        30
     C   30              UPDATE    HEADFR
     C   30              MOVE      *ZEROS        HEAVD
     C   30              MOVE      *ZEROS        HEOPD
     C   97
     COR 99              GOTO      SLT1
     C   33              MOVE      KOABÆR        WSSTD
     C                   END
     C*
     C*** TEST DEPARTMENT/ORDERNUMBER FOR COPYFUNCTION
     C*
     C   28              DO
     C     HEADKK        CHAIN(N)  HEADF                              33
     C  N33              MOVE      KOABÆR        WSSTD
     C   33              SETON                                        9630
     C   96              MOVE      'SPA0007'     MSGNR
     C* DIRECT TO INVOICE NOT ALLOWED
     C   05              MOVE      'SPO0029'     MSGNR
     C   05              SETON                                        9630
     C   96              GOTO      SLT1
     C   28              MOVE      *ZEROS        WSOPD
     C                   END
     C*
     C  N33
     CANN28              DO
     C                   MOVE      'X'           HEST
     C   09              MOVE      WSSG          HESG
     C                   UPDATE    HEADFR
     C                   END
     C*
     C     WSOPD         IFEQ      0
     C                   MOVE      'NY'          XNYGML
     C  N28              MOVE      'N'           VIADUMMY
     C  N28HEADFK        CHAIN     HEDUMMY                            33
     C  N28
     CANN33              MOVE      'J'           VIADUMMY
     C  N28
     CANN33              SETON                                        28
     C   28              EXSR      MOVHFW
     C  N28              EXSR      MOVB1
     C                   ELSE
     C                   EXSR      MOVHFW
     C                   END
     C*
     C     SLT1          ENDSR
     C*
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C                   MOVE      'DIV0000'     MSGNR
     C     WSSG          IFEQ      *BLANKS
     C                   MOVE      USG           WSSG
     C                   END
     C     WSAVD         IFEQ      0
     C                   MOVE      UAVD          WSAVD
     C                   ELSE
     C     KODTAK        CHAIN     KOAR                               33
     C  N33KOAIE         COMP      'E'                                    33
     C   33              MOVE      UAVD          WSAVD
     C   33KODTAK        CHAIN     KOAR                               33
     C                   END
     C*
     C*** TEST PROJECTNUMBER
     C     KOVPRO        IFEQ      'J'
     C     WSPRO         COMP      *ZEROS                                 97
     C  N97WSPRO         COMP      TETMIN                               97
     C  N97WSPRO         COMP      TETURN                             97  97
     C   97              SETON                                        30
     C   97              MOVE      'SPT0002'     MSGNR
     C                   END
     C*
     C*** TEST DATE
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTD         UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      96
     C   96
     CANN30              MOVE      'SPD0001'     MSGNR
     C   96              SETON                                        30
     C*
     C*** TEST FROM DESTINATION
     C                   MOVE      *BLANKS       USDFT            18
s06  C*    WSSDF         IFNE      *BLANKS
s06  C*    WSSDF         CHAIN     STED2                              95
s06  C*    WSSDF         CHAIN     STED2                              95
s06  C* N95WSLKA         IFEQ      *BLANKS
s06  C*                  MOVE      ST2LK         WSLKA
s06  C*                  END
s06  C* N95              MOVE      ST2LK         WSLKS
s06  C* N95              MOVEL     ST2NVN        USDFT
s06  C*  95
s06  C*NN30              MOVE      'SPS0012'     MSGNR
s06  C*  95              SETON                                        30
s06  C*                  END
s06  C*
s06  C*** TEST TO DESTINATION
s06  C*                  MOVE      *BLANKS       USDTT            18
s06  C*    WSSDT         IFNE      *BLANKS
s06  C*    WSSDT         CHAIN     STED2                              94
s06  C* N94              MOVE      ST2LK         WSLKK
s06  C* N94              MOVEL     ST2NVN        USDTT
s06  C*  94
s06  C*NN30              MOVE      'SPS0013'     MSGNR
s06  C*  94              SETON                                        30
s06  C*                  END
s06  C*
s06  C*** TEST CONTRYCODE
s06  C*    KODLKK        CHAIN     KODTLKR                            93
s06  C*  93
s06  C*NN30              MOVE      'SPL0001'     MSGNR
s06  C*  93              SETON                                        30
N06  C*** TEST STED TIL
N06  C* IKKE VED POSTNUMMERLOGIKK
N06  C  N53WSSDT         IFNE      *BLANKS
N06  C     WSLKK         IFNE      *BLANKS
N06  C                   MOVE      WSLKK         FIRLK
N06  C                   END
N06  C     WSSDTK        CHAIN     STED2D                             94
N06  C                   END
N06   *
N06   * TEST STED FRA
N06   * IKKE VED POSTNUMMERLOGIKK
N06   *
N06  C  N53WSSDF         IFNE      *BLANKS
N06  C     WSSDFK        CHAIN     STED2D                             95
N06  C  N95WSLKS         IFEQ      '  '
N06  C                   MOVE      WSLKA         WSLKS
N06  C                   END
N06  C                   END
N06  C   95
N06  CANN30              MOVE      'SPS0012'     MSGNR
N06  C   95              SETON                                        30
N06  C   94
N06  CANN30              MOVE      'SPS0013'     MSGNR
N06  C   94              SETON                                        30
N06  C*
N06  C*** TEST TILLEGGS FRAKT
N06  C     WSVALT        IFNE      *BLANKS
N06  C     KODGEK        CHAIN     KOGER                              54
N06  C   54
N06  CANN30              MOVE      'SPV0006'     MSGNR
N06  C   54              SETON                                        30
N06  C                   END
N06  C*
N06  C*** TEST LANDKODE IKKE VED POSTNUMMER-LOGIKK RETTELSE 14
N06  C* IKKE VED POSTNUMMER LOGIKK
N06  C     WSLKA         IFEQ      *BLANKS
N06  C                   MOVE      WSLKS         WSLKA
N06  C                   END
N06  C  N53KODLKK        CHAIN     KODTLKR                            93
N06  C   93
N06  CANN30              MOVE      'SPL0001'     MSGNR
N06  C   93              SETON                                        30
N06  C*
N06  C*
     C*** GETS PLACE TEXT
     C     WSSDL2        IFEQ      *BLANKS
     C     KODTEK        CHAIN     KOTMR                              33
     C  N33              MOVE      KOTMNV        WSSDL
     C                   END
     C*** HENTER GRA GODSNUMMER HVIS BLANK
     C     WSSDL         IFEQ      *BLANKS
     C     KEYLAG        CHAIN     GODSFI                             33
     C  N33              MOVEL     GFLBS1        WSSDL
     C                   END
     C*
     C*** TEST WAY OF TRANSPORT
     C     WSTRM         IFNE      0
     C     KODS4K        CHAIN     KODTS4                             92
     C   92
     CANN30              MOVE      'SPT0003'     MSGNR
     C   92              SETON                                        30
     C                   END
     C*
     C*** TEST CONTRYCODE TRANSPORT
     C     WSTRI         IFNE      *BLANKS
     C     KODS2K        CHAIN     KODTS2                             91
     C   91
     CANN30              MOVE      'SPL0003'     MSGNR
     C   91              SETON                                        30
     C                   END
     C*
     C*** TEST CONTAINER
     C     WSTRC         IFEQ      1
     C     WSTRCN        COMP      *BLANKS                                90
     C   90
     CANN30              MOVE      'SPC0001'     MSGNR
     C   90              SETON                                        30
     C                   END
     C   30              GOTO      SLT2
     C*
     C*** TEST AGENT, TRANSPORTER, SHIPPER CONSIGNEE
     C                   EXSR      TESTKU
     C   30              GOTO      SLT2
N06   *
N06   * HVIS POSTAL FORSØK Å HENTE POSTNR FRA HENTE/LEVADR.
N06   * START POSTNUMMERLOGIKK
N06   *
N06  C     KOAPOS        IFEQ      'J'                                          B1
N06  C* FORFRAKT FRA
N06  C     WSSDFF        IFEQ      *BLANKS                                       B2
N06  C     WSADS3        ANDNE     *BLANKS                                       B2
N06  C                   MOVEL     WSADS3        TESTN5            5
N06  C                   TESTN                   TESTN5               33
N06  C     *IN33         IFEQ      '1'                                            B3
N06  C                   MOVEL     TESTN5        WSSDFF
N06  C                   ELSE                                                     X3
N06  C                   MOVEL     WSADS3        TESTN4            4
N06  C                   TESTN                   TESTN4               33
N06  C     *IN33         IFEQ      '1'                                             B4
N06  C                   MOVEL     TESTN4        WSSDFF
N06  C                   END                                                       E4
N06  C                   END                                                      E3
N06  C                   END                                                     E2
N06  C* VIDEREFRAKT TIL
N06  C     WSSDVT        IFEQ      *BLANKS                                       B2
N06  C     WSADK3        ANDNE     *BLANKS                                       B2
N06  C                   MOVEL     WSADK3        TESTN5            5
N06  C                   TESTN                   TESTN5               33
N06  C     *IN33         IFEQ      '1'                                            B3
N06  C                   MOVEL     TESTN5        WSSDVT
N06  C                   ELSE                                                     X3
N06  C                   MOVEL     WSADK3        TESTN4            4
N06  C                   TESTN                   TESTN4               33
N06  C     *IN33         IFEQ      '1'                                             B4
N06  C                   MOVEL     TESTN4        WSSDVT
N06  C                   END                                                       E4
N06  C                   END                                                      E3
N06  C                   END                                                     E2
N06   * HVIS REN IMP/EKS (ELLER INNLAND) KAN LANDKODE SETTES???
N06  C                   SELECT
N06  C     KOAIE         WHENEQ    'I'
N06  C* IMPORT
N06  C     WSLKS         IFEQ      *BLANKS
N06  C                   MOVE      KOALK         WSLKS
N06  C                   END
N06  C     WSLKK         IFEQ      *BLANKS
N06  C                   MOVE      FILAND        WSLKK
N06  C                   END
N06   *EKSPORT
N06  C     KOAIE         WHENEQ    'E'
N06  C     WSLKS         IFEQ      *BLANKS
N06  C                   MOVE      FILAND        WSLKS
N06  C                   END
N06  C     WSLKK         IFEQ      *BLANKS
N06  C                   MOVE      KOALK         WSLKK
N06  C                   END
N06   *INNLAND
N06  C     KOAIE         WHENEQ    'D'
N06  C     WSLKS         IFEQ      *BLANKS
N06  C                   MOVE      FILAND        WSLKS
N06  C                   END
N06  C     WSLKK         IFEQ      *BLANKS
N06  C                   MOVE      FILAND        WSLKK
N06  C                   END
N06  C                   ENDSL
N06  C*
N06  C                   MOVE      '0'           *IN30
N06  C*
N06  C                   END
N06   *
N06   * SLUTT POSTNUMMERLOGIKK
N06   *
N06  C*** TEST FORFRAKT FRA
N06  C     STFF          TAG
N06  C     WSSDFF        IFNE      *BLANKS
N06  C     *IN53         OREQ      '1'
N06  C     WKSDFF        CHAIN     STED2D                             84
N06  C  N84              MOVE      ST2NVN        WSPNFR
N06  C*AUTOMATISK OPPDATERING
N06  C   84KOAPOS        IFEQ      'J'
N06  C     WKSDFF        SETLL     STEDIL01
N06  C     WSLKS         READE     STEDIL01                               84
N06   * Utenfor gyldige postnrsoner...
N06  C   84
N06  CANN30              MOVE      'SHU0120'     MSGNR
N06  C*
N06  C  N84STINPF        IFLE      WSSDFF
N06  C*
N06   * Innenfor gyldige postnrsoner...
N06  C     WSPNFR        IFNE      *BLANKS
N06   * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
N06  C     WSLKS         IFEQ      GSLKS
N06  C     WSSDFF        ANDEQ     GSSDFF
N06  C                   MOVE      *BLANKS       GSLKS             2
N06  C                   MOVE      *BLANKS       GSSDFF            5
N06  C                   CLEAR                   STED2R
N06  C                   MOVE      WSLKS         ST2LK
N06  C                   MOVE      WSPNFR        ST2NVN
N06  C                   MOVE      WSSDFF        ST2KOD
N06  C                   MOVE      STINBA        ST2KO2
N06  C                   WRITE     STED2R
N06  C                   GOTO      STFF
N06  C                   ELSE
N06  C                   SETON                                        84
N06  C   84
N06  CANN30              MOVE      'JOV1086'     MSGNR
N06  C                   END
N06  C                   ELSE
N06   * Navn ikke gitt - info / invitasjon til å opprette.
N06  C                   SETON                                        84
N06  C   84
N06  CANN30              MOVE      'JOV0079'     MSGNR
N06  C                   END
N06  C                   ELSE
N06   * Utenfor gyldige postnrsoner...
N06  C                   SETON                                        84
N06  C   84
N06  CANN30              MOVE      'SHU0120'     MSGNR
N06  C                   END
N06  C*
N06   * Husk LK/PNR som saksbeh. gis warning om..
N06  C     *IN84         IFEQ      *ON
N06  C     MSGNR         IFEQ      'JOV0079'
N06  C     MSGNR         OREQ      'JOV1086'
N06  C                   MOVE      WSLKS         GSLKS             2
N06  C                   MOVE      WSSDFF        GSSDFF            5
N06  C                   END
N06  C                   END
N06  C                   ELSE
N06  C   84
N06  CANN30              MOVE      'SPS0016'     MSGNR
N06  C                   END
N06  C   84              SETON                                        30
N06  C  N84WSADK3        IFEQ      *BLANKS
N06  C     WSKNS         IFEQ      *ZEROS
N06  C                   MOVE      ST2NVN        WSADS3
N06  C                   END
N06  C                   END
N06  C  N84KOAPOS        IFEQ      'J'
N06  C                   MOVE      ST2KO2        WSSDF
N06  C                   MOVE      ST2LK         WSLKA
N06  C                   END
N06  C                   END
N06  C*
N06  C*** TEST VIDEREFRAKT TIL
N06  C     STVT          TAG
N06  C     WSSDVT        IFNE      *BLANKS
N06  C     *IN53         OREQ      '1'
N06  C     WKSDVT        CHAIN     STED2D                             83
N06  C  N83              MOVE      ST2NVN        WSPNTI
N06  C*AUTOMATISK OPPDATERING
N06  C   83KOAPOS        IFEQ      'J'
N06  C     WKSDVT        SETLL     STEDIL01
N06  C     WSLKK         READE     STEDIL01                               83
N06   * Utenfor gyldige postnrsoner...
N06  C   83
N06  CANN30              MOVE      'SHU0120'     MSGNR
N06  C  N83STINPF        IFLE      WSSDVT
N06   * Innenfor gyldige postnrsoner...
N06  C     WSPNTI        IFNE      *BLANKS
N06   * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
N06  C     WSLKK         IFEQ      GSLKK
N06  C     WSSDVT        ANDEQ     GSSDVT
N06  C                   MOVE      *BLANKS       GSLKK             2
N06  C                   MOVE      *BLANKS       GSSDVT            5
N06  C                   CLEAR                   STED2R
N06  C                   MOVE      WSLKK         ST2LK
N06  C                   MOVE      WSPNTI        ST2NVN
N06  C                   MOVE      WSSDVT        ST2KOD
N06  C                   MOVE      STINBA        ST2KO2
N06  C                   WRITE     STED2R
N06  C                   GOTO      STVT
N06  C                   ELSE
N06  C                   SETON                                        83
N06  C   83
N06  CANN30              MOVE      'JOV1086'     MSGNR
N06  C                   END
N06  C                   ELSE
N06   * Navn ikke gitt - info / invitasjon til å opprette.
N06  C                   SETON                                        83
N06  C   83
N06  CANN30              MOVE      'JOV0079'     MSGNR
N06  C                   END
N06  C                   ELSE
N06   * Utenfor gyldige postnrsoner...
N06  C                   SETON                                        83
N06  C   83
N06  CANN30              MOVE      'SHU0120'     MSGNR
N06  C                   END
N06   * Husk LK/PNR som saksbeh. gis warning om..
N06  C     *IN83         IFEQ      *ON
N06  C     MSGNR         IFEQ      'JOV0079'
N06  C     MSGNR         OREQ      'JOV1086'
N06  C                   MOVE      WSLKK         GSLKK             2
N06  C                   MOVE      WSSDVT        GSSDVT            5
N06  C                   END
N06  C                   END
N06  C                   ELSE
N06  C   83
N06  CANN30              MOVE      'SPS0017'     MSGNR
N06  C                   END
N06  C   83              SETON                                        30
N06  C  N83WSADK3        IFEQ      *BLANKS
N06  C     WSKNK         IFEQ      *ZEROS
N06  C                   MOVE      ST2NVN        WSADK3
N06  C                   END
N06  C                   END
N06  C  N83KOAPOS        IFEQ      'J'
N06  C                   MOVE      ST2KO2        WSSDT
N06  C                   END
N06  C                   END
N06  C*
     C*
     C*** TEST ORDERTYPE
     C     KODOTK        CHAIN     KOOTYR                             89
     C   89
     CANN30              MOVE      'SPO0007'     MSGNR
     C   89              SETON                                        30
     C*
     C*** TEST FRANKATUR
     C     KODFRK        CHAIN     KOFRR                              88
     C   88
     CANN30              MOVE      'SPF0006'     MSGNR
     C   88              SETON                                        30
     C*
     C*** TEST NUMBER OF COLLIES
     C     WSNT          COMP      0                                      87
     C   87
     CANN30              MOVE      'SPN0003'     MSGNR
     C   87              SETON                                        30
     C*
     C*** TEST TYPE OF GOODS
     C     WSVS1         COMP      *BLANKS                                86
     C   86
     CANN30              MOVE      'SPV0005'     MSGNR
     C   86              SETON                                        30
     C*
     C*** TEST VEIGHT
     C     WSVKT         COMP      0                                      85
     C   85
     CANN30              MOVE      'SPV0002'     MSGNR
     C   85              SETON                                        30
     C*
     C*
     C*** TEST OM PRODUKTSKODE
     C                   MOVEL     WSKDPL        XUKOD
     C     KUFASK        CHAIN     KUFAST                             55
     C  N30*IN55         IFEQ      '1'
     C                   MOVE      'YBC0360'     MSGNR
     C                   SETON                                        30
     C                   END
     C*** HENTE UTLEVERINGSFORBEHOLD
     C     WSKF          IFNE      '  '
     C     WSKF          CHAIN     KODTU                              74
     C   74
     CANN30              MOVE      'YBC0487'     MSGNR
     C   74              SETON                                        30
     C  N74WSFT1A        IFEQ      *BLANKS
     C                   MOVE      KUTX          WSFT1A
     C                   END
     C  N74WSKFT1        IFEQ      ' '
     C                   MOVE      KUKD2         WSKFT1
     C                   END
     C                   END
      *
      *** TEST OM UTLEVERINGSFORBEHOLD ER AKTIV
     C                   MOVEL     WSKFT1        XKFKOD
     C     KOFASK        CHAIN     KOFAST                             73
     C   73
     CANN30              MOVE      'YBC0488'     MSGNR
     C   73              SETON                                        30
     C*
     C*
     C*** TEST OM TASTET VALUTAKODEN VAREVERDI          RIKTIG
     C     WSVERV        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVERV        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            71
     C   71
     CANN30              MOVE      'SPV0001'     MSGNR
     C   71              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** GETS PRINTERCODE
     C     KODO2K        CHAIN     KOOT2R                             33
     C  N33              DO
     C     WSPK1         IFEQ      ' '
     C                   MOVE      KO2FB         WSPK1
     C                   END
     C     WSPK2         IFEQ      ' '
     C                   MOVE      KO2FPS        WSPK2
     C                   END
     C     WSPK3         IFEQ      ' '
     C                   MOVE      KO2KK         WSPK3
     C                   END
     C     WSPK4         IFEQ      ' '
     C                   MOVE      KO2TI         WSPK4
     C                   END
     C     WSPK5         IFEQ      ' '
     C                   MOVE      KO2FI         WSPK5
     C                   END
     C                   END
     C*
     C*** TEST PRINTCODE FOR FREIGHTDOCUMENT
     C     WSPK1         COMP      ' '                                    84
     C   84
     CANN30              MOVE      'SPP0002'     MSGNR
     C   84              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR SAD
     C     WSPK2         COMP      ' '                                    83
     C   83
     CANN30              MOVE      'SPP0003'     MSGNR
     C   83              SETON                                        30
     C*
     C*** TEST PRINTECODE FOR ORDERPRINT
     C     WSPK3         COMP      ' '                                    82
     C   82
     CANN30              MOVE      'SPP0004'     MSGNR
     C   82              SETON                                        30
     C*
     C*** TEST PRINTCODE FOR SAD
     C     WSPK4         COMP      ' '                                    81
     C   81
     CANN30              MOVE      'SPP0005'     MSGNR
     C   81              SETON                                        30
     C*
     C*** TEST PRINTECODE FOR INBOUND AIRWAYBILL
     C     WSPK5         COMP      ' '                                    80
     C   80
     CANN30              MOVE      'SPP0006'     MSGNR
     C   80              SETON                                        30
     C*
     C*** TEST CUSTOMPLACE AND NUMBER OF GOODS
     C     W2TOLL        IFNE      0
     C     KODTSK        CHAIN     KOTSTR                             79
     C   79
     CANN30              MOVE      'SPT0001'     MSGNR
     C   79              SETON                                        30
     C                   END
     C     WSPK2         IFEQ      'J'
     C  N79W2TOLL        COMP      0                                      79
     C   79
     CANN30              MOVE      'SPT0004'     MSGNR
     C   79              SETON                                        30
     C     WSNTVS        COMP      0                                      78
     C   78
     CANN30              MOVE      'SPN0004'     MSGNR
     C   78              SETON                                        30
     C                   END
     C*
     C***    HER SKAL INN SISTE TEST PÅ TESTB2  ETTER FERDIG <TESTKU>
     C*
     C*** TEST FREIGHTWEIGHT
     C     WSFBV         IFNE      WSVKT
     C     WSM3          ANDEQ     0
     C     WSFBV         DIV(H)    KOVKKG        WSM3
     C                   END
     C*** BEREGN FRAKTBREGNETVEKT
     C                   EXSR      FINNVK
N06  C* FINN EVT DFT FOR FRAKT-TILLEGG (VAL/OLJ..., MEN KUN VED NY)
N06  C  N30              EXSR      GETFRT
     C*
     C*
     C     SLT2          TAG
     C   30              EXSR      SETCUR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SETCUR        BEGSR
     C***********************************************
     C* SET POSITION OF CURSER
     C   78
     COR 79              Z-ADD     21            LINNBR
     C   80
     COR 81
     COR 82
     COR 83
     COR 84              Z-ADD     20            LINNBR
     C   71              Z-ADD     19            LINNBR
     C   74
     COR 73              Z-ADD     18            LINNBR
     C   89
     COR 88
     COR 87
     COR 86
     COR 85              Z-ADD     16            LINNBR
     C   62
     COR 61
     COR 60
     COR 59              Z-ADD     11            LINNBR
     C   68
     COR 67
     COR 66
     COR 65              Z-ADD     7             LINNBR
     C   72              Z-add     6             LINNBR
     C   92
     COR 91
     COR 90              Z-ADD     5             LINNBR
     C   70
     COR 69              Z-ADD     4             LINNBR
     C   95
N06  COR 54
     COR 94
     COR 93              Z-ADD     3             LINNBR
     C   96
     COR 97              Z-ADD     2             LINNBR
     C*
     C   78              Z-ADD     56            POSNBR
     C   79              Z-ADD     2             POSNBR
     C   80              Z-ADD     15            POSNBR
     C   81              Z-ADD     12            POSNBR
     C   82              Z-ADD     9             POSNBR
     C   71              Z-ADD     61            POSNBR
     C   73              Z-ADD     12            POSNBR
     C   74              Z-ADD     9             POSNBR
     C   83              Z-ADD     6             POSNBR
     C   84              Z-ADD     2             POSNBR
     C   85              Z-ADD     60            POSNBR
     C   86              Z-ADD     33            POSNBR
     C   87              Z-ADD     25            POSNBR
     C   88              Z-ADD     5             POSNBR
     C   89              Z-ADD     2             POSNBR
     C   59              Z-ADD     42            POSNBR
     C   60              Z-ADD     33            POSNBR
     C   62
     COR 61              Z-ADD     8             POSNBR
     C   65              Z-ADD     42            POSNBR
     C   66              Z-ADD     33            POSNBR
     C   68
     COR 67              Z-ADD     8             POSNBR
     C   90              Z-ADD     43            POSNBR
     C   91              Z-ADD     21            POSNBR
     C   92              Z-ADD     8             POSNBR
     C   69              Z-ADD     54            POSNBR
     C   72              Z-add     10            posnbr
     C   70              Z-ADD     8             POSNBR
     C   93              Z-ADD     53            POSNBR
N06  C   76              Z-ADD     34            POSNBR
s06  C*  94              Z-ADD     23            POSNBR
n06  C   94              Z-ADD     27            POSNBR
     C   95              Z-ADD     8             POSNBR
     C   96              Z-ADD     35            POSNBR
     C   97              Z-ADD     8             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTKU        BEGSR
     C***********************************************
     C*
     C                   SETOFF                                       767798
     C                   SETOFF                                       997256
     C                   SETOFF                                       75
     C*** TEST AGENT
     C     WSKNA         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       WSNAA
     C                   ELSE                                                   1
     C                   MOVE      WSKNA         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            70
     C   70              MOVE      'SPK0008'     MSGNR
     C   70              SETON                                        30
     C  N70              MOVE      KNAVN         WSNAA
     C                   END                                                    1<-E
     C*
     C*** TEST OPPDRAGSGIVER
     C     WSKNO         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       WSNAO
     C                   ELSE                                                   1
     C                   MOVE      WSKNO         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            72
     C   72              MOVE      'SPO0033'     MSGNR
     C   72              SETON                                        30
     C  N72              MOVE      KNAVN         WSNAO
     C  N72WSKNS         IFEQ      0
     c     WSKDAK        ANDEQ     'S'
     c                   move      wskno         wskns
     c                   end
     C  N72WSKNk         IFEQ      0
     c     WSKDAK        ANDEQ     'K'
     c                   move      wskno         wsknk
     c                   end
     C                   END                                                    1<-E
     C*
     C*** TRANSPORTER
     C     WSKNT         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       XTRNV
     C                   MOVE      *BLANKS       WSTRNV
     C                   ELSE                                                   1
     C     TRANK         CHAIN     TRAN                               69
     C   69
     CANN30              MOVE      'SPK0009'     MSGNR
     C   69              SETON                                        30
     C  N69              MOVE      VMNAVN        XTRNV
     C  N69              MOVEL     VMNAVN        WSTRNV
     C                   END                                                    1<-E
     C*
     C*** TEST SHIPPER
     C                   MOVE      *BLANKS       XSTLF            15
     C     WSKNS         IFEQ      0                                            1<-B
     C     WSNAS         COMP      *BLANKS                                67
     C   67
     CANN30              MOVE      'SPN0005'     MSGNR
     C   67              SETON                                        30
     C                   MOVE      *ZEROS        FMOT
     C                   ELSE                                                   1
     C                   MOVE      WSKNS         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            68
     C   68
     CANN30              MOVE      'SPK0010'     MSGNR
     C   68              SETON                                        30
     C  N68SYLAND        IFNE      '  '
     C                   MOVE      SYLAND        WSLKS
     C                   END
     C  N68              MOVE      TLF           XSTLF
     C  N68WSNAS         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      KNAVN         WSNAS
     C                   MOVE      ADR1          WSADS1
     C                   MOVE      ADR2          WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C     POSTNR        IFEQ      0                                              3<-B
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADS3
     C                   ELSE                                                     3
     C                   MOVE      ENGAD3        WSADS3
     C                   END
     C                   ELSE                                                     3
     C                   MOVEL     POSTNR        WSADS3
     C                   MOVE      ADR3          WSADS3
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C  N68WSKNSF        IFEQ      0                                             2<-B
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNS         WSKNSF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNSF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C*** TEST SHIPPERS CURRANCYCODE
     C     WSVALS        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVALS        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            66
     C   66
     CANN30              MOVE      'SPV0001'     MSGNR
     C   66              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** TEST SHIPPERS INVOICERECEEVER
     C     WSKNSF        IFEQ      0                                            1<-B
     C     WSKDFS        COMP      'X'                                6565
     C                   MOVE      *BLANKS       WSNASF
     C                   ELSE                                                   1
     C                   MOVE      WSKNSF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            65
     C     WSKDFS        IFNE      'X'
     C  N65AKTKOD        COMP      'A'                                6565
     C                   END
     C  N65              MOVE      KNAVN         WSNASF
     C                   END                                                    1<-E
     C   65
     CANN30              MOVE      'SPK0011'     MSGNR
     C   65              SETON                                        30
     C*
     C*** OTHER TESTS ON SHIPPER
     C                   MOVE      *BLANKS       WSMSG
     C  N65WSKNSF        IFNE      0                                            1<-B
     C*
     C*** TEST IF CREDITLIMIT IS REACHED
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XOVER            13 2
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XOVER                              65
     C   65
     CANN30              MOVE      'SPK0012'     MSGNR
     C   65              SETON                                        30
     C                   END                                                     2<-E
     C*** TEST CURRANCYCODE
     C     WSVALS        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALS
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALS
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*** GETS INFORMATION ON DISBURSMENTFEE
     C     SYUTLP        IFEQ      0                                             2<-B
     C                   MOVE      FIUPS         XSUTL             4 2
     C                   MOVE      FIUPM         XSUMIN            2 0
     C                   ELSE                                                    2
     C                   Z-ADD     SYUTLP        XSUTL
     C                   Z-ADD     SYMINU        XSUMIN
     C                   END                                                     2<-E
     C     XSUTL         IFEQ      99.99                                         2<-B
     C                   MOVE      *ZEROS        XSUTL
     C                   END                                                     2<-E
     C*** TEST STOPPCODE
     C     SYLIKV        COMP      ' '                                6363
     C   63              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG          WSMSG
     C  N33              MOVE      WSKNSF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     KLISTO        IFEQ      'J'
     C                   SETON                                        30
     C   30              GOTO      SLTKU
     C                   END                                                     2<-E
     C                   END                                                     2<-E
     C*
     C                   END                                                    1<-E
     C*** END OF  <WSKNSF IFNE 0>
     C*
     C*
     C*** TEST CONSIGNEE
     C                   MOVE      *BLANKS       XKTLF            15
     C     WSKNK         IFEQ      0                                            1<-B
     C     WSNAK         COMP      *BLANKS                                62
     C   62
     CANN30              MOVE      'SPN0006'     MSGNR
     C   62              SETON                                        30
     C                   MOVE      *ZEROS        FMOT
     C                   ELSE                                                   1
     C                   MOVE      WSKNK         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            61
     C   61
     CANN30              MOVE      'SPK0013'     MSGNR
     C   61              SETON                                        30
     C  N61SYLAND        IFNE      '  '
     C                   MOVE      SYLAND        WSLKK
     C                   END
     C  N61              MOVE      TLF           XKTLF
     C  N61WSOT          IFEQ      *BLANKS                                       2<-B
     C                   MOVE      SYOPDT        WSOT
     C                   MOVE      'C'           UUR               1
     C                   CALL      'SYFA24'
     C                   PARM      WSKNK         UKNOP             8 0
     C                   PARM                    UUR
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM                    WSOT
     C                   END                                                     2<-E
     C  N61SYKONT        IFEQ      0
     C     WSPK4         ANDEQ     'J'
     C                   MOVEL     MANGLE        WSMSG
     C                   END
     C  N61OAVTKS        CHAIN     OAVT                               33
     C  N61
     CANN33              MOVE      OAOT          WSOT
N06  C*
N06  C  N61KOAPOS        IFEQ      'J'
N06  C     WSLKK         IFEQ      *BLANKS
N06  C                   MOVE      SYLAND        WSLKK
N06  C     WSLKK         IFEQ      *BLANKS
N06  C                   MOVE      FIRLK         WSLKK
N06  C                   END
N06  C                   END
N06  C                   END
     C*
     C  N61WSNAK         IFEQ      *BLANKS                                       2<-B
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      *BLANKS       WSADK3
     C  N33              DO                                                       3<-B
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C                   END                                                      3<-E
     C   33              DO                                                       3<-B
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0                                               4<-B
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE                                                     3
     C                   MOVE      ENGAD3        WSADK3
     C                   END
     C                   ELSE                                                      4
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*
     C     WSKNKF        IFEQ      0                                             2<-B
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNK         WSKNKF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNKF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*
     C                   END                                                    1<-E
     C*** END OF <WSKNK IFEQ 0>
     C*
     C*
     C*** TEST IF CURRANCYCODE INVOICERECEVER IS CORRECT
     C     WSVALK        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVALK        KVAKOD
     C     KODVAK        CHAIN     VALUL01                            60
     C   60
     CANN30              MOVE      'SPV0001'     MSGNR
     C   60              SETON                                        30
     C                   END                                                    1<-E
     C*
     C*** TEST CONSIGNEES INVOICERECEEVER
     C     WSKNKF        IFEQ      0                                            1<-B
     C     WSKDFK        COMP      'X'                                5959
     C                   MOVE      *BLANKS       WSNAKF
     C                   ELSE                                                   1
     C                   MOVE      WSKNKF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            59
     C     WSKDFK        IFNE      'X'
     C  N59AKTKOD        COMP      'A'                                5959
     C                   END
     C  N59              MOVE      KNAVN         WSNAKF
     C                   END                                                    1<-E
     C   59
     CANN30              MOVE      'SPK0014'     MSGNR
     C   59              SETON                                        30
     C*
     C*** OTHER TEST OF CONSIGNEE
     C  N59WSKNKF        IFNE      0                                            1<-B
     C*
     C*** IS KREDITLIMIT REACHED
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XOVER
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XOVER                              59
     C   59
     CANN30              MOVE      'SPK0015'     MSGNR
     C   59              SETON                                        30
     C                   END                                                     2<-E
     C*** TEST CURRANCYCODE
     C     WSVALK        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALK
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALK
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C*** FIX INFO ABOUT DISBURSMENT
     C     SYUTLP        IFEQ      0                                             2<-B
     C                   MOVE      FIUPS         XKUTL             4 2
     C                   MOVE      FIUPM         XKUMIN            2 0
     C                   ELSE                                                    2
     C                   Z-ADD     SYUTLP        XKUTL
     C                   Z-ADD     SYMINU        XKUMIN
     C                   END                                                     2<-E
     C     XKUTL         IFEQ      99.99                                         2<-B
     C                   MOVE      *ZEROS        XKUTL
     C                   END                                                     2<-E
     C*** TEST STOPP-CODE
     C     SYLIKV        COMP      ' '                                5757
     C   57              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG          WSMSG
     C  N33              MOVE      WSKNKF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     KLISTO        IFEQ      'J'
     C                   SETON                                        30
     C                   END                                                     2<-E
     C                   END                                                     2<-E
     C*
     C                   END                                                    1<-E
     C*** END OF  <WSKNKF IFNE 0>
     C*
     C*
     C     SLTKU         TAG
     C     WSMSG         COMP      *BLANKS                            2727
     C*
      * SETT OPPDRAGSGIVER (WEB-SPØR/STATISTIKK) ETTER MODUL
     C     WSKNO         IFEQ      0                                            1<-B
     C                   CALL      'SYOP10'
     C                   PARM      'C'           heur              1
     C                   PARM                    wsKNK
     C                   PARM                    wsKNKF
     C                   PARM                    wsKNS
     C                   PARM                    wsKNSF
     C                   PARM                    wskno
     C                   end
     c     wskdak        ifeq      ' '
     c     wskno         ifeq      wskns
     c                   move      'S'           wskdak
     c                   end
     c     wskno         ifeq      wsknk
     c                   move      'K'           wskdak
     c                   end
     c                   move      wskdak        wskdak
     C                   END
     C                   ENDSR
     C*
N06  C***********************************************
N06  C     GETFRT        BEGSR
N06  C***********************************************
N06   * SR SOM HENTER VERDI FOR FRAKTTILLEGG (OLJE/VAL...)
s07  C*    WSOPD         IFEQ      *ZEROS
s07  C*    WSVALT        ANDEQ     *BLANKS
N07  C     WSVALT        IFEQ      *BLANKS
N06  C                   MOVE      *ZEROS        UVALP
N06  C     WSKNKF        IFNE      *ZEROS
N06  C     WSKDFK        ANDNE     'X'                                          VED IMPORT..
N06  C                   MOVE      WSKNKF        UKNOP                          PRIM. KJØPER
N06  C                   ELSE
N06  C                   MOVE      WSKNSF        UKNOP                          SEK. SELGER
N06  C                   END
N06  C                   CALL      'SYFA24B'
N06  C                   PARM                    UUR               1
N06  C                   PARM      WSAVD         UAVDOP            4 0
N06  C                   PARM                    UKNOP             8 0
N06  C                   PARM                    WSVALT
N06  C                   PARM                    UVALP             3 1
N06  C                   MOVE      UVALP         WSVALP
N06  C     WSVALT        IFNE      *BLANKS
N06  C     KODGEK        CHAIN     KOGER                              76
N06  C   76              SETON                                        30
N06  C                   END
N06  C                   END
N06  C                   ENDSR
N06  C*
     C***********************************************
     C     MOVHFW        BEGSR
     C***********************************************
     C  N28              MOVE      HESTD         WSSTD
     C   28              MOVE      KOABÆR        WSSTD
     C                   MOVE      HEPRO         WSPRO
     C                   MOVE      HEPOS1        WSPOS1
     C                   MOVE      HEPOS2        WSPOS2
     C     *IN28         IFEQ      '1'
     C                   MOVE      UYEAR         WSDTÅ
     C                   MOVE      UMONTH        WSDTM
     C                   MOVE      UDAY          WSDTD
     C                   ELSE
     C                   MOVE      HEDTÅ         WSDTÅ
     C                   MOVE      HEDTM         WSDTM
     C                   MOVE      HEDTD         WSDTD
     C                   END
     C                   MOVE      HEGN          WSGN
     C*                  MOVE      HERFA         WSRFA
     C                   MOVEL     HERFA         WSRFA
     C                   MOVE      HESDF         WSSDF
     C                   MOVE      HESDT         WSSDT
     C                   MOVE      HEHAWB        WSHAWB
N06  C                   MOVE      HEVALT        WSVALT
N06  C                   MOVE      HEVALP        XVALP
N06  C     KOAPOS        IFNE      'J'
N06  C                   MOVE      HELKK         FIRLK
N06  C     HELKK         IFEQ      *BLANKS
N06  C                   MOVE      FILAND        FIRLK
N06  C                   END
N06  C                   END
     C                   MOVE      HELKA         WSLKA
     C                   MOVE      HELKS         WSLKS
     C                   MOVE      HELKK         WSLKK
     C                   MOVE      HESDL         WSSDL
     C                   MOVE      HEKNA         WSKNA
     C                   MOVE      HENAA         WSNAA
     C                   MOVE      HEKNT         WSKNT
     C     TRANK         CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       XTRNV            30
     C  N33              MOVE      VMNAVN        XTRNV
     C                   MOVEL     XTRNV         WSTRNV
     C                   MOVE      HETRM         WSTRM
     C                   MOVE      HETRI         WSTRI
     C                   MOVE      HETRC         WSTRC
     C                   MOVE      HETRCN        WSTRCN
     C                   MOVE      HEKNS         WSKNS
     C                   MOVE      HEANS         WSANS
     C                   MOVE      HEKDFS        WSKDFS
     C                   MOVE      HEVALS        WSVALS
     C                   MOVE      HEKNSF        WSKNSF
     C                   MOVE      HENASF        WSNASF
     C                   MOVE      HENAS         WSNAS
     C                   MOVE      HEADS1        WSADS1
     C                   MOVE      HEADS2        WSADS2
     C                   MOVE      HEADS3        WSADS3
     C                   MOVE      HEKNK         WSKNK
     C                   MOVE      HEANK         WSANK
     C                   MOVE      HEKDFK        WSKDFK
     C                   MOVE      HEVALK        WSVALK
     C                   MOVE      HEKNKF        WSKNKF
     C                   MOVE      HENAKF        WSNAKF
     C                   MOVE      HENAK         WSNAK
     C                   MOVE      HEADK1        WSADK1
     C                   MOVE      HEADK2        WSADK2
     C                   MOVE      HEADK3        WSADK3
     C                   MOVE      HEOT          WSOT
     C                   MOVE      HEFR          WSFR
     C                   MOVE      HEGM1         WSGM1
     C                   MOVE      HENT          WSNT
     C                   MOVE      HEVS1         WSVS1
     C                   MOVE      HEVKT         WSVKT
     C                   MOVE      HEM3          WSM3
     C                   MOVE      HEFBV         WSFBV
     C                   MOVE      HEGM2         WSGM2
     C                   MOVE      HEVS2         WSVS2
     C                   MOVE      HEKDL         WSKDL
N06  C                   MOVE      HESDFF        WSSDFF
N06  C                   MOVE      HESDVT        WSSDVT
     C                   MOVE      HEKDPL        WSKDPL
     C                   MOVE      TRKDAK        WSKDAK
     C                   MOVE      TRKNFA        WSKNO
     C                   MOVE      HEPK1         WSPK1
     C                   MOVE      HEPK2         WSPK2
     C                   MOVE      HEPK3         WSPK3
     C                   MOVE      HEPK4         WSPK4
     C                   MOVE      HEPK5         WSPK5
     C                   MOVE      HEPK9         WSPK9
     C                   MOVE      *ZEROS        W2TOLL
     C                   MOVE      ' '           W2KDME
     C                   MOVE      ' '           W2KDE
     C                   MOVE      HENTVS        WSNTVS
     C                   MOVE      HEKF          WSKF
     C                   MOVE      HEKFT1        WSKFT1
     C                   MOVE      HEFT1         WSFT1
     C                   MOVE      TRVERV        WSVERV
N12  C                   MOVE      TRVERb        WSVERb
     C                   MOVE      TRAVD0        WSAVD0
     C                   MOVE      TROPD0        WSOPD0
     C*
     C   28              DO
     C     VIADUMMY      IFNE      'J'
     C                   MOVE      ' '           WSPK1
     C                   MOVE      ' '           WSPK2
     C                   MOVE      ' '           WSPK3
     C                   MOVE      ' '           WSPK4
     C                   MOVE      ' '           WSPK5
     C                   MOVE      ' '           WSPK9
     C                   END
     C                   MOVE      ' '           HE01
     C                   MOVE      *ZEROS        HENTF
     C                   MOVE      *BLANKS       HEKDTM
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      *BLANKS       HEGNN
     C                   END
      *
     C                   MOVE      *BLANKS       WSUSR
     C     WSOPD         IFNE      0
     C     UTLLGK        SETGT     UTLLOGF
     C     UTLL2K        READPE    UTLLOGF                                33
     C  N33              MOVE      ULUSR         WSUSR
     C                   END
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
      * Hvis GODS/AWB-nr er Braathen/SAS - Blank ved F16 / ellers ikke
      *      Pos1: Braathen/SAS=Behold / ellers øk med en hvis numerisk
     C     *IN16         IFEQ      '1'
     C                   MOVEL     WSGN          TSTBS             2
     C                   MOVEL     TSTBS         TSTBS1            1
     C                   MOVE      TSTBS         TSTBS2            1
     C     TSTBS1        IFEQ      'F'
     C     TSTBS2        ANDGE     '0'
     C     TSTBS2        ANDLE     '9'
     C     TSTBS1        OREQ      'A'
     C     TSTBS2        ANDGE     '0'
     C     TSTBS2        ANDLE     '9'
     C                   MOVE      *BLANKS       WSGN
     C                   ELSE
     C     WSPOS2        IFEQ      *ZEROS
     C                   CALL      'SYFA10C'
     C                   PARM                    WSPOS1
     C                   ELSE
     C                   ADD       1             WSPOS2
     C                   END
     C                   END
     C                   END
     C                   MOVE      *ZEROS        WSOPD
     C  N16              MOVE      *ZEROS        WSPRO
     C  N16              MOVE      *BLANKS       WSPOS1
     C  N16              MOVE      *ZEROS        WSPOS2
     C  N16              MOVE      *BLANKS       WSGN
     C  N16              MOVE      UDAY          WSDTD
     C  N16              MOVE      UMONTH        WSDTM
     C  N16              MOVE      UYEAR         WSDTÅ
     C  N16              MOVE      *BLANKS       WSRFA
     C  N16              MOVE      *BLANKS       WSSDF
     C  N16              MOVE      *BLANKS       WSSDT
N09  C* N16              MOVE      *BLANKS       WSVALT
N09  C* N16              MOVE      *ZEROS        WSVALP
N09  C                   MOVE      *BLANKS       WSVALT
N09  C                   MOVE      *ZEROS        WSVALP
     C                   MOVE      *BLANKS       WSHAWB
     C  N16              MOVE      *BLANKS       WSLKA
     C  N16              MOVE      *BLANKS       WSLKS
     C  N16              MOVE      *BLANKS       WSLKK
     C  N16              MOVE      *BLANKS       WSSDL
     C  N16              MOVE      *ZEROS        WSKNA
     C  N16              MOVE      *BLANKS       WSNAA
     C  N16              MOVE      *ZEROS        WSKNT
     C  N16              MOVE      *BLANKS       XTRNV
     C  N16              MOVEL     XTRNV         WSTRNV
     C  N16              MOVE      *ZEROS        WSTRM
     C  N16              MOVE      *BLANKS       WSTRI
     C  N16              MOVE      *ZEROS        WSTRC
     C  N16              MOVE      *BLANKS       WSTRCN
     C                   MOVE      *ZEROS        WSKNS
     C                   MOVE      *ZEROS        WSANS
     C  N16              MOVE      *BLANKS       WSKDFS
     C                   MOVE      *BLANKS       WSVALS
     C                   MOVE      *ZEROS        WSKNSF
     C                   MOVE      *BLANKS       WSNASF
     C                   MOVE      *BLANKS       WSNAS
     C                   MOVE      *BLANKS       WSADS1
     C                   MOVE      *BLANKS       WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C                   MOVE      *ZEROS        WSKNK
     C                   MOVE      *ZEROS        WSANK
     C                   MOVE      *BLANKS       WSKDFK
     C                   MOVE      *BLANKS       WSVALK
     C                   MOVE      *ZEROS        WSKNKF
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      *BLANKS       WSNAK
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      *BLANKS       WSOT
     C                   MOVE      *BLANKS       WSFR
     C                   MOVE      *BLANKS       WSGM1
     C                   MOVE      *ZEROS        WSNT
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *ZEROS        WSVKT
     C                   MOVE      *ZEROS        WSM3
     C                   MOVE      *ZEROS        WSFBV
     C                   MOVE      *BLANKS       WSGM2
     C                   MOVE      *BLANKS       WSVS2
     C                   MOVE      *BLANKS       WSKDPL
     C                   MOVE      *BLANKS       WSKDL
     C                   MOVE      *blanks       WSKDAK
     C                   MOVE      *ZEROS        WSKNO
     C                   MOVE      *BLANKS       WSNAO
     C                   MOVE      *BLANKS       WSKF
     C                   MOVE      *BLANKS       WSKFT1
     C                   MOVE      *BLANKS       WSFT1
     C                   MOVE      *BLANKS       WSPK1
     C                   MOVE      *BLANKS       WSPK2
     C                   MOVE      *BLANKS       WSPK3
     C                   MOVE      *BLANKS       WSPK4
     C                   MOVE      *BLANKS       WSPK5
     C                   MOVE      *BLANKS       WSPK9
     C                   MOVE      *ZEROS        W2TOLL
     C                   MOVE      *BLANKS       W2KDME
     C                   MOVE      *BLANKS       W2KDE
     C                   MOVE      *ZEROS        WSNTVS
     C                   MOVE      *ZEROS        WSVERB
     C                   MOVE      *BLANKS       WSVERV
     C                   MOVE      *BLANKS       WSUSR
     C                   Z-ADD     0             WSAVD0
     C                   Z-ADD     0             WSOPD0
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDHEA        BEGSR
     C***********************************************
     C     HEADFK        CHAIN     HEADF                              33
      * OPPDATER STATISTIKK HVIS OPPDRAG ER ALLEREDE OPPDATERT PÅ STAT.
     C  N33HE01          IFEQ      'J'
     C                   WRITE     STATVFR
     C                   MOVE      WSAVD         USTAVD            4
     C                   MOVE      WSOPD         USTOPD            7
     C                   CALL      'SYST35CA'
     C                   PARM                    USTAVD
     C                   PARM                    USTOPD
     C                   END
      *
     C  N33WSKF          IFNE      HEKF
     C     WSKFT1        ORNE      HEKFT1
     C     WSFT1A        ORNE      HEFT1A
     C     WSFT1B        ORNE      HEFT1B
     C                   EXSR      OPDLOG
     C                   END
      *
     C                   EXSR      MOVWHF
     C  N33              UPDATE    HEADFR
     C   33              DO
     C     UDUMMY        IFNE      'J'
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C                   UPDATE    TELLR
     C                   END
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          HEDTRÅ
     C                   ELSE
     C     UYEAR         ADD       2000          HEDTRÅ
     C                   END
     C                   MOVE      UMONTH        HEDTRM
     C                   MOVE      UDAY          HEDTRD
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      'C'           HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD         HEAVD
S06  C*                  MOVE      *BLANKS       HESDVT
     C                   MOVE      *ZEROS        HELM
     C                   MOVE      *ZEROS        HEM3
S06  C*                  MOVE      *BLANKS       HESDFF
N06  C                   MOVE      WSSDFF        HESDFF
N06  C                   MOVE      WSSDVT        HESDVT
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      '   '         HEVALT
     C                   MOVE      *ZEROS        HEVALP
     C                   MOVE      ' '           HETLKU
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      ' '           HEPK6
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *Zeros        HEKLMO
     C                   MOVE      ' '           HEPK7
     C                   MOVE      ' '           HEPK8
     C                   MOVE      *BLANKS       HEGNN
     C                   MOVE      *ZEROS        TRRUND
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSFFK
     C                   MOVE      *ZEROS        TRSDFD
     C                   MOVE      *ZEROS        TRSDFK
     C                   MOVE      *ZEROS        TRSDTD
     C                   MOVE      *ZEROS        TRSDTK
     C                   MOVE      *ZEROS        TRSVTD
     C                   MOVE      *ZEROS        TRSVTK
     C                   MOVE      *ZEROS        TRFRAB
     C                   MOVE      *BLANKS       TRSLAG
     C                   MOVE      *BLANKS       TRKDAK
     C                   MOVE      *BLANKS       TRKDFF
     C                   MOVE      *BLANKS       TRFRAK
     C                   MOVE      *BLANKS       TRFRAV
     C                   MOVE      *BLANKS       TRMVA
     C     WSKF          IFNE      *BLANKS
     C     WSKFT1        ORNE      *BLANKS
     C     WSFT1A        ORNE      *BLANKS
     C     WSFT1B        ORNE      *BLANKS
     C                   EXSR      OPDLOG
     C                   END
     C                   WRITE     HEADFR
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
     C                   END
     C*
     C*
     C* OPPDATERER VAREVERDI
     C*
     C                   MOVE      HEAVD         UAVD
     C                   MOVE      HEOPD         UOPD
     C                   MOVE      HESG          USG
     C                   MOVE      '0'           *IN58
      * OPPDATER OPPDRAGSDATO PÅ ALLE FRISØKEVEIER
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      HEDTOP        FSDTOP
     C                   UPDATE    FRISOKR
     C     HEADFK        READE     FRISOK                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
     C*
     C***********************************************
     C     OPDLOG        BEGSR
     C***********************************************
     C                   MOVE      HEAVD         ULAVD
     C                   MOVE      HEOPD         ULOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      XULTM         ULTID
     C                   MOVE      UUSR          ULUSR
     C                   MOVE      WSKF          ULKF
     C                   MOVE      WSKFT1        ULKFT1
     C                   MOVE      WSFT1A        ULFT1A
     C                   MOVE      WSFT1B        ULFT1B
     C                   WRITE     UTLLOGR
     C                   MOVE      UUSR          WSUSR
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVWHF        BEGSR
     C***********************************************
     C     UDUMMY        IFEQ      'J'
     C                   MOVE      ' '           HEST
     C                   ELSE
     C                   MOVE      'X'           HEST
     C                   END
     C                   MOVE      WSSG          HESG
     C                   MOVE      WSNTVS        HENTVS
     C                   MOVE      WSSTD         HESTD
     C                   MOVE      WSPRO         HEPRO
N06  C                   MOVE      XVALP         HEVALP
N06  C                   MOVE      WSVALT        HEVALT
     C                   MOVE      WSDTD         HEDTD
     C                   MOVE      WSDTM         HEDTM
     C     WSDTÅ         IFGT      50
     C     WSDTÅ         ADD       1900          HEDTÅ
     C                   ELSE
     C     WSDTÅ         ADD       2000          HEDTÅ
     C                   END
     C                   MOVE      WSGN          HEGN
     C                   MOVE      WSSDF         HESDF
     C                   MOVE      WSSDT         HESDT
     C                   MOVE      WSKNA         HEKNA
     C                   MOVE      WSNAA         HENAA
     C                   MOVE      WSKNS         HEKNS
     C                   MOVE      WSKDFS        HEKDFS
     C                   MOVE      WSVALS        HEVALS
     C                   MOVE      WSNAS         HENAS
     C                   MOVE      WSADS1        HEADS1
     C                   MOVE      WSADS2        HEADS2
     C                   MOVE      WSADS3        HEADS3
     C                   MOVE      WSKNSF        HEKNSF
     C                   MOVE      WSANS         HEANS
     C                   MOVE      WSNASF        HENASF
     C                   MOVE      WSKNK         HEKNK
     C                   MOVE      WSKDFK        HEKDFK
     C                   MOVE      WSVALK        HEVALK
     C                   MOVE      WSNAK         HENAK
     C                   MOVE      WSADK1        HEADK1
     C                   MOVE      WSADK2        HEADK2
     C                   MOVE      WSADK3        HEADK3
     C                   MOVE      WSKNKF        HEKNKF
     C                   MOVE      WSANK         HEANK
     C                   MOVE      WSNAKF        HENAKF
     C                   MOVE      WSOT          HEOT
     C                   MOVE      WSPOS1        HEPOS1
     C                   MOVE      WSFR          HEFR
     C                   MOVE      WSNT          HENT
     C                   MOVE      WSVS1         HEVS1
     C                   MOVE      WSVKT         HEVKT
     C                   MOVE      WSPK1         HEPK1
     C                   MOVE      WSPK2         HEPK2
     C                   MOVE      WSPK3         HEPK3
     C                   MOVE      WSPK4         HEPK4
     C                   MOVE      WSPK9         HEPK9
     C                   MOVE      WSKNT         HEKNT
     C                   MOVE      WSLKA         HELKA
     C                   MOVE      WSLKS         HELKS
     C                   MOVE      WSLKK         HELKK
     C                   MOVE      WSKDPL        HEKDPL
     C                   MOVE      WSHAWB        HEHAWB
     C                   MOVE      WSTRM         HETRM
     C                   MOVE      WSTRI         HETRI
     C                   MOVE      WSTRC         HETRC
     C                   MOVE      WSTRCN        HETRCN
     C                   MOVE      WSFBV         HEFBV
N06  C                   MOVE      WSSDFF        HESDFF
N06  C                   MOVE      WSSDVT        HESDVT
     C                   MOVE      WSM3          HEM3
     C                   MOVE      WSPK5         HEPK5
     C*                  MOVE      WSRFA         HERFA
     C                   MOVEL     WSRFA         HERFA
     C                   MOVE      WSSDL         HESDL
     C                   MOVE      WSPOS2        HEPOS2
     C                   MOVE      WSGM1         HEGM1
     C                   MOVE      WSGM2         HEGM2
     C                   MOVE      WSVS2         HEVS2
     C                   MOVE      WSKDL         HEKDL
     C                   MOVE      WSKDAK        TRKDAK
     C                   MOVE      WSKNO         TRKNFA
     C                   MOVE      WSKF          HEKF
     C                   MOVE      WSKFT1        HEKFT1
     C                   MOVE      WSFT1         HEFT1
     C                   MOVE      WSVERV        TRVERV
     C                   MOVE      WSVERB        TRVERB
      * SETT OPPDRAGSGIVER (WEB-SPØR/STATISTIKK) ETTER MODUL
     C     trknfa        ifeq      *zeros
     C                   CALL      'SYOP10'
     C                   PARM      'C'           XXXUR             1
     C                   PARM                    HEKNK
     C                   PARM                    HEKNKF
     C                   PARM                    HEKNS
     C                   PARM                    HEKNSF
     C                   PARM                    TRKNFA
     C                   end
     c     trkdak        ifeq      ' '
     c     trknfa        ifeq      hekns
     c                   move      'S'           trkdak
     c                   end
     c     trknfa        ifeq      heknk
     c                   move      'K'           trkdak
     c                   end
     c                   move      trkdak        wskdak
     c                   end
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWDT        BEGSR
     C***********************************************
     C                   MOVE      ' '           DTST
     C                   MOVE      W2TOLL        DTTOLL
     C                   MOVE      WSSG          DTSG
     C                   MOVE      'T'           DTRI
     C                   MOVE      WSAVD         DTAVD
     C                   MOVE      WSOPD         DTOPD
     C                   MOVE      XFBNR         DTFBNR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWDF        BEGSR
     C***********************************************
     C                   CLEAR                   DOKUFR
     C                   MOVE      ' '           DFST
     C                   MOVEL     KOVXXX        DFBELA
     C     DFBELA        IFEQ      ' '
     C     FILFB         IFEQ      'S'
     C     FILFB         OREQ      'M'
     C                   MOVE      FILFB         DFBELA
     C                   END
     C                   END
     C                   MOVE      KOAKNR        DFKNSS
     C                   MOVEL     WSNAS         DFFASE
     C     FIRAVD        CHAIN     CUNDL01                            34
     C     *IN34         IFEQ      '0'
     C                   MOVE      KNAVN         DFNAVS
     C                   MOVE      ADR1          DFAD1S
     C                   MOVE      *BLANKS       DFAD2S
     C                   MOVEL     ADR3          DFAD3S
     C                   MOVE      POSTNR        DFPNLS
     C                   END
     C                   MOVE      WSNT          DFNTLA
     C                   MOVE      W2TOLL        DFTOLL
     C                   MOVE      WSNAK         DFNAVL
     C                   MOVE      WSADK1        DFAD1L
     C                   MOVE      *BLANKS       DFAD2L
     C                   MOVEL     WSADK3        TMPPUL            4
     C                   TESTN                   TMPPUL               77
     C     *IN77         IFEQ      '1'
     C                   MOVE      TMPPUL        DFPOUL                          UTL.POSTNR
     C                   MOVE      WSADK3        TMPAD3           25
     c                   movel     tmpad3        testbl            1
     c     testbl        ifeq      *blanks
     C                   MOVE      WSADK3        TMPAD3b          24
     C                   MOVEL     TMPAD3b       DFADUL                          UTL.STED
     c                   else
     C                   MOVEL     TMPAD3        DFADUL                          UTL.STED
     c                   end
     C                   ELSE
     C                   MOVEL     WSADK3        DFADUL
     C                   END
     C                   MOVEL     XTRNV         DFNAT
     C                   MOVE      W2KDE         DFKDE
     C                   MOVE      W2KDME        DFKDME
     C                   MOVE      WSKNK         DFKNSM
     C                   MOVE      WSNAK         DFNAVM
     C                   MOVE      WSADK1        DFAD1M
     C                   MOVE      WSADK3        DFAD3M
     C                   MOVEL     WSGM1         DFGM
     C                   MOVE      WSNT          DFNT
     C                   MOVE      WSVS1         DFVS
     C                   MOVE      WSVKT         DFVKT
     C                   MOVE      WSM3          DFM3
     C                   MOVEL     WSGM2         DFGM2
     C                   MOVEL     WSVS2         DFVS2
     C                   MOVE      WSFBV         DFVKTF
     C                   MOVE      WSSG          DFSG
     C                   MOVE      'F'           DFRI
     C                   MOVE      WSAVD         DFAVD
     C                   MOVE      WSOPD         DFOPD
     C                   MOVE      XFBNR         DFFBNR
     C                   MOVE      DFKNSS        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNS
     C                   MOVE      DFKNSM        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNM
     C*
     C                   WRITE     DOKUFR
     C*
     C                   ENDSR
     C*
N05  C***********************************************
N05  C     SØKKUN        BEGSR
N05  C***********************************************
N05  C   32              MOVE      WSKNK         XKNK              8 0
N05  C   34              MOVE      WSKNS         XKNS              8 0
N05  C                   CALL      'SOEKUN'
N05  C                   PARM                    FIFIRM
N05  C                   PARM                    SOANTK
N05  C                   PARM                    SOTXT1
N05  C                   PARM                    WSKNA
N05  C                   PARM                    SOTXT2
N05  C                   PARM                    WSKNS
N05  C                   PARM                    SOTXT3
N05  C                   PARM                    WSKNSF
N05  C                   PARM                    SOTXT4
N05  C                   PARM                    WSKNK
N05  C                   PARM                    SOTXT5
N05  C                   PARM                    WSKNKF
N05  C                   PARM                    SOTXT6
N05  C                   PARM                    WSKNO
N05  C                   PARM                    SOTXT7
N05  C                   PARM                    SOKNR7
N05  C                   PARM                    SOTXT8
N05  C                   PARM                    SOKNR8
N05  C   32              MOVE      XKNK          WSKNK
N05  C   34              MOVE      XKNS          WSKNS
N05  C                   Z-ADD     0             UFLAGG
N05  C
N05  C                   ENDSR
N05  C*
     C***********************************************
     C     TSTOPL        BEGSR
     C***********************************************
     C*** TEST OM DET ER OPPLYSNINGER TIL OPPDRAG
     C     FREETK        SETLL     FREETXT
     C                   SETOFF                                       29
     C     WSAVD         READE     FREETXT                                29
     C  N29WSOPD         COMP      FRTOPD                             2929
     C*** TEST IF FREE INFO ON AGENT
     C                   MOVE      WSKNA         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        75
     C*** TEST IF SHIPPER HAS FREE INFO  (77 ON)
     C                   MOVE      WSKNS         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        77
     C*** TEST IF SHIPPER HAS FREE INFO  (99 ON)
     C                   MOVE      WSKNSF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        99
     C*** TEST IF FREE INFO ON CONSIGNNEES  76 ON
     C                   MOVE      WSKNK         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        76
     C*** TEST IF FREE INFO ON CONSIGNNEES INVOICERECEEVER
     C                   MOVE      WSKNKF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        98
     C*
     C*** HENT OPPDRAGSGIVER
     C     WSKNO         ifne      0                                            1<-B
     C                   MOVE      WSKNO         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33              MOVE      KNAVN         WSNAO
     C                   END                                                    1<-E
     C*** TEST OM OPPDRAGSGIVER HAR FRITEKST
     C                   MOVE      WSKNO         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        56
      *
     C     HEADFK        SETLL     ENADSF                                 33
     C                   IF        *IN33
     C     HEADFK        READE     ENADSF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        N3039 <> *BLANKS
     C                   IF        NKN = 0
     C                   LEAVE
     C                   ELSE
     C                   EVAL      KUINTN = N3039
     C     KUNKO2K       CHAIN     KUNKO2                             34
     C   34              LEAVE
     C                   END
     C                   END
     C     HEADFK        READE     ENADSF                                 33
     C                   ENDDO
     C  N33              EVAL      WSEDIINF = 'EDI-ADR. F14'
     C   33              EVAL      WSEDIINF = *BLANKS
     C                   ELSE
     C                   EVAL      WSEDIINF = *BLANKS
     C                   END
      *
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     16
     C                   CALL      'EDI90R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      SLVISO
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     WSOPD         ANDNE     0
     C                   CALL      'SYFA19R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      SLVISO
     C                   END
      *
     C     POSNBR        IFGE      8
     C     POSNBR        ANDLE     40
     C                   SELECT
     C     LINNBR        WHENEQ    4
     C   75              MOVE      SOTXT1        XSKMOT            8
     C   75              MOVE      WSKNA         XSKKNR            8 0
     C   75              GOTO      STVISO
     C     LINNBR        WHENEQ    6
     C   56              MOVE      SOTXT6        XSKMOT            8
     C   56              MOVE      WSKNO         XSKKNR            8 0
     C   56              GOTO      STVISO
     C     LINNBR        WHENGE    7
     C     LINNBR        ANDLE     9
     C   77              MOVE      SOTXT2        XSKMOT            8
     C   77              MOVE      WSKNS         XSKKNR            8 0
     C   77              GOTO      STVISO
     C     LINNBR        WHENGE    11
     C     LINNBR        ANDLE     13
     C   76              MOVE      SOTXT4        XSKMOT            8
     C   76              MOVE      WSKNK         XSKKNR            8 0
     C   76              GOTO      STVISO
     C                   ENDSL
     C                   END
     C*
     C     POSNBR        IFGE      42
     C     POSNBR        ANDLE     80
     C                   SELECT
     C     LINNBR        WHENGE    7
     C     LINNBR        ANDLE     9
     C   99              MOVE      SOTXT3        XSKMOT            8
     C   99              MOVE      WSKNSF        XSKKNR            8 0
     C   99              GOTO      STVISO
     C     LINNBR        WHENGE    11
     C     LINNBR        ANDLE     13
     C   98              MOVE      SOTXT5        XSKMOT            8
     C   98              MOVE      WSKNKF        XSKKNR            8 0
     C   98              GOTO      STVISO
     C                   ENDSL
     C                   END
     C*
     C* HVIS F14 ER TRYKKET I UDEFINERT OMRÅDE VISES FØRSTE
     C* OG BESTE, HVIS DET FINNES NOE
     C                   SELECT
     C     *IN75         WHENEQ    '1'                                           AGENT
     C                   MOVE      SOTXT1        XSKMOT            8
     C                   MOVE      WSKNA         XSKKNR
     C                   GOTO      STVISO
     C     *IN77         WHENEQ    '1'                                           SELGER
     C                   MOVE      SOTXT2        XSKMOT            8
     C                   MOVE      WSKNS         XSKKNR
     C                   GOTO      STVISO
     C     *IN99         WHENEQ    '1'                                           SELGERS MOTAGER
     C                   MOVE      SOTXT3        XSKMOT            8
     C                   MOVE      WSKNSF        XSKKNR
     C                   GOTO      STVISO
     C     *IN76         WHENEQ    '1'                                           KJØPER
     C                   MOVE      SOTXT4        XSKMOT
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C     *IN98         WHENEQ    '1'                                           KJØPERS MOTAGER
     C                   MOVE      SOTXT5        XSKMOT
     C                   MOVE      WSKNKF        XSKKNR
     C                   GOTO      STVISO
     C                   ENDSL
     C*
     C*
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
     C*
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR
     C                   PARM                    XSKMOT
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
     C                   GOTO      SLVISO
     C*
     C*
     C     SLVISO        ENDSR
     C*
     C***********************************************
     C     SØKVAD        BEGSR
     C***********************************************
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    WSKNK
     C                   PARM                    WSNAK
     C                   PARM                    WSADK1
     C                   PARM                    WSADK2
     C                   PARM                    WSADK3
     C                   PARM                    WSLAND            2
     C                   PARM                    UADRNR            5
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FRABR         BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFI10P'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   PARM                    XFBNR
     C                   PARM                    TEST              1
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C*
     C     TEST          IFEQ      '2'
     C                   CALL      'SYFI10A'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XFBNR
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   PARM                    TEST
     C                   MOVE      *BLANKS       TEST
     C                   END
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C  N12UFLAGG        COMP      7                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     IFRABR        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFI10B'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   PARM                    XSTLF
     C                   PARM                    XKTLF
     C                   PARM                    KFRCP
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C*
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     EFRABR        BEGSR
     C***********************************************
     C                   MOVEL     *BLANKS       DSTINF
     C                   OUT       LDADS
     C                   MOVE      'N'           XANRUT            1
     C                   MOVE      'N'           XFLYTM            1
     C                   Z-ADD     0             UFLAGG
     C                   Z-add     1             uulope            3 0
     C     wspk5         IFEQ      'S'
     C                   CALL      'SYEF10C'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    uulope
     C                   PARM                    XSTLF
     C                   PARM                    XKTLF
     C                   PARM                    XANRUT
     C                   PARM                    XFLYTM
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C                   ELSE
     C                   CALL      'SYEF10C'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    uulope
     C                   PARM                    XSTLF
     C                   PARM                    XKTLF
     C                   PARM                    XANRUT
     C                   PARM                    XFLYTM
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C                   END
     C*
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FAKTUR        BEGSR
     C***********************************************
     C                   EXSR      TESTKT
     C                   MOVE      'N'           OTIAUT            1              KRAV=auto
     C*
     C     OTIKU1        IFNE      *ZEROS
     C* FØRST KUNDE 1
     C                   MOVE      OTIKU1        OTIKNR
     C     OTI0          TAG
     C                   MOVE      WSAVD         OTIAVD
     C     OTI1          TAG
     C                   MOVE      'N'           OTIJN             1
     C     OTIKEY        SETLL     CUOTI
     C     OTIKEY        READE     CUOTI                                  33
     C     *IN33         DOWEQ     '0'
      * Kundespesif. søkevei.. Finnes koden fra før/hvis ikke lag den
     C                   MOVE      'J'           OTIJN
     C                   MOVE      WSAVD         FSAVD
     C                   MOVE      WSOPD         FSOPD
     C                   MOVE      COKODE        FSKODE
     C     FSOKEY        CHAIN     FRISOK                             33
     C  N33              UPDATE    FRISOKR
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       FSSOK
     C     FSKODE        CHAIN     KODFRI                             33
     C  N33              MOVE      KFSODK        FSDOKK
     C   33              MOVE      *BLANKS       FSDOKK
     C                   MOVE      HEDTOP        FSDTOP
     C                   WRITE     FRISOKR
     C                   END
      *  Hvis kravfelt.. er det utfyllt ...  hvis ikke AUTO INN..
     C     COKRAV        IFEQ      '1'
     C     COKRAV        OREQ      '2'
     C     FSSOK         IFEQ      *BLANKS
     C                   MOVE      'J'           OTIAUT                           KRAV=AUTO
     C                   END
     C                   END
     C     OTIKEY        READE     CUOTI                                  33
     C                   END
      * Hvis ingenting fantes på spesifik avdeling, prøv med 0 i avd.
     C     OTIJN         IFEQ      'N'
     C     OTIAVD        ANDNE     *ZEROS
     C                   MOVE      *ZEROS        OTIAVD
     C                   GOTO      OTI1
     C                   END
      * DERETTER KUNDE 2  HVIS FORSKJ. FRA KUNDE 1
     C     OTIKU2        IFNE      *ZEROS
     C                   MOVE      OTIKU2        OTIKNR
     C                   MOVE      *ZEROS        OTIKU2
     C                   GOTO      OTI0
     C                   END
      *
      * HVIS UTILFREDSSTILTE KRAVFELT - AUTO-VIS FRIE SØKEV.
     C     OTIAUT        IFEQ      'J'
     c                   move      WSKNSF        OTIKU1
     C                   MOVE      *ZEROS        OTIKU2
     C     WSKNKF        IFNE      *zeros
     C     WSKNKF        andne     WSKNSF
     C     OTIKU1        ifeq      *zeros
     C                   MOVE      WSKNKF        OTIKU1
     C                   else
     C                   MOVE      WSKNKF        OTIKU2
     C                   end
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   END
      *
     C                   END
      *
     C                   Z-ADD     0             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   16              Z-ADD     6             UFLAGG
     C                   MOVE      *ZEROS        UKFRA             7 0
     C                   MOVE      ' '           WSMELD            1
     C     UFLAGG        IFEQ      3
     C     UFLAGG        OREQ      6
     C                   GOTO      BAT
     C                   END
     C                   CALL      'SYFI10X'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XNYGML
     C                   PARM                    KO2UTL
     C                   PARM                    XKUTL
     C                   PARM                    XSUTL
     C                   PARM                    XKUMIN
     C                   PARM                    XSUMIN
     C                   PARM                    KO2MVK
     C                   PARM                    KO2MVS
     C                   PARM                    UKFRA
     C                   PARM                    KOVAVR
     C                   PARM                    WSMSG
     C                   PARM                    WSMELD
     C                   PARM                    UFLAGG
     C                   PARM                    UKODE
     C                   PARM                    USECUR            6
     C                   GOTO      UTFAK
     C     BAT           TAG
     C                   MOVEL     FIFIRM        QDA01
     C                   MOVEL     WSAVD         QDA02
     C                   MOVEL     WSOPD         QDA03
     C                   MOVEL     XNYGML        QDA04
     C                   MOVEL     KO2UTL        QDA05
     C                   MOVEL     XKUTL         QDA06
     C                   MOVEL     XSUTL         QDA07
     C                   MOVEL     XKUMIN        QDA08
     C                   MOVEL     XSUMIN        QDA09
     C                   MOVEL     KO2MVK        QDA10
     C                   MOVEL     KO2MVS        QDA11
     C                   MOVEL     UKFRA         QDA12
     C                   MOVEL     KOVAVR        QDA13
     C                   MOVEL     WSMSG         QDA14
     C                   MOVEL     WSMELD        QDA15
     C                   MOVEL     UFLAGG        QDA16
     C                   MOVEL     UKODE         QDA17
     C                   MOVEL     USECUR        QDA18
     C                   MOVEL     'SYFI10XQ'    QDTAQ            10
     C                   MOVEL     '*LIBL'       QLIB             10
     C                   Z-ADD     109           QRLEN             5 0
     C                   CALL      'QSNDDTAQ'
     C                   PARM                    QDTAQ
     C                   PARM                    QLIB
     C                   PARM                    QRLEN
     C                   PARM                    QDATA
     C     UTFAK         TAG
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C   16              MOVE      HEOPD         WSOPDG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N05  c     POSNBR        ifgt      8
N05  C                   EXSR      SØKKUN
N05  c                   else
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNA
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     54            POSNBR
N05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     54
     C     POSNBR        ANDLE     61
     C                   CALL      'SYTR04A'
     C                   PARM                    WSKNT
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     10
     C     POSNBR        ANDLE     17
N05  c     POSNBR        ifgt      8
N05  C                   EXSR      SØKKUN
N05  c                   else
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNO
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     8             POSNBR
N05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C  N34LINNBR        IFEQ      7
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N05  c     POSNBR        ifgt      8
N05  C                   EXSR      SØKKUN
N05  c                   else
N04  C                   MOVE      WSNAS         UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNS
N02  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAS
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     42            POSNBR
N05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
N05  c     POSNBR        ifgt      42
N05  C                   EXSR      SØKKUN
N05  c                   else
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNSF
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     10            LINNBR
N02  C                   Z-ADD     19            POSNBR
N05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C  N32LINNBR        IFEQ      11
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
N05  c     POSNBR        ifgt      8
N05  C                   EXSR      SØKKUN
N05  c                   else
N04  C                   MOVE      WSNAK         UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNK
N02  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAK
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     42            POSNBR
N05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
N05  c     POSNBR        ifgt      42
N05  C                   EXSR      SØKKUN
N05  c                   else
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNKF
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     16            LINNBR
N02  C                   Z-ADD     2             POSNBR
n05  c                   endif
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     37
     C                   EXSR      SØKVAD
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     61
     C     POSNBR        ANDLE     80
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDL
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     12
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDF
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     23            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     23
s06  C*    POSNBR        ANDLE     27
n06  C     POSNBR        ANDLE     31
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDT
     C                   PARM                    UNVN             30
S06  C*                  PARM                    ULK               2
N06  C                   PARM                    FIRLK             2
N06  C                   MOVE      FIRLK         WSLKK
     C                   Z-ADD     38            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     53
     C     POSNBR        ANDLE     54
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKA
     C                   PARM                    USPED
     C                   Z-ADD     61            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   CALL      'SAD061I'
     C                   PARM                    WSTRM
     C                   Z-ADD     21            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     21
     C     POSNBR        ANDLE     22
     C                   MOVE      'N'           USPED
     C                   CALL      'SYFI10L'
     C                   PARM                    WSTRI
     C                   PARM                    USPED
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALS
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALK
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     3
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT
     C                   Z-ADD     5             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     5
     C     POSNBR        ANDLE     7
     C                   MOVE      'J'           USPED
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR
     C                   PARM      POSNBR        UPOS              3 0
     C                   Z-ADD     9             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     9
     C     POSNBR        ANDLE     10
     C                   CALL      'SYFA71A'
     C                   PARM                    WSKF
     C                   Z-ADD     12            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDEQ     12
     C                   MOVE      *BLANKS       XKFKOD
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP
     C                   PARM                    UUPDAT            1
     C                   PARM                    XKFKOD
     C                   MOVEL     XKFKOD        WSKFT1
     C                   Z-ADD     15            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     61
     C     POSNBR        ANDLE     63
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVERV
     C                   Z-ADD     65            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR ANTALL
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     31
S14  C*                  Z-ADD     WSNT          UNU132           13 2
N14  C                   Z-ADD     WSNT          UNU133           13 3
     C                   CALL      'SYGE11'
S14  C*                  PARM                    UNU132
N14  C                   PARM                    UNU133
S14  C*                  Z-ADD     UNU132        WSNT
N14  C                   Z-ADD(H)  UNU133        WSNT
     C                   Z-ADD     33            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR BRUTTOVEKT
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     59
     C     POSNBR        ANDLE     67
S14  C*                  Z-ADD     WSVKT         UNU132           13 2
N14  C                   Z-ADD     WSVKT         UNU133           13 3
     C                   CALL      'SYGE11'
S14  C*                  PARM                    UNU132
N14  C                   PARM                    UNU133
S14  C*                  Z-ADD     UNU132        WSVKT
N14  C                   Z-ADD(H)  UNU133        WSVKT
     C                   Z-ADD     69            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* FRAKTBEREGNINGSVEKT
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     69
     C     POSNBR        ANDLE     77
S14  C*                  Z-ADD     WSFBV         UNU132           13 2
N14  C                   Z-ADD     WSFBV         UNU133           13 3
     C                   CALL      'SYGE11'
S14  C*                  PARM                    UNU132
N14  C                   PARM                    UNU133
S14  C*                  Z-ADD     UNU132        WSFBV
N14  C                   Z-ADD(H)  UNU133        WSFBV
     C                   Z-ADD     9             POSNBR
     C                   Z-ADD     17            LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR KUBIKK
     C     LINNBR        IFEQ      17
     C     POSNBR        ANDGE     69
     C     POSNBR        ANDLE     77
S14  C*                  Z-ADD     WSM3          UNU132           13 2
N14  C                   Z-ADD     WSM3          UNU133           13 3
     C                   CALL      'SYGE11'
S14  C*                  PARM                    UNU132
N14  C                   PARM                    UNU133
S14  C*                  Z-ADD     UNU132        WSM3
N14  C                   Z-ADD(H)  UNU133        WSM3
     C                   Z-ADD     9             POSNBR
     C                   Z-ADD     17            LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
      *
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDEQ     80
     C                   MOVEL     WSKDPL        XUKOD
     C                   CALL      'SYKUKD'
     C                   PARM                    XUTYP
     C                   PARM                    UUPDAT
     C                   PARM                    XUKOD
     C                   MOVEL     XUKOD         WSKDPL
     C                   Z-ADD     19            LINNBR
     C                   Z-ADD     31            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C* VAREVERDI
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     65
     C     POSNBR        ANDLE     78
S14  C*                  Z-ADD     WSVERB        UNU132           13 2
N14  C                   Z-ADD     WSVERB        UNU133           13 3
     C                   CALL      'SYGE11'
S14  C*                  PARM                    UNU132
N14  C                   PARM                    UNU133
S14  C*                  Z-ADD     UNU132        WSVERB
N14  C                   Z-ADD(H)  UNU133        WSVERB
     C                   Z-ADD     2             POSNBR
     C                   Z-ADD     20            LINNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C*
     C     LINNBR        IFEQ      21
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     3
     C                   CALL      'SYFI10H'
     C                   PARM                    W2TOLL
     C                   Z-ADD     20            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     UTCMDL        BEGSR
     C***********************************************
     C     XCMD          IFEQ      0
     C                   MOVE      'DIV0032'     MSGLN1
     C                   MOVE      'DIV0033'     MSGLN2
     C                   MOVE      'DIV0024'     MSGLN3
     C                   MOVE      'DIV0029'     MSGLN4
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      1
     C                   MOVE      'DIV0037'     MSGLN1
     C  N31              MOVE      'DIV0035'     MSGLN2
     C   31              MOVE      'DIV0000'     MSGLN2
     C                   MOVE      'DIV3572'     MSGLN3
     C  N31              ADD       1             XCMD
     C   31              Z-ADD     0             XCMD
     C                   ELSE
     C     XCMD          IFEQ      2
     C                   MOVE      'DIV0020'     MSGLN1
     C                   MOVE      'DIV0030'     MSGLN2
     C                   MOVE      'DIV0031'     MSGLN3
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C     XCMD          IFEQ      3
     C                   MOVE      'SHU0127'     MSGLN1
     C                   MOVE      'DIV0000'     MSGLN2
     C                   MOVE      'JOV0803'     MSGLN3
N15  C                   ADD       1             XCMD              1 0
N15  C                   ELSE
     C                   MOVE      'SHU1679'     MSGLN1
     C                   MOVE      'DIV0000'     MSGLN2
     C                   MOVE      'DIV0000'     MSGLN3
     C                   Z-ADD     0             XCMD              1 0
N15  C                   END
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
N06  C     WSSDFK        KLIST
N06  C                   KFLD                    WSLKA
N06  C                   KFLD                    WSSDF
N06  C     WSSDTK        KLIST
N06  C                   KFLD                    FIRLK             2
N06  C                   KFLD                    WSSDT
N06  C     WKSDFF        KLIST
N06  C                   KFLD                    WSLKS
N06  C                   KFLD                    WSSDFF
N06  C     WKSDVT        KLIST
N06  C                   KFLD                    WSLKK
N06  C                   KFLD                    WSSDVT
     C     KEYLAG        KLIST
     C                   KFLD                    WSGNBE
     C     FIRAVD        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
     C     OAVTKS        KLIST
     C                   KFLD                    WSKNK
     C                   KFLD                    WSOT
     C     KOTRKE        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    XXKNSY            8 0
     C                   KFLD                    HEKNT
     C*
     C     HEADFK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     HEADKK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     FREETK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     DOKUFK        KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     DOKUTK        KLIST
     C                   KFLD                    XDTSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     KODTAK        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    XVUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    XSFUNI
     C                   KFLD                    WSSG
     C     KODTEK        KLIST
     C                   KFLD                    XTEUNI
     C                   KFLD                    WSSDL1
     C     KODOTK        KLIST
     C                   KFLD                    XOTUNI
     C                   KFLD                    WSOT
     C     KODO2K        KLIST
     C                   KFLD                    XO2UNI
     C                   KFLD                    WSOT
     C     KODLIK        KLIST
     C                   KFLD                    KLIUNI
     C                   KFLD                    KLIKOD
     C     KODTSK        KLIST
     C                   KFLD                    XTSUNI
     C                   KFLD                    W2TOLL
N06  C     KODGEK        KLIST
N06  C                   KFLD                    XGEUNI
N06  C                   KFLD                    WSVALT
     C     KODFRK        KLIST
     C                   KFLD                    XFRUNI
     C                   KFLD                    WSFR
     C     KODLKK        KLIST
     C                   KFLD                    XLKUNI
     C                   KFLD                    WSLKA
     C     KODS2K        KLIST
     C                   KFLD                    XS2UNI
     C                   KFLD                    WSTRI
     C     KODS4K        KLIST
     C                   KFLD                    XS4UNI
     C                   KFLD                    WSTRM
     C     KODVAK        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KVAKOD
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'C'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    XVADRN
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNT
     C     KOFASK        KLIST
     C                   KFLD                    XKFTYP
     C                   KFLD                    XKFKOD
     C                   MOVEL     'UTLKOD'      XKFTYP
     C     KUFASK        KLIST
     C                   KFLD                    XUTYP
     C                   KFLD                    XUKOD
     C                   MOVEL     'PRODTYPE'    XUTYP
     C     *LIKE         DEFINE    KFTYP         XUTYP
     C     *LIKE         DEFINE    KFKOD         XUKOD
     C                   MOVE      'N'           UUPDAT            1
     C     *LIKE         DEFINE    KFTYP         XKFTYP
     C     *LIKE         DEFINE    KFKOD         XKFKOD
     C     UTLLGK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    YUTLDT            8 0
     C                   MOVE      '99999999'    YUTLDT
     C     UTLL2K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     OTIKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    OTIKNR            8 0
     C                   KFLD                    OTIAVD            4 0
     C     FSOKEY        KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
     C     KUNKO2K       KLIST
     C                   KFLD                    NKN
     C                   KFLD                    KUINTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    USG               3
     C                   PARM                    UTYPE             3
     C*** UKODE = 'O' CALL FROM SYFF10CLO
     C*** UKODE = 'S' CALL FROM SYFF10CLS
     C*** UKODE = 'K' CALL FROM SYFF10CLK
     C*** UKODE = 'A' CALL FROM ?????????
     C*** UKODE = 'Z' KALLE FRA SYOP21R
     C                   PARM                    UKODE             1
     C                   PARM                    UDUMMY            1
     C                   PARM                    UAVDNY            4 0
     C*** UENDRE = ' ' CALL FROM SYFI10CL
     C                   CLEAR                   BILDE01
     C                   CLEAR                   BILDE02
     C                   CLEAR                   HEADFR
     C                   MOVE      *ZEROS        *IN
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C     UKODE         IFEQ      'Z'
     C                   MOVE      UKODE         XKODE             1
     C                   MOVE      ' '           UKODE
     C                   END
     C     UTYPE         IFEQ      'CHG'
     C     UTYPE         OREQ      'CHF'
     C     UTYPE         OREQ      'CHO'
     C                   MOVE      UOPD          WSOPD
     C                   ELSE
     C                   MOVE      '1'           *IN58
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      UAVD          HEAVD
     C                   MOVE      UOPD          HEOPD
     C                   MOVE      *ZEROS        UOPD
     C                   MOVE      UAVDNY        WSAVD
     C                   END
     C                   END
      *
     C     UKODE         IFEQ      'A'
     C                   SETON                                        3234
     C                   ELSE
     C     UKODE         COMP      'K'                                    32    KUN KJØPER
     C     UKODE         COMP      'S'                                    34    KUN SELGER
     C                   END
     C*
N05  C                   Z-ADD     6             SOANTK            1 0
N05  C                   MOVE      *BLANKS       SOTXT6            8
N05  C                   MOVE      *BLANKS       SOTXT7            8
N05  C                   MOVE      *BLANKS       SOTXT8            8
N05  C                   MOVE      *ZEROS        SOKNR6            8 0
N05  C                   MOVE      *ZEROS        SOKNR7            8 0
N05  C                   MOVE      *ZEROS        SOKNR8            8 0
     C*
     C     *LIKE         DEFINE    WSAVD         AVDZER
     C                   MOVE      'J'           USØK              1
     C                   MOVE      'F'           XDFSTA            1
     C                   MOVE      'T'           XDTSTA            1
     C                   MOVE      '001'         XFBNR             3 0
     C                   MOVE      'A'           XAUNI             1
     C                   MOVE      'V'           XVUNI             1
     C                   MOVE      'SF'          XSFUNI            2
     C                   MOVE      'TERM'        XTEUNI            4
     C                   MOVE      'OTY'         XOTUNI            3
     C                   MOVE      'O2Y'         XO2UNI            3
     C                   MOVE      'TST'         XTSUNI            3
     C                   MOVE      'FR'          XFRUNI            2
N06  C                   MOVE      'GE'          XGEUNI            2
     C                   MOVE      'LK '         XLKUNI            3
     C                   MOVE      'S2 '         XS2UNI            3
     C                   MOVE      'S4 '         XS4UNI            3
     C                   MOVE      'LIKO'        KLIUNI
     C                   MOVE      'VA'          XVAUNI            2
     C                   MOVE      *ZEROS        XFXLNR            2 0
     C                   MOVE      '00001'       XVADRN            5 0
     C*
     C                   MOVE      'DIV1064'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT1            8
     C                   MOVE      'DIV1060'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT2            8
     C*
     C                   MOVE      'SHU0917'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     62            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          MANGLE           62
     C                   MOVE      'DIV1061'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT3            8
     C                   MOVE      'DIV1062'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT4            8
     C                   MOVE      'DIV1063'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT5            8
     C                   MOVE      'DIV0608'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     62            XMSGL
     C                   EXSR      HENTMS
      *
     C                   MOVEL     SKTXT1        SOTXT6            8
     C*
     C                   MOVE      *BLANKS       FIFIRM
     C     FIFIRM        SETLL     FIRM                               33
     C                   READ      FIRM                                   33
     C                   EXSR      UTCMDL
     C                   MOVEA     *ZEROS        AN
     C                   MOVEA     *ZEROS        BR
     C                   MOVEA     *ZEROS        LE
     C                   MOVEA     *ZEROS        HØ
     C*
N06  C                   MOVE      FILAND        WSLKK
N06  C                   MOVE      FILAND        FIRLK
     C                   ENDSR
     C*
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             62
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
      * Gir local data area navnet LDADS internt i programmet.
      * Dette for å få oppdatert LDA etter å ha hentet routing
     C     *DTAARA       DEFINE    *LDA          LDADS
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISFRE        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   ENDSR
     C*
     C***********************************************
     C     CALTDV        BEGSR
     C***********************************************
     C                   CALL      'TDV01R'
     C                   PARM                    WSSG
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   ENDSR
     C*
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      'STR'         TTACTI
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      UUSR          TTUSER
     C                   MOVEL     'Order en'    XXTEXT           16
     C                   MOVE      'tered   '    XXTEXT
     C                   MOVEL     XXTEXT        TTTEXT
N08  C                   EVAL      TTTEXL='Ordre opprettet'
     C                   WRITE     TRACKFR
      *
      * ETD/ATD - ETA/ATA - TIDSOPPFØLGING. (EGEN FIL TRACKT)
      * (KUNNE TENKES Å VÆRE KUNDESTYRT... RESERVERT KODE I CUOTI???)
     C                   CLEAR                   TRACKTR
     C                   MOVE      HEAVD         TXAVD
     C                   MOVE      HEOPD         TXOPD
     C                   MOVE      *ZEROS        TXETDD
     C                   MOVE      *ZEROS        TXETDK
     C                   MOVE      HEDTOP        TXETAD
     C                   MOVE      *ZEROS        TXETAK
     C                   WRITE     TRACKTR
     C                   ENDSR
     C***********************************************
     C     SOKUKU        BEGSR
     C***********************************************
     C     VADKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    WSKURE
     C     VADKEY        CHAIN     VADR3                              33
     C  N33              DO
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C                   END                                                      3<-E
     C                   ENDSR
     C*
     C***********************************************
     C     TESTKT        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        OTIKU1            8 0
     C                   MOVE      *ZEROS        OTIKU2            8 0
     C     WSKDFS        IFNE      'X'
     C                   MOVE      WSKNSF        OTIKU1
     C                   END
     C     WSKDFK        IFNE      'X'
     C     OTIKU1        IFEQ      *ZEROS
     C                   MOVE      WSKNKF        OTIKU1
     C                   ELSE
     C                   MOVE      WSKNKF        OTIKU2
     C                   END
     C                   END
     C                   ENDSR
     C******************************************
     C     FINNVK        BEGSR
     C******************************************
     C*
     C* FINNER FRAKTBEREGNINGSVEKT
     C*
     C                   MOVE      WSVKT         WSFBV
     C     WSM3          MULT(H)   KOVKKG        XFBV2             9 0
     C     WSFBV         IFLT      XFBV2
     C                   Z-ADD     XFBV2         WSFBV
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     KUBIKK        BEGSR
     C***********************************************
     C                   MOVE      'J'           XFLYTM
     C* SUBROUTINE FOR CUBIKK
     C                   CALL      'SYIN10B'
n11  C                   PARM                    UUavd             4 0
n11  C                   PARM                    UUopd             7 0
n11  C                   PARM                    UUfbn             3 0
     C                   PARM                    XFLYTM            1
     C                   PARM                    UM3               7 3
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C     UM3           IFNE      *ZEROS
     C                   Z-ADD     UM3           WSM3
     C                   END
     C*
     C                   EXSR      FINNVK
     C                   ENDSR
N10   *______________________________________________
N10   * Duplikatkontroll på Agentreferanse     DUPCTL
N10   *""""""""""""""""""""""""""""""""""""""""""""""
N10  C     DUPCTL        BEGSR
N10  C                   EVAL      *IN33=*OFF
N10  C                   CALL      'SYGE68'
N10  C                   PARM                    WSRFA
N10  C                   PARM                    WSAVD
N10  C                   PARM                    WSOPD
N10  C                   PARM                    FINSF             1
N10  C     FINSF         IFEQ      'J'
N10  C                   MOVE      'N'           WSJNAW
N10  C                   EXFMT     BILDEAW
N10  C                   ENDIF
N10  C                   MOVE      WSRFA         WSRFAN           15
N10  C                   ENDSR
