      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KUNDERS LIKVIDITESKODER   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-29 31-90 95-97                ***
      ***********************************************************
      *
     FCUNDL02   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FKODTCC    UF A E           K DISK
     FSYFI11FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KUND2K        SETLL     CUNDL02
     C     START1        TAG
     C     FIFIRM        READE     CUNDL02                                94
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        17
     C                   ADD       1             ZRECNO
     C     KODCCK        CHAIN     KODTCC                             99
     C   99              EXSR      MOVB1
     C  N99              UPDATE    KODTCCR
     C                   WRITE     SUBFIL
     C     FIFIRM        READE     CUNDL02                                94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   END
     C*
     C*** ENDRE
     C     START5        TAG
     C                   EXFMT     VARELI
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C* TEST OM TIDLIGER AVTALE
     C     KODCCK        CHAIN     KODTCCR                            99
     C  N99WCCCC         IFEQ      *ZEROS
     C     WCCVA         IFEQ      *ZEROS
     C                   DELETE    KODTCCR
     C                   EXSR      MOVB1
     C                   SETON                                        99
     C                   GOTO      STTB1
     C                   END
     C                   END
     C*
     C                   EXSR      MOVWCC
     C   99              WRITE     KODTCCR
     C  N99              UPDATE    KODTCCR
     C                   SETOFF                                       99
     C*
     C     STTB1         TAG
     C                   UPDATE    SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C                   EXSR      MOVCCW
     C                   MOVE      ' '           WSNR
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     MOVWCC        BEGSR
     C***********************************************
     C                   MOVE      WCCCC         KCCCC
     C                   MOVE      WCCVA         KCCVA
     C                   MOVE      WCCMI         KCCMI
     C                   MOVE      KUNDNR        KCCKN
     C                   MOVE      FIFIRM        KCCFI
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVCCW        BEGSR
     C***********************************************
     C                   MOVE      KCCCC         WCCCC
     C                   MOVE      KCCVA         WCCVA
     C                   MOVE      KCCMI         WCCMI
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        KCCKN
     C                   MOVE      *ZEROS        KCCCC
     C                   MOVE      *ZEROS        KCCVA
     C                   MOVE      *ZEROS        KCCMI
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WCCCC
     C                   MOVE      *ZEROS        WCCVA
     C                   MOVE      *ZEROS        WCCMI
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODCCK        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     KUND2K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2NAVN
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   99
     C*
     C                   ENDSR
     C*
