      *
      ***********************************************************
      *** PROGRAM SKAL SØKE LANDKODER                         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 07-11 13-24
      *** LEDIGE INDIKATORER 31-90 95-97 99
      ***********************************************************
      *
     FKODTLK    IF   E           K DISK
     FKODTLKLF  IF   E           K DISK
     F                                     RENAME(KODTLKR:KODTLKRL)
     FKODTS2    IF   E           K DISK
     FKODTS2LF  IF   E           K DISK
     F                                     RENAME(KOS2R:KOS2RL)
     FSYFI10FL  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  KLKLK                  1      2
     D  KS2LK                  1      2
     D  WSLK                   1      2
     D                 DS
     D  XNVNM                  1     30
     D  XFTXM                  1     55
     D  AL                     1     55
     D                                     DIM(55)
     D                 DS
     D  KS2FTX                 1     55
     D  KLKNVN                 1     30
     D  WSNVN                  1     20
     D                 DS
     D  W2FTX                  1     55
     D  W2NVN                  1     30
     D  W2SØK                  1     20
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27
     CANN28KODLKK        SETLL     KODTLK
     C  N27
     CAN 28KODLLK        SETLL     KODTLKLF
     C   27
     CANN28KODS2K        SETLL     KODTS2
     C   27
     CAN 28KODSLK        SETLL     KODTS2LF
     C     START1        TAG
     C  N27
     CANN28              READ      KODTLK                                 94
     C  N27
     CAN 28              READ      KODTLKLF                               94
     C   27
     CANN28              READ      KODTS2                                 94
     C   27
     CAN 28              READ      KODTS2LF                               94
     C  N94
     CANN27
     CAN 28KLKNVN        COMP      XNVNM                              94
     C  N94
     CAN 27
     CAN 28KS2FTX        COMP      XFTXM                              94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27
     CANN28              READ      KODTLK                                 94
     C  N27
     CAN 28              READ      KODTLKLF                               94
     C   27
     CANN28              READ      KODTS2                                 94
     C   27
     CAN 28              READ      KODTS2LF                               94
     C  N94
     CANN27
     CAN 28KLKNVN        COMP      XNVNM                              94
     C  N94
     CAN 27
     CAN 28KS2FTX        COMP      XFTXM                              94
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *** LAGE NY
     C   06              DO
     C  N27              DO
     C                   MOVE      ' '           UPLUKK            1
     C                   CLEAR                   ULAKO
     C                   CALL      'SYEX05'
     C                   PARM                    ULAKO
     C                   PARM                    UPLUKK
     C                   ENDDO
     C   27              CALL      'SAD002'
     C                   GOTO      START
     C                   END
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2LK          ANDNE     *BLANKS
     C                   MOVE      W2LK          ULK
     C                   GOTO      SLUTT
     C                   END
     C     W2LK          IFNE      *BLANKS
     C                   MOVE      '0'           *IN28
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   MOVE      '1'           *IN28
     C                   EXSR      FINMAX
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     FINMAX        BEGSR
     C***********************************************
     C  N27              MOVE      W2NVN         XNVNM
     C   27              MOVE      W2FTX         XFTXM
     C  N27              Z-ADD     30            XN                2 0
     C   27              Z-ADD     55            XN                2 0
     C     STSMAX        TAG
     C     AL(XN)        IFEQ      ' '
     C                   MOVE      '9'           AL(XN)
     C                   SUB       1             XN
     C     XN            IFGE      1
     C                   GOTO      STSMAX
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      WSLK          ULK
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    KLKLK         ULAKO
      *
     C     KODLKK        KLIST
     C                   KFLD                    KLKUNI
     C                   KFLD                    W2LK
     C     KODLLK        KLIST
     C                   KFLD                    W2NVN
     C     KODS2K        KLIST
     C                   KFLD                    KS2UNI
     C                   KFLD                    W2LK
     C     KODSLK        KLIST
     C                   KFLD                    W2FTX
      *
     C     *ENTRY        PLIST
     C                   PARM                    ULK               2
     C                   PARM                    USPED             1
     C     USPED         COMP      'J'                                2727
      *
     C                   MOVE      *BLANKS       W2FTX
     C                   MOVE      ULK           W2LK
     C                   MOVE      'LK '         KLKUNI
     C                   MOVE      'S2 '         KS2UNI
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
