      *
      ***********************************************************
      *** PROGRAM SKAL SØKE STEDSKODER ZIP                    ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 07-11 13-24
      *** LEDIGE INDIKATORER 31-90 95-97 99
      ***********************************************************
      *
     FSTED2D22  IF   E           K DISK
     FSTED2S    IF   E           K DISK
     F                                     RENAME(STED2R:STED2RS)
     FSTED2A    IF   E           K DISK
     F                                     RENAME(STED2R:STED2RA)
     FSTED2D2   IF   E           K DISK
     F                                     RENAME(STED2R:STED2RD)
     FSYFI10FN  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  XNVNM                  1     30
     D  AL                     1     30
     D                                     DIM(30)
     D                 DS
     D  ST2NVN                 1     30
     D  WSNVN                  1     17
     D                 DS
     D  W2SØK                  1     30
     D  W2NVN                  1     17
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27
     CANN28ST2KEY        SETLL     STED2D22
     C  N27
     CAN 28ST2DK         SETLL     STED2D2
     C   27
     CANN28ST2SK         SETLL     STED2S
     C   27
     CAN 28ST2AK         SETLL     STED2A
     C     START1        TAG
     C  N27
     CANN28              READ      STED2D22                               94
     C  N27
     CAN 28W2LK          READE     STED2D2                                94
     C   27
     CANN28              READE     STED2S                                 94
     C   27
     CAN 28W2LK          READE     STED2A                                 94
     C  N94
     CANN27ST2NVN        COMP      XNVNM                              94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27
     CANN28              READ      STED2D22                               94
     C  N27
     CAN 28W2LK          READE     STED2D2                                94
     C   27
     CANN28              READ      STED2S                                 94
     C   27
     CAN 28W2LK          READE     STED2A                                 94
     C  N94
     CANN27ST2NVN        COMP      XNVNM                              94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     *IN29         IFEQ      '0'
     C     W2NVN         ANDEQ     *BLANKS
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     15            POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C     *IN04         IFEQ      '0'
     C                   MOVE      *BLANKS       W2UNI
     C                   MOVE      *BLANKS       W2NVN
     C                   END
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *
     C   04              DO
     C                   MOVE      'N'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    W2LK
     C                   PARM                    USPED
     C                   GOTO      START3
     C                   END
      *** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY
     C   06WSECUR        IFNE      '*SECU'
     C                   CALL      'SYFA34'
     C                   GOTO      START
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2UNI         ANDNE     *BLANKS
     C                   MOVE      W2UNI         USDK
     C     W2LK          IFNE      *BLANKS
     C                   MOVE      W2LK          ULK
     C                   END
     C                   GOTO      SLUTT
     C                   END
     C     W2UNI         IFNE      *BLANKS
     C     W2LK          IFEQ      *BLANKS
     C                   MOVEA     '00'          *IN(27)
     C                   ELSE
     C                   MOVEA     '01'          *IN(27)
     C                   END
     C                   GOTO      START
     C                   END
     C     W2NVN         IFNE      *BLANKS
     C     W2LK          IFEQ      *BLANKS
     C                   MOVEA     '10'          *IN(27)
     C                   ELSE
     C                   MOVEA     '11'          *IN(27)
     C                   END
     C                   EXSR      FINMAX
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     FINMAX        BEGSR
     C***********************************************
     C                   MOVEL     W2NVN         XNVNM
     C                   Z-ADD     30            XN                2 0
     C     STSMAX        TAG
     C     AL(XN)        IFEQ      ' '
     C                   MOVE      '9'           AL(XN)
     C                   SUB       1             XN
     C     XN            IFGE      1
     C                   GOTO      STSMAX
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      ST2UNI        USDK
     C                   MOVE      ST2LK         ULK
     C                   MOVEL     ST2NVN        UNVN
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     ST2KEY        KLIST
     C                   KFLD                    W2UNI
     C     ST2DK         KLIST
     C                   KFLD                    W2LK
     C                   KFLD                    W2UNI
     C     ST2SK         KLIST
     C                   KFLD                    W2SØK
     C     ST2AK         KLIST
     C                   KFLD                    W2LK
     C                   KFLD                    W2SØK
      *
     C     *ENTRY        PLIST
     C                   PARM                    USDK              9
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
      *
     C                   MOVE      USDK          WSECUR            9
     C                   MOVEL     'ZZZ'         XNVNM
     C     USDK          IFNE      *BLANKS
     C     USDK          ANDNE     '*SECR'
     C                   MOVE      USDK          W2UNI
     C     ULK           IFEQ      *BLANKS
     C                   MOVEA     '00'          *IN(27)
     C                   ELSE
     C                   MOVE      ULK           W2LK
     C                   MOVEA     '01'          *IN(27)
     C                   END
     C                   ELSE
     C     ULK           IFEQ      *BLANKS
     C                   MOVEA     '10'          *IN(27)
     C                   ELSE
     C                   MOVE      ULK           W2LK
     C                   MOVEA     '11'          *IN(27)
     C                   END
     C                   MOVE      UNVN          W2SØK
     C                   EXSR      FINMAX
      *
     C  N28ST2SK         SETLL     STED2S                             33
     C   28ST2AK         SETLL     STED2A                             33
     C  N28              READ      STED2S                                 33
     C   28W2LK          READE     STED2A                                 33
     C  N33ST2NVN        IFLE      XNVNM
     C                   MOVE      ST2LK         XLK               2
     C                   MOVE      ST2UNI        XSDK              9
     C                   MOVE      ST2NVN        XNVN             30
     C  N28              READ      STED2S                                 33
     C   28W2LK          READE     STED2A                                 33
     C  N33ST2NVN        IFGT      XNVNM
     C                   MOVE      XLK           ULK
     C                   MOVE      XSDK          USDK
     C                   MOVE      XNVN          UNVN
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   END
      *
     C                   END
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
