      *
     FHEAD18    IF   E           K DISK
     D                 DS
     D  HEGN                   1     15
     D  HEGNUN                 1     12
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  UHOD                  47     47
     D  UBBS                  48     48
     D  UDATO                 64     69  0
     D  UOT1                  70     71
     D  UOT2                  72     73
     D  UOT3                  74     75
     D  UOT4                  76     77
     D  UOT5                  78     79
     D  USUM                  80     80
     D  UGN                  981    995
     D  UGNUNI               981    992
     D  UGNNR                993    995  0
      *
      *
      *
     C                   EXSR      INIT
      *
      *
      *
      *
     C     UGN           SETLL     HEAD18
     C     START         TAG
     C                   READ      HEAD18                                 33
     C  N33UGNUNI        COMP      HEGNUN                             3333
     C   33              MOVE      *BLANKS       GODS
     C   33              GOTO      SLUTT
      *
      *
     C     HEUR          IFEQ      'B'
     C     HEUR          OREQ      'D'
     C                   GOTO      START
     C                   END
     C* UTELAT OPPDRAGSTYPER
     C     UOT1          IFNE      *BLANKS
     C     UOT2          ORNE      *BLANKS
     C     UOT3          ORNE      *BLANKS
     C     UOT4          ORNE      *BLANKS
     C     UOT5          ORNE      *BLANKS
     C     HEOT          IFEQ      UOT1
     C     HEOT          OREQ      UOT2
     C     HEOT          OREQ      UOT3
     C     HEOT          OREQ      UOT4
     C     HEOT          OREQ      UOT5
     C                   GOTO      START
     C                   ENDIF                                                  <HEOT
     C                   ENDIF                                                  <UOT1
     C*
     C                   MOVE      HEGN          GODS
     C                   MOVE      HEAVD         UAVD
     C                   MOVE      HEGN          UGN
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UPRANT            2
     C                   PARM                    UIN03             1
     C                   PARM                    UIN04             1
     C                   PARM                    GODS             15
     C*
     C                   ADD       1             UGNNR
     C*
     C                   ENDSR
     C*
     C*
