      *
      ************************************************************
      *** PROGRAM SKAL LESE VALGBEGREPENE FOR Å OMSKRIVE       ***
      ***                   VANLIG FRAKTBREV                   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-29 31-97                       ***
      ************************************************************
      *
     FFIRM      IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FSYFKFBFM  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UPRO                  22     29  0
     D  ULG                   61     61
     D  UEKSP                 62     62
V10  D  UOPD                  82     88  0
V10  D  UFBNR                 89     91  0
     D*
     D* XBLA1/XBLA2 ER IKKE I BRUK. HVIS TAR NOEN POSISJONER TIL BRUK
     D* HUSK Å SYNKE STØRRELSE PÅ XBLA1/XBL2
     D  XBLA1                 92    256
     D  XBLA2                257    510
     D  UPRT5                701    710
     D  UPT5                 711    720
     D  UPRT6                721    730
     D  UPT6                 731    740
     D  UPRT7                741    750
     D  UPT7                 751    760
     I*
     C*
     C     KODTPK        KLIST
     C                   KFLD                    WSPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPLNR
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSAVD
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    WSFUNI
     C                   KFLD                    WSSG
     C*
     C     *ENTRY        PLIST
     C                   PARM                    ULG1              1
     C                   PARM                    UEKSP1            1
     C                   PARM                    UIN01             1
     C                   PARM                    UVB               1
     C                   MOVE      '0'           UIN01
     C                   MOVE      'L'           WSLG
     C                   MOVE      'N'           WSEXPR
     C                   Z-ADD     1             WSFBNR
     C*
     C                   MOVE      'P'           WSPUNI            1
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'W'           WSWUNI            1
     C                   MOVE      'SF'          WSFUNI            2
     C                   MOVE      *ZEROS        UPRO
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C* BLANKE DE FELTENE SOM IKKE ER I BRUK
     C                   MOVE      *BLANKS       XBLA1
     C                   MOVE      *BLANKS       XBLA2
     C*
     C     FIFIRM        CHAIN     FIRM                               99
     C                   READ      FIRM                                   99
     C                   MOVE      FIFIRM        UFIRM
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       30
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C  N99              Z-ADD     5             WSPLNR            3 0
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT5
     C  N99              MOVE      KOPTY         UPT5
     C  N99              Z-ADD     6             WSPLNR
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT6
     C  N99              MOVE      KOPTY         UPT6
     C  N99              Z-ADD     7             WSPLNR
     C  N99KODTPK        CHAIN     KODTP                              99
     C  N99              MOVE      KOPNVN        UPRT7
     C  N99              MOVE      KOPTY         UPT7
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C*
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSSG          USG
V10  C*                  MOVEL     WSOPD         UPRO
V10  C*                  MOVE      WSFBNR        UPRO
V10  C                   MOVE      *ZEROS        UPRO
V10  C                   MOVE      WSOPD         UOPD
V10  C                   MOVE      WSFBNR        UFBNR
     C                   MOVE      WSLG          ULG
     C                   MOVE      WSLG          ULG1
     C                   MOVE      WSEXPR        UEKSP
     C                   MOVE      WSEXPR        UEKSP1
     C                   MOVE      WSVALG        UVB
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT5
     C                   MOVE      WSPRT         UPRT6
     C                   MOVE      WSPRT         UPRT7
     C                   END
     C     UPRT5         IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT5
     C                   END
     C     UPT5          IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT5
     C                   END
     C     UPRT6         IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT6
     C                   END
     C     UPT6          IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT6
     C                   END
     C     UPRT7         IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT7
     C                   END
     C     UPT7          IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT7
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
