      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KUNDERS LIKVIDITESKODER   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-89 95-97    ***
      ***********************************************************
      *
     FCUNDL01   UF   E           K DISK
     FCUNDL02   IF   E           K DISK
     F                                     RENAME(KUNDR:KUNDR2)
     FFIRM      IF   E           K DISK
     FKODTLIK   IF   E           K DISK
     FSYFT18FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2ALFA        YALFA            10
     C                   MOVE      *ZEROS        YKNR              8 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     c     *in(60)       IFEQ      '1'
     C     KUND2K        SETLL     CUNDL02
     C                   ELSE
     C     KUND2KB       SETLL     CUNDL01
     C                   END
     C     START1        TAG
     c     *in(60)       IFEQ      '1'
     C     FIFIRM        READE     CUNDL02                                94
     C                   ELSE
     C     fifirm        READE(N)  CUNDL01                                94
     C                   END
     C  N94              MOVE      KUNDNR        YKNR
     C  N94              MOVE      SONAVN        YALFA
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        13
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     c     *in(60)       IFEQ      '1'
     C     FIFIRM        READE     CUNDL02                                94
     C                   ELSE
     C     FIFIRM        READE(N)  CUNDL01                                94
     C                   END
     C  N94              MOVE      KUNDNR        YKNR
     C  N94              MOVE      SONAVN        YALFA
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   write     BUNN
     C                   exfmt     SUBCTL
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     c     wskund        ifne      *zeros
     c                   move      wskund        w2kund
     c                   setoff                                       60
     c                   move      *blanks       wsalfa
     c                   move      *zeros        wskund
     c                   goto      start
     c                   end
     c     wsalfa        ifne      *blanks
     c                   move      wsalfa        w2alfa
     c                   seton                                        60
     c                   move      *blanks       wsalfa
     c                   move      *zeros        wskund
     c                   goto      start
     c                   end
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KUND23        SETLL     CUNDL02
     C     START4        TAG
     C  N94FIFIRM        READE     CUNDL02                                94
     C  N94YKNR          IFNE      KUNDNR
     C                   GOTO      START4
     C                   END
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C* TEST LIKVIDITETSKODE
     C     KODLIK        CHAIN     KODTLIK                            90
     C   90WSLIKV        COMP      ' '                                9090
     C   90
     CANN30              MOVE      'SPL0012'     MSGNR
     C   90
     CANN30              Z-ADD     23            POSNBR
     C   90              SETON                                        30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   EXSR      CHGKUN
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGKUN        BEGSR
     C***********************************************
     C                   EXSR      MOVKUW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       3090
     c   04              do
     c                   move      'J'           plukk             1
     c                   call      'SYFT19'
     c                   parm                    plukk
     c                   parm                    wslikv
     c                   end
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C  N12              EXSR      OPDKUN
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     OPDKUN        BEGSR
     C***********************************************
     C     KUND1K        CHAIN     CUNDL01                            33
     C                   EXSR      MOVWKU
     C  N33              EXCEPT    NYLIKV
     C*
     C   40              UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVKUW        BEGSR
     C***********************************************
     C                   MOVE      SYLIKV        WSLIKV
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     23            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWKU        BEGSR
     C***********************************************
     C                   MOVE      WSLIKV        SYLIKV
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSLIKV
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     KUND2K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2ALFA
     C     KUND2KB       KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2KUND            8 0
     C     KUND23        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    YALFA
     C     KUND23B       KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    Yknr
     C     KODLIK        KLIST
     C                   KFLD                    YUNI
     C                   KFLD                    WSLIKV
     C*
     C                   MOVE      'LIKO'        YUNI              4
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
     OKUNDR     E            NYLIKV
     O                       SYLIKV
