      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TEGN PÅ DUPKEY            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-26                      ***
      *** LEDIGE INDIKATORER 27-49 51-59 61-98                ***
      ***********************************************************
      *
     FKODTDUP   UF A E           K DISK
     FSYFT27FM  CF   E             WORKSTN
     C*
     C     KODDUK        KLIST
     C                   KFLD                    WDUUNI
     C*
     C                   MOVE      'DUPKE'       WDUUNI            5
     C     KODDUK        CHAIN     KODTDUP                            60
     C  N60              UPDATE    KODUPR
     C                   MOVE      KDUKOD        WDUKOD
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C*
     C   03              GOTO      SLUTT
     C     WDUKOD        IFNE      ' '
     C     KODDUK        CHAIN     KODTDUP                            60
     C                   MOVE      WDUUNI        KDUUNI
     C                   MOVE      WDUKOD        KDUKOD
     C   60              WRITE     KODUPR
     C  N60              UPDATE    KODUPR
     C* N50                MOVE *BLANKS   WDUKOD
     C                   ELSE
     C                   SETON                                        99
     C                   END
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
