     FKODTA     IF   E           K DISK
     FSTANDI    IF   E           K DISK
     FKODTP     IF   E           K DISK
     FSYFTSSFM  CF   E             WORKSTN
     D                UDS
     D  UAVD                   1      4
     D  UOPDNR                 5     11  0
     D  UAVDNV                12     44
     D  UVATLF                45     53
     D  UDL                   54     54
     D  UTOLK                 55     55
     D  U0035                 56     56
     D  UA4                   61     61
     C*
     C     KODTAK        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    WSAAVD
     C     STANIK        KLIST
     C                   KFLD                    WSAAVD
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI
     C                   KFLD                    WOPAVD
     C                   KFLD                    WOPLNR
     C     *LIKE         DEFINE    KOPAVD        WOPAVD
     C     *LIKE         DEFINE    KOPUNI        WOPUNI
     C     *LIKE         DEFINE    KOPLNR        WOPLNR
     C                   Z-ADD     0             WOPAVD
     C                   MOVE      'P'           WOPUNI
     C                   Z-ADD     0             WOPLNR
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    UHOVP            10
     C                   PARM                    UTILP            10
     C                   PARM                    ULSTP            10
     C                   PARM                    UUTLP            10
     C                   PARM                    UMRKP            10
     C                   PARM                    UDLP             10
     C                   PARM                    URUNDE            1
     C*
     C                   MOVE      'A'           WSAUNI            1
     C*
     C                   MOVE      UAVD          WSAAVD
     C     KODTAK        CHAIN     KODTA                              99
     C  N99STANIK        CHAIN     STANDI                             99
     C  N99              GOTO      START2
     C                   SETOFF                                       99
     C                   MOVE      *ZEROS        WSAAVD
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       9998
     C*
     C   03URUNDE        IFEQ      'F'
     C                   SETOFF                                       03
     C                   SETON                                        12
     C                   END
     C   12              MOVE      '3'           UIN01
     C   12              GOTO      SLUTT
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     KODTAK        CHAIN     KODTA                              99
     C   99              GOTO      START
     C     STANIK        CHAIN     STANDI                             98
     C   98              GOTO      START
     C*
     C     START2        TAG
     C                   MOVE      WSAAVD        UAVD
     C                   MOVE      KOANVN        UAVDNV
     C                   MOVE      SIDL          UDL
     C                   MOVE      SIA4          UA4
     C                   MOVE      SITOLK        UTOLK
     C                   MOVE      '0'           UIN01
      * Printerstyring for hovedark
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     81            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UHOVP
     C                   ENDIF
      * Printerstyring for tillegssark
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     82            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UTILP
     C                   ENDIF
      * Printerstyring for dataliste
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     83            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UDLP
     C                   ENDIF
      * Printerstyring for lasteliste
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     85            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        ULSTP
     C                   ENDIF
      * Printerstyring for utleveringsattest
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     86            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UUTLP
     C                   ENDIF
      * Printerstyring for merknad
     C                   Z-ADD     SIAVD         WOPAVD
     C                   Z-ADD     87            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UMRKP
     C                   ENDIF
     C                   MOVE      S0035         U0035
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
