      *
      *****************************************************************
      *** PROGRAM SOM OVERFØRER LEVERANDØRER MELLOM 2 FIMRMA        ***
      *** I LØSNING 1                                               ***
     FLISTE     O    F   80        PRINTER OFLIND(*INOF)
     FKODTLKLF  IP   E           K DISK
     F                                     RENAME(KODTLKR:KODTLKR2)
     FKODTLK    IF A E           K DISK
      *
     C     LANDKE        KLIST
     C                   KFLD                    KLKUNI
     C                   KFLD                    KLKLK
      *
     C  N99              EXCEPT    PHEAD
     C  N99              SETON                                        99
      *
     C     LANDKE        CHAIN     KODTLK                             33
     C   33              WRITE     KODTLKR
     C   OF              EXCEPT    PHEAD
     C   OF              SETOFF                                       OF
     C  N33              EXCEPT    PDET2
     C   33              EXCEPT    PDET
     OLISTE     E            PHEAD            02
     O                                           24 'FLYTTE LANDKODEFIL   MEL'
     O                                           38 'LOM FIRMA      '
     O                       UDATE         Y     49
     O                                           60 'SIDE:'
     O                       PAGE          Z     66
     OLISTE     E            PHEAD          1 03
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O          E            PDET           1
     O                       KLKLK                3
     O                       KLKNVN              35
     O          E            PDET2          1
     O                       KLKLK                3
     O                                           44 '*** NR FINS FRA FØR  ***'
