      *
      *****************************************************************
      *** PROGRAM SOM OVERFØRER LEVERANDØRER MELLOM 2 FIMRMA        ***
      *** I LØSNING 1                                               ***
     FLISTE     O    F   80        PRINTER OFLIND(*INOF)
     FSTED2     IP   E           K DISK
     F                                     RENAME(STED2R:STEDD2R2)
     FSTED2D    IF A E           K DISK
      *
     C     STEDKE        KLIST
     C                   KFLD                    ST2LK
     C                   KFLD                    ST2KOD
      *
     C  N99              EXCEPT    PHEAD
     C  N99              SETON                                        99
      *
     C     STEDKE        CHAIN     STED2D                             33
     C   33              WRITE     STED2R
     C   OF              EXCEPT    PHEAD
     C   OF              SETOFF                                       OF
     C  N33              EXCEPT    PDET2
     C   33              EXCEPT    PDET
     C************************************************************
     C     ADDPOS        BEGSR
     C************************************************************
     C                   ENDSR
     OLISTE     E            PHEAD            02
     O                                           24 'FLYTTE STEDSREGISTER MEL'
     O                                           38 'LOM FIRMA      '
     O                       UDATE         Y     49
     O                                           60 'SIDE:'
     O                       PAGE          Z     66
     OLISTE     E            PHEAD          1 03
     O                                           24 '------------------------'
     O                       *PLACE              48
     O                       *PLACE              72
     O          E            PDET           1
     O                       ST2LK                3
     O                       ST2KOD              10
     O                       ST2NVN              42
     O          E            PDET2          1
     O                       ST2LK                3
     O                       ST2KOD              10
     O                                           44 '*** NR FINS FRA FØR  ***'
