      *
      ***************************************************************
      *** VALG AV UTSKRIFTSPARAMETERE                             ***
      ***                                                         ***
      *** PROGRAMMERT AV TORE BRÅSTAD, SYSTEMA A/S, FEBRUAR 1994  ***
      ***************************************************************
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER        ***
      *** LEDIGE INDIKATORER 01-99                                ***
      ***************************************************************
      *
     FSYGB05D   CF   E             WORKSTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UFPER             2
     C                   PARM                    UFAAR             2
     C                   PARM                    UTPER             2
     C                   PARM                    UTAAR             2
     C*
     C                   MOVEL     '*STD'        WSFORM
     C                   MOVEL     '*JOB'        WSPRT
     C                   MOVEL     'PRT01'       WSSPLQ
     C                   Z-ADD     1             WSANT
     C*
     C                   EXFMT     B20
     C*
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END
     C*
     C                   MOVE      WSANT         UANT              2
     C*
     C                   CALL      'SYGB02C'
     C                   PARM                    UAVD
     C                   PARM                    UFPER
     C                   PARM                    UFAAR
     C                   PARM                    UTPER
     C                   PARM                    UTAAR
     C                   PARM                    WSFORM
     C                   PARM                    WSPRT
     C                   PARM                    WSSPLQ
     C                   PARM                    UANT
     C                   PARM                    WSSAV
     C                   PARM                    WSHLD
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
