********************************************************************
      * hente utfakturert til en tur
     FHEAD11    IF   E           K DISK
     FFAKT      IF   E           K DISK
     FKODTGE    IF   E           K DISK
      *
     c     *ENTRY        PLIST
     c                   parm                    UPRO              8 0
     c                   parm                    ukode             1
     c                   parm                    ubel             13 2
     c     upro          ifne      *zeros
     c                   exsr      caltot
     c                   end
     c                   seton                                        lr
     c                   return
     C***********************************************
     c     CALTOT        BEGSR
     C***********************************************
     c                   move      *zeros        ubel
     C     UPRO          SETLL     HEAD11
     C     *IN33         doweq     '0'
     C     UPRO          READE     HEAD11                                 33
     C     *in33         IFEQ      '0'
     c     hest          andne     'S'
     C                   exsr      faktsr
     C                   ENDIF
     C                   ENDDO
     C                   ENDSR
     C*
     C***********************************************
     c     faktsr        BEGSR
     C***********************************************
     C*
     C     FAKEY         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
      *
     C     KODTGEK       KLIST
     C                   KFLD                    KODE              2
     C                   KFLD                    FAVK
     C                   MOVE      'GE'          KODE
     C*
     C                   SETOFF                                       34
     C     FAKEY         SETLL     FAKT
     C     *IN34         DOWEQ     '0'
     C     FAKEY         READE     FAKT                                   34
     C     *IN34         IFEQ      '0'
     c     fask          andne     'I'
     c     fakda         andne     'K'
     c     ukode         ifeq      'T'
     c     kodtgek       chain     kodtge                             35
     c  N35KGEAVR        ifeq      'T'
     c                   add       fabeln        ubel
     c                   end
     c                   else
     c                   add       fabeln        ubel
     c                   end
     c                   end
     c                   enddo
     c                   endsr
