     FBWKUND    UP   E             DISK
     F                                     RENAME(BWKUND:BWKUNDR)
      *gjør om på tegn
N02  D fra             c                   x'3B06311B14'
N02   * byttes med
N02  D til             c                   x'6AD0C05B7C'
     IBWKUNDR
     I              BWKUND                      BWKUNDI
      *
N02  c     fra:til       xlate     bwkundi       bwkundi                        ikke skrivbar->blank

     c                   update    bwkundr
