      *****************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAG (LAND-IMPORT)           ***
     FHEAD11    UF   E           K DISK
     c     *entry        plist
     c                   parm                    utur              8 0
     c                   parm                    ubytt             1
     c                   parm                    uleng             1 0
     c                   exsr      tomm
     c                   exsr      oppdat
     c                   seton                                        lr
     c                   return
      ******************************************************************
     c     tomm          begsr
      ******************************************************************
     c     utur          setll     head11
     c     *in33         doweq     '0'
     c     utur          reade     head11                                 33
     c     *in33         ifeq      '0'
     c                   eval      hepos1=*blanks
     c                   update    headfr
     c                   endif
     c                   enddo
     c                   endsr
      ******************************************************************
     c     oppdat        begsr
      ******************************************************************
     c     key           klist
     c                   kfld                    utur
     c                   kfld                    pos7              7
     c     key           setll     head11
     c     *in34         doweq     '0'
     c     key           reade     head11                                 34
     c     *in34         ifeq      '0'
     c     uleng         ifeq      1
     c                   add       1             n1                1 0
     c                   movel     n1            hepos1
     c                   end
     c     uleng         ifeq      2
     c                   add       1             n2                2 0
     c                   movel     n2            hepos1
     c                   end
     c     uleng         ifeq      3
     c                   add       1             n3                3 0
     c                   movel     n3            hepos1
     c                   end
     c     uleng         ifeq      4
     c                   add       1             n4                4 0
     c                   movel     n4            hepos1
     c                   end
     c     uleng         ifeq      5
     c                   add       1             n5                5 0
     c                   movel     n5            hepos1
     c                   end
     c     uleng         ifeq      6
     c                   add       1             n6                6 0
     c                   movel     n6            hepos1
     c                   end
     c     uleng         ifeq      7
     c                   add       1             n7                7 0
     c                   movel     n7            hepos1
     c                   end
     c                   update    headfr
     c                   endif
     c                   enddo
     c                   endsr
