      **************************************************************
      * fikser feltbeskrivelse generell fil
      *****************************************************************
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 FELT UTVIDET FRA 20 -> 30
10XXX * 02 SH  PTF10 Utvidet fra tmp1024 - tmp2048
10XXX * 03 SH  PTF10 Utvidet fra tmp1024 - tmp4096
      * 04 sh  ptf11 utvidet antall felt til 200
********************************************************************
      *
     FEPOST80   IP   E             DISK
S02  F*mp1024   IF A E             DISK
s03  F*mp2048   IF A E             DISK
N03  Ftmp4096   IF A E             DISK
      *
     D                 DS
     D  RECINN                 1     80
     D  test                   2      6
N01  D  felnvn                13     42
S01   *
N01  D                 DS
s04  D* h                      1   4800
n04  D  h                      1   6000
s08  D*                                    dim(160)
n08  D                                     dim(200)
N01  D  H01                    1     30
N01  D  H02                   31     60
N01  D  H03                   61     90
N01  D  H04                   91    120
N01  D  H05                  121    150
N01  D  H06                  151    180
N01  D  H07                  181    210
N01  D  H08                  211    240
N01  D  H09                  241    270
N01  D  H10                  271    300
N01  D  H11                  301    330
N01  D  H12                  331    360
N01  D  H13                  361    390
N01  D  H14                  391    420
N01  D  H15                  421    450
N01  D  H16                  451    480
N01  D  H17                  481    510
N01  D  H18                  511    540
N01  D  H19                  541    570
N01  D  H20                  571    600
N01  D  H21                  601    630
N01  D  H22                  631    660
N01  D  H23                  661    690
N01  D  H24                  691    720
N01  D  H25                  721    750
N01  D  H26                  751    780
N01  D  H27                  781    810
N01  D  H28                  811    840
N01  D  H29                  841    870
N01  D  H30                  871    900
N01  D  H31                  901    930
N01  D  H32                  931    960
N01  D  H33                  961    990
N01  D  H34                  991   1020
N01  D  H35                 1021   1050
N01  D  H36                 1051   1080
N01  D  H37                 1081   1110
N01  D  H38                 1111   1140
N01  D  H39                 1141   1170
N01  D  H40                 1171   1200
N01  D  H41                 1201   1230
N01  D  H42                 1231   1260
N01  D  H43                 1261   1290
N01  D  H44                 1291   1320
N01  D  H45                 1321   1350
N01  D  H46                 1351   1380
N01  D  H47                 1381   1410
N01  D  H48                 1411   1440
N01  D  H49                 1441   1470
N01  D  H50                 1471   1500
N01  D  H51                 1501   1530
N01  D  H52                 1531   1560
N01  D  H53                 1561   1590
N01  D  H54                 1591   1620
N01  D  H55                 1621   1650
N01  D  H56                 1651   1680
N01  D  H57                 1681   1710
N01  D  H58                 1711   1740
N01  D  H59                 1741   1770
N01  D  H60                 1771   1800
N01  D  H61                 1801   1830
N01  D  H62                 1831   1860
N01  D  H63                 1861   1890
N01  D  H64                 1891   1920
N01  D  H65                 1921   1950
N01  D  H66                 1951   1980
N01  D  H67                 1981   2010
N01  D  H68                 2011   2040
N01  D  H69                 2041   2070
N01  D  H70                 2071   2100
N01  D  H71                 2101   2130
N01  D  H72                 2131   2160
N01  D  H73                 2161   2190
N01  D  H74                 2191   2220
N01  D  H75                 2221   2250
N01  D  H76                 2251   2280
N01  D  H77                 2281   2310
N01  D  H78                 2311   2340
N01  D  H79                 2341   2370
N01  D  H80                 2371   2400
N01  D  H81                 2401   2430
N01  D  H82                 2431   2460
N01  D  H83                 2461   2490
N01  D  H84                 2491   2520
N01  D  H85                 2521   2550
N01  D  H86                 2551   2580
N01  D  H87                 2581   2610
N01  D  H88                 2611   2640
N01  D  H89                 2641   2670
N01  D  H90                 2671   2700
N01  D  H91                 2701   2730
N01  D  H92                 2731   2760
N01  D  H93                 2761   2790
N01  D  H94                 2791   2820
N01  D  H95                 2821   2850
N01  D  H96                 2851   2880
N01  D  H97                 2881   2910
N01  D  H98                 2911   2940
N01  D  H99                 2941   2970
N01  D  H100                2971   3000
N01  D  H101                3001   3030
N01  D  H102                3031   3060
N01  D  H103                3061   3090
N01  D  H104                3091   3120
N01  D  H105                3121   3150
N01  D  H106                3151   3180
N01  D  H107                3181   3210
N01  D  H108                3211   3240
N01  D  H109                3241   3270
N01  D  H110                3271   3300
N01  D  H111                3301   3330
N01  D  H112                3331   3360
N01  D  H113                3361   3390
N01  D  H114                3391   3420
N01  D  H115                3421   3450
N01  D  H116                3451   3480
N01  D  H117                3481   3510
N01  D  H118                3511   3540
N01  D  H119                3541   3570
N01  D  H120                3571   3600
N01  D  H121                3601   3630
N01  D  H122                3631   3660
N01  D  H123                3661   3690
N01  D  H124                3691   3720
N01  D  H125                3721   3750
N01  D  H126                3751   3780
N01  D  H127                3781   3810
N01  D  H128                3811   3840
N01  D  H129                3841   3870
N01  D  H130                3871   3900
N01  D  H131                3901   3930
N01  D  H132                3931   3960
N01  D  H133                3961   3990
N01  D  H134                3991   4020
N01  D  H135                4021   4050
N01  D  H136                4051   4080
N01  D  H137                4081   4110
N01  D  H138                4111   4140
N01  D  H139                4141   4170
N01  D  H140                4171   4200
N01  D  H141                4201   4230
N01  D  H142                4231   4260
N01  D  H143                4261   4290
N01  D  H144                4291   4320
N01  D  H145                4321   4350
N01  D  H146                4351   4380
N01  D  H147                4381   4410
N01  D  H148                4411   4440
N01  D  H149                4441   4470
N01  D  H150                4471   4500
N01  D  H151                4501   4530
N01  D  H152                4531   4560
N01  D  H153                4561   4590
N01  D  H154                4591   4620
N01  D  H155                4621   4650
N01  D  H156                4651   4680
N01  D  H157                4681   4710
N01  D  H158                4711   4740
N01  D  H159                4741   4770
N01  D  H160                4771   4800
N04  D  H161                4801   4830
N04  D  H162                4831   4860
N04  D  H163                4861   4890
N04  D  H164                4891   4920
N04  D  H165                4921   4950
N04  D  H166                4951   4980
N04  D  H167                4981   5010
N04  D  H168                5011   5040
N04  D  H169                5041   5070
N04  D  H170                5071   5100
N04  D  H171                5101   5130
N04  D  H172                5131   5160
N04  D  H173                5161   5190
N04  D  H174                5191   5220
N04  D  H175                5221   5250
N04  D  H176                5251   5280
N04  D  H177                5281   5310
N04  D  H178                5311   5340
N04  D  H179                5341   5370
N04  D  H180                5371   5400
N04  D  H181                5401   5430
N04  D  H182                5431   5460
N04  D  H183                5461   5490
N04  D  H184                5491   5520
N04  D  H185                5421   5550
N04  D  H186                5551   5580
N04  D  H187                5581   5610
N04  D  H188                5611   5640
N04  D  H189                5641   5670
N04  D  H190                5671   5700
N04  D  H191                5701   5730
N04  D  H192                5731   5760
N04  D  H193                5761   5790
N04  D  H194                5791   5820
N04  D  H195                5821   5850
N04  D  H196                5851   5880
N04  D  H197                5881   5910
N04  D  H198                5911   5940
N04  D  H199                5941   5970
N04  D  H200                5971   6000
      * ikke skrive linjer fra short til field  (----  = slutt)
      *
     I*MP10  R
     I*             TMP1024                     DATA
     C                   setoff                                       99
s02  C*  99              READ      TMP1024
s03  C*  99              READ      TMP2048
n03  C   99              READ      TMP4096
     C                   MOVEL     RDATA         RECINN
      *
     C     test          ifeq      'Short'
     C     test          oreq      '-----'
     c                   move      'N'           start             1
     c                   end
      *
      * tester om field er nådd
      *
     c     start         ifeq      'J'
     C     test          andne     '     '
     c                   exsr      det
     c                   end
      *
     C     test          ifeq      'Field'
     c                   move      'J'           start             1
     c                   end
     clr                 exsr      tmp
     c******************************************************************
     c     det           begsr
     c******************************************************************
s04  c*    nr            iflt      160
n04  c     nr            iflt      200
     c                   add       1             nr                3 0
     C                   movel     felnvn        h(nr)
     c                   end
     c                   endsr
     c******************************************************************
     c     tmp           begsr
     c******************************************************************
     c                   z-add     1             nr
s04  c*                  do        160
n04  c                   do        200
     c     h(nr)         ifne      *blanks
     c     data          cat       '"':0         data
     c     data          cat       h(nr):0       data
     c     data          cat       '";':0        data
     c                   end
     c                   add       1             nr
     c                   enddo
s02  c*                  write     tmp1024r
s03  c*                  write     tmp2048r
n03  c                   write     tmp4096r
     c                   endsr
