      ***********************************************************
      *** HENT NESTE EAN FRAKTBREVSNR FRA FIRMATELLEVERK
      ***********************************************************
     FFIRFB     UF   E           K DISK
     D                 DS
     D  UFN17A                 1      2
     D  UFN17B                 3      7
     D  UFN17C                 8     17
     D  UFN17                  1     17
      *
     C     *ENTRY        PLIST
     C                   PARM                    USENDN           20
      * HENT NESTE NR..
     C     *LOVAL        SETLL     FIRFB
     C                   READ      FIRFB                                  33
     C     *IN33         IFEQ      '0'
     C     FIRECN        IFNE      *ZEROS
     C                   ADD       1             FIRECN
     C                   MOVE      FISNLA        UFN17A
     C                   MOVE      FISNLE        UFN17B
     C                   MOVEL     FIRECN        UFN17C
     C                   END
     C                   UPDATE    FIRFBR
     C                   END
     C*
      * LEGG TIL KONTROLL-SIFFER
     C                   MOVE      *ZEROS        UAN22            22
     C                   MOVE      UFN17         UAN22
     C                   CALL      'SYGE08'
     C                   PARM                    UAN22
     C                   MOVE      UAN22         UFN17
     C*
      * LEGG FULLT 20-SIFRET NR I RETUR-PARAMETER
     C                   MOVEL     '401'         USENDN
     C                   MOVE      UFN17         USENDN
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
