      *****************************************************************
      *** PROGRAM FOR Å FJERNE ETT OPPDRAG FRA TUR    I TRANSP.MODUL***
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      * 01 JOV PTF11 Test mot staus - kan ikke fjernes hvis status X = noen arbeider i grønnskjerm
      *              Oppdatere også HEKNT = oppdragets transp(feil siden 2012 - i alle andre fra da)
********************************************************************
     FTURER14   UF   E           K DISK
     FHEADF     UF   E           K DISK
     FDISP      UF   E           K DISK
     FKOSBU9    UF   E           K DISK
     FSAML1     UF   E           K DISK
     c                   EXSR      INIT
     c                   EXSR      MAIN
     C                   SETON                                        LR
     C                   RETURN
     C*
     C******************************************
     C     MAIN          BEGSR
     C******************************************
      * UFLAGG 1 TIL SLUTT = MISSLYKKET..
     C                   MOVE      '1'           UFLAGG
     C     UPRO          CHAIN     TURER14                            33
     C     *IN33         CABEQ     '1'           UTMAIN
     C     HEAKEY        CHAIN     HEADF                              33
N01  C* N33HEST          COMP      'X'                                3333
N02  C  N33HEST          COMP      'X'                                    33
     C  N33HEPRO         COMP      UPRO                               3333
     C     *IN33         CABEQ     '1'           UTMAIN
      * tester ok - Fjerning BLIR gjennomført - Uflagg -> 0
     C                   MOVE      '0'           UFLAGG
      * Reduser ant oppdr mm i Tur-header
     C                   sub       HENT          TUTS
     C                   sub       HEVKT         TUTVKT
     C                   sub       HEM3          TUTM3
     C                   sub       HELM          TUTLM
     C                   sub       1             TUAO
     C                   UPDATE    TURERR
      * Fjern  Turnr fra Oppdrag/Disp
     C                   Z-ADD     0             HEPRO
     C                   MOVE      *ZEROS        TRRUND
N01  C                   MOVE      *ZEROS        HEKNT
     C                   MOVE      *BLANKS       HEHAWB
     C                   MOVE      *ZEROS        HETRM
     C                   MOVE      0             HETRC
     C                   MOVE      *BLANKS       HETRCN
     C                   UPDATE    HEADFR
     C     HEAKEY        CHAIN     DISP                               33
     c     *in33         ifeq      '0'
     C                   move      *ZEROS        DITUR
     C                   move      *ZEROS        DIRUND
     C                   move      *ZEROS        DITUAV
     C                   move      ' '           DISTA1
     C                   update    dispr
     c                   end
      * GÅR IGJENNOM EVT. REKVISISJONER PÅ DETTE OPPDRAG OG fjerner
      * TURNUMMER (FOR EVT Å KUNNE INNGÅ I TRANSPORTØRAVREGNING )
     C     HEOPD         IFNE      *ZEROS
     C                   MOVE      ' '           YYST
     C     KOSB9K        CHAIN     KOSBU9                             33
     C     *IN33         DOWNE     '1'
     C                   MOVE      *zeros        BUTAVD
     C                   MOVE      *zeros        BUTUNR
     C                   UPDATE    KOSBUR
     C     KOSB9K        READE     KOSBU9                                 33
     C  N33              END
      *
      * OPPDATER OGSÅ PÅ EVT. DUMMY/DUPREKV.
     C                   MOVE      'D'           YYST
     C     KOSB9K        CHAIN     KOSBU9                             33
     C     *IN33         DOWNE     '1'
     C                   MOVE      *zeros        BUTAVD
     C                   MOVE      *zeros        BUTUNR
     C                   UPDATE    KOSBUR
     C     KOSB9K        READE     KOSBU9
     C     KOSB9K        READE     KOSBU9                                 33
     C  N33              END
     C                   END
      * fjern post i saml-fakt-kø  hvis det re nr. innland.
     C                   movel     HXSNDN        HXSNR3            3
     C     HXSNR3        IFEQ      '401'
     C     HXSNR3        oreq      '401'
     C     HEAKEY        CHAIN     SAML1                              33
     C  N33              DELETE    SAMLR
     C                   END
      *
     C     UTMAIN        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UPRO              8 0
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAGG            1
     C*
     C     HEAKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C*
     C     KOSB9K        KLIST
     C                   KFLD                    YYST              1
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C*
     C                   ENDSR
