********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 utvidet til 3 parametre
********************************************************************
     FDOKOTHM   IF   E           K DISK
     D                 DS
     D  Å02                    1     27
     D                                     DIM(9)
     D  Å02A                   1      3
     D  Å02B                   4      6
     D  Å02C                   7      9
     D  Å02D                  10     12
     D  Å02E                  13     15
     D  Å02F                  16     18
     D  Å02G                  19     21
     D  Å02H                  22     24
     D  Å02I                  25     27
     D                 DS
     D  Å04                    1    108
     D                                     DIM(9)
     D  Å04A                   1     12
     D  Å04B                  13     24
     D  Å04C                  25     36
     D  Å04D                  37     48
     D  Å04E                  49     60
     D  Å04F                  61     72
     D  Å04G                  73     84
     D  Å04H                  85     96
     D  Å04I                  97    108
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
      *
     C     OTHKEY        KLIST
     C                   KFLD                    WSD
     C                   KFLD                    WLNR
      *
     C     *ENTRY        PLIST
     C                   PARM                    PSD
     C                   PARM                    PLNR
     C                   PARM                    DFFTO            41
     C                   PARM                    DFFT             41
N01  C                   PARM                    DFFT3            41
      *
     C     *LIKE         DEFINE    DOSD          PSD
     C     *LIKE         DEFINE    DOLNR         PLNR
     C     *LIKE         DEFINE    DOSD          WSD
     C     *LIKE         DEFINE    DOLNR         WLNR
     C                   Z-ADD     1             X                 3 0
     C                   Z-ADD     0             WX                3 0
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              12
      *
     C                   MOVEL     PSD           WSD
     C                   Z-ADD     PLNR          WLNR
      * Sjekker først om det finnes noen verdier å vise
     C     OTHKEY        SETLL     DOKOTHM
     C     OTHKEY        READE     DOKOTHM                                90
     C     *IN90         DOWEQ     *OFF
     c     do1333        ifne      *zeros
     C                   MOVEA     DO1331        Å02(X)
     C     Å02(X)        CAT       DO1332:0      Å02(X)
     C                   Z-ADD     DO1333        ØN152
     C                   EXSR      SRNE
     C                   MOVEA     ØAN           Å04(X)
     C                   ADD       1             X
     C     X             IFGT      9
     C                   LEAVE
     C                   ENDIF
     C                   ENDIF
     C     OTHKEY        READE     DOKOTHM                                90
     C                   ENDDO
      * Concatenate string-1
     C                   MOVE      *BLANKS       DFFTO
     C     Å02(1)        CAT       Å04(1):1      DFFTO

     C     DFFTO         CAT       Å02(2):2      DFFTO
     C     DFFTO         CAT       Å04(2):1      DFFTO

     C     DFFTO         CAT       Å02(3):2      DFFTO
     C     DFFTO         CAT       Å04(3):1      DFFTO
      * Concatenate string-2
     C                   MOVE      *BLANKS       DFFT
     C     Å02(4)        CAT       Å04(4):1      DFFT

     C     DFFT          CAT       Å02(5):2      DFFT
     C     DFFT          CAT       Å04(5):1      DFFT

     C     DFFT          CAT       Å02(6):2      DFFT
     C     DFFT          CAT       Å04(6):1      DFFT
N01  C                   MOVE      *BLANKS       DFFT3
n01  C     Å02(7)        CAT       Å04(7):1      DFFT3
n01
n01  C     DFFT3         CAT       Å02(8):2      DFFT3
n01  C     DFFT3         CAT       Å04(8):1      DFFT3
n01
n01  C     DFFT3         CAT       Å02(9):2      DFFT3
n01  C     DFFT3         CAT       Å04(9):1      DFFT3
      *
      *
     C                   SETON                                        LR
     C                   RETURN
      *////////////////////////////////////////////////////////////
      *  Leftjustify numerical fields                        SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * MOve correct value into Alfa 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      ',  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   ENDIF
      * Scan from left and find first num over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   ENDIF
     C                   ENDDO
     C     SRNE1         TAG
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      *
     C                   ENDSR
