      *
      ***********************************************************
      *** PROGRAM SKAL HENTE unik teller  9.0                 ***
      ***********************************************************
     FGEUNIK    UF A E           K DISK
     C
     C     *entry        plist
     C                   parm                    kode              1
     C                   parm                    nr                9
     C     kode          chain     geunik                             33
     c   33              z-add     1             getell
     C   33              move      kode          gekode
     c                   move      getell        nr
     c                   add       1             getell
     c   33              write     geunikr
     c  N33              update    geunikr
      *
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
