      *
      * RETURNERER NESTE OPPDRAGSNR FOR MØNSTEROPPDRAG PÅ GITT AVD.
      *  ("STIGENDE" NEGATIV NUMERERING FRA -1 OG NEDOVER...)
     FHEADF     IF   E           K DISK
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C*
     C     MINKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C*
     C                   Z-SUB     99999         UOPD
     C     MINKEY        SETLL     HEADF
     C     UAVD          READE     HEADF                                  33
     C*
     C     HEOPD         SUB       1             UOPD
     C     UOPD          IFGE      *ZEROS
     C                   Z-SUB     1             UOPD
     C                   END
      *
     C*
     C                   SETON                                            LR
     C                   RETURN
