     H DECEDIT(',') debug(*yes)
      ************************************************************************
      *  beregner budsjetter
      ************************************************************************
     FTRAN      IF   E           K DISK
     Ffirm      if   E           K disk
     FTURER14   IF   E           K DISK
     D                 DS
     D  HXHEAD                 1    256
     D  HEUR                   1      1
     D  HEFR                   2      4
     D  HEKDPL                 5      5
     D  TULKFR                 6      7
     D  TUSTEF                 8     12
     D  TULKTI                13     14
     D  TUSTET                15     19
     D  HELKS                 20     21
     D  HESDFF                22     26
     D  HELKK                 27     28
     D  HESDVT                29     33
     D  TUTVKT                34     42  0
     D  HEFBV                 43     51  0
     D  TUTM3                 52     58  3
     D  TUTLM                 59     62  2
     D  HENT                  63     69  0
     D  TRVERV                70     72
     D  XXVERB                73     75  2
      *
     c                   exsr      init
      *
     c                   exsr      BERBUD
     c
      *
     c                   seton                                        lr
     c                   return
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UPRO              8
     C                   PARM                    UVAL              3
     C                   PARM                    UBEL             11 2
     C                   PARM                    UAE               1
     C*
     C                   read      firm                                   33
     C*
     C     TRANK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    TUKNT2
      *
     C     TURKEY        KLIST
     C                   KFLD                    TUPRO
      *
     C                   MOVE      UPRO          TUPRO
      *
     C     TURKEY        CHAIN     TURER14                            33
     C*
     C     *IN33         IFEQ      '0'
      *
      * HENTE VMTRLE I TRANSPORTØRFIL
      *
     C     TRANK         CHAIN     TRAN                               34
      *
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     BERBUD        BEGSR
      ***********************************************
     C                   MOVE      'H'           HEUR
     c                   z-add     VMTRLE        uukn
     C                   MOVE      *ZEROS        UUBELØ
     C                   MOVEL     TUSONF        TULKFR
     C                   MOVEL     TUSONT        TULKTI
     C
      *
     C                   MOVE      *ZEROS        N7                7 0
     C                   MOVE      ' '           USKA              1
     C                   MOVE      *ZEROS        DUVNR             9 0
     C                   MOVE      *BLANK        DUVMSG           50
      * FINN FRAKT I KUNDERSFRAKTAVTALE
     C                   MOVE      *BLANKS       UUVAL             3
     C                   MOVE      'FRA'         UGEB              3
     C                   MOVE      'FRA'         UGEBKO            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C                   MOVE      HXHEAD        UHEAD           256
     C                   CALL      'SYGE14'
     C                   PARM                    UGEBKO
     C                   PARM                    UGEB
     C                   PARM                    TUAVD
     C                   PARM                    N7
     C                   PARM                    UUKN              8 0
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    DUVNR             9 0
     C                   PARM                    DUVMSG           50
     C                   PARM                    USKA
     C                   PARM                    UHEAD
      *
     C                   MOVE      UUVAL         UVAL
     C                   Z-ADD     UUBELØ        UBEL             11 2
     C                   ENDSR
