********************************************************************
***** *  Oppslag mot Postens fulle gate/postnr-register            *
********************************************************************
     FPONRGA    IF   E           K DISK
     FPONRGA1   IF   E           K DISK
     F                                     RENAME(PONRGAR:PONRGAR1)
     FSYGE45FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D                 DS
     D  UGateInp               1     10
     D  UGateInpB              2     10
     D                 DS
     D  WPONRMax               1      4
     D  WPONRMax2              2      2
     D  WPONRMax3              3      3
     D  WPONRMax4              4      4
      * For å konvertere store/små  bokstaver
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
     C                   EXSR      INIT

     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N28WPONR         SETLL     PONRGA1
     C   28WGATE         SETLL     PONRGA
     C     START1        TAG
     C  N28              READ      PONRGA1                                94
     C   28              READ      PONRGA                                 94

     C     START2        TAG

     C  N94              DO
     C                   DO        15
      * filter også på postnr ved søk på gate..
     c   28WPONR         ifne      *blanks
     c     Next          tag
     c                   exsr      SetPonrMax
     c     PONR          iflt      WPONR
     c     PONR          orgt      WPONRMax
     C                   READ      PONRGA                                 94
     c     *in94         cabeq     '1'           Utloop
     c                   goto      Next
     c                   end
     c                   end
      * skriv post
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N28              READ      PONRGA1                                94
     C   28              READ      PONRGA                                 94
     C  N94              END
     C                   END
     c     Utloop        tag
      *
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     *IN28         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C   03
     COR 12              GOTO      SLUTT
      *** FRISK OPP
     C   05              GOTO      START
      *** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
      *
     C     WPONR         IFNE      *BLANKS
     C     WGate         andeq     *BLANKS
     C                   MOVE      '0'           *IN28
     C                   GOTO      START
     C                   END
     C     WGATE         IFNE      *BLANKS
     C                   MOVE      '1'           *IN28
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C***********************************************
     C     SetPonrMax    BEGSR
     C***********************************************
     c                   move      WPONR         WPONRMAX
     c     WPONRMax2     ifeq      ' '
     C                   Move      '9'           WPONRMax2
     c                   end
     c     WPONRMax3     ifeq      ' '
     C                   Move      '9'           WPONRMax3
     c                   end
     c     WPONRMax4     ifeq      ' '
     C                   Move      '9'           WPONRMax4
     c                   end
     C                   ENDSR
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      GATE          UGATE
     C                   MOVE      PONR          UPONR
     C                   MOVE      STED          USTED
     C                   MOVE      'V'           UTYPE                          VALG ER GJORT
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UGATE            30
     C                   PARM                    UPONR             4
     C                   PARM                    USTED            30
     C                   PARM                    Utype             1            P=Postnr
      * Primær sortering / oppslag utfra ny innparameter for type
     C     Utype         ifeq      'P'
     C                   MOVE      UPONR         WPONR                          *IN28 OFF
     C                   else
     C                   MOVEL     UGATE         UGateInp
     C     UC:LC         XLATE     UGateInpB     UGateInpB
     C                   MOVEL     UGateInp      WGATE
     C                   EVAL      *IN28=*ON
     C                   end
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
