     FFIRMARC   IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    ARCINF            1
      *
N13  C                   Move      'N'           ARCINF
N13  C                   READ      FIRMARC                                33
N13  C                   seton                                        lr
     c                   return
