     H DECEDIT(',')
     c     *entry        plist
     c                   parm                    num              13 2
     c                   parm                    alf              25
     c                   parm                    alf2             25
     C                   EVAL      ALF=%trim(%editc(NUM:'J'))
     C                   EVAL      ALF2=%trim(%editw(NUM:'   .   .   .  0,  -'))
     c                   seton                                        lr
     C                   RETURN
     C*
