     Ffrisok    IF A E           K DISK
     C     *ENTRY        PLIST
     C                   parm                    heavdf            4 0
     C                   parm                    heopdf            7 0
     C                   parm                    heavdt            4 0
     C                   parm                    heopdt            7 0
     C                   parm                    ukode             3
      *
     c                   move      heavdf        fsavdf            4 0
     c                   move      heopdf        fsopdf            7 0
     c                   move      ukode         fskodf            3

     C     KEYF          KLIST
     C                   KFLD                    fsavdf
     C                   KFLD                    fsopdf
     c                   KFLD                    fskodF

     C     KEYF          SETLL     frisok
     C     *IN33         doweq     '0'
     c     keyF          reade     frisok                                 33
     c     *in33         ifeq      '0'
     c                   move      heavdt        fsavd
     c                   move      heopdt        fsopd
     C                   write     frisokr
     C                   endif
     C                   enddo

     C                   EVAL      *INLR=*ON
     c                   return
