     FBLV1      IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    antall            9 0
     C                   Z-add     uavd          bvavd
     C                   Z-add     uopd          bvopd
     C                   Z-add     0             antall
     C*--------------------------------------------------------------
     C     BLV1K         KLIST
     C                   KFLD                    BVAVD
     C                   KFLD                    BVOPD
     C*--------------------------------------------------------------
     C                   EXSR      hentco
     C                   seton                                        lr
     C                   RETURN
     C*
     C******************************************
     C     HENTCO        BEGSR
     C******************************************
     C     BLV1K         SETLL     BLV1                               35
     C                   MOVE      *ZEROS        ANTALL            9 0
     C     STHCO         TAG
     C     BLV1K         READE     BLV1                                   35
     C  N35              DO
     C     BVNT          MULT      BVENH         XWORK             7 0
     C                   ADD       XWORK         ANTALL
     C                   END
     C  N35              GOTO      STHCO
     C*
     C                   ENDSR
     C*
