10XXX *  finner brukerkode fra epostadresse
********************************************************************
     FQATMSMTPA IP   E           K DISK
     FSYPARL2   IF   E           K DISK
     D UP              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZ')
     D LO              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyz')
     C*
     C     *ENTRY        PLIST
N01  C                   PARM                    uepost           70
N01  C                   PARM                    uuser            10
     C                   PARM                    usg               3
     c                   move      *blanks       intadr           70
N01   *
     C     LO:UP         XLATE     UEPOST        UEPOST
     C     LO:UP         XLATE     SMTPUID       SMTPUID
     C     LO:UP         XLATE     DOMROUTE      DOMROUTE
N02  C                   EVAL      INTADR = %TRIM(SMTPUID)
N02  C                             + '@' + %TRIM(DOMROUTE)
     C     UEPOST        IFEQ      INTADR
     C     USRKEY        KLIST
     C                   KFLD                    SYUSER
     C                   KFLD                    SYPAID
     C                   move      'USRID'       SYPAID
     C                   movel     USERID        SYUSER
     C     USRKEY        CHAIN     SYPARL2                            33
     C     *in33         ifeq      '0'
     C                   MOVEl     USERID        UUSER
     C                   MOVEL     SYVRDA        USG
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C                   END
