********TEST MODULUSSIFFER  ***************************************
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      *-------------------------------------------------------------
     FSYGE102D  CF   E             WORKSTN
     C     START         TAG
     C                   EXFMT     BILDE01
     C   03              goto      slutt
     C                   call      'SYGE09'
     c                   parm                    inn
     c                   parm                    nymod             1 0
     c                   move      nymod         mod
     c                   goto      start
     C     SLUTT         TAG
     c                   seton                                        lr
     C                   RETURN
