     FSYGE93TM  CF   E             WORKSTN
     C*
     C     START         TAG
     C                   EXFMT     NYWRK
     C   03              GOTO      SLUTT
     C                   CALL      'SYGE93'
     C                   PARM                    DATA1
     C                   PARM                    DATA2
     C                   GOTO      START
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
