     FEDIM4     IF   E           K DISK
     FTVINF     IF   E           K DISK
     D                 DS
     D  WUERR                  1     10
     D  WUERR1                 1      1                                         Dok.kontroll
     D  WUERR2                 2      2                                         Kredittgrense
     D  WUERR3                 3      3                                         Tollk.stengt
     D  WUERR4                 4      4                                         Varekontroll
      * Input parametere
     C     *ENTRY        PLIST
     C                   PARM                    UERR              9
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
      * Definisjoner
     C     *LIKE         DEFINE    MSR           WMSR
     C     *LIKE         DEFINE    MAVD          WMAVD
     C     *LIKE         DEFINE    MTDN          WMTDN
     C     *LIKE         DEFINE    M0068A        WM0068A
     C     *LIKE         DEFINE    M0068B        WM0068B
     C     *LIKE         DEFINE    M0068C        WM0068C
     C     *LIKE         DEFINE    FLN           WFLN
     C                   EVAL      WMSR='R'
     C                   EVAL      WMAVD=UAVD
     C                   EVAL      WMTDN=UOPD
     C                   EVAL      WM0068A=99999999
     C                   EVAL      WM0068B=999999
     C                   EVAL      WM0068C=99
     C     EDIM4K1       KLIST
     C                   KFLD                    WMSR
     C                   KFLD                    WMAVD
     C                   KFLD                    WMTDN
     C                   KFLD                    WM0068A
     C                   KFLD                    WM0068B
     C                   KFLD                    WM0068C
     C     EDIM4K2       KLIST
     C                   KFLD                    WMSR
     C                   KFLD                    WMAVD
     C                   KFLD                    WMTDN
     C     TVINFKEY      KLIST
     C                   KFLD                    MMN
     C                   KFLD                    WFLN
      * Les baklenges og finn feilmeldinger
     C                   EVAL      WUERR=*BLANKS
     C     EDIM4K1       SETLL     EDIM4
     C     EDIM4K2       READPE    EDIM4                                  51
     C     *IN51         DOWEQ     *OFF
     C     M1N07         IFEQ      'DME'

     C                   EVAL      WFLN=2
     C     TVINFKEY      CHAIN     TVINF                              52
     C     *IN52         IFEQ      *OFF
     C                   IF        F0078A='954'                                 Dokumentkontroll
     C                   EVAL      WUERR1='X'
     C                   ENDIF
     C                   IF        F0078A='Kredittgrensen er overtrukket'
     C                   EVAL      WUERR2='X'
     C                   ENDIF
     C                   IF        F0078A='TOLLKREDITTKONTOEN er stengt.'
     C                   EVAL      WUERR3='X'
     C                   ENDIF
     C                   IF        F0078A='955'                                 Varekontroll
     C                   EVAL      WUERR4='X'
     C                   ENDIF
     C                   ENDIF

     C                   ENDIF
     C     EDIM4K2       READPE    EDIM4                                  51
     C                   ENDDO

     C                   EVAL      UERR=WUERR

     C                   EVAL      *INLR=*ON
