      *
      * KONVERTERTE LOWER CASE TIL UPPER CASE
      *
     D TABA            S              1    DIM(29) CTDATA PERRCD(1)
     D TABB            S              1    DIM(29) ALT(TABA)
     D                 DS
     D  FE                     1    256
     D                                     DIM(256)
     D  FELT                   1    256
     C     *ENTRY        PLIST
     C                   PARM                    UFELT           256
     C                   PARM                    LENGDE            3 0
     C     LENGDE        IFGT      256
     C                   Z-ADD     256           LENGDE
     C                   END
     C                   MOVE      UFELT         FELT
     C*
     C     1             DO        LENGDE        NR                3 0
     C                   SETOFF                                       30
     C     FE(NR)        LOOKUP    TABA          TABB                     30
     C   30              MOVE      TABB          FE(NR)
     C                   END
     C*
     C                   MOVE      FELT          UFELT
     C                   SETON                                        LR
     C                   RETURN
** TABA/TABB
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
Ê∆
¯ÿ
Â≈
