      *** PROGRAM SKAL BKREFTE KRITISK RUTINE                       ***
     FSYGE63FM  CF   E             WORKSTN
     C                   MOVE      ' '           KJOR
     C     START         TAG
     C                   EXSR      INIT
     C                   EXFMT     BILDE01
     C   23              MOVE      'J'           KJOR
     C  N23
     CANN12              GOTO      START
     C                   SETON                                        LR
     C                   RETURN
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UMSG1             7
     C                   PARM                    UMSG2             7
     C                   PARM                    UMSG3             7
     C                   PARM                    KJOR              1
      *
     C                   MOVE      UMSG1         XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     60            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          TXT01
     C*
      *
     C     UMSG2         IFNE      *BLANKS
     C                   MOVE      UMSG2         XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     60            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          TXT02
     C                   END
      *
     C     UMSG3         IFNE      *BLANKS
     C                   MOVE      UMSG3         XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     60            XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          TXT03
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             60
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
