     FHEADF     IF   E           K DISK
     FPRIK      IF   E           K DISK
     D                 DS
     D  HXHEAD                 1    256
     D  XXUR                   1      1
     D  XXFR                   2      4
     D  XXKDPL                 5      5
     D  XXLKA                  6      7
     D  XXSDF                  8     12
     D  XXTRI                 13     14
     D  XXSDT                 15     19
     D  XXLKS                 20     21
     D  XXSDFF                22     26
     D  XXLKK                 27     28
     D  XXSDVT                29     33
     D  XXVKT                 34     42  0
     D  XXFBV                 43     51  0
     D  XXM3                  52     58  3
     D  XXLM                  59     62  2
     D  XXNT                  63     69  0
     D  XXVERV                70     72
     D  XXVERB                73     75  2
      *
     C     *entry        plist
     C                   parm                    uavdA             4
     C                   parm                    uopdA             7
     C                   parm                    ukunA             8
     c                   parm                    usk               1
     c                   parm                    uvk               3
     c                   parm                    uvkTYP            3
     C                   parm                    uval              3
     C                   parm                    ubel             13 2
     C                   move      uavdA         heavd
     C                   move      uopdA         heopd
     C                   move      ukunA         uukn
     C                   MOVE      uavdA         uavd              4 0
     C                   MOVE      uopdA         uopd              7 0
     C                   MOVE      ukunA         ukun              8 0
     c     key           klist
     c                   kfld                    heavd
     c                   kfld                    heopd
     c     keyk          klist
     c                   kfld                    pkknr
     c                   kfld                    pkavtn
     c                   kfld                    pkgeby
     c                   move      ukuna         pkknr
     c                   move      '0'           pkavtn
     c                   move      uvk           pkgeby
      *
     c     key           chain     headf                              33
     c     *in33         ifeq      '0'
     C* POSTNUMMERBASERT KALKULASJON
      * Finn frakt i kundersfraktavtale
     C                   move      HEUR          XXUR
     C                   move      HEFR          XXFR
     C                   move      HEKDPL        XXKDPL
     C                   move      HELKA         XXLKA
     C                   move      HESDF         XXSDF
     C                   move      HETRI         XXTRI
     C                   move      HESDT         XXSDT
     C                   MOVE      HELKS         XXLKS
     C                   MOVE      HESDFF        XXSDFF
     C                   MOVE      HELKK         XXLKK
     C                   MOVE      HESDVT        XXSDVT
     C                   MOVE      TRVERV        XXVERV
     C                   MOVE      TRVERB        XXVERB
     C                   MOVE      *ZEROS        N5                5 0
     C                   MOVE      *ZEROS        NOPD              7 0
     C                   Z-ADD     hevkt         XXVKT
     C                   Z-ADD     hefbv         XXfbv
     C                   Z-ADD     heM3          XXM3
     C                   Z-ADD     heLM          XXLM
     C                   Z-ADD     heNT          XXNT
      * Finn frakt i kundersfraktavtale
     C                   MOVE      *BLANKS       UUVAL             3
     C                   MOVE      UVK           UGEB              3
     C                   MOVE      UVKTYP        UGEBKO            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C                   MOVE      ukun          UUKN              8 0
     C                   MOVE      USK           USKA              1
     C                   MOVE      HXHEAD        UHEAD           256
     C                   CALL      'SYGE14'
     C                   PARM                    UGEBKO
     C                   PARM                    UGEBKO
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UUKN
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    UAVNR             9 0
     C                   PARM                    UAVMSG           50
     C                   PARM                    USKA              1
     C                   PARM                    UHEAD
     c     UUBELØ        ifne      *zeros
     c     keyk          chain     prik                               33
     c     *in33         ifeq      '0'
     c     pkavtt        ifeq      'P'
     c     UUBELØ        MULT      PKBELØ        UUBELØ
     c                   div(H)    100           UUBELØ
     c                   end
     c                   end
     c                   end
     C                   Z-ADD     UUBELØ        UBEL
     C                   move      UUVAL         UVAL
     C                   end
     c                   seton                                        lr
     c                   return
