     D Tstampz         S               Z
     c     *entry        plist
     c                   parm                    utimes           26
N04  C                   TIME                    Tstampz
N04  C                   MOVEL     Tstampz       utimes
     c                   seton                                        lr
     c                   return
