     FHEADH     IF   E           K DISK

     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4 0
     C                   PARM                    UUOPD             7 0
     C                   PARM                    UUACTI            3
     C                   PARM                    UUDATE            8 0
     C                   PARM                    UUTIME            8 0
     C                   PARM                    UUEDEV            3
     C                   PARM                    UUEDRE            3
     C                   PARM                    UUNAME           30
     C                   PARM                    UUDEPO           10
     C                   PARM                    UUTERM           30
     C                   PARM                    UUUSER           10
     C                   PARM                    UUFEDRI           1
      *
     c     Heakey        chain     HEADF                              33
     c     *in33         cabeq     '1'           Slutt
     C                   EVAL      UFINS = 'N'
      *
     C     Slutt         tag
     C                   EVAL      *INLR=*ON
     C                   RETURN
