      **************************************************************
      * oppdaterer foretaksnummer i L1
      *****************************************************************
      *
     FKUNDL01   UF   E           K DISK
     C     *entry        plist
     c                   parm                    firma
     c                   parm                    kundnr
     c                   parm                    syrg             14
      *
     c     key           klist
     c                   kfld                    firma
     c                   kfld                    kundnr
      *
     c     key           chain     kundl01                            33
     c  N33              do
     C                   move      *blanks       foretn
     c                   movel     syrg          foretn
     c                   update    kundr
     c                   end
     c                   seton                                        lr
     c                   return
