      ******************************************************************
      *  FINN SONE UTFRA STREKNING                                     *
      ******************************************************************
     FSTEDIL02  IF   E           K DISK
     FBASES     IF   E           K DISK
      *
     c                   EXSR      INIT
     c                   EXSR      FINNSONE
      *
     c                   seton                                        LR
     c                   return
      *
      *******************************************************
     c     FINNSONE      Begsr
      *******************************************************
      *
      * FINN BASESTED FRA - TIL
     C     FRAKEY        SETLL     STEDIL02
     C     FRAKEE        READE     STEDIL02                               33
     C  N33STINPF        IFLE      FRAST                                          3B
     C                   MOVE      STINBA        FRABAS
     C                   END
     C     TILKEY        SETLL     STEDIL02
     C     TILKEE        READE     STEDIL02                               33
     C  N33STINPF        IFLE      TILST                                          3B
     C                   MOVE      STINBA        TILBAS
     C                   END
      *
      * FINN BASESTED FRA - TIL
     C     BASKEY        CHAIN     BASES                              33
     C                   IF        *IN33 = '0'
     C                   MOVE      BASSOT        SONE
     C                   IF        BASLMT <> *ZEROS AND FVEKT > BASLMT
     C                             AND BASSOL <> *BLANKS
     C                   MOVE      BASSOL        SONE
     C                   ENDIF
     C                   ENDIF
      *
     c                   endsr
      *
      *******************************************************
     c     INIT          Begsr
      *******************************************************
     c     *entry        plist
     c                   parm                    FRALK             2
     c                   parm                    FRAST             5
     c                   parm                    TILLK             2
     c                   parm                    TILST             5
     c                   parm                    XXXCUS            8 0
     c                   parm                    FVEKT             9 0
     c                   parm                    SONE              5
      *
     C                   MOVE      *BLANKS       SONE
      *
      *
     C     FRAKEY        KLIST
     C                   KFLD                    XXXCUS            8 0          NO-99999999=DOMESTIC
     C                   KFLD                    FRALK
     C                   KFLD                    FRAST
     C     FRAKEE        KLIST
     C                   KFLD                    XXXCUS
     C                   KFLD                    FRALK
     C     TILKEY        KLIST
     C                   KFLD                    XXXCUS
     C                   KFLD                    TILLK
     C                   KFLD                    TILST
     C     TILKEE        KLIST
     C                   KFLD                    XXXCUS
     C                   KFLD                    TILLK
     C     BASKEY        KLIST
     C                   KFLD                    FRALK
     C                   KFLD                    FRABAS            5
     C                   KFLD                    TILLK
     C                   KFLD                    TILBAS            5
      *
     c                   endsr
      *
