     FFRISOK    O  A E             DISK
     FSYGE48D   CF   E             WORKSTN
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *_________________
      * Input parametere
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    ZSYAV             4
     C                   PARM                    ZSYOP             5
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      * Viser bilde
     C                   MOVE      ZSYAV         HEAVD
     C                   MOVE      ZSYOP         HEOPD
     C                   EXFMT     SYGE48DA
      * andre funksjonstaster
     C     *IN03         CABEQ     *ON           SRB9
     C     *IN12         CABEQ     *ON           SRB9

     C                   CLEAR                   FRISOKR
     C                   EVAL      FSAVD=HEAVD
     C                   EVAL      FSOPD=HEOPD
     C                   EVAL      FSKODE='*CR'
     C                   EVAL      FSSOK=ZFSSOK
     C                   WRITE     FRISOKR
     C     SRB9          TAG
     C                   ENDSR
