      *
********************************************************************
      * summerer varelinje ufakturert mot en part
     FFIRM      IF   E           K DISK
     FFAK2      IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    Uavd              4 0
     C                   PARM                    Uopd              7 0
     C                   PARM                    Upart             1
     C                   PARM                    Usum              9 2
      *
     C     FAK2K         KLIST
     C                   KFLD                    uavd
     C                   KFLD                    uopd
     C                   KFLD                    upart
     c                   read      firm                                   33
     C                   MOVE      FITAX         FITAXB            4 4
     c                   exsr      vali
     c                   seton                                        lr
     c                   return
      ******************************************
     C     VALI          BEGSR
      ******************************************
      * AKKUMULERER sum
     C                   SETOFF                                       33
     C                   MOVE      *ZEROS        usum
      *
     C     FAK2K         SETLL     FAK2
      *
     C     *IN33         doweq     '0'
     C     FAK2K         READE     FAK2                                   33
     C     *in33         ifeq      '0'
     C     FAKDA         andne     'K'                                          *KOSTNADSLIN
     C     FAKDA         ANDNE     'C'                                          *KREDITNOTA
     C     FAKDA         ANDNE     'D'                                          *SLETTEDE
      *
      *
      * TAX ?
      *
     C     FAKDM         IFEQ      'J'
     C     FABELN        MULT(H)   FITAXB        XMOMSX            8 2
     C                   ADD       XMOMSX        FABELN
     C                   end
     c                   add       fabeln        usum
     C                   end
     C                   enddo
     C                   ENDSR
