     D EKSTRA          s            256
     D EKSTRA2         s            256
     D Tegn            s              1
     D Tegn2           s              2
      * Definere  hex ∆ ÿ ≈ Ê ¯ Â
     D Sto∆            c                   'AE'
     D Stoÿ            c                   'OE'
     D Sto≈            c                   'AA'
     D Lit∆            c                   'ae'
     D Litÿ            c                   'oe'
     D Lit≈            c                   'aa'
      * Definere  hex appostrof
     D Appo            c                   x'7D'
      * Definere  hex 0D / 25 (CRLF)
     D Hex0D           c                   x'0D'
     D Hex25           c                   x'25'
      *
     C     *ENTRY        PLIST
     C                   PARM                    UDATA           256
     C                   MOVE      UDATA         EKSTRA
     C                   EXSR      KONV
     C                   MOVE      EKSTRA        UDATA
     C                   SETON                                        LR
     C                   RETURN
      *
      **************************************************************************
     C     KONV          begsr
      **************************************************************************
     C                   move      '∆'           Tegn
     C                   move      sto∆          tegn2
     C                   exsr      KONV2
     C                   move      'ÿ'           Tegn
     C                   move      stoÿ          tegn2
     C                   exsr      KONV2
     C                   move      '≈'           Tegn
     C                   move      sto≈          tegn2
     C                   exsr      KONV2
     C                   move      'Ê'           Tegn
     C                   move      lit∆          tegn2
     C                   exsr      KONV2
     C                   move      '¯'           Tegn
     C                   move      litÿ          tegn2
     C                   exsr      KONV2
     C                   move      'Â'           Tegn
     C                   move      lit≈          tegn2
     C                   exsr      KONV2
     C                   endsr
      *
      **************************************************************************
     C     KONV2         begsr
      **************************************************************************
      *
     c                   move      *zeros        f                 3 0
     C     FlerTegn      tag
     C     Tegn          SCAN      EKSTRA        f
     C     f             cabeq     *zeros        uttegn2                        ikke flere...
     C                   EVAL      EKSTRA2 = %SUBST(EKSTRA:1:f-1) +
     C                             tegn2+
     C                             %trim(%SUBST(EKSTRA:f+1:256-f))
     C                   eval      EKSTRA = EKSTRA2
     C                   goto      FlerTegn
      *
     C     uttegn2       endsr
