     C                   EVAL      ua = '123456789012345678'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua               35
     C                   PARM                    ugs1              1

     C                   EVAL      ua = '00345678901234567890'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      ua = '12345678901234567890'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      ua = '12345A789012345678'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      ua = '123456789012345678901'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      ua = '12345678901234567'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      ua = '12345 78901234567'
     C                   EVAL      ugs1 = *blanks
     C                   CALL      'SYGE100'
     C                   PARM                    ua
     C                   PARM                    ugs1

     C                   EVAL      *INLR=*ON
