      *
      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE CC-FEE/TILLEGG BANKKURS    ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01-11 13-26                       ***
      *** LEDIGE INDIKATORER 27-29 31-99                       ***
      ************************************************************
      *
     FKODTDIN   UF A E           K DISK
     FSYIF24FM  CF   E             WORKSTN
     C*
     C                   MOVE      'DINNF'       KDIUNI
     C     KDIUNI        CHAIN     KODTDIN                            30
     C                   MOVE      KDIBL1        WSBL1
     C                   MOVE      KDIBL2        WSBL2
     C                   MOVE      KDIPRO        WSPRO
     C*
     C                   EXFMT     BILDE01
     C  N12              DO
     C                   MOVE      WSBL1         KDIBL1
     C                   MOVE      WSBL2         KDIBL2
     C                   MOVE      WSPRO         KDIPRO
     C   30              WRITE     KODTDINR
     C  N30              UPDATE    KODTDINR
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
