********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 hent siste meldingskode
      ***********************************************************
      *** PROGRAM SKAL VISE TOLLLAGERREGNSKAP                 ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FFREETXT2  IF   E           K DISK
     FEDIM2     IF   E           K DISK
N01  FTVINF     IF   E           K DISK
     FHEADF     IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSADH      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYIM50F   UF   E           K DISK
     FSYIM50FH  IF   E           K DISK
     FSYIM50FH2 IF   E           K DISK
     F                                     RENAME(SYIM50fhr:syim50fhr2)
     FSYIM50FH1 UF   E           K DISK
     F                                     RENAME(SYIM50fhr:syim50fhr1)
     FSYIM51D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                SDS
     D  UUSER                254    263
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XUL≈≈                 11     14  0
     D                 DS
     D  UL≈≈                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     C*
     C                   EXSR      INIT
     C*
     C                   MOVE      *BLANKS       wsstat
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WSUSER        IFNE      '*          '
     C     STARTK        SETGT     SYIM50FH
     C                   ELSE
     C     STARTK2       SETGT     SYIM50FH2
     C                   END
     C     START1        TAG
      *
     C     WSUSER        IFNE      '*          '
     C     readek        READPE    SYIM50FH                               94
     C                   ELSE
     C                   READP     SYIM50FH2                              94
     C                   END
     c  N94wsstat        ifne      *blank
     c     TLauto        andne     wsstat
     c                   goto      start1
     c                   end
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     c     lesny         tag
      *
     C     WSUSER        IFNE      '*          '
     C     readek        READPE    SYIM50FH                               94
     C                   ELSE
     C                   READP     SYIM50FH2                              94
     C                   END
     c  N94wsstat        ifne      *blank
     c     tlauto        andne     wsstat
     c                   goto      lesny
     c                   end
     C  N94              MOVE      TLUNIK        YUNIK
     C  N94              MOVE      TLDATE        YDATE
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*
     C*** TILBAKE
     C   12              GOTO      SLUTT
     C*
     C*** FRISK OPP
     c   05              z-add     99999999      ydate
     C   05              GOTO      START
     C*
     C*** SÿK FRA
     c   08              move      uldt          wsdate
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94WSUSER        IFNE      '*          '
     C     ROLKEY        SETGT     SYIM50FH
     C                   ELSE
     C     ROLKEY2       SETGT     SYIM50FH2
     C                   END
     C                   GOTO      START1
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENTSR
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C     SLETTET       IFEQ      'J'
     c   05              z-add     99999999      ydate
     C                   GOTO      START
     C                   END
     C                   GOTO      START3
     C*
     C*
     C*** SÿK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     11            POSNBR
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     c                   move      wsdate        ydate
     c                   z-add     999999999     yunik
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   MOVE      ' '           UIN01
     C   12              MOVE      '1'           UIN01
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENTSR        BEGSR
     C***********************************************
     C                   MOVE      'N'           SLETTET           1
     c                   setoff                                       30
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 5=VISE MAIL
      *
     C     WSNR          IFEQ      '5'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   EXSR      VISSR
     C                   GOTO      SLHENT
     C                   END
     C*
      *
      * 4=slett liste
      *
     C     WSNR          IFEQ      '4'                                          ENDRE
     C                   MOVE      'J'           SLETTET
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   EXSR      slett
     C                   GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '8'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   EXSR      epostsr
     C                   GOTO      SLHENT
     C                   END
     C*
     C                   END
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     c   98              move      'DIV0012'     msgnr
     c   98              seton                                        30
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISSR         BEGSR
     C***********************************************
     C                   EXSR      regen
     C                   MOVE      TLUNIK        UUNIK             9 0
     C                   CALL      'SYIM52R'
     C                   PARM                    UUNIK
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C     keydet        KLIST
     C                   KFLD                    tlunik
     C     STARTK        KLIST
     C                   KFLD                    WSUSER
     C                   KFLD                    YDATE             8 0
     C     readek        KLIST
     C                   KFLD                    WSUSER
     C     ROLKEY        KLIST
     C                   KFLD                    WSUSER
     C                   KFLD                    YDATE             8 0
     C                   KFLD                    YUNIK             9 0
     C*
     C     STARTK2       KLIST
     C                   KFLD                    YDATE             8 0
     C     ROLKEY2       KLIST
     C                   KFLD                    YDATE             8 0
     C                   KFLD                    YUNIK             9 0
     C*
     C     KUNKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     SADKEY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     FRIKEY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    UFOR              1
     C                   MOVE      'U'           UFOR
      *
     C     tkeymax       KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    maxdat            8 0
     C                   z-add     99999999      maxdat
N01  C     TVIKMAX       KLIST
N01  C                   KFLD                    MMNSI
N01  C                   KFLD                    FLNmax            5 0
N01  C                   z-add     99999         FLNmax
N01  C     TVIK          KLIST
N01  C                   KFLD                    MMNSI             9 0
      *
     C                   READ      FIRM                                   33
     C*
     C                   MOVE      UUSER         WSUSER
     c                   z-add     99999999      ydate
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XUL≈≈         UL≈≈
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     slett         BEGSR
     C***********************************************
     c     tlunik        chain     SYIM50FH1                          33
     c  n33              delete    syim50fhr1
     C     TLUNIK        SETLL     SYIM50F
     C     *IN33         DOWEQ     '0'
     C     TLUNIK        READE     SYIM50F                                33
     C  N33              DELETE    SYIM50FR
     C                   END
     C                   ENDSR
     C***********************************************
     C     epostsr       BEGSR
     C***********************************************
     c                   call      'MAIL01T3'
     c                   parm                    uuser
     c                   parm                    epos70           70
     c                   movel     epos70        epost
     c                   exfmt     BILDE02
     c   12              goto      utep
      *
     c                   move      tlunik        tlunika           9
     c                   call      'SYIM51CLEB'
     c                   parm                    tlunika
     c                   parm                    epost
     C     utep          ENDSR
     C***********************************************
     C     regen         BEGSR
     C***********************************************
     c                   setoff                                       33
     C     TLUNIK        SETLL     SYIM50F
     C     *IN33         DOWEQ     '0'
     C     TLUNIK        READE     SYIM50F                                33
     C     *IN33         ifeq      '0'
     C                   MOVE      ' '           FRITXT
     C                   MOVE      *BLANKS       FRTTXT
     C     FRIKEY        chain     freetxt2                           44
     C  N44              MOVE      'U'           FRITXT
      *
      *  henter data fra sad
      *
     c                   move      *zeros        tvidaf
     c                   move      *zeros        tvidas
      *
     C     SADKEY        CHAIN     SADH                               34
      *
     C     *IN34         IFEQ      '1'
     C                   MOVE      HEKNK         KUNDNR
     C                   MOVE      HETLL         SITLL
     C                   MOVE      HETLE         SITLE
     C                   MOVE      *BLANKS       SIDTG
     C                   MOVEL     'IKKE SAD'    SIDTG
     C                   Z-ADD     HENT          ANT               5 0
     C                   Z-ADD     HEVKT         VEKT              7 0
     C                   ELSE
     C                   Z-ADD     SINTK         ANT
     C                   Z-ADD     SIVKB         VEKT
     C                   MOVE      SIKNK         KUNDNR
     C                   END
      *
      *
     C     KUNKEY        CHAIN     CUNDL01                            35
     C  N35              MOVE      KNAVN         SINAK
     C   35              MOVE      HENAK         SINAK
      *
     c     tkeymax       setgt     edim2
     c     sadkey        readpe    edim2                                  36
N01  c                   move      *zeros        MMNSI
N01  c  N36              move      MMN           MMNSI
     c  N36              move      MDT           tvidas
     c     sadkey        setll     edim2
     c     sadkey        reade     edim2                                  36
     c  N36              move      MDT           tvidaf
N01   *
N01   * hent feilmeldingskode
N01   *
N01  c                   move      *blanks       tvi077
N01  c     *IN36         ifeq      '0'
N01  c     MMNSI         andne     *zeros
N01  c     tvikmax       setgt     tvinf
N01  c     tvik          readpe    tvinf                                  36
N01  c  N36              movel     F0078A        tvi077
N01  c                   end
      *
      *
     C                   UPDATE    SYIM50FR
     C                   END
     C                   END
     C                   ENDSR
