********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 feilmeldingskode    ....
********************************************************************
      *
      ***********************************************************
      *** PROGRAM SKAL VISE ARKIVLOGG                         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97    ***
      ***********************************************************
      *
     FFREETXT2  IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FFIRM      IF   E           K DISK
     Fsyim50fh1 IF   E           K DISK
     Fsyim50f   IF   E           K DISK
     Fsyim52d   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  epdata                 1     80
     D  sfdata                 1     78
     D  sfATTA                 1      8
     D                 DS
     D  HENAKF                 1     30
s01  D* knavn18                1     18
N01  D  knavn15                1     15
     D                SDS
     D  UUSER                254    263
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     STARTK        SETll     syim50f
     C     START1        TAG
      *
     C     startk        READe     syim50f                                94
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
     c                   move      *blanks       knavn
     c     kunkey        chain     cundl01                            34
     c                   move      *blanks       frttxt
     c     frikey        chain     freetxt2                           34
     c     sisg          ifeq      *blanks
     c                   move      hesg          sisg
     c                   end
     C                   WRITE     SUBFIL
     C
     C     startk        READe     syim50f                                94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C     startk        READPE    syim50f                                94
     C                   GOTO      START1
     C                   END
     C*
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    uunik             9 0
     C     kunkey        KLIST
     C                   KFLD                    fifirm
     C                   KFLD                    heknkf
     C     STARTK        KLIST
     C                   KFLD                    tlunik
     C     ROLKEY        KLIST
     C                   KFLD                    tlunik
     C*
     C     FRIKEY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    UFOR              1
     C                   MOVE      'U'           UFOR
     c                   read      firm                                   33
     C*
     C                   MOVE      uunik         tlunik
     c     startk        chain     syim50fh1                          33
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     c                   setoff                                       30
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
      *
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
      * 5=VISE oppdrag
      *
     C     WSNR          IFEQ      '5 '                                         ENDRE
     C                   MOVE      '  '          WSNR
     c                   update    subfil
     C                   EXSR      DSPOPD
     c                   seton                                        99
     C                   END
     C*
      *
      * 18=vise notater
      *
     C     WSNR          ifeq      '18'
     C                   MOVE      '  '          WSNR
     c                   update    subfil
     C                   EXSR      WRKFT
     c                   seton                                        99
     C                   END
      *
      * 6=se på sad
      *
     C     WSNR          ifeq      '6 '
     C                   MOVE      '  '          WSNR
     c                   update    subfil
     C                   EXSR      DSPSAD
     c                   seton                                        99
     c                   end
      *
      * 9=se på tvinnlog
      *
     C     WSNR          ifeq      '9 '
     C                   MOVE      '  '          WSNR
     c                   update    subfil
     C                   EXSR      DSPTVI
     c                   seton                                        99
     c                   end
      *
     c                   end
      *
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     c   98              move      'DIV0012'     msgnr
     c   98              seton                                        30
     C*
     C                   ENDSR
     C*
      ***********************************************
     C     DSPOPD        BEGSR
      ***********************************************
     C                   MOVE      *ZEROS        UFLAGG            1 0
     C                   CALL      'SYFM21A'
     C                   PARM                    FIFIRM
     C                   PARM      HEAVD         UAVD2             4 0
     C                   PARM      HEOPD         UOPD2             7 0
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      ***********************************************
     C     WRKFT         BEGSR
      ***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM      HEAVD         UAVD2
     C                   PARM      HEOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
     C***********************************************
     C     DSPSAD        BEGSR
     C***********************************************
     C                   CALL      'SAD005A'
     C                   PARM      HEAVD         UAVD2
     C                   PARM      HEOPD         UOPD2
     C                   PARM                    UFLAGG            1 0
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DSPTVI        BEGSR
     C***********************************************
     C                   MOVE      '0'           WIN03             1
     C                   CALL      'SAD003'
     C                   PARM      HEAVD         UAVD2
     C                   PARM      HEOPD         UOPD2
     C                   PARM                    WIN03
     C*
     C                   ENDSR
     C*
