      *
      ************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE HAWBNR. (INNENLAND)        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-98                             ***
      ************************************************************
     FTELLAWB   UF A E           K DISK
     FSYIN13FM  CF   E             WORKSTN
     C*
     C     TELKEY        KLIST
     C                   KFLD                    XUNI
     C                   KFLD                    WSTAB
     C     STB0          TAG
     C                   EXFMT     BILDE0
     C   03              GOTO      SLUTT
     C                   MOVE      'I'           XUNI              1
     C     TELKEY        CHAIN     TELLAWB                            99
     C  N99              MOVE      TEHAWB        WSIAWB
     C  N99              UPDATE    TELLAWBR
     C                   MOVE      'E'           XUNI
     C     TELKEY        CHAIN     TELLAWB                            99
     C  N99              MOVE      TEHAWB        WSEAWB
     C  N99              UPDATE    TELLAWBR
     C*
     C                   EXFMT     BILDE
     C   03              GOTO      STB0
     C*
     C     TELKEY        CHAIN     TELLAWB                            99
     C                   MOVE      WSEAWB        TEHAWB
     C                   MOVE      WSTAB         TETAB
     C   99              MOVE      'E'           TEHUNI
     C   99              WRITE     TELLAWBR
     C  N99              UPDATE    TELLAWBR
     C                   MOVE      'I'           XUNI
     C     TELKEY        CHAIN     TELLAWB                            99
     C                   MOVE      WSTAB         TETAB
     C                   MOVE      WSIAWB        TEHAWB
     C   99              MOVE      'I'           TEHUNI
     C   99              WRITE     TELLAWBR
     C  N99              UPDATE    TELLAWBR
     C*
     C                   GOTO      STB0
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
