********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF10 feil i datstruktur til faktura i batch
10XXX * 02 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
10XXX * 03 JOV PTF10 HENT KUNDEINFO ETTER SØK (EXSR TESTKU)
10XXX * 04 YBC PTF10 IKKE BLANKE NAVN VED SØKING AV KUNDENR
10172 * 05 SH  PTF10 norsk text til Track and trace
10XXX * 06 JOV PTF10 Nye parametre SYIN10B
********************************************************************
      *
      *
      *****************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAG (INNENLAND)             ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 01 08 13 16 17 19 22 23 25 26          ***
      *** LEDIGE INDIKATORER 35-56 64 71-74 78 79 83 84 90-92       ***
      *** INDIKATOR 31 32 34 PÅ BETYR KALLE FRA SYFF10 (ENDRE OPD.) ***
      *****************************************************************
      *
     FTRACKF    O  A E           K DISK
     FTRACKT    O  A E           K DISK
     FDOKUF     UF A E           K DISK
     FSTATVF    O  A E           K DISK
     FHEADF     UF A E           K DISK
     FSAMLA     UF   E           K DISK
     FMULTKODT  IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FFRATXT    IF   E           K DISK
     FTELL      UF   E           K DISK
     FTELLAWB   UF   E           K DISK
     FVADR      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FFREETXT   IF   E           K DISK
     FCUOTI     IF   E           K DISK
     FFRISOK    UF A E           K DISK
     FKODFRI    IF   E           K DISK
     FSYIN10FM  CF   E             WORKSTN USROPN
     F                                     INFDS(FBAREA)
     D HØ              S              3  2 DIM(12)
     D LE              S              3  2 DIM(12)
     D BR              S              3  2 DIM(12)
     D AN              S              3  0 DIM(12)
     D NAV             S              3    DIM(12) CTDATA PERRCD(1)
     D WR1             S              1    DIM(9)
     D WR2             S              1    DIM(17)
     D WR3             S              1    DIM(30)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  WSMSG                  1     62
     D  XKN                    7     14
     D  XLIKOD                31     31
     D  XLINAV                33     62
     D                 DS
     D  WSSDT                  1      5
     D  YSDT                   1      3
     D                 DS
     D  HEKNT                  1      8  0
     D  HEKNF                  6      8  0
     D                 DS
     D  WSSDL                  1     20
     D  WSSDL1                 1      1
     D  WSSDL2                 2     20
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  QDATA                  1    109
     D  QDA01                  1      2
     D  QDA02                  3      6
     D  QDA03                  7     13
s01  D* QDA04                 14     14
n01  D  QDA04                 14     15
     D  QDA05                 16     16
     D  QDA06                 17     20
     D  QDA07                 21     24
     D  QDA08                 25     26
     D  QDA09                 27     28
     D  QDA10                 29     29
     D  QDA11                 30     30
     D  QDA12                 31     37
     D  QDA13                 38     38
     D  QDA14                 39    100
     D  QDA15                101    101
     D  QDA16                102    102
     D  QDA17                103    103
     D  QDA18                104    109
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  M0068A                 1      6  0
     D  W0068A                 3      6  0
      *____________________________________________________________
      * Definition of the parameter CUTINF
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  CUTTRM                 1      1
     D  CUTPID                 2     18
     D  CUTALN                19     21  0
     D  CUTAWB                22     29  0
     D  CUTORI                30     32
     D  CUTDES                33     35
     D  CUTNPI                37     40  0
     D  CUTWGH                42     50  1
     D  CUTVOL                51     62  2
     D  CUTCON                63     77
     D  CUTCAR                78     79
     D  CUTFLN                80     84
     D  CUTSR1                85    149
     D  CUTSR2               150    214
     D  CUTINF                 1    256
     D                 DS
     D  CUTOS1                 1     64
     D  CUTPNA                65     99
     D  CUTPAD               100    134
     D  CUTPPL               135    151
     D  CUTPCO               152    160
     D  CUTDNA               161    195
     D  CUTDAD               196    230
     D  CUTDPL               231    247
     D  CUTDCO               248    256
     D  CUTIN2                 1    256
     D                 DS
     D  WRKSR1                 1     65
     D  F5212                  1      1
     D  F52141                 2      3
     D  F52142                 4      6
     D  F52143                 7     10
     D  F52161                11     12
     D  F52162                13     15
     D  F52163                16     19
     D  F5218                 20     31
     D  F52110                32     39
     D  F52112                40     44
     D                 DS
     D  WRKSR2                 1     65
     D  F5321                  1     30
     D  F5323                 31     60
     D                 DS
     D  WRKOS1                 1     65
     D  F6231                  1     30
     D  F6233                 31     40
     D  F6235                 41     50
     D  F6236                 51     60
     D                SDS
     D  WUSER                254    263
     D                UDS
     D  UUSR                 301    310
      *
     C                   OPEN      SYIN10FM
     C                   EXSR      INIT
      *
      *** UENDRE <> ' ' KALLE FRA SYFF10 (ENDRE(OPPDRAG/FAKTURA)
     C                   GOTO      START1
      *
     C     START         TAG
     C  N30              DO
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       279998
     C                   END
     C     STB1A         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       30
     C                   MOVEA     '0000'        *IN(96)
     C                   SETOFF                                       7776
     C                   MOVE      *BLANKS       WSMSG
      *
     C   07              DO
     C                   EXSR      GETOPD
     C     UAVDE         IFEQ      0
     C     UOPDE         OREQ      0
     C                   GOTO      STB1A
     C                   END
     C                   END
     C   12              GOTO      SLUTT
     C     START1        TAG
     C                   EXSR      TESTB1
      *
     C   30UTYPE         IFEQ      'CR2'
     C                   GOTO      START
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C     MSGNR         IFNE      'YBC0036'
     C                   MOVE      'DIV0000'     MSGNR
     C                   END
      *
      *** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE FAKTURA)
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      TESTB2
     C                   GOTO      START3
     C                   END
      *
     C   05              DO
     C                   EXSR      TESTB2
     C                   GOTO      START3
     C                   END
      *
     C     START2        TAG
     C  N14
     CANN04
     CANN30              Z-ADD     2             LINNBR
     C  N14
     CANN04
     CANN30              Z-ADD     8             POSNBR
      *
      *** TEST OM DET ER OPPLYSNINGER TIL OPPDRAG
     C     FREETK        SETLL     FREETXT
     C                   SETOFF                                       29
     C     WSAVD         READE     FREETXT                                29
     C  N29WSOPD         COMP      FRTOPD                             2929
      *
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE02
     C                   EXSR      KDTFMT
     C                   SETOFF                                       309998
     C                   SETOFF                                       7677
     C                   MOVEA     '0000'        *IN(93)
     C                   MOVEA     '00000'       *IN(85)
     C                   MOVEA     '000'         *IN(80)
     C                   MOVEA     '000000'      *IN(65)
     C                   MOVEA     '00000'       *IN(59)
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
     C   24              DO
     C                   EXSR      UTCMDL
     C                   GOTO      START2
     C                   END
      *
      * F20 ER OVER TIL FAXSYSTEM
      *
     C   20
     COR 21              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0210'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START2
     C                   END
     C                   EXSR      FAX
     C                   GOTO      START2
     C                   END
     C* KALL PÅ TDVIS FACT REQUEST
     C*
     C     *IN22         IFEQ      '1'
     C     FITDVI        IFNE      'J'
     C                   MOVEL     'BBA0035'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START2
     C                   ENDIF
     C                   EXSR      SFACT
     C                   GOTO      START2
     C                   ENDIF
      *
     C   07              DO
     C                   MOVE      'S'           UTYPE2
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   GOTO      START2
     C                   END
     C   02WSMAWB        IFEQ      0
     C                   EXSR      SETSML
     C                   GOTO      START2
     C                   ELSE
     C                   GOTO      START2
     C                   END
      * FREETEXT
     C   18              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SPO0106'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START2
     C                   END
     C                   EXSR      VISFRE
     C                   GOTO      START2
     C                   END
      * FRI SØKEVEI
     C                   EXSR      TESTKT
     C   15              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0126'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START2
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   GOTO      START2
     C                   END
     C* DUPOPPDRAG INNHENT/UTKJØRING
     C   11              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'JOV0802'     MSGNR
     C                   SETON                                        30
     C                   GOTO      START2
     C                   END
     C                   EXSR      OPDHEA
     C                   Move      'J'           XXVIS             1
     C                   CALL      'SYTR11'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XXFBNR            3 0
     C                   PARM                    XXVIS
     C                   GOTO      START2
     C                   END
      * SEARCH CUSTOMER
     C   04              DO
     C                   EXSR      SØKDTA
     C   30              GOTO      START2
     C     UFLAGG        IFEQ      1
     C                   GOTO      START2
     C                   END
     C     UTYPE         IFEQ      'CHO'
      *** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C                   GOTO      START2
     C                   END
     C                   END
     C   06              DO
     C                   EXSR      KUBIKK
     C                   GOTO      START2
     C                   END
     C   09WSMAWB        IFEQ      0
     C                   EXSR      AWBSR
     C                   GOTO      START2
     C                   ELSE
     C                   GOTO      START2
     C                   END
     C   10WSHAWB        IFNE      *ZEROS
     C     WSHAWB        ANDNE     *BLANKS
     C                   EXSR      SAMSLE
     C                   GOTO      START2
     C                   ELSE
     C                   MOVE      *ZEROS        WSHAWB
     C                   GOTO      START2
     C                   END
     C   12              DO
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              MOVE      ' '           HEST
     C  N33              UPDATE    HEADFR
     C   33WSMAWB        IFNE      *ZEROS
     C                   GOTO      START2
     C                   END
      *** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C                   GOTO      SLUTT
     C                   END
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      START2
     C                   END
      *
     C                   EXSR      TESTB2
     C   30              GOTO      START2
     C     WSOPD         IFEQ      *ZEROS
     C                   EXSR      OPDHEA
     C                   END
      *
      *** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C  N03
     CANN05
     CANN11UTYPE         IFNE      'CHO'
     C                   GOTO      START2
     C                   END
      *
     C                   EXSR      OPDHEA
      *
      *** UTYPE = 'CHF/CHO' KALLE FRA SYFF10 (ENDRE OPPDRAG)
     C     UTYPE         IFEQ      'CHO'
     C                   GOTO      SLUTT
     C                   END
      *
      *** INNENLANDS FLYFRAKTBREV
     C  N03WSPK5         IFEQ      'J'
     C                   EXSR      IFRABR
     C   12              GOTO      START2
     C                   END
     C*
     C     WSPK1         IFEQ      'J'
     C     DOKUFK        CHAIN(N)  DOKUF                              33
     C   03
     CAN 33              EXSR      MOVWDF
     C*
     C*** REGISTRERE FRAKTBREV
     C  N03              EXSR      FRABR
     C   12              GOTO      START2                                       TIL OPPDRAG
     C                   END
      *
      *** FAKTURA
     C     START3        TAG
     C     XNYGML        IFEQ      'NY'
     C                   EXSR      FAKTUR
     C                   ELSE
     C   05              EXSR      FAKTUR
     C  N05UTYPE         IFEQ      'CHF'
     C                   EXSR      FAKTUR
     C                   GOTO      SLUTT
     C                   ELSE
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              MOVE      ' '           HEST
     C  N33              UPDATE    HEADFR
     C                   END
     C                   END
      *
      *** UENDRE <> ' ' KALLE FRA SYFF10 (ENDRE FAKTURA)
     C   03UTYPE         IFEQ      'CR2'
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   SETOFF                                       300503
     C                   MOVEA     '0000'        *IN(96)
     C                   SETOFF                                       7776
     C                   MOVE      '1'           *IN58
     C                   GOTO      START1
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C   12              GOTO      START2
      *
     C     SLUTT         TAG
     C                   CLOSE     SYIN10FM
     C                   RETURN
      ***********************************************
     C     GETOPD        BEGSR
      ***********************************************
     C                   MOVE      'E'           UTYPE2            1
     C                   MOVE      WSAVD         UAVDE             4 0
     C                   MOVE      *ZEROS        UOPDE             7 0
     C                   MOVE      *BLANKS       USGE              3
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    UAVDE
     C                   PARM                    UOPDE
     C                   PARM                    USGE
     C     UAVDE         IFNE      0                                            1<-B
     C     UOPDE         ANDNE     0
     C     UTYPE2        IFEQ      'E'                                           2<-B
     C                   MOVE      UAVDE         WSAVD
     C                   MOVE      UOPDE         WSOPD
     C                   MOVE      USGE          WSSG
     C                   ELSE                                                    2
     C                   MOVE      UAVDE         HEAVD
     C                   MOVE      UOPDE         HEOPD
     C     WSSG          IFEQ      *BLANKS                                        3<-B
     C                   MOVE      USGE          WSSG
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
      ***********************************************
     C     TESTB1        BEGSR
      ***********************************************
     C                   MOVE      'DIV0000'     MSGNR
     C     WSOPD         IFGT      0
     C     HEOPD         IFGT      0
     C     HEAVD         ORGT      0
     C                   MOVE      'SPO0015'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      SLT1
     C                   END
     C                   END
     C     HEOPD         COMP      0                                  28
     C  N28HEAVD         COMP      0                                  28
     C                   MOVE      'GM'          XNYGML            2
     C                   MOVE      'N'           XFLYTM            1
      *
      **** TEST SAKSBEHANDLER
     C     KODSFK        CHAIN     KOSFR                              99
     C   99              MOVE      'SPS0011'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      SLT1
      *
      *** TEST AVDELING
     C     KODTAK        CHAIN     KOAR                               98
     C  N98KODTWK        CHAIN     KOWR                               98
     C  N98KODTVK        CHAIN     KOVR                               98
     C  N98              DO
     C     WSAVD         CHAIN(N)  TELL                               98
     C   98AVDZER        CHAIN(N)  TELL                               98
     C                   END
     C   98              MOVE      'SPA0006'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      SLT1
      *
      *** TEST OPPDRAGSNR
     C  N28              DO
     C     WSOPD         COMP      *ZEROS                                 33
     C  N33HEADFK        CHAIN     HEADF                              97
     C   97              MOVE      'SPO0002'     MSGNR
     C   97              SETON                                        30
     C   97              GOTO      SLT1
     C  N33
     CANN09HESG          IFEQ      'DUP'
     C                   MOVE      USG           HESG
     C                   MOVE      USG           WSSG
     C                   END
     C  N33
     CANN09WSSG          IFNE      HESG
     C                   MOVE      HESG          WSSG
     C                   MOVE      'YBC0036'     MSGNR
     C                   END
     C  N33
     CANN99HEST          COMP      ' '                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'C'                                9797
     C  N33
     CANN99
     CAN 97HEST          COMP      'U'                                9797
     C  N33
     CANN97
     CANN99HEUR          COMP      'E'                                9797
     C   97              MOVE      'SPO0006'     MSGNR
     C   99              MOVE      'SPS0014'     MSGNR
     C   97
     COR 99              SETON                                        30
     C   30              UPDATE    HEADFR
     C   30              MOVE      *ZEROS        HEAVD
     C   30              MOVE      *ZEROS        HEOPD
     C   97
     COR 99              GOTO      SLT1
     C   33              MOVE      KOABÆR        WSSTD
     C                   END
      *
      *** TEST AVDELING+OPPDRAGSNR FOR KOPIERING
     C   28              DO
     C     HEADKK        CHAIN(N)  HEADF                              33
     C  N33              MOVE      KOABÆR        WSSTD
     C   33              SETON                                        9630
     C   96              MOVE      'SPA0007'     MSGNR
      * DIRECT TO INVOICE NOT ALLOWED
     C   05              MOVE      'SPO0029'     MSGNR
     C   05              SETON                                        9630
     C   96              GOTO      SLT1
     C                   MOVE      *ZEROS        WSOPD
     C                   END
      *
     C  N33
     CANN28              DO
     C                   MOVE      'X'           HEST
     C   09              MOVE      WSSG          HESG
     C                   UPDATE    HEADFR
     C                   END
      *
     C     WSOPD         IFEQ      0
     C                   MOVE      'NY'          XNYGML
     C   28              EXSR      MOVHFW
     C  N28              EXSR      MOVB1
     C                   ELSE
     C                   EXSR      MOVHFW
     C                   END
      *
     C     SLT1          ENDSR
      *
      ***********************************************
     C     TESTB2        BEGSR
      ***********************************************
     C                   MOVE      'DIV0000'     MSGNR
     C     WSSG          IFEQ      *BLANKS
     C                   MOVE      USG           WSSG
     C                   END
     C     WSAVD         IFEQ      0
     C                   MOVE      UAVD          WSAVD
     C                   ELSE
     C     KODTAK        CHAIN     KOAR                               33
     C  N33KOAIE         COMP      'E'                                    33
     C   33              MOVE      UAVD          WSAVD
     C   33KODTAK        CHAIN     KOAR                               33
     C                   END
      *
      *** TEST DATO
     C                   MOVE      WSDT          XMMÅÅ             4 0
     C                   MOVE      XMMÅÅ         UÅÅ               2 0
     C                   MOVEL     XMMÅÅ         UMM               2 0
     C                   MOVEL     WSDT          UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      96
     C   96              MOVE      'SPD0001'     MSGNR
     C   96              SETON                                        30
      *
      *** TEST STED TIL
     C                   MOVE      *BLANKS       USDTT            18
     C     WSSDT         IFNE      *BLANKS                                      1<-B
     C     WSSDT         CHAIN     STED2                              94
     C  N94              MOVEL     ST2NVN        USDTT
     C  N94ST2LK         IFNE      'NO'                                          2<-B
     C     WSLKA         ANDEQ     '  '
     C                   MOVE      ST2LK         WSLKA
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
      *** TEST STED FRA
     C                   MOVE      *BLANKS       USDFT            18
     C     WSSDF         IFNE      *BLANKS                                      1<-B
     C     WSSDF         CHAIN     STED2                              95
     C  N95
     CANN94WSLKA         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      ST2LK         WSLKA
     C                   END                                                     2<-E
     C  N95              MOVEL     ST2NVN        USDFT
     C                   END                                                    1<-E
     C   95
     CANN30              MOVE      'SPS0012'     MSGNR
     C   95              SETON                                        30
     C   94
     CANN30              MOVE      'SPS0013'     MSGNR
     C   94              SETON                                        30
      *
      *** TEST LANDKODE
     C     KODLKK        CHAIN     KODTLKR                            93
     C   93
     CANN30              MOVE      'SPL0001'     MSGNR
     C   93              SETON                                        30
      *
      *** HENTE LOSSESTED
     C     WSSDL2        IFEQ      *BLANKS
     C     KODTEK        CHAIN     KOTMR                              33
     C  N33              MOVE      KOTMNV        WSSDL
     C                   END
     C   30              GOTO      SLT2
      *
      *** TEST FLYSELSKAP, SAMLA, SELGER OG KJØPER
     C                   EXSR      TESTKU
     C   30              GOTO      SLT2
      *
      *** TEST OPPDRAGSTYPE
     C     KODOTK        CHAIN     KOOTYR                             89
     C   89              MOVE      'SPO0007'     MSGNR
     C   89              SETON                                        30
      *
      *** TEST FRANKATUR
     C     KODFRK        CHAIN     KOFRR                              88
     C   88
     CANN30              MOVE      'SPF0006'     MSGNR
     C   88              SETON                                        30
      *
      *** TEST ANTALL KOLLI
     C     WSNT          COMP      0                                      87
     C   87
     CANN30              MOVE      'SPN0003'     MSGNR
     C   87              SETON                                        30
      *
      *** TEST ENHET/VARESLAG
     C     WSVS1         COMP      *BLANKS                                86
     C   86
     CANN30              MOVE      'SPV0005'     MSGNR
     C   86              SETON                                        30
      *
      *** TEST VEKT
     C     WSVKT         COMP      0                                      85
     C   85
     CANN30              MOVE      'SPV0002'     MSGNR
     C   85              SETON                                        30
      *
      *** HENTE PRINTERKODE
     C     KODO2K        CHAIN     KOOT2R                             33
     C  N33              DO
     C     WSPK1         IFEQ      ' '
     C                   MOVE      KO2FB         WSPK1
     C                   END
     C     WSPK3         IFEQ      ' '
     C                   MOVE      KO2KK         WSPK3
     C                   END
     C     WSPK5         IFEQ      ' '
     C                   MOVE      KO2FI         WSPK5
     C                   END
     C                   END
      *** TEST PRINTKODE FOR KJØREKVITERING
     C     WSPK3         COMP      ' '                                    82
     C   82
     CANN30              MOVE      'SPP0004'     MSGNR
     C   82              SETON                                        30
      *
      *** TEST PRINTEKODE FOR FLYFRAKTBREV INNLAND
     C     WSPK5         COMP      ' '                                    80
     C   80
     CANN30              MOVE      'SPP0006'     MSGNR
     C   80              SETON                                        30
      *
      *** TEST PRINTEKODE FOR STYKKGODSFRAKTBREV
     C     WSPK1         COMP      ' '                                    81
     C   81
     CANN30              MOVE      'SPP0002'     MSGNR
     C   81              SETON                                        30
      *
      *** HENTE FRITEKSTER
     C     WSAWBK        IFEQ      'A'
     C     WSAWBK        OREQ      'B'
     C                   MOVE      WSAWBN        WSMAWB
     C     WSHAWB        IFEQ      *BLANKS
     C     WSHAWB        OREQ      *ZEROS
     C     WSAWBK        IFNE      'B'
     C     TELAWK        CHAIN     TELLAWB                            33
     C  N33              MOVE      TEHAWB        WSHAWB
     C  N33              ADD       1             TEHAWB
     C  N33              UPDATE    TELLAWBR
     C                   END
     C                   END
     C                   MOVE      ' '           WSAWBK
     C                   MOVE      *BLANKS       WSAWBN
     C                   END
      *** FINNE FRAKTBREGNET VEKT
     C                   EXSR      FINNVK
      *
     C     SLT2          TAG
     C   30              EXSR      SETCUR
      *
     C                   ENDSR
      *
      ***********************************************
     C     SETCUR        BEGSR
      ***********************************************
     C   80
     COR 81
     COR 82              Z-ADD     21            LINNBR
     C   89
     COR 88
     COR 87
     COR 86
     COR 85              Z-ADD     17            LINNBR
     C   62
     COR 61
     COR 60
     COR 59              Z-ADD     12            LINNBR
     C   68
     COR 67
     COR 66
     COR 65              Z-ADD     8             LINNBR
     C   70              Z-ADD     5             LINNBR
     C   69              Z-ADD     4             LINNBR
     C   95
     COR 94
     COR 93              Z-ADD     3             LINNBR
     C   96              Z-ADD     2             LINNBR
      *
     C   81              Z-ADD     16            POSNBR
     C   80              Z-ADD     10            POSNBR
     C   82              Z-ADD     5             POSNBR
     C   85              Z-ADD     60            POSNBR
     C   86              Z-ADD     33            POSNBR
     C   87              Z-ADD     25            POSNBR
     C   88              Z-ADD     5             POSNBR
     C   89              Z-ADD     2             POSNBR
     C   59              Z-ADD     42            POSNBR
     C   60              Z-ADD     33            POSNBR
     C   62
     COR 61              Z-ADD     8             POSNBR
     C   65              Z-ADD     42            POSNBR
     C   66              Z-ADD     33            POSNBR
     C   68
     COR 67              Z-ADD     8             POSNBR
     C   70              Z-ADD     8             POSNBR
     C   69              Z-ADD     8             POSNBR
     C   93              Z-ADD     30            POSNBR
     C   94              Z-ADD     19            POSNBR
     C   95              Z-ADD     8             POSNBR
     C   96              Z-ADD     8             POSNBR
      *
     C                   ENDSR
      *
      ***********************************************
     C     TESTKU        BEGSR
      ***********************************************
     C                   SETOFF                                       9998
     C                   SETOFF                                       7776
      *
      *** TEST FLYSELSKAP
     C     WSKNF         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       KFSNAV
     C                   ELSE                                                   1
     C     KODFSK        CHAIN     KODTFSR                            69
     C   69              MOVE      'SPK0017'     MSGNR
     C   69              SETON                                        30
     C     WSKNKF        IFEQ      0                                             2<-B
     C                   MOVE      KFSKNR        WSKNKF
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
      *** TEST AGENT
     C     WSKNA         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       WSNAA
     C                   ELSE                                                   1
     C                   MOVE      WSKNA         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            70
     C   70
     CANN30              MOVE      'SPK0008'     MSGNR
     C   70              SETON                                        30
     C                   MOVE      KNAVN         WSNAA
     C                   END                                                    1<-E
      *** TEST IF AGENT HAS FREE INFO  (75 ON)
     C  N70              MOVE      WSKNA         FXKNR
     C  N70FRATXK        CHAIN     FRATXT                             33
     C  N70
     CAN 33FRAT2K        CHAIN     FRATXT                             33
     C  N70
     CANN33              SETON                                        75
      *
      *** TEST SELGER
     C                   MOVE      *BLANKS       XSTLF            15
     C     WSKNS         IFEQ      0                                            1<-B
     C     WSNAS         COMP      *BLANKS                                67
     C   67
     CANN30              MOVE      'SPN0005'     MSGNR
     C   67              SETON                                        30
     C                   ELSE                                                   1
     C                   MOVE      WSKNS         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            68
     C   68
     CANN30              MOVE      'SPK0010'     MSGNR
     C   68              SETON                                        30
      *** TEST IF SHIPPER HAS FREE INFO  (77 ON)
     C  N68              MOVE      WSKNS         FXKNR
     C  N68FRATXK        CHAIN     FRATXT                             33
     C  N68
     CAN 33FRAT2K        CHAIN     FRATXT                             33
     C  N68
     CANN33              SETON                                        77
     C  N68              MOVE      TLF           XSTLF
     C  N68WSNAS         IFEQ      *BLANKS                                       2<-B
     C                   MOVE      KNAVN         WSNAS
     C                   MOVE      ADR1          WSADS1
     C                   MOVE      ADR2          WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C     POSTNR        IFEQ      0                                              3<-B
     C                   MOVEL     ADR3          WSADS3
     C                   ELSE                                                     3
     C                   MOVEL     POSTNR        WSADS3
     C                   MOVE      ADR3          WSADS3
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C  N68WSKNSF        IFEQ      0                                             2<-B
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNS         WSKNSF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNSF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
      *** TEST OM TASTET VALUTAKODEN TIL SELGERSMOT. ER RIKTIG
     C     WSVALS        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVALS        KVAKOD
     C     KODVAK        CHAIN     KOVAR                              66
     C   66
     CANN30              MOVE      'SPV0001'     MSGNR
     C   66              SETON                                        30
     C                   END                                                    1<-E
      *
      *** TEST SELGERS FAKTURAMOTTAGER
     C     WSKNSF        IFEQ      0                                            1<-B
     C     WSKDFS        COMP      'X'                                6565
     C                   MOVE      *BLANKS       WSNASF
     C                   ELSE                                                   1
     C                   MOVE      WSKNSF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            65
     C     WSKDFS        IFNE      'X'
     C  N65AKTKOD        COMP      'A'                                6565
     C                   END
     C  N65              MOVE      KNAVN         WSNASF
     C                   END                                                    1<-E
     C   65
     CANN30              MOVE      'SPK0011'     MSGNR
     C   65              SETON                                        30
      *
      *** ANDRE FAKTORER AV SELGERSMOTTAGER
     C                   MOVE      *BLANKS       WSMSG
     C  N65WSKNSF        IFNE      0                                            1<-B
      *
      *** TEST OM KREDITGRENSE ER PASSERT
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XOVER            13 2
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XOVER                              65
     C   65
     CANN30              MOVE      'SPK0012'     MSGNR
     C   65              SETON                                        30
     C                   END                                                     2<-E
      *** SJEKK VALUTAKODE
     C     WSVALS        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALS
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALS
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *** ORDNE UTLEGGSPROV. SATS OG MINIMUM
     C     SYUTLP        IFEQ      0                                             2<-B
     C                   MOVE      FIUPS         XSUTL             4 2
     C                   MOVE      FIUPM         XSUMIN            2 0
     C                   ELSE                                                    2
     C                   Z-ADD     SYUTLP        XSUTL
     C                   Z-ADD     SYMINU        XSUMIN
     C                   END                                                     2<-E
     C     XSUTL         IFEQ      99.99                                         2<-B
     C                   MOVE      *ZEROS        XSUTL
     C                   END                                                     2<-E
      *** TEST OM SELGERSMOTTAGER HAR OPPLYSNING. HVIS DET, SETT 99 PÅ
     C                   MOVE      WSKNSF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        99
      *** TEST STOPPEKODE
     C     SYLIKV        COMP      ' '                                6363
     C   63              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG1         WSMSG
     C  N33              MOVE      WSKNSF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     XLIKOD        IFEQ      'J'
     C                   SETON                                        30
     C   30              GOTO      SLTKU
     C                   END                                                     2<-E
     C                   END                                                     2<-E
      *
     C                   END                                                    1<-E
      *** END PÅ  <WSKNSF IFNE 0>
      *
      *** TEST KJØPER
     C                   MOVE      *BLANKS       XKTLF            15
     C     WSKNK         IFEQ      0                                            1<-B
     C     WSNAK         COMP      *BLANKS                                62
     C   62
     CANN30              MOVE      'SPN0006'     MSGNR
     C   62              SETON                                        30
     C                   ELSE                                                   1
     C                   MOVE      WSKNK         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            61
     C   61
     CANN30              MOVE      'SPK0013'     MSGNR
     C   61              SETON                                        30
      *** TEST IF FREE INFO ON CONSIGNNEES  76 ON
     C  N61              MOVE      WSKNK         FXKNR
     C  N61FRATXK        CHAIN     FRATXT                             33
     C  N61
     CAN 33FRAT2K        CHAIN     FRATXT                             33
     C  N61
     CANN33              SETON                                        76
     C  N61              MOVE      TLF           XKTLF
     C  N61WSOT          IFEQ      *BLANKS                                       2<-B
     C                   MOVE      SYOPDT        WSOT
     C                   MOVE      'E'           UUR               1
     C                   CALL      'SYFA24'
     C                   PARM      WSKNS         UKNOP             8 0
     C                   PARM                    UUR
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM                    WSOT
     C                   END                                                     2<-E
      *
     C  N61WSNAK         IFEQ      *BLANKS                                       2<-B
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      *BLANKS       WSADK3
     C  N33              DO                                                       3<-B
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
      *                    END                                4<-E
     C                   END                                                      3<-E
     C   33              DO                                                       3<-B
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0                                               4<-B
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE                                                      4
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *
     C     WSKNKF        IFEQ      0                                             2<-B
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNK         WSKNKF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNKF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *
     C                   END                                                    1<-E
      *** END PÅ <WSKNK IFEQ 0>
      *
      *
      *** TEST OM TASTET VALUTAKODEN TIL KJØPERSMOT. ER RIKTIG
     C     WSVALK        IFNE      *BLANKS                                      1<-B
     C                   MOVE      WSVALK        KVAKOD
     C     KODVAK        CHAIN     KOVAR                              60
     C   60
     CANN30              MOVE      'SPV0001'     MSGNR
     C   60              SETON                                        30
     C                   END                                                    1<-E
      *
      *** TEST KJØPERS FAKTURAMOTTAGER
     C     WSKNKF        IFEQ      0                                            1<-B
     C     WSKDFK        COMP      'X'                                5959
     C                   MOVE      *BLANKS       WSNAKF
     C                   ELSE                                                   1
     C                   MOVE      WSKNKF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            59
     C     WSKDFK        IFNE      'X'
     C  N59AKTKOD        COMP      'A'                                5959
     C                   END
     C  N59              MOVE      KNAVN         WSNAKF
     C                   END                                                    1<-E
     C   59
     CANN30              MOVE      'SPK0014'     MSGNR
     C   59              SETON                                        30
      *
      *** ANDRE FAKTORER AV SELGERSMOTTAGER
     C     WSKNKF        IFNE      0                                            1<-B
      *
      *** TEST OM KREDITGRENSE ER PASSERT
     C     KGRENS        IFNE      0                                             2<-B
     C     KGRENS        MULT      1000          XOVER
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
     C     KSALDO        COMP      XOVER                              59
     C   59
     CANN30              MOVE      'SPK0015'     MSGNR
     C   59              SETON                                        30
     C   59              GOTO      SLTKU
     C                   END                                                     2<-E
      *** SJEKK VALUTAKODE
     C     WSVALK        IFEQ      *BLANKS                                       2<-B
     C     VALKOD        IFEQ      *BLANKS                                        3<-B
     C                   MOVE      FICURR        WSVALK
     C                   ELSE                                                     3
     C                   MOVE      VALKOD        WSVALK
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *** ORDNE UTLEGGSPROV. SATS OG MINIMUM
     C     SYUTLP        IFEQ      0                                             2<-B
     C                   MOVE      FIUPS         XKUTL             4 2
     C                   MOVE      FIUPM         XKUMIN            2 0
     C                   ELSE                                                    2
     C                   Z-ADD     SYUTLP        XKUTL
     C                   Z-ADD     SYMINU        XKUMIN
     C                   END                                                     2<-E
     C     XKUTL         IFEQ      99.99                                         2<-B
     C                   MOVE      *ZEROS        XKUTL
     C                   END                                                     2<-E
      *** TEST OM KJØPERSMOTTAGER HAR OPPLYSNING. HVIS DET, SETT 98 PÅ
     C                   MOVE      WSKNKF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        98
      *** TEST STOPPEKODE
     C     SYLIKV        COMP      ' '                                5757
     C   57              DO                                                      2<-B
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      XMSG1         WSMSG
     C  N33              MOVE      WSKNKF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C     XLIKOD        IFEQ      'J'
     C                   SETON                                        30
     C                   END                                                     2<-E
     C                   END                                                     2<-E
      *
     C                   END                                                    1<-E
      *** END PÅ  <WSKNKF IFNE 0>
      *
     C     SLTKU         TAG
     C     WSMSG         COMP      *BLANKS                            2727
      *
     C                   ENDSR
      *
      ***********************************************
     C     SAMSLE        BEGSR
      ***********************************************
     C     SAMLAK        SETLL     SAMLA
     C                   SETOFF                                       30
     C     STSML         TAG
     C     YSDT          READE     SAMLA                                  30
     C  N30SMST          IFEQ      'U'
     C                   UPDATE    SAMLAR
     C                   GOTO      STSML
     C                   ELSE
     C     SMMAWB        IFEQ      WSMAWB
     C                   MOVE      *ZEROS        WSMAWB
     C                   MOVE      *BLANKS       WSRFA
     C                   MOVE      *BLANKS       WSSAML
     C                   MOVE      *ZEROS        WSHAWB
     C                   MOVE      *ZEROS        WSPRO
     C                   SUB       1             SMNT
     C                   UPDATE    SAMLAR
     C                   ELSE
     C                   UPDATE    SAMLAR
     C                   GOTO      STSML
     C                   END
     C                   END
     C                   SETOFF                                       30
      *
     C                   ENDSR
      *
      ***********************************************
     C     FINNVK        BEGSR
      ***********************************************
      *
      *** FINNE FRAKTBREGNET VEKT
     C     WSLM          MULT      KOVLKG        XLMLM             9 0
     C     WSM3          MULT      KOVKKG        XM3DE            12 3
     C                   ADD       0.999         XM3DE
     C                   Z-ADD     XM3DE         XM3M3             9 0
     C     WSVKT         COMP      XLMLM                              33
     C   33              Z-ADD     WSVKT         WSFBV             9 0
     C  N33              Z-ADD     XLMLM         WSFBV
     C     WSFBV         COMP      XM3M3                              33
     C  N33              Z-ADD     XM3M3         WSFBV
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVHFW        BEGSR
      ***********************************************
     C  N28              MOVE      HESTD         WSSTD
     C   28              MOVE      KOABÆR        WSSTD
     C  N28              MOVE      HEPRO         WSPRO
     C   28              MOVE      *ZEROS        WSPRO
     C  N28              MOVE      HEDTD         WSDTD
     C  N28              MOVE      HEDTM         WSDTM
     C  N28              MOVE      HEDTÅ         WSDTÅ
     C   28              MOVE      UDAY          WSDTD
     C   28              MOVE      UMONTH        WSDTM
     C   28              MOVE      UYEAR         WSDTÅ
     C  N28HEGN          IFEQ      *BLANKS
     C                   MOVE      *ZEROS        WSMAWB
     C                   ELSE
     C                   MOVE      HEGN          WSMAWB
     C                   END
     C   28              MOVE      *ZEROS        WSMAWB
     C* N28              MOVE      HERFA         WSRFA
     C  N28              MOVEL     HERFA         WSRFA
     C  N28              MOVE      HESAML        WSSAML
     C   28              MOVE      *BLANKS       WSRFA
     C                   MOVE      HESDF         WSSDF
     C                   MOVE      HESDT         WSSDT
     C  N28              MOVE      HEHAWB        WSHAWB
     C   28              MOVE      *ZEROS        WSHAWB
     C                   MOVE      HELKA         WSLKA
     C                   MOVE      HESDL         WSSDL
     C                   MOVE      HEKNA         WSKNA
     C                   MOVE      HENAA         WSNAA
     C                   MOVE      HEKNF         WSKNF
     C     WSKNF         IFEQ      0
     C                   MOVE      *BLANKS       KFSNAV
     C                   ELSE
     C     KODFSK        CHAIN     KODTFSR                            33
     C                   END
     C                   MOVE      HEKNS         WSKNS
     C                   MOVE      HEANS         WSANS
     C                   MOVE      HEKDFS        WSKDFS
     C                   MOVE      HEVALS        WSVALS
     C                   MOVE      HEKNSF        WSKNSF
     C                   MOVE      HENASF        WSNASF
     C                   MOVE      HENAS         WSNAS
     C                   MOVE      HEADS1        WSADS1
     C                   MOVE      HEADS2        WSADS2
     C                   MOVE      HEADS3        WSADS3
     C                   MOVE      HEKNK         WSKNK
     C                   MOVE      HEANK         WSANK
     C                   MOVE      HEKDFK        WSKDFK
     C                   MOVE      HEVALK        WSVALK
     C                   MOVE      HEKNKF        WSKNKF
     C                   MOVE      HENAKF        WSNAKF
     C                   MOVE      HENAK         WSNAK
     C                   MOVE      HEADK1        WSADK1
     C                   MOVE      HEADK2        WSADK2
     C                   MOVE      HEADK3        WSADK3
     C                   MOVE      HEOT          WSOT
     C                   MOVE      HEFR          WSFR
     C                   MOVE      HEGM1         WSGM1
     C                   MOVE      HENT          WSNT
     C                   MOVE      HEVS1         WSVS1
     C                   MOVE      HEVKT         WSVKT
     C                   MOVE      HELM          WSLM              4 2
     C                   MOVE      HEM3          WSM3
     C                   MOVE      HEFBV         WSFBV
     C                   MOVE      HEGM2         WSGM2
     C                   MOVE      HEVS2         WSVS2
     C                   MOVE      HEKDL         WSKDL
     C  N28              MOVE      HEPK3         WSPK3
     C   28              MOVE      ' '           WSPK3
     C  N28              MOVE      HEPK5         WSPK5
     C   28              MOVE      ' '           WSPK5
     C  N28              MOVE      HEPK9         WSPK9
     C   28              MOVE      ' '           WSPK1
     C  N28              MOVE      HEPK1         WSPK1
     C   28              MOVE      ' '           WSPK9
     C   28              MOVE      ' '           HE01
     C   28              Z-ADD     0             HENTF
     C   28              MOVE      *ZEROS        TRAVD0
     C   28              MOVE      *ZEROS        TROPD0
     C   28              MOVE      *ZEROS        TRAVD1
     C   28              MOVE      *ZEROS        TROPD1
     C   28              MOVE      *ZEROS        TRAVD2
     C   28              MOVE      *ZEROS        TROPD2
     C   28              MOVE      *BLANKS       HETLE
     C   28              MOVE      *BLANKS       HETLL
     C   28              MOVE      *BLANKS       HEGNN
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVB1         BEGSR
      ***********************************************
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        WSPRO
     C                   MOVE      UDAY          WSDTD
     C                   MOVE      UMONTH        WSDTM
     C                   MOVE      UYEAR         WSDTÅ
     C                   MOVE      *BLANKS       WSRFA
     C                   MOVE      *BLANKS       WSSAML
     C                   MOVE      *ZEROS        WSMAWB
     C                   MOVE      *BLANKS       WSSDF
     C                   MOVE      *BLANKS       WSSDT
     C                   MOVE      *ZEROS        WSHAWB
     C                   MOVE      *BLANKS       WSLKA
     C                   MOVE      *BLANKS       WSSDL
     C                   MOVE      *ZEROS        WSKNA
     C                   MOVE      *BLANKS       WSNAA
     C                   MOVE      *ZEROS        WSKNF
     C                   MOVE      *BLANKS       KFSNAV
     C                   MOVE      *ZEROS        WSKNS
     C                   MOVE      *ZEROS        WSANS
     C                   MOVE      *BLANKS       WSKDFS
     C                   MOVE      *BLANKS       WSVALS
     C                   MOVE      *ZEROS        WSKNSF
     C                   MOVE      *BLANKS       WSNASF
     C                   MOVE      *BLANKS       WSNAS
     C                   MOVE      *BLANKS       WSADS1
     C                   MOVE      *BLANKS       WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C                   MOVE      *ZEROS        WSKNK
     C                   MOVE      *ZEROS        WSANK
     C                   MOVE      *BLANKS       WSKDFK
     C                   MOVE      *BLANKS       WSVALK
     C                   MOVE      *ZEROS        WSKNKF
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      *BLANKS       WSNAK
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      *BLANKS       WSOT
     C                   MOVE      *BLANKS       WSFR
     C                   MOVE      *BLANKS       WSGM1
     C                   MOVE      *ZEROS        WSNT
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *ZEROS        WSVKT
     C                   MOVE      *ZEROS        WSLM
     C                   MOVE      *ZEROS        WSM3
     C                   MOVE      *ZEROS        WSFBV
     C                   MOVE      *BLANKS       WSGM2
     C                   MOVE      *BLANKS       WSVS2
     C                   MOVE      *BLANKS       WSKDL
     C                   MOVE      *BLANKS       WSPK1
     C                   MOVE      *BLANKS       WSPK3
     C                   MOVE      *BLANKS       WSPK5
     C                   MOVE      *BLANKS       WSAWBK
     C                   MOVE      *BLANKS       WSAWBN
     C                   MOVE      *BLANKS       WSPK9
      *
     C                   ENDSR
      *
      ***********************************************
     C     OPDHEA        BEGSR
      ***********************************************
     C     WSPRO         IFEQ      0
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C  N33              Z-ADD     TETURN        WSPRO
     C  N33              ADD       1             TETURN
     C  N33              UPDATE    TELLR
     C                   END
      *
     C     HEADFK        CHAIN     HEADF                              33
      * OPPDATER STATISTIKK HVIS OPPDRAG ER ALLEREDE OPPDATERT PÅ STAT.
     C  N33HE01          IFEQ      'J'
     C                   WRITE     STATVFR
     C                   MOVE      WSAVD         USTAVD            4
     C                   MOVE      WSOPD         USTOPD            7
     C                   CALL      'SYST35CA'
     C                   PARM                    USTAVD
     C                   PARM                    USTOPD
     C                   END
      *
     C                   EXSR      MOVWHF
     C  N33              UPDATE    HEADFR
     C   33              DO
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C                   UPDATE    TELLR
     C     UYEAR         IFGT      50
     C     UYEAR         ADD       1900          HEDTRÅ
     C                   ELSE
     C     UYEAR         ADD       2000          HEDTRÅ
     C                   END
     C                   MOVE      UMONTH        HEDTRM
     C                   MOVE      UDAY          HEDTRD
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      'E'           HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD         HEAVD
     C                   MOVE      *BLANKS       HESDVT
     C                   MOVE      *BLANKS       HESDFF
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      '   '         HEVALT
     C                   MOVE      *ZEROS        HEVALP
     C                   MOVE      '   '         HETLE
     C                   MOVE      ' '           HETLKU
     C                   MOVE      '     '       HETLL
     C                   MOVE      ' '           HEPK1
     C                   MOVE      ' '           HEPK2
     C                   MOVE      ' '           HEPK4
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *Zeros        HEKLMO
     C                   MOVE      ' '           HEPK7
     C                   MOVE      ' '           HEPK8
     C                   MOVE      *BLANKS       HEGNN
     C                   WRITE     HEADFR
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
     C                   END
      *
     C                   MOVE      HEAVD         UAVD
     C                   MOVE      HEOPD         UOPD
     C                   MOVE      HESG          USG
     C                   MOVE      '0'           *IN58
      * OPPDATER OPPDRAGSDATO PÅ ALLE FRISØKEVEIER
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      HEDTOP        FSDTOP
     C                   UPDATE    FRISOKR
     C     HEADFK        READE     FRISOK                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVWHF        BEGSR
      ***********************************************
     C                   MOVE      'X'           HEST
     C                   MOVE      WSSG          HESG
     C                   MOVE      WSSTD         HESTD
     C                   MOVE      WSPRO         HEPRO
     C                   MOVE      WSDTD         HEDTD
     C                   MOVE      WSDTM         HEDTM
     C     WSDTÅ         IFGT      50
     C     WSDTÅ         ADD       1900          HEDTÅ
     C                   ELSE
     C     WSDTÅ         ADD       2000          HEDTÅ
     C                   END
     C                   MOVE      WSMAWB        HEGN
     C                   MOVE      WSSDF         HESDF
     C                   MOVE      WSSDT         HESDT
     C                   MOVE      WSKNA         HEKNA
     C                   MOVE      WSNAA         HENAA
     C                   MOVE      WSKNS         HEKNS
     C                   MOVE      WSKDFS        HEKDFS
     C                   MOVE      WSVALS        HEVALS
     C                   MOVE      WSNAS         HENAS
     C                   MOVE      WSADS1        HEADS1
     C                   MOVE      WSADS2        HEADS2
     C                   MOVE      WSADS3        HEADS3
     C                   MOVE      WSKNSF        HEKNSF
     C                   MOVE      WSANS         HEANS
     C                   MOVE      WSNASF        HENASF
     C                   MOVE      WSKNK         HEKNK
     C                   MOVE      WSKDFK        HEKDFK
     C                   MOVE      WSVALK        HEVALK
     C                   MOVE      WSNAK         HENAK
     C                   MOVE      WSADK1        HEADK1
     C                   MOVE      WSADK2        HEADK2
     C                   MOVE      WSADK3        HEADK3
     C                   MOVE      WSKNKF        HEKNKF
     C                   MOVE      WSANK         HEANK
     C                   MOVE      WSNAKF        HENAKF
     C                   MOVE      WSOT          HEOT
     C                   MOVE      WSFR          HEFR
     C                   MOVE      WSNT          HENT
     C                   MOVE      WSVS1         HEVS1
     C                   MOVE      WSVKT         HEVKT
     C                   MOVE      WSLM          HELM
     C                   MOVE      WSM3          HEM3
     C                   MOVE      WSPK1         HEPK1
     C                   MOVE      WSPK3         HEPK3
     C                   MOVE      WSPK5         HEPK5
      *                    MOVE WSPK6     HEPK6
     C                   MOVE      WSKNF         HEKNF
     C                   MOVE      WSLKA         HELKA
     C                   MOVE      *BLANKS       HEKDPL
     C                   MOVE      WSHAWB        HEHAWB
     C                   MOVE      WSFBV         HEFBV
     C                   MOVE      WSPK5         HEPK5
     C*                  MOVE      WSRFA         HERFA
     C                   MOVEL     WSRFA         HERFA
     C                   MOVE      WSSAML        HESAML
     C                   MOVE      WSSDL         HESDL
     C                   MOVE      WSGM1         HEGM1
     C                   MOVE      WSGM2         HEGM2
     C                   MOVE      WSVS2         HEVS2
     C                   MOVE      WSKDL         HEKDL
     C                   MOVE      WSPK9         HEPK9
     C                   MOVE      'NO'          HELKK
     C                   MOVE      'NO'          HELKS
      *
     C                   ENDSR
      *
      ***********************************************
     C     SETSML        BEGSR
      ***********************************************
     C                   MOVE      *ZEROS        XDT               6 0
     C     WSPK9         IFEQ      'J'
     C                   Z-ADD     1             UFLAGG
     C                   ELSE
     C                   Z-ADD     0             UFLAGG
     C                   END
     C                   CALL      'SYIN10A'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   PARM                    YSDT
     C                   PARM                    XDT
     C                   PARM                    WSKNF
     C                   PARM                    WSKNA
     C                   PARM                    WSPRO
     C                   PARM                    WSSAML
     C                   PARM                    WSKNKF
     C                   PARM                    WSHAWB
     C                   PARM                    WSMAWB
     C                   PARM                    UFLAGG
     C                   PARM                    KOWLAS
     C     XDT           IFNE      0
     C                   MOVE      XDT           WSDT
     C                   END
     C     UFLAGG        IFEQ      1
     C                   MOVE      XMSG2         WSMSG
     C                   ELSE
     C                   MOVE      *BLANKS       WSMSG
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     KUBIKK        BEGSR
      ***********************************************
     C                   CALL      'SYIN10B'
n06  C                   PARM                    UUavd             4 0
n06  C                   PARM                    UUopd             7 0
n06  C                   PARM                    UUfbn             3 0
     C                   PARM                    XFLYTM
     C                   PARM      WSM3          UM3               7 3
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C                   Z-ADD     UM3           WSM3
      *
     C                   ENDSR
      *
      ***********************************************
     C     AWBSR         BEGSR
      ***********************************************
     C     WSPK9         IFEQ      'J'
     C                   Z-ADD     1             UFLAGG
     C                   MOVE      'J'           UPROD
     C                   ELSE
     C                   Z-ADD     0             UFLAGG
     C                   MOVE      'I'           UPROD             1
     C                   END
     C                   CALL      'SYIN10C'
     C                   PARM                    WSKNF
     C                   PARM                    WSMAWB
     C                   PARM                    UFLAGG
     C                   PARM                    KOWLAS
     C                   PARM                    UPROD
     C     UFLAGG        IFEQ      1
     C                   MOVE      XMSG2         WSMSG
     C                   ELSE
     C                   MOVE      *BLANKS       WSMSG
     C                   END
      *
     C                   ENDSR
      *
S02  C***********************************************
S02  C*    SØKKUN        BEGSR
S02  C***********************************************
S02  C*  32              MOVE      WSKNK         XKNK              8 0
S02  C*  34              MOVE      WSKNS         XKNS              8 0
S02  C*                  CALL      'SOEKUN'
S02  C*                  PARM                    FIFIRM
S02  C*                  PARM                    SOANTK
S02  C*                  PARM                    SOTXT1
S02  C*                  PARM                    WSKNA
S02  C*                  PARM                    SOTXT2
S02  C*                  PARM                    WSKNS
S02  C*                  PARM                    SOTXT3
S02  C*                  PARM                    WSKNSF
S02  C*                  PARM                    SOTXT4
S02  C*                  PARM                    WSKNK
S02  C*                  PARM                    SOTXT5
S02  C*                  PARM                    WSKNKF
S02  C*                  PARM                    SOTXT6
S02  C*                  PARM                    SOKNR6
S02  C*                  PARM                    SOTXT7
S02  C*                  PARM                    SOKNR7
S02  C*                  PARM                    SOTXT8
S02  C*                  PARM                    SOKNR8
S02  C*  32              MOVE      XKNK          WSKNK
S02  C*  34              MOVE      XKNS          WSKNS
S02  C*                  Z-ADD     0             UFLAGG
S02  C*
S02  C*                  ENDSR
S02  C*
      ***********************************************
     C     VISOPL        BEGSR
      ***********************************************
      * OPPDRAGSNOTAT...
     C  N29LINNBR        IFEQ      2
     C                   EXSR      VISFRE
     C                   GOTO      SLVISO
     C                   END
      * KUNDE NOTAT...
     C     POSNBR        IFGE      8
     C     POSNBR        ANDLE     40
     C                   SELECT
     C     LINNBR        WHENEQ    5
     C                   MOVE      SOTXT1        XSKMOT            8
     C                   MOVE      WSKNA         XSKKNR            8 0
     C                   GOTO      STVISO
     C     LINNBR        WHENGE    7
     C     LINNBR        ANDLE     9
     C                   MOVE      SOTXT2        XSKMOT            8
     C                   MOVE      WSKNS         XSKKNR            8 0
     C                   GOTO      STVISO
     C     LINNBR        WHENGE    11
     C     LINNBR        ANDLE     13
     C                   MOVE      SOTXT4        XSKMOT
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C                   ENDSL
     C                   END
      *
     C     POSNBR        IFGE      42
     C     POSNBR        ANDLE     80
     C     LINNBR        IFGE      7
     C     LINNBR        ANDLE     9
     C                   MOVE      SOTXT3        XSKMOT            8
     C                   MOVE      WSKNSF        XSKKNR            8 0
     C                   GOTO      STVISO
     C                   ELSE
     C     LINNBR        IFGE      11
     C     LINNBR        ANDLE     13
     C                   MOVE      SOTXT5        XSKMOT
     C                   MOVE      WSKNKF        XSKKNR
     C                   GOTO      STVISO
     C                   END
     C                   END
     C                   END
      *
      * HVIS F14 ER TRYKKET I UDEFINERT OMRÅDE VISES FØRSTE
      * OG BESTE, HVIS DET FINNES NOE
     C                   SELECT
     C     *IN75         WHENEQ    '1'                                           AGENT
     C                   MOVE      SOTXT1        XSKMOT            8
     C                   MOVE      WSKNA         XSKKNR
     C                   GOTO      STVISO
     C     *IN77         WHENEQ    '1'                                           SELGER
     C                   MOVE      SOTXT2        XSKMOT            8
     C                   MOVE      WSKNS         XSKKNR
     C                   GOTO      STVISO
     C     *IN99         WHENEQ    '1'                                           SELGERS MOTAGER
     C                   MOVE      SOTXT3        XSKMOT            8
     C                   MOVE      WSKNSF        XSKKNR
     C                   GOTO      STVISO
     C     *IN76         WHENEQ    '1'                                           KJØPER
     C                   MOVE      SOTXT4        XSKMOT
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C     *IN98         WHENEQ    '1'                                           KJØPERS MOTAGER
     C                   MOVE      SOTXT5        XSKMOT
     C                   MOVE      WSKNKF        XSKKNR
     C                   GOTO      STVISO
     C                   ENDSL
      *
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
      *
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR
     C                   PARM                    XSKMOT
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
     C                   GOTO      SLVISO
      *
     C     SLVISO        ENDSR
      *
      ***********************************************
     C     SØKVAD        BEGSR
      ***********************************************
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    WSKNS
     C                   PARM                    WSNAK
     C                   PARM                    WSADK1
     C                   PARM                    WSADK2
     C                   PARM                    WSADK3
     C                   PARM                    ULK               2
     C                   PARM                    UADRNR            5
      *
     C                   ENDSR
      *
      ***********************************************
     C     IFRABR        BEGSR
      ***********************************************
     C                   Z-ADD     8             UFLAGG
     C   08              Z-ADD     9             UFLAGG
     C                   CALL      'SYFI10B'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   PARM                    XSTLF
     C                   PARM                    XKTLF
     C                   PARM                    KFRCP
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    HØ
     C                   PARM                    AN
      *
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C  N03UFLAGG        COMP      6                                      03
     C     UFLAGG        COMP      1                                      12
      *
     C                   ENDSR
      *
      ***********************************************
     C     FAKTUR        BEGSR
      ***********************************************
     C                   EXSR      TESTKT
     C                   MOVE      'N'           OTIAUT            1              KRAV=auto
      *
     C     OTIKU1        IFNE      *ZEROS
      * FØRST KUNDE 1
     C                   MOVE      OTIKU1        OTIKNR
     C     OTI0          TAG
     C                   MOVE      WSAVD         OTIAVD
     C     OTI1          TAG
     C                   MOVE      'N'           OTIJN             1
     C     OTIKEY        SETLL     CUOTI
     C     OTIKEY        READE     CUOTI                                  33
     C     *IN33         DOWEQ     '0'
      * Kundespesif. søkevei.. Finnes koden fra før/hvis ikke lag den
     C                   MOVE      'J'           OTIJN
     C                   MOVE      WSAVD         FSAVD
     C                   MOVE      WSOPD         FSOPD
     C                   MOVE      COKODE        FSKODE
     C     FSOKEY        CHAIN     FRISOK                             33
     C  N33              UPDATE    FRISOKR
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       FSSOK
     C     FSKODE        CHAIN     KODFRI                             33
     C  N33              MOVE      KFSODK        FSDOKK
     C   33              MOVE      *BLANKS       FSDOKK
     C                   MOVE      HEDTOP        FSDTOP
     C                   WRITE     FRISOKR
     C                   END
      *  Hvis kravfelt.. er det utfyllt ...  hvis ikke AUTO INN..
     C     COKRAV        IFEQ      '1'
     C     COKRAV        OREQ      '2'
     C     FSSOK         IFEQ      *BLANKS
     C                   MOVE      'J'           OTIAUT                           KRAV=AUTO
     C                   END
     C                   END
     C     OTIKEY        READE     CUOTI                                  33
     C                   END
      * Hvis ingenting fantes på spesifik avdeling, prøv med 0 i avd.
     C     OTIJN         IFEQ      'N'
     C     OTIAVD        ANDNE     *ZEROS
     C                   MOVE      *ZEROS        OTIAVD
     C                   GOTO      OTI1
     C                   END
      * DERETTER KUNDE 2  HVIS FORSKJ. FRA KUNDE 1
     C     OTIKU2        IFNE      *ZEROS
     C                   MOVE      OTIKU2        OTIKNR
     C                   MOVE      *ZEROS        OTIKU2
     C                   GOTO      OTI0
     C                   END
      *
      * HVIS UTILFREDSSTILTE KRAVFELT - AUTO-VIS FRIE SØKEV.
     C     OTIAUT        IFEQ      'J'
     c                   move      WSKNSF        OTIKU1
     C                   MOVE      *ZEROS        OTIKU2
     C     WSKNKF        IFNE      *zeros
     C     WSKNKF        andne     WSKNSF
     C     OTIKU1        ifeq      *zeros
     C                   MOVE      WSKNKF        OTIKU1
     C                   else
     C                   MOVE      WSKNKF        OTIKU2
     C                   end
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
     C                   END
      *
     C                   END
      *
     C                   Z-ADD     8             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C                   MOVE      *ZEROS        UKFRA             7 0
     C                   MOVE      ' '           WSMELD            1
     C     UFLAGG        IFEQ      3
     C     UFLAGG        OREQ      6
     C                   GOTO      BAT
     C                   END
     C                   CALL      'SYFI10X'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XNYGML
     C                   PARM                    KO2UTL
     C                   PARM                    XKUTL
     C                   PARM                    XSUTL
     C                   PARM                    XKUMIN
     C                   PARM                    XSUMIN
     C                   PARM                    KO2MVK
     C                   PARM                    KO2MVS
     C                   PARM                    UKFRA
     C                   PARM                    KOVAVR
     C                   PARM                    WSMSG
     C                   PARM                    WSMELD
     C                   PARM                    UFLAGG
     C                   PARM                    UKODE
     C                   PARM                    USECUR            6
     C                   GOTO      UTFAK
     C     BAT           TAG
     C                   MOVEL     FIFIRM        QDA01
     C                   MOVEL     WSAVD         QDA02
     C                   MOVEL     WSOPD         QDA03
     C                   MOVEL     XNYGML        QDA04
     C                   MOVEL     KO2UTL        QDA05
     C                   MOVEL     XKUTL         QDA06
     C                   MOVEL     XSUTL         QDA07
     C                   MOVEL     XKUMIN        QDA08
     C                   MOVEL     XSUMIN        QDA09
     C                   MOVEL     KO2MVK        QDA10
     C                   MOVEL     KO2MVS        QDA11
     C                   MOVEL     UKFRA         QDA12
     C                   MOVEL     KOVAVR        QDA13
     C                   MOVEL     WSMSG         QDA14
     C                   MOVEL     WSMELD        QDA15
     C                   MOVEL     UFLAGG        QDA16
     C                   MOVEL     UKODE         QDA17
     C                   MOVEL     USECUR        QDA18
     C                   MOVEL     'SYFI10XQ'    QDTAQ            10
     C                   MOVEL     '*LIBL'       QLIB             10
     C                   Z-ADD     109           QRLEN             5 0
     C                   CALL      'QSNDDTAQ'
     C                   PARM                    QDTAQ
     C                   PARM                    QLIB
     C                   PARM                    QRLEN
     C                   PARM                    QDATA
     C     UTFAK         TAG
     C     UFLAGG        COMP      3                                      03
     C  N03UFLAGG        COMP      6                                      03
     C     UFLAGG        COMP      1                                      12
      *
     C                   ENDSR
      *
      ***********************************************
     C     SØKDTA        BEGSR
      ***********************************************
     C                   Z-ADD     1             UFLAGG
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
S02  C*                  EXSR      SØKKUN
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNA
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     6             POSNBR
N02  C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
E02  C  N34LINNBR        IFEQ      8
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
S02  C*                  EXSR      SØKKUN
N04  C                   MOVE      WSNAS         UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNS
N02  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAS
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
S02  C*                  EXSR      SØKKUN
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNSF
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     12            LINNBR
N02  C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
E02  C  N32LINNBR        IFEQ      12
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
S02  C*                  EXSR      SØKKUN
N04  C                   MOVE      WSNAK         UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNK
N02  C                   PARM                    FIFIRM
S04  C*                  PARM                    WSNAK
N04  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
S02  C*                  EXSR      SØKKUN
N02  C                   MOVE      *BLANKS       UKNAVN           30
N02  C                   CALL      'SOEKKUN'
N02  C                   PARM                    WSKNKF
N02  C                   PARM                    FIFIRM
N02  C                   PARM                    UKNAVN
N03  C                   EXSR      TESTKU
N02  C                   Z-ADD     17            LINNBR
N02  C                   Z-ADD     2             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     37
     C                   EXSR      SØKVAD
     C                   Z-ADD     17            LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      4
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     10
     C                   CALL      'SYFI10K'
     C                   PARM                    WSKNF
     C                   Z-ADD     5             LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     59
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDL
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     12
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDF
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     19            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     19
     C     POSNBR        ANDLE     23
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDT
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     30
     C     POSNBR        ANDLE     31
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WSLKA
     C                   PARM                    USPED
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALS
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     33
     C     POSNBR        ANDLE     35
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALK
     C                   Z-ADD     42            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      17
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     3
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT
     C                   Z-ADD     5             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      17
     C     POSNBR        ANDGE     5
     C     POSNBR        ANDLE     7
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR
     C                   PARM                    USPED
     C                   Z-ADD     9             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
      ***********************************************
     C     UTCMDL        BEGSR
      ***********************************************
     C     XCMD          IFEQ      0
     C                   MOVE      'DIV0032'     MSGLN1
     C                   MOVE      'DIV0033'     MSGLN2
     C                   MOVE      'DIV0024'     MSGLN3
     C                   MOVE      'DIV0029'     MSGLN4
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      1
     C                   MOVE      'DIV0037'     MSGLN1
     C  N31              MOVE      'DIV0038'     MSGLN2
     C   31              MOVE      'DIV0000'     MSGLN2
     C  N31              MOVE      'DIV0040'     MSGLN3
     C   31              MOVE      'SHU0127'     MSGLN3
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      2
     C  N31              MOVE      'DIV0020'     MSGLN1
     C  N31              MOVE      'DIV0030'     MSGLN2
     C  N31              MOVE      'DIV0853'     MSGLN3
     C   31              MOVE      'SHU0209'     MSGLN1
     C   31              MOVE      'DIV0000'     MSGLN2
     C   31              MOVE      'DIV0000'     MSGLN3
     C  N31              ADD       1             XCMD
     C   31              Z-ADD     0             XCMD
     C                   ELSE
     C     XCMD          IFEQ      3
     C                   MOVE      'DIV0039'     MSGLN1
     C                   MOVE      'DIV0041'     MSGLN2
     C                   MOVE      'DIV3572'     MSGLN3
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C                   MOVE      'SHU0127'     MSGLN1
     C                   MOVE      'SHU0209'     MSGLN2
     C                   MOVE      'BBA0151'     MSGLN3
     C                   Z-ADD     0             XCMD              1 0
     C                   END
     C                   END
     C                   END
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     DOKUFK        KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C                   MOVE      'F'           XDFSTA            1
     C                   MOVE      *BLANKS       XTRNV            30
     C                   MOVE      *BLANKS       WSGM1            15
     C                   MOVE      *BLANKS       WSGM2            15
     C                   MOVE      *ZEROS        W2TOLL            2 0
     C                   MOVE      ' '           W2KDME            1
     C                   MOVE      ' '           W2KDE             1
     C                   MOVE      '001'         XFBNR             3 0
     C     FIRAVD        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
      *
     C     HEADFK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     HEADKK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     FREETK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     SAMLAK        KLIST
     C                   KFLD                    YSDT
     C     KODTAK        KLIST
     C                   KFLD                    YAUNI
     C                   KFLD                    WSAVD
     C     KODTWK        KLIST
     C                   KFLD                    YWUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    YVUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    YSFUNI
     C                   KFLD                    WSSG
     C     KODTEK        KLIST
     C                   KFLD                    YTEUNI
     C                   KFLD                    WSSDL1
     C     KODOTK        KLIST
     C                   KFLD                    YOTUNI
     C                   KFLD                    WSOT
     C     KODO2K        KLIST
     C                   KFLD                    YO2UNI
     C                   KFLD                    WSOT
     C     KODLIK        KLIST
     C                   KFLD                    KLIUNI
     C                   KFLD                    KLIKOD
     C     KODFRK        KLIST
     C                   KFLD                    YFRUNI
     C                   KFLD                    WSFR
     C     KODFSK        KLIST
     C                   KFLD                    YFSUNI
     C                   KFLD                    WSKNF
     C     KODLKK        KLIST
     C                   KFLD                    YLKUNI
     C                   KFLD                    WSLKA
     C     KODVAK        KLIST
     C                   KFLD                    YVAUNI
     C                   KFLD                    KVAKOD
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'E'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    YVADRN
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     TELAWK        KLIST
     C                   KFLD                    AWUNI
     C                   KFLD                    KOWLAS
     C                   MOVE      'I'           AWUNI             1
     C     OTIKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    OTIKNR            8 0
     C                   KFLD                    OTIAVD            4 0
     C     FSOKEY        KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    USG               3
     C                   PARM                    UTYPE             3
      *** UKODE = 'O' KALLE FRA SYFF10CLO
      *** UKODE = 'S' KALLE FRA SYFF10CLS
      *** UKODE = 'K' KALLE FRA SYFF10CLK
      *** UKODE = 'A' KALLE FRA ?????????
     C                   PARM                    UKODE             1
     C                   PARM                    UAVDNY            4 0
      *** UENDRE = ' ' KALLE FRA SYIN10CL
     C                   CLEAR                   BILDE01
     C                   CLEAR                   BILDE02
     C                   CLEAR                   HEADFR
     C                   MOVE      *ZEROS        *IN
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C     UTYPE         IFEQ      'CHG'
     C     UTYPE         OREQ      'CHF'
     C     UTYPE         OREQ      'CHO'
     C                   MOVE      UOPD          WSOPD
     C                   ELSE
     C                   MOVE      '1'           *IN58
     C     UTYPE         IFEQ      'CPY'
     C                   MOVE      UAVD          HEAVD
     C                   MOVE      UOPD          HEOPD
     C                   MOVE      *ZEROS        UOPD
     C                   MOVE      UAVDNY        WSAVD
     C                   END
     C                   END
      *
     C     UKODE         IFEQ      'A'
     C                   SETON                                        3234
     C                   ELSE
     C     UKODE         COMP      'K'                                    32    KUN KJØPER
     C     UKODE         COMP      'S'                                    34    KUN SELGER
     C                   END
      *
     C     *LIKE         DEFINE    WSAVD         AVDZER
S02  C*                  Z-ADD     5             SOANTK            1 0
S02  C*                  MOVE      *BLANKS       SOTXT6            8
S02  C*                  MOVE      *BLANKS       SOTXT7            8
S02  C*                  MOVE      *BLANKS       SOTXT8            8
S02  C*                  MOVE      *ZEROS        SOKNR6            8 0
S02  C*                  MOVE      *ZEROS        SOKNR7            8 0
S02  C*                  MOVE      *ZEROS        SOKNR8            8 0
      *
     C                   MOVE      'J'           USØK              1
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      'W'           YWUNI             1
     C                   MOVE      'V'           YVUNI             1
     C                   MOVE      'SF'          YSFUNI            2
     C                   MOVE      'TERM'        YTEUNI            4
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      'O2Y'         YO2UNI            3
     C                   MOVE      'FR'          YFRUNI            2
     C                   MOVE      'FS'          YFSUNI            2
     C                   MOVE      'LK '         YLKUNI            3
     C                   MOVE      'LIKO'        KLIUNI
     C                   MOVE      'VA'          YVAUNI            2
     C                   MOVE      *ZEROS        YFXLNR            2 0
     C                   MOVE      '00001'       YVADRN            5 0
      *
     C                   MOVE      'DIV1064'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT1            8
     C                   MOVE      'DIV1060'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT2            8
     C                   MOVE      'DIV1061'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT3            8
     C                   MOVE      'DIV1062'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT4            8
     C                   MOVE      'DIV1063'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT5            8
     C                   MOVE      'DIV0608'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     62            XMSGL
     C                   MOVEL     XMSG          XMSG1            62
     C                   EXSR      HENTMS
     C                   MOVE      'DIV0611'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     62            XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          XMSG2            62
      *
     C                   MOVE      *BLANKS       FIFIRM
     C     FIFIRM        SETLL     FIRM                               33
     C                   READ      FIRM                                   33
     C                   Z-ADD     0             XCMD              1 0
     C                   EXSR      UTCMDL
      *
     C                   ENDSR
      *
      ***********************************************
     C     HENTMS        BEGSR
      ***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             62
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
      *
     C                   ENDSR
      *
      ***********************************************
     C     KDTFMT        BEGSR
      ***********************************************
     C                   MOVE      WSDTD         UDT1              2 0
     C                   MOVE      WSDTM         UDT2              2 0
     C                   MOVE      WSDTÅ         UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
      *
     C                   ENDSR
      *
      ***********************************************
     C     VISFRE        BEGSR
      ***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   ENDSR
      *
      ***********************************************
     C     FAX           BEGSR
      ***********************************************
     C                   MOVE      *ZEROS        FAXKUN            8 0
     C   21              MOVE      'M'           FAXTYP            1
     C   20              MOVE      'A'           FAXTYP
     C                   MOVE      ' '           FAXPAR            1
     C                   MOVE      ' '           FAXPA2            1
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
     C                   MOVE      WSKNA         FAXKUN
     C                   MOVE      'A'           FAXPAR
     C                   END
      *
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
     C                   MOVE      WSKNS         FAXKUN
     C                   MOVE      'S'           FAXPAR
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
     C                   MOVE      WSKNSF        FAXKUN
     C                   MOVE      'S'           FAXPAR
     C                   END
     C     LINNBR        IFEQ      9
     C     LINNBR        OREQ      10
     C                   MOVE      'S'           FAXPA2            1
     C                   END
      *
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
     C                   MOVE      WSKNK         FAXKUN
     C                   MOVE      'K'           FAXPAR
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     42
     C     POSNBR        ANDLE     49
     C                   MOVE      WSKNKF        FAXKUN
     C                   MOVE      'K'           FAXPAR
     C                   END
     C     LINNBR        IFEQ      13
     C     LINNBR        OREQ      14
     C                   MOVE      'K'           FAXPA2            1
     C                   END
     C   20FAXPAR        IFEQ      ' '
     C                   MOVE      'M'           FAXTYP
     C                   END
     C                   CALL      'FAX010CL'
     C                   PARM                    FAXKUN
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    FAXTYP
     C                   PARM                    FAXPAR
     C                   PARM                    FAXPA2
      * GI MELDING TIL BRUKER
     C     FAXTYP        IFEQ      'A'
     C                   SETON                                        30
     C                   MOVE      'SHU0242'     MSGNR
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      'STR'         TTACTI
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      UUSR          TTUSER
     C                   MOVEL     'Order en'    XXTEXT           16
     C                   MOVE      'tered   '    XXTEXT
     C                   MOVEL     XXTEXT        TTTEXT
N04  C                   eval      TTTEXL='Ordre opprettet'
     C                   WRITE     TRACKFR
      *
      * ETD/ATD - ETA/ATA - TIDSOPPFØLGING. (EGEN FIL TRACKT)
      * (KUNNE TENKES Å VÆRE KUNDESTYRT... RESERVERT KODE I CUOTI???)
     C                   CLEAR                   TRACKTR
     C                   MOVE      HEAVD         TXAVD
     C                   MOVE      HEOPD         TXOPD
     C                   MOVE      *ZEROS        TXETDD
     C                   MOVE      *ZEROS        TXETDK
     C                   MOVE      HEDTOP        TXETAD
     C                   MOVE      *ZEROS        TXETAK
     C                   WRITE     TRACKTR
     C                   ENDSR
     C***********************************************
     C     SFACT         BEGSR
     C***********************************************
     C                   MOVEL     WUSER         WWUSER           17
     C* Blanker hele parameterstrengen
     C                   MOVEL     *BLANKS       CUTINF
     C                   MOVEL     ' '           CUTTRM
     C                   MOVEL     'FACT'        CUTPID                         <ADRESSE
     C     3             SUBST     HEGN:5        WUTALN            3
     C                   MOVEL     WUTALN        CUTALN
     C     8             SUBST     HEGN:8        WUTAWB            8
     C                   MOVEL     WUTAWB        CUTAWB
     C                   MOVEL     WSSDF         CUTORI                         <ORIGIN AIRPORT
     C                   MOVEL     WSSDT         CUTDES                         <DEST. AIRPORT
     C                   Z-ADD     WSNT          CUTNPI                                     RT
     C                   Z-ADD     WSVKT         CUTWGH                                     RT
     C                   Z-ADD     WSM3          CUTVOL                                     RT
     C                   MOVEL     WSVS1         CUTCON
     C                   MOVEL     *BLANKS       CUTCAR
     C                   MOVEL     WSNAS         CUTPNA
     C                   MOVEL     WSADS1        CUTPAD
     C                   Z-ADD     1             XW                3 0
     C                   Z-ADD     0             MY                3 0
     C                   MOVEA     *BLANKS       WR3
     C                   MOVEA     *BLANKS       WR2
     C                   MOVEA     *BLANKS       WR1
     C                   MOVEA     WSADS3        WR3
     C     WR3(XW)       DOWNE     *BLANK
     C     XW            ANDLE     9
     C                   MOVE      WR3(XW)       WR1(XW)
     C                   ADD       1             XW
     C                   ENDDO
     C                   DO        17
     C                   ADD       1             XW
     C                   ADD       1             MY
     C                   MOVE      WR3(XW)       WR2(MY)
     C                   ENDDO
     C                   MOVEA     WR2           CUTPPL
     C                   MOVEA     WR1           CUTPCO
     C                   Z-ADD     1             XW                3 0
     C                   Z-ADD     0             MY                3 0
     C                   MOVEA     *BLANKS       WR3
     C                   MOVEA     *BLANKS       WR2
     C                   MOVEA     *BLANKS       WR1
     C                   MOVEA     WSADK3        WR3
     C     WR3(XW)       DOWNE     *BLANK
     C     XW            ANDLE     9
     C                   MOVE      WR3(XW)       WR1(XW)
     C                   ADD       1             XW
     C                   ENDDO
     C                   DO        17
     C                   ADD       1             XW
     C                   ADD       1             MY
     C                   MOVE      WR3(XW)       WR2(MY)
     C                   ENDDO
     C                   MOVEL     'P'           F5212
     C                   MOVEL     UDAY          F52141
     C                   Z-ADD     UMONTH        ZZ                2 0
     C                   MOVEA     NAV(ZZ)       F52142
     C                   MOVEL     *BLANKS       F52143
     C                   MOVEL     UDAY          F52161
     C                   MOVEL     NAV(ZZ)       F52162
     C                   MOVEL     *BLANKS       F52163
     C                   MOVEL     WSHAWB        F5218
     C                   MOVE      HEAVD         X52110            2
     C                   MOVEL     X52110        F52110
     C     F52110        CAT       '/':0         F52110
     C                   MOVE      HEOPD         F52110
     C                   MOVEL     'FF'          F52112
     C                   MOVEL     *BLANKS       F5321                          KONTAKT NAVN
     C                   MOVEL     *BLANKS       F5323                          KONTAKT NAVN
     C                   MOVEL     *BLANKS       F6231
     C                   MOVEL     *BLANKS       F6233
     C                   MOVEL     *BLANKS       F6235
      * DETTE ER KUNDENUMMER HOS FAKT.
      * LEGG INTILL VIDERE DETTE PROGRAMMET I SYENDRE
      * OG ENDRE NUMMER UTIFRA AVDELING.
     C                   MOVEL     '00000000'    F6236
     C                   MOVE      '00'          F6236
     C                   SELECT
     C     HEAVD         WHENEQ    0
     C                   MOVE      '00000000'    F6236
     C                   OTHER
      *                    MOVE '175'     F6236
     C                   MOVE      '00000000'    F6236
     C                   ENDSL
      *
     C                   MOVEL     HETLE         F6233
     C                   MOVE      HETLL         F6233
     C                   MOVEL     WRKSR1        CUTSR1
     C                   MOVEL     WRKSR2        CUTSR2
     C                   MOVEL     WRKOS1        CUTOS1
      * Kaller på program for å sende FACT booking.
     C                   CALL      'SM280C2'
     C                   PARM                    CUTINF
     C                   PARM                    CUTIN2
     C                   PARM                    WWUSER           17
     C                   PARM                    WWRECN            9 0
      *
      *
     C     SFAC99        TAG
      *
     C                   ENDSR
     C***********************************************
     C     MOVWDF        BEGSR
     C***********************************************
     C                   CLEAR                   DOKUFR
     C                   MOVE      ' '           DFST
     C                   MOVEL     KOVXXX        DFBELA
     C     DFBELA        IFEQ      ' '
     C     FILFB         IFEQ      'S'
     C     FILFB         OREQ      'M'
     C                   MOVE      FILFB         DFBELA
     C                   END
     C                   END
     C                   MOVE      KOAKNR        DFKNSS
     C                   MOVEL     WSNAS         DFFASE
     C     FIRAVD        CHAIN     CUNDL01                            34
     C     *IN34         IFEQ      '0'
     C                   MOVE      KNAVN         DFNAVS
     C                   MOVE      ADR1          DFAD1S
     C                   MOVE      *BLANKS       DFAD2S
     C                   MOVEL     ADR3          DFAD3S
     C                   MOVE      POSTNR        DFPNLS
     C                   END
     C                   MOVE      WSNT          DFNTLA
     C                   MOVE      W2TOLL        DFTOLL
     C                   MOVE      WSNAK         DFNAVL
     C                   MOVE      WSADK1        DFAD1L
     C                   MOVE      *BLANKS       DFAD2L
     C                   MOVEL     WSADK3        TMPPUL            4
     C                   TESTN                   TMPPUL               77
     C     *IN77         IFEQ      '1'
     C                   MOVE      TMPPUL        DFPOUL                          UTL.POSTNR
     C                   MOVE      WSADK3        TMPAD3           25
     C                   MOVEL     TMPAD3        DFADUL                          UTL.STED
     C                   ELSE
     C                   MOVEL     WSADK3        DFADUL
     C                   END
     C                   MOVEL     XTRNV         DFNAT
     C                   MOVE      W2KDE         DFKDE
     C                   MOVE      W2KDME        DFKDME
     C                   MOVE      WSKNK         DFKNSM
     C                   MOVE      WSNAK         DFNAVM
     C                   MOVE      WSADK1        DFAD1M
     C                   MOVE      WSADK3        DFAD3M
     C                   MOVEL     WSGM1         DFGM
     C                   MOVE      WSNT          DFNT
     C                   MOVE      WSVS1         DFVS
     C                   MOVE      WSVKT         DFVKT
     C                   MOVE      WSLM          DFLM
     C                   MOVE      WSM3          DFM3
     C                   MOVEL     WSGM2         DFGM2
     C                   MOVEL     WSVS2         DFVS2
     C                   MOVE      WSFBV         DFVKTF
     C                   MOVE      WSSG          DFSG
     C                   MOVE      'F'           DFRI
     C                   MOVE      WSAVD         DFAVD
     C                   MOVE      WSOPD         DFOPD
     C                   MOVE      XFBNR         DFFBNR
     C*
     C                   WRITE     DOKUFR
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     FRABR         BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   MOVE      *BLANKS       TEST              1
     C                   CALL      'SYFI10A'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XFBNR
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   PARM                    TEST
     C                   Z-ADD     1             XFBNR
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTKT        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        OTIKU1            8 0
     C                   MOVE      *ZEROS        OTIKU2            8 0
     C     WSKDFS        IFNE      'X'
     C                   MOVE      WSKNSF        OTIKU1
     C                   END
     C     WSKDFK        IFNE      'X'
     C     OTIKU1        IFEQ      *ZEROS
     C                   MOVE      WSKNKF        OTIKU1
     C                   ELSE
     C                   MOVE      WSKNKF        OTIKU2
     C                   END
     C                   END
     C                   ENDSR
     C*
      *
**    TABELL  (NAV)  ENDRING N09BB
JAN
FEB
MAR
APR
MAY
JUN
JUL
AUG
SEP
OCT
NOV
DEC
