      *
      ***************************************************************
      *** PROGRAMMET FINNER HØYESTE LØPENUMMER                    ***
      ***************************************************************
     FISOFL1    IF   E           K DISK
      *
     C     ISOKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    NUMM              4 0
      *
     C     ISOKEY        SETLL     ISOFR
     C     ISOKEY        READE     ISOFR                                  41
     C     *IN41         DOWEQ     '0'
     C                   Z-ADD     ISFLOP        TEST              4 0
     C     ISOKEY        READE     ISOFR                                  41
     C  N41              ENDDO
      *
     C     TEST          ADD       1             NUMM
      *
     C                   SETON                                        LR
     C                   RETURN
      *
