      *
      *************************************************************
      ***       SØKEPROGRAM KODEREGISTER                        ***
      ***             STATUS                                    ***
      *************************************************************
      *
     FISOKDS    IF   E           K DISK
     FSYIS17D   CF   E             WORKSTN
     F                                     SFILE(H50:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C                   EXSR      INIT
     C*
     C***************
     C* TØM SUBFILE
     C***************
     C     START         TAG
     C     *LOVAL        SETLL     ISKDSR
     C                   MOVE      '1'           *IN93
     C                   WRITE     K60
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C*************************
     C* Fyll subfile
     C*************************
     C*
     C     START1        TAG
     C                   DO        13
     C                   READ      ISKDSR                                 94
     C     *IN94         IFEQ      '0'
     C                   MOVEL     SKODE         SVKODE
     C                   MOVEL     STEXT         SVTEXT
     C                   ADD       1             ZRECNO
     C                   WRITE     H50
     C                   END                                                    <*IN94
     C  N94              ENDDO
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     3             POSNBR
      ****************************
      * Vis subfile
      ****************************
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   MOVE      '1'           *IN31
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     9             POSNBR
     C                   WRITE     B20
     C                   EXFMT     B40
     C                   READ      B20                                    66
     C                   ELSE
     C                   MOVE      '0'           *IN31
     C                   WRITE     K60
     C                   EXFMT     B40
     C                   READ      K60                                    66
     C                   END
     C*
     C     FKEYS         TAG
     C*
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C*
     C                   SETOFF                                       999830
     C*** F3=Exit
     C     *IN03         IFEQ      '1'
     C                   MOVE      *BLANKS       UKODE
     C                   MOVE      '03'          UFLG
     C                   GOTO      ENDPGM
     C                   END                                                    <*IN03
     C*** F5=Forny
     C     *IN05         IFEQ      '1'
     C                   GOTO      START
     C                   END                                                    <*IN05
     C*** Roll
     C     *IN25         IFEQ      '1'
     C                   Z-ADD     YRECNO        ZRECNO
     C                   MOVE      '0'           *IN25
     C     *IN94         IFEQ      '0'
     C                   GOTO      START1
     C                   END                                                    <*IN94
     C                   END                                                    <*IN25
     C*** Hent valg fra skjerm
     C     ZRECNO        IFNE      0
     C                   EXSR      GETOPT
     C*** Ingen valg foretatt
     C     *IN97         IFEQ      '1'
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   EXFMT     B40
     C                   READ      K60                                    66
     C                   MOVE      '0'           *IN97
     C                   GOTO      FKEYS
     C                   ELSE
     C     *IN03         IFEQ      '1'
     C                   MOVE      *BLANKS       UKODE
     C                   MOVE      '03'          UFLG
     C                   END                                                    <*IN03
     C                   GOTO      ENDPGM
     C                   END                                                    <*IN12
     C                   END                                                    <ZRECNO
      *
     C     *IN98         IFEQ      '1'
     C     XRECNO        ANDNE     0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END                                                    <*IN98
     C                   GOTO      START3
     C*
     C     ENDPGM        TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     GETOPT        BEGSR
     C                   Z-ADD     0             LINNBR
     C                   Z-ADD     0             OPTNBR            2 0
     C                   SETOFF                                       919299
     C                   MOVE      '1'           *IN97
     C     *IN98         DOWEQ     '0'
     C                   READC     H50                                    98
     C     *IN98         IFEQ      '1'
     C     *IN99         IFEQ      '1'
     C                   MOVE      '0'           *IN98
     C                   END                                                    <*IN99
     C                   GOTO      ENDGET
     C                   END                                                    <*IN98
     C                   MOVE      '0'           *IN97
     C*** 1=PLUKKE
     C     WSNR          IFEQ      '1'
     C                   ADD       1             OPTNBR
     C                   MOVE      ' '           WSNR
     C                   MOVEL     SVKODE        UKODE
     C                   GOTO      ENDGET
     C                   END                                                    <WSNR=2
      *
     C                   ENDDO
     C*
     C     ENDGET        TAG
     C                   EXSR      POSLIN
     C     OPTNBR        IFGT      *ZEROS
     C                   ADD       8             LINNBR
     C                   ELSE
     C                   ADD       9             LINNBR
     C                   END                                                    <OPTNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     POSLIN        BEGSR
     C*
     C     OPTNBR        IFGT      *ZERO
     C     ZRECNO        DIV       13            LINNBR
     C                   MVR                     XLIN              4 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     13            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END                                                    <XLIN
     C                   END                                                    <OPTNBR
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C*
     C     *LIKE         DEFINE    LINNBR        LINNBX
     C     *LIKE         DEFINE    POSNBR        POSNBX
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UKODE             1
     C                   PARM                    UFLG              2
     C*
     C                   ENDSR
     C*
