      *
      ***********************************************************
      *** SØKEPROGRAM FOR UNITTYPER                           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-04 06 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31-90 95-97 99             ***
      ***********************************************************
      *
     FUNITL02   IF   E           K DISK
     FSYIS14D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D*
     D* DS FOR POSISJONERING AV CURSOR
     D*
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  XNTXM                  1      3
     D  AL                     1      3
     D                                     DIM(3)
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     UNITKY        SETLL     UNITL02
     C     START1        TAG
     C                   READ      UNITL02                                94
     C  N94UNUNTY        COMP      XNTXM                              94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ      UNITL02                                94
     C  N94UNUNTY        COMP      XNTXM                              94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C*
     C                   SETOFF                                       9830
     C   12              GOTO      SLUTT
     C*** SØK
     C     *IN08         IFEQ      '1'
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     25            POSNBR
     C                   GOTO      START6
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
     C*
     C*** SØK FRA UNITTYPE
     C     START6        TAG
     C                   EXFMT     SØKOTY
     C   12              GOTO      START3
     C                   EXSR      FINMAX
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     FINMAX        BEGSR
     C***********************************************
     C                   MOVE      W2NTX         XNTXM
     C                   Z-ADD     3             XN                2 0
     C     STSMAX        TAG
     C     AL(XN)        IFEQ      ' '
     C                   MOVE      '9'           AL(XN)
     C                   SUB       1             XN
     C     XN            IFGE      1
     C                   GOTO      STSMAX
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      UNUNTY        UOTYK
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     UNITKY        KLIST
     C                   KFLD                    W2NTX
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UOTYK             4
     C*
     C                   EXFMT     SØKOTY
     C                   EXSR      FINMAX
     C*
     C                   ENDSR
     C*
