      *
      ***************************************************************
      *** UTSKRIFT AV RAPPORT VED REGISTRERING                    ***
      ***                                                         ***
      *** PROGRAMMERT AV TORE BRÅSTAD, SYSTEMA A/S, JANUAR 1994   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER        ***
      *** LEDIGE INDIKATORER 01-99                                ***
      ***************************************************************
      *
      * TOTAL OMSKREVET NÅR DET GJELDER DATO. INGEN MERKING.
     FISOFL1    IF   E           K DISK
     FISOFL8    IF   E           K DISK    RENAME(ISOFR:ISOFR8)
     FISOFWRK   IF   E           K DISK
     FISOKDA    IF   E           K DISK
     FISOKDT    IF   E           K DISK
     FISOKDP    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FHEADF     IF   E           K DISK
     FTRAN      IF   E           K DISK
     FSYIS20PF  O    E             PRINTER
      *
      * DS FOR DATOFORMATERING
      *
     D                 DS
     D  ISFADA                 1      8  0
     D  ISADAÅ                 1      4  0
     D  ISADAM                 5      6  0
     D  ISADAD                 7      8  0
     D                 DS
     D  PRTADA                 1      6  0
     D  PRADAD                 1      2  0
     D  PRADAM                 3      4  0
     D  PRADAÅ                 5      6  0
     D                 DS
     D  ISFAND                 1      8  0
     D  ISANDÅ                 1      4  0
     D  ISANDM                 5      6  0
     D  ISANDD                 7      8  0
     D                 DS
     D  PRTAND                 1      6  0
     D  PRANDD                 1      2  0
     D  PRANDM                 3      4  0
     D  PRANDÅ                 5      6  0
     D                 DS
     D  ISFMDA                 1      8  0
     D  ISMDAÅ                 1      4  0
     D  ISMDAM                 5      6  0
     D  ISMDAD                 7      8  0
     D                 DS
     D  PRTMDA                 1      6  0
     D  PRMDAD                 1      2  0
     D  PRMDAM                 3      4  0
     D  PRMDAÅ                 5      6  0
     D                 DS
     D  ISFLDA                 1      8  0
     D  ISLDAÅ                 1      4  0
     D  ISLDAM                 5      6  0
     D  ISLDAD                 7      8  0
     D                 DS
     D  PRTLDA                 1      6  0
     D  PRLDAD                 1      2  0
     D  PRLDAM                 3      4  0
     D  PRLDAÅ                 5      6  0
     D                 DS
     D  ISFGDA                 1      8  0
     D  ISGDAÅ                 1      4  0
     D  ISGDAM                 5      6  0
     D  ISGDAD                 7      8  0
     D                 DS
     D  PRTGDA                 1      6  0
     D  PRGDAD                 1      2  0
     D  PRGDAM                 3      4  0
     D  PRGDAÅ                 5      6  0
     D                 DS
     D  ISFRDA                 1      8  0
     D  ISRDAÅ                 1      4  0
     D  ISRDAM                 5      6  0
     D  ISRDAD                 7      8  0
     D                 DS
     D  PRTRDA                 1      6  0
     D  PRRDAD                 1      2  0
     D  PRRDAM                 3      4  0
     D  PRRDAÅ                 5      6  0
     D                 DS
     D  ISFFDA                 1      8  0
     D  ISFDAÅ                 1      4  0
     D  ISFDAM                 5      6  0
     D  ISFDAD                 7      8  0
     D                 DS
     D  PRTFDA                 1      6  0
     D  PRFDAD                 1      2  0
     D  PRFDAM                 3      4  0
     D  PRFDAÅ                 5      6  0
     D                 DS
     D  ISFUDA                 1      8  0
     D  ISUDAÅ                 1      4  0
     D  ISUDAM                 5      6  0
     D  ISUDAD                 7      8  0
     D                 DS
     D  PRTUDA                 1      6  0
     D  PRUDAD                 1      2  0
     D  PRUDAM                 3      4  0
     D  PRUDAÅ                 5      6  0
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
     C                   PARM                    ULOP              3
     C                   PARM                    USAKN             7
      *
     C                   READ      FIRMR                                  20
      *
     C     LESKEY        KLIST
     C                   KFLD                    WSAVD             4 0
     C                   KFLD                    WSOPD             7 0
     C                   KFLD                    WSLOP             3 0
      *
     C     KUNKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    ISFOPG
     C*
     C     HEDKEY        KLIST
     C                   KFLD                    ISFAVD
     C                   KFLD                    ISFOPD
     C*
     C     TRNKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    ISFTRF
      *
     C     ISOKDAK1      KLIST
     C                   KFLD                    ISFPFO
     C                   KFLD                    ISFAVA
     C     ISOKDAK2      KLIST
     C                   KFLD                    X_ISFPFO          5
     C                   KFLD                    ISFAVA
     C*
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      UOPD          WSOPD
     C                   MOVE      ULOP          WSLOP
     C                   MOVE      USAKN         WSSAKN            7 0
     C*
     C     *LOVAL        SETLL     ISOFWRK
     C                   READ      ISOFWRK                                10
     C   10              IF        WSAVD = 0
     C     WSSAKN        CHAIN     ISOFL8                             10
     C                   ELSE
     C     LESKEY        CHAIN     ISOFL1                             10
     C                   END
     C*
     c     *in(10)       ifeq      '0'
     C                   EXSR      FORMAT
     C                   WRITE     RPT1
     c                   end
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***************************************************************
     C*
     C     FORMAT        BEGSR
     C*
     C     ISFPFO        IFEQ      *BLANKS
     C                   MOVEL     'EGEN'        PRTPFT
     C                   ELSE
     C     ISFPFO        CHAIN     ISKDTR                             11
     C                   MOVEL     TTEXT         PRTPFT
     C                   END
     C*    ISFAVA        CHAIN     ISKDAR                             11
     C     ISOKDAK1      CHAIN     ISKDAR                             11
     C   11ISOKDAK2      CHAIN     ISKDAR                             11
     C                   MOVEL     ATEXT         PRTAVT
     C     ISFANS        CHAIN     ISKDPR                             11
     C                   MOVEL     PTEXT         PRTANT
     C*
     C     ISFOPG        IFNE      0
     C     KUNKEY        CHAIN     KUNDR                              12
     C                   Z-ADD     ISFOPG        PRTOPN
     C                   MOVEL     KNAVN         PRTOPT
     C                   END
     C*
     C     TRNKEY        CHAIN     TRANR                              13
     C                   Z-ADD     ISFTRF        PRTTRN
     C                   MOVEL     VMNAVN        PRTTRF
     C     KUTRAK        KLIST
     C                   KFLD                    VMFIRM
     C                   KFLD                    VMTRKU
     C     KUTRAK        CHAIN     CUNDL01                            14
     C                   MOVE      ADR1          PRTTA1
     C     POSTNR        IFNE      *ZEROS
     C                   MOVEL     POSTNR        PRTTA3           30
     C                   MOVE      ADR3          PRTTA3
     C                   MOVEL     PRTTA3        PRTTA2
     C                   ELSE
     C                   MOVEL     SYPOGE        PRTTA2
     C                   MOVE      ADR3          PRTTA2
     C                   END
     C*
     C     HEDKEY        CHAIN     HEADFR                             14
     C                   MOVEL     HENAS         PRTAS1
     C                   MOVEL     HEADS3        PRTAS2
     C                   MOVEL     HENAK         PRTMO1
     C                   MOVEL     HEADK3        PRTMO2
     C                   MOVEL     HEVS1         PRTGDS
     C                   Z-ADD     HENT          PRTGKL
     C                   Z-ADD     HEVKT         PRTGKG
     C                   Z-ADD     HELM          PRTGLM
     C                   Z-ADD     HEM3          PRTGM3
     C*
     C                   Z-ADD     ISSAKN        PRTSAK
     C                   Z-ADD     ISFAVD        PRTAVD
     C                   Z-ADD     ISFOPD        PRTOPD
     C                   Z-ADD     ISFTUN        PRTTUN
     C                   MOVEL     ISFBIL        PRTBIL
     C                   MOVEL     ISFHEN        PRTHEN
     C                   MOVEL     ISFS1T        PRTS1T
     C                   MOVE      ISADAD        PRADAD
     C                   MOVE      ISADAM        PRADAM
     C                   MOVE      ISADAÅ        PRADAÅ
     C                   Z-ADD     ISFADK        PRTADK
     C                   MOVE      ISANDD        PRANDD
     C                   MOVE      ISANDM        PRANDM
     C                   MOVE      ISANDÅ        PRANDÅ
     C                   Z-ADD     ISFANK        PRTANK
     C                   Z-ADD     ISFSKL        PRTSKL
     C                   Z-ADD     ISFSKG        PRTSKG
     C                   Z-ADD     ISFSLM        PRTSLM
     C                   Z-ADD     ISFSM3        PRTSM3
     C                   MOVE      ISMDAD        PRMDAD
     C                   MOVE      ISMDAM        PRMDAM
     C                   MOVE      ISMDAÅ        PRMDAÅ
     C                   Z-ADD     ISFMKL        PRTMKL
     C                   MOVE      ISLDAD        PRLDAD
     C                   MOVE      ISLDAM        PRLDAM
     C                   MOVE      ISLDAÅ        PRLDAÅ
     C                   Z-ADD     ISFLKL        PRTLKL
     C                   MOVEL     ISFAV1        PRTAV1
     C                   MOVEL     ISFAV2        PRTAV2
     C                   MOVEL     ISFAV3        PRTAV3
     C                   MOVEL     ISFKO1        PRTKO1
     C                   MOVEL     ISFKO2        PRTKO2
     C                   MOVEL     ISFKO3        PRTKO3
     C                   MOVEL     ISFKO4        PRTKO4
     C                   MOVE      ISRDAD        PRRDAD
     C                   MOVE      ISRDAM        PRRDAM
     C                   MOVE      ISRDAÅ        PRRDAÅ
     C                   MOVEL     ISFRSI        PRTRSI
     C                   MOVE      ISGDAD        PRGDAD
     C                   MOVE      ISGDAM        PRGDAM
     C                   MOVE      ISGDAÅ        PRGDAÅ
     C                   MOVEL     ISFGSI        PRTGSI
     C                   MOVE      ISFDAD        PRFDAD
     C                   MOVE      ISFDAM        PRFDAM
     C                   MOVE      ISFDAÅ        PRFDAÅ
     C                   MOVEL     ISFFSI        PRTFSI
     C                   MOVE      ISUDAD        PRUDAD
     C                   MOVE      ISUDAM        PRUDAM
     C                   MOVE      ISUDAÅ        PRUDAÅ
     C                   MOVEL     ISFUSI        PRTUSI
     C                   Z-ADD     ISKRAV        PRTKRA
     C                   Z-ADD     ISFORV        PRTFOR
     C                   Z-ADD     ISFKOS        PRTKOS
     C*
     C                   ENDSR
