      * FJERNE ALLE LINJER TYPE *AVR*....
     FFAKT      UP   E           K DISK
     C*
     C                   MOVEL     FAVT          TSTVT             5
     C     FAKDA         IFEQ      'K'
     C     TSTVT         IFEQ      '*AVR*'
     C     TSTVT         OREQ      '*AVF*'
     C     TSTVT         OREQ      '*AGD*'
     C     TSTVT         OREQ      '*AGF*'
     C     TSTVT         OREQ      'AVREG'
     C                   DELETE    FAKTR
     C                   END
     C                   END
     C*
