      *
      *****************************************************************
      *** PROGRAM SKAL SLETTE BILAG FRA OG TIL ET NUMMER            ***
      *****************************************************************
     FKOSTA     UF   E           K DISK
     F                                     RENAME(KOSTAR:KOSTA2)
     FKOSTA14   UF   E           K DISK
     FKOSTB     UF   E           K DISK
     FFRISKK    UF   E           K DISK
     FSYKSDEFM  CF   E             WORKSTN
     D                 DS
     D  TILDAT                 1      6  0
     D  TILDAG                 1      2  0
     D  TILMND                 3      4  0
     D  TILAAR                 5      6  0
     D                 DS
     D  TILDA2                 1      8  0
     D  KEYAAR                 1      4  0
     D  KEYMND                 5      6  0
     D  KEYDAG                 7      8  0
     C*
     C                   EXSR      INIT
     C     START         TAG
     C                   EXFMT     VARELI
     C     TILDAT        IFEQ      0
     C                   MOVE      *ZEROS        TILDA2
     C                   ELSE
     C                   MOVE      TILDAG        KEYDAG
     C                   MOVE      TILMND        KEYMND
     C     TILAAR        IFGT      50
     C     TILAAR        ADD       1900          KEYAAR
     C                   ELSE
     C     TILAAR        ADD       2000          KEYAAR
     C                   END
     C                   END
      *
     C  N03
     CANN05              GOTO      START
      *
     C  N03FRABIL        IFGT      TILBIL
     C                   GOTO      START
     C                   END
      *
     C  N03FRABIL        IFEQ      0
     C     TILDAT        ANDEQ     0
     C                   GOTO      START
     C                   END
      *
     C   03              MOVE      'N'           REORG             1
     C   03              GOTO      SLUTT
      *
     C     TILDAT        IFNE      *ZEROS
     C                   EXSR      REOSR2
     C                   GOTO      SLUTT
     C                   END
      *
      * REORGANISERER PÅ FRA TIL BILLAG
      *
     C                   EXSR      REOSR
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    REORG
      *
     C     FRAKEY        KLIST
     C                   KFLD                    FRABIL
     C     KEYB          KLIST
     C                   KFLD                    KABNR
     C                   MOVE      'J'           REORG             1
     C                   MOVE      *ZEROS        TILDAT
     C                   MOVE      *ZEROS        TILDA2
     C                   ENDSR
      ***********************************************
     C     REOSR         BEGSR
      ***********************************************
      *
     C     FRAKEY        SETLL     KOSTA14
     C     ST1           TAG
     C                   MOVEA     '000'         *IN(33)
     C     *IN33         DOWEQ     '0'
     C                   READ      KOSTA14                                33
     C  N33KABNR2        COMP      TILBIL                             33
     C   33              GOTO      UTSR
     C                   EXCEPT    DELA
      *
     C                   EXSR      DEL2
     C                   END
     C     UTSR          ENDSR
      ***********************************************
     C     REOSR2        BEGSR
      ***********************************************
      *
     C     *LOVAL        SETLL     KOSTA
     C                   MOVEA     '000'         *IN(33)
     C     *IN33         DOWEQ     '0'
     C     LESN          TAG
     C                   READ      KOSTA                                  33
     C  N33KABDT         IFGT      TILDA2
     C                   GOTO      LESN
     C                   END
     C   33              GOTO      UTSR2
     C                   EXCEPT    DELA2
     C                   EXSR      DEL2
     C                   END
     C     UTSR2         ENDSR
      ***********************************************
     C     DEL2          BEGSR
      ***********************************************
      *
      * VARELINJER
     C     KEYB          SETLL     KOSTB
     C     *IN34         DOWEQ     '0'
     C     KEYB          READE     KOSTB                                  34
     C  N34              EXCEPT    DELB
     C                   END
      * FRITEKSTER
     C     KEYB          SETLL     FRISKK
     C     *IN35         DOWEQ     '0'
     C     KEYB          READE     FRISKK                                 35
     C  N35              EXCEPT    DELF
     C                   END
     C                   ENDSR
     OKOSTAR    EDEL         DELA
     OKOSTA2    EDEL         DELA2
     OKOSTBR    EDEL         DELB
     OFRISKKR   EDEL         DELF
