      *
      ****************************************************************
      *** vise inntekter kodtnader dupp                            ***
      ****************************************************************
      *
     FHEAD11    IF   E           K DISK
     FFAKT      IF   E           K DISK
     C*
     C                   EXSR      INIT
     C*
     C                   EXSR      SUMFAK
      *
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *ENTRY        plist
     c                   parm                    faavd
     c                   parm                    faopd
     c                   parm                    wsinnt
     c                   parm                    wskost
     c                   move      *zeros        wsinnt            7 0
     c                   move      *zeros        wskost            7 0
     C     FAKEY         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C*
     C                   ENDSR
     C***********************************************
     C     SUMFAK        BEGSR
     C***********************************************
     C                   SETOFF                                       34
     C     FAKEY         SETLL     FAKT
     C     *IN34         DOWEQ     '0'
     C     FAKEY         READE     FAKT                                   34
     C     *IN34         IFEQ      '0'
      *
     C     FAOPKO        IFNE      'D'
     C     FASK          IFEQ      'S'
     C     FASK          OREQ      'K'
     C     FASK          OREQ      'X'
     C     FASK          OREQ      'I'
      *
     C     FAKDA         IFEQ      'K'
     C                   ADD       FABELN        WSKOST
     C                   ELSE
     C                   ADD       FABELN        WSINNT
     C                   END
     C                   END
     C                   END
      *
     C                   END
     C                   END
     C                   ENDSR
