      *
      ************************************************************
      *** PROGRAM LISTER BILAG FOR BRUKER MED GITT STATUS      ***
      ************************************************************
      *
     FSYKS62FM  CF   E             WORKSTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    BRUKER           10
     C*
     C                   Z-ADD     0             WSFDTO            6 0
     C                   Z-ADD     0             WSFTID            4 0
     C                   Z-ADD     0             WSTDTO            6 0
     C                   Z-ADD     0             WSTTID            4 0
     C                   MOVE      BRUKER        WSUSER
     C                   MOVE      'G'           WSSTAT
     C                   MOVE      'N'           WSA4
     C                   MOVEL     '*JOB'        WSPRIN
     C*
     C                   EXFMT     VARELI
     C*
     C     *IN12         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   ELSE
     C                   MOVE      WSFDTO        UUFDTO            6
     C                   MOVE      WSFTID        UUFTID            4
     C                   MOVE      WSTDTO        UUTDTO            6
     C                   MOVE      WSTTID        UUTTID            4
     C                   CALL      'SYKS62C2'
     C                   PARM                    WSUSER
     C                   PARM                    WSSTAT
     C                   PARM                    UUFDTO
     C                   PARM                    UUFTID
     C                   PARM                    UUTDTO
     C                   PARM                    UUTTID
     C                   PARM                    WSPRIN
     C                   PARM                    WSA4
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
