      ***************************************************************
      * LEGGER TOTAL F.BER.VEKT/FORV.KOST  FOR EN TUR UT I WORKFILE
      * FOR LETTER Å FINNE ET OPPDRAGS ANDEL AV DEN
      ***************************************************************
     FHEAD11    IF   E           K DISK
     FSYKS30X   O  A E             DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    XTUR
     C                   PARM                    XBEL
     C                   PARM                    XBP
      *
     C     XTUR          SETLL     HEAD11
     C     XTUR          READE     HEAD11                                 33
     C     *IN33         DOWEQ     '0'
     C     HEFBV         IFEQ      *ZEROS
     C                   Z-ADD     HEVKT         HEFBV
     C                   END
     C     HEFBV         IFEQ      *ZEROS
     C                   Z-ADD     1             HEFBV
     C                   END
     C                   ADD       HEFBV         XVKT
     C     XTUR          READE     HEAD11                                 33
     C                   END
      *
      * TOTALPOST  -
     C                   WRITE     SYKS30XR
      *
     C                   SETON                                        LR
     C                   RETURN
