      *********************************************************************
      * ARBEID MED PLUKKLISTE (HEADING)
      * PROGRAM BEHANDLER INPUT FRA SYL002 OG VISER UTVALGT HEADLING
      *
CRTPG+*  CRTPGM SYSPED/SYL003 MODULE(*LIBL/SYL003 *LIBL/SYL003B
CRTPGM*        *LIBL/CHECKUSR *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      * Boats for sale data base file (LF on BOATSALE by boat serial number)
     FBRIDF     UF   E           K DISK    USROPN
     FFIRM      IF   E           K DISK    USROPN
     FLLHEAD    UF A E           K DISK    USROPN
     FLLTELL    UF   E             DISK    USROPN
     FLLLINE    IF   E           K DISK    USROPN
     FLLLSDF    IF   E           K DISK    USROPN
     FLLVMLS    UF A E           K DISK    USROPN
     FTRAN      IF   E           K DISK    USROPN
     FVADR      IF   E           K DISK    USROPN
     FKUNKO1    IF   E           K DISK    USROPN
     F                                     RENAME(KUNKOR:KUNKOR1)
     FKUNKO2    IF   E           K DISK    USROPN
     FCUNDL01   IF   E           K DISK    USROPN
     FBRPARF    IF   E           k disk    usropn
      *--------------------------------------------------------------------
      * Prototype definitions and standard system API error structure
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      * Variables common to CGI programs
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * VARIABLES SPECIFIC TO THIS PROGRAM
      *--------------------------------------------------------------------
      * Variables received from the input string
     D lng             s              2
     D BckGnd          s             10
     D UsrSpcName      s             10
     D WSUSER          S             10
     D KUNDEREF1       S             50
     D KUNDEREF2       S             50
     D KUNDEREF3       S             50
     D XVMDEFAULT      S             17
      * Variables used to load the external html source member
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
     D PGM             C                   CONST('SYSPED/CHECKUSR')
N01  D PGM2            C                   CONST('SYSPED/SYL003B')
      *
     D TB              S              1    DIM(10)
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
     D FEILMELDING     S             80

     D WSMN            S              7
     D WSPNR           S              8
     D WSPNA           S             30
     D WSBNR           S             17
     D WSBNA           S             30
     D WSBA1           S             30
     D WSBA2           S             30
     D WSBPN           S              4
     D WSBA3           S             24
     D WSBLK           S              2
     D WSBPU           S              9
     D WSTDT           S             10
     D WSTN            S              8
     D WSLSD           S              5
     D WSPAK           S             17
     D WSORDR          S             17
     D WSFLN           S             17
     D BWSMN           S              7  0
     D BWSPNR          S              8  0
     D BWSBPN          S              4  0
     D BWSTN           S              8  0
     D RecordCnt       s              5S 0
     D lstbrd          s              1
     D                 DS
     D BWSTDT                  1      8  0
     D BWSTDTÅ                 1      4  0
     D BWSTDTM                 5      6  0
     D BWSTDTD                 7      8  0
     D                 DS
     D VADRN3                  1     30
     D VXPNR                   1      4
     D VXBLAN                  5      5
     D VXSTED                  6     30
     D                 DS
     D XXREF                   1    105
     D XXVN                    1      3
     D XXMN                    4     10
     D XXPNR                  11     18
     D XXPNA                  19     48
     D XXBNR                  49     65
     D XXBNA                  66     95
     D XXUSER                 96    105
     D                 DS
     D  POSTNR                 1      4  0
     D  POSTNRA                1      4
      *
     D TXT01           C                   CONST('Ok uten antall=se artikkel-
     D                                     -info.')
     D TXTEN01         C                   CONST('Ok with no pieces=view art-
     D                                     icle details.')
     D FEIL01          C                   CONST('Varemottaker må oppgis.')
     D FEILEN01        C                   CONST('Goods receiver missing.')
     D FEIL02          C                   CONST('Transportdato er ugyldig-
     D                                     (format ÅÅÅÅMMDD).')
     D FEILEN02        C                   CONST('Transport date is not valid -
     D                                     (format YYYYMMDD).')
     D FEIL03          C                   CONST('Oppgitt transpørt finnes-
     D                                      ikke.')
     D FEILEN03        C                   CONST('Given carrier is not valid.')
     D FEIL04          C                   CONST('Kunderef. 1 er ikke oppg-
     D                                     itt.')
     D FEILEN04        C                   CONST('Clintsref. 1 is not given.')
     D FEIL05          C                   CONST('Varemottakersnr er ugyldig.')
     D FEILEN05        C                   CONST('Number of goods receiver is -
     D                                     not valid.')
      *
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================
      * MAIN PROCESSING LINE
      *=====================================================================
      * Parse input string
     C                   exsr      Parse
     C                   EXSR      INIT
     C                   CALLB     PGM
     C                   PARM                    BIBRID
     C                   PARM                    UsrSpcName
     C                   PARM                    UINN              1
     C                   IF        UINN = 'N'
     C                   GOTO      SLUTT
     C                   END
     C     WSUSER        CHAIN     BRIDF                              50
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           BIDTF
     C                   MOVE      WTM           BITIDF
     C                   UPDATE    BRIDFR
      *
     C                   IF        BWSMN <> 0
     C     LH00K         CHAIN(N)  LLHEAD                             60
     C     *IN60         CABEQ     *ON           SLUTT
     C     LHPNR         CABNE     BIKUNR        SLUTT
     C     LHOPR         CABNE     'W'           SLUTT
     C     LHSTA         CABNE     'W'           SLUTT
     C                   IF        ((XBNR <> *BLANKS) AND (XBNR <> LHBNR))
     C                   GOTO      SLUTT
     C                   END
     C                   END
      * TEST INNGÅENDE DATA
     C                   EXSR      TESTB
      * Set output skeleton html member name
     C     FEILMELDING   IFEQ      *BLANKS
     C                   EXSR      NOERROR
     C                   ELSE
     C                   EXSR      ERROR
     C                   END
      * Send output buffer and quit
     C     SLUTT         TAG
     C                   exsr      Exit
      *=====================================================================
      * Send output buffer and quit
      *=====================================================================
     C     Exit          begsr
      * Compute and display run time
     C                   time                    timedata2
     C     timedata2     subdur    timedata1     ms:*ms
     C                   eval      sec = ms / 1000000
     C                   callp     updhtmlvar('runtime':
     C                             %trim(%editw(sec:'     0 .   ')))
     C                   callp     wrtsection('endhtml')
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      *
     C                   close     FIRM
     C                   close     LLHEAD
     C                   close     LLLINE
     C                   close     LLTELL
     C                   close     LLLSDF
     C                   close     LLVMLS
     C                   close     TRAN
     C                   close     VADR
     C                   close     KUNKO1
     C                   close     KUNKO2
     C                   close     CUNDL01
     C                   close     BRPARF
     C                   eval      *inlr = *on
      *
     C                   return
     C                   endsr
      *=====================================================================
      * Parse input string
      *=====================================================================
     C     Parse         begsr
     C                   eval      lng     = zhbgetvar('lng')
     C                   eval      BckGnd  = zhbgetvar('bckgnd')

     C                   eval      WSUSER  = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   eval      WSMN    = zhbgetvar('LHMN')
     C                   eval      BWSMN   = c2n2(WSMN)
     C                   MOVE      *ZEROS        BWSPNR
     C                   eval      WSPNR   = zhbgetvar('LHPNR')
     C                   eval      BWSPNR  = c2n2(WSPNR)
     C                   eval      WSPNA   = zhbgetvar('KNAVN')
     C                   eval      WSPNA   = uppify(WSPNA)
     C                   eval      WSBNR   = zhbgetvar('WSBNR')
     C                   eval      WSBNR   = uppify(WSBNR)
     C                   eval      WSBNA   = zhbgetvar('WSBNA')
     C                   eval      WSBNA   = uppify(WSBNA)
     C                   eval      WSBA1   = zhbgetvar('WSBA1')
     C                   eval      WSBA1   = uppify(WSBA1)
     C                   eval      WSBA2   = zhbgetvar('WSBA2')
     C                   eval      WSBA2   = uppify(WSBA2)
     C                   eval      WSBPN   = zhbgetvar('WSBPN')
     C                   MOVEA     WSBPN         TB
     C     1             DO        4             XN                3 0
     C     TB(XN)        IFLT      '0'
     C     TB(XN)        ORGT      '9'
     C                   GOTO      PARSE01
     C                   ENDIF
     C                   ENDDO
     C                   MOVE      WSBPN         BWSBPN
     C     PARSE01       TAG
     C                   eval      WSBA3   = zhbgetvar('WSBA3')
     C                   eval      WSBA3   = uppify(WSBA3)
     C                   eval      WSBLK   = zhbgetvar('WSBLK')
     C                   eval      WSBLK   = uppify(WSBLK)
     C                   eval      WSBPU   = zhbgetvar('WSBPU')
     C                   eval      WSBPU   = uppify(WSBPU)
     C                   eval      WSPAK   = zhbgetvar('WSPAK')
     C                   eval      WSPAK   = uppify(WSPAK)
     C                   eval      WSORDR  = zhbgetvar('WSORDR')
     C                   eval      WSORDR  = uppify(WSORDR)
     C                   eval      WSFLN   = zhbgetvar('WSFLN')
     C                   eval      WSFLN   = uppify(WSFLN)
     C                   eval      WSTDT   = zhbgetvar('WSTDT')
     C                   eval      BWSTDT  = c2n2(WSTDT)
     C                   eval      WSTN    = zhbgetvar('WSTN')
     C                   eval      BWSTN   = c2n2(WSTN)
     C                   eval      WSLSD   = zhbgetvar('WSLSD')

     C                   endsr
      *=====================================================================
      * INGEN FEIL
      *=====================================================================
     C     NOERROR       begsr
     C                   EXSR      OPDHEADING
N01   *
N01  C                   CALLB     PGM2
N01  C                   PARM                    BWSMN
N01  C                   PARM                    WSUSER
N01  C                   PARM                    UsrSpcName
N01  C                   PARM                    BIFIRM
N01  C                   PARM                    BIFARG
N01  C                   PARM                    WSANR            15
N01  C                   PARM                    WSVB             35
N01  C                   PARM                    WSSALD            7
N01  C                   PARM                    WSWNT0            7
N01  C                   PARM                    FMELDNR           1
N01  C                   PARM                    FEILMELDING      80
N01  C                   GOTO      ENDHTML
      *
     C                   exsr      SetSkl
      * Read skeleton output html into core
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      * Retrieve environment variables
     C                   exsr      RtvEnvVar
      *
      * Issue html section /$top
     C                   exsr      SetTop
     C                   callp     wrtsection('top')
      *------------------                                                   ******
      * Find number of Recds matching selection criteria
     C                   exsr      Recdsnumb
      *------------------                                                   ******
      * Write HTML sections
      *
      * 2-Section /$howmany
     C                   exsr      SetHowMany
     C                   callp     wrtsection('howmany')
      * 2a-Section /$0found
     C     RecordCnt     ifeq      0
     C                   MOVE      *ZEROS        XXVN
     C                   MOVE      BWSMN         XXMN
     C                   MOVE      LHPNR         XXPNR
     C                   MOVE      WSPNA         XXPNA
     C                   MOVE      WSBNR         XXBNR
     C                   MOVE      WSBNA         XXBNA
     C                   MOVE      WSUSER        XXUSER
BODY C                   callp     updhtmlvar('BODYCLASS':'class='+BIFARG)
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('XXREF':XXREF)
     C                   callp     wrtsection('0found')
     C                   goto      endhtml
     C                   endif
      * 3-Section /$tablestr
     C                   exsr      SetTabStr
     C                   callp     wrtsection('tablestr')
     C     LL01K         SETLL     LLLINE
     C*    LL01K         READE     LLLINE                                 50
     C     BWSMN         READPE    LLLINE                                 50
     C     *in50         doweq     '0'
     C                   exsr      SetTabRow
     C                   callp     wrtsection('tablerow')
     C*    LL01K         READE     LLLINE                                 50
     C     BWSMN         READPE    LLLINE                                 50
     C  N50              ENDDO                                                  *hival
      *
      * 5-Section /$tableend
     C                   callp     wrtsection('tableend')
      * 5a-Section /$foundsome
     C     RecordCnt     ifgt      0
     C                   exsr      SetFndSome
     C                   callp     wrtsection('foundsome')
     C                   endif
      * 6-Section /$endhtml
     C     endhtml       tag
     C                   exsr      SetEnd
      *
     C                   endsr
      *=====================================================================
      * Set html output skeleton TIL LINJE
      *=====================================================================
     C     SetSkl        begsr
     C                   eval      lng = uppify(lng)
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC' + lng
     C                   eval      Mbr = 'SYL004'
     C                   CAT       XSPRÅK:0      MBR
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$top
      *  (search criteria)
      *=====================================================================******
     C     SetTop        begsr
      * Repeat national language for the next invocation
     C                   callp     updhtmlvar('LNG':lng:
     C                             InitHTMLVars)
      * Repeat background color for the next invocation
     C                   callp     updhtmlvar('TXTCOLOR':'black')
     C                   callp     updhtmlvar('BOLD':' ')
     C                   callp     updhtmlvar('BGCOLOR':BIFARG)
     C                   callp     updhtmlvar('LINK':'0000FF')
     C                   callp     updhtmlvar('VLINK':'FF0000')
     C                   callp     updhtmlvar('ALINK':'00FF00')
     C                   callp     updhtmlvar('KUNDEREF1':KUNDEREF1)
     C                   callp     updhtmlvar('KUNDEREF2':KUNDEREF2)
     C                   callp     updhtmlvar('KUNDEREF3':KUNDEREF3)
      * KUNDE
     C                   callp     updhtmlvar('LHPNR':
     C                             %trim(%editc(BWSPNR:'Z')))
     C                   callp     updhtmlvar('KNAVN':WSPNA)
      * MOTTAKER
     C                   callp     updhtmlvar('WSBNR':WSBNR)
     C                   callp     updhtmlvar('WSBNA':WSBNA)
      * KUNDEREF.
     C                   callp     updhtmlvar('WSPAK':WSPAK)
      * ANDRE
     C                   MOVE      *ZEROS        XXVN
     C                   MOVE      BWSMN         XXMN
     C                   MOVE      LHPNR         XXPNR
     C                   MOVE      WSPNA         XXPNA
     C                   MOVE      WSBNR         XXBNR
     C                   MOVE      WSBNA         XXBNA
     C                   MOVE      WSUSER        XXUSER
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('WSGRP':
     C                             %trim(%editc(LHGRP:'Z')))
     C                   callp     updhtmlvar('WSPNR':
     C                             %trim(%editc(LHPNR:'Z')))
     C                   callp     updhtmlvar('WSPNR':
     C                             %trim(%editc(LHPNR:'Z')))
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('XXREF':XXREF)
     C                   callp     updHtmlVar('WSANR':'')
     C                   IF        XSPRÅK = 'EN'
     C                   callp     updHtmlVar('WSVB':TXTEN01)
     C                   ELSE
     C                   callp     updHtmlVar('WSVB':TXT01)
     C                   END
     C                   callp     updhtmlvar('WSWNT0':'')
     C                   callp     updhtmlvar('FMELDNR':'')
     C                   callp     updhtmlvar('FEILMELDING':'')
      *
     C                   endsr
      *=====================================================================******
     C*  Find number of Recds matching search criteria
      *=====================================================================******
     C     Recdsnumb     begsr
     C                   eval      RecordCnt = 0
     C     LL01K         SETLL     LLLINE
     C     BWSMN         READPE    LLLINE                                 50
     C     *in50         DoWeq     '0'
     C                   eval      RecordCnt = RecordCnt + 1
     C     BWSMN         READPE    LLLINE                                 50
     C                   enddo                                                  *hival
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$howmany
      *=====================================================================******
     C     SetHowMany    begsr
     C* Overall Recds count
     C     RecordCnt     ifgt      0
     C                   callp     updhtmlvar('RecordCnt':
     C                             %trim(%editw(RecordCnt:'   0 ')))
     C                   else
     C                   IF        XSPRÅK = 'EN'
     C                   callp     updhtmlvar('RecordCnt':'No')
     C                   ELSE
     C                   callp     updhtmlvar('RecordCnt':'Ingen')
     C                   END
     C                   endif
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$tablestr (table start)
      *=====================================================================******
     C     SetTabStr     begsr
     C     lstbrd        ifeq      'Y'
     C                   callp     updhtmlvar('LB':'0')
     C                   else
     C                   callp     updhtmlvar('LB':'1')
     C                   endif
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$tablerow (table row)
      *=====================================================================******
     C     SetTabRow     begsr
     C                   MOVE      LLVN          XXVN
     C                   MOVE      BWSMN         XXMN
     C                   MOVE      LHPNR         XXPNR
     C                   MOVE      WSPNA         XXPNA
     C                   MOVE      WSBNR         XXBNR
     C                   MOVE      WSBNA         XXBNA
     C                   MOVE      WSUSER        XXUSER
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('XXREF':XXREF)
     C                   callp     updhtmlvar('LLVN':
     C                             %trim(%editC(LLVN:'Z')))
      * ARTIKKEL
     C                   callp     updhtmlvar('LLANR':LLANR)
     C                   callp     updhtmlvar('LLVB':LLVB)
      * ANTLL STYKK
     C                   callp     updhtmlvar('LLWNT0':
     C                             %trim(%editC(LLWNT0:'Z')))
     C                   callp     updhtmlvar('LLWNTL':
     C                             %trim(%editC(LLWNTL:'Z')))
     C                   callp     updhtmlvar('LLWNT1':
     C                             %trim(%editC(LLWNT1:'Z')))
     C                   callp     updhtmlvar('LLWNT2':
     C                             %trim(%editC(LLWNT2:'Z')))
     C                   callp     updhtmlvar('LLWNT3':
     C                             %trim(%editC(LLWNT3:'Z')))
     C                   callp     updhtmlvar('LLWVEK':
     C                             %trim(%editC(LLWVEK:'3')))
     C                   callp     updhtmlvar('LLWKUB':
     C                             %trim(%editC(LLWKUB:'3')))
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$foundsome (some Recds were found)
      *=====================================================================******
     C     SetFndSome    begsr
      *
     C                   MOVE      *ZEROS        XXVN
     C                   MOVE      WSUSER        XXUSER
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('XXREF':XXREF)
      *
     C                   endsr
      *=====================================================================******
      *  Set output variables for section /$endhtml
      *=====================================================================******
     C     SetEnd        begsr
      * Server protocol
     C                   callp     updhtmlvar('PROTOCOL':S_Protocol)
      *
     C                   endsr
      *=====================================================================
      * FEIL
      *=====================================================================
     C     ERROR         begsr
     C                   exsr      SetSkl2
      * Read skeleton output html into core
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      * Retrieve environment variables
     C                   exsr      RtvEnvVar
      *
      * Issue html section /$top
     C                   exsr      SetTop2
     C                   callp     wrtsection('top')
      *------------------
      * Retrieve number of boats to be shown
     C                   exsr      SetFound2
     C                   callp     wrtsection('found')
     C                   IF        XBNR = *BLANKS
     C                   callp     wrtsection('VAREMSTR1')
     C                   IF        XVMLISTE = 'J'
     C                   callp     wrtsection('flerevm')
     C                   exsr      HENTVADR
     C                   ELSE
     C                   callp     updHtmlVar('WSBNR':WSBNR)
     C                   callp     wrtsection('envm')
     C                   END
     C                   callp     wrtsection('sluttvm')
     C                   ELSE
     C                   callp     updHtmlVar('WSBNR':XBNR)
     C                   callp     wrtsection('VAREMSTR2')
     C                   END
     C                   callp     wrtsection('VAREMEND')
      * Hent Transportørsnr
     C                   exsr      HENTTN
      * Hent prio lagersted
     C                   exsr      HENTLS
      *
     C                   endsr
      *
      *=====================================================================
      * Set html output variables for section /$top
      *=====================================================================
     C     SetTop2       begsr
      * Repeat national language for the next invocation
     C                   callp     updhtmlvar('LNG':lng:
     C                             InitHTMLVars)
      * Repeat background color for the next invocation
     C                   callp     updhtmlvar('TXTCOLOR':'black')
     C                   callp     updhtmlvar('BOLD':' ')
     C                   callp     updhtmlvar('BGCOLOR':BIFARG)
     C                   callp     updhtmlvar('LINK':'0000FF')
     C                   callp     updhtmlvar('VLINK':'FF0000')
     C                   callp     updhtmlvar('ALINK':'00FF00')
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('KUNDEREF1':KUNDEREF1)
     C                   callp     updhtmlvar('KUNDEREF2':KUNDEREF2)
     C                   callp     updhtmlvar('KUNDEREF3':KUNDEREF3)
      * Protocol
     C                   IF        ((BIBRID <> *BLANKS) AND
     C                              (BIINN <> *BLANKS))
     C                   callp     updHtmlVar('PROTOCOL':S_Protocol)
     C                   END
     C                   endsr
      *=====================================================================
      * Set html output variables for section /$found (display a boat)
      *=====================================================================
     C     SetFound2     begsr
      *
      * Sett inn i HTMLvariabler
     C                   IF        XBNR = *BLANKS
     C                   callp     updHtmlVar('FMELDNR':'')
     C                   ELSE
     C                   callp     updHtmlVar('FMELDNR':'2')
     C                   END
      * Sett inn i HTMLvariabler
     C                   callp     updHtmlVar('USER':WSUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('LHPNR':
     C                             %trim(%editc(BWSPNR:'Z')))
     C                   callp     updHtmlVar('KNAVN':WSPNA)
     C                   callp     updHtmlVar('LHPNA':WSPNA)
     C                   callp     updHtmlVar('WSBNA':WSBNA)
     C                   callp     updHtmlVar('WSBA1':WSBA1)
     C                   callp     updHtmlVar('WSBA2':WSBA2)
     C                   callp     updHtmlVar('WSBA3':WSBA3)
     C                   callp     updHtmlVar('WSBPN':WSBPN)
     C                   callp     updHtmlVar('WSBLK':WSBLK)
     C                   callp     updHtmlVar('WSBPU':WSBPU)
     C                   callp     updhtmlvar('WSTDT':
     C                             %trim(%editw(BWSTDT:'    .  .  ')))
     C                   callp     updhtmlvar('WSTN':
     C                             %trim(%editc(BWSTN:'Z')))
     C                   callp     updhtmlvar('WSLSD':WSLSD)
     C                   callp     updhtmlvar('WSPAK':WSPAK)
     C                   callp     updhtmlvar('WSORDR':WSORDR)
     C                   callp     updhtmlvar('WSFLN':WSFLN)
     C                   callp     updhtmlvar('FEILMELDING':FEILMELDING)
     C                   callp     updhtmlvar('FMELDNR':FMELDNR)
     C                   callp     updhtmlvar('LHALN':
     C                             %trim(%editc(LHALN:'Z')))
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(BWSMN:'Z')))
     C                   callp     updhtmlvar('LHANT0':
     C                             %trim(%editc(LHANT0:'Z')))
     C                   callp     updhtmlvar('LHANTL':
     C                             %trim(%editc(LHANTL:'Z')))
     C                   callp     updhtmlvar('LHANT1':
     C                             %trim(%editc(LHANT1:'Z')))
     C                   callp     updhtmlvar('LHANT2':
     C                             %trim(%editc(LHANT2:'Z')))
     C                   callp     updhtmlvar('LHANT3':
     C                             %trim(%editc(LHANT3:'Z')))
     C                   callp     updhtmlvar('LHWVEK':
     C                             %trim(%editc(LHWVEK:'3')))
     C                   callp     updhtmlvar('LHWKUB':
     C                             %trim(%editc(LHWKUB:'3')))
     C                   callp     updhtmlvar('LHTLIN':
     C                             %trim(%editc(LHTLIN:'Z')))
      *
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Hentvadr      begsr
     C                   MOVE      'N'           XBLANKSIST        1
      * VIS PLUKKET VAREMOTTAKER FØRST
     C                   IF        WSBNR <> *BLANKS
     C     KUNKO3K       CHAIN     KUNKO2                             33
     C                   IF        KUVADR = 0
     C     CUN11K        CHAIN     CUNDL01                            33
     C                   EVAL      XXNAVN = KNAVN
     C                   CAT       POSTNRA:1     XXNAVN           35
     C                   ELSE
     C     VADRK         CHAIN     VADR                               33
     C                   EVAL      XXNAVN = VADRNA
     C                   CAT       VADRN3:1      XXNAVN           35
     C                   END
     C                   callp     updHtmlVar('WSBNR1':WSBNR)
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   MOVE      'J'           XBLANKSIST
     C                   ELSE
      * VIS BLANK
     C                   IF        LHMN <> 0
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updHtmlVar('WSBNR1':WSBNR)
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   MOVE      ' '           XBLANKSIST
     C                   END
     C                   END
      *
      * VIS DEFAULT VAREMOTTAKER
     C                   EVAL      XVMDEFAULT = *BLANKS
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'LLVMD'
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        ((*IN40 = *OFF) AND (WSBNR <> PAVRDA))
     C                   callp     updhtmlvar('WSBNR1':PAVRDA)
     C                   END
      *
     C                   callp     updHtmlVar('WSBNA':WSBNA)
     C                   callp     updHtmlVar('WSBA1':WSBA1)
     C                   callp     updHtmlVar('WSBA2':WSBA2)
     C                   callp     updHtmlVar('WSBA3':WSBA3)
     C                   MOVE      WSBPN         ALHBPN            4
     C                   callp     updHtmlVar('WSBPN':ALHBPN)
     C                   callp     updHtmlVar('WSBLK':WSBLK)
     C                   callp     updHtmlVar('WSBPU':WSBPU)
      *
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   IF        XBLANKSIST <> ' '
     C                   MOVE      'J'           XBLANKSIST
     C                   END
      * VIS BLANK
     C                   IF        XBLANKSIST = 'N'
     C                   MOVE      *BLANKS       KUINTN
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
      *
     C     BIKUNR        SETLL     KUNKO1
     C     BIKUNR        READE     KUNKO1                                 40
     C     *IN40         DOWEQ     '0'
     C     KUINTN        IFNE      LHBNR
     C     KUINTN        ANDNE     XVMDEFAULT
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   IF        KUVADR = 0
     C     CUN11K        CHAIN     CUNDL01                            33
     C  N33AKTKOD        CABEQ     'I'           STNESTE
     C                   EVAL      XXNAVN = KNAVN
     C                   CAT       POSTNRA:1     XXNAVN           35
     C                   ELSE
     C     VADRK         CHAIN     VADR                               33
     C  N33AKTKOD        CABEQ     'I'           STNESTE
     C                   EVAL      XXNAVN = VADRNA
     C                   CAT       VADRN3:1      XXNAVN           35
     C                   END
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
     C     STNESTE       TAG
     C     BIKUNR        READE     KUNKO1                                 40
     C  N40              ENDDO
      *
     C                   IF        XBLANKSIST = 'J'
     C                   MOVE      *BLANKS       KUINTN
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
      *
     C                   callp     wrtsection('typsltend')
      *
     C     UTVADR        TAG
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Henttn        begsr
     C                   MOVE      'N'           XINGENSIST        1
      * VIS PLUKKET TRANSPORTØR FØRST
     C                   IF        BWSTN <> 0
     C                   EVAL      VMTRAN = BWSTN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   MOVE      'J'           XINGENSIST
     C                   ELSE
      * VIS *INGEN
     C                   IF        LHMN <> 0
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   MOVE      ' '           XINGENSIST
     C                   END
     C                   END
      *
      * VIS DEFAULT TRANSPORTØR
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'TRADF'
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   END
     C                   END
     C                   IF        ((*IN40 = *OFF) AND (BWSTN <> PAVRDN))
     C                   EVAL      VMTRAN = PAVRDN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   IF        XINGENSIST <> ' '
     C                   MOVE      'J'           XINGENSIST
     C                   END
     C                   END
      * VIS *INGEN
     C                   IF        XINGENSIST = 'N'
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'TRANS'
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 40
     C                   IF        *IN40
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   END
     C                   END
     C     *IN40         DOWEQ     '0'
     C                   IF        PAVRDN <> BWSTN
     C                   EVAL      VMTRAN = PAVRDN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
     C     BRPARFK       READE     BRPARF                                 40
     C  N40              ENDDO
      *
      * VIS *INGEN
     C                   IF        XINGENSIST = 'J'
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
      *
     C                   callp     wrtsection('typtntend')
      *
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Hentls        begsr
     C                   MOVE      'N'           XINGENSIST        1
      *
     C                   IF        WSLSD <> *BLANKS
      * VIS PRIO LAGERSTED FØRST
     C     WSLSD         CHAIN     LLLSDF                             33
     C   33              EVAL      LSTXT = '*UKJENT'
     C                   callp     updhtmlvar('WSLSD1':WSLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   MOVE      'J'           XINGENSIST
     C                   END
      *
      * VIS DEFAULT PLUKKLAGERSTED
     C                   MOVE      *BLANKS       XLSD              5
     C     WSBNR         COMP      *BLANKS                                33
     C  N33LLVMLSK       CHAIN(N)  LLVMLS                             33
     C  N33DSLSKD        COMP      *BLANKS                                33
     C  N33DSLSKD        COMP      WSLSD                                  33
     C                   IF        *IN33 = *OFF
     C     DSLSKD        CHAIN     LLLSDF                             33
     C   33              EVAL      LSTXT = '*UKJENT'
     C                   callp     updhtmlvar('WSLSD1':DSLSKD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   MOVE      DSLSKD        XLSD
     C                   END
      *
      * VIS ALLE ANDRE LAGERSTEDER
     C     *LOVAL        SETLL     LLLSDF
     C                   READ      LLLSDF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((LSKD <> WSLSD) AND (LSKD <> XLSD))
     C                   callp     updhtmlvar('WSLSD1':LSKD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   END
     C                   READ      LLLSDF                                 33
     C                   ENDDO
      *
      * VIS *INGEN
     C                   IF        XINGENSIST = 'J'
     C                   EVAL      XLSD = *BLANKS
     C                   IF        XSPRÅK = 'EN'
     c                   EVAL      LSTXT = '*NONE '
     c                   else
     c                   EVAL      LSTXT = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSLSD1':XLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   END
      *
     C                   callp     wrtsection('typlstend')
      *
     C                   endsr
      *=====================================================================
      * Set html output skeleton VED FEIL
      *=====================================================================
     C     SetSkl2       begsr
     C                   eval      lng = uppify(lng)
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC' + lng
     C                   eval      Mbr = 'SYL002'
     C                   CAT       XSPRÅK:0      MBR
     C                   endsr
      *=====================================================================
      *  Retrieve environment variables
      *=====================================================================
     C     RtvEnvVar     begsr
      * Use getenvp to get this server's protocol
     C                   eval      S_Protocol =getenv('SERVER_PROTOCOL':
     C                             qusec)
     C                   eval      S_Name     =getenv('SERVER_NAME':
     C                             qusec)
      *
     C                   endsr
      *=====================================================================
      *  Initier
      *=====================================================================
     C     INIT          begsr
      * Get program start time for calculating execution time
     C                   time                    timedata1
      *
     C                   open      BRIDF                                50
     C     WSUSER        CHAIN(N)  BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C                   open      FIRM                                 50
     C                   open      LLHEAD                               50
     C                   open      LLLINE                               50
     C                   open      LLTELL                               50
     C                   open      LLLSDF                               50
     C                   open      LLVMLS                               50
     C                   open      TRAN                                 50
     C                   open      VADR                                 50
     C                   open      KUNKO1                               50
     C                   open      KUNKO2                               50
     C                   open      CUNDL01                              50
     C                   open      BRPARF                               50
     c     LH00K         klist
     c                   kfld                    BWSMN
     c     LL01K         klist
     c                   kfld                    BWSMN
     c                   kfld                    XVNMAX
     c                   MOVE      999           XVNMAX            3 0
     C     LLVMLSK       klist
     C                   kfld                    BIKUNR
     C                   kfld                    WSBNR
     c     VADRK         klist
     c                   kfld                    BIFIRM
     c                   kfld                    KUKUN2
     C                   KFLD                    KUVADR
     c     VADRK2        klist
     c                   kfld                    BIFIRM
     c                   kfld                    KUKUN2
     C                   KFLD                    KUVADR
     C     KUNKOK        KLIST
     C                   KFLD                    BIKUNR
     C                   KFLD                    XXBNR
     c     KUNKO2K       klist
     c                   kfld                    BWSPNR
     c                   kfld                    KUINTN
     C     KUNKO3K       KLIST
     C                   KFLD                    BIKUNR
     C                   KFLD                    WSBNR
     c     TRANK         klist
     c                   kfld                    BIFIRM
     c                   kfld                    BWSTN
     c     CUND1K        klist
     c                   kfld                    BIFIRM
     c                   kfld                    BWSPNR
     C     CUN11K        klist
     C                   kfld                    BIFIRM
     C                   kfld                    KUKUN2
     c                   MOVE      *BLANKS       FMELDNR           1
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C     BRPARFK       klist
     C                   kfld                    PABRID
     C                   kfld                    PAKUNR
     C                   kfld                    PAID
      * HENT LEDERTEKST
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
      *
     C                   MOVEL     'SPRÅK'       PAID
     C     BRPARFK       chain     BRPARF                             33
     C                   IF        (*IN33 OR (PAVRDA <> 'EN'))
     C                   MOVE      *BLANKS       XSPRÅK            2
     C                   ELSE
     C                   MOVE      'EN'          XSPRÅK            2
     C                   END
      *
     C                   MOVEL     'LLRF1'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF1 = 'Kunderef.1'
     C                   ELSE
     C                   EVAL      KUNDEREF1 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF2'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF2 = 'Kunderef.2'
     C                   ELSE
     C                   EVAL      KUNDEREF2 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF3'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF3 = 'Kunderef.3'
     C                   ELSE
     C                   EVAL      KUNDEREF3 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'LLVMO'
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        (*IN50 OR (PAVRDA = *BLANKS))
     C                   EVAL      PAID = 'LLVML'
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        (*IN50 OR (PAVRDA = 'J') OR (PAVRDA = 'j'))
     C                   MOVE      'J'           XVMLISTE          1
     C                   ELSE
     C                   MOVE      'N'           XVMLISTE
     C                   END
     C                   MOVE      *BLANKS       XBNR             17
     C                   ELSE
     C                   MOVEL     PAVRDA        XBNR
     C                   MOVE      'N'           XVMLISTE
     C                   END
      *
     C                   endsr
      *
      *////////////////////////////////////////////////////////////
     C     TESTB         BEGSR
      *////////////////////////////////////////////////////////////
     C                   MOVE      *BLANKS       FEILMELDING
      * TEST BUTIKKNR
     C     WSBNR         IFEQ      *BLANKS
     C                   MOVE      *ZEROS        KUKUN2
     C                   MOVE      *ZEROS        KUVADR
     C     WSBNA         IFEQ      *BLANKS
     C                   IF        XSPRÅK = 'EN'
     C                   MOVEL     FEILEN01      FEILMELDING
     C                   ELSE
     C                   MOVEL     FEIL01        FEILMELDING
     C                   END
     C                   MOVE      '1'           FMELDNR
     C                   GOTO      SLTBDT
     C                   ELSE
     C                   GOTO      STTBDT
     C                   ENDIF
     C                   ELSE
     C                   MOVEL     WSBNR         KUINTN
     C     KUNKO2K       CHAIN     KUNKO2                             90
     C     *IN90         IFEQ      '0'
     C     WSBNA         CABNE     *BLANKS       STTBDT
     C     KUVADR        IFEQ      *ZEROS
     C     CUND1K        CHAIN     CUNDL01                            90
     C     *IN90         IFEQ      '0'
     C                   MOVE      KNAVN         WSBNA
     C                   MOVE      ADR1          WSBA1
     C                   MOVE      ADR2          WSBA2
     C                   MOVE      *BLANKS       WSBA3
     C                   MOVE      POSTNR        BWSBPN
     C                   MOVE      POSTNR        WSBPN
     C                   MOVE      ADR3          WSBA3
     C                   MOVE      SYLAND        WSBLK
     C                   MOVEL     SYPOGE        WSBPU
     C                   END
     C                   ELSE
     C     VADRK         CHAIN     VADR                               90
     C     *IN90         IFEQ      '0'
     C                   MOVE      VADRNA        WSBNA
     C                   MOVE      VADRN1        WSBA1
     C                   MOVE      VADRN2        WSBA2
      * NORSK POSTNR??
     C                   TESTN                   VXPNR                90
     C     *IN90         IFEQ      '1'
     C     VXBLAN        ANDEQ     ' '
     C                   MOVE      VXPNR         BWSBPN
     C                   MOVE      VXPNR         WSBPN
     C                   MOVEL     VXSTED        WSBA3
     C                   ELSE
     C                   MOVEL     VADRN3        WSBA3
     C                   END
     C                   MOVE      VALAND        WSBLK
     C                   MOVE      *BLANKS       WSBPU
     C                   END
     C                   END
     C                   ELSE
     C                   IF        XSPRÅK = 'EN'
     C                   MOVEL     FEILEN05      FEILMELDING
     C                   ELSE
     C                   MOVEL     FEIL05        FEILMELDING
     C                   END
     C                   MOVE      '5'           FMELDNR
     C                   GOTO      SLTBDT
     C                   END
     C                   END
      *
      * TEST TRANSPORTDATO
     C     STTBDT        TAG
     C                   IF        BWSTDT > 19900101
     C                   MOVE      BWSTDTD       UDD               2 0
     C                   MOVE      BWSTDTM       UMM               2 0
     C                   MOVE      BWSTDTÅ       UÅÅ               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C                   ELSE
     C                   Z-ADD     1             UFLAGG
     C                   END
     C     UFLAGG        IFEQ      1
     C                   IF        XSPRÅK = 'EN'
     C                   MOVEL     FEILEN02      FEILMELDING
     C                   ELSE
     C                   MOVEL     FEIL02        FEILMELDING
     C                   END
     C                   MOVE      '2'           FMELDNR
     C                   GOTO      SLTBDT
     C                   ENDIF
      *
      * TEST kunderef.1
     C     WSPAK         IFEQ      *BLANKS
     C                   IF        XSPRÅK = 'EN'
     C                   MOVEL     FEILEN04      FEILMELDING
     C                   ELSE
     C                   MOVEL     FEIL04        FEILMELDING
     C                   END
     C                   MOVE      '4'           FMELDNR
     C                   GOTO      SLTBDT
     C                   END
      *
      * TEST TRANSPORTØR
     C     BWSTN         IFNE      0
     C     TRANK         CHAIN     TRAN                               90
     C     *IN90         IFEQ      '1'
     C                   IF        XSPRÅK = 'EN'
     C                   MOVEL     FEILEN03      FEILMELDING
     C                   ELSE
     C                   MOVEL     FEIL03        FEILMELDING
     C                   END
     C                   MOVE      '3'           FMELDNR
     C                   GOTO      SLTBDT
     C                   END
     C                   END
      *
     C     SLTBDT        ENDSR
      *
      *=====================================================================
      *  Oppdater heading
      *=====================================================================
     C     OPDHEADING    begsr
     C     BWSMN         IFEQ      0
     C     1             CHAIN     LLTELL                             33
     C                   ADD       1             LLREC1
     C                   UPDATE    LLTELLR
     C                   MOVE      LLREC1        LHMN
     C                   MOVE      LLREC1        BWSMN
     C                   ELSE
     C                   MOVE      BWSMN         LHMN
     C                   ENDIF

     C     LH00K         CHAIN     LLHEAD                             60
     C     *IN60         IFEQ      '0'
     C     FEILMELDING   IFEQ      *BLANKS
     C                   EXSR      MOVEWSLH
     C                   ENDIF
     C                   UPDATE    LLHEADR
     C                   ELSE
     C                   EXSR      MOVEBLH
     C     FEILMELDING   IFEQ      *BLANKS
     C                   EXSR      MOVEWSLH
     C                   MOVE      'W'           LHSTA
     C                   WRITE     LLHEADR
     C                   ENDIF
     C                   ENDIF
      *
     C                   endsr
      *=====================================================================
      *  OPPDATER FELTER I FIL
      *=====================================================================
     C     MOVEWSLH      begsr
     C                   MOVE      WSBNR         LHBNR
     C                   MOVE      WSBNA         LHBNA
     C                   MOVE      WSBA1         LHBA1
     C                   MOVE      WSBA2         LHBA2
     C                   MOVE      BWSBPN        LHBPN
     C                   MOVE      WSBA3         LHBA3
     C                   IF        WSBLK = *BLANKS
     C                   MOVE      FILAND        LHBLK
     C                   ELSE
     C                   MOVE      WSBLK         LHBLK
     C                   END
     C                   MOVE      WSBPU         LHBPU
     C                   MOVE      BWSTDT        LHTDT
     C                   MOVE      BWSTN         LHTN
     C                   MOVE      WSLSD         LHLSD
     C                   MOVE      WSPAK         LHPAK
     C                   MOVE      WSORDR        LHORDR
     C                   MOVE      WSFLN         LHFLN
      *
     C                   IF        WSLSD <> *BLANKS
     C     LLVMLSK       CHAIN     LLVMLS                             33
     C                   IF        *IN33
     C                   EVAL      DSKN = BIKUNR
     C                   EVAL      DSVMNR = WSBNR
     C                   EVAL      DSLSKD = WSLSD
     C                   WRITE     LLVMLSR
     C                   ELSE
     C                   EVAL      DSLSKD = WSLSD
     C                   UPDATE    LLVMLSR
     C                   END
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  INITIER FELTER I FIL
      *=====================================================================
     C     MOVEBLH       begsr
     C                   MOVE      'W'           LHOPR
     C                   MOVE      *ZEROS        LHGRP
     C                   MOVE      BWSPNR        LHPNR
     C                   MOVE      *BLANKS       LHSTA
     C                   MOVE      *BLANKS       LHST1
     C                   MOVE      *BLANKS       LHST2
     C                   MOVE      *BLANKS       LHST3
     C                   MOVE      *ZEROS        LHALN
     C                   MOVE      *ZEROS        LHALG
     C                   MOVE      *ZEROS        LHAVD
     C                   MOVE      *ZEROS        LHOPD
     C                   MOVE      *ZEROS        LHFBN
     C                   MOVE      *ZEROS        LHANT0
     C                   MOVE      *ZEROS        LHANTL
     C                   MOVE      *ZEROS        LHANT1
     C                   MOVE      *BLANKS       LHAEH1
     C                   MOVE      *ZEROS        LHANT2
     C                   MOVE      *BLANKS       LHAEH2
     C                   MOVE      *ZEROS        LHANT3
     C                   MOVE      *BLANKS       LHAEH3
     C                   MOVE      *ZEROS        LHVEK
     C                   MOVE      *ZEROS        LHWVEK
     C                   MOVE      *ZEROS        LHKUB
     C                   MOVE      *ZEROS        LHWKUB
     C                   MOVE      *ZEROS        LHKLL
     C                   MOVE      *ZEROS        LHMLP
     C                   MOVE      *ZEROS        LHBPAL
     C                   MOVE      *ZEROS        LHAPAL
     C                   MOVE      *ZEROS        LHTLIN
     C                   MOVE      *ZEROS        LHMDT
     C                   MOVE      *ZEROS        LHODT
     C                   MOVE      *BLANKS       LHMN01
     C                   MOVE      *BLANKS       LHMN02
      *
     C                   endsr
