      *********************************************************************
      * ARBEID MED PLUKKLISTE (HEADING)
      * PROGRAM BEHANDLER INPUT FRA SYL002 OG VISER UTVALGT HEADLING
      *
CRTPG+*  CRTPGM SYSPED/SYL002 MODULE(*LIBL/SYL002
CRTPGM*        *LIBL/CHECKUSR *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 DEFAULT DATO = DAGENSDATO
********************************************************************
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      * Boats for sale data base file (LF on BOATSALE by boat serial number)
     FLLHEAD    IF   E           K DISK    USROPN
     FLLLSDF    IF   E           K DISK    USROPN
     FLLVMLS    IF   E           K DISK    USROPN
     FCUNDL01   IF   E           K DISK    USROPN
     FVADR      IF   E           K DISK    USROPN
     FTRAN      IF   E           K DISK    USROPN
     FKUNKO1    IF   E           K DISK    USROPN
     FKUNKO2    IF   E           K DISK    USROPN
     F                                     RENAME(KUNKOR:KUNKOR2)
     FBRIDF     UF   E           K DISK    USROPN
     FBRPARF    UF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Prototype definitions and standard system API error structure
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      * Variables common to CGI programs
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * VARIABLES SPECIFIC TO THIS PROGRAM
      *--------------------------------------------------------------------
      * Variables received from the input string
     D lng             s              2
     D BckGnd          s             10
     D UsrSpcName      s             10
      * Variables used to load the external html source member
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
     D XXUSER          S             10
     D XXMN            S              7
     D XXBNR           S             17
     D XXENDRE         S              1
     D KUNDEREF1       S             50
     D KUNDEREF2       S             50
     D KUNDEREF3       S             50
     D PGM             C                   CONST('SYSPED/CHECKUSR')
     D                 DS
     D  POSTNR                 1      4  0
     D  POSTNRA                1      4
     D                 DS
     D  LHBPN                  1      4  0
     D  LHBPNAA                1      4
     D                 DS
     D  VADRN3                 1     30
     D  VXPNR                  1      4
     D  VXBLAN                 5      5
     D  VXSTED                 6     30
      *
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================
      * MAIN PROCESSING LINE
      *=====================================================================
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input string
     C                   exsr      Parse
      * Initier
     C                   EXSR      INIT
     C                   CALLB     PGM
     C                   PARM                    BIBRID
     C                   PARM                    UsrSpcName
     C                   PARM                    UINN              1
     C                   IF        UINN = 'N'
     C                   GOTO      SLUTT
     C                   END
     C     XXUSER        CHAIN     BRIDF                              50
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           BIDTF
     C                   MOVE      WTM           BITIDF
     C                   UPDATE    BRIDFR
      * Set output skeleton html member name
     C                   exsr      SetSkl
      * Read skeleton output html into core
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      * Retrieve environment variables
     C                   exsr      RtvEnvVar
      *
      * Issue html section /$top
     C                   exsr      SetTop
     C                   callp     wrtsection('top')
      *------------------
      * Retrieve number of boats to be shown
      *
     C     LH00K         CHAIN     LLHEAD                             60
     C                   IF        *IN60
     C     LHMN          CABNE     0             SLUTT
     C                   CLEAR                   LLHEADR
N01  C                   MOVE      WDT           LHTDT
     C                   ELSE
     C     LHPNR         CABNE     BIKUNR        SLUTT
     C     LHOPR         CABNE     'W'           SLUTT
     C     LHSTA         CABNE     'W'           SLUTT
     C                   IF        ((XBNR <> *BLANKS) AND (XBNR <> LHBNR))
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C                   exsr      SetFound
     C                   callp     wrtsection('found')
     C                   IF        XBNR = *BLANKS
     C                   callp     wrtsection('VAREMSTR1')
     C                   IF        XVMLISTE = 'J'
     C                   callp     wrtsection('flerevm')
     C                   exsr      HENTVADR
     C                   ELSE
     C                   callp     updHtmlVar('WSBNR':LHBNR)
     C                   callp     wrtsection('envm')
     C                   END
     C                   callp     wrtsection('sluttvm')
     C                   ELSE
     C                   callp     updHtmlVar('WSBNR':XBNR)
     C                   callp     wrtsection('VAREMSTR2')
     C                   END
     C                   callp     wrtsection('VAREMEND')
      * Hent Transportørsnr
     C                   exsr      HENTTN
      * Hent prio lagersted
     C                   exsr      HENTLS
      * Send output buffer and quit
     C     SLUTT         TAG
     C                   exsr      Exit
      *=====================================================================
      * Send output buffer and quit
      *=====================================================================
     C     Exit          begsr
      * Compute and display run time
     C                   time                    timedata2
     C     timedata2     subdur    timedata1     ms:*ms
     C                   eval      sec = ms / 1000000
     C                   callp     updhtmlvar('runtime':
     C                             %trim(%editw(sec:'     0 .   ')))
     C                   callp     wrtsection('endhtml')
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      *
     C                   close     BRIDF
     C                   close     BRPARF
     C                   close     LLHEAD
     C                   close     LLLSDF
     C                   close     LLVMLS
     C                   close     CUNDL01
     C                   close     VADR
     C                   close     TRAN
     C                   close     KUNKO1
     C                   close     KUNKO2
     C                   eval      *inlr = *on
      *
     C                   return
     C                   endsr
      *=====================================================================
      * Parse input string
      *=====================================================================
     C     Parse         begsr
     C                   eval      lng     = zhbgetvar('lng')
     C                   eval      BckGnd  = zhbgetvar('bckgnd')
     C                   EVAL      XXUSER  = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   EVAL      XXMN    = zhbgetvar('MN')
     C                   EVAL      LHMN    = c2n2(XXMN)
     C                   EVAL      XXBNR   = zhbgetvar('BNR')
     C                   EVAL      XXENDRE = zhbgetvar('XENDRE')
     C                   endsr
      *=====================================================================
      * Set html output variables for section /$top
      *=====================================================================
     C     SetTop        begsr
      * Repeat national language for the next invocation
     C                   callp     updhtmlvar('LNG':lng:
     C                             InitHTMLVars)
      * Repeat background color for the next invocation
     C                   callp     updhtmlvar('TXTCOLOR':'black')
     C                   callp     updhtmlvar('BOLD':' ')
     C                   callp     updhtmlvar('BGCOLOR':BIFARG)
     C                   callp     updhtmlvar('LINK':'0000FF')
     C                   callp     updhtmlvar('VLINK':'FF0000')
     C                   callp     updhtmlvar('ALINK':'00FF00')
BODY C                   callp     updhtmlvar('BODYCLASS':'class='+BIFARG)
     C                   callp     updHtmlVar('USER':XXUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('KUNDEREF1':KUNDEREF1)
     C                   callp     updhtmlvar('KUNDEREF2':KUNDEREF2)
     C                   callp     updhtmlvar('KUNDEREF3':KUNDEREF3)
      * Protocol
     C                   IF        ((BIBRID <> *BLANKS) AND
     C                              (BIINN <> *BLANKS))
     C                   callp     updHtmlVar('PROTOCOL':S_Protocol)
     C                   END
     C                   endsr
      *=====================================================================
      * Set html output variables for section /$found (display a boat)
      *=====================================================================
     C     SetFound      begsr
      *
     C                   MOVE      XXBNR         LHBNR
     C                   IF        XXENDRE = 'J'
     C                   MOVE      *BLANKS       LHBNA
     C                   END
     C                   IF        LHBNA = *BLANKS
     C                   IF        XXBNR <> *BLANKS
     C     KUNKOK        CHAIN     KUNKO2                             33
     C     KUVADR        IFEQ      *ZEROS
     C     CUN11K        CHAIN     CUNDL01                            33
     C                   MOVE      KNAVN         LHBNA
     C                   MOVE      ADR1          LHBA1
     C                   MOVE      ADR2          LHBA2
     C                   MOVE      *BLANKS       LHBA3
     C                   MOVE      POSTNR        LHBPN
     C                   MOVE      ADR3          LHBA3
     C                   MOVE      SYLAND        LHBLK
     C                   MOVEL     SYPOGE        LHBPU
     C                   ELSE
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      VADRNA        LHBNA
     C                   MOVE      VADRN1        LHBA1
     C                   MOVE      VADRN2        LHBA2
      * NORSK POSTNR??
     C                   TESTN                   VXPNR                33
     C     *IN33         IFEQ      '1'
     C     VXBLAN        ANDEQ     ' '
     C                   MOVE      VXPNR         LHBPN
     C                   MOVEL     VXSTED        LHBA3
     C                   ELSE
     C                   MOVEL     VADRN3        LHBA3
     C                   END
     C                   MOVE      VALAND        LHBLK
     C                   MOVE      *BLANKS       LHBPU
     C                   END
     C                   MOVE      *BLANKS       XXBNR
     C                   END
     C                   END
      * Sett inn i HTMLvariabler
     C                   IF        XBNR = *BLANKS
     C                   callp     updHtmlVar('FMELDNR':'')
     C                   ELSE
     C                   callp     updHtmlVar('FMELDNR':'2')
     C                   END
     C                   callp     updHtmlVar('USER':XXUSER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('LHPNR':
     C                             %trim(%editc(BIKUNR:'Z')))
     C                   callp     updHtmlVar('KNAVN':KNAVN)
     C                   callp     updHtmlVar('LHPNA':KNAVN)
     C                   callp     updHtmlVar('WSBNA':LHBNA)
     C                   callp     updHtmlVar('WSBA1':LHBA1)
     C                   callp     updHtmlVar('WSBA2':LHBA2)
     C                   callp     updHtmlVar('WSBA3':LHBA3)
     C                   MOVE      LHBPN         ALHBPN            4
     C                   callp     updHtmlVar('WSBPN':ALHBPN)
     C                   callp     updHtmlVar('WSBLK':LHBLK)
     C                   callp     updHtmlVar('WSBPU':LHBPU)
     C                   callp     updhtmlvar('WSTDT':
     C                             %trim(%editw(LHTDT:'    .  .  ')))
     C                   callp     updhtmlvar('WSPAK':LHPAK)
     C                   callp     updhtmlvar('WSORDR':LHORDR)
     C                   callp     updhtmlvar('WSFLN':LHFLN)
     C                   callp     updhtmlvar('FEILMELDING':spaces)
     C                   callp     updhtmlvar('LHALN':
     C                             %trim(%editc(LHALN:'Z')))
     C                   callp     updhtmlvar('LHANT0':
     C                             %trim(%editc(LHANT0:'Z')))
     C                   callp     updhtmlvar('LHANTL':
     C                             %trim(%editc(LHANTL:'Z')))
     C                   callp     updhtmlvar('LHANT1':
     C                             %trim(%editc(LHANT1:'Z')))
     C                   callp     updhtmlvar('LHANT2':
     C                             %trim(%editc(LHANT2:'Z')))
     C                   callp     updhtmlvar('LHANT3':
     C                             %trim(%editc(LHANT3:'Z')))
     C                   callp     updhtmlvar('LHWVEK':
     C                             %trim(%editc(LHWVEK:'3')))
     C                   callp     updhtmlvar('LHWKUB':
     C                             %trim(%editc(LHWKUB:'3')))
     C                   callp     updhtmlvar('LHTLIN':
     C                             %trim(%editc(LHTLIN:'Z')))
      *
      *
     C                   endsr
      *=====================================================================
      * Set html output skeleton member before its read into memory
      *=====================================================================
     C     SetSkl        begsr
     C                   eval      lng = uppify(lng)
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC' + lng
     C                   eval      Mbr = 'SYL002'
     C                   CAT       XSPRÅK:0      MBR
     C                   endsr
      *=====================================================================
      *  Retrieve environment variables
      *=====================================================================
     C     RtvEnvVar     begsr
      * Use getenvp to get this server's protocol
     C                   eval      S_Protocol =getenv('SERVER_PROTOCOL':
     C                             qusec)
      *
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Hentvadr      begsr
     C                   MOVE      'N'           XBLANKSIST        1
      * VIS PLUKKET VAREMOTTAKER FØRST
     C                   IF        LHBNR <> *BLANKS                             1<-B
     C     KUNKO3K       CHAIN     KUNKO2                             33
     C                   IF        KUVADR = 0                                    2<-B
     C     CUN11K        CHAIN     CUNDL01                            33
     C                   EVAL      XXNAVN = KNAVN
     C                   CAT       POSTNRA:1     XXNAVN           35
     C                   ELSE                                                    2
     C     VADRK         CHAIN     VADR                               33
     C                   EVAL      XXNAVN = VADRNA
     C                   CAT       VADRN3:1      XXNAVN           35
     C                   END                                                     2<-E
     C                   callp     updHtmlVar('WSBNR1':LHBNR)
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   MOVE      'J'           XBLANKSIST
     C                   EVAL      XVMDEFAULT = LHBNR
     C                   EXSR      HENTMOTT
     C                   ELSE                                                   1
      * VIS BLANK
     C                   IF        LHMN <> 0                                     2<-B
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updHtmlVar('WSBNR1':LHBNR)
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   MOVE      ' '           XBLANKSIST
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
      * VIS DEFAULT VAREMOTTAKER
     C                   EVAL      XVMDEFAULT = *BLANKS
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'LLVMD'
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        ((*IN40 = *OFF) AND (LHBNR <> PAVRDA))       1<-B
     C                   IF        XBLANKSIST = 'N'                              2<-B
     C                   EVAL      XVMDEFAULT = PAVRDA
     C                   EXSR      HENTMOTT
     C                   callp     updhtmlvar('WSBNR1':PAVRDA)
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END                                                     2<-E
     C                   IF        XBLANKSIST <> ' '
     C                   MOVE      'J'           XBLANKSIST
     C                   END
     C                   END                                                    1<-E
      *
     C                   callp     updHtmlVar('WSBNA':LHBNA)
     C                   callp     updHtmlVar('WSBA1':LHBA1)
     C                   callp     updHtmlVar('WSBA2':LHBA2)
     C                   callp     updHtmlVar('WSBA3':LHBA3)
     C                   MOVE      LHBPN         ALHBPN            4
     C                   callp     updHtmlVar('WSBPN':ALHBPN)
     C                   callp     updHtmlVar('WSBLK':LHBLK)
     C                   callp     updHtmlVar('WSBPU':LHBPU)
      *
      * VIS BLANK
     C                   IF        XBLANKSIST = 'N'
     C                   MOVE      *BLANKS       KUINTN
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
      *
     C     BIKUNR        SETLL     KUNKO1
     C     BIKUNR        READE     KUNKO1                                 40
     C     *IN40         DOWEQ     '0'
     C     KUINTN        IFNE      LHBNR
     C     KUINTN        ANDNE     XVMDEFAULT
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   IF        KUVADR = 0
     C     CUN11K        CHAIN     CUNDL01                            33
     C  N33AKTKOD        CABEQ     'I'           STNESTE
     C                   EVAL      XXNAVN = KNAVN
     C                   CAT       POSTNRA:1     XXNAVN           35
     C                   ELSE
     C     VADRK         CHAIN     VADR                               33
     C  N33AKTKOD        CABEQ     'I'           STNESTE
     C                   EVAL      XXNAVN = VADRNA
     C                   CAT       VADRN3:1      XXNAVN           35
     C                   END
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
     C     STNESTE       TAG
     C     BIKUNR        READE     KUNKO1                                 40
     C  N40              ENDDO
      *
     C                   IF        XBLANKSIST = 'J'
     C                   MOVE      *BLANKS       KUINTN
     C                   callp     updhtmlvar('WSBNR1':KUINTN)
     C                   MOVE      *BLANKS       XXNAVN
     C                   callp     updhtmlvar('WSBNR2':XXNAVN)
     C                   callp     wrtsection('typsltrow')
     C                   END
      *
     C                   callp     wrtsection('typsltend')
      *
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Henttn        begsr
     C                   MOVE      'N'           XINGENSIST        1
      * VIS PLUKKET TRANSPORTØR FØRST
     C                   IF        LHTN <> 0
     C                   EVAL      VMTRAN = LHTN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   MOVE      'J'           XINGENSIST
     C                   ELSE
      * VIS *INGEN
     C                   IF        LHMN <> 0
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   MOVE      ' '           XINGENSIST
     C                   END
     C                   END
      *
      * VIS DEFAULT TRANSPORTØR
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'TRADF'
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   END
     C                   END
     C                   IF        ((*IN40 = *OFF) AND (LHTN <> PAVRDN))
     C                   EVAL      VMTRAN = PAVRDN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   IF        XINGENSIST <> ' '
     C                   MOVE      'J'           XINGENSIST
     C                   END
     C                   END
      * VIS *INGEN
     C                   IF        XINGENSIST = 'N'
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'TRANS'
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 40
     C                   IF        *IN40
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   IF        *IN40
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             40
     C                   END
     C                   END
     C     *IN40         DOWEQ     '0'
     C                   IF        PAVRDN <> LHTN
     C                   EVAL      VMTRAN = PAVRDN
     C     TRANK         CHAIN     TRAN                               33
     C   33              EVAL      VMNAVN = '*UKJENT'
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
     C     BRPARFK       READE     BRPARF                                 40
     C  N40              ENDDO
      *
      * VIS *INGEN
     C                   IF        XINGENSIST = 'J'
     C                   EVAL      VMTRAN = 0
     C                   IF        XSPRÅK = 'EN'
     C                   EVAL      VMNAVN = '*NONE '
     c                   else
     C                   EVAL      VMNAVN = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSTN1':
     C                             %trim(%editc(VMTRAN:'Z')))
     C                   callp     updhtmlvar('WSTN2':VMNAVN)
     C                   callp     wrtsection('typtntrow')
     C                   END
      *
     C                   callp     wrtsection('typtntend')
      *
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     Hentls        begsr
     C                   MOVE      'N'           XINGENSIST        1
      *
     C                   SELECT
     C                   WHEN      LHLSD <> *BLANKS
      * VIS PRIO LAGERSTED FØRST
     C     LHLSD         CHAIN     LLLSDF                             33
     C   33              EVAL      LSTXT = '*UKJENT'
     C                   callp     updhtmlvar('WSLSD1':LHLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   MOVE      'J'           XINGENSIST
     C                   WHEN      LHMN <> 0
      * VIS *INGEN
     C                   IF        XSPRÅK = 'EN'
     c                   EVAL      LSTXT = '*NONE '
     c                   else
     c                   EVAL      LSTXT = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSLSD1':LHLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   MOVE      ' '           XINGENSIST
     C                   ENDSL
      *
      * VIS DEFAULT PLUKKLAGERSTED
     C                   MOVE      *BLANKS       XLSD              5
     C     LHBNR         COMP      *BLANKS                                33
     C  N33LLVMLSK       CHAIN     LLVMLS                             33
     C  N33DSLSKD        COMP      *BLANKS                                33
     C  N33DSLSKD        COMP      LHLSD                                  33
     C                   IF        *IN33 = *OFF
     C     DSLSKD        CHAIN     LLLSDF                             33
     C   33              EVAL      LSTXT = '*UKJENT'
     C                   callp     updhtmlvar('WSLSD1':DSLSKD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   MOVE      DSLSKD        XLSD
     C                   MOVE      'J'           XINGENSIST
     C                   END
      *
      * VIS *INGEN
     C                   IF        XINGENSIST = 'N'
     C                   EVAL      XLSD = *BLANKS
     C                   IF        XSPRÅK = 'EN'
     c                   EVAL      LSTXT = '*NONE '
     c                   else
     c                   EVAL      LSTXT = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSLSD1':XLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   END
      *
      * VIS ALLE ANDRE LAGERSTEDER
     C     *LOVAL        SETLL     LLLSDF
     C                   READ      LLLSDF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((LSKD <> LHLSD) AND (LSKD <> XLSD))
     C                   callp     updhtmlvar('WSLSD1':LSKD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   END
     C                   READ      LLLSDF                                 33
     C                   ENDDO
      *
      * VIS *INGEN
     C                   IF        XINGENSIST = 'J'
     C                   EVAL      XLSD = *BLANKS
     C                   IF        XSPRÅK = 'EN'
     c                   EVAL      LSTXT = '*NONE '
     c                   else
     c                   EVAL      LSTXT = '*INGEN'
     c                   end
     C                   callp     updhtmlvar('WSLSD1':XLSD)
     C                   callp     updhtmlvar('WSLSD2':LSTXT)
     C                   callp     wrtsection('typlstrow')
     C                   END
      *
     C                   callp     wrtsection('typlstend')
      *
     C                   endsr
      *=====================================================================
      * HENT MOTTAKERSINFO.
      *=====================================================================
     C     HENTMOTT      begsr
     C     KUNKO2K       CHAIN     KUNKO2                             33
     C                   IF        KUVADR = 0
     C     CUN11K        CHAIN     CUNDL01                            33
     C                   EVAL      XXNAVN = KNAVN
     C                   CAT       POSTNRA:1     XXNAVN           35
     C                   MOVE      KNAVN         LHBNA
     C                   MOVE      ADR1          LHBA1
     C                   MOVE      ADR2          LHBA2
     C                   MOVE      *BLANKS       LHBA3
     C                   MOVE      POSTNR        LHBPN
     C                   MOVE      ADR3          LHBA3
     C                   MOVE      SYLAND        LHBLK
     C                   MOVEL     SYPOGE        LHBPU
     C                   ELSE
     C     VADRK         CHAIN     VADR                               33
     C                   EVAL      XXNAVN = VADRNA
     C                   CAT       VADRN3:1      XXNAVN           35
     C                   MOVE      VADRNA        LHBNA
     C                   MOVE      VADRN1        LHBA1
     C                   MOVE      VADRN2        LHBA2
      * NORSK POSTNR??
     C                   TESTN                   VXPNR                33
     C     *IN33         IFEQ      '1'
     C     VXBLAN        ANDEQ     ' '
     C                   MOVE      VXPNR         LHBPN
     C                   MOVEL     VXSTED        LHBA3
     C                   ELSE
     C                   MOVEL     VADRN3        LHBA3
     C                   END
     C                   MOVE      VALAND        LHBLK
     C                   MOVE      *BLANKS       LHBPU
     C                   END
      *
     C                   endsr
      *=====================================================================
      *  Initier
      *=====================================================================
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     XXUSER        CHAIN(N)  BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C                   open      LLHEAD                               50
     C                   open      LLLSDF                               50
     C                   open      LLVMLS                               50
     C                   open      CUNDL01                              50
     C                   open      VADR                                 50
     C                   open      TRAN                                 50
     C                   open      KUNKO1
     C                   open      KUNKO2
     C                   open      BRPARF
     C     LH00K         klist
     C                   kfld                    LHMN
     C     LLVMLSK       klist
     C                   kfld                    BIKUNR
     C                   kfld                    LHBNR
     C     CUND1K        klist
     C                   kfld                    BIFIRM
     C                   kfld                    BIKUNR
     C     CUN11K        klist
     C                   kfld                    BIFIRM
     C                   kfld                    KUKUN2
     C     VADRK         klist
     C                   kfld                    BIFIRM
     C                   kfld                    KUKUN2
     C                   KFLD                    KUVADR
     C     VADRKCHG      klist
     C                   kfld                    BIFIRM
     C                   kfld                    KUKUN2
     C                   KFLD                    XXBNR
     C     TRANK         klist
     C                   kfld                    BIFIRM
     C                   kfld                    VMTRAN
     C     KUNKOK        KLIST
     C                   KFLD                    BIKUNR
     C                   KFLD                    XXBNR
     C     KUNKO2K       KLIST
     C                   KFLD                    BIKUNR
     C                   KFLD                    XVMDEFAULT       17
     C     KUNKO3K       KLIST
     C                   KFLD                    BIKUNR
     C                   KFLD                    LHBNR
     C     BRPARFK       klist
     C                   kfld                    PABRID
     C                   kfld                    PAKUNR
     C                   kfld                    PAID

     C     CUND1K        CHAIN     CUNDL01                            50
     C                   MOVE      *ZEROS        LHBPN
      * HENT LEDERTEKST
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
      *
     C                   MOVEL     'SPRÅK'       PAID
     C     BRPARFK       chain     BRPARF                             33
     C                   IF        (*IN33 OR (PAVRDA <> 'EN'))
     C                   MOVE      *BLANKS       XSPRÅK            2
     C                   ELSE
     C                   MOVE      'EN'          XSPRÅK            2
     C                   END
      *
     C                   MOVEL     'LLRF1'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF1 = 'Kunderef.1'
     C                   ELSE
     C                   EVAL      KUNDEREF1 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF2'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF2 = 'Kunderef.2'
     C                   ELSE
     C                   EVAL      KUNDEREF2 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF3'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF3 = 'Kunderef.3'
     C                   ELSE
     C                   EVAL      KUNDEREF3 = PAVRDA
     C                   END
      *
      * POST MED 'LLVMO' FINNES --> KUN JOBBE MED DENNE KUNDEN
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   EVAL      PAID = 'LLVMO'
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        (*IN50 OR (PAVRDA = *BLANKS))
     C                   EVAL      PAID = 'LLVML'
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   END
     C                   END
     C                   IF        (*IN50 OR (PAVRDA = 'J') OR (PAVRDA = 'j'))
     C                   MOVE      'J'           XVMLISTE          1
     C                   ELSE
     C                   MOVE      'N'           XVMLISTE
     C                   END
     C                   MOVE      *BLANKS       XBNR             17
     C                   ELSE
     C                   MOVEL     PAVRDA        XBNR
     C                   MOVE      'N'           XVMLISTE
     C                   END
      *
     C                   endsr
