     FFIRM      IF   E           K DISK
     FHEADF     IF   E           K DISK
     FLISTE     O    F  132        PRINTER OFLIND(*INOF)
     FFAK3      IF   E           K DISK
     FKREHL01   IF   E           K DISK
     D                 DS
     D  FADATO                 1      8  0
     D  FAFAÅR                 1      4  0
     D  FAFAMN                 5      6  0
     D  FAFADG                 7      8  0
     C*
     C                   READ      FIRM                                   34
     C                   MOVE      'O'           K1                1
     C     KEY           KLIST
     C                   KFLD                    K1
     C     KEYHEA        KLIST
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C*
     C     KEYL1         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    FAKUNR
     C                   KFLD                    FAVAL
     C                   KFLD                    FAFAÅR
     C                   KFLD                    FAFAMN
     C                   KFLD                    FAFADG
     C                   KFLD                    FAFAKT
     C*
     C     KEY           SETLL     FAK3
     C     START         TAG
     C     KEY           READE     FAK3                                   33
     C  N33FABELN        IFNE      *ZEROS
     C  N33FAKDA         IFNE      'K'
     C     KEYHEA        CHAIN     HEADF                              36
     C  N36              DO
     C     FASK          IFEQ      'S'
     C                   MOVE      HEVALS        FAVAL
     C                   END
     C     FASK          IFEQ      'K'
     C                   MOVE      HEVALK        FAVAL
     C                   END
     C     FICURR        IFEQ      FAVAL
     C                   MOVE      *BLANKS       FAVAL
     C                   END
     C     KEYL1         CHAIN     KREHL01                            34
     C   34              EXCEPT    DET
     C                   END
     C                   END
     C                   END
     C  N33              GOTO      START
     C                   SETON                                        LR
     C                   RETURN
     OLISTE     E            DET            2
     O                       FAFAKT        Z     10
     O                       FAKUNR        Z     20
     O                       FADATO              32 '    .  .  '
