********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 endring hanling info
********************************************************************
      *
      * Be aware that the "caret" value  ^  is typed by entering
      * Alt Hex 5F in EBCDIC. That corresponds to the ASCII value
      * of 5E.
      * Be aware that the "tilde" value  ~  is typed by entering
      * Alt Hex DC in EBCDIC. That corresponds to the ASCII value
      * of 7E.
      *
     H FTRANS
     FDOLAL01   IF   E           K DISK
     FSYLA01P   O    F   36        PRINTER OFLIND(*INOF)
     D A4              S              1    DIM(4)                               Input string
     D B4              S              1    DIM(4)                               Output string
     D Æ               S              1    DIM(20)                              Input string
     D Å               S              1    DIM(20)                              Output string
     D                 DS
     D  DATA                   1     36
     D  DATA1                  4     36
     D  DATA3                  1      3
     D                 DS            26
     D DFLT            C                   CONST('^XA^LH00,00^CI4-
     D                                     ^FWN^LRY^XZ')
     D                 DS            12
     D DESTIN          C                   CONST('DESTINATION:')
     D                 DS            10
     D TTLWEI          C                   CONST('TTL WEIGHT')
     D                 DS            13
     D HANDLI          C                   CONST('HANDLING INFO')
     D                 DS             8
     D ROUTIN          C                   CONST('ROUTING:')
     D                 DS             9
     D BBOX1           C                   CONST('150,99,50')
     D                 DS            10
     D HWBPIS          C                   CONST('HWB PIECES')
     D                 DS            10
     D HWBWGT          C                   CONST('HWB WEIGHT')
     D                 DS
      * Make "No. of Pieces" Zoned numeric
     D  LANUMA                 1      4  0
     D                 DS
     D  ØN151                  1     15  1
     D  ØA151H                 1     14
     D  ØA151X                 5     14
     D  ØA151D                15     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)                              Num edit
     D                 DS
     D  WRK                    1      4  0
      * Input Parameter
     C     *ENTRY        PLIST
     C                   PARM                    AVD               4 0                       ID
     C                   PARM                    OPD               7 0                       ID
      * Execute init routine only once
     C                   EXSR      SRINIT
     C     *IN90         IFEQ      *ON
     C                   GOTO      ENDPGM
     C                   ENDIF
      * Execute Label Init
     C                   EXSR      SR0001
      * Execute Label top Text
     C                   EXSR      SR0010
      * Execute Name of Product
     C                   EXSR      SR0020
      * Execute AWB no. and origin City
     C                   EXSR      SR0030
      * Execute Destination City
     C                   EXSR      SR0040
      * Execute Pieces in Consignment
     C                   EXSR      SR0050
      * Execute Total Weight
     C                   EXSR      SR0060
      * Check if singel AWB or HAWB
     C     LAHCDE        IFEQ      'H'                                          <HOUSE AWB
      * Execute HAWB details
     C                   EXSR      SR0065
     C                   ELSE
      * Execute Handling Info
     C                   EXSR      SR0070
     C                   ENDIF
      * Execute Shipper Name/address 1
     C                   EXSR      SR0080
      * Execute Shipper Name/address 2
     C     LASHP2        IFNE      *BLANKS
     C                   EXSR      SR0090
     C                   ENDIF
      * Execute Shipper Name/address 3
     C     LASHP3        IFNE      *BLANKS
     C                   EXSR      SR0100
     C                   ENDIF
      * Execute Shipper Name/address 4
     C     LASHP4        IFNE      *BLANKS
     C                   EXSR      SR0105
     C                   ENDIF
      * Execute Consignee Name/address 1
     C                   EXSR      SR0110
      * Execute Consignee Name/address 2
     C     LACNE2        IFNE      *BLANKS
     C                   EXSR      SR0120
     C                   ENDIF
      * Execute Consignee Name/address 3
     C                   EXSR      SR0125
      * Execute Consignee Name/address 4
     C                   EXSR      SR0130
      * Execute Routing 1
     C                   EXSR      SR0140
      * Execute Routing 2
     C     LARTN2        IFNE      *BLANKS
     C                   EXSR      SR0150
     C                   ENDIF
      * Execute Routing 3
     C     LARTN3        IFNE      *BLANKS
     C                   EXSR      SR0160
     C                   ENDIF
      * Execute Routing 4
     C     LARTN4        IFNE      *BLANKS
     C                   EXSR      SR0170
     C                   ENDIF
      * Execute Routing 5
     C     LARTN5        IFNE      *BLANKS
     C                   EXSR      SR0180
     C                   ENDIF
      * Execute AWB no. as Bar Code  (Interleaved 2 of 5)
     C                   EXSR      SR0190
      * Execute AWB no. with leading Zero
      * ( Interpretation line printed automaticly under code )
      *                    EXSR SR0200
      * Execute Number of Copies
     C                   EXSR      SRNUMB
      * Execute End Label Format
     C                   EXSR      SREND
      * End Program
     C     ENDPGM        TAG
     C                   SETON                                        LR
      *_____________________________________________________
      * Execute Label Init
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0001        BEGSR
      * Send Default Instructions
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     DFLT          DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Label top Text
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0010        BEGSR
      * Start of Text bit (^XA)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WXA           DATA
     C                   EXCEPT    SYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '55,25'       DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WA0           DATA
     C                   MOVEL     ',72,78'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LAISTX        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
     C                   ENDSR
      *_____________________________________________________
      * Execute Name of Product + Line
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0020        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,110'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',40,25'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVEA     *BLANKS       Æ
     C                   MOVEA     LASERC        Æ
     C                   Z-ADD     20            ÆX
     C                   EXSR      SRCENT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEA     Å             DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,155'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Line to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     '600,0,5'     DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute AWB no. and origin City
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0030        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '18,185'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WA0           DATA
     C                   MOVEL     ',50,62'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LAAWBC        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
     C                   ENDSR
      *_____________________________________________________
      * Execute Destination City
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0040        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,285'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',30,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     DESTIN        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Create Black Box
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '310,240'     DATA1
     C                   EXCEPT    SYLA01
      * Black Box Instruction
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     BBOX1         DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Print Destination Code
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Reverse Image
      *                    MOVE *BLANKS   DATA
      *                    MOVEL'^LRY'    DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '315,255'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',90,40'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LADCTY        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,353'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,20'      DATA1
     C                   EXCEPT    SYLA01
      * Line to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     '600,0,5'     DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Pieces in Consignment
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0050        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,370'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     'PIECES'      DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '18,400'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',45,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   Z-ADD     LANUMP        LANUMA
     C                   MOVE      LANUMA        CHAR4             4
     C                   MOVEA     CHAR4         A4
     C                   Z-ADD     1             X                 1 0
     C                   Z-ADD     1             Y                 1 0
     C                   MOVEA     *BLANKS       B4
     C     A4(X)         DOWEQ     '0'
     C     X             ANDLT     4
     C                   ADD       1             X
     C                   ENDDO
     C     X             DOWLE     4
     C                   MOVEA     A4(X)         B4(Y)
     C                   ADD       1             X
     C                   ADD       1             Y
     C                   ENDDO
     C                   MOVEA     B4            DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Total Weight
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0060        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '200,370'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     TTLWEI        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '203,400'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',45,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   Z-ADD     LAWGHT        ØN151
     C                   EXSR      SRNE1
     C                   MOVEL     ØAN           DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute HAWB details
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0065        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,438'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     HWBPIS        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '200,438'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     HWBWGT        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,463'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',45,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   Z-ADD     LAHNUM        LANUMA
     C                   MOVE      LANUMA        CHAR4
     C                   MOVEA     CHAR4         A4
     C                   Z-ADD     1             X
     C                   Z-ADD     1             Y
     C                   MOVEA     *BLANKS       B4
     C     A4(X)         DOWEQ     '0'
     C     X             ANDLT     4
     C                   ADD       1             X
     C                   ENDDO
     C     X             DOWLE     4
     C                   MOVEA     A4(X)         B4(Y)
     C                   ADD       1             X
     C                   ADD       1             Y
     C                   ENDDO
     C                   MOVEA     B4            DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '203,463'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',45,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   Z-ADD     LAHWGT        ØN151
     C                   EXSR      SRNE1
     C                   MOVEL     ØAN           DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,503'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WA0           DATA
     C                   MOVEL     ',30,40'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
s01  C*                  MOVEL     LAHAIN        DATA1
n01  C                   MOVEL     'HWB:'        DATA1
n01  C     DATA1         CAT       LAHAIN:1      DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Handling Info
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0070        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,457'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     HANDLI        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,490'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WA0           DATA
     C                   MOVEL     ',30,40'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LAHAIN        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Shipper Name/address 1
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0080        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,535'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Line to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     '600,0,5'     DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,552'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     'FROM:'       DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,575'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LASHP1        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Shipper Name/address 2
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0090        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,600'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LASHP2        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Shipper Name/address 3
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0100        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,625'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LASHP3        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Shipper Name/address 4
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0105        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,650'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LASHP4        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Consignee Name/address 1
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0110        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,670'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     'TO:'         DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,690'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LACNE1        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Consignee Name/address 2
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0120        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,715'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LACNE2        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Consignee Name/address 3
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0125        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,740'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LACNE3        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Consignee Name/address 4
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0130        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '50,765'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LACNE4        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '10,810'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Line to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     '600,0,5'     DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Routing 1
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0140        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '15,832'      DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',20,10'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     ROUTIN        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '114,832'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',31,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LARTN1        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Routing 2
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0150        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '114,869'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',31,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LARTN2        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Routing 3
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0160        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '114,906'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',31,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LARTN3        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Routing 4
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0170        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '114,943'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',31,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LARTN4        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute Routing 5
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0180        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '114,980'     DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',31,20'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LARTN5        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute AWB no. as Bar Code  (Interleaved 2 of 5)
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0190        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '75,1030'     DATA1
     C                   EXCEPT    SYLA01
      * Font (Selecting Barcode Field Default)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     '^BY'         DATA
     C                   MOVEL     '3,3:1,10'    DATA1
     C                   EXCEPT    SYLA01
      * Font (Selecting Barcode Interleaved 2 of 5)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     '^B2'         DATA
     C                   MOVEL     ',99,Y'       DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed as Barcode
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LAAWBN        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Execute AWB no. with leading Zero
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SR0200        BEGSR
      * Start of Text bit (^XA)
      *                    MOVE *BLANKS   DATA
      *                    MOVELWXA       DATA
      *                    EXCPTSYLA01
      * Data Position
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '179,1131'    DATA1
     C                   EXCEPT    SYLA01
      * Font
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',30,15'      DATA1
     C                   EXCEPT    SYLA01
      * Text to be printed as Barcode
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     LAAWB2        DATA1
     C                   EXCEPT    SYLA01
      * Field Separator instruction (^FS)
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    SYLA01
      *
     C                   ENDSR
      *_____________________________________________________
      * Leftjustify num.fields
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRNE1         BEGSR
      * Move correct value into alpha 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØA151D        IFEQ      '0'                                          <-------------I
     C     ØADEC         ANDEQ     'N'                                          <-------------I
     C                   MOVE      ØA151H        ØA12                                         I
     C                   ELSE                                                   <-------------I
     C                   MOVEL     ØA151X        ØA12                                         I
     C                   MOVE      '. '          ØA12                                         I
     C                   MOVE      ØA151D        ØA12                                         I
     C                   END                                                    <-------------I
      * search from left and find first sign over 0
     C     1             DO        11            ØX                             <-------------I
     C     Ø12(ØX)       IFNE      '0'                                           <-----------II
     C                   LEAVE                                                               II
     C                   END                                                     <-----------II
     C                   END                                                    <-------------I
      * Leftjustify to a new field
     C                   MOVE      *BLANKS       ØAN
     C                   MOVEA     Ø12(ØX)       ØAN
      * Reset decimal indicator
     C                   MOVE      'N'           ØADEC
      *
     C                   ENDSR
      *_____________________________________________________
      * Center text
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRCENT        BEGSR
     C                   MOVEA     *BLANKS       Å
      * Find rightmost character of input
     C     SRB1          TAG
     C     ÆX            CABEQ     0             CENT99
     C     Æ(ÆX)         IFEQ      *BLANKS
     C                   SUB       1             ÆX
     C                   GOTO      SRB1
     C                   ENDIF
      * Sub from the rightmost counter
      * This is only valid if formtype A0 us used because blank
      * caracters uses less space in grafic mode.
     C     DATA3         IFEQ      '^A0'
     C                   SELECT
     C     ÆX            WHENLT    19
     C     ÆX            ANDGE     15
     C                   SUB       2             ÆX
     C     ÆX            WHENLT    14
     C     ÆX            ANDGE     10
     C                   SUB       4             ÆX
     C     ÆX            WHENLT    9
     C     ÆX            ANDGE     5
     C                   SUB       6             ÆX
     C     ÆX            WHENLT    4
     C                   SUB       8             ÆX
     C                   ENDSL
     C                   ENDIF
      * Calculate left positions of output
     C     20            SUB       ÆX            ÆX
     C     ÆX            IFGE      2
     C     ÆX            DIV       2             ÆX
     C                   ADD       1             ÆX
     C                   ELSE
     C                   Z-ADD     1             ÆX
     C                   ENDIF
      * Move input to output arrary
     C                   MOVEA     Æ             Å(ÆX)
      *
     C     CENT99        ENDSR
      *_____________________________________________________
      * Initialise subroutine, set character set
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRINIT        BEGSR
      *
     C                   BITOFF    '02'          WA                1            DEC 5E
     C                   BITON     '134567'      WA                             DEC 5E
      *
     C                   MOVEL     WA            WA0               3            A0
     C                   MOVE      'A0'          WA0               3            A0
      *
     C                   MOVEL     WA            WAA               3            AA
     C                   MOVE      'AA'          WAA               3            AA
      *
     C                   MOVEL     WA            WAD               3            AD
     C                   MOVE      'AD'          WAD               3            AD
      *
     C                   MOVEL     WA            WAE               3            AE
     C                   MOVE      'AE'          WAE               3            AE
      *
     C                   MOVEL     WA            WAP               3            AP
     C                   MOVE      'AP'          WAP               3            AP
      *
     C                   MOVEL     WA            WBY               3            BY
     C                   MOVE      'BY'          WBY               3            BY
      *
     C                   MOVEL     WA            WB2               3            B2
     C                   MOVE      'B2'          WB2               3            B2
      *
     C                   MOVEL     WA            WXA               3            XA
     C                   MOVE      'XA'          WXA               3            XA
      *
     C                   MOVEL     WA            WCF               3            CF
     C                   MOVE      'CF'          WCF               3            CF
      *
     C                   MOVEL     WA            WCI               3            CI
     C                   MOVE      'CI'          WCI               3            CI
      *
     C                   MOVEL     WA            WXZ               3            XZ
     C                   MOVE      'XZ'          WXZ               3            XZ
      *
     C                   MOVEL     WA            WFO               3            FO
     C                   MOVE      'FO'          WFO               3            FO
      *
     C                   MOVEL     WA            WFD               3            FD
     C                   MOVE      'FD'          WFD               3            FD
      *
     C                   MOVEL     WA            WFS               3            FS
     C                   MOVE      'FS'          WFS               3            FS
      *
     C                   MOVEL     WA            WGB               3            GB
     C                   MOVE      'GB'          WGB               3            GB
      *
     C                   MOVEL     WA            WLH               3            LH
     C                   MOVE      'LH'          WLH               3            LH
      *
     C                   MOVEL     WA            WFW               3            FW
     C                   MOVE      'FW'          WFW               3            FW
      *
     C                   MOVEL     WA            WBY               3            BY
     C                   MOVE      'BY'          WBY               3            BY
      *
     C                   Z-ADD     0             ØX                3 0          Index for Ø
     C                   MOVE      *BLANKS       ØAN              12            Num alpha
     C                   MOVE      'N'           ØADEC             1            Decimal Indicator
     C                   Z-ADD     0             ÆX                3 0
     C                   MOVE      *BLANKS       MSGVAR            7            Message Variabel
     C     OPDKEY        KLIST
     C                   KFLD                    AVD
     C                   KFLD                    OPD
     C     OPDKEY        CHAIN     DOLAL01                            90
      *
     C                   ENDSR
      *_____________________________________________________
      * Subroutine to set number of copies
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRNUMB        BEGSR
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     '^PQ'         DATA
     C                   Z-ADD     LANUMC        WRK
     C                   MOVEL     WRK           DATA1
     C                   EXCEPT    SYLA01
     C                   ENDSR
      *_____________________________________________________
      * Subroutine to end Label Format
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SREND         BEGSR
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WXZ           DATA
     C                   EXCEPT    SYLA01
     C                   ENDSR
      *
     OSYLA01P   E            SYLA01
     O                       DATA
**    *  Translation table for Zebra 9X printers, ÆØÅ.
SYLA01P   9E7B
SYLA01P   E07C
SYLA01P   9F5B
SYLA01P   9CC0
SYLA01P   BB6A
SYLA01P   47D0
