      *
      ***********************************************************
      *** leverandørers gebyrkoder
      ***********************************************************
      *
     FKODTGE    IF   E           K DISK
     FKODTG2    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FLEVEL01   IF   E           K DISK
     FKONTL01   IF   E           K DISK
     FNAVLEV    IF   E           K DISK
     FSYNA05FM  CF   E             WORKSTN
     D                 DS
     D  GE                     1     18
     D                                     DIM(6)                               I/O. frankatur
     D  NAVGE1                 1      3
     D  NAVGE2                 4      6
     D  NAVGE3                 7      9
     D  NAVGE4                10     12
     D  NAVGE5                13     15
     D  NAVGE6                16     18
     D                 DS
     D  GT                     1    120
     D                                     DIM(6)                               I/O. frankatur
     D  GT1                    1     20
     D  GT2                   21     40
     D  GT3                   41     60
     D  GT4                   61     80
     D  GT5                   81    100
     D  GT6                  101    120
     D                 DS
     D  KT                     1    180
     D                                     DIM(6)                               I/O. frankatur
     D  KT1                    1     30
     D  KT2                   31     60
     D  KT3                   61     90
     D  KT4                   91    120
     D  KT5                  121    150
     D  KT6                  151    180
     D                 DS
     D  WS                     1      6
     D                                     DIM(6)                               I/O. frankatur
     D  WST                    1      6
     D  WS1                    1      1
     D  WS2                    2      2
     D  WS3                    3      3
     D  WS4                    4      4
     D  WS5                    5      5
     D  WS6                    6      6
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C   03              GOTO      SLUTT
     c   12              goto      slutt
     c
      *
     C     WST           IFNE      *BLANKS
     C     1             DO        6             NR
     C     WS(NR)        IFEQ      '1'
     C                   MOVE      GE(NR)        UGEB
     C                   GOTO      SLUTT
     C                   ENDIF
     C                   ENDDO
     C                   ENDIF
     C                   MOVE      *BLANKS       WS
     C                   GOTO      START
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     c     *entry        plist
     c                   parm                    levnr             8 0
     c                   parm                    UGEB              3
     c     keyge1        klist
     C                   KFLD                    KODEG1
     C                   KFLD                    NAVGE             3
     c                   move      'GE'          KODEG1            2
     c     keyge2        klist
     C                   KFLD                    KODEG2
     C                   KFLD                    NAVGE             3
     c                   move      'G2'          KODEG2            2
     C     NAVKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    LEVNR
     C     KONKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KONTO
     C*
     C                   READ      FIRM                                   33
     C*
     C                   WRITE     WINDOWSZ
     c     navkey        chain     level01                            33
     c     navkey        chain     navlev                             33
      *
     c     1             do        6             nr                2 0
     c                   move      ge(nr)        navge
     c     keyge1        chain     kodtge                             33
     c  N33keyge2        chain     kodtg2                             33
     c  N33              move      kgenot        GT(nr)
     C  N33              MOVE      KG2UTG        KONTO
     c  N33kONKEY        chain     KONTL01                            33
     C  N33              MOVE      KONTNA        KT(NR)
     c                   end
      *
     C     NAVGE1        COMP      *BLANKS                            7171
     C     NAVGE2        COMP      *BLANKS                            7272
     C     NAVGE3        COMP      *BLANKS                            7373
     C     NAVGE4        COMP      *BLANKS                            7474
     C     NAVGE5        COMP      *BLANKS                            7575
     C     NAVGE6        COMP      *BLANKS                            7676
     C                   ENDSR
     C*
