      *
      ***********************************************************
      *** PROGRAM SKAL VISE FRISØKEVEI                        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06-11 13-24 26
      *** LEDIGE INDIKATORER 27-29 31 32 34-88 95-97
      ***********************************************************
      *
     FZREETXT1  IF   E           K DISK
     FSYOP25D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSSUBN               378    379B 0
     D  WSCLOC               382    383B 0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     ZREETXT1K     SETLL     ZREETXT1
     C     START1        TAG
     C     ZREETXT1K     READE     ZREETXT1                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        10
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     ZREETXT1K     READE     ZREETXT1                               94
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C                   SETOFF                                       9830
     C                   MOVEA     '00'          *IN(89)
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
      *** AVSLUTT - KAN IKKE AVSLUTTE MED MAXKRAV=2(=MÅ TASTES)
     C     *IN03         IFEQ      '1'
     C     *IN12         OREQ      '1'
     C                   GOTO      SLUTT
     C                   END
      *
      *** FRISK OPP
     C   05              GOTO      START
      *
      *** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
      *
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     ZREETXT1K     KLIST
     C                   KFLD                    UUNIK
     C                   KFLD                    UREFF
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUNIK             9 0
     C                   PARM                    UREFF            17
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
      *
