      *
      *****************************************************************
      *** PROGRAM FOR Å SETTE DFT OPPD.GIVER BASERT PÅ SPED.MODUL   ***
      *** RETURNERER FELT UXKNFA = OPPDRAGSGIVER                    ***
      *****************************************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UXUR              1            =HEUR
     C                   PARM                    UXKNK             8 0          =HEKNK
     C                   PARM                    UXKNKF            8 0          =HEKNKF
     C                   PARM                    UXKNS             8 0          =HEKNS
     C                   PARM                    UXKNSF            8 0          =HUKNSF
     C                   PARM                    UXKNFA            8 0          =TRKNFA
      *
     C                   SELECT
      *
      * import
      *
     C     UXUR          WHENEQ    'A'
     C     UXUR          OREQ      'C'
     C     UXUR          OREQ      'F'
     c                   MOVE      UXKNKF        UXKNFA
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNK         UXKNFA
     C                   END
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNSF        UXKNFA
     C                   END
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNS         UXKNFA
     C                   END
      *
      * export
      *
     C     UXUR          WHENEQ    'B'
     C     UXUR          OREQ      'D'
     C     UXUR          OREQ      'G'
     C                   MOVE      UXKNSF        UXKNFA
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNS         UXKNFA
     C                   END
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNKF        UXKNFA
     C                   END
     C     UXKNFA        IFEQ      *ZEROS
     C                   MOVE      UXKNK         UXKNFA
     C                   END
     C                   ENDSL
      * RETURN UTEN LR.
     C                   RETURN
