      *
      **************************************************************
      *** VIS DETALJER OM EN PALLEPART                           ***
      **************************************************************
      *
     FPAPA      IF   E           K DISK
     FSYPA04FB  CF   E             WORKSTN
      *
     C     *ENTRY        PLIST
     C                   PARM                    UPART             8 0
      *
      *
      *
     C     UPART         CHAIN     PAPA                               33
     C  N33              EXFMT     SEPART
     C*
     C                   SETON                                        LR
     C                   RETURN
