      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE PROFIL PALLEBYTTESYSTEM      ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER                                     ***
      **************************************************************
      *
     FPALFIR    UF A E             DISK
     FSYPA03FM  CF   E             WORKSTN
     D                 DS
     D  WSOT                   1      2
     D  WSKSIF                 1      1
     D  WSKPOS                 2      2
     D                 DS
     D  WSFRAN                 1      3
     D  WSTSIF                 1      1
     D  WSTPOS                 2      2
     C     1             CHAIN     PALFIR                             50
     C     *IN50         IFEQ      *OFF
     C                   MOVE      PFLØNR        WSLØNR
     C                   MOVE      PFPUNR        WSPUNR
     C                   MOVE      PFPKKR        WSPKKR
     C                   MOVE      PFBUNR        WSBUNR
     C                   MOVE      PFOAVD        WSOAVD
     C                   MOVE      PFVK          WSVK
     C                   MOVE      PFBTAB        WSBTAB
     C                   MOVE      PFPRIN        WSPRIN
     C                   MOVE      PFHT1         WSHT1
     C                   MOVE      PFHT2         WSHT2
     C                   MOVE      PFHT3         WSHT3
     C                   MOVE      PFHT4         WSHT4
     C                   MOVE      PFHT5         WSHT5
     C                   MOVE      PFHT6         WSHT6
     C                   MOVE      PFHT7         WSHT7
     C                   MOVE      PFPT1         WSPT1
     C                   MOVE      PFPT2         WSPT2
     C                   MOVE      PFPT3         WSPT3
     C                   MOVE      PFPT4         WSPT4
     C                   MOVE      PFPT5         WSPT5
     C                   MOVE      PFPT6         WSPT6
     C                   MOVE      PFPT7         WSPT7
     C                   MOVE      PFOT          WSOT
     C                   MOVE      PFFRAN        WSFRAN
     C                   ENDIF
     C     START         TAG
     C                   EXFMT     BILDE1
      **  AVSLUTT
     C     *IN03         IFEQ      *ON
     C                   GOTO      SLUTT
     C                   ENDIF                                                  <*IN03
      **
     C                   MOVE      '0'           *IN30
     C                   MOVE      WSLØNR        PFLØNR
     C                   MOVE      WSPUNR        PFPUNR
     C                   MOVE      WSPKKR        PFPKKR
     C                   MOVE      WSBUNR        PFBUNR
     C                   MOVE      WSOAVD        PFOAVD
     C                   MOVE      WSVK          PFVK
     C                   MOVE      WSBTAB        PFBTAB
     C                   MOVE      WSPRIN        PFPRIN
     C                   MOVE      WSHT1         PFHT1
     C                   MOVE      WSHT2         PFHT2
     C                   MOVE      WSHT3         PFHT3
     C                   MOVE      WSHT4         PFHT4
     C                   MOVE      WSHT5         PFHT5
     C                   MOVE      WSHT6         PFHT6
     C                   MOVE      WSHT7         PFHT7
     C                   MOVE      WSPT1         PFPT1
     C                   MOVE      WSPT2         PFPT2
     C                   MOVE      WSPT3         PFPT3
     C                   MOVE      WSPT4         PFPT4
     C                   MOVE      WSPT5         PFPT5
     C                   MOVE      WSPT6         PFPT6
     C                   MOVE      WSPT7         PFPT7
     C                   MOVE      WSOT          PFOT
     C                   MOVE      WSFRAN        PFFRAN
     C*
     C     *IN50         IFEQ      *ON
     C                   WRITE     PALFIRR
     C                   ELSE
     C                   UPDATE    PALFIRR
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
