      *
      **************************************************************
      *** PROGRAM FOR Å SPØRRE PÅ/PLUKKE/AUTOPLUKKE PALLEBYTTEPARTER
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      **************************************************************
      *
     FPAPA      IF   E           K DISK
     FPAPAL01   IF   E           K DISK
     F                                     RENAME(PAPAR:PAPAR2)
     FSYPA04FA  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  W2SØK2                 1     10
     D  AL                     1     10
     D                                     DIM(10)
     D                 DS
     D  PPNAVN                 1     30
     D  WSNAVN                 1     20
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   MOVE      *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27PAPAK         SETLL     PAPA
     C   27PAPA1K        SETLL     PAPAL01
     C     START1        TAG
     C  N27              READ      PAPA                                   94
     C   27              READ      PAPAL01                                94
     C   27
     CANN94W2SØK2        COMP      PPALFA                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27              READ      PAPA                                   94
     C   27              READ      PAPAL01                                94
     C   27
     CANN94W2SØK2        COMP      PPALFA                               94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     4             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     4             POSNBR
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C*
     C                   SETOFF                                       9830
     C*
     C*** AVSLUTT
     C   03
     COR 12              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   CALL      'SYPA04'
     C                   PARM                    W2SØK
     C                   EXSR      SETMAX
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2KOD         ANDNE     0
     C     W2KOD         CHAIN     PAPA                               33
     C   33              GOTO      START
     C                   MOVE      W2KOD         UKOD
     C                   MOVEL     PPNAVN        UALFA
     C                   GOTO      SLUTT
     C                   END
     C     W2KOD         IFNE      0
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   EXSR      SETMAX
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C   98              GOTO      START3
     C                   GOTO      SLUTT
     C                   END
      *
     C     SLUTT         TAG
     C*                    SETON                     LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      PPNR          UKOD
     C                   MOVEL     WSNAVN        UALFA
     C                   GOTO      SLHENT
     C                   END
     C                   END
      *
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
      *
     C     SLHENT        ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     PAPAK         KLIST
     C                   KFLD                    W2KOD
     C     PAPA1K        KLIST
     C                   KFLD                    W2SØK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKOD              8 0
     C                   PARM                    UALFA            30
      *
     C                   CLEAR                   SUBCTL
     C                   CLEAR                   SUBFIL
     C                   CLEAR                   NYWRK
      *
     C                   MOVEL     UALFA         W2SØK
     C                   EXSR      SETMAX
     C     W2SØK         IFNE      *BLANKS
     C     UKOD          ANDEQ     *ZEROS
     C                   EXSR      SINGLE
     C                   END
      *
      *
     C                   WRITE     WINDOWSZ
     C*
     C                   ENDSR
     C***********************************************
     C     SINGLE        BEGSR
     C***********************************************
     C* ER DET KUN 1!! SOM MATCHER INGÅENDE SØKEBEGREP
     C*
     C     PAPA1K        SETLL     PAPAL01
     C                   READ      PAPAL01                                33
     C  N33PPALFA        COMP      W2SØK2                             33
     C  N33              DO
      * ETT MATCHENDE SØK ER FUNNET...
     C                   MOVE      PPNR          XNR               8 0
     C                   MOVE      PPNAVN        XNAVN            30
     C                   READ      PAPAL01                                33
     C  N33PPALFA        COMP      W2SØK2                             33
     C* HVIS ETT OG BARE ETT NAVN MATCHER - RETURNER MED DET.NR
     C   33              MOVE      XNR           UKOD
     C   33              MOVE      XNAVN         UALFA
     C   33              RETURN
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     SETMAX        BEGSR
     C***********************************************
     C                   MOVEL     W2SØK         W2SØK1            1
     C     W2SØK1        IFEQ      '*'
     C                   MOVEL     '99999999'    W2SØK2
     C                   ELSE
     C                   MOVE      W2SØK         W2SØK2
     C                   Z-ADD     10            NR                2 0
     C     STSMAX        TAG
     C     AL(NR)        IFEQ      ' '
     C                   MOVE      '9'           AL(NR)
     C                   SUB       1             NR
     C     NR            IFNE      0
     C                   GOTO      STSMAX
     C                   END
     C                   END
     C                   END
     C                   ENDSR
     C*
