      *
      ***********************************************************
      *** PROGRAM FOR REGENERERER STEDSREGISTER MED BASESTEDER **
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 42-88 95-97    ***
      ***********************************************************
     FSTEDI     IP   E           K DISK
     FSTED2D    UF   E           K DISK
     C     STICUS        IFEQ      *ZEROS
     C     MINKEY        KLIST
     C                   KFLD                    STINLK
     C                   KFLD                    STINPF
     C     MINKEY        SETLL     STED2D
     C     START         TAG
     C     STINLK        READE     STED2D                                 33
     C  N33ST2KOD        IFLE      STINPT
     C                   MOVE      STINBA        ST2KO2
     C                   UPDATE    STED2R
     C                   GOTO      START
     C                   END
     C  N33              UPDATE    STED2R
     C                   END
