      *
      *****************************************************************
      *** PROGRAM FOR PRISTABELLER FRAKR PÅ KUNDER                  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24
      *** LEDIGE INDIKATORER 29 31 32 35-39 41-66 71-87 95-97 99
      *****************************************************************
     FAVFRHL01  IF   E           K DISK
     FAVFRD     UF A E           K DISK
     FCUSTT     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSYPO10FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C                   EXSR      HENTST
     C*
     C     STAR0B        TAG
     C*
     C                   SETOFF                                       33
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2VEKT        YFVEKT            9 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     PRIKU         SETLL     AVFRD
     C     START1        TAG
     C     PRIKU         READE(N)  AVFRD                                  94
     C   94              MOVE      *ZEROS        AFVEKT
     C   94              MOVE      *BLANKS       WSNR
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        80
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     PRIKU         READE(N)  AVFRD                                  94
     C  N94              MOVE      AFVEKT        YFVEKT
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   Z-ADD     1             ZRECNO
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C                   SETOFF                                       9830
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05
     CANN27              DO
     C                   EXSR      RMIMA
     C                   GOTO      START
     C                   END
     C*** LAGE NY
     C   06
     CANN27              DO
     C                   MOVE      NUMTYP        WSCOBE
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     9             POSNBR
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94PRISK3        SETLL     AVFRD
     C  N94PRIKU         READE(N)  AVFRD                                  94
     C                   GOTO      START2
     C                   END
     C*
     C   27              GOTO      START3
     C     ZRECNO        IFEQ      0
     C                   GOTO      START3
     C                   ELSE
     C                   EXSR      HENT
     C     SLET          IFEQ      'Y'
     C                   EXSR      RMIMA
     C                   GOTO      START
     C                   END
     C   98              GOTO      START3
     C                   END
     C*
     C*
     C*** LAGE/ENDRE
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                       30
     C   03
     CAN 40              UPDATE    SUBFIL
     C   03              GOTO      SLUTT
     C   12              DO
     C   40              UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      START3
     C                   END
     C                   EXSR      TESTB1
     C   30              Z-ADD     22            LINNBR
     C   30              GOTO      START5
     C     NY            IFEQ      'J'
     C                   MOVE      NUMTYP        WSCOBE
     C                   GOTO      START5
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   EXFMT     VAREL2
     C   03              GOTO      SLUTT
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2VEKT        YFVEKT            9 0
     C     PRISKP        SETLL     AVFRD
     C                   GOTO      START1
     C*
     C     SLUTT         TAG
     C                   EXSR      RMIMA
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C     WSVEKT        COMP      0                                    8989
     C   89              MOVE      'SPV0002'     MSGNR
     C   89              Z-ADD     34            POSNBR
     C   89              SETON                                        30
     C   30              GOTO      SLTB1
     C                   END
      *
     C     WSCOBE        IFNE      'T'
     C     WSCOBE        ANDNE     'P'
     C     WSCOBE        ANDNE     'B'
     C                   MOVE      'SPC0007'     MSGNR
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     6             POSNBR
     C                   SETON                                        3088
     C                   END
      *
     C     WSCOBE        IFEQ      'P'
     C     WSCOBE        OREQ      'B'
     C     WSPRIA        IFGE      100
     C  N88              MOVE      'SPB0012'     MSGNR
     C  N88              Z-ADD     9             POSNBR
     C                   SETON                                        9030
     C                   END
     C                   END
     C*
     C   30              GOTO      SLTB1
     C*
     C     PRISK         CHAIN     AVFRD                              33
     C  N33
     CANN40              GOTO      SLTB1
     C                   EXSR      MOVWPR
     C  N33              UPDATE    AVFRDR
     C   33              WRITE     AVFRDR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C   40              MOVE      'N'           NY                1
     C  N40              MOVE      'J'           NY
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C*
     C     SLTB1         ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVE      'N'           SLET              1
     C                   MOVEA     '00'          *IN(91)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '2'
     C                   EXSR      MOVPRW
     C                   MOVE      ' '           WSNR
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     9             POSNBR
     C     STA5          TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '000'         *IN(88)
     C                   SETOFF                                       30
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   SETOFF                                       40
     C                   EXSR      MOVB2
     C                   GOTO      UTLØK
     C                   END
     C                   EXSR      TESTB1
     C   30              GOTO      STA5
     C                   GOTO      UTLØK
     C                   END
     C*
     C* DELETION
     C*
     C  N98WSNR          IFEQ      '4'
     C                   MOVE      ' '           WSNR
     C  N12              DO
     C                   MOVE      'Y'           SLET
     C     PRISK2        CHAIN     AVFRD                              33
     C  N33              DELETE    AVFRDR
     C                   EXSR      MOVB1
     C                   Z-ADD     0             AFVEKT
     C                   END
     C                   UPDATE    SUBFIL
     C                   END
     C     UTLØK         TAG
     C                   END
     C*
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWPR        BEGSR
     C***********************************************
     C                   MOVE      WSVEKT        AFVEKT
     C                   MOVE      WSPRPR        AFPRPR
     C                   MOVE      WSADJU        AFADJU
     C                   MOVE      WSPRIA        AFPRIA
     C                   MOVE      WSCOBE        AFCOBE
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVPRW        BEGSR
     C***********************************************
     C                   MOVE      AFVEKT        WSVEKT
     C                   MOVE      AFPRPR        WSPRPR
     C                   MOVE      AFADJU        WSADJU
     C                   MOVE      AFPRIA        WSPRIA
     C                   MOVE      AFCOBE        WSCOBE
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        AFVEKT
     C                   MOVE      *ZEROS        AFPRPR
     C                   MOVE      *ZEROS        AFADJU
     C                   MOVE      *ZEROS        AFPRIA
     C                   MOVE      *BLANKS       AFCOBE
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSVEKT
     C                   MOVE      *ZEROS        WSPRPR
     C                   MOVE      *ZEROS        WSADJU
     C                   MOVE      *ZEROS        WSPRIA
     C                   MOVE      *BLANKS       WSCOBE
     C                   ENDSR
     C*
     C***********************************************
     C     RMIMA         BEGSR
     C***********************************************
     C                   CALL      'SYPO12'
     C                   PARM                    AFAVNR
     C                   PARM                    AFCDE1
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    AFAVNR
     C                   PARM                    AFCDE1
     C                   PARM                    UFLAGG            1 0
     C                   PARM                    NUMTYP            1
     C                   PARM                    UFAVDE            4 0
     C     UFLAGG        COMP      1                                      27
      *
     C     NUMTYP        IFEQ      'P'
     C                   MOVE      *ON           *IN70
     C                   ENDIF
     C     AFCDE1        COMP      'H'                                696768
     C     PRIKU         KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C     PRISK         KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C                   KFLD                    WSVEKT
     C     PRISKP        KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C                   KFLD                    W2VEKT
     C     PRISK1        KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C                   KFLD                    AFVEKT
     C     PRISK2        KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C                   KFLD                    AFVEKT
     C     PRISK3        KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    AFCDE1
     C                   KFLD                    YFVEKT
     C*
     C     CUSTKU        KLIST
     C                   KFLD                    UUPROD            1
     C                   KFLD                    UUAVDE            4 0
     C*
     C     KUNKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    AFKUND
     C*
     C*
     C     AFAVNR        CHAIN     AVFRHL01                           33
     C*
     C                   READ      FIRM                                   33
     C     KUNKEY        CHAIN     CUNDL01                            33
     C                   ENDSR
     C*
     C***********************************************
     C     HENTST        BEGSR
     C***********************************************
     C     PRIKU         SETLL     AVFRD
     C     PRIKU         READE(N)  AVFRD                                  33
     C  N33              GOTO      UTSR
     C*
     C*   HENTER STANDARDVERDIER
     C*
     C*
     C                   MOVE      UFAVDE        UUAVDE
     C                   MOVE      AFPROD        UUPROD
      *
     C     CUSTKU        SETLL     CUSTT
     C     CUSTKU        READE     CUSTT                                  33
     C  N33CUSTKU        SETLL     CUSTT
     C   33              DO
     C                   MOVE      *ZEROS        UUAVDE
     C     CUSTKU        SETLL     CUSTT
     C     CUSTKU        READE     CUSTT                                  33
     C  N33CUSTKU        SETLL     CUSTT
     C                   END
     C   33              DO
     C                   MOVE      *BLANKS       UUPROD
     C     CUSTKU        SETLL     CUSTT
     C                   END
     C     STARTH        TAG
     C     CUSTKU        READE     CUSTT                                  33
     C  N33              DO
     C                   MOVE      PTVEKT        AFVEKT
     C                   MOVE      PTPRPR        AFPRPR
     C                   MOVE      PTADJU        AFADJU
     C                   MOVE      NUMTYP        AFCOBE
     C     PRISK2        CHAIN(N)  AVFRD                              34
     C   34              WRITE     AVFRDR
     C                   GOTO      STARTH
     C                   END
     C*
     C     UTSR          ENDSR
