     FAVFRHL01  UF   E           K DISK
     FAVFRDL01  UF   E           K DISK
      *
     C                   EXSR      INIT
      *
     C     AVFH1K        SETLL     AVFRHL01
     C     START         TAG
     C                   READ      AVFRHL01                               33
     C   33              GOTO      SLUTT
      *
     C                   Z-ADD     2500          AFGREN
     C                   UPDATE    AVFRHR
     C*
     C                   SETOFF                                       34
     C     AVFD1K        SETLL     AVFRDL01
     C     START2        TAG
     C     AVFD1K        READE     AVFRDL01                               34
     C   34              GOTO      START3
     C     AFCOBE        IFEQ      ' '
     C                   MOVE      'T'           AFCOBE
     C                   UPDATE    AVFRDR
     C                   END
     C                   GOTO      START2
      *
     C     START3        TAG
     C     AFBFR1        IFEQ      'T'
     C                   MOVE      'F'           YCDE1             1
     C                   CALL      'SYPO12'
     C                   PARM                    AFAVNR
     C                   PARM                    YCDE1
     C                   END
     C     AFBFR2        IFEQ      'T'
     C                   MOVE      'V'           YCDE1
     C                   CALL      'SYPO12'
     C                   PARM                    AFAVNR
     C                   PARM                    YCDE1
     C                   END
     C     AFBFRA        IFEQ      'T'
     C                   MOVE      'H'           YCDE1
     C                   CALL      'SYPO12'
     C                   PARM                    AFAVNR
     C                   PARM                    YCDE1
     C                   END
     C                   GOTO      START
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     AVFH1K        KLIST
     C                   KFLD                    AFAVNR
     C     AVFD1K        KLIST
     C                   KFLD                    AFAVNR
      *
     C                   ENDSR
      *
