      *
      *****************************************************************
      * PROGRAM FLTTER NYE AVTALER TIL AKTIVE                         *
      *****************************************************************
      *
     FAVFRHL01  UF A E           K DISK
     FAVFRHN01  IF   E           K DISK
     F                                     RENAME(AVFRHR:AVFRHN1)
     FAVFRD     UF A E           K DISK
     FAVFRHN    IP   E           K DISK
     F                                     RENAME(AVFRHR:AVFRHRN)
     FAVFRDN    IF   E           K DISK
     F                                     RENAME(AVFRDR:AVFRDRN)
      *
      *
     C     AFAVNR        CHAIN     AVFRHL01                           33
     C  N33AFAVNR        CHAIN     AVFRHN01                           34
     C  N33
     CANN34              UPDATE    AVFRHR
     C   33              WRITE     AVFRHR
      *
     C     AFBFR1        IFEQ      'T'
     C                   MOVE      'F'           DELKOD
     C                   EXSR      CHGTAB
     C                   END
      *
     C     AFBFRA        IFEQ      'T'
     C                   MOVE      'H'           DELKOD
     C                   EXSR      CHGTAB
     C                   END
      *
     C     AFBFR2        IFEQ      'T'
     C                   MOVE      'V'           DELKOD
     C                   EXSR      CHGTAB
     C                   END
      *
     C***********************************************
     C     CHGTAB        BEGSR
     C***********************************************
     C     CHGKEY        KLIST
     C                   KFLD                    AFAVNR
     C                   KFLD                    DELKOD            1
      *
      * BEHANDLING AV DETALJREGISTER
      *
      * FJERNER GAMLE FORHØYELSER
      *
     C     CHGKEY        SETLL     AVFRD
     C     STCHG0        TAG
     C     CHGKEY        READE     AVFRD                                  33
     C  N33              DELETE    AVFRDR
     C  N33              GOTO      STCHG0
      *
      * LEGGER INN NYE FORHØYELSER
      *
     C     CHGKEY        SETLL     AVFRDN
     C     STCHG         TAG
     C     CHGKEY        READE     AVFRDN                                 33
     C  N33              WRITE     AVFRDR
     C  N33              GOTO      STCHG
      *
     C                   ENDSR
      *
