********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 kan nå kalles i batch
********************************************************************
S01  F*YPRODFT  CF   E             WORKSTN
S01  FSYPRODFT  CF   E             WORKSTN USROPN
     FSYPROD    IF   E           K DISK
     FFIRM      IF   E             DISK
     D                 DS
     D  PRTX2                  1    256
     D  WSTXA                  1     70
     D  WSTXB                 71    140
     D  WSTXC                141    210
     D  WSTXD                211    280
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUKOD            15
     C                   PARM                    UFLAGG            1 0
     C                   MOVE      *ZEROS        UFLAGG
     C     UUKOD         CHAIN     SYPROD                             33
     C     *IN33         IFEQ      '0'
     C     PRINST        ANDEQ     'N'
     C                   Z-ADD     1             UFLAGG
     C     1             CHAIN     FIRM                               34
     C     *IN34         IFEQ      '0'
     C     FILAND        ANDNE     'NO'
     C                   MOVE      PRTX1E        PRTX1
     C                   MOVE      PRTX2E        PRTX2
     C                   END
N01  C                   OPEN      SYPRODFT
     C                   WRITE     WINDOWSZ
     C                   EXFMT     BILDE
N01  C                   CLOSE     SYPRODFT
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
