      *
      *****************************************************************
      *** PROGRAM SKAL VISE BOOKING (DEL-2)                         ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 02 04-11 13-26                         ***
      *** LEDIGE INDIKATORER 27-32 34-99                            ***
      *****************************************************************
      *
     FBOOKING   IF   E           K DISK
     FBOOKIN2   IF   E           K DISK
     FSYSJ52FC  CF   E             WORKSTN
     D                 DS
     D  BODTRÅ                 1      4  0
     D  BODTRM                 5      6  0
     D  BODTRD                 7      8  0
     D  BODTR                  1      8  0
     D                 DS
     D  WSDTRD                 1      2  0
     D  WSDTRM                 3      4  0
     D  WSDTRÅ                 5      6  0
     D  WSDTR                  1      6  0
     D                UDS
     D  UFIRM                  1      2
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C*
     C   01
     COR 03
     COR 12              GOTO      SLUTT
     C                   Z-ADD     0             UFLAGG
     C*
     C     SLUTT         TAG
     C   01              Z-ADD     1             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     9             UFLAGG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     BOOKK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     BOOK2K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAGG            1 0
     C*
     C                   MOVE      *ZEROS        WSDTR
     C                   MOVE      *ZEROS        BODTR
     C*
     C     BOOKK         CHAIN     BOOKING                            33
     C  N33              EXSR      KDTFMT
     C     BOOK2K        CHAIN     BOOKIN2                            33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      BODTRD        UDT1              2 0
     C                   MOVE      BODTRM        UDT2              2 0
     C                   MOVE      BODTRÅ        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTRD
     C                   MOVE      UDT2          WSDTRM
     C                   MOVE      UDT3          WSDTRÅ
     C*
     C                   ENDSR
     C*
