      *
      ***************************************************************
      *** PROGRAM SKAL HENTE OPPLYSNINGER FOR Å SKRIVE ADVISERING ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER        ***
      *** LEDIGE INDIKATORER 01 02 04-26                          ***
      *** LEDIGE INDIKATORER 27-29 31-96                          ***
      ***************************************************************
      *
     FFIRM      IF   E           K DISK
     FMULTKODT  IF   E           K DISK
     FSYSJADFM  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     C*
     C     KODTPK        KLIST
     C                   KFLD                    YPUNI
     C                   KFLD                    WSAVD
     C                   KFLD                    YPLNR
     C     KODTWK        KLIST
     C                   KFLD                    YWUNI
     C                   KFLD                    WSAVD
     C     KODTVK        KLIST
     C                   KFLD                    YVUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    YFUNI
     C                   KFLD                    WSSG
     C*
     C*===============================================
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    UOPDF             7 0
     C                   PARM                    UOPDT             7 0
     C                   PARM                    UPRT31           10
     C                   PARM                    UPT31            10
     C                   PARM                    UJBK              1
     C                   PARM                    UFAX              1
     C                   PARM                    UCVP              1
     C*===============================================
     C*
     C     UFAX          COMP      ' '                                    27
     C   27UCVP          COMP      ' '                                    28
     C                   MOVE      'P'           YPUNI             1
     C                   MOVE      'W'           YWUNI             1
     C                   MOVE      'V'           YVUNI             1
     C                   MOVE      'SF'          YFUNI             2
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C                   MOVE      'J'           WSJBK
     C                   MOVE      'N'           WSFAX
     C                   MOVE      'N'           WSCVP
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   99
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C                   MOVEA     '000'         *IN(97)
     C                   SETOFF                                       30
     C*
     C* TESTER DATA PÅ BILDE
     C*
     C     KODTVK        CHAIN     KOVR                               99
     C  N99KODTWK        CHAIN     KOWR                               99
     C  N99              Z-ADD     31            YPLNR             3 0
     C  N99KODTPK        CHAIN     KOPR                               99
     C  N99              MOVE      KOPNVN        UPRT31
     C  N99              MOVE      KOPTY         UPT31
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C*
     C     WSSG          IFNE      'ALL'
     C     KODSFK        CHAIN     KOSFR                              98
     C                   END
     C   98
     CANN30              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C*
     C     WSOPDF        COMP      0                                    9797
     C   97
     CANN30              MOVE      'SPO0016'     MSGNR
     C  N97WSOPDT        IFEQ      0
     C                   MOVE      WSOPDF        WSOPDT
     C                   ELSE
     C     WSOPDF        COMP      WSOPDT                             97
     C   97
     CANN30              MOVE      'SPO0102'     MSGNR
     C                   END
     C   97              SETON                                        30
     C*
     C   30              GOTO      START
     C*
     C     WSPRT         IFNE      *BLANKS
     C                   MOVE      WSPRT         UPRT31
     C                   END
     C     UPRT31        IFEQ      *BLANKS
     C                   MOVEL     'QPRINT '     UPRT31
     C                   END
     C     UPT31         IFEQ      *BLANKS
     C                   MOVEL     '*STD'        UPT31
     C                   END
     C                   MOVE      WSOPDF        UOPDF
     C                   MOVE      WSOPDT        UOPDT
     C     WSFAX         IFEQ      'J'
     C                   MOVE      'N'           UJBK
     C                   MOVE      WSFAX         UFAX
     C                   MOVE      WSCVP         UCVP
     C                   ELSE
     C                   MOVE      WSJBK         UJBK
     C                   MOVE      'N'           UFAX
     C                   MOVE      'N'           UCVP
     C                   END
     C                   MOVE      WSSG          USG
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
