      *
      ***********************************************************
      *** PROGRAM SKAL SKRIVE UT MANIFEST                     ***
      ***           MANIFEST                                  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01-26                            ***
      *** LEDIGE INDIKATORER 29-48 53-59 64-99                ***
      ***********************************************************
      *
     FKODTA     IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSTED2     IF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FBLV1LF    IF   E           K DISK
     FBLV2LF    IF   E           K DISK
     FBILLOFL3  IF   E           K DISK
     FBILLOFL4  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF4L)
     FBILLOFL9  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF9L)
     FFRMDOC    IF   E           K DISK
     FFRMDOC1   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYSJ27P   O    E             PRINTER OFLIND(*IN51)
     FSYSJ27P2  O    E             PRINTER OFLIND(*IN52)
     FSYSJ27PF  O    E             PRINTER OFLIND(*IN49)
     D FT              S             30    DIM(13)
     D KU              S              7  4 DIM(13)
     D VA              S              3    DIM(13)
     D PR              S             13  2 DIM(13)
     D CO              S             13  2 DIM(13)
      *
     D                 DS
     D  XMN1                   1     17
     D  XMN2                  18     34
     D  MN                     1   1700
     D                                     DIM(100)
     D                 DS
     D  XAN1                   1      5  0
     D  XAN2                   6     10  0
     D  AN                     1    500  0
     D                                     DIM(100)
     D                 DS
     D  XTX1                   1     51
     D  XTX2                  52    102
     D  TX                     1   5100
     D                                     DIM(100)
     D                 DS
     D  XVK1                   1      9  0
     D  XVK2                  10     18  0
     D  VK                     1    900  0
     D                                     DIM(100)
     D                 DS
     D  XM31                   1      9  3
     D  XM32                  10     18  3
     D  M3                     1    900  3
     D                                     DIM(100)
     D                 DS
     D  BLNAA                  1     30
     D  BLAD1A                31     60
     D  BLAD2A                61     90
     D  BLAD3A                91    120
     D  BLNAM                121    150
     D  BLAD1M               151    180
     D  BLAD2M               181    210
     D  BLAD3M               211    240
     D  BLNAN                241    270
     D  BLAD1N               271    300
     D  BLAD2N               301    330
     D  BLAD3N               331    360
     D  KN                     1    360
     D                                     DIM(12)
     D                 DS
     D  XIDAGD                 1      2  0
     D  XIDAGM                 3      4  0
     D  XIDAGÅ                 5      6  0
     D  XIDAG                  1      6  0
     D                 DS
     D  XDTD                   1      2  0
     D  XDTM                   3      4  0
     D  XDTÅ                   5      6  0
     D  XDT                    1      6  0
     D                 DS
     D  XKOL1                  1     10
     D  XKOL1A                 1      8
     D                 DS
     D  UAVDA                  1      4
     D  UBK                    5      9
     D  UREIS                 11     24
     D  UDTA                  25     30
     D  LSH                   31     55
     D                                     DIM(5)
     D  LOH                   56    105
     D                                     DIM(10)
     D  UNAVN                106    135
     D  UFAX                 136    136
     D  XPAR1                  1    256
     C*
     C                   EXSR      INIT
     C*
     C     START0        TAG
     C                   Z-ADD     0             XCSIDE            2 0
     C                   Z-ADD     0             XFSIDE            2 0
     C     1             DO        5             XN                2 0          1<-B
     C     LSH(XN)       IFNE      *BLANKS                                       2<-B
     C     LSH(XN)       CHAIN     STED2                              60
     C                   MOVE      ST2NVN        XLSHN            30
     C*
     C     1             DO        10            X0                2 0            3<-B
     C     LOH(X0)       IFNE      *BLANKS                                         4<-B
     C     LOH(X0)       CHAIN     STED2                              60
     C                   MOVE      ST2NVN        XLOHN            30
     C                   MOVE      *ZEROS        XTOTAN
     C                   MOVE      *ZEROS        XTOTVK
     C                   MOVE      *ZEROS        XTOTM3
     C                   MOVE      *ZEROS        XTOTPP
     C                   MOVE      *ZEROS        XTOTCC
     C                   MOVE      *BLANKS       XVALUT
     C                   MOVEA     '00'          *IN(62)
     C                   MOVE      'J'           XINGEN            1
     C     BILLLK        SETLL     BILLOFL4
     C                   SETOFF                                       60
     C  N27              SETON                                        5152
     C   27              SETON                                        49
     C*
     C     START         TAG
     C  N62
     CANN63BILLLK        READE     BILLOFL4                               60
     C   62
     CANN63BILLLK        READE     BILLOFL3                               60
     C   62
     CAN 63BILLLK        READE     BILLOFL9                               60
     C  N62
     CANN63*IN60         IFEQ      '1'                                              5<-B
     C                   MOVE      '1'           *IN62
     C                   MOVE      '0'           *IN60
     C     BILLLK        SETLL     BILLOFL3
     C                   GOTO      START
     C                   END
     C   62
     CANN63*IN60         IFEQ      '1'                                              5<-B
     C                   MOVE      '1'           *IN63
     C                   MOVE      '0'           *IN60
     C     BILLLK        SETLL     BILLOFL9
     C                   GOTO      START
     C                   END
     C   60XINGEN        IFEQ      'J'
     C                   GOTO      START3
     C                   ELSE
     C                   GOTO      START2
     C                   END
     C     BLST          IFNE      ' '                                              5<-B
     C     BLST          ANDNE     'P'
     C     BLST          ANDNE     'X'
     C                   GOTO      START
     C                   END                                                        5<-E
     C   50UREIS         IFNE      BLREIS                                           5<-B
     C                   GOTO      START
     C                   END                                                        5<-E
     C                   SELECT                                                     5<-B
     C     *IN62         WHENEQ    '0'
     C     *IN63         ANDEQ     '0'
     C     LSH(XN)       CABNE     BLLSH         START
     C     LOH(X0)       CABNE     BLVH          START
     C     *IN63         WHENEQ    '0'
     C     BLVH          CABNE     *BLANKS       START
     C     LSH(XN)       CABNE     BLLSH         START
     C     LOH(X0)       CABNE     BLLOH         START
     C                   OTHER
     C     BLVH          CABEQ     *BLANKS       START
     C     LSH(XN)       CABNE     BLVH          START
     C     LOH(X0)       CABNE     BLLOH         START
     C                   ENDSL                                                      5<-E
     C                   MOVE      'N'           XINGEN
     C*
     C     *IN51         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     HCARGO
     C                   SETOFF                                       51
     C                   END
     C     *IN52         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     HFRAKT
     C                   SETOFF                                       52
     C                   END
     C     *IN49         IFEQ      '1'
     C     *IN28         IFEQ      '0'
     C                   ADD       1             XCSIDE
     C                   WRITE     FHCARGO
     C                   ELSE
     C                   ADD       1             XFSIDE
     C                   WRITE     FHFRAKT
     C                   END
     C                   MOVE      '0'           *IN49
     C                   END
     C*
     C                   EXSR      HENTBV
     C  N27
     COR 27
     CANN28              EXSR      PCARGO
     C  N27
     COR 27
     CAN 28              EXSR      PFRAKT
     C                   GOTO      START
     C*
     C     START2        TAG
     C     *IN51         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     HCARGO
     C                   SETOFF                                       51
     C                   END
     C     *IN52         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     HFRAKT
     C                   SETOFF                                       52
     C                   END
     C     *IN49         IFEQ      '1'
     C     *IN28         IFEQ      '0'
     C                   ADD       1             XCSIDE
     C                   WRITE     FHCARGO
     C                   ELSE
     C                   ADD       1             XFSIDE
     C                   WRITE     FHFRAKT
     C                   END
     C                   MOVE      '0'           *IN49
     C                   END
     C  N27              WRITE     TCARGO
     C   27
     CANN28              WRITE     FTCARGO
     C     XVALUT        IFEQ      '999'
     C                   MOVE      *BLANKS       XVALUT
     C                   MOVE      *ZEROS        XTOTPP
     C                   MOVE      *ZEROS        XTOTCC
     C                   END
     C  N27              WRITE     TFRAKT
     C   27
     CAN 28              WRITE     FTFRAKT
     C     START3        TAG
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C*
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C     *IN27         IFEQ      '1'
     C     *IN28         ANDEQ     '0'
     C                   MOVE      '1'           *IN28
     C                   GOTO      START0
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C******************************************
     C     HENTBV        BEGSR
     C******************************************
     C*** LES MODELL 1
     C     BLV1K         SETLL     BLV1LF
     C                   MOVE      *BLANKS       MN
     C                   MOVE      *BLANKS       TX
     C                   MOVE      *ZEROS        AN
     C                   MOVE      *ZEROS        VK
     C                   MOVE      *ZEROS        M3
     C                   MOVE      *ZEROS        N1                2 0
     C                   SETOFF                                       61
     C     STHBV1        TAG
     C     BLV1K         READE     BLV1LF                                 61
     C  N61              DO
     C                   ADD       1             N1
     C                   MOVE      BVMN          MN(N1)
     C                   MOVE      BVNT          AN(N1)
     C                   ADD       BVNT          XTOTAN
     C                   MOVEL     BVVS          TX(N1)
     C                   MOVE      BVVKT         VK(N1)
     C                   ADD       BVVKT         XTOTVK
     C                   MOVE      BVM3          M3(N1)
     C                   ADD       BVM3          XTOTM3
     C                   END
     C  N61              GOTO      STHBV1
     C                   Z-ADD     N1            N2                2 0
     C*
     C*** LES MODELL 2  (MERKE & NR.)
     C     BLV2K         SETLL     BLV2LF
     C                   SETOFF                                       61
     C     STHBV2        TAG
     C     BLV2K         READE     BLV2LF                                 61
     C  N61BVMN          IFNE      *BLANKS
     C                   ADD       1             N1
     C                   MOVE      BVMN          MN(N1)
     C                   END
     C  N61              GOTO      STHBV2
     C*
     C*** LES MODELL 2
     C     BLV2K         SETLL     BLV2LF
     C                   SETOFF                                       61
     C     STHBV3        TAG
     C     BLV2K         READE     BLV2LF                                 61
     C  N61BVFT          IFNE      *BLANKS
     C                   ADD       1             N2
     C                   MOVE      BVFT          TX(N2)
     C                   END
     C  N61              GOTO      STHBV3
     C*
     C     N2            IFGT      N1
     C                   Z-ADD     N2            N1
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PCARGO        BEGSR
     C******************************************
     C                   EXSR      CGENV1
     C                   Z-ADD     2             X2                2 0
     C     *IN51         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     HCARGO
     C                   SETOFF                                       51
     C                   END
     C     *IN49         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     FHCARGO
     C                   MOVE      '0'           *IN49
     C                   END
     C  N27              WRITE     DCARGO
     C   27              WRITE     FDCARGO
     C*
     C     STPC          TAG
     C                   EXSR      CGENV2
     C                   ADD       1             X2
     C     X1            IFGT      12
     C     X2            ANDGT     N1
     C                   GOTO      SLPC
     C                   END
     C     *IN51         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     HCARGO
     C                   SETOFF                                       51
     C                   END
     C     *IN49         IFEQ      '1'
     C                   ADD       1             XCSIDE
     C                   WRITE     FHCARGO
     C                   MOVE      '0'           *IN49
     C                   END
     C                   MOVE      MN(X2)        XMN
     C                   MOVE      AN(X2)        XAN
     C                   MOVE      TX(X2)        XTX
     C                   MOVE      VK(X2)        XVK
     C                   MOVE      M3(X2)        XM3
     C  N27              WRITE     DCARG2
     C   27              WRITE     FDCARG2
     C     X1            IFGE      12
     C     X2            ANDGE     N1
     C                   GOTO      SLPC
     C                   END
     C                   GOTO      STPC
     C*
     C     SLPC          TAG
     C  N27              WRITE     BCARGO
     C   27              WRITE     FBCARGO
     C*
     C                   ENDSR
     C*
     C***************************************************
     C     CGENV1        BEGSR
     C***************************************************
     C                   Z-ADD     0             X1                2 0
     C                   MOVE      *BLANKS       XKOL1            10
     C                   MOVE      *ZEROS        XKOL12            1 0
     C                   MOVE      *BLANKS       XKOL2            30
     C                   MOVE      *BLANKS       XKOL22           30
     C*
     C     X1            DOWLT     4                                            1<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                       2<-B
     C                   MOVE      XSHIPP        XKOL1
     C                   Z-ADD     1             XKOL12
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      STCN11
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     STCN11        TAG
     C     X1            IFLT      4                                            1<-B
     C     X1            DOWLT     4                                             2<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                        3<-B
     C                   MOVE      KN(X1)        XKOL22
     C                   GOTO      SLCN1
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C     X1            DOWLT     8                                             2<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                        3<-B
     C                   MOVE      XCONSI        XKOL1
     C                   Z-ADD     2             XKOL12
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      STCN12
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     STCN12        TAG
     C     X1            IFLT      8                                            1<-B
     C     X1            DOWLT     8                                             2<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                        3<-B
     C                   MOVE      KN(X1)        XKOL22
     C                   GOTO      SLCN1
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C     X1            DOWLT     12                                            2<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                        3<-B
     C                   MOVE      XNOTIF        XKOL1
     C                   Z-ADD     3             XKOL12
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      STCN13
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     STCN13        TAG
     C     X1            DOWLT     12                                           1<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                       2<-B
     C                   MOVE      KN(X1)        XKOL22
     C                   GOTO      SLCN1
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     SLCN1         ENDSR
     C*
     C***************************************************
     C     CGENV2        BEGSR
     C***************************************************
     C                   MOVE      *BLANKS       XKOL1            10
     C                   MOVE      *BLANKS       XKOL2            30
     C*
     C     X1            DOWLT     4                                            1<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                       2<-B
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      SLCN2
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     X1            DOWLT     8                                            1<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                       2<-B
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      SLCN2
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     X1            DOWLT     12                                           1<-B
     C                   ADD       1             X1
     C     KN(X1)        IFNE      *BLANKS                                       2<-B
     C                   MOVE      KN(X1)        XKOL2
     C                   GOTO      SLCN2
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C     SLCN2         TAG
     C     X1            IFGT      4                                            1<-B
     C     X1            IFLE      8                                             2<-B
     C     XKOL12        IFLT      2                                              3<-B
     C                   MOVE      XCONSI        XKOL1
     C                   Z-ADD     2             XKOL12
     C                   END                                                      3<-E
     C                   ELSE                                                    2
     C     X1            IFLE      12                                             3<-B
     C     XKOL12        ANDLT     3
     C                   MOVE      XNOTIF        XKOL1
     C                   Z-ADD     3             XKOL12
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PFRAKT        BEGSR
     C******************************************
     C                   EXSR      MOVB1
     C     FRMDK         CHAIN     FRMDOC                             61
     C  N61              DO
     C     FRMD1K        SETLL     FRMDOC1
     C     STPF1         TAG
     C     FRMD1K        READE     FRMDOC1                                61
     C  N61              EXSR      MOVFW1
     C  N61              GOTO      STPF1
     C                   SETOFF                                       61
     C                   END
      *
     C                   EXSR      PGEFR1
     C                   Z-ADD     2             X3                2 0
     C     *IN52         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     HFRAKT
     C                   SETOFF                                       52
     C                   END
     C     *IN49         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     FHFRAKT
     C                   MOVE      '0'           *IN49
     C                   END
     C  N27              WRITE     DFRAKT
     C   27              WRITE     FDFRAKT
     C                   MOVEL     XTXT          XKOL1
     C*
     C     STPF          TAG
     C                   EXSR      PGEFR2
     C                   ADD       1             X3
     C     X1            IFGT      10
     C     X3            ANDGE     N2
     C                   GOTO      SLPF
     C                   END
     C     *IN52         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     HFRAKT
     C                   SETOFF                                       52
     C                   END
     C     *IN49         IFEQ      '1'
     C                   ADD       1             XFSIDE
     C                   WRITE     FHFRAKT
     C                   MOVE      '0'           *IN49
     C                   END
     C                   MOVE      MN(X3)        XMN
     C                   MOVE      AN(X3)        XAN
     C                   MOVE      TX(X3)        XTX
     C                   MOVE      VK(X3)        XVK
     C                   MOVE      M3(X3)        XM3
     C  N27              WRITE     DFRAK2
     C   27              WRITE     FDFRAK2
     C     X1            IFGE      10
     C     X3            ANDGE     N2
     C                   GOTO      SLPF
     C                   END
     C                   MOVE      *BLANKS       XKOL1
     C                   GOTO      STPF
     C*
     C     SLPF          TAG
     C  N27              WRITE     BFRAKT
     C   27              WRITE     FBFRAKT
     C*
     C                   ENDSR
     C*
     C******************************************
     C     MOVFW1        BEGSR
     C******************************************
     C                   MOVE      FMLN          X4                2 0
     C                   MOVE      FMFT1         FT(X4)
     C                   MOVE      FMKU1         KU(X4)
     C                   MOVE      FMVA1         VA(X4)
     C                   MOVE      FMPR1         PR(X4)
     C                   MOVE      FMCO1         CO(X4)
     C*
     C                   ENDSR
     C*
     C***************************************************
     C     PGEFR1        BEGSR
     C***************************************************
     C  N61              Z-ADD     0             X1
     C   61              Z-ADD     10            X1
     C                   MOVE      *BLANKS       XKOL2
     C                   MOVE      *BLANKS       XKOL22
     C                   MOVE      *ZEROS        XKOL3
     C                   MOVE      *ZEROS        XKOL32
     C                   MOVE      *BLANKS       XKOL4
     C                   MOVE      *BLANKS       XKOL42
     C                   MOVE      *ZEROS        XKOL5
     C                   MOVE      *ZEROS        XKOL52
     C                   MOVE      *ZEROS        XKOL6
     C                   MOVE      *ZEROS        XKOL62
     C*
     C     X1            DOWLT     10                                           1<-B
     C                   ADD       1             X1
     C     FT(X1)        IFEQ      *BLANKS                                       2<-B
     C     PR(X1)        ANDEQ     *ZEROS
     C     CO(X1)        ANDEQ     *ZEROS
     C                   GOTO      STFF11
     C                   END                                                     2<-E
     C                   MOVE      FT(X1)        XKOL2
      *
     C                   MOVE      PR(X1)        XKOL3
     C                   MOVE      CO(X1)        XKOL6
     C     XVALUT        IFNE      '999'
     C     XVALUT        IFEQ      *BLANKS
     C                   MOVE      VA(X1)        XVALUT
     C                   ELSE
     C     XVALUT        IFNE      VA(X1)
     C                   MOVE      '999'         XVALUT
     C                   END
     C                   END
     C                   END
      *
     C                   ADD       XKOL3         XTOTPP
     C                   ADD       XKOL6         XTOTCC
     C                   GOTO      STFF12
     C     STFF11        TAG
     C                   END                                                    1<-E
     C*
     C     STFF12        TAG
     C     X1            DOWLT     10                                           1<-B
     C                   ADD       1             X1
     C     FT(X1)        IFEQ      *BLANKS                                       2<-B
     C     PR(X1)        ANDEQ     *ZEROS
     C     CO(X1)        ANDEQ     *ZEROS
     C                   GOTO      STFF13
     C                   END                                                     2<-E
     C                   MOVE      FT(X1)        XKOL22
      *
     C                   MOVE      PR(X1)        XKOL32
     C                   MOVE      CO(X1)        XKOL62
     C     XVALUT        IFNE      '999'
     C     XVALUT        IFEQ      *BLANKS
     C                   MOVE      VA(X1)        XVALUT
     C                   ELSE
     C     XVALUT        IFNE      VA(X1)
     C                   MOVE      '999'         XVALUT
     C                   END
     C                   END
     C                   END
      *
     C                   ADD       XKOL32        XTOTPP
     C                   ADD       XKOL62        XTOTCC
     C                   GOTO      SLFF1
     C     STFF13        TAG
     C                   END                                                    1<-E
     C*
     C     SLFF1         ENDSR
     C*
     C***************************************************
     C     PGEFR2        BEGSR
     C***************************************************
     C                   MOVE      *BLANKS       XKOL1
     C     STPG2         TAG
     C*
     C                   MOVE      *BLANKS       XKOL2
     C                   MOVE      *ZEROS        XKOL3
     C                   MOVE      *BLANKS       XKOL4
     C                   MOVE      *ZEROS        XKOL5
     C                   MOVE      *ZEROS        XKOL6
     C*
     C     X1            DOWLT     10                                           1<-B
     C                   ADD       1             X1
     C     FT(X1)        IFEQ      *BLANKS                                       2<-B
     C     PR(X1)        ANDEQ     *ZEROS
     C     CO(X1)        ANDEQ     *ZEROS
     C                   GOTO      STFF21
     C                   END                                                     2<-E
     C                   MOVE      FT(X1)        XKOL2
      *
     C                   MOVE      PR(X1)        XKOL3
     C                   MOVE      CO(X1)        XKOL6
     C     XVALUT        IFNE      '999'
     C     XVALUT        IFEQ      *BLANKS
     C                   MOVE      VA(X1)        XVALUT
     C                   ELSE
     C     XVALUT        IFNE      VA(X1)
     C                   MOVE      '999'         XVALUT
     C                   END
     C                   END
     C                   END
      *
     C                   ADD       XKOL3         XTOTPP
     C                   ADD       XKOL6         XTOTCC
     C                   GOTO      SLFF2
     C     STFF21        TAG
     C                   END                                                    1<-E
     C*
     C     SLFF2         ENDSR
     C*
     C******************************************
     C     MOVB1         BEGSR
     C******************************************
     C                   MOVE      *BLANKS       FT
     C                   MOVE      *ZEROS        KU
     C                   MOVE      *BLANKS       VA
     C                   MOVE      *ZEROS        PR
     C                   MOVE      *ZEROS        CO
     C*
     C                   ENDSR
     C*
     C******************************************
     C     INIT          BEGSR
     C******************************************
     C     BILLK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    BLOPD
     C     BILLLK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UBK
     C                   KFLD                    UDT8
     C     BLV1K         KLIST
     C                   KFLD                    BLAVD
     C                   KFLD                    BLOPD
     C     BLV2K         KLIST
     C                   KFLD                    BLAVD
     C                   KFLD                    BLOPD
     C     FRMDK         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    BLOPD
     C     FRMD1K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    BLOPD
     C*
     C     *ENTRY        PLIST
     C     XPAR1         PARM                    UPAR1           256
     C                   MOVE      UAVDA         UAVD              4 0
     C                   MOVE      UDTA          UDT               6 0
     C     UDT           IFGT      501231
     C     UDT           ADD       19000000      UDT8              8 0
     C                   ELSE
     C     UDT           ADD       20000000      UDT8
     C                   END
     C     UREIS         COMP      *BLANKS                            5050
     C     UFAX          COMP      'J'                                    27
     C*
     C     KODTAK        KLIST
     C                   KFLD                    WSAUNI
     C                   KFLD                    UAVD
     C*
     C                   MOVE      'A'           WSAUNI            1
     C*
     C     FIFIRM        SETLL     FIRM                               33
     C                   READ      FIRM                                   33
     C     KODTAK        CHAIN     KODTA                              33
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C                   MOVE      UDT           XMMDD             4 0
     C                   MOVE      XMMDD         UDT1              2 0
     C                   MOVEL     XMMDD         UDT2              2 0
     C                   MOVEL     UDT           UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          XDTD
     C                   MOVE      UDT2          XDTM
     C                   MOVE      UDT3          XDTÅ
     C                   MOVE      UDAY          UDT1              2 0
     C                   MOVE      UMONTH        UDT2              2 0
     C                   MOVE      UYEAR         UDT3              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT1          XIDAGD
     C                   MOVE      UDT2          XIDAGM
     C                   MOVE      UDT3          XIDAGÅ
     C*
     C                   MOVE      'DIV3646'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          XSHIPP           10
     C                   MOVE      'DIV3647'     XMSGNR
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          XCONSI           10
     C                   MOVE      'DIV3648'     XMSGNR
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          XNOTIF           10
     C                   MOVE      'DIV3649'     XMSGNR
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          XTXT             10
     C                   MOVEL     XMSG          XTXT2             8
     C*
     C                   EXSR      MOVB1
     C                   MOVE      *BLANKS       MN
     C                   MOVE      *ZEROS        AN
     C                   MOVE      *BLANKS       TX
     C                   MOVE      *ZEROS        VK
     C                   MOVE      *ZEROS        M3
     C                   MOVE      *BLANKS       KN
     C*
     C     UBK           CHAIN     CDBOAT                             60
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             10
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
