********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 negative rater     .....
********************************************************************
      *
      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE FRAKTAVTALER (CONTAINER)
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER
      *** LEDIGE INDIKATORER 01 02 07 09-11 13-20 22-24
      *** LEDIGE INDIKATORER 32 37-39 48-60 65-79 82 95-97
      ***********************************************************
     FKODTVA    IF   E           K DISK
     FKODTFR    IF   E           K DISK
     FKODTOTY   IF   E           K DISK
     FSTED2     IF   E           K DISK
     FCDCON4    IF   E           K DISK
     FCFRAT     UF A E           K DISK
     FCFRATFRA  IF   E           K DISK
     F                                     RENAME(CFRATR:CFRATRFR)
     FCFRATTIL  UF   E           K DISK
     F                                     RENAME(CFRATR:CFRATRTI)
     FCFRATCT   IF   E           K DISK
     F                                     RENAME(CFRATR:CFRATRCT)
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSYSJ36FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     SFILE(SUBFIL2:ZRECN2)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *
     C                   EXSR      INIT
      *
     C     START0        TAG
     C  N04              Z-ADD     5             LINNBR
     C  N04              Z-ADD     25            POSNBR
     C                   EXFMT     BILDE01
     C                   MOVE      '0'           *IN99
     C                   MOVE      '0'           *IN30
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
     C   03              GOTO      SLUTT
     C   04              DO
     C                   EXSR      SØKDT0
     C                   GOTO      START0
     C                   END
      *
     C     WSKNR         IFEQ      0
     C                   MOVE      '0'           *IN27
     C                   ELSE
     C     CUND1K        CHAIN     CUNDL01                            99
     C   99              MOVE      'SPK0001'     MSGNR
     C   99              MOVE      '1'           *IN30
     C   30              GOTO      START0
     C                   MOVE      '1'           *IN27
     C                   END
      *
     C     WSFRA         COMP      *BLANKS                            3434
     C  N34WSTIL         COMP      *BLANKS                            3535
     C  N34
     CANN35WSTYPE        COMP      *BLANKS                            3636
     C  N34
     CANN35
     CANN36              MOVE      '1'           *IN34
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C   34CFRAFK        SETLL     CFRATFRA
     C   35CFRTIK        SETLL     CFRATTIL
     C   36CFRCTK        SETLL     CFRATCT
     C     START1        TAG
     C   34WSKNR         READE     CFRATFRA                               94
     C   35WSKNR         READE(N)  CFRATTIL                               94
     C   36WSKNR         READE     CFRATCT                                94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C   34WSKNR         READE     CFRATFRA                               94
     C   35WSKNR         READE(N)  CFRATTIL                               94
     C   36WSKNR         READE     CFRATCT                                94
     C     *IN94         IFEQ      '0'
     C                   MOVE      FTFRA         YSFRA
     C                   MOVE      FTFRAN        YSFRAN
     C                   MOVE      FTTRA         YSTRA
     C                   MOVE      FTOPDT        YSOPDT
     C                   MOVE      FTSK          YSSK
     C                   MOVE      FTTIL         YSTIL
     C                   MOVE      FTTYPE        YSTYPE
     C                   END
     C  N94              END
     C                   END
      *
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C                   SETOFF                                       983081
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
      *** AVSLUTT
     C   03              GOTO      SLUTT
      * FRISK OPP
     C   05              GOTO      START
      * LAGE NY
     C   06              DO
     C   27              Z-ADD     6             LINNBR
     C  N27              Z-ADD     7             LINNBR
     C                   Z-ADD     25            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
      * SØK FRA
     C   08              GOTO      START0
      * SLETT ALLE AVTALER
     C   10              DO
     C                   EXSR      SLETTA
     C   12              GOTO      START3
     C   10              GOTO      START0
     C                   END
      *
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94
     CAN 34CFRASK        CHAIN     CFRATFRA                           94
     C  N94
     CAN 35CFRTSK        CHAIN(N)  CFRATTIL                           94
     C  N94
     CAN 36CFRCSK        CHAIN     CFRATCT                            94
     C                   GOTO      START2
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C     *IN81         CABEQ     '1'           START
     C                   END
     C                   GOTO      START3
      *
     C*** CREATE A RECORD
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00000000'    *IN(83)
     C                   SETOFF                                       30
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      START5
     C                   END
      *
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     SLETTA        BEGSR
     C***********************************************
     C     STSLT         TAG
     C                   EXFMT     BILDE02
     C  N10
     CANN12              GOTO      STSLT
     C   10              DO
     C     WSKNR         SETLL     CFRAT                              33
     C     STSLT2        TAG
     C     WSKNR         READE     CFRAT                                  33
     C  N33              DELETE    CFRATR
     C  N33              GOTO      STSLT2
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
      *
     C     KODFRK        CHAIN     KODTFR                             90
     C   90              MOVE      'SPF0006'     MSGNR
     C   90              Z-ADD     7             LINNBR
     C   90              SETON                                        30
      *
     C     W2OPDT        IFNE      'GE'
     C     KODOTK        CHAIN     KODTOTY                            89
     C   89
     CANN30              MOVE      'SPO0007'     MSGNR
     C   89
     CANN30              Z-ADD     8             LINNBR
     C   89              SETON                                        30
     C                   END
      *
     C     W2SK          COMP      ' '                                    88
     C   88
     CANN30              MOVE      'SPS0032'     MSGNR
     C   88
     CANN30              Z-ADD     9             LINNBR
     C   88              SETON                                        30
      * FRA STED.
     C     W2FRA         CHAIN     STED2                              87
     C   87              MOVE      'SPS0030'     MSGNR
     C   87              Z-ADD     10            LINNBR
     C   87              SETON                                        30
      *
     C     W2TIL         CHAIN     STED2                              86
     C   86
     CANN30              DO
     C                   Z-ADD     11            LINNBR
     C                   MOVE      'SPS0030'     MSGNR
     C                   SETON                                        30
     C                   END
      *
     C     W2TYPE        CHAIN     CDCON4                             85
     C   85
     CANN30              DO
     C                   MOVE      'SPK0131'     MSGNR
     C                   Z-ADD     12            LINNBR
     C                   SETON                                        30
     C                   END
      *
     C     CFRAK         CHAIN(N)  CFRAT                              33
     C  N33
     CANN30              DO
     C                   Z-ADD     7             LINNBR
     C                   MOVE      'SPA0032'     MSGNR
     C                   SETON                                        30
     C                   END
     C                   END
      *
     C     W2PRIS        COMP      0                                      84
     C   84
     CANN30              DO
     C                   Z-ADD     14            LINNBR
     C                   MOVE      'SPB0007'     MSGNR
     C                   SETON                                        30
     C                   END
      *
     C     KODVAK        CHAIN     KODTVA                             83
     C   83
     CANN30              DO
     C                   Z-ADD     15            LINNBR
     C                   MOVE      'SPV0001'     MSGNR
     C                   SETON                                        30
     C                   END
     C   30              Z-ADD     25            POSNBR
     C   30              GOTO      SLTB1
      *
     C     CFRAK         CHAIN     CFRAT                              33
     C                   EXSR      MOVWCF
     C                   MOVE      ' '           WSNR
     C   40              UPDATE    SUBFIL
     C  N40              DO
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   END
     C                   WRITE     SUBCTL
      *
     C  N33              UPDATE    CFRATR
     C   33              WRITE     CFRATR
      *
     C     SLTB1         ENDSR
      *
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C     WSKNR         IFEQ      W2KNR
     C     WKFRAN        ANDEQ     W2FRAN
     C     WKTRA         ANDEQ     W2TRA
     C     WKOPDT        ANDEQ     W2OPDT
     C     WKSK          ANDEQ     W2SK
     C     WKFRA         ANDEQ     W2FRA
     C     WKTIL         ANDEQ     W2TIL
     C     WKTYPE        ANDEQ     W2TYPE
     C                   MOVE      'YBC0140'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   GOTO      SLTB2
     C                   END
      *
     C     W2KNR         IFNE      0
     C     W2KNR         ANDNE     99999999
     C     CUNK1K        CHAIN     CUNDL01                            80
     C   80              MOVE      'SPK0001'     MSGNR
     C   80              MOVE      '1'           *IN30
     C   80              Z-ADD     6             LINNBR
     C                   END
      *
     C     W2FRAN        IFNE      *BLANKS
     C     KODFRK        CHAIN     KODTFR                             90
     C   90
     CANN30              MOVE      'SPF0006'     MSGNR
     C   90
     CANN30              Z-ADD     7             LINNBR
     C   90              SETON                                        30
     C                   END
      *
     C     W2OPDT        IFNE      *BLANKS
     C     W2OPDT        ANDNE     'GE'
     C     KODOTK        CHAIN     KODTOTY                            89
     C   89
     CANN30              MOVE      'SPO0007'     MSGNR
     C   89
     CANN30              Z-ADD     8             LINNBR
     C   89              SETON                                        30
     C                   END
      * FRA STED.
     C     W2FRA         IFNE      *BLANKS
     C     W2FRA         CHAIN     STED2                              87
     C   87
     CANN30              MOVE      'SPS0030'     MSGNR
     C   87
     CANN30              Z-ADD     10            LINNBR
     C   87              SETON                                        30
     C                   END
      *
     C     W2TIL         IFNE      *BLANKS
     C     W2TIL         CHAIN     STED2                              86
     C   86
     CANN30              DO
     C                   Z-ADD     11            LINNBR
     C                   MOVE      'SPS0030'     MSGNR
     C                   SETON                                        30
     C                   END
     C                   END
      *
     C     W2TYPE        IFNE      *BLANKS
     C     W2TYPE        CHAIN     CDCON4                             85
     C   85
     CANN30              DO
     C                   MOVE      'SPK0131'     MSGNR
     C                   Z-ADD     12            LINNBR
     C                   SETON                                        30
     C                   END
     C                   END
      *
     C   30              Z-ADD     40            POSNBR
     C   30              GOTO      SLTB2
      *
      * KOPIERE AVTALER
     C                   EXSR      KOPIAV
      *
     C     SLTB2         ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C     FTFRA         COMP      '*DLT '                                98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGCFR
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '3'
     C     FTFRA         COMP      '*DLT '                                98
     C   98              GOTO      SLHENT
     C                   EXSR      CPYCFR
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'
     C     FTFRA         COMP      '*DLT '                                98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTCFR
     C   12              GOTO      SLHENT
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
      *
     C                   ENDSR
      *
     C***********************************************
     C     CHGCFR        BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   SETON                                        40
     C                   EXSR      MOVCFW
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     25            POSNBR
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00000000'    *IN(83)
     C                   MOVE      '0'           *IN30
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      STCHG
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C   12              DO
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     CPYCFR        BEGSR
     C***********************************************
     C                   MOVE      FTFRAN        WKFRAN
     C                   MOVE      FTTRA         WKTRA
     C                   MOVE      FTOPDT        WKOPDT
     C                   MOVE      FTSK          WKSK
     C                   MOVE      FTFRA         WKFRA
     C                   MOVE      FTTIL         WKTIL
     C                   MOVE      FTTYPE        WKTYPE
     C                   MOVE      FTPRIS        WKPRIS            9 2
     C                   MOVE      FTVAL         WKVAL             3
     C                   MOVE      WSKNR         W2KNR
     C                   MOVE      FTFRAN        W2FRAN
     C                   MOVE      FTTRA         W2TRA
     C                   MOVE      FTOPDT        W2OPDT
     C                   MOVE      FTSK          W2SK
     C                   MOVE      FTFRA         W2FRA
     C                   MOVE      FTTIL         W2TIL
     C                   MOVE      FTTYPE        W2TYPE
     C*                    MOVE FTPRIS    W2PRIS
     C*                    MOVE FTVAL     W2VAL
     C                   SETON                                        99
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     40            POSNBR
     C                   MOVE      *ZEROS        W2BL
     C                   MOVE      *ZEROS        W2PR
      *
     C     STCPY         TAG
     C                   EXFMT     VAREL2
     C                   MOVEA     '00000000'    *IN(83)
     C                   MOVE      '0'           *IN80
     C                   MOVE      '0'           *IN30
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
      *
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      STCPY
     C                   END
     C     *IN12         IFEQ      '1'
     C                   EXSR      MOVB2
     C                   ELSE
     C                   EXSR      TESTB2
     C   12              Z-ADD     6             LINNBR
     C   12              Z-ADD     40            POSNBR
     C   12
     COR 30              GOTO      STCPY
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     DLTCFR        BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   EXFMT     VAREL3
     C  N12              DO
     C     CFRADK        CHAIN     CFRAT                              33
     C  N33              DELETE    CFRATR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     KOPIAV        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       YKFRAN
     C                   MOVE      *BLANKS       YKTRA
     C                   MOVE      *BLANKS       YKOPDT
     C                   MOVE      *BLANKS       YKSK
     C                   MOVE      *BLANKS       YKFRA
     C                   MOVE      *BLANKS       YKTIL
     C                   MOVE      *BLANKS       YKTYPE
     C                   MOVEA     '0000000'     *IN(41)
      *
     C                   SELECT
     C     W2FRAN        WHENEQ    *BLANKS
     C     W2KNR         OREQ      99999999
     C                   MOVE      '1'           *IN41
     C     W2OPDT        WHENEQ    *BLANKS
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      '1'           *IN42
     C     W2SK          WHENEQ    *BLANKS
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      WKTRA         YKTRA
     C                   MOVE      WKOPDT        YKOPDT
     C                   MOVE      '1'           *IN43
     C     W2FRA         WHENEQ    *BLANKS
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      WKTRA         YKTRA
     C                   MOVE      WKOPDT        YKOPDT
     C                   MOVE      WKSK          YKSK
     C                   MOVE      '1'           *IN44
     C     W2TIL         WHENEQ    *BLANKS
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      WKTRA         YKTRA
     C                   MOVE      WKOPDT        YKOPDT
     C                   MOVE      WKSK          YKSK
     C                   MOVE      WKFRA         YKFRA
     C                   MOVE      '1'           *IN45
     C     W2TYPE        WHENEQ    *BLANKS
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      WKTRA         YKTRA
     C                   MOVE      WKOPDT        YKOPDT
     C                   MOVE      WKSK          YKSK
     C                   MOVE      WKFRA         YKFRA
     C                   MOVE      WKTIL         YKTIL
     C                   MOVE      '1'           *IN46
     C                   OTHER
     C                   MOVE      WKFRAN        YKFRAN
     C                   MOVE      WKTRA         YKTRA
     C                   MOVE      WKOPDT        YKOPDT
     C                   MOVE      WKSK          YKSK
     C                   MOVE      WKFRA         YKFRA
     C                   MOVE      WKTIL         YKTIL
     C                   MOVE      WKTYPE        YKTYPE
     C                   MOVE      '1'           *IN47
     C                   ENDSL
      *
      * KOPIERE AVTALE TIL SUBFIL2 OG VISE PÅ SKJERMEN
     C     W2KNR         IFEQ      99999999
     C                   EXSR      KOPI2A
     C                   ELSE
     C                   EXSR      KOPI2
     C                   END
      * KOPIERE AVTALER FRA SUBFIL2 TIL AVTALE-FIL
     C  N12              EXSR      KOPI3
      * BLANKE ALLE INNPUT FELTER
     C  N12              EXSR      MOVB2
      *
     C                   ENDSR
      *
     C***********************************************
     C     KOPI2         BEGSR
     C***********************************************
     C                   MOVE      '0'           *IN31
     C                   MOVE      '1'           *IN63
     C                   WRITE     SUBCTL2
     C                   MOVEA     '00'          *IN(63)
     C                   Z-ADD     *ZEROS        ZRECN2
     C     W2KNR         COMP      0                                  2828
     C                   MOVE      'DIV0000'     MSGNR
     C     W2PR          DIV       100           XPR               7 4
     C                   ADD       1             XPR
      *
     C     CFRAKK        SETLL     CFRAT                              33
     C     STKP2         TAG
     C   41WSKNR         READE(N)  CFRAT                                  33
     C   42CFRK2K        READE(N)  CFRAT                                  33
     C   43CFRK3K        READE(N)  CFRAT                                  33
     C   44CFRK4K        READE(N)  CFRAT                                  33
     C   45CFRK5K        READE(N)  CFRAT                                  33
     C   46CFRK6K        READE(N)  CFRAT                                  33
     C   47CFRK7K        READE(N)  CFRAT                                  33
     C     *IN33         IFEQ      '0'                                          1<-B
      *
     C     W2FRAN        IFNE      *BLANKS                                       2<-B
     C     WKFRAN        IFEQ      FTFRAN                                         3<-B
     C                   MOVE      W2FRAN        FTFRAN
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2TRA         IFNE      *BLANKS                                       2<-B
     C     WKTRA         IFEQ      FTTRA                                          3<-B
     C                   MOVE      W2TRA         FTTRA
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2OPDT        IFNE      *BLANKS                                       2<-B
     C     WKOPDT        IFEQ      FTOPDT                                         3<-B
     C                   MOVE      W2OPDT        FTOPDT
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2SK          IFNE      *BLANKS                                       2<-B
     C     WKSK          IFEQ      FTSK                                           3<-B
     C                   MOVE      W2SK          FTSK
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2FRA         IFNE      *BLANKS                                       2<-B
     C     WKFRA         IFEQ      FTFRA                                          3<-B
     C                   MOVE      W2FRA         FTFRA
     C                   ELSE                                                      3
     C                   GOTO      STKP2
     C                   END                                                       3<-E
     C                   END                                                      3<-E
     C     W2TIL         IFNE      *BLANKS                                       2<-B
     C     WKTIL         IFEQ      FTTIL                                          3<-B
     C                   MOVE      W2TIL         FTTIL
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2TYPE        IFNE      *BLANKS                                       2<-B
     C     WKTYPE        IFEQ      FTTYPE                                         3<-B
     C                   MOVE      W2TYPE        FTTYPE
     C                   ELSE                                                     3
     C                   GOTO      STKP2
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *
     C                   MOVE      W2KNR         FTKNR
     C                   MOVE      FTPRIS        XPRIS             9 2
     C                   MOVE      FTVAL         XVAL              3
     C     CFRATK        CHAIN(N)  CFRATTIL                           29
     C                   MOVE      XPRIS         FTPRIS
     C                   MOVE      XVAL          FTVAL
      *
     C     *IN29         IFEQ      '1'                                           2<-B
     C                   MOVE      'N'           XJN
     C                   ELSE                                                    2
      * IKKE KOPIERE TIL SEG SELV
     C     WSKNR         IFEQ      FTKNR                                          3<-B
     C     WKFRAN        ANDEQ     FTFRAN
     C     WKTRA         ANDEQ     FTTRA
     C     WKOPDT        ANDEQ     FTOPDT
     C     WKSK          ANDEQ     FTSK
     C     WKFRA         ANDEQ     FTFRA
     C     WKTIL         ANDEQ     FTTIL
     C     WKTYPE        ANDEQ     FTTYPE
     C                   GOTO      STKP2
     C                   END                                                      3<-E
      *
     C                   MOVE      'YBC0141'     MSGNR
     C                   MOVE      '1'           *IN31
     C                   MOVE      'J'           XJN
     C     WSKNR         IFEQ      FTKNR                                          3<-B
     C     W2FRAN        IFNE      *BLANKS                                         4<-B
     C     WKFRAN        ANDNE     FTFRAN
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2TRA         IFNE      *BLANKS                                         4<-B
     C     WKTRA         ANDNE     FTTRA
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2OPDT        IFNE      *BLANKS                                         4<-B
     C     WKOPDT        ANDNE     FTOPDT
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2SK          IFNE      *BLANKS                                         4<-B
     C     WKSK          ANDNE     FTSK
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2FRA         IFNE      *BLANKS                                         4<-B
     C     WKFRA         ANDNE     FTFRA
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2TIL         IFNE      *BLANKS                                         4<-B
     C     WKTIL         ANDNE     FTTIL
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C     W2TYPE        IFNE      *BLANKS                                         4<-B
     C     WKTYPE        ANDNE     FTTYPE
     C                   GOTO      STKP21
     C                   END                                                       4<-E
     C                   MOVE      WKPRIS        FTPRIS
     C                   MOVE      WKVAL         FTVAL
     C     STKP21        TAG
     C                   END                                                      3<-E
      *
     C                   END                                                     2<-E
      *
     C                   SELECT
     C     W2BL          WHENNE    0
     C                   ADD       W2BL          FTPRIS
     C     W2PR          WHENNE    0
     C     FTPRIS        MULT(H)   XPR           XPRI70            7 0
     C                   Z-ADD     XPRI70        FTPRIS
     C                   ENDSL
      *
     C                   ADD       1             ZRECN2
     C                   WRITE     SUBFIL2
     C                   GOTO      STKP2
     C                   END                                                    1<-E
      *
     C     ZRECN2        IFEQ      0
     C                   MOVE      'YBC0147'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN12
     C                   ELSE
      * VISE AVTALER SOM SKAL KOPIERES PÅ SKJERMEN
     C                   MOVE      ZRECN2        XRECN2            5 0
     C                   Z-ADD     1             ZRECN2
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVEA     '11'          *IN(61)
     C     ZRECN2        COMP      15                                   6464
     C                   WRITE     SUBCTL2
     C                   EXFMT     BUNN2
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     KOPI2A        BEGSR
     C***********************************************
     C                   MOVE      '0'           *IN31
     C                   MOVE      '1'           *IN63
     C                   WRITE     SUBCTL2
     C                   MOVEA     '00'          *IN(63)
     C                   Z-ADD     *ZEROS        ZRECN2
     C                   MOVE      'DIV0000'     MSGNR
     C     W2PR          DIV       100           XPR               7 4
     C                   ADD       1             XPR
     C                   MOVE      'YBC0141'     MSGNR
     C                   MOVE      '1'           *IN31
     C                   MOVE      'J'           XJN
      *
     C                   Z-ADD     1             W2KNR
     C     W2KNR         SETLL     CFRAT
     C     STKP2A        TAG
     C                   READ(N)   CFRAT                                  33
     C     *IN33         IFEQ      '0'                                          1<-B
      *
     C     W2FRAN        IFNE      *BLANKS                                       2<-B
     C     WKFRAN        IFEQ      FTFRAN                                         3<-B
     C                   MOVE      W2FRAN        FTFRAN
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2TRA         IFNE      *BLANKS                                       2<-B
     C     WKTRA         IFEQ      FTTRA                                          3<-B
     C                   MOVE      W2TRA         FTTRA
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2OPDT        IFNE      *BLANKS                                       2<-B
     C     WKOPDT        IFEQ      FTOPDT                                         3<-B
     C                   MOVE      W2OPDT        FTOPDT
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2SK          IFNE      *BLANKS                                       2<-B
     C     WKSK          IFEQ      FTSK                                           3<-B
     C                   MOVE      W2SK          FTSK
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2FRA         IFNE      *BLANKS                                       2<-B
     C     WKFRA         IFEQ      FTFRA                                          3<-B
     C                   MOVE      W2FRA         FTFRA
     C                   ELSE                                                      3
     C                   GOTO      STKP2A
     C                   END                                                       3<-E
     C                   END                                                      3<-E
     C     W2TIL         IFNE      *BLANKS                                       2<-B
     C     WKTIL         IFEQ      FTTIL                                          3<-B
     C                   MOVE      W2TIL         FTTIL
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C     W2TYPE        IFNE      *BLANKS                                       2<-B
     C     WKTYPE        IFEQ      FTTYPE                                         3<-B
     C                   MOVE      W2TYPE        FTTYPE
     C                   ELSE                                                     3
     C                   GOTO      STKP2A
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *
     C                   SELECT
     C     W2BL          WHENNE    0
     C                   ADD       W2BL          FTPRIS
     C     W2PR          WHENNE    0
     C     FTPRIS        MULT(H)   XPR           XPRI70            7 0
     C                   Z-ADD     XPRI70        FTPRIS
     C                   ENDSL
      *
     C                   ADD       1             ZRECN2
     C                   WRITE     SUBFIL2
     C                   GOTO      STKP2A
     C                   END                                                    1<-E
      *
     C     ZRECN2        IFEQ      0
     C                   MOVE      'YBC0147'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN12
     C                   ELSE
      * VISE AVTALER SOM SKAL KOPIERES PÅ SKJERMEN
     C                   MOVE      ZRECN2        XRECN2            5 0
     C                   Z-ADD     1             ZRECN2
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVEA     '11'          *IN(61)
     C     ZRECN2        COMP      15                                   6464
     C                   WRITE     SUBCTL2
     C                   EXFMT     BUNN2
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     KOPI3         BEGSR
     C***********************************************
     C     1             DO        XRECN2        ZRECN2
     C     ZRECN2        CHAIN     SUBFIL2                            61
     C     XJN           IFEQ      'N'
     C                   MOVE      '1'           *IN81
     C                   WRITE     CFRATR
     C                   ELSE
     C     *IN21         IFEQ      '1'
     C                   MOVE      '1'           *IN81
     C                   MOVE      FTPRIS        XPRIS             9 2
     C                   MOVE      FTVAL         XVAL              3
     C     CFRATK        CHAIN     CFRATTIL                           29
     C                   MOVE      XPRIS         FTPRIS
     C                   MOVE      XVAL          FTVAL
     C  N29              UPDATE    CFRATRTI
     C                   END
     C                   END
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVWCF        BEGSR
     C***********************************************
     C                   MOVE      WSKNR         FTKNR
     C                   MOVE      W2FRAN        FTFRAN
     C                   MOVE      W2TRA         FTTRA
     C                   MOVE      W2OPDT        FTOPDT
     C                   MOVE      W2FRA         FTFRA
     C                   MOVE      W2TIL         FTTIL
     C                   MOVE      W2SK          FTSK
     C                   MOVE      W2TYPE        FTTYPE
     C                   MOVE      W2PRIS        FTPRIS
     C                   MOVE      W2VAL         FTVAL
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVCFW        BEGSR
     C***********************************************
     C                   MOVE      FTFRAN        W2FRAN
     C                   MOVE      FTTRA         W2TRA
     C                   MOVE      FTOPDT        W2OPDT
     C                   MOVE      FTFRA         W2FRA
     C                   MOVE      FTSK          W2SK
     C                   MOVE      FTTIL         W2TIL
     C                   MOVE      FTTYPE        W2TYPE
     C                   MOVE      FTPRIS        W2PRIS
     C                   MOVE      FTVAL         W2VAL
      *
     C                   ENDSR
      *
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       FTFRAN
     C                   MOVE      *BLANKS       FTTRA
     C                   MOVE      *BLANKS       FTOPDT
     C                   MOVE      *BLANKS       FTFRA
     C                   MOVE      '*DLT '       FTFRA
     C                   MOVE      *BLANKS       FTSK
     C                   MOVE      *BLANKS       FTTIL
     C                   MOVE      *BLANKS       FTTYPE
     C                   MOVE      *ZEROS        FTPRIS
     C                   MOVE      *BLANKS       FTVAL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       W2FRAN
     C                   MOVE      *BLANKS       W2TRA
     C                   MOVE      *BLANKS       W2OPDT
     C                   MOVE      *BLANKS       W2FRA
     C                   MOVE      *BLANKS       W2SK
     C                   MOVE      *BLANKS       W2TIL
     C                   MOVE      *BLANKS       W2TYPE
     C                   MOVE      *ZEROS        W2PRIS
     C                   MOVE      *BLANKS       W2VAL
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDT0        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     32
     C                   MOVE      WSKNR         UKN               8 0
     C                   EXSR      SØKKUN
     C                   MOVE      UKN           WSKNR             8 0
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     25            POSNBR
     C                   GOTO      SLSØK0
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     28
     C                   CAll      'SYSJ17A'
     C                   PARM                    KN0               8 0
     C                   PARM                    WSTRA
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     25            POSNBR
     C                   GOTO      SLSØK0
     C                   END
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSFRA
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     10            LINNBR
     C                   GOTO      SLSØK0
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSTIL
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     12            LINNBR
     C                   GOTO      SLSØK0
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     26
     C                   CALL      'SYSJ02X'
     C                   PARM                    WSTYPE
     C                   GOTO      SLSØK0
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK0        TAG
     C                   Z-ADD     25            POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     28
     C                   CAll      'SYSJ17A'
     C                   PARM                    KN0               8 0
     C                   PARM                    W2TRA
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     25            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C  N40LINNBR        IFEQ      7
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     27
     C                   CALL      'SYFI10G'
     C                   PARM                    W2FRAN
     C                   PARM                    USPED
     C                   Z-ADD     8             LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C  N40LINNBR        IFEQ      8
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     26
     C                   CALL      'SYFI10C'
     C                   PARM                    W2OPDT
     C                   Z-ADD     9             LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C  N40LINNBR        IFEQ      10
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    W2FRA
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     11            LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C  N40LINNBR        IFEQ      11
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     29
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    W2TIL
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     12            LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C  N40LINNBR        IFEQ      12
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     26
     C                   CALL      'SYSJ02X'
     C                   PARM                    W2TYPE
     C                   Z-ADD     14            LINNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      15
     C     POSNBR        ANDGE     25
     C     POSNBR        ANDLE     27
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    W2VAL
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         TAG
     C                   Z-ADD     25            POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDT2        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      5
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     47
     C                   MOVE      W2KNR         UKN
     C                   EXSR      SØKKUN
     C                   MOVE      UKN           W2KNR
     C                   GOTO      SLSØK2
     C                   END
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     43
     C                   CAll      'SYSJ17A'
     C                   PARM                    KN0               8 0
     C                   PARM                    W2TRA
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     25            POSNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     42
     C                   CALL      'SYFI10G'
     C                   PARM                    W2FRAN
     C                   PARM                    USPED
     C                   PARM      LINNBR        ULIN              3 0
     C                   PARM      POSNBR        UPOS              3 0
     C                   Z-ADD     8             LINNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     41
     C                   CALL      'SYFI10C'
     C                   PARM                    W2OPDT
     C                   PARM      LINNBR        ULIN              3 0
     C                   PARM      POSNBR        UPOS              3 0
     C                   Z-ADD     9             LINNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     44
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    W2FRA
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     11            LINNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     44
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    W2TIL
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   Z-ADD     12            LINNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     41
     C                   CALL      'SYSJ02E'
     C                   PARM                    W2TYPE
     C                   PARM      LINNBR        ULIN              3 0
     C                   PARM      POSNBR        UPOS              3 0
     C                   Z-ADD     14            LINNBR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      15
     C     POSNBR        ANDGE     40
     C     POSNBR        ANDLE     42
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    W2VAL
     C                   GOTO      SLSØK2
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK2        TAG
     C                   Z-ADD     40            POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKKUN        BEGSR
     C***********************************************
      *
     C                   MOVE      *BLANKS       USØKNV           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    UKN
     C                   PARM                    FIFIRM
     C                   PARM                    USØKNV           30
      *
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     CFRAK         KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    W2TRA
     C                   KFLD                    W2FRAN
     C                   KFLD                    W2OPDT
     C                   KFLD                    W2SK
     C                   KFLD                    W2FRA
     C                   KFLD                    W2TIL
     C                   KFLD                    W2TYPE
     C     CFRADK        KLIST
     C                   KFLD                    FTKNR
     C                   KFLD                    FTTRA
     C                   KFLD                    FTFRAN
     C                   KFLD                    FTOPDT
     C                   KFLD                    FTSK
     C                   KFLD                    FTFRA
     C                   KFLD                    FTTIL
     C                   KFLD                    FTTYPE
     C     CFRATK        KLIST
     C                   KFLD                    FTKNR
     C                   KFLD                    FTTIL
     C                   KFLD                    FTTRA
     C                   KFLD                    FTFRAN
     C                   KFLD                    FTOPDT
     C                   KFLD                    FTSK
     C                   KFLD                    FTFRA
     C                   KFLD                    FTTYPE
     C     CFRAFK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    WSFRA
     C     CFRTIK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    WSTIL
     C     CFRCTK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    WSTYPE
     C     CFRASK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YSFRA             5
     C                   KFLD                    YSTRA             4
     C                   KFLD                    YSFRAN            3
     C                   KFLD                    YSOPDT            2
     C                   KFLD                    YSSK              1
     C                   KFLD                    YSTIL             5
     C                   KFLD                    YSTYPE            2
     C     CFRTSK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YSTIL
     C                   KFLD                    YSTRA
     C                   KFLD                    YSFRAN
     C                   KFLD                    YSOPDT
     C                   KFLD                    YSSK
     C                   KFLD                    YSFRA
     C                   KFLD                    YSTYPE
     C     CFRCSK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YSTYPE
     C                   KFLD                    YSTRA
     C                   KFLD                    YSFRAN
     C                   KFLD                    YSOPDT
     C                   KFLD                    YSSK
     C                   KFLD                    YSFRA
     C                   KFLD                    YSTIL
     C     CFRAKK        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA             4
     C                   KFLD                    YKFRAN            3
     C                   KFLD                    YKOPDT            2
     C                   KFLD                    YKSK              1
     C                   KFLD                    YKFRA             5
     C                   KFLD                    YKTIL             5
     C                   KFLD                    YKTYPE            2
     C     CFRK2K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C     CFRK3K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C                   KFLD                    YKOPDT
     C     CFRK4K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C                   KFLD                    YKOPDT
     C                   KFLD                    YKSK
     C     CFRK5K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C                   KFLD                    YKOPDT
     C                   KFLD                    YKSK
     C                   KFLD                    YKFRA
     C     CFRK6K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C                   KFLD                    YKOPDT
     C                   KFLD                    YKSK
     C                   KFLD                    YKFRA
     C                   KFLD                    YKTIL
     C     CFRK7K        KLIST
     C                   KFLD                    WSKNR
     C                   KFLD                    YKTRA
     C                   KFLD                    YKFRAN
     C                   KFLD                    YKOPDT
     C                   KFLD                    YKSK
     C                   KFLD                    YKFRA
     C                   KFLD                    YKTIL
     C                   KFLD                    YKTYPE
     C     KODVAK        KLIST
     C                   KFLD                    KVAUNI
     C                   KFLD                    W2VAL
     C     KODFRK        KLIST
     C                   KFLD                    KFRUNI
     C                   KFLD                    W2FRAN
     C     KODOTK        KLIST
     C                   KFLD                    KO1UNI
     C                   KFLD                    W2OPDT
     C     CUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNR
     C     CUNK1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2KNR
      *
     C                   MOVE      'J'           USPED             1
     C                   MOVE      'J'           USØK              1
     C                   MOVE      'VA'          KVAUNI
     C                   MOVE      'FR'          KFRUNI
     C                   MOVE      'OTY'         KO1UNI
      *
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   ENDSR
      *
