      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KODER FOR CONTAINER       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-26                      ***
      *** LEDIGE INDIKATORER 27-29 31-98                      ***
      ***********************************************************
      *
     FSYSJ02FM  CF   E             WORKSTN
     C*
     C                   CALL      'SYSJ02E'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD
     C                   GOTO      SLUTT
      *
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       9930
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C     WSVALG        IFEQ      'S'
     C                   CALL      'SYSJ02A'
     C                   GOTO      START
     C                   END
     C*
     C                   Z-ADD     0             UFLAGG            1 0
     C     WSVALG        IFEQ      '1'
     C                   CALL      'SYSJ02B'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD               3
     C     UFLAGG        IFEQ      3
     C                   GOTO      SLUTT
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C     WSVALG        IFEQ      '2'
     C                   CALL      'SYSJ02C'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD
     C     UFLAGG        IFEQ      3
     C                   GOTO      SLUTT
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C     WSVALG        IFEQ      '3'
     C                   CALL      'SYSJ02D'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD
     C     UFLAGG        IFEQ      3
     C                   GOTO      SLUTT
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C     WSVALG        IFEQ      '4'
     C                   CALL      'SYSJ02E'
     C                   PARM                    UFLAGG
     C                   PARM                    UKD
     C     UFLAGG        IFEQ      3
     C                   GOTO      SLUTT
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C                   MOVE      'SPV0101'     MSGNR
     C                   SETON                                        9930
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
