      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KODER FOR CONTAINER       ***
      ***           STANDARD STATUS                           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-11 13-26                ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-95                ***
      ***********************************************************
      *
     FCDCONT    UF A E           K DISK
     FCDCON1    IF   E           K DISK
     FSYSJ02FA  CF   E             WORKSTN
      *
     C     'I'           CHAIN     CDCONT                             33
     C  N33              UPDATE    CDCONTR
     C  N33              MOVE      CCFT          WSFTI
     C  N33              MOVE      CCST          WSSTI
     C     'U'           CHAIN     CDCONT                             33
     C  N33              UPDATE    CDCONTR
     C  N33              MOVE      CCFT          WSFTU
     C  N33              MOVE      CCST          WSSTU
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   MOVEA     '0000'        *IN(96)
     C                   SETOFF                                       30
     C*** AVBRYT
     C   12              GOTO      SLUTT
     C*
     C     WSFTI         COMP      *BLANKS                                99
     C   99              DO
     C                   MOVE      'SPF0102'     MSGNR
     C                   SETON                                        30
     C                   END
     C     WSSTI         CHAIN     CDCON1                             98
     C   98
     CANN30              DO
     C                   MOVE      'SPS0101'     MSGNR
     C                   SETON                                        30
     C                   END
     C*
     C     WSFTU         COMP      *BLANKS                                97
     C   97              DO
     C                   MOVE      'SPF0102'     MSGNR
     C                   SETON                                        30
     C                   END
     C     WSSTU         CHAIN     CDCON1                             96
     C   96
     CANN30              DO
     C                   MOVE      'SPS0101'     MSGNR
     C                   SETON                                        30
     C                   END
     C*
     C   30              GOTO      START
     C*
     C     'I'           CHAIN     CDCONT                             33
     C                   MOVE      'I'           CCKD
     C                   MOVE      WSFTI         CCFT
     C                   MOVE      WSSTI         CCST
     C   33              WRITE     CDCONTR
     C  N33              UPDATE    CDCONTR
     C     'U'           CHAIN     CDCONT                             33
     C                   MOVE      'U'           CCKD
     C                   MOVE      WSFTU         CCFT
     C                   MOVE      WSSTU         CCST
     C   33              WRITE     CDCONTR
     C  N33              UPDATE    CDCONTR
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
