      *
      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE BEKREFTELSE AV B/L        ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 09-11 13-24          ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-90 95-97          ***
      ***********************************************************
      *
     FBILLOF    IF   E           K DISK
     FSYSJ24FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  BLBBNA                 1     30
     D  WSBNA                  1     17
     D                 DS
     D  BLBDTÅ                 1      4  0
     D  BLBDTM                 5      6  0
     D  BLBDTD                 7      8  0
     D  BLBDT                  1      8  0
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVD2                 15     18
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     BLK           SETLL     BILLOF
     C     START1        TAG
     C     UAVD          READE     BILLOF                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        15
     C                   ADD       1             ZRECNO
     C                   EXSR      KDTFMT
     C                   WRITE     SUBFIL
     C     UAVD          READE     BILLOF                                 94
     C  N94              END
     C                   END
     C                   Z-ADD     BLOPD         YOPD              7 0
     C                   Z-ADD     ZRECNO        YRECNO            4 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C     START3        TAG
     C                   SETOFF                                       9998
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C***
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03              Z-ADD     3             UFLAGG
     C   03              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** SØK FRA AVDELING
     C   08              GOTO      START6
     C*** AVSLUTT
     C   12              Z-ADD     1             UFLAGG
     C   12              MOVE      *ZEROS        UAVD2
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C  N94BLK3          SETLL     BILLOF
     C  N94UAVD          READE     BILLOF                                 94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** SØK FRA B/L
     C     START6        TAG
     C                   EXFMT     VAREL2
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     27            POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       15            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     15            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'
     C                   SETON                                        99
     C                   CALL      'SYSJ50J'
     C                   PARM                    UAVD
     C                   PARM                    BLOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      1
     C                   GOTO      SLHENT
     C                   ELSE
     C     BLK2          CHAIN     BILLOF                             33
     C                   MOVE      ' '           WSNR
     C                   EXSR      KDTFMT
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     BLK           KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    W2OPD
     C     BLK2          KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    BLOPD
     C     BLK3          KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    YOPD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UFLAGG            1 0
     C*
     C                   MOVE      UAVD2         UAVD
     C*
     C                   WRITE     NYVARE
     C                   EXFMT     VAREL2
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      BLBDTD        UDT1              2 0
     C                   MOVE      BLBDTM        UDT2              2 0
     C                   MOVE      BLBDTÅ        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD
     C                   MOVE      UDT2          WSDTM
     C                   MOVE      UDT3          WSDTÅ
     C*
     C                   ENDSR
     C*
