      *
      ***********************************************************
      *** PROGRAM SKAL SØKE LASTETYEPER
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 02 04 07 09-11 13-24
      *** LEDIGE INDIKATORER 31 32 34-90 95-97
      ***********************************************************
      *
     FCDLAST    IF   E           K DISK
     FCDLASTLF  IF   E           K DISK
     F                                     RENAME(CDLASTR:CDLASTRL)
     FSYSJ19FA  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N27W2KOD         SETLL     CDLAST
     C   27W2SØK         SETLL     CDLASTLF
     C     START1        TAG
     C  N27              READ      CDLAST                                 94
     C   27              READ      CDLASTLF                               94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        5
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C  N27              READ      CDLAST                                 94
     C   27              READ      CDLASTLF                               94
     C  N94              END
     C                   END
     C                   Z-ADD     ZRECNO        YRECNO            4 0
      *
     C     *IN29         IFEQ      '0'
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     9             POSNBR
     C                   MOVE      '1'           *IN29
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   END
      *
     C     START3        TAG
     C                   MOVEA     '00'          *IN(98)
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C*
     C                   SETOFF                                       9830
     C*** AVSLUTT
     C   03
     COR 12              GOTO      SLUTT
     C*** FRISK OPP
     C   05              GOTO      START
     C*** LAGE NY AVDELING
     C   06              DO
     C                   MOVE      *ZEROS        UFLAGG            1 0
     C                   CALL      'SYSJ19'
     C                   PARM                    UFLAGG
     C                   PARM                    UKOD
     C                   GOTO      START3
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C     W2KOD         ANDNE     *BLANKS
     C                   MOVE      W2KOD         UKOD
     C                   GOTO      SLUTT
     C                   END
     C     W2KOD         IFNE      *BLANKS
     C                   MOVE      '0'           *IN27
     C                   GOTO      START
     C                   END
     C     W2SØK         IFNE      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   GOTO      START
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C                   MOVE      CLKD          UKOD
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   END
      *
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UKOD              3
      *
     C     UKOD          IFEQ      *BLANKS
     C                   MOVE      '1'           *IN27
     C                   ELSE
     C                   MOVE      UKOD          W2KOD
     C                   END
     C                   WRITE     WINDOWSZ
      *
      *
     C                   ENDSR
      *
