      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11011 * 01 YBC PTF11 SKILLE IMPORT OR EKSPORT
********************************************************************
      *****************************************************************
      *** OVERGANG FRA BOOKING TIL ANDRE "DOKUMENTER" LOK-BL/OVERSJ.. *
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 01-11 13-26                            ***
      *** LEDIGE INDIKATORER 27 29 30 32-99                         ***
      *****************************************************************
      *
N01  FBILLOF    IF   E           K DISK
     FSYSJ50FA  CF   E             WORKSTN
     D                UDS
     D  UFIRM                  1      2
     C*
N01  C     BILLOFK       KLIST
N01  C                   KFLD                    UAVD
N01  C                   KFLD                    UOPD
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    USG               3
     C                   PARM                    UFLAGG            1 0
     C*** IND. 28 PÅ  -->  SPØRRING
     C*** IND. 28 AV  -->  VEDLIKEHOLD
     C     UFLAGG        COMP      2                                  28  28
     C     UFLAGG        COMP      3                                      31
     C                   Z-ADD     0             UFLAGG
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C   12              GOTO      SLUTT
     C*
     C*** TILLEGGS BOOKING
     C     WSBK          IFEQ      'J'
     C                   Z-ADD     1             UFLAGG
     C  N28              DO
     C                   CALL      'SYSJ50C'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     1             START
     C                   END
     C   28              DO
     C                   CALL      'SYSJ52C'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     9             START
     C                   END
     C                   END
     C*
     C*** LOKAL BILL OF LADING
     C     WSBLL         IFEQ      'J'
     C     WSBLL         OREQ      'K'
     C                   Z-ADD     1             UFLAGG
     C  N28              DO
     C     WSBLL         IFEQ      'K'
     C                   Z-ADD     2             UFLAGG
     C                   END
     C                   CALL      'SYSJ50D'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     1             START
     C                   END
     C   28              DO
     C                   CALL      'SYSJ52D'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     9             START
     C                   END
     C                   END
     C*
     C*** OVERSJØ BILL OF LADING
     C     WSBLO         IFEQ      'J'
     C   31              Z-ADD     5             UFLAGG
     C   31              GOTO      SLUTT
     C                   Z-ADD     3             UFLAGG
     C                   MOVE      *ZEROS        UAVD2             4 0
     C                   MOVE      *ZEROS        UOPD2             7 0
     C  N28              DO
N01  C     BILLOFK       CHAIN     BILLOF                             33
N01  C  N33              IF        BLUR = 'F'
N01  C                   Z-ADD     1             UFLAGG
N01  C                   ELSE
N01  C                   Z-ADD     2             UFLAGG
N01  C                   END
     C                   CALL      'SYSJ50I'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    USG
     C                   PARM                    UKUNBL            1
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    UFLAGG
     C                   PARM      0             ULUNIK            9 0
     C     UFLAGG        CABEQ     1             START
     C                   END
     C   28              DO
     C                   CALL      'SYSJ52I'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    USG
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     9             START
     C                   END
     C                   END
     C*
     C*** CMR-FRAKTBREV
     C     WSCMR         IFEQ      'J'
     C                   MOVE      UFIRM         UFIRM2
     C  N28              DO
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYEX10B'
     C                   PARM                    UFIRM2            2
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UMSG             62
     C                   PARM                    UFLAGG
     C                   END
     C   28              DO
     C                   Z-ADD     9             UFLAGG
     C                   CALL      'SYEX10B'
     C                   PARM                    UFIRM2            2
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UMSG             62
     C                   PARM                    UFLAGG
     C                   END
     C     UFLAGG        CABEQ     1             START
     C                   END
     C*
     C*** FREIGHT MANIFEST
     C     WSFM          IFEQ      'J'
     C  N28              Z-ADD     0             UFLAGG
     C   28              Z-ADD     2             UFLAGG
     C                   CALL      'SYSJ25A'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    USG
     C                   PARM                    UFLAGG
     C     UFLAGG        CABEQ     1             START
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
