      *
      ***********************************************************
      *** PROGRAM SKAL SKRIVE LOP-LISTE                       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04-26                      ***
      *** LEDIGE INDIKATORER 28 29 32 35-40 49 61-65          ***
      ***********************************************************
      *
     FWFILCD    UF A E           K DISK
     FWFILCDLF  UF   E           K DISK
     F                                     RENAME(WFILCDR:WFILCDLR)
     FBILLOF    IF   E           K DISK
     FBILLOFW1  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF1R)
     FBILLOFW2  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF2R)
     FBILLOFW3  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF3R)
     FBILLOFW4  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF4R)
     FBILLOFW5  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF5R)
     FBILLOFW6  IF   E           K DISK
     F                                     RENAME(BILLOFR:BILLOF6R)
     FBLV1LF    IF   E           K DISK
     FBLV1LFW   IF   E           K DISK
     F                                     RENAME(BLV1R:BLV1LFWR)
     FHEADF     IF   E           K DISK
     FHEADLFW   IF   E           K DISK
     F                                     RENAME(HEADFR:HEADLFWR)
     FCUNDL01   IF   E           K DISK
     FSTED2     IF   E           K DISK
     FKODTLK    IF   E           K DISK
     FSYSJ66P   O    E             PRINTER OFLIND(*IN27)
     D TR              S              4    DIM(5)
     D OT              S              2    DIM(5)
     D CT              S              2    DIM(5)
     D LB              S              5    DIM(5)
     D OB              S              5    DIM(5)
     D                 DS
     D  XAV                    1     20
     D  AV                     1     20  0
     D                                     DIM(5)
     D                 DS
     D  XRE                    1     40
     D  RE                     1     40  0
     D                                     DIM(5)
     D                 DS
     D  BLACC                  1      2  0
     D  BLAAR                  3      4  0
     D  BLUKE                  5      6  0
     D  XLÅU                   1      6  0
     D                 DS
     D  XÅU2                   1      6  0
     D  XÅR2                   3      4  0
     D  XUKE2                  5      6  0
     D                 DS
     D  XCC                    1      2  0
     D  XÅR                    3      4  0
     D  XUKE                   5      6  0
     D  XÅUF                   1      6  0
     D  XCCT                   7      8  0
     D  XÅRT                   9     10  0
     D  XUKET                 11     12  0
     D  XÅUT                   7     12  0
     D                 DS
     D  XIDAGD                 1      2  0
     D  XIDAGM                 3      4  0
     D  XIDAGÅ                 5      6  0
     D  XIDAG                  1      6  0
     D                 DS
     D  BLDTAÅ                 1      4  0
     D  BLDTAM                 5      6  0
     D  BLDTAD                 7      8  0
     D  BLDTA                  1      8  0
     D                 DS
     D  XDTAD                  1      2  0
     D  XDTAM                  3      4  0
     D  XDTAÅ                  5      6  0
     D  XDTA                   1      6  0
     D                 DS
     D  BLDTVÅ                 1      4  0
     D  BLDTVM                 5      6  0
     D  BLDTVD                 7      8  0
     D  BLDTVH                 1      8  0
     D                 DS
     D  XDTVD                  1      2  0
     D  XDTVM                  3      4  0
     D  XDTVÅ                  5      6  0
     D  XDTV                   1      6  0
     D                 DS
     D  A11                    1      2
     D  A12                    3      4
     D  A13                    5      6
     D  A14                    7      8
     D  A15                    9     10
     D  A16                   11     12
     D  A17                   13     14
     D  A18                   15     16
     D  A19                   17     18
     D  A110                  19     20
     D  A111                  21     22
     D  A112                  23     24
     D  A113                  25     26
     D  A114                  27     28
     D  A115                  29     30
     D  A116                  31     32
     D  A117                  33     34
     D  A118                  35     36
     D  A119                  37     38
     D  A120                  39     40
     D  A121                  41     42
     D  A122                  43     44
     D  A123                  45     46
     D  A124                  47     48
     D  A125                  49     50
     D  A126                  51     52
     D  A127                  53     54
     D  A128                  55     56
     D  A129                  57     58
     D  A130                  59     60
     D  A131                  61     62
     D  A132                  63     64
     D  A133                  65     66
     D  A134                  67     68
     D  A135                  69     70
     D  A136                  71     72
     D  A137                  73     74
     D  A1                     1     74
     D                                     DIM(37)
     D                 DS
     D  A21                    1      5  0
     D  A22                    6     10  0
     D  A23                   11     15  0
     D  A24                   16     20  0
     D  A25                   21     25  0
     D  A26                   26     30  0
     D  A27                   31     35  0
     D  A28                   36     40  0
     D  A29                   41     45  0
     D  A210                  46     50  0
     D  A211                  51     55  0
     D  A212                  56     60  0
     D  A213                  61     65  0
     D  A214                  66     70  0
     D  A215                  71     75  0
     D  A216                  76     80  0
     D  A217                  81     85  0
     D  A218                  86     90  0
     D  A219                  91     95  0
     D  A220                  96    100  0
     D  A221                 101    105  0
     D  A222                 106    110  0
     D  A223                 111    115  0
     D  A224                 116    120  0
     D  A225                 121    125  0
     D  A226                 126    130  0
     D  A227                 131    135  0
     D  A228                 136    140  0
     D  A229                 141    145  0
     D  A230                 146    150  0
     D  A231                 151    155  0
     D  A232                 156    160  0
     D  A233                 161    165  0
     D  A234                 166    170  0
     D  A235                 171    175  0
     D  A236                 176    180  0
     D  A237                 181    185  0
     D  A2                     1    185  0
     D                                     DIM(37)
     D                 DS
     D  B11                    1      2
     D  B12                    3      4
     D  B13                    5      6
     D  B14                    7      8
     D  B15                    9     10
     D  B16                   11     12
     D  B17                   13     14
     D  B18                   15     16
     D  B19                   17     18
     D  B110                  19     20
     D  B111                  21     22
     D  B112                  23     24
     D  B113                  25     26
     D  B114                  27     28
     D  B115                  29     30
     D  B116                  31     32
     D  B117                  33     34
     D  B118                  35     36
     D  B119                  37     38
     D  B120                  39     40
     D  B121                  41     42
     D  B122                  43     44
     D  B123                  45     46
     D  B124                  47     48
     D  B125                  49     50
     D  B126                  51     52
     D  B127                  53     54
     D  B128                  55     56
     D  B129                  57     58
     D  B130                  59     60
     D  B131                  61     62
     D  B132                  63     64
     D  B133                  65     66
     D  B134                  67     68
     D  B135                  69     70
     D  B136                  71     72
     D  B137                  73     74
     D  B138                  75     76
     D  B139                  77     78
     D  B140                  79     80
     D  B141                  81     82
     D  B142                  83     84
     D  B143                  85     86
     D  B144                  87     88
     D  B145                  89     90
     D  B146                  91     92
     D  B147                  93     94
     D  B148                  95     96
     D  B149                  97     98
     D  B150                  99    100
     D  B1                     1    100
     D                                     DIM(50)
     D                 DS
     D  B21                    1      5  0
     D  B22                    6     10  0
     D  B23                   11     15  0
     D  B24                   16     20  0
     D  B25                   21     25  0
     D  B26                   26     30  0
     D  B27                   31     35  0
     D  B28                   36     40  0
     D  B29                   41     45  0
     D  B210                  46     50  0
     D  B211                  51     55  0
     D  B212                  56     60  0
     D  B213                  61     65  0
     D  B214                  66     70  0
     D  B215                  71     75  0
     D  B216                  76     80  0
     D  B217                  81     85  0
     D  B218                  86     90  0
     D  B219                  91     95  0
     D  B220                  96    100  0
     D  B221                 101    105  0
     D  B222                 106    110  0
     D  B223                 111    115  0
     D  B224                 116    120  0
     D  B225                 121    125  0
     D  B226                 126    130  0
     D  B227                 131    135  0
     D  B228                 136    140  0
     D  B229                 141    145  0
     D  B230                 146    150  0
     D  B231                 151    155  0
     D  B232                 156    160  0
     D  B233                 161    165  0
     D  B234                 166    170  0
     D  B235                 171    175  0
     D  B236                 176    180  0
     D  B237                 181    185  0
     D  B238                 186    190  0
     D  B239                 191    195  0
     D  B240                 196    200  0
     D  B241                 201    205  0
     D  B242                 206    210  0
     D  B243                 211    215  0
     D  B244                 216    220  0
     D  B245                 221    225  0
     D  B246                 226    230  0
     D  B247                 231    235  0
     D  B248                 236    240  0
     D  B249                 241    245  0
     D  B250                 246    250  0
     D  B2                     1    250  0
     D                                     DIM(50)
     D                 DS
     D  T11                    1      2
     D  T12                    3      4
     D  T13                    5      6
     D  T14                    7      8
     D  T15                    9     10
     D  T16                   11     12
     D  T17                   13     14
     D  T18                   15     16
     D  T19                   17     18
     D  T110                  19     20
     D  T111                  21     22
     D  T112                  23     24
     D  T113                  25     26
     D  T114                  27     28
     D  T115                  29     30
     D  T116                  31     32
     D  T117                  33     34
     D  T118                  35     36
     D  T119                  37     38
     D  T120                  39     40
     D  T121                  41     42
     D  T122                  43     44
     D  T123                  45     46
     D  T124                  47     48
     D  T125                  49     50
     D  T126                  51     52
     D  T127                  53     54
     D  T128                  55     56
     D  T129                  57     58
     D  T130                  59     60
     D  T131                  61     62
     D  T132                  63     64
     D  T133                  65     66
     D  T134                  67     68
     D  T135                  69     70
     D  T136                  71     72
     D  T137                  73     74
     D  T138                  75     76
     D  T139                  77     78
     D  T140                  79     80
     D  T141                  81     82
     D  T142                  83     84
     D  T143                  85     86
     D  T144                  87     88
     D  T145                  89     90
     D  T146                  91     92
     D  T147                  93     94
     D  T148                  95     96
     D  T149                  97     98
     D  T150                  99    100
     D  T1                     1    100
     D                                     DIM(50)
     D                 DS
     D  T21                    1      5  0
     D  T22                    6     10  0
     D  T23                   11     15  0
     D  T24                   16     20  0
     D  T25                   21     25  0
     D  T26                   26     30  0
     D  T27                   31     35  0
     D  T28                   36     40  0
     D  T29                   41     45  0
     D  T210                  46     50  0
     D  T211                  51     55  0
     D  T212                  56     60  0
     D  T213                  61     65  0
     D  T214                  66     70  0
     D  T215                  71     75  0
     D  T216                  76     80  0
     D  T217                  81     85  0
     D  T218                  86     90  0
     D  T219                  91     95  0
     D  T220                  96    100  0
     D  T221                 101    105  0
     D  T222                 106    110  0
     D  T223                 111    115  0
     D  T224                 116    120  0
     D  T225                 121    125  0
     D  T226                 126    130  0
     D  T227                 131    135  0
     D  T228                 136    140  0
     D  T229                 141    145  0
     D  T230                 146    150  0
     D  T231                 151    155  0
     D  T232                 156    160  0
     D  T233                 161    165  0
     D  T234                 166    170  0
     D  T235                 171    175  0
     D  T236                 176    180  0
     D  T237                 181    185  0
     D  T238                 186    190  0
     D  T239                 191    195  0
     D  T240                 196    200  0
     D  T241                 201    205  0
     D  T242                 206    210  0
     D  T243                 211    215  0
     D  T244                 216    220  0
     D  T245                 221    225  0
     D  T246                 226    230  0
     D  T247                 231    235  0
     D  T248                 236    240  0
     D  T249                 241    245  0
     D  T250                 246    250  0
     D  T2                     1    250  0
     D                                     DIM(50)
     D                UDS
     D  UFIRM                  1      2
     C*
     C                   EXSR      INIT
     C*
     C                   EXSR      UTLIST
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C******************************************
     C     UTLIST        BEGSR
     C******************************************
     C                   MOVE      *ZEROS        XSIDE
     C                   MOVE      *BLANKS       B1
     C                   MOVE      *ZEROS        B2
     C                   MOVE      *BLANKS       T1
     C                   MOVE      *ZEROS        T2
     C*
     C     USORT         COMP      '2'                                  4142
     C     USORT         COMP      '3'                                    43
     C     USORT         COMP      '4'                                    44
     C     USORT         COMP      '5'                                    45
     C     USORT         COMP      '6'                                    46
     C     USORT         COMP      '7'                                48  47
     C*
     C                   SETOFF                                       515253
     C                   SETOFF                                       545556
     C                   SETOFF                                       575850
     C                   Z-ADD     0             XN                1 0
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C  N51AV(XN)        COMP      0                                  5151
     C  N52TR(XN)        COMP      '    '                             5252
     C  N54OT(XN)        COMP      '  '                               5454
     C  N55CT(XN)        COMP      '  '                               5555
     C  N56LB(XN)        COMP      '     '                            5656
     C  N57OB(XN)        COMP      '     '                            5757
     C  N58RE(XN)        COMP      0                                  5858
     C                   END
     C     XUKE          COMP      0                                  5353
     C*
     C   45              EXSR      PLUKK
     C*
     C   41              EXSR      PRINT1
     C   42              EXSR      PRINT2
     C   43              EXSR      PRINT3
     C   44              EXSR      PRINT4
     C   45              EXSR      PRINT5
     C   46              EXSR      PRINT6
     C   47              EXSR      PRINT7
     C   48              EXSR      PRINT8
     C*
     C   43              EXSR      PRUKE
     C                   EXSR      TOTLIN
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT1        BEGSR
     C******************************************
     C                   SETON                                        27
     C   51              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     AV(XN)        IFNE      0
     C                   MOVE      AV(XN)        YAVD
     C                   SETOFF                                       60
     C     BLW1K         SETLL     BILLOFW1
     C     STPR1         TAG
     C     YAVD          READE     BILLOFW1                               60
     C  N60BLDTA         COMP      YDTT                               60
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR1
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR1
     C                   END
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR1
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N51              DO
     C                   MOVE      '0001'        YAVD
     C                   SETOFF                                       60
     C     BLW1K         SETLL     BILLOFW1
     C     STPR11        TAG
     C                   READ      BILLOFW1                               60
     C  N60BLDTA         IFLT      YDT
     C                   MOVE      BLAVD         YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR11
     C                   ELSE
     C     BLDTA         IFGT      YDTT
     C     BLAVD         ADD       1             YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR11
     C                   END
     C                   END
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR11
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR11
     C                   END
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR11
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT2        BEGSR
     C******************************************
     C                   SETON                                        27
     C   52              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     TR(XN)        IFNE      '    '
     C                   MOVEL     TR(XN)        YTR
     C                   SETOFF                                       60
     C     BLW2K         SETLL     BILLOFW2
     C     STPR2         TAG
     C     YTR           READE     BILLOFW2                               60
     C  N60BLDTA         COMP      YDTT                               60
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR2
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR2
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR2
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N52              DO
     C                   MOVE      '   A'        YTR
     C                   SETOFF                                       60
     C     BLW2K         SETLL     BILLOFW2
     C     STPR21        TAG
     C                   READ      BILLOFW2                               60
     C  N60BLDTA         IFLT      YDT
     C                   MOVEL     BLTR          YTR
     C     BLW2K         SETLL     BILLOFW2
     C                   GOTO      STPR21
     C                   ELSE
     C     BLDTA         IFGT      YDTT
     C     BLAVD         ADD       1             YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR21
     C                   END
     C                   END
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR21
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR21
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR21
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT3        BEGSR
     C******************************************
     C                   MOVE      *ZEROS        XÅU2
     C                   SETON                                        27
     C                   MOVE      XCC           YCC
     C                   MOVE      XÅR           YÅR
     C                   MOVE      XUKE          YUKE
     C                   SETOFF                                       60
     C     BLW3K         SETLL     BILLOFW3
     C     STPR3         TAG
     C                   READ      BILLOFW3                               60
     C  N60XLÅU          COMP      XÅUT                               60
     C  N60              DO                                                     B<-1
     C     XÅU2          IFEQ      0                                             B<-2
     C                   MOVE      XLÅU          XÅU2
     C                   ELSE                                                    2
     C     XLÅU          IFNE      XÅU2                                           B<-3
     C                   EXSR      PRUKE
     C                   END                                                      E<-3
     C                   END                                                     E<-2
     C                   EXSR      TST0
     C  N33              GOTO      STPR3
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR3
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR3
     C                   END                                                    E<-1
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT4        BEGSR
     C******************************************
     C                   SETON                                        27
     C   54              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     OT(XN)        IFNE      '  '
     C                   MOVE      OT(XN)        YOT
     C                   SETOFF                                       60
     C     HEADWK        SETLL     HEADLFW
     C     STPR4         TAG
     C     HEADWK        READE     HEADLFW                                60
     C  N60HEDTOP        COMP      YDTT                               60
     C  N60              DO
     C     BILLK         CHAIN     BILLOF                             34
     C                   EXSR      TST0
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR4
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N54              DO
     C                   MOVE      ' A'          YOT
     C                   SETOFF                                       60
     C     HEADWK        SETLL     HEADLFW
     C     STPR41        TAG
     C                   READ      HEADLFW                                60
     C  N60              DO
     C     HEDTOP        CABLT     YDT           STPR41
     C     HEDTOP        CABGT     YDTT          STPR41
     C     BILLK         CHAIN     BILLOF                             34
     C                   EXSR      TST0
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR41
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT5        BEGSR
     C******************************************
     C                   SETON                                        27
     C                   MOVE      ' A'          YKDC
     C     WFCDWK        SETLL     WFILCDLF
     C                   SETOFF                                       60
     C     STPR5         TAG
     C                   READ      WFILCDLF                               60
     C  N60              DO
     C                   DELETE    WFILCDLR
     C     BILLK2        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR5
     C                   END
     C     BILLK2        CHAIN     BILLOF                             34
     C                   EXSR      PRINT
     C                   GOTO      STPR5
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT6        BEGSR
     C******************************************
     C                   SETON                                        27
     C   56              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     LB(XN)        IFNE      '     '
     C                   MOVE      LB(XN)        YLB
     C                   SETOFF                                       60
     C     BLW4K         SETLL     BILLOFW4
     C     STPR6         TAG
     C     YLB           READE     BILLOFW4                               60
     C  N60BLDTA         COMP      YDTT                               60
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR6
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR6
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR6
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N56              DO
     C                   MOVE      '     '       YLB
     C                   SETOFF                                       60
     C     BLW4K         SETLL     BILLOFW4
     C     STPR61        TAG
     C                   READ      BILLOFW4                               60
     C  N60BLDTA         IFLT      YDT
     C                   MOVE      BLLB          YLB
     C     BLW4K         SETLL     BILLOFW4
     C                   GOTO      STPR61
     C                   ELSE
     C     BLDTA         IFGT      YDTT
     C     BLAVD         ADD       1             YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR61
     C                   END
     C                   END
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR61
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR61
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR61
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT7        BEGSR
     C******************************************
     C                   SETON                                        27
     C   57              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     OB(XN)        IFNE      '     '
     C                   MOVE      OB(XN)        YOB
     C                   SETOFF                                       60
     C     BLW5K         SETLL     BILLOFW5
     C     STPR7         TAG
     C     YOB           READE     BILLOFW5                               60
     C  N60BLDTA         COMP      YDTT                               60
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR7
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR7
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR7
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N57              DO
     C                   MOVE      '     '       YOB
     C                   SETOFF                                       60
     C     BLW5K         SETLL     BILLOFW5
     C     STPR71        TAG
     C                   READ      BILLOFW5                               60
     C  N60BLDTA         IFLT      YDT
     C                   MOVE      BLOB          YOB
     C     BLW5K         SETLL     BILLOFW5
     C                   GOTO      STPR71
     C                   ELSE
     C     BLDTA         IFGT      YDTT
     C     BLAVD         ADD       1             YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR71
     C                   END
     C                   END
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR71
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR71
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 58              EXSR      TST8
     C   33              EXSR      PRINT
     C                   GOTO      STPR71
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT8        BEGSR
     C******************************************
     C                   SETON                                        27
     C   58              DO
     C                   Z-ADD     0             XN
     C     XN            DOWLT     5
     C                   ADD       1             XN
     C     RE(XN)        IFNE      0
     C                   MOVE      RE(XN)        YKNR
     C                   SETOFF                                       60
     C     BLW6K         SETLL     BILLOFW6
     C     STPR8         TAG
     C     YKNR          READE     BILLOFW6                               60
     C  N60BLDTA         COMP      YDTT                               60
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR8
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR8
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33              EXSR      PRINT
     C                   GOTO      STPR8
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C  N58              DO
     C                   Z-ADD     1             YKNR
     C                   SETOFF                                       60
     C     BLW6K         SETLL     BILLOFW6
     C     STPR81        TAG
     C                   READ      BILLOFW6                               60
     C  N60BLDTA         IFLT      YDT
     C                   MOVE      BLKNR         YKNR
     C     BLW6K         SETLL     BILLOFW6
     C                   GOTO      STPR81
     C                   ELSE
     C     BLDTA         IFGT      YDTT
     C     BLAVD         ADD       1             YAVD
     C     BLW1K         SETLL     BILLOFW1
     C                   GOTO      STPR81
     C                   END
     C                   END
     C  N60              DO
     C                   EXSR      TST0
     C  N33              GOTO      STPR81
     C     HEADFK        CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPR81
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 55              EXSR      TST5
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33              EXSR      PRINT
     C                   GOTO      STPR81
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRINT         BEGSR
     C******************************************
     C  N50BLUR          COMP      'F'                                5959      IND. 59 AV => IMPORT
     C  N50              SETON                                        50
     C                   MOVE      *BLANKS       A1
     C                   MOVE      *ZEROS        A2
     C                   EXSR      HENTBV
     C*
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C*
     C  N59HEKNK         IFEQ      0
     C                   MOVE      BLKNK         XKN               8 0
     C                   ELSE
     C                   MOVE      HEKNK         XKN
     C                   END
     C  N59HEKNKF        IFEQ      0
     C                   MOVE      BLKNKA        XKNF              8 0
     C                   ELSE
     C                   MOVE      HEKNKF        XKNF
     C                   END
     C   59              MOVE      HEKNS         XKN
     C   59HEKNSF        IFEQ      0
     C                   MOVE      BLKNSA        XKNF
     C                   ELSE
     C                   MOVE      HEKNSF        XKNF
     C                   END
     C                   MOVE      XKN           KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            34
     C  N34              MOVEL     KNAVN         XNA              26
     C   34              MOVE      *BLANKS       XNA
     C   34              MOVEL     XKN           XNA
     C                   MOVE      XKNF          KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            34
     C  N34              MOVE      KNAVN         XNAF             30
     C   34              MOVE      *BLANKS       XNAF
     C   34              MOVEL     XKNF          XNAF
     C*
     C                   EXSR      KDTFM1
     C                   WRITE     LDET1
     C     XN2           IFGE      3
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LDET2
     C                   END
     C     XN2           IFGE      10
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LDET3
     C                   END
     C     XN2           IFGE      17
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LDET4
     C                   END
     C     XN2           IFGE      24
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LDET5
     C                   END
     C     XN2           IFGE      31
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LDET6
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     HENTBV        BEGSR
     C******************************************
     C                   MOVE      *BLANKS       A1
     C                   MOVE      *ZEROS        A2
     C     BLV1K         SETLL     BLV1LF
     C                   SETOFF                                       34
     C     STHBV         TAG
     C     BLV1K         READE     BLV1LF                                 34
     C  N34BVKDC         IFNE      '  '
     C*
     C   43              DO
     C                   Z-ADD     0             XN2               2 0
     C     XN2           DOWLT     50
     C                   ADD       1             XN2
     C     B1(XN2)       IFEQ      '  '
     C                   GOTO      STHBV2
     C                   ELSE
     C     B1(XN2)       IFEQ      BVKDC
     C                   GOTO      STHBV2
     C                   END
     C                   END
     C                   END
     C     STHBV2        TAG
     C                   MOVE      BVKDC         B1(XN2)
     C                   ADD       BVNT          B2(XN2)
     C                   END
     C*
     C                   Z-ADD     0             XN2               2 0
     C     XN2           DOWLT     50
     C                   ADD       1             XN2
     C     T1(XN2)       IFEQ      '  '
     C                   GOTO      STHBV3
     C                   ELSE
     C     T1(XN2)       IFEQ      BVKDC
     C                   GOTO      STHBV3
     C                   END
     C                   END
     C                   END
     C     STHBV3        TAG
     C                   MOVE      BVKDC         T1(XN2)
     C                   ADD       BVNT          T2(XN2)
     C*
     C                   Z-ADD     0             XN2               2 0
     C     XN2           DOWLT     37
     C                   ADD       1             XN2
     C     A1(XN2)       IFEQ      '  '
     C                   GOTO      STHBV4
     C                   ELSE
     C     A1(XN2)       IFEQ      BVKDC
     C                   GOTO      STHBV4
     C                   END
     C                   END
     C                   END
     C     STHBV4        TAG
     C                   MOVE      BVKDC         A1(XN2)
     C                   ADD       BVNT          A2(XN2)
     C*
     C                   END
     C  N34              GOTO      STHBV
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PRUKE         BEGSR
     C******************************************
     C                   Z-ADD     0             XN2               2 0
     C     XN2           DOWLT     49
     C                   ADD       1             XN2
     C     B1(XN2)       IFEQ      '  '
     C                   GOTO      STPRUK
     C                   END
     C                   END
     C*
     C     STPRUK        TAG
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE1
     C     XN2           IFGT      8
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE2
     C                   END
     C     XN2           IFGT      15
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE3
     C                   END
     C     XN2           IFGT      22
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE4
     C                   END
     C     XN2           IFGT      29
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE5
     C                   END
     C     XN2           IFGT      36
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE6
     C                   END
     C     XN2           IFGT      43
     C   27              ADD       1             XSIDE
     C   27              WRITE     LHEAD
     C   27              SETOFF                                       27
     C                   WRITE     LUKE7
     C                   END
     C                   WRITE     LUKE8
     C*
     C                   MOVE      XLÅU          XÅU2
     C                   MOVE      *BLANKS       B1
     C                   MOVE      *ZEROS        B2
     C*
     C                   ENDSR
     C*
     C******************************************
     C     TOTLIN        BEGSR
     C******************************************
     C                   Z-ADD     0             XN2               2 0
     C     XN2           DOWLT     49
     C                   ADD       1             XN2
     C     T1(XN2)       IFEQ      '  '
     C                   GOTO      STTOTL
     C                   END
     C                   END
     C*
     C     STTOTL        TAG
     C                   ADD       1             XSIDE
     C                   WRITE     LHEAD
     C                   WRITE     LTOT1
     C     XN2           IFGT      8
     C                   WRITE     LTOT2
     C                   END
     C     XN2           IFGT      15
     C                   WRITE     LTOT3
     C                   END
     C     XN2           IFGT      22
     C                   WRITE     LTOT4
     C                   END
     C     XN2           IFGT      29
     C                   WRITE     LTOT5
     C                   END
     C     XN2           IFGT      36
     C                   WRITE     LTOT6
     C                   END
     C     XN2           IFGT      43
     C                   WRITE     LTOT7
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     PLUKK         BEGSR
     C******************************************
     C   45              Z-ADD     0             XN
     C   45XN            DOWLT     5
     C                   ADD       1             XN
     C     CT(XN)        IFNE      '  '
     C                   MOVE      CT(XN)        YKDC
     C     BLV1WK        SETLL     BLV1LFW
     C                   SETOFF                                       60
     C     STPL          TAG
     C     BLV1WK        READE     BLV1LFW                                60
     C  N60              DO
     C     WFCDK         CHAIN     WFILCD                             33
     C  N33              UPDATE    WFILCDR
     C     WFCDK         CHAIN     BILLOF                             34
     C     WFCDK         CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPL
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              DO
     C                   MOVE      BVKDC         WFCKDC
     C                   MOVE      BVAVD         WFCAVD
     C                   MOVE      BVAVD         WFCOPD
     C                   WRITE     WFILCDR
     C                   END
     C                   END
     C  N60              GOTO      STPL
     C                   END
     C                   END
     C*
     C  N45              DO
     C                   MOVE      ' A'          YKDC
     C     BLV1WK        SETLL     BLV1LFW
     C                   SETOFF                                       60
     C     STPL2         TAG
     C                   READ      BLV1LFW                                60
     C  N60BVKDC         IFNE      '  '
     C     WFCDK         CHAIN     WFILCD                             33
     C  N33              UPDATE    WFILCDR
     C     WFCDK         CHAIN     BILLOF                             34
     C     WFCDK         CHAIN     HEADF                              34
     C  N34HEST          IFEQ      'S'
     C                   GOTO      STPL2
     C                   END
     C   33
     CAN 51              EXSR      TST1
     C   33
     CAN 52              EXSR      TST2
     C   33
     CAN 53              EXSR      TST3
     C   33
     CAN 54              EXSR      TST4
     C   33
     CAN 56              EXSR      TST6
     C   33
     CAN 57              EXSR      TST7
     C   33
     CAN 58              EXSR      TST8
     C   33              DO
     C                   MOVE      BVKDC         WFCKDC
     C                   MOVE      BVAVD         WFCAVD
     C                   MOVE      BVAVD         WFCOPD
     C                   WRITE     WFILCDR
     C                   END
     C                   END
     C  N60              GOTO      STPL2
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     TST0          BEGSR
     C******************************************
     C     UKKN2         IFNE      0
     C                   SELECT
     C     UKKD          WHENEQ    'R '
     C     UKKN2         COMP      BLKNR                              3333
     C     UKKD          WHENEQ    'A '
     C     UKKN2         COMP      BLKNA                              3333
     C     UKKD          WHENEQ    'M '
     C     UKKN2         COMP      BLKNM                              3333
     C     UKKD          WHENEQ    'N '
     C     UKKN2         COMP      BLKNN                              3333
     C     UKKD          WHENEQ    'SA'
     C     UKKN2         COMP      BLKNSA                             3333
     C     UKKD          WHENEQ    'K '
     C     UKKN2         COMP      BLKNK                              3333
     C     UKKD          WHENEQ    'KA'
     C     UKKN2         COMP      BLKNKA                             3333
     C     UKKD          WHENEQ    'F '
     C     UKKN2         COMP      BLKNRA                             3333
     C                   ENDSL
     C     *IN33         IFEQ      '1'
     C                   SETOFF                                       33
     C                   GOTO      SLTST0
     C                   END
     C                   END
      *
     C     URGF          IFNE      *BLANKS
     C     URGT          ORNE      *BLANKS
     C                   MOVE      '0'           *IN33
      * TEST FRA REGION
     C     URGF          IFNE      *BLANKS
     C     BLLSS         IFEQ      *BLANKS
     C                   MOVE      '1'           *IN33
     C                   ELSE
     C     BLLSS         CHAIN     STED2                              33
     C  N33KLKLK         IFNE      URGF
     C     KODLKK        CHAIN     KODTLK                             33
     C  N33KLKLK2        COMP      URGF                               3333
     C                   END
     C                   END
     C   33BLLSH         IFNE      *BLANKS
     C     BLLSH         CHAIN     STED2                              33
     C  N33KLKLK         IFNE      URGF
     C     KODLKK        CHAIN     KODTLK                             33
     C  N33KLKLK2        COMP      URGF                               3333
     C                   END
     C                   END
     C                   END
      * TEST TIL REGION
     C  N33URGT          IFNE      *BLANKS
     C     BLLOS         IFEQ      *BLANKS
     C                   MOVE      '1'           *IN33
     C                   ELSE
     C     BLLOS         CHAIN     STED2                              33
     C  N33KLKLK         IFNE      URGT
     C     KODLKK        CHAIN     KODTLK                             33
     C  N33KLKLK2        COMP      URGT                               3333
     C                   END
     C                   END
     C   33BLLOH         IFNE      *BLANKS
     C     BLLOH         CHAIN     STED2                              33
     C  N33KLKLK         IFNE      URGT
     C     KODLKK        CHAIN     KODTLK                             33
     C  N33KLKLK2        COMP      URGT                               3333
     C                   END
     C                   END
     C                   END
      *
     C     *IN33         IFEQ      '1'
     C                   SETOFF                                       33
     C                   GOTO      SLTST0
     C                   END
      *
     C                   END
      *
      *
     C                   SETON                                        33
     C     BLV1K         SETLL     BLV1LF
     C                   SETOFF                                       34
     C     STTST0        TAG
     C     BLV1K         READE     BLV1LF                                 34
     C  N34BVKDC         IFNE      '  '
     C                   GOTO      SLTST0
     C                   END
     C  N34              GOTO      STTST0
     C                   SETOFF                                       33
     C*
     C     SLTST0        ENDSR
     C*
     C******************************************
     C     TST1          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     AV(XN1)       IFNE      0
     C     AV(XN1)       ANDEQ     BLAVD
     C                   GOTO      SLTST1
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST1        ENDSR
     C*
     C******************************************
     C     TST2          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     TR(XN1)       IFNE      '    '
     C     TR(XN1)       ANDEQ     BLTR
     C                   GOTO      SLTST2
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST2        ENDSR
     C*
     C******************************************
     C     TST3          BEGSR
     C******************************************
     C     XLÅU          COMP      XÅUF                               33  33
     C   33XLÅU          COMP      XÅUT                                 3333
     C*
     C                   ENDSR
     C*
     C******************************************
     C     TST4          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     OT(XN1)       IFNE      '  '
     C     OT(XN1)       ANDEQ     HEOT
     C                   GOTO      SLTST4
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST4        ENDSR
     C*
     C******************************************
     C     TST5          BEGSR
     C******************************************
     C     BLV1K         SETLL     BLV1LF
     C                   SETOFF                                       34
     C     STTST5        TAG
     C     BLV1K         READE     BLV1LF                                 34
     C  N34BVKDC         IFNE      '  '
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     CT(XN1)       IFNE      '  '
     C     CT(XN1)       ANDEQ     BVKDC
     C                   GOTO      SLTST5
     C                   END
     C                   END
     C                   END
     C  N34              GOTO      STTST5
     C                   SETOFF                                       33
     C*
     C     SLTST5        ENDSR
     C*
     C******************************************
     C     TST6          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     LB(XN1)       IFNE      '     '
     C     LB(XN1)       ANDEQ     BLLB
     C                   GOTO      SLTST6
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST6        ENDSR
     C*
     C******************************************
     C     TST7          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     OB(XN1)       IFNE      '     '
     C     OB(XN1)       ANDEQ     BLOB
     C                   GOTO      SLTST7
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST7        ENDSR
     C*
     C******************************************
     C     TST8          BEGSR
     C******************************************
     C                   Z-ADD     0             XN1               1 0
     C     XN1           DOWLT     5
     C                   ADD       1             XN1
     C     RE(XN1)       IFNE      0
     C     RE(XN1)       ANDEQ     BLKNR
     C                   GOTO      SLTST8
     C                   END
     C                   END
     C                   SETOFF                                       33
     C*
     C     SLTST8        ENDSR
     C*
     C******************************************
     C     INIT          BEGSR
     C******************************************
     C     BLW1K         KLIST
     C                   KFLD                    YAVD
     C                   KFLD                    YDT
     C     BLW2K         KLIST
     C                   KFLD                    YTR
     C                   KFLD                    YDT
     C     BLW3K         KLIST
     C                   KFLD                    YCC
     C                   KFLD                    YÅR
     C                   KFLD                    YUKE
     C     BLW4K         KLIST
     C                   KFLD                    YLB
     C                   KFLD                    YDT
     C     BLW5K         KLIST
     C                   KFLD                    YOB
     C                   KFLD                    YDT
     C     BLW6K         KLIST
     C                   KFLD                    YKNR
     C                   KFLD                    YDT
     C     BILLK         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     BILLK2        KLIST
     C                   KFLD                    WFCAVD
     C                   KFLD                    WFCOPD
     C     BLV1K         KLIST
     C                   KFLD                    BLAVD
     C                   KFLD                    BLOPD
     C     BLV1WK        KLIST
     C                   KFLD                    YKDC
     C     HEADWK        KLIST
     C                   KFLD                    YOT
     C                   KFLD                    YDT
     C     HEADFK        KLIST
     C                   KFLD                    BLAVD
     C                   KFLD                    BLOPD
     C     WFCDWK        KLIST
     C                   KFLD                    YKDC
     C     WFCDK         KLIST
     C                   KFLD                    BVAVD
     C                   KFLD                    BVOPD
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    KUNDNR
     C     KODLKK        KLIST
     C                   KFLD                    KLKUNI
     C                   KFLD                    ST2LK
     C*
     C*===============================================
     C     *ENTRY        PLIST
     C                   PARM                    USG               3
     C                   PARM                    UDT               8
     C                   PARM                    UDTT              8
     C                   PARM                    USORT             1
     C                   PARM                    UAVD             20
     C                   PARM                    UTR              20
     C                   PARM                    UÅU               8
     C                   PARM                    UOT              10
     C                   PARM                    UCO              10
     C                   PARM                    ULB              25
     C                   PARM                    UOB              25
     C                   PARM                    UKN              40
     C                   PARM                    UKKN              8
     C                   PARM                    UKKD              2
     C                   PARM                    URGF              2
     C                   PARM                    URGT              2
     C                   MOVE      UKKN          UKKN2             8 0
     C*===============================================
     C*
     C                   MOVE      *ZEROS        YAVD              4 0
     C                   MOVE      *BLANKS       YTR               4
     C                   MOVE      *BLANKS       YLB               5
     C                   MOVE      *BLANKS       YOB               5
     C                   MOVE      *ZEROS        YKNR              8 0
     C                   MOVE      *BLANKS       YKDC              2
     C                   MOVE      *ZEROS        YCC               2 0
     C                   MOVE      *ZEROS        YÅR               2 0
     C                   MOVE      *ZEROS        YUKE              2 0
     C                   MOVE      'A'           YAUNI             1
     C                   MOVE      'OTY'         YOTUNI            3
     C                   MOVE      'LK '         KLKUNI
     C                   MOVE      *BLANKS       YOT               2
     C                   MOVE      *ZEROS        BLDTA
     C                   MOVE      *ZEROS        BLDTVH
     C                   MOVE      *ZEROS        XDTA
     C                   MOVE      *ZEROS        XDTV
     C                   MOVE      UDT           YDT               8 0
     C                   MOVE      UDTT          YDTT              8 0
     C                   MOVE      UAVD          XAV
     C                   MOVEA     UTR           TR
     C                   MOVE      *ZEROS        XÅUF
     C                   MOVEL     UÅU           XÅU4              4 0
     C     XÅU4          IFGT      0
     C                   MOVE      XÅU4          XÅUF
     C     XÅR           IFGT      50
     C                   MOVE      19            XCC
     C                   ELSE
     C                   MOVE      20            XCC
     C                   END
     C                   END
     C                   MOVE      *ZEROS        XÅUT
     C                   MOVE      UÅU           XÅU4              4 0
     C     XÅU4          IFGT      0
     C                   MOVE      XÅU4          XÅUT
     C     XÅRT          IFGT      50
     C                   MOVE      19            XCCT
     C                   ELSE
     C                   MOVE      20            XCCT
     C                   END
     C                   END
     C                   MOVE      *ZEROS        XLÅU
     C                   MOVEA     UOT           OT
     C                   MOVEA     UCO           CT
     C                   MOVEA     ULB           LB
     C                   MOVEA     UOB           OB
     C                   MOVE      UKN           XRE
     C*
     C                   MOVE      UYEAR         UDT3              2 0
     C                   MOVE      UMONTH        UDT2              2 0
     C                   MOVE      UDAY          UDT1              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT3          XIDAGÅ
     C                   MOVE      UDT2          XIDAGM
     C                   MOVE      UDT1          XIDAGD
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFM1        BEGSR
     C***********************************************
     C                   MOVE      BLDTAÅ        UDT3              2 0
     C                   MOVE      BLDTAM        UDT2              2 0
     C                   MOVE      BLDTAD        UDT1              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT3          XDTAÅ
     C                   MOVE      UDT2          XDTAM
     C                   MOVE      UDT1          XDTAD
     C                   MOVE      BLDTVÅ        UDT3              2 0
     C                   MOVE      BLDTVM        UDT2              2 0
     C                   MOVE      BLDTVD        UDT1              2 0
     C                   EXSR      KDTFMT
     C                   MOVE      UDT3          XDTVÅ
     C                   MOVE      UDT2          XDTVM
     C                   MOVE      UDT1          XDTVD
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C*
     C                   ENDSR
     C*
