      *
      *****************************************************************
      *** PROGRAM SKAL VISE BILL OF LADING                          ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER          ***
      *** LEDIGE INDIKATORER 02 04 06 09 13 15-26                   ***
      *** LEDIGE INDIKATORER 34-99                                  ***
      *****************************************************************
      *
     FBILLOF    IF   E           K DISK
     FBLADRT    IF   E           K DISK
     FBLV1LF    IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FHEADF     IF   E           K DISK
     FSYSJ52FI  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  BLDTRÅ                 1      4  0
     D  BLDTRM                 5      6  0
     D  BLDTRD                 7      8  0
     D  BLDTR                  1      8  0
     D                 DS
     D  WSDTRD                 1      2  0
     D  WSDTRM                 3      4  0
     D  WSDTRÅ                 5      6  0
     D  WSDTR                  1      6  0
     D                 DS
     D  WSDTAD                 1      2  0
     D  WSDTAM                 3      4  0
     D  WSDTAÅ                 5      6  0
     D  WSDTA                  1      6  0
     D                 DS
     D  BLDTAÅ                 1      4  0
     D  BLDTAM                 5      6  0
     D  BLDTAD                 7      8  0
     D  BLDTA                  1      8  0
     D                 DS
     D  WSDTVD                 1      2  0
     D  WSDTVM                 3      4  0
     D  WSDTVÅ                 5      6  0
     D  WSDTVH                 1      6  0
     D                 DS
     D  BLDTVÅ                 1      4  0
     D  BLDTVM                 5      6  0
     D  BLDTVD                 7      8  0
     D  BLDTVH                 1      8  0
     D                 DS
     D  WSDV2D                 1      2  0
     D  WSDV2M                 3      4  0
     D  WSDV2Å                 5      6  0
     D  WSDVH2                 1      6  0
     D                 DS
     D  BLDV2Å                 1      4  0
     D  BLDV2M                 5      6  0
     D  BLDV2D                 7      8  0
     D  BLDVH2                 1      8  0
     D                 DS
     D  WSDLHD                 1      2  0
     D  WSDLHM                 3      4  0
     D  WSDLHÅ                 5      6  0
     D  WSDLOH                 1      6  0
     D                 DS
     D  BLDLHÅ                 1      4  0
     D  BLDLHM                 5      6  0
     D  BLDLHD                 7      8  0
     D  BLDLOH                 1      8  0
     D                 DS
     D  WSNT01                 1      5  0
     D  WSNT02                 6     10  0
     D  WSNT03                11     15  0
     D  WSNT04                16     20  0
     D  NTV                    1     20  0
     D                                     DIM(4)
     D                 DS
     D  WSKD01                 1      2
     D  WSKD02                 3      4
     D  WSKD03                 5      6
     D  WSKD04                 7      8
     D  KCV                    1      8
     D                                     DIM(4)
     D                 DS
     D  WSMN01                 1     17
     D  WSMN02                18     34
     D  WSMN03                35     51
     D  WSMN04                52     68
     D  MNV                    1     68
     D                                     DIM(4)
     D                 DS
     D  WSVS01                 1     25
     D  WSVS02                26     50
     D  WSVS03                51     75
     D  WSVS04                76    100
     D  VSV                    1    100
     D                                     DIM(4)
     D                 DS
     D  WSVK01                 1      9  0
     D  WSVK02                10     18  0
     D  WSVK03                19     27  0
     D  WSVK04                28     36  0
     D  VKV                    1     36  0
     D                                     DIM(4)
     D                 DS
     D  WSM301                 1      9  3
     D  WSM302                10     18  3
     D  WSM303                19     27  3
     D  WSM304                28     36  3
     D  M3V                    1     36  3
     D                                     DIM(4)
     D                 DS
     D  WSEH01                 1      1
     D  WSEH02                 2      2
     D  WSEH03                 3      3
     D  WSEH04                 4      4
     D  EHV                    1      4  0
     D                                     DIM(4)
     D                 DS
     D  KNAVN                  1     30
     D  BLNAR                  1     18
     D                UDS
     D  UFIRM                  1      2
     C*
     C                   EXSR      INIT
     C     UFLAGG        IFEQ      9
     C                   GOTO      SLUTT
     C                   END
     C*
     C     START         TAG
     C  N27              EXFMT     BILDE01I
     C   27              EXFMT     BILDE01E
     C                   SETOFF                                       30
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C   01
     COR 03
     COR 12              GOTO      SLUTT
     C*
     C   07              DO
     C*** VIS OPPDRAG
     C     HEADFK        CHAIN     HEADF                              30
     C   30              MOVE      'SPO0103'     MSGNR
     C   30              GOTO      START
     C                   MOVE      *ZEROS        UFLAGG            1 0
     C                   MOVE      UFIRM         UFIRM2
     C                   CALL      'SYFM21A'
     C                   PARM                    UFIRM2            2
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        IFEQ      1
     C     UFLAGG        OREQ      3
     C                   GOTO      SLUTT
     C                   END
     C     UFLAGG        IFEQ      9
     C                   GOTO      START
     C                   END
     C*** VIS FAKTURA
     C                   CALL      'SYFM21B'
     C                   PARM                    UFIRM2
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      1
     C     UFLAGG        OREQ      3
     C                   GOTO      SLUTT
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C   05              DO
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYSJ52J'
     C                   PARM                    UAVD
     C                   PARM                    UOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      3                                      03
     C  N01
     CANN03              GOTO      START
     C                   GOTO      SLUTT
     C                   END
      *
     C   08              DO
     C                   SELECT
     C     LINNBR        WHENGE    4
     C     LINNBR        ANDLE     5
     C     *IN34         ANDEQ     '1'
     C                   EXFMT     ADRLINA
     C     LINNBR        WHENGE    6
     C     LINNBR        ANDLE     7
     C     *IN29         ANDEQ     '1'
     C                   EXFMT     ADRLINM
     C     LINNBR        WHENGE    8
     C     LINNBR        ANDLE     9
     C     *IN32         ANDEQ     '1'
     C                   EXFMT     ADRLINN
     C     LINNBR        WHENGE    15
     C     LINNBR        ANDLE     19
     C     POSNBR        ANDGE     41
     C     *IN35         ANDEQ     '1'
     C                   EXFMT     ADRLING
     C                   ENDSL
     C                   GOTO      START
     C                   END
     C*
     C   09              DO
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYSJ52B'
     C                   PARM                    UAVD
     C                   PARM                    BLOPD
     C                   PARM                    UFLAGG
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      3                                      03
     C  N01
     CANN03              GOTO      START
     C                   END
     C*
     C   10
     COR 11              DO
     C                   EXSR      TILV
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      3                                      03
     C  N01
     CANN03              GOTO      START
     C                   GOTO      SLUTT
     C                   END
     C*
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      START
     C                   END
     C*
     C                   Z-ADD     0             UFLAGG
     C*
     C     SLUTT         TAG
     C   01              Z-ADD     1             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     9             UFLAGG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TILV          BEGSR
     C***********************************************
     C                   MOVE      WSDTR         UDTR              6 0
     C   11              GOTO      STTV2
     C*
     C     STTV1         TAG
     C                   CALL      'SYSJ52E'
     C                   PARM                    UAVD
     C                   PARM                    BLOPD
     C                   PARM                    UDTR
     C                   PARM                    BLSG
     C                   PARM                    BLUKE
     C                   PARM                    BLAAR
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      6
     C                   GOTO      STTV2
     C                   ELSE
     C                   GOTO      SLTV
     C                   END
     C*
     C     STTV2         TAG
     C                   CALL      'SYSJ52F'
     C                   PARM                    UAVD
     C                   PARM                    BLOPD
     C                   PARM                    UDTR
     C                   PARM                    BLSG
     C                   PARM                    BLUKE
     C                   PARM                    BLAAR
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      5
     C                   GOTO      STTV1
     C                   END
     C*
     C     SLTV          ENDSR
     C*
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
     C     POSNBR        IFGE      6
     C     POSNBR        ANDLE     13
     C     LINNBR        IFEQ      4
     C                   MOVE      SOTXT2        YSKMOT            8
     C                   MOVE      BLKNA         YSKKNR            8 0
     C                   GOTO      STVISO
     C                   END
     C     LINNBR        IFEQ      6
     C                   MOVE      SOTXT3        YSKMOT
     C                   MOVE      BLKNM         YSKKNR
     C                   GOTO      STVISO
     C                   END
     C     LINNBR        IFEQ      8
     C                   MOVE      SOTXT4        YSKMOT
     C                   MOVE      BLKNN         YSKKNR
     C                   GOTO      STVISO
     C                   END
     C                   END
     C*
     C     LINNBR        IFEQ      10
     C     POSNBR        IFGE      11
     C     POSNBR        ANDLE     18
     C                   MOVE      SOTXT5        YSKMOT
     C                   MOVE      BLKNSA        YSKKNR
     C                   GOTO      STVISO
     C                   END
     C     POSNBR        IFGE      31
     C     POSNBR        ANDLE     38
     C                   MOVE      SOTXT6        YSKMOT
     C                   MOVE      BLKNK         YSKKNR
     C                   GOTO      STVISO
     C                   END
     C     POSNBR        IFGE      51
     C     POSNBR        ANDLE     58
     C                   MOVE      SOTXT7        YSKMOT
     C                   MOVE      BLKNKA        YSKKNR
     C                   GOTO      STVISO
     C                   END
     C     POSNBR        IFGE      71
     C     POSNBR        ANDLE     78
     C                   MOVE      SOTXT8        YSKMOT
     C                   MOVE      BLKNRA        YSKKNR
     C                   GOTO      STVISO
     C                   END
     C                   END
     C*
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
     C*
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    UFIRM
     C                   PARM                    YSKKNR
     C                   PARM                    YSKMOT
     C                   PARM                    UFLAGG
     C*
     C     SLVISO        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     BLK           KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     HEADFK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    BLKNR
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    USG               3
     C                   PARM                    UFLAGG            1 0
     C*
     C*** UFLAGG = 0  -->  FRA SPØRRING AV BOOKING (SYSJ50A)
     C*** UFLAGG = 1  -->  FRA SPØRRING AV BILL OF LADING (SYSJ52K)
     C     UFLAGG        COMP      1                                      31
     C                   Z-ADD     0             UFLAGG
     C*
     C                   MOVE      *ZEROS        WSDTR
     C                   MOVE      *ZEROS        BLDTR
     C                   MOVE      *ZEROS        WSDTA
     C                   MOVE      *ZEROS        BLDTA
     C                   MOVE      *ZEROS        WSDTVH
     C                   MOVE      *ZEROS        BLDTVH
     C                   MOVE      *ZEROS        WSDVH2
     C                   MOVE      *ZEROS        BLDVH2
     C                   MOVE      *ZEROS        WSDLOH
     C                   MOVE      *ZEROS        BLDLOH
     C*
     C     BLK           CHAIN     BILLOF                             33
     C   33              Z-ADD     9             UFLAGG
     C   33              GOTO      SLINIT
     C                   EXSR      KDTFMT
     C     BLUR          COMP      'G'                                    27
     C   27              EXSR      MOVADR
     C     KUND1K        CHAIN     CUNDL01                            33
     C   33              MOVE      *BLANKS       KNAVN
     C*
     C                   MOVE      'DIV3110'     XMSGNR            7            MELDING-ID
     C                   Z-ADD     3             XLEVEL            1 0          NIVÅ
     C                   Z-ADD     0             XRETUR            1 0          RETURKODE
     C                   Z-ADD     8             XMSGL             4 0          LENGDE PÅ MELDING
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT2            8
     C                   MOVE      'DIV3159'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT3            8
     C                   MOVE      'DIV3160'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT4            8
     C                   MOVE      'DIV3194'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT5            8
     C                   MOVE      'DIV1062'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT6            8
     C                   MOVE      'DIV3196'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT7            8
     C                   MOVE      'DIV3197'     XMSGNR
     C                   Z-ADD     3             XLEVEL
     C                   Z-ADD     0             XRETUR
     C                   Z-ADD     8             XMSGL
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          SOTXT8            8
     C*
     C     SLINIT        ENDSR
     C*
     C***********************************************
     C     MOVADR        BEGSR
     C***********************************************
     C     BLK           CHAIN     BLADRT                             33
     C                   MOVEL     BLAD0A        B2AD0A
     C                   MOVE      BTAD0A        B2AD0A
     C                   MOVEL     BLNAA         B2NAA
     C                   MOVE      BTNAA         B2NAA
     C                   MOVEL     BLAD1A        B2AD1A
     C                   MOVE      BTAD1A        B2AD1A
     C                   MOVEL     BLAD2A        B2AD2A
     C                   MOVE      BTAD2A        B2AD2A
     C                   MOVEL     BLAD3A        B2AD3A
     C                   MOVE      BTAD3A        B2AD3A
     C                   MOVEL     BLAD4A        B2AD4A
     C                   MOVE      BTAD4A        B2AD4A
     C                   SELECT
     C     BLAD0A        WHENNE    *BLANKS
     C                   MOVE      '1'           *IN34
     C                   MOVE      BLAD2A        BLAD3A
     C                   MOVE      BLAD1A        BLAD2A
     C                   MOVE      BLNAA         BLAD1A
     C                   MOVE      '(F8)'        BLAD1A
     C                   MOVE      BLAD0A        BLNAA
     C     BLAD4A        WHENNE    *BLANKS
     C     BTAD1A        ORNE      *BLANKS
     C     BTAD2A        ORNE      *BLANKS
     C     BTAD3A        ORNE      *BLANKS
     C                   MOVE      '1'           *IN34
     C                   MOVE      '(F8)'        BLAD1A
     C                   ENDSL
      *
     C                   MOVEL     BLAD0M        B2AD0M
     C                   MOVE      BTAD0M        B2AD0M
     C                   MOVEL     BLNAM         B2NAM
     C                   MOVE      BTNAM         B2NAM
     C                   MOVEL     BLAD1M        B2AD1M
     C                   MOVE      BTAD1M        B2AD1M
     C                   MOVEL     BLAD2M        B2AD2M
     C                   MOVE      BTAD2M        B2AD2M
     C                   MOVEL     BLAD3M        B2AD3M
     C                   MOVE      BTAD3M        B2AD3M
     C                   MOVEL     BLAD4M        B2AD4M
     C                   MOVE      BTAD4M        B2AD4M
     C                   SELECT
     C     BLAD0M        WHENNE    *BLANKS
     C                   MOVE      '1'           *IN29
     C                   MOVE      BLAD2M        BLAD3M
     C                   MOVE      BLAD1M        BLAD2M
     C                   MOVE      BLNAM         BLAD1M
     C                   MOVE      '(F8)'        BLAD1M
     C                   MOVE      BLAD0M        BLNAM
     C     BLAD4M        WHENNE    *BLANKS
     C     BTAD1M        ORNE      *BLANKS
     C     BTAD2M        ORNE      *BLANKS
     C     BTAD3M        ORNE      *BLANKS
     C                   MOVE      '1'           *IN29
     C                   MOVE      '(F8)'        BLAD1M
     C                   ENDSL
      *
     C                   MOVEL     BLAD0N        B2AD0N
     C                   MOVE      BTAD0N        B2AD0N
     C                   MOVEL     BLNAN         B2NAN
     C                   MOVE      BTNAN         B2NAN
     C                   MOVEL     BLAD1N        B2AD1N
     C                   MOVE      BTAD1N        B2AD1N
     C                   MOVEL     BLAD2N        B2AD2N
     C                   MOVE      BTAD2N        B2AD2N
     C                   MOVEL     BLAD3N        B2AD3N
     C                   MOVE      BTAD3N        B2AD3N
     C                   MOVEL     BLAD4N        B2AD4N
     C                   MOVE      BTAD4N        B2AD4N
     C                   SELECT
     C     BLAD0N        WHENNE    *BLANKS
     C                   MOVE      '1'           *IN32
     C                   MOVE      BLAD2N        BLAD3N
     C                   MOVE      BLAD1N        BLAD2N
     C                   MOVE      BLNAN         BLAD1N
     C                   MOVE      '(F8)'        BLAD1N
     C                   MOVE      BLAD0N        BLNAN
     C     BLAD4N        WHENNE    *BLANKS
     C     BTAD1N        ORNE      *BLANKS
     C     BTAD2N        ORNE      *BLANKS
     C     BTAD3N        ORNE      *BLANKS
     C                   MOVE      '1'           *IN32
     C                   MOVE      '(F8)'        BLAD1N
     C                   ENDSL
      *
     C                   MOVEL     BLAD0G        B2AD0G
     C                   MOVE      BTAD0G        B2AD0G
     C                   MOVEL     BLNAG         B2NAG
     C                   MOVE      BTNAG         B2NAG
     C                   MOVEL     BLAD1G        B2AD1G
     C                   MOVE      BTAD1G        B2AD1G
     C                   MOVEL     BLAD2G        B2AD2G
     C                   MOVE      BTAD2G        B2AD2G
     C                   MOVEL     BLAD3G        B2AD3G
     C                   MOVE      BTAD3G        B2AD3G
     C                   MOVEL     BLAD4G        B2AD4G
     C                   MOVE      BTAD4G        B2AD4G
     C                   SELECT
     C     BLAD0G        WHENNE    *BLANKS
     C                   MOVE      '1'           *IN35
     C                   MOVE      BLAD2G        BLAD3G
     C                   MOVE      BLAD1G        BLAD2G
     C                   MOVE      BLNAG         BLAD1G
     C                   MOVE      '(F8)'        BLAD1G
     C                   MOVE      BLAD0G        BLNAG
     C     BLAD4G        WHENNE    *BLANKS
     C     BTAD1G        ORNE      *BLANKS
     C     BTAD2G        ORNE      *BLANKS
     C     BTAD3G        ORNE      *BLANKS
     C                   MOVE      '1'           *IN35
     C                   MOVE      '(F8)'        BLAD1G
     C                   ENDSL
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             62
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      BLDTRD        UDT1              2 0
     C                   MOVE      BLDTRM        UDT2              2 0
     C                   MOVE      BLDTRÅ        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTRD
     C                   MOVE      UDT2          WSDTRM
     C                   MOVE      UDT3          WSDTRÅ
     C*
     C                   MOVE      BLDTAD        UDT1
     C                   MOVE      BLDTAM        UDT2
     C                   MOVE      BLDTAÅ        UDT3
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTAD
     C                   MOVE      UDT2          WSDTAM
     C                   MOVE      UDT3          WSDTAÅ
     C*
     C                   MOVE      BLDTVD        UDT1
     C                   MOVE      BLDTVM        UDT2
     C                   MOVE      BLDTVÅ        UDT3
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTVD
     C                   MOVE      UDT2          WSDTVM
     C                   MOVE      UDT3          WSDTVÅ
     C*
     C                   MOVE      BLDV2D        UDT1
     C                   MOVE      BLDV2M        UDT2
     C                   MOVE      BLDV2Å        UDT3
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDV2D
     C                   MOVE      UDT2          WSDV2M
     C                   MOVE      UDT3          WSDV2Å
     C*
     C                   MOVE      BLDLHD        UDT1
     C                   MOVE      BLDLHM        UDT2
     C                   MOVE      BLDLHÅ        UDT3
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDLHD
     C                   MOVE      UDT2          WSDLHM
     C                   MOVE      UDT3          WSDLHÅ
      * HENTER 4 FØRSTE LINJER AV MODELL-1 (F10) PÅ SKJERMEN
     C                   EXSR      HENTBV
     C*
     C                   ENDSR
      *
     C***********************************************
     C     HENTBV        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        NTV
     C                   MOVE      *BLANKS       KCV
     C                   MOVE      *BLANKS       MNV
     C                   MOVE      *BLANKS       VSV
     C                   MOVE      *ZEROS        VKV
     C                   MOVE      *ZEROS        M3V
     C                   MOVE      *BLANKS       EHV
     C     BLK           SETLL     BLV1LF                             33
     C     STHBV         TAG
     C     BLK           READE(N)  BLV1LF                                 33
     C  N33BVLI          IFLE      4
     C                   MOVE      BVLI          XN                1 0
     C                   MOVE      BVNT          NTV(XN)
     C                   MOVE      BVMN          MNV(XN)
     C                   MOVE      BVVS          VSV(XN)
     C                   MOVE      BVVKT         VKV(XN)
     C                   MOVE      BVM3          M3V(XN)
     C                   MOVE      BVENH         EHV(XN)
     C                   MOVE      BVKDC         KCV(XN)
     C                   GOTO      STHBV
     C                   END
      *
     C                   ENDSR
      *
