********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK PÅ BOOKINGREF
10XXX * 02 YBC PTF10 OPSJON 51 --> SE ARKIVERTE DOKUMENTER
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 03 YBC PTF11 VIS MODUS FOR IMPORT ELLER EKSPORT
********************************************************************
      *
      **************************************************************
      *** PROGRAM SKAL ARBEIDE MED BOOKING                       ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      **************************************************************
      *
     FHEADF     UF   E           K DISK
     FBILLOF    IF   E           K DISK
     FBOOKING   IF   E           K DISK
     FBOOKLF01  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN01R)
     FBOOKLF02  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN02R)
     FBOOKLF03  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN03R)
     FBOOKLF04  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN04R)
     FBOOKLF05  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN05R)
     FBOOKLF06  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN06R)
     FBOOKLF07  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN07R)
     FBOOKLF08  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN08R)
     FBOOKLF11  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN11R)
     FBOOKLF12  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN12R)
     FBOOKLF15  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN15R)
     FBOOKLF16  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN16R)
N01  FBOOKLF17  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN17R)
     FBOOKLF18  IF   E           K DISK    RENAME(BOOKINGR:BOOKIN18R)
     FBLJOINLF  IF   E           K DISK
     F                                     RENAME(BILLOFR:BLJLFR)
     F                                     RENAME(BLV1R:BLJLFRV1)
     F                                     RENAME(BLV2R:BLJLFRV2)
     FBLV1      IF   E           K DISK
     FBLV2      IF   E           K DISK
     FSADTRH    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FCDBOAT    IF   E           K DISK
     FKODTA     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FSTED2     IF   E           K DISK
     FTRAN      IF   E           K DISK
     FSYSJ81D   CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  BLMN                   1     17
     D  BVMN                   1     17
     D                 DS
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D  WSDT                   1      6  0
     D                 DS
     D  XDTÅ                   1      4  0
     D  XDTM                   5      6  0
     D  XDTD                   7      8  0
     D  XDT                    1      8  0
     D                 DS
     D  XÅR4                   1      4  0
     D  BOACC                  1      2  0
     D  BOAAR                  3      4  0
     D                 DS
     D  BODT1Å                 1      4  0
     D  BODT1M                 5      6  0
     D  BODT1D                 7      8  0
     D  BODT1                  1      8  0
     D                 DS
     D  XDT1D                  1      2  0
     D  XDT1M                  3      4  0
     D  XDT1Å                  5      6  0
     D  XDT1                   1      6  0
     D                 DS
     D  BLAVD                  1      4  0
     D  BVAVD                  1      4  0
     D                 DS
     D  BLOPD                  1      7  0
     D  BVOPD                  1      7  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     D  UUSER                301    310
      *
     C                   EXSR      INIT
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C                   MOVE      999999        WSDT
     C                   MOVE      12            WSTYPE
     C     USTAC1        CABEQ     'BK'          BG2
      *
     C     BG1           TAG
     C  N30
     CANN04WSAVD         IFEQ      0
     C                   Z-ADD     3             LINNBR
     C                   ELSE
     C                   Z-ADD     7             LINNBR
     C                   END
     C  N30
     CANN04              Z-ADD     28            POSNBR
     C                   EXSR      KDTFMT
     C                   EXFMT     BILDE
     C   03              GOTO      SLUTT
     C                   EXSR      KDTFMT
     C                   SETOFF                                       30
     C                   MOVEA     '000000000000'*IN(79)
E01  C                   MOVEA     '000000'      *IN(73)
      *
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
      *
     C   04              DO
     C                   EXSR      SØKDTA
     C                   GOTO      BG1
     C                   END
      *
     C     BG2           TAG
     C                   EXSR      TESTB
     C   30              GOTO      BG1
      *
     C                   EXSR      OPSJON
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C                   EXSR      SETKEY
     C     START1        TAG
     C                   EXSR      LESREC
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
     C                   EXSR      HINFO
     C                   WRITE     SUBFIL
     C                   EXSR      LESREC
     C  N94              END
     C                   END
     C*
     C                   MOVE      ZRECNO        XRECNO            4 0
     C     START3        TAG
     C  N30              Z-ADD     6             LINNBR
     C  N30              Z-ADD     2             POSNBR
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYVARE
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C                   SETOFF                                       9830
      *** AVSLUTT
     C   03              GOTO      SLUTT
      *
     C   04              DO
     C                   EXSR      SØKDT2
     C                   GOTO      START3
     C                   END
     C   05              GOTO      START
     C     START4        TAG
     C   06              DO
     C                   EXSR      CRTBK
     C                   GOTO      START3
     C                   END
     C   08              GOTO      BG1
     C   12              GOTO      BG1
     C   13
     COR 14              DO
     C                   EXSR      BYTTMD
     C                   GOTO      START3
     C                   END
     C   23              DO
     C                   EXSR      OPSJON
     C                   GOTO      START3
     C                   END
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   Z-ADD     XRECNO        ZRECNO
     C                   SETOFF                                       25
     C                   GOTO      START2
     C                   END
      *
     C     WSAVDA        IFNE      UAVD
     C     WSSGA         ORNE      USG
     C                   EXSR      TESTB0
     C   30              GOTO      START3
     C                   END
      *
     C     W2NR          IFNE      0                                            1<-B
     C     W2OPD         ORNE      0
     C     W2SG          ORNE      *BLANKS
     C     W2UKE         ORNE      0
     C     W2KNR         ORNE      0
     C     W2TR          ORNE      *BLANKS
     C     W2KNA         ORNE      0
     C     W2LB          ORNE      *BLANKS
     C     W2OB          ORNE      *BLANKS
     C     W2NR          IFEQ      0                                             2<-B
     C                   EXSR      NYSØK
     C     *IN30         IFEQ      '1'                                            3Z-B
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C                   ELSE                                                     3
     C                   GOTO      START
     C                   END                                                      3<-E
     C                   ELSE                                                    2
     C     W2NR          COMP      1                                      06
     C   06              DO                                                       3<-B
     C     W2AVD         IFNE      0                                               4<-B
     C                   MOVE      W2AVD         WSAVDA
     C                   MOVE      W2AVD         WSAVD
     C                   MOVE      W2AVD         UAVD
     C                   END                                                       4<-E
     C                   MOVE      *ZEROS        W2NR
     C                   MOVE      *ZEROS        W2AVD
     C                   GOTO      START4
     C                   END                                                      3<-E
     C     W2OPD         IFEQ      0                                              3<-B
     C                   SETON                                        9830
     C                   MOVE      'YBC0039'     MSGNR
     C                   ELSE                                                     3
     C                   EXSR      NYOPT
     C                   END                                                      3<-E
     C                   MOVE      *BLANKS       W2SG
     C                   MOVE      *ZEROS        W2UKE
     C                   MOVE      *ZEROS        W2DT
     C                   MOVE      *ZEROS        W2KNR
     C                   MOVE      *BLANKS       W2TR
     C                   MOVE      *ZEROS        W2KNA
     C                   MOVE      *BLANKS       W2LB
     C                   MOVE      *BLANKS       W2OB
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C                   END                                                     2<-E
     C                   ELSE                                                   1
     C     W2AVD         IFNE      0                                             2<-B
     C                   MOVE      W2AVD         WSAVD
     C                   MOVE      *ZEROS        W2AVD
     C                   GOTO      START
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      BHENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SELECT
     C     USTAC3        WHENEQ    'BK'
     C                   MOVE      USTAC2        UTILMD
     C                   MOVE      *BLANKS       USTAC3
     C     USTAC2        WHENEQ    'BK'
     C                   MOVE      USTAC1        UTILMD
     C                   MOVE      *BLANKS       USTAC2
     C                   ENDSL
     C                   SETON                                        LR
     C                   RETURN
      *
      ***********************************************
     C     BYTTMD        BEGSR
      ***********************************************
     C     STBMD         TAG
      * TIL OPPDRAG
     C   13              DO                                                     1<-B
     C                   MOVE      'OP'          UTILMD
     C                   SELECT                                                  2<-B
     C     USTAC1        WHENEQ    'OP'
     C                   MOVE      *BLANKS       USTAC3
     C                   MOVE      *BLANKS       USTAC2
     C                   SETON                                        LR
     C                   RETURN
     C     USTAC2        WHENEQ    'OP'
     C                   MOVE      *BLANKS       USTAC3
     C                   SETON                                        LR
     C                   RETURN
     C     USTAC2        WHENEQ    'BL'
     C                   MOVE      'OP'          USTAC3
     C                   CALL      'SYOP01R'
     C                   PARM                    UUR
     C                   PARM                    USTAC1
     C                   PARM                    USTAC2
     C                   PARM                    USTAC3
     C                   PARM                    UTILMD
     C     UTILMD        IFEQ      'BL'                                           3<-B
     C                   GOTO      SLBMD
     C                   ELSE                                                     3
     C                   MOVE      *BLANKS       USTAC2
     C                   SETON                                        LR
     C                   RETURN
     C                   END                                                      3<-E
     C                   OTHER
     C                   MOVE      'OP'          USTAC2
     C                   CALL      'SYOP01R'
     C                   PARM                    UUR
     C                   PARM                    USTAC1
     C                   PARM                    USTAC2
     C                   PARM                    USTAC3
     C                   PARM                    UTILMD
     C     UTILMD        IFEQ      'BL'                                           3<-B
     C                   GOTO      SLBMD
     C                   ELSE                                                     3
     C                   MOVE      '0'           *IN13
     C                   MOVE      '1'           *IN15
     C                   END                                                      3<-E
     C                   ENDSL                                                   2<-E
     C                   END                                                    1<-E
      * TIL BL
     C   14              DO                                                     1<-B
     C                   MOVE      'BL'          UTILMD
     C                   SELECT                                                  2<-B
     C     USTAC1        WHENEQ    'BL'
     C                   MOVE      *BLANKS       USTAC3
     C                   MOVE      *BLANKS       USTAC2
     C                   SETON                                        LR
     C                   RETURN
     C     USTAC2        WHENEQ    'BL'
     C                   MOVE      *BLANKS       USTAC3
     C                   SETON                                        LR
     C                   RETURN
     C     USTAC2        WHENEQ    'BK'
     C                   MOVE      'BL'          USTAC3
     C                   CALL      'SYSJ80R'
     C                   PARM                    UUR
     C                   PARM                    USTAC1
     C                   PARM                    USTAC2
     C                   PARM                    USTAC3
     C                   PARM                    UTILMD
     C     UTILMD        IFEQ      'BK'                                           3<-B
     C                   GOTO      SLBMD
     C                   ELSE                                                     3
     C                   MOVE      *BLANKS       USTAC2
     C                   SETON                                        LR
     C                   RETURN
     C                   END                                                      3<-E
     C                   OTHER
     C                   MOVE      'BL'          USTAC2
     C                   CALL      'SYSJ80R'
     C                   PARM                    UUR
     C                   PARM                    USTAC1
     C                   PARM                    USTAC2
     C                   PARM                    USTAC3
     C                   PARM                    UTILMD
     C     UTILMD        IFEQ      'BK'                                           3<-B
     C                   GOTO      SLBMD
     C                   ELSE                                                     3
     C                   MOVE      '1'           *IN13
     C                   MOVE      '0'           *IN15
     C                   GOTO      STBMD
     C                   END                                                      3<-E
     C                   ENDSL                                                   2<-E
     C                   END                                                    1<-E
      *
     C     SLBMD         ENDSR
      *
      ***********************************************
     C     TESTB0        BEGSR
      ***********************************************
     C     KODAKA        CHAIN     KODTA                              96
     C     *IN96         IFEQ      '1'
     C                   MOVE      'SPA0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     13            POSNBR
     C                   END
     C     KODSKA        CHAIN     KODTSF                             95
     C     *IN95         IFEQ      '1'
     C     *IN30         ANDEQ     '0'
     C                   MOVE      'SPS0001'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     19            POSNBR
     C                   END
      *
     C     *IN30         IFEQ      '0'
     C                   MOVE      WSAVDA        UAVD
     C                   MOVE      WSSGA         USG
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     TESTB         BEGSR
      ***********************************************
     C                   MOVEA     '00000000'    *IN(41)
     C                   MOVEA     '000000'      *IN(49)
      *
     C     WSAVD         IFEQ      0
     C     WSTYPE        CABEQ     5             STTB1
     C     WSTYPE        CABEQ     8             STTB1
     C     WSTYPE        CABEQ     13            STTB1
     C                   END
     C     KODTAK        CHAIN     KODTA                              90
     C   90              MOVE      'SPA0001'     MSGNR
     C   90              SETON                                        30
     C     STTB1         TAG
      *
     C     WSDT          IFNE      0
     C     WSDT          IFEQ      999999
     C     WSTYPE        ANDEQ     12
     C                   MOVE      99999999      XDT
     C                   GOTO      STTB2
     C                   END
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTD         UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      89
     C   89
     CANN30              MOVE      'SPD0001'     MSGNR
     C   89              SETON                                        30
     C                   END
      *
     C     WSDT          IFEQ      0
     C                   MOVE      *ZEROS        XDT
     C                   ELSE
     C                   MOVE      WSDTD         XDTD
     C                   MOVE      WSDTM         XDTM
     C     WSDTÅ         IFGT      50
     C     WSDTÅ         ADD       1900          XDTÅ
     C                   ELSE
     C     WSDTÅ         ADD       2000          XDTÅ
     C                   END
     C                   END
     C*
     C     WSTYPE        COMP      0                                      88
S01  C* N88WSTYPE        COMP      13                                 88
N01  C  N88WSTYPE        COMP      14                                 88
     C   88
     CANN30              MOVE      'SPN0104'     MSGNR
     C   88              SETON                                        30
     C*
     C     WSUKE         COMP      53                                 87
     C   87
     CANN30              MOVE      'SPU0101'     MSGNR
     C   87              SETON                                        30
     C*
     C     WSUKET        IFEQ      0
     C                   MOVE      WSUKE         WSUKET
     C                   ELSE
     C     WSUKET        COMP      53                                 86
     C   86
     CANN30              MOVE      'SPU0101'     MSGNR
     C   86              SETON                                        30
     C                   END
     C*
     C  N87WSTYPE        IFEQ      1
     C     WSUKE         COMP      0                                      87
     C   87
     CANN30              MOVE      'SPU0101'     MSGNR
     C   87              SETON                                        30
     C  N87WSÅR          IFGT      50
     C     WSÅR          ADD       1900          WSÅR4             4 0
     C                   ELSE
     C     WSÅR          ADD       2000          WSÅR4
     C                   END
     C                   END
     C*
     C     WSTYPE        IFEQ      2
     C     KUNDRK        CHAIN     CUNDL01                            85
     C   85
     CANN30              MOVE      'SPK0121'     MSGNR
     C   85              SETON                                        30
     C  N85              MOVE      KNAVN         XNARAS
     C                   END
     C*
     C     WSTYPE        IFEQ      3
     C     WSAVD         IFEQ      0
     C     WSTR          COMP      *BLANKS                                84
     C                   ELSE
     C     BOO3KT        SETLL     BOOKLF03
     C     WSAVD         READE     BOOKLF03                               84
     C  N84WSTR          COMP      BOTR                               8484
     C                   END
     C   84
     CANN30              MOVE      'SPT0102'     MSGNR
     C   84              SETON                                        30
     C                   END
     C*
     C     WSTYPE        IFEQ      4
     C     KUNDAK        CHAIN     CUNDL01                            83
     C   83
     CANN30              MOVE      'SPK0121'     MSGNR
     C   83              SETON                                        30
     C  N83              MOVE      KNAVN         XNARAS
     C                   END
     C*
     C     WSTYPE        IFEQ      5
     C     WSLB          CHAIN     CDBOAT                             82
     C   82
     CANN30              MOVE      'SPB0102'     MSGNR
     C   82              SETON                                        30
     C  N82              MOVE      CBNAB         XNAB
     C                   END
     C*
     C     WSTYPE        IFEQ      6
     C     WSLSH         CHAIN     STED2                              81
     C   81
     CANN30              MOVE      'SPS0102'     MSGNR
     C   81              SETON                                        30
     C  N81              MOVE      ST2NVN        XNASTD
     C                   END
     C*
     C     WSTYPE        IFEQ      7
     C     KUNDSK        CHAIN     CUNDL01                            80
     C   80
     CANN30              MOVE      'SPK0121'     MSGNR
     C   80              SETON                                        30
     C  N80              MOVE      KNAVN         XNARAS
     C                   END
     C*
     C     WSTYPE        IFEQ      8
     C     WSOB          CHAIN     CDBOAT                             79
     C   79
     CANN30              MOVE      'SPB0106'     MSGNR
     C   79              SETON                                        30
     C  N79              MOVE      CBNAB         XNAB
     C                   END
     C*
     C     WSTYPE        IFEQ      9
     C     WSOPD         COMP      0                                      78
     C   78
     CANN30              MOVE      'SPO0016'     MSGNR
     C   78              SETON                                        30
     C                   END
     C*
     C     WSTYPE        IFEQ      10
     C     WSAVD         IFEQ      0
     C     WSREFN        COMP      *BLANKS                                77
     C                   ELSE
     C     BOOBKT        SETLL     BOOKLF11
     C     WSAVD         READE     BOOKLF11                               77
     C                   END
     C   77
     CANN30              MOVE      'DIV4103'     MSGNR
     C   77              SETON                                        30
     C                   END
     C*
     C     WSTYPE        IFEQ      11
     C     WSLOH         CHAIN     STED2                              76
     C   76
     CANN30              MOVE      'SPS0104'     MSGNR
     C   76              SETON                                        30
     C  N76              MOVE      ST2NVN        XNASTD
     C                   END
     C*
     C     STTB2         TAG
     C     WSTYPE        IFEQ      12
     C     KODSFK        CHAIN     KODTSF                             75
     C   75
     CANN30              MOVE      'SPS0001'     MSGNR
     C   75              SETON                                        30
     C                   END
N01  C*
N01  C     WSTYPE        IFEQ      13
N01  C     WSAVD         IFEQ      0
N01  C     WSMN          COMP      *BLANKS                                74
N01  C                   ELSE
N01  C     BLJLFK        SETLL     BLJOINLF
N01  C                   READ      BLJOINLF                               74
N01  C                   END
N01  C   74
N01  CANN30              MOVE      'YBC1962'     MSGNR
N01  C   74              SETON                                        30
N01  C                   END
N01  C*
N01  C     WSTYPE        IFEQ      14
N01  C     WSAVD         IFEQ      0
N01  C     WSBKNL        COMP      *BLANKS                                73
N01  C                   ELSE
N01  C     BOOKK17       SETLL     BOOKLF17
N01  C     WSAVD         READE     BOOKLF17                               73
N01  C                   END
N01  C   73
N01  CANN30              MOVE      'YBC1963'     MSGNR
N01  C   73              SETON                                        30
N01  C                   END
     C*
     C     *IN30         IFEQ      '0'
     C     WSTYPE        ADD       40            XN                3 0
     C                   MOVE      '1'           *IN(XN)
     C                   ELSE
     C   75
N01  COR 73
N01  COR 74
     COR 76
     COR 77
     COR 78
     COR 79
     COR 80
     COR 81              Z-ADD     28            POSNBR
     C   82
     COR 83
     COR 84
     COR 85              Z-ADD     28            POSNBR
     C   86              Z-ADD     59            POSNBR
     C   87              Z-ADD     42            POSNBR
     C   88
     COR 89
     COR 90              Z-ADD     28            POSNBR
N01  C   73              Z-ADD     22            LINNBR
N01  C   74              Z-ADD     21            LINNBR
     C   75              Z-ADD     20            LINNBR
     C   76              Z-ADD     19            LINNBR
     C   77              Z-ADD     18            LINNBR
     C   78              Z-ADD     17            LINNBR
     C   79              Z-ADD     16            LINNBR
     C   80              Z-ADD     15            LINNBR
     C   81              Z-ADD     14            LINNBR
     C   82              Z-ADD     13            LINNBR
     C   83              Z-ADD     12            LINNBR
     C   84              Z-ADD     11            LINNBR
     C   85              Z-ADD     10            LINNBR
     C   86
     COR 87              Z-ADD     9             LINNBR
     C   88              Z-ADD     7             LINNBR
     C   89              Z-ADD     6             LINNBR
     C   90              Z-ADD     3             LINNBR
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     NYSØK         BEGSR
      ***********************************************
     C                   MOVE      WSAVD         XAVD3             4 0
     C                   CLEAR                   BILDE
     C                   MOVE      XAVD3         WSAVD
     C                   MOVE      UYEAR         WSÅR
     C     W2AVD         IFEQ      0
     C     WSAVD         IFEQ      0
     C                   MOVE      UAVD          WSAVD
     C                   END
     C                   ELSE
     C                   MOVE      W2AVD         WSAVD
     C                   END
      *
     C                   SELECT
     C     W2OPD         WHENNE    0
     C                   MOVE      W2OPD         WSOPD
     C                   MOVE      9             WSTYPE
     C     W2SG          WHENNE    *BLANKS
     C                   MOVE      W2SG          WSSG
     C                   MOVE      12            WSTYPE
     C     W2UKE         WHENNE    0
     C                   MOVE      W2UKE         WSUKE
     C                   MOVE      1             WSTYPE
     C     W2KNR         WHENNE    0
     C                   MOVE      W2KNR         WSKNR
     C                   MOVE      2             WSTYPE
     C     W2TR          WHENNE    *BLANKS
     C                   MOVE      W2TR          WSTR
     C                   MOVE      3             WSTYPE
     C     W2KNA         WHENNE    0
     C                   MOVE      W2KNA         WSKNA
     C                   MOVE      4             WSTYPE
     C     W2LB          WHENNE    *BLANKS
     C                   MOVE      W2LB          WSLB
     C                   MOVE      5             WSTYPE
     C     W2OB          WHENNE    *BLANKS
     C                   MOVE      W2OB          WSOB
     C                   MOVE      8             WSTYPE
     C                   ENDSL
      *
     C                   MOVE      W2DT          WSDT
     C                   MOVE      *ZEROS        W2AVD
     C                   MOVE      *ZEROS        W2OPD
     C                   MOVE      *BLANKS       W2SG
     C                   MOVE      *ZEROS        W2UKE
     C                   MOVE      *ZEROS        W2DT
     C                   MOVE      *ZEROS        W2KNR
     C                   MOVE      *BLANKS       W2TR
     C                   MOVE      *ZEROS        W2KNA
     C                   MOVE      *BLANKS       W2LB
     C                   MOVE      *BLANKS       W2OB
      *
     C                   EXSR      TESTB
      *
     C                   ENDSR
      *
      ***********************************************
     C     NYOPT         BEGSR
      ***********************************************
     C     W2AVD         IFEQ      0
     C                   MOVE      WSAVD         W2AVD
     C                   END
     C     WRK2K         CHAIN     BOOKING                            98
     C  N98W2NR          IFEQ      11
     C     WRK2K         CHAIN     BILLOF                             98
     C                   END
     C   98              DO
     C                   MOVE      'SPO0002'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   MOVE      '1'           *IN90
      *
     C                   SELECT
     C     W2NR          WHENEQ    2
     C     BOST          IFNE      ' '
     C     BOST          ANDNE     'P'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'SPO0006'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   EXSR      CHGBK
     C     W2NR          WHENEQ    3
     C                   MOVE      *ZEROS        UFLAGG
     C                   EXSR      CPYBO
     C     W2NR          WHENEQ    5
     C                   EXSR      DSPBO
     C     W2NR          WHENEQ    7
     C                   EXSR      WRKFV
     C     W2NR          WHENEQ    8
     C                   EXSR      WRKFT
     C     W2NR          WHENEQ    11
     C     USG           IFNE      BLSG
     C                   MOVE      '1'           *IN98
     C                   MOVE      'SPS0014'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C     BLST          IFNE      ' '
     C     BLST          ANDNE     'P'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'SPO0006'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   EXSR      CHGBL
     C     W2NR          WHENEQ    12
     C     WRK2K         CHAIN(N)  HEADF                              98
     C     HEST          IFNE      ' '
     C     HEST          ANDNE     'C'
     C     HEST          ANDNE     'U'
     C     HEST          ANDNE     'O'
     C     HEST          ANDNE     'F'
     C     HEST          ANDNE     'K'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   EXSR      CHGOPD
     C     W2NR          WHENEQ    13
     C     WRK2K         CHAIN(N)  HEADF                              98
     C     HEST          IFEQ      'S'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   EXSR      CHGFAK
     C     W2NR          WHENEQ    14
     C     HEST          IFNE      ' '
     C     HEST          ANDNE     'C'
     C     HEST          ANDNE     'U'
     C     HEST          ANDNE     'O'
     C     HEST          ANDNE     'F'
     C     HEST          ANDNE     'K'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLOPT
     C                   END
     C                   EXSR      CHGFBR
     C     W2NR          WHENEQ    15
     C                   EXSR      CHGBKT
     C     W2NR          WHENEQ    16
     C                   EXSR      CHGBLL
     C     W2NR          WHENEQ    17
     C                   EXSR      CHGFM
     C     W2NR          WHENEQ    18
     C                   EXSR      CHGSAD
     C     W2NR          WHENEQ    19
     C                   EXSR      CHGSAT
     C     W2NR          WHENEQ    21
     C                   EXSR      DSPBL
     C     W2NR          WHENEQ    22
     C                   EXSR      DSPOPD
     C     W2NR          WHENEQ    23
     C                   EXSR      DSPFAK
     C     W2NR          WHENEQ    24
     C                   EXSR      DSPFBR
     C     W2NR          WHENEQ    25
     C                   EXSR      DSPBKT
     C     W2NR          WHENEQ    26
     C                   EXSR      DSPBLL
     C     W2NR          WHENEQ    27
     C                   EXSR      DSPFM
     C     W2NR          WHENEQ    28
     C                   EXSR      DSPSAD
     C     W2NR          WHENEQ    29
     C                   EXSR      DSPSAT
     C     W2NR          WHENEQ    33
     C                   Z-ADD     1             UFLAGG
     C                   EXSR      CPYBO
N02  C     W2NR          WHENEQ    51
N02  C                   EXSR      ARKIVS
     C                   OTHER
     C                   MOVE      'DIV0012'     MSGNR
     C                   MOVE      '1'           *IN98
     C                   GOTO      SLOPT
     C                   ENDSL
      *
     C     SLOPT         TAG
     C   98              MOVE      '1'           *IN30
     C                   MOVE      '0'           *IN90
     C                   MOVE      *ZEROS        W2NR
     C  N98              MOVE      *ZEROS        W2AVD
     C  N98              MOVE      *ZEROS        W2OPD
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   Z-ADD     1             UFLAGG
      *
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     35
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNR
     C                   PARM                    UFIRM
     C                   PARM                    USØKNV           30
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     35
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNA
     C                   PARM                    UFIRM
     C                   PARM                    USØKNV
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     29
     C                   CALL      'SYSJ17A'
     C                   PARM                    WSKNR
     C                   PARM                    WSTR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     32
     C                   CALL      'SYSJ11A'
     C                   PARM                    WSLB
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     32
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSLSH
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     32
     C                   CALL      'SYSJ11A'
     C                   PARM                    WSOB
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     28
     C     POSNBR        ANDLE     32
     C                   MOVE      *BLANKS       UNVN
     C                   MOVE      *BLANKS       ULK
     C                   CALL      'SYFI10F'
     C                   PARM                    WSLOH
     C                   PARM                    UNVN             30
     C                   PARM                    ULK               2
     C                   GOTO      SLSØK
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK         ENDSR
      *
     C***********************************************
     C     SØKDT2        BEGSR
     C***********************************************
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     1             UFLAGG
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     32
     C     POSNBR        ANDLE     39
     C                   CALL      'SOEKKUN'
     C                   PARM                    W2KNR
     C                   PARM                    UFIRM
     C                   PARM                    USØKNV           30
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     46
     C     POSNBR        ANDLE     53
     C                   CALL      'SOEKKUN'
     C                   PARM                    W2KNA
     C                   PARM                    UFIRM
     C                   PARM                    USØKNV
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     41
     C     POSNBR        ANDLE     42
     C                   CALL      'SYSJ17A'
     C                   PARM                    W2KNR
     C                   PARM                    W2TR
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     67
     C     POSNBR        ANDLE     71
     C                   CALL      'SYSJ11A'
     C                   PARM                    WSLB
     C                   GOTO      SLSØK2
     C                   END
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     73
     C     POSNBR        ANDLE     77
     C                   CALL      'SYSJ11A'
     C                   PARM                    WSOB
     C                   GOTO      SLSØK2
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
      *
     C     SLSØK2        ENDSR
      *
      ***********************************************
     C     CRTBK         BEGSR
      ***********************************************
     C                   MOVE      WSAVDA        UAVD2             4 0
     C                   MOVE      *ZEROS        UOPD2             7 0
     C                   MOVE      WSSGA         USG2              3
     C                   MOVE      *ZEROS        UAVD3             4 0
     C                   MOVE      *ZEROS        UOPD3             7 0
     C                   MOVE      'J'           XLAGNY            1
      *
     C                   EXSR      WRKBO
     C                   EXSR      VISBO
      *
     C                   ENDSR
      *
      ***********************************************
     C     VISBO         BEGSR
      ***********************************************
     C     UAVD2         IFNE      0                                            1<-B
     C     UOPD2         ANDNE     0
     C     BKKNY         CHAIN     BOOKING                            33
     C  N33              DO                                                      2<-B
     C                   EXSR      HINFO
     C     XLAGNY        IFEQ      'J'                                            3<-B
     C                   ADD       1             XRECNO
     C                   MOVE      XRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
      ***********************************************
     C     HINFO         BEGSR
      ***********************************************
N01  C   54              EVAL      BOREFN = BOBKNL
N01   *
     C     HEADFK        CHAIN(N)  HEADF                              33
N03  C                   EVAL      BOUR   = HEUR
      *
     C                   MOVE      BOKNA         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     KNAVN         XNAA
     C                   ELSE
     C                   MOVE      *BLANKS       XNAA
     C                   MOVEL     BOKNA         XNAA
     C                   END
      *
     C                   MOVE      BOKNS         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     KNAVN         XNAS
     C                   ELSE
     C                   MOVE      *BLANKS       XNAS
     C                   MOVEL     BOKNA         XNAS
     C                   END
      *
     C     *IN52         IFEQ      '0'
     C     BLMN          ANDEQ     *BLANKS
     C     HEADFK        SETLL     BLV1
     C     HEADFK        READE     BLV1                                   33
     C     *IN33         DOWEQ     '0'
     C     BVMN          IFNE      *BLANKS
     C                   LEAVE
     C                   END
     C     HEADFK        READE     BLV1                                   33
     C  N33              ENDDO
     C     BVMN          IFNE      *BLANKS
     C     HEADFK        SETLL     BLV2
     C     HEADFK        READE     BLV2                                   33
     C     *IN33         DOWEQ     '0'
     C     BVMN          IFNE      *BLANKS
     C                   LEAVE
     C                   END
     C     HEADFK        READE     BLV2                                   33
     C  N33              ENDDO
     C                   END
     C                   END
      *
     C                   EXSR      KDTFMT
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGBK         BEGSR
      ***********************************************
     C                   MOVE      BOAVD         UAVD2
     C                   MOVE      BOOPD         UOPD2
     C                   MOVE      USG           USG2
     C                   MOVE      *ZEROS        UAVD3
     C                   MOVE      *ZEROS        UOPD3
      *
     C                   EXSR      WRKBO
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      'N'           XLAGNY
     C                   EXSR      VISBO
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     CPYBO         BEGSR
      ***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   MOVE      WSAVDA        UAVD2
     C                   MOVE      *ZEROS        UOPD2
     C                   MOVE      USG           USG2
     C                   MOVE      BOAVD         UAVD3
     C                   MOVE      BOOPD         UOPD3
     C                   MOVE      'J'           XLAGNY
      *
     C                   EXSR      WRKBO
      *
     C  N90              EXSR      VISBO
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPBO         BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYSJ52B'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      3                                      03
     C*
     C                   ENDSR
     C*
      ***********************************************
     C     WRKFV         BEGSR
      ***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   MOVE      *ZEROS        OTIKU1            8 0
     C                   MOVE      *ZEROS        OTIKU2            8 0
     C                   CALL      'SYFA64'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    OTIKU1
     C                   PARM                    OTIKU2
      *
     C                   ENDSR
      *
      ***********************************************
     C     WRKFT         BEGSR
      ***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
      ***********************************************
     C     WRKBO         BEGSR
      ***********************************************
N03  C                   IF        UUR = 'F'
N03  C                   Z-ADD     1             UFLAGG
N03  C                   ELSE
N03  C                   Z-ADD     2             UFLAGG
N03  C                   END
     C                   CALL      'SYSJ50'
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    USG2
     C                   PARM                    UAVD3
     C                   PARM                    UOPD3
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGBL         BEGSR
      ***********************************************
     C                   MOVE      BLAVD         UAVD2
     C                   MOVE      BLOPD         UOPD2
     C                   MOVE      USG           USG2
     C                   MOVE      *ZEROS        UAVD3
     C                   MOVE      *ZEROS        UOPD3
     C     BLUR          IFEQ      'F'
     C                   Z-ADD     1             UFLAGG
     C                   ELSE
     C                   Z-ADD     2             UFLAGG
     C                   END
      *
     C                   EXSR      WRKBL
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      'N'           XLAGNY
     C                   EXSR      VISBO
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     WRKBL         BEGSR
      ***********************************************
     C                   MOVE      'N'           UKUNB             1
     C                   CALL      'SYSJ50I'
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    USG2
     C                   PARM                    UKUNB
     C                   PARM                    UAVD3
     C                   PARM                    UOPD3
     C                   PARM                    UFLAGG
     C                   PARM      0             ULUNIK            9 0
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGOPD        BEGSR
      ***********************************************
     C                   MOVE      'CHG'         UTYPE             3
     C                   MOVE      BOAVD         UAVD2
     C                   MOVE      BOOPD         UOPD2
     C                   MOVE      HESG          USG2
      *
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      HEST          XST               1
     C     HEST          IFNE      'C'
     C     HEST          ANDNE     'U'
     C                   MOVE      ' '           HEST
     C                   END
     C                   EXCEPT    NYOPDS
      *
     C                   EXSR      WRKOPD
     C     *IN90         IFEQ      '0'
     C                   MOVE      'N'           XLAGNY
     C                   EXSR      VISBO
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C     HEADFK        CHAIN     HEADF                              33
     C     XST           IFEQ      'U'                                          1<-B
     C     HEOT          ANDNE     *BLANKS
     C                   MOVE      ' '           HEST
     C                   ELSE                                                   1
     C                   MOVE      XST           HEST
     C                   END                                                    1<-E
     C                   EXCEPT    NYOPDS
      *
     C                   ENDSR
      *
      ***********************************************
     C     WRKOPD        BEGSR
      ***********************************************
     C                   MOVE      ' '           UKODE             1
     C                   MOVE      ' '           UDUMMY            1
     C                   MOVE      *ZEROS        UAVDNY            4 0
      * SJØ EXPORT
     C                   CALL      'SYSE10'
     C                   PARM                    UAVD2
     C                   PARM                    UOPD2
     C                   PARM                    USG2
     C                   PARM                    UTYPE
     C                   PARM                    UKODE
     C                   PARM                    UAVDNY
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGFAK        BEGSR
      ***********************************************
     C                   MOVE      'CHF'         UTYPE             3
     C                   MOVE      BOAVD         UAVD2
     C                   MOVE      BOOPD         UOPD2
     C                   MOVE      HESG          USG2
      *
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      HEST          XST               1
     C                   MOVE      ' '           HEST
     C                   EXCEPT    NYOPDS
      *
     C                   EXSR      WRKOPD
     C     *IN90         IFEQ      '0'
     C                   EXSR      VISBO
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      XST           HEST
     C                   EXCEPT    NYOPDS
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGFBR        BEGSR
      ***********************************************
     C                   MOVE      BOAVD         UAVD2
     C                   MOVE      BOOPD         UOPD2
     C                   MOVE      HESG          USG2
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      'J'           HEPK1
     C                   EXCEPT    NYOPDP
     C                   EXSR      WRKFBR
      *
     C     *IN90         IFEQ      '0'
     C                   EXSR      VISBO
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     WRKFBR        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   MOVE      001           XFBNR             3 0
     C                   MOVE      *BLANKS       XKDME             1
     C                   MOVE      *BLANKS       XKDE              1
     C                   MOVE      *ZEROS        XTOLL             2 0
     C                   MOVE      *BLANKS       XMSG             62
     C                   MOVE      '2'           TEST              1
     C     KOD2AK        CHAIN     KODTA                              33
     C     HEKNT         IFEQ      0                                            1<-B
     C                   MOVE      *BLANKS       VMNAVN
     C                   ELSE                                                   1
     C     TRANK         CHAIN     TRAN                               33
     C   33              MOVE      *BLANKS       VMNAVN
     C                   END
     C                   CALL      'SYFI10A'
     C                   PARM                    FIFIRM
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    XFBNR
     C                   PARM                    KOAKNR
     C                   PARM                    VMNAVN
     C                   PARM                    XKDME
     C                   PARM                    XKDE
     C                   PARM                    XTOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    XMSG
     C                   PARM                    UFLAGG
     C                   PARM                    TEST
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGBKT        BEGSR
      ***********************************************
     C                   CALL      'SYSJ50C'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGBLL        BEGSR
      ***********************************************
     C                   CALL      'SYSJ50D'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGFM         BEGSR
      ***********************************************
     C                   Z-ADD     1             UFLAGG
     C                   CALL      'SYSJ25A'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM      BOSG          USG2
     C                   PARM                    UFLAGG
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGSAD        BEGSR
      ***********************************************
     C     HEST          IFNE      'U'
     C                   MOVE      BOAVD         UAVDAN            4
     C                   MOVE      BOOPD         UOPDAN            7
     C                   CALL      'SAD52CLD'
     C                   PARM                    UAVDAN
     C                   PARM                    UOPDAN
     C                   PARM      BOSG          USG2
     C                   END
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     CHGSAT        BEGSR
      ***********************************************
     C     HEST          IFNE      'U'
     C                   MOVE      'T'           UKODE             1
     C     HEADFK        CHAIN     SADTRH                             33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'CHG'         UTYPE             3
     C                   ELSE
     C                   MOVE      'CRT'         UTYPE
     C                   END
     C                   CALL      'SAD041CL'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM      BOSG          USG2
     C                   PARM                    UKODE
     C                   PARM                    UTYPE
     C                   END
      *
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPBL         BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   Z-ADD     1             UFLAGG            1 0
     C                   CALL      'SYSJ52I'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    BOSG
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      01
     C     UFLAGG        COMP      3                                      03
     C*
     C                   ENDSR
     C*
      ***********************************************
     C     DSPOPD        BEGSR
      ***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
      *
     C                   MOVE      *ZEROS        UFLAGG            1 0
     C                   CALL      'SYFM21A'
     C                   PARM                    UFIRM
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
     C     UFLAGG        IFEQ      0
     C                   CALL      'SYFM21B'
     C                   PARM                    UFIRM
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
     C                   END
      *
     C                   ENDSR
      *
      ***********************************************
     C     DSPFAK        BEGSR
      ***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SYFM21B'
     C                   PARM                    UFIRM
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPFBR        BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SYFM21C'
     C                   PARM                    UFIRM
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFBNR             3 0
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPBKT        BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SYSJ52C'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPBLL        BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SYSJ52D'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPFM         BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   Z-ADD     2             UFLAGG
     C                   CALL      'SYSJ25A'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM      BOSG          USG2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPSAD        BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SAD023A'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
     C***********************************************
     C     DSPSAT        BEGSR
     C***********************************************
     C     *IN90         IFEQ      '0'
     C                   MOVE      *ZEROS        WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   CALL      'SAD040A'
     C                   PARM      BOAVD         UAVD2
     C                   PARM      BOOPD         UOPD2
     C                   PARM                    UFLAGG
      *
     C                   ENDSR
      *
N02   ***********************************************
N02  C     ARKIVS        BEGSR
N02   ***********************************************
N02  C     *IN90         IFEQ      '0'
N02  C                   MOVE      *ZEROS        WSNR
N02  C                   UPDATE    SUBFIL
N02  C                   END
N02  C                   CALL      'ARC003'
N02  C                   PARM      BOAVD         UAVD2
N02  C                   PARM      BOOPD         UOPD2
N02  C                   PARM                    URUNDE           10
N02  C                   ENDSR
N02   *
     C***********************************************
     C     BHENT         BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
      *
     C     *IN98         IFEQ      '1'
     C   99              MOVE      '0'           *IN98
     C                   GOTO      SLHENT
     C                   ELSE
     C                   MOVE      '1'           *IN99
     C                   SELECT
     C     WSNR          WHENEQ    2
     C                   EXSR      CHGBK
     C     WSNR          WHENEQ    3
     C                   MOVE      *ZEROS        UFLAGG
     C                   EXSR      CPYBO
     C     WSNR          WHENEQ    5
     C                   EXSR      DSPBO
     C     WSNR          WHENEQ    7
     C                   EXSR      WRKFV
     C     WSNR          WHENEQ    8
     C                   EXSR      WRKFT
     C     WSNR          WHENEQ    11
     C     HEADFK        CHAIN     BILLOF                             98
     C     *IN98         IFEQ      '1'
     C                   MOVE      'SPO0002'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C     USG           IFNE      BLSG
     C                   MOVE      '1'           *IN98
     C                   MOVE      'SPS0014'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C     BLST          IFNE      ' '
     C     BLST          ANDNE     'P'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'SPO0006'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C                   EXSR      CHGBL
     C     WSNR          WHENEQ    12
     C     HEST          IFNE      ' '
     C     HEST          ANDNE     'C'
     C     HEST          ANDNE     'U'
     C     HEST          ANDNE     'O'
     C     HEST          ANDNE     'F'
     C     HEST          ANDNE     'K'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C                   EXSR      CHGOPD
     C     WSNR          WHENEQ    13
     C     HEST          IFEQ      'S'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C                   EXSR      CHGFAK
     C     WSNR          WHENEQ    14
     C     HEST          IFNE      ' '
     C     HEST          ANDNE     'C'
     C     HEST          ANDNE     'U'
     C     HEST          ANDNE     'O'
     C     HEST          ANDNE     'F'
     C     HEST          ANDNE     'K'
     C                   MOVE      '1'           *IN98
     C                   MOVE      'YBC0041'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C                   EXSR      CHGFBR
     C     WSNR          WHENEQ    15
     C                   EXSR      CHGBKT
     C     WSNR          WHENEQ    16
     C                   EXSR      CHGBLL
     C     WSNR          WHENEQ    17
     C                   EXSR      CHGFM
     C     WSNR          WHENEQ    18
     C                   EXSR      CHGSAD
     C     WSNR          WHENEQ    19
     C                   EXSR      CHGSAT
     C     WSNR          WHENEQ    21
     C                   EXSR      DSPBL
     C     WSNR          WHENEQ    22
     C                   EXSR      DSPOPD
     C     WSNR          WHENEQ    23
     C                   EXSR      DSPFAK
     C     WSNR          WHENEQ    24
     C                   EXSR      DSPFBR
     C     WSNR          WHENEQ    25
     C                   EXSR      DSPBKT
     C     WSNR          WHENEQ    26
     C                   EXSR      DSPBLL
     C     WSNR          WHENEQ    27
     C                   EXSR      DSPFM
     C     WSNR          WHENEQ    28
     C                   EXSR      DSPSAD
     C     WSNR          WHENEQ    29
     C                   EXSR      DSPSAT
     C     WSNR          WHENEQ    33
     C                   Z-ADD     1             UFLAGG
     C                   EXSR      CPYBO
N02  C     WSNR          WHENEQ    51
N02  C                   EXSR      ARKIVS
     C                   OTHER
     C                   MOVE      '1'           *IN98
     C                   GOTO      SLHENT
     C                   ENDSL
     C                   END
      *
     C                   ENDDO
      *
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     SETKEY        BEGSR
     C***********************************************
     C     WSAVD         COMP      0                                      40
     C   53              MOVE      '1'           *IN40
      *
     C   41              MOVEL     WSÅR4         YCC               2 0
     C   41              MOVE      WSÅR4         YÅR               2 0
     C   41              MOVE      WSUKE         YUKE              2 0
     C   42              MOVE      WSKNR         YKNR              8 0
     C   43              MOVE      WSTR          YTR               4
     C   44              MOVE      WSKNA         YKNA              8 0
     C   45              MOVE      WSLB          YLB               5
     C   46              MOVE      WSLSH         YLSH              5
     C   47              MOVE      WSKNS         YKNS              8 0
     C   48              MOVE      WSOB          YOB               5
     C   50              MOVE      WSREFN        YREFN            14
     C   51              MOVE      WSLOH         YLOH              5
     C   52              MOVE      WSSG          YSG               3
     C   53              MOVE      WSMN          YMN              17
N01  C   54              MOVE      WSBKNL        YBKNL            14
     C     *IN40         IFEQ      '0'
     C   41BOOK1K        SETLL     BOOKLF01
     C   42BOOK2K        SETLL     BOOKLF02
     C   43BOOK3K        SETLL     BOOKLF03
     C   44BOOK4K        SETLL     BOOKLF04
     C   45BOOK5K        SETLL     BOOKLF05
     C   46BOOK6K        SETLL     BOOKLF06
     C   47BOOK7K        SETLL     BOOKLF07
     C   48BOOK8K        SETLL     BOOKLF08
     C   49BOOKK         SETLL     BOOKING
     C   50BOOKBK        SETLL     BOOKLF11
     C   51BOOKCK        SETLL     BOOKLF12
     C   52BOOKGK        SETLL     BOOKLF16
N01  C   54BOOKK17       SETLL     BOOKLF17
     C                   ELSE
     C   45BOO25K        SETLL     BOOKLF15
     C   48BOO28K        SETLL     BOOKLF18
     C   53BLJLFK        SETLL     BLJOINLF
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     LESREC        BEGSR
     C***********************************************
     C     STLES         TAG
     C     *IN40         IFEQ      '0'                                          1<-B
     C   41WSAVD         READE     BOOKLF01                               94
     C   42WSAVD         READE     BOOKLF02                               94
     C   43WSAVD         READE     BOOKLF03                               94
     C   44WSAVD         READE     BOOKLF04                               94
     C   45WSAVD         READE     BOOKLF05                               94
     C   46WSAVD         READE     BOOKLF06                               94
     C   47WSAVD         READE     BOOKLF07                               94
     C   48WSAVD         READE     BOOKLF08                               94
     C   49WSAVD         READE     BOOKING                                94
     C   50WSAVD         READE     BOOKLF11                               94
     C   51WSAVD         READE     BOOKLF12                               94
     C   52XDT           IFEQ      99999999                                      2<-B
     C     WSAVD         READPE    BOOKLF16                               94
     C                   ELSE                                                    2
     C     WSAVD         READE     BOOKLF16                               94
     C                   END                                                     2<-E
     C   52
     CANN94WSSG          COMP      BOSG                               9494
N01  C   54WSAVD         READE     BOOKLF17                               94
     C                   ELSE                                                   1
     C   45WSLB          READE     BOOKLF15                               94
     C   48WSOB          READE     BOOKLF18                               94
     C   53              READ      BLJOINLF                               94
     C   53
     CANN94              DO                                                      2<-B
     C                   MOVE      BLMN          XMN              17
     C     HEADFK        CHAIN     BOOKING                            33
     C   33              GOTO      STLES
     C                   MOVE      XMN           BLMN
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      *
     C   41
     CANN94WSÅR4         COMP      XÅR4                               9494
     C   41
     CANN94WSUKET        COMP      BOUKE                                94
      *
     C  N41
     CANN49
     CANN94WSUKE         IFNE      0
     C     WSÅR4         IFNE      XÅR4
     C                   GOTO      STLES
     C                   END
     C     WSUKE         IFNE      BOUKE
     C                   GOTO      STLES
     C                   END
     C                   END
     C  N42
     CANN49
     CANN94WSKNR         IFNE      0
     C     WSKNR         ANDNE     BOKNR
     C                   GOTO      STLES
     C                   END
     C  N43
     CANN49
     CANN94WSTR          IFNE      *BLANKS
     C     WSTR          ANDNE     BOTR
     C                   GOTO      STLES
     C                   END
     C  N44
     CANN49
     CANN94WSKNA         IFNE      0
     C     WSKNA         ANDNE     BOKNA
     C                   GOTO      STLES
     C                   END
     C  N45
     CANN49
     CANN94WSLB          IFNE      *BLANKS
     C     WSLB          ANDNE     BOLB
     C                   GOTO      STLES
     C                   END
     C  N46
     CANN49
     CANN94WSLSH         IFNE      *BLANKS
     C     WSLSH         ANDNE     BOLSH
     C                   GOTO      STLES
     C                   END
     C  N47
     CANN49
     CANN94WSKNS         IFNE      0
     C     WSKNS         ANDNE     BOKNS
     C                   GOTO      STLES
     C                   END
     C  N48
     CANN49
     CANN94WSOB          IFNE      *BLANKS
     C     WSOB          ANDNE     BOOB
     C                   GOTO      STLES
     C                   END
     C  N50
     CANN49
     CANN94WSREFN        IFNE      *BLANKS
     C     WSREFN        ANDNE     BOREFN
     C                   GOTO      STLES
     C                   END
     C  N51
     CANN49
     CANN94WSLOH         IFNE      *BLANKS
     C     WSLOH         ANDNE     BOLOH
     C                   GOTO      STLES
     C                   END
     C  N52
     CANN49
     CANN94WSSG          IFNE      *BLANKS
     C     WSSG          ANDNE     BOSG
     C                   GOTO      STLES
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTAK        KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    WSAVD
     C     KODAKA        KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    WSAVDA
     C     KOD2AK        KLIST
     C                   KFLD                    KOAUNI
     C                   KFLD                    BOAVD
     C     KODSKA        KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    WSSGA
     C     TRANK         KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    HEKNT
     C     WRK2K         KLIST
     C                   KFLD                    W2AVD
     C                   KFLD                    W2OPD
     C     KODSFK        KLIST
     C                   KFLD                    KOSFUN
     C                   KFLD                    WSSG
     C     HEADFK        KLIST
     C                   KFLD                    BOAVD
     C                   KFLD                    BOOPD
     C     BKKNY         KLIST
     C                   KFLD                    UAVD2
     C                   KFLD                    UOPD2
     C     BOOKK         KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     BOOK1K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YCC
     C                   KFLD                    YÅR
     C                   KFLD                    YUKE
     C     BOOK2K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YKNR
     C                   KFLD                    XDT
     C     BOOK3K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YTR
     C                   KFLD                    XDT
     C     BOO3KT        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSTR
     C                   KFLD                    XDT
     C     BOOK4K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YKNA
     C                   KFLD                    XDT
     C     BOOK5K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YLB
     C                   KFLD                    XDT
     C     BOOK6K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YLSH
     C                   KFLD                    XDT
     C     BOOK7K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YKNS
     C                   KFLD                    XDT
     C     BOOK8K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YOB
     C                   KFLD                    XDT
     C     BOOKBK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YREFN
     C                   KFLD                    XDT
     C     BOOBKT        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSREFN
     C                   KFLD                    XDT
     C     BOOKCK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YLOH
     C                   KFLD                    XDT
     C     BOOKGK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    YSG
     C                   KFLD                    XDT
N01  C     BOOKK17       KLIST
N01  C                   KFLD                    WSAVD
N01  C                   KFLD                    YBKNL
N01  C                   KFLD                    XDT
     C     BOO25K        KLIST
     C                   KFLD                    YLB
     C                   KFLD                    XDT
     C     BOO28K        KLIST
     C                   KFLD                    YOB
     C                   KFLD                    XDT
     C     BLJLFK        KLIST
     C                   KFLD                    YMN
     C     KUND1K        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    KUNDNR
     C     KUNDRK        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKNR
     C     KUNDAK        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKNA
     C     KUNDSK        KLIST
     C                   KFLD                    UFIRM
     C                   KFLD                    WSKNS
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UUR               1
     C                   PARM                    USTAC1            2
     C                   PARM                    USTAC2            2
     C                   PARM                    USTAC3            2
     C                   PARM                    UTILMD            2
     C*
     C                   MOVE      UAVD          WSAVDA
     C                   MOVE      USG           WSSGA
     C                   MOVE      'A'           KOAUNI
     C                   MOVE      'SF'          KOSFUN
     C                   MOVE      *BLANKS       BLMN
     C                   MOVE      *ZEROS        BLAVD
     C                   MOVE      *ZEROS        BLOPD
     C                   MOVE      *ZEROS        BODT1
     C                   MOVE      *ZEROS        XDT1
     C                   MOVE      *ZEROS        WSDT
     C                   MOVE      *ZEROS        W2DT
     C                   MOVE      UYEAR         WSÅR
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
      *
     C                   ENDSR
      *
      ***********************************************
     C     OPSJON        BEGSR
      ***********************************************
     C                   SELECT
     C     XOPTNR        WHENEQ    0
     C                   ADD       1             XOPTNR            1 0
     C                   MOVE      'YBC0719'     XOPNR
     C     XOPTNR        WHENEQ    1
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0733'     XOPNR
     C     XOPTNR        WHENEQ    2
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0745'     XOPNR
     C     XOPTNR        WHENEQ    3
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0746'     XOPNR
     C     XOPTNR        WHENEQ    4
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0747'     XOPNR
     C     XOPTNR        WHENEQ    5
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0748'     XOPNR
     C     XOPTNR        WHENEQ    6
     C                   ADD       1             XOPTNR
     C                   MOVE      'YBC0749'     XOPNR
     C     XOPTNR        WHENEQ    7
     C                   Z-ADD     0             XOPTNR
     C                   MOVE      'YBC0753'     XOPNR
     C                   ENDSL
      *
     C                   ENDSR
      *
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C                   MOVE      BODT1D        UDT1              2 0
     C                   MOVE      BODT1M        UDT2              2 0
     C                   MOVE      BODT1Å        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          XDT1D
     C                   MOVE      UDT2          XDT1M
     C                   MOVE      UDT3          XDT1Å
     C*
     C                   ENDSR
     C*
     OHEADFR    E            NYOPDS
     O                       HEST
     O          E            NYOPDP
     O                       HEPK1
