      *********************************************************************
      * SPØRRING PÅ LAGERPOSTER
      * PROGRAM BEHANDLER INPUT FRA SYSLA1 OG VISER UTVALGT HEADLING
      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/SYSLA2 MODULE(*LIBL/SYSLA2
CRTPGM*        *LIBL/CHECKUSR *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
      *
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      * Boats for sale data base file (LF on BOATSALE by boat serial number)
     FLLHEAD    if   e           k disk    USROPN
     FDOKUF     IF   E           K DISK    USROPN
     FBRIDF     UF   E           K DISK    USROPN
     FBRPARF    if   e           k disk    usropn
      *--------------------------------------------------------------------
      * Prototype definitions and standard system API error structure
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      * Variables common to CGI programs
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * VARIABLES SPECIFIC TO THIS PROGRAM
      *--------------------------------------------------------------------
      * Variables received from the input string
     D lng             s              2
     D USER            s             10
     D UsrSpcName      s             10
      * Variables used to load the external html source member
     D Lib             s             10
     D Fn              s             10
     D Mbr             s             10
     D KUNDEREF1       S             50
     D KUNDEREF2       S             50
     D KUNDEREF3       S             50
      * Boats serial numbers received in the input string
     D ItemCount       s             10i 0
     D SernoC          s              7a
     D i               s             10i 0
     D SN              S              1    DIM(7)
     D PGM             C                   CONST('SYSPED/CHECKUSR')
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
      *
     D                 DS
     D  DF1004                 1     35
     D  XX1004                 1     21
     D                 DS
     D  XXREF                  1     35
     D  LHAVD                  1      4  0
     D  XXSKILLE1              5      5
     D  LHOPD                  6     12  0
     D  XXSKILLE2             13     13
     D  DFSG                  14     16
      *--------------------------------------------------------------------
      * Prolog common to CGI programs
      * -Receive input from the remote browser
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *=====================================================================
      * MAIN PROCESSING LINE
      *=====================================================================
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input string
     C                   exsr      Parse
      *
     C                   EXSR      INIT
     C                   CALLB     PGM
     C                   PARM                    BIBRID
     C                   PARM                    UsrSpcName
     C                   PARM                    UINN              1
     C                   IF        UINN = 'N'
     C                   GOTO      SLUTT
     C                   END
     C     USER          CHAIN     BRIDF                              50
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           BIDTF
     C                   MOVE      WTM           BITIDF
     C                   UPDATE    BRIDFR
      * Set output skeleton html member name
     C                   exsr      SetSkl
      * Read skeleton output html into core
     C                   callp     gethtml(fn:lib:mbr:'/CGITAG/')
      * Retrieve environment variables
     C                   exsr      RtvEnvVar
      *
      * Issue html section /$top
     C                   exsr      SetTop
     C                   callp     wrtsection('top')
      *------------------
      * Retrieve number of boats to be shown
     C                   eval      ItemCount = ZhbGetVarCnt('serno')
      * Show the requested boats
     C                   eval      i =1
     C     i             DOWlE     ItemCount
     C                   eval      SernoC = ZhbGetVar('serno':i)
     C                   MOVEA     SernoC        SN
     C                   MOVE      *ZEROS        LHMN
     C     1             DO        7             XN                3 0
     C     SN(XN)        IFNE      ' '
     C                   MULT      10            LHMN
     C                   MOVE      SN(XN)        LHMN
     C                   ENDIF
     C                   ENDDO
     C     LH00K         CHAIN     LLHEAD                             60
     C     *in60         ifeq      '0'
     C                   exsr      SetFound
     C                   callp     wrtsection('found')
     C                   else
     C                   callp     wrtsection('notfound')
     C                   endif
     C                   eval      i = i +1
     C                   ENDDO
      * If no boats selected
     C     ItemCount     ifeq      0
     C                   callp     wrtsection('noselect')
     C                   endif
      * Send output buffer and quit
     C     SLUTT         TAG
     C                   exsr      Exit
      *=====================================================================
      * Send output buffer and quit
      *=====================================================================
     C     Exit          begsr
      * Compute and display run time
     C                   time                    timedata2
     C     timedata2     subdur    timedata1     ms:*ms
     C                   eval      sec = ms / 1000000
     C                   callp     updhtmlvar('runtime':
     C                             %trim(%editw(sec:'     0 .   ')))
     C                   callp     wrtsection('endhtml')
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      *
     C                   close     LLHEAD
     C                   close     DOKUF
     C                   close     BRIDF
     C                   close     BRPARF
     C                   eval      *inlr = *on
      *
     C                   return
     C                   endsr
      *=====================================================================
      * Parse input string
      *=====================================================================
     C     Parse         begsr
     C                   eval      lng     = zhbgetvar('lng')
     C                   eval      USER    = zhbgetvar('USER')
     C                   EVAL      UsrSpcName  = zhbgetvar('UsrSpcName')
     C                   endsr
      *=====================================================================
      * Set html output variables for section /$top
      *=====================================================================
     C     SetTop        begsr
      * Repeat national language for the next invocation
     C                   callp     updhtmlvar('LNG':lng:
     C                             InitHTMLVars)
      * Repeat background color for the next invocation
     C                   callp     updhtmlvar('TXTCOLOR':'black')
     C                   callp     updhtmlvar('BOLD':' ')
     C                   callp     updhtmlvar('BGCOLOR':BIFARG)
     C                   callp     updhtmlvar('LINK':'0000FF')
     C                   callp     updhtmlvar('VLINK':'FF0000')
     C                   callp     updhtmlvar('ALINK':'00FF00')
     C                   callp     updhtmlvar('KUNDEREF1':KUNDEREF1)
     C                   callp     updhtmlvar('KUNDEREF2':KUNDEREF2)
     C                   callp     updhtmlvar('KUNDEREF3':KUNDEREF3)
      * Protocol
     C                   callp     updHtmlVar('PROTOCOL':S_Protocol)
     C                   endsr
      *=====================================================================
      * Set html output variables for section /$found (display a boat)
      *=====================================================================
     C     SetFound      begsr
      * Hent sendingsnr
     C     DOKUFK        CHAIN     DOKUF                              33
     C   33              MOVE      *BLANKS       XX1004
     C   33              MOVE      *BLANKS       DFSG
      *
      * Sett inn i HTMLvariabler
     C                   callp     updHtmlVar('LHBNA':LHBNA)
     C                   callp     updHtmlVar('LHBA1':LHBA1)
     C                   callp     updHtmlVar('LHBA2':LHBA2)
     C                   callp     updHtmlVar('LHBA3':LHBA3)
     C                   MOVE      LHBPN         ALHBPN            4
     C                   callp     updHtmlVar('LHBPN':ALHBPN)
     C                   callp     updhtmlvar('LHTDT':
     C                             %trim(%editw(LHTDT:'    .  .  ')))
     C                   callp     updhtmlvar('LHPAK':LHPAK)
     C                   callp     updhtmlvar('LHORDR':LHORDR)
     C                   callp     updhtmlvar('LHFLN':LHFLN)
     C     LHALN         ifeq      *zeros
     C                   callp     updhtmlvar('LHALN':spaces)
     C                   else
     C                   callp     updhtmlvar('LHALN':
     C                             %trim(%editc(LHALN:'Z')))
     c                   end
     C                   callp     updhtmlvar('LHMN':
     C                             %trim(%editc(LHMN:'Z')))
     C                   callp     updhtmlvar('XXREF':XXREF)
     C                   callp     updhtmlvar('XX1004':XX1004)
     C                   callp     updhtmlvar('LHANT0':
     C                             %trim(%editc(LHANT0:'Z')))
     C                   callp     updhtmlvar('LHANTL':
     C                             %trim(%editc(LHANTL:'Z')))
     C                   callp     updhtmlvar('LHANT1':
     C                             %trim(%editc(LHANT1:'Z')))
     C                   callp     updhtmlvar('LHANT2':
     C                             %trim(%editc(LHANT2:'Z')))
     C                   callp     updhtmlvar('LHANT3':
     C                             %trim(%editc(LHANT3:'Z')))
     C                   callp     updhtmlvar('LHWVEK':
     C                             %trim(%editc(LHWVEK:'3')))
     C                   callp     updhtmlvar('LHWKUB':
     C                             %trim(%editc(LHWKUB:'3')))
     C                   callp     updhtmlvar('LHTLIN':
     C                             %trim(%editc(LHTLIN:'Z')))
BODY C                   callp     updhtmlvar('BODYCLASS':'class='+BIFARG)
     C                   callp     updhtmlvar('USER':USER)
     C                   callp     updHtmlVar('UsrSpcName':UsrSpcName)
      *
      *
     C                   endsr
      *=====================================================================
      * Set html output skeleton member before its read into memory
      *=====================================================================
     C     SetSkl        begsr
     C                   eval      lng = uppify(lng)
     C                   eval      Lib = '*LIBL'
     C                   eval      Fn  = 'HTMLSRC' + lng
     C                   eval      Mbr = 'SYSLA2'
     C                   CAT       XSPRÅK:0      MBR
     C                   endsr
      *=====================================================================
      *  Retrieve environment variables
      *=====================================================================
     C     RtvEnvVar     begsr
      * Use getenvp to get this server's protocol
     C                   eval      S_Protocol =getenv('SERVER_PROTOCOL':
     C                             qusec)
      *
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     USER          CHAIN(N)  BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   CALLB     'INCGI'
     C                   PARM                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
      *
     C                   open      LLHEAD                               50
     C                   open      DOKUF                                50
     C                   open      BRPARF                               50
      *
     c     LH00K         klist
     c                   kfld                    LHMN
     c     DOKUFK        klist
     c                   kfld                    DFRI
     c                   kfld                    LHAVD
     c                   kfld                    LHOPD
     c                   kfld                    LHFBN
     C     BRPARFK       klist
     C                   kfld                    PABRID
     C                   kfld                    PAKUNR
     C                   kfld                    PAID
      * HENT LEDERTEKST
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF1'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF1 = 'Kunderef.1'
     C                   ELSE
     C                   EVAL      KUNDEREF1 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF2'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF2 = 'Kunderef.2'
     C                   ELSE
     C                   EVAL      KUNDEREF2 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'LLRF3'       PAID
     C     BRPARFK       CHAIN     BRPARF                             50
     C                   IF        *IN50
     C                   MOVE      '*KUNDFT*  '  PABRID
     C                   MOVE      BIFIRM        PABRID
     C                   MOVE      BIKUNR        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   IF        *IN50
     C                   MOVE      *ZEROS        PAKUNR
     C     BRPARFK       SETLL     BRPARF
     C     BRPARFK       READE     BRPARF                                 50
     C                   END
     C                   END
     C                   IF        *IN50
     C                   EVAL      KUNDEREF3 = 'Kunderef.3'
     C                   ELSE
     C                   EVAL      KUNDEREF3 = PAVRDA
     C                   END
      *
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C                   MOVEL     'SPRÅK'       PAID
     C     BRPARFK       chain     BRPARF                             33
     C                   IF        (*IN33 OR (PAVRDA <> 'EN'))
     C                   MOVE      *BLANKS       XSPRÅK            2
     C                   ELSE
     C                   MOVE      'EN'          XSPRÅK            2
     C                   END
      *
     C                   MOVE      'F'           DFRI
     C                   MOVE      '/'           XXSKILLE1
     C                   MOVE      '/'           XXSKILLE2
      *
     C                   endsr
