      *********************************************************************
      *
      *
CRTPG+*  CRTPGM SYSPED/SYSTI2 MODULE(*LIBL/SYSTI2 *LIBL/INCGI)
CRTPGM*         ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FCUNDL01   IF   E           K DISK    USROPN
     FKODTV     IF   E           K DISK    USROPN
     FBRSTF     UF A E           K DISK    USROPN
      *********************************************************************
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      /copy syspeds/qrpgsrcpy,variables3
      *
     D OddEven         s             10
      * Client input variables
     D Update          s              1
     D user            s             10
     D KOV01           s              5
     D KOV02           s              5
     D KOV03           s              5
     D KOV04           s              5
     D KOV05           s              5
     D KOV06           s              5
     D KOV07           s              5
     D KOV08           s              5
     D KOV09           s              5
     D KOV10           s              5
     D KOV11           s              5
      *
     D Spaces          s             12a   inz('&nbsp;&nbsp;')
     D UTxt            s             60
      * Vektgrupper
     D                 DS
     D  KOVK1                  1      5  0
     D  KOVK2                  6     10  0
     D  KOVK3                 11     15  0
     D  KOVK4                 16     20  0
     D  KOVK5                 21     25  0
     D  KOVK6                 26     30  0
     D  KOVK7                 31     35  0
     D  KOVK8                 36     40  0
     D  KOVK9                 41     45  0
     D  KOVK10                46     50  0
     D  KOVK11                51     55  0
     D  KOVK12                56     60  0
     D  FF                     1     60  0
     D                                     DIM(12) ASCEND
      *
      /copy syspeds/qrpgsrcpy,prolog3
      *
      * Get program start time for calculating execution time
     C                   time                    timedata1
      * Parse input / cvt to numeric
     C                   exsr      Parse
      * File open / keys
     C                   EXSR      INIT
      * Read output skeleton html member into memory
     C                   exsr      LoadHtml
      * Set section variables
     C                   exsr      Setall
     C                   callp     wrtsection('all')
      * Quit
      * Compute run time
     C                   time                    timedata2
     C     timedata2     subdur    timedata1     ms:*ms
     C                   eval      sec = ms / 1000000
     C                   callp     updhtmlvar('runtime':
     C                             %trim(%editw(sec:'     0 .   ')))
      *
     C                   callp     wrtsection('bot')
      *
     C                   exsr      Exit
      *
     C                   eval      *inlr = *on
     C                   return
      *
      *
      *=====================================================================
      * Parse input / cvt to numeric
      *=====================================================================
     C     Parse         begsr
      * Parse variables from QUERY_STRING environment variable
     C                   eval      Update  = zhbgetvar('Update')
     C                   eval      KOV01   = zhbgetvar('KOV01')
     C                   eval      KOV02   = zhbgetvar('KOV02')
     C                   eval      KOV03   = zhbgetvar('KOV03')
     C                   eval      KOV04   = zhbgetvar('KOV04')
     C                   eval      KOV05   = zhbgetvar('KOV05')
     C                   eval      KOV06   = zhbgetvar('KOV06')
     C                   eval      KOV07   = zhbgetvar('KOV07')
     C                   eval      KOV08   = zhbgetvar('KOV08')
     C                   eval      KOV09   = zhbgetvar('KOV09')
     C                   eval      KOV10   = zhbgetvar('KOV10')
     C                   eval      KOV11   = zhbgetvar('KOV11')
      * Userid.....
     C                   eval      user = zhbgetvar('user')
     C                   endsr
      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   CLOSE     BRIDF
     C                   CLOSE     kodtv
     C                   CLOSE     CUNDL01
     C                   CLOSE     BRSTF
     C*                  return
     C                   endsr
      *=====================================================================
      * Read output skeleton html member into memory
      *=====================================================================
     C     LoadHtml      begsr
     C                   callp     gethtml('HTMLSRC':
     C                             '*LIBL':
     C                             'SYSTI2':'/CGITAG/')
     C                   endsr
      *=====================================================================
      *  Set variable data for section /$top
      *=====================================================================
     C     SetAll        begsr
      *
     C                   callp     updHTMLvar('Update':Update)
OddEvC                   callp     updHTMLvar('ROWHEAD':RowHead)
OddEvC                   callp     updHTMLvar('LogoImg':LogoImg)
BODY C                   callp     updhtmlvar('BODYCLASS':'class='+BIFARG)
     C                   callp     updHTMLvar('USER':USER)
     C                   callp     updHTMLvar('BESK':BIBESK)
     C                   callp     updHtmlVar('KUNDE':
     C                             %trim(%editc(BIKUNR:'Z')))
     C                   callp     updHTMLvar('KNAVN':KNAVN)
      *
     c     Update        ifeq      'Y'
     C                   eval      BPKUNR  = BIKUNR
     C     bikunr        CHAIN     BRSTF                              33
     C                   eval      KOVK1   = c2n2(KOV01)
     C                   eval      KOVK2   = c2n2(KOV02)
     C                   eval      KOVK3   = c2n2(KOV03)
     C                   eval      KOVK4   = c2n2(KOV04)
     C                   eval      KOVK5   = c2n2(KOV05)
     C                   eval      KOVK6   = c2n2(KOV06)
     C                   eval      KOVK7   = c2n2(KOV07)
     C                   eval      KOVK8   = c2n2(KOV08)
     C                   eval      KOVK9   = c2n2(KOV09)
     C                   eval      KOVK10  = c2n2(KOV10)
     C                   eval      KOVK11  = c2n2(KOV11)
     c   33              write     BRPRFR
     c  N33              update    BRPRFR
     c                   eval      Utxt = 'Vektbgruppene er oppdatert. ' +
     c                                    'Steng vinduet'
     c                   else
     c                   eval      Utxt = 'Tast inn ønsket inndeling og ' +
     c                                    'trykk på send.'
     c                   end
     C                   callp     updHTMLvar('UpdateTxt':Utxt)
      * Vektgrupper
     C                   callp     updHTMLvar('KOV01':
     C                             %trim(%editc(KOVK1:'J')))
     C                   callp     updHTMLvar('KOV02':
     C                             %trim(%editc(KOVK2:'J')))
     C                   callp     updHTMLvar('KOV03':
     C                             %trim(%editc(KOVK3:'J')))
     C                   callp     updHTMLvar('KOV04':
     C                             %trim(%editc(KOVK4:'J')))
     C                   callp     updHTMLvar('KOV05':
     C                             %trim(%editc(KOVK5:'J')))
     C                   callp     updHTMLvar('KOV06':
     C                             %trim(%editc(KOVK6:'J')))
     C                   callp     updHTMLvar('KOV07':
     C                             %trim(%editc(KOVK7:'J')))
     C                   callp     updHTMLvar('KOV08':
     C                             %trim(%editc(KOVK8:'J')))
     C                   callp     updHTMLvar('KOV09':
     C                             %trim(%editc(KOVK9:'J')))
     C                   callp     updHTMLvar('KOV10':
     C                             %trim(%editc(KOVK10:'J')))
     C                   callp     updHTMLvar('KOV11':
     C                             %trim(%editc(KOVK11:'J')))
     C                   callp     updHTMLvar('KOV12':
     C                             %trim(%editc(KOVK12:'J')))
      *
      *
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C                   OPEN      BRIDF
     C     USER          CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
OddEv * hent Parametre som går igjen i mange prog:
OddEv *      Odd/Even/Rowhead-farger,Logobilde,Språk,Intern/Ekstern bruker,  mm
OddEvc                   call      'ESGETPAR'
OddEvc                   parm                    BIBRID
OddEvc                   parm                    BIFIRM
OddEvc                   parm                    BIKUNR
OddEvc                   parm                    BIKNG
OddEvc                   parm                    RowHead          10
OddEvc                   parm                    Odd              10
OddEvc                   parm                    Even             10
OddEvc                   parm                    LogoImg          50
OddEvc                   parm                    XSPRÅK            2
OddEvc                   parm                    XINTERN           1
OddEvc                   parm                    ParmDS1        1024
OddEvc                   parm                    ParmDS2        1024
OddEvc                   parm                    ParmDS3        1024
      *
     C                   OPEN      CUNDL01
     C                   OPEN      kodtV
     C                   OPEN      BRSTF
      * Key for CUNDL01
     C     KunKey        KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    BIKUNR
      * Key for Stardard vektgrupper (firmastandard)
     c                   clear                   ff
     C     KODVKE        KLIST
     C                   KFLD                    KOVUNI
     C                   KFLD                    KOVAVD
     C                   MOVE      'V'           KOVUNI
     C                   MOVE      *ZEROS        KOVAVD
     C     bikunr        CHAIN(N)  BRSTF                              33
     C   33KODVKE        CHAIN     KODTV                              33

     C                   MOVE      99999         FF(12)
      *
     C     KunKey        CHAIN     Cundl01                            33
bhr   * Spesialvri for å kunne deme uten å avsløre kundenavn
bhr  c                   MOVEL     USER          tstjov            4
bhr  c     tstjov        ifeq      'JOVO'
bhr  c                   eval      KNAVN  = 'Jan Ottar Valderhaug'
bhr  c                   end
      *
      *
     C                   endsr
      *
