      *****************************************************************
      *   REGENERERING AV STATISTIKK   - 2.STEPP.                     *
      *   ALLE FAKT.LINJER 'O' I STATUS BLIR SENDT TIL STATISTIKKPROG.*
      *   KUN BELØPENE .. - ANT/VEKT HÅNDTERES AV STEPP1 (SYSTREOP)   *
      *****************************************************************
     FFAKT      IP   E             DISK
     C     FAOPKO        IFEQ      'O'
     C     FASK          ANDNE     'A'                                             *AMETA
     C     FASK          ANDNE     'F'                                             *FLYSELSK
     C     FASK          ANDNE     'I'                                             *INTERN
     C     FAAVD         ANDNE     *ZEROS                                          *DUMMY
     C                   MOVE      '0'           XXOPD
     C                   CALL      'SYST35'
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FALI
     C                   PARM                    XXOPD             1
     C                   END
