********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 YBC PTF11 BEHOLDE AVGIFTER I 3 ÅR PGA. OMBEREGNING
********************************************************************
      * SJEKK OM SÆRAVGIFTKODE SKAL SLETTES
     FSADSDL1   IF   E           K DISK
     FSADSDL2   IF   E           K DISK    RENAME(SADSDR:SADSDR2)
      *
     C     *ENTRY        PLIST
     C                   PARM                    UKDA              2
     C                   PARM                    UKDS              3
     C                   PARM                    USLT              1
     C     KEY11         KLIST
     C                   KFLD                    UKDA
     C                   KFLD                    UKDS
     C                   KFLD                    UDT2
     C     KEY12         KLIST
     C                   KFLD                    UKDA
     C                   KFLD                    UKDS
     C     KEY21         KLIST
     C                   KFLD                    UKDA
     C                   KFLD                    UDT2
     C     KEY22         KLIST
     C                   KFLD                    UKDA
     C                   EVAL      USLT = 'N'
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           XDT               8 0
     C                   MOVE      'SUB'         UFUNK             3
     C                   MOVE      WDT           UDT1              8 0
     C* Hvor mange dager før sletting?
S01  C*                  Z-ADD     60            UDAG              5 0
N01  C                   Z-ADD     1095          UDAG              5 0
     C                   CALL      'SYGE20'
     C                   PARM                    UFUNK
     C                   PARM                    UDT1              8 0
     C                   PARM                    UDT2              8 0
     C                   PARM                    UDAG              5 0
      *
     C                   IF        UKDS = *BLANKS
     C     KEY21         SETLL     SADSDL2
     C     KEY22         READE     SADSDL2                                33
     C                   ELSE
     C     KEY11         SETLL     SADSDL1
     C     KEY12         READE     SADSDL1                                33
     C                   END
     C   33              EVAL      USLT = 'J'
      *
     C                   EVAL      *INLR = *OFF
     C                   RETURN
      *
