********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SLUTT DATO PÅ TOLLTARIFF
10XXX * 02 YBC PTF10 35022090 KOMMER INN TO GANGER. IKKE OPPDATER SISTE GANG
10XXX * 03 SH  PTF10 User option på workstn
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11020 * 04 YBC PTF11 FLERE NYE LAND OG REGIONER
********************************************************************
S04  F*SYTIRCV   IP   F  256        DISK
N04  FSYTIRCV   IP   F  512        DISK
     FTARIKAP   IF   F   19     4AIDISK    KEYLOC(1)
     FTARINY    O  A E             DISK
     FTARI      IF   E           K DISK    PREFIX(GM_)
     F                                     RENAME(TARIR:TARIRGM)
     FSYTITA1D  CF   E             WORKSTN USROPN
     D*
N01  D                UDS
N01  D  UDATO                101    108  0
     D                 DS
     D  XDATO                  1      8  0
     D  XDTÅ                   1      4  0
     D  XDTM                   5      6  0
     D  XDTD                   7      8  0
     D                 DS
     D  WSDATO                 1      6  0
     D  WSDTD                  1      2  0
     D  WSDTM                  3      4  0
     D  WSDTÅ                  5      6  0
     D                 DS
     D  XAORDB                 1      6  2                                      ORDINÆR
     D  DAT1H                  1      4  0
     D  DAT1D                  5      6  0
     D                 DS
     D  XAEFTB                 1      6  2                                      EFTA
     D  DAT2H                  1      4  0
     D  DAT2D                  5      6  0
     D                 DS
     D  XAEFB                  1      6  2                                      EF
     D  DAT3H                  1      4  0
     D  DAT3D                  5      6  0
     D                 DS
     D  XAEØSB                 1      6  2                                      EØS
     D  DAT4H                  1      4  0
     D  DAT4D                  5      6  0
     D                 DS
     D  XAMULB                 1      6  2                                      MINST UTVIKLEDE LAND
     D  DAT5H                  1      4  0
     D  DAT5D                  5      6  0
     D                 DS
     D  XAOULB                 1      6  2                                      ORDINÆRE UTV.LAND
     D  DAT6H                  1      4  0
     D  DAT6D                  5      6  0
     D                 DS
     D  XAISRB                 1      6  2                                      ISRAEL
     D  DAT7H                  1      4  0
     D  DAT7D                  5      6  0
     D                 DS
     D  XATYRB                 1      6  2                                      TYRKIA
     D  DAT8H                  1      4  0
     D  DAT8D                  5      6  0
     D                 DS
     D  XAGRLB                 1      6  2                                      GRØNLAND
     D  DAT9H                  1      4  0
     D  DAT9D                  5      6  0
     D                 DS
     D  XAFÆRB                 1      6  2                                      FÆRØYENE
     D  DA10H                  1      4  0
     D  DA10D                  5      6  0
     D                 DS
     D  XAISTB                 1      6  2                                      INDIA/SRI LANKA/THAI
     D  DA11H                  1      4  0
     D  DA11D                  5      6  0
     D                 DS
     D  XAMARB                 1      6  2                                      MAROKKO
     D  DA12H                  1      4  0
     D  DA12D                  5      6  0
     D                 DS
     D  XAMEXB                 1      6  2                                      MEXICO
     D  DA13H                  1      4  0
     D  DA13D                  5      6  0
     D                 DS
     D  XAVGAB                 1      6  2                                      VESTBREDDEN/GAZASTRI
     D  DA14H                  1      4  0
     D  DA14D                  5      6  0
     D                 DS
E04  D  XASINB                 1      6  2                                      SINGAPORE
     D  DA15H                  1      4  0
     D  DA15D                  5      6  0
     D                 DS
E04  D  XAMAKB                 1      6  2                                      MAKEDONIA
     D  DA16H                  1      4  0
     D  DA16D                  5      6  0
     D                 DS
E04  D  XAJORB                 1      6  2                                      JORDAN
     D  DA17H                  1      4  0
     D  DA17D                  5      6  0
     D                 DS
E04  D  XACHIB                 1      6  2                                      CHILE
     D  DA18H                  1      4  0
     D  DA18D                  5      6  0
     D                 DS
E04  D  XATUNB                 1      6  2                                      TUNISIA
     D  DA19H                  1      4  0
     D  DA19D                  5      6  0
     D                 DS
E04  D  XASKOB                 1      6  2                                      SØR-KOREA
     D  DA20H                  1      4  0
     D  DA20D                  5      6  0
     D                 DS
E04  D  XALIBB                 1      6  2                                      LIBANON
     D  DA21H                  1      4  0
     D  DA21D                  5      6  0
     D                 DS
E04  D  XASACB                 1      6  2                                      SACU
     D  DA22H                  1      4  0
     D  DA22D                  5      6  0
     D                 DS
E04  D  XAEGYB                 1      6  2                                      EGYPT
     D  DA23H                  1      4  0
     D  DA23D                  5      6  0
     D                 DS
E04  D  XACANB                 1      6  2                                      CANADA
     D  DA24H                  1      4  0
     D  DA24D                  5      6  0
     D                 DS
E04  D  XASWAB                 1      6  2                                      SWAZILAND
     D  DA25H                  1      4  0
     D  DA25D                  5      6  0
N04  D                 DS
N04  D  XASERB                 1      6  2                                      SERBIA
N04  D  DA26H                  1      4  0
N04  D  DA26D                  5      6  0
N04  D                 DS
N04  D  XAALBB                 1      6  2                                      ALBANIA
N04  D  DA27H                  1      4  0
N04  D  DA27D                  5      6  0
N04  D                 DS
N04  D  XAUKRB                 1      6  2                                      UKRAINA
N04  D  DA28H                  1      4  0
N04  D  DA28D                  5      6  0
N04  D                 DS
N04  D  XAPERB                 1      6  2                                      PERU
N04  D  DA29H                  1      4  0
N04  D  DA29D                  5      6  0
N04  D                 DS
N04  D  XAMONB                 1      6  2                                      MONTENEGRO
N04  D  DA30H                  1      4  0
N04  D  DA30D                  5      6  0
N04  D                 DS
N04  D  XAHKOB                 1      6  2                                      HONG KONG
N04  D  DA31H                  1      4  0
N04  D  DA31D                  5      6  0
N04  D                 DS
N04  D  XABNSB                 1      6  2                                      BW, NA OG SZ
N04  D  DA32H                  1      4  0
N04  D  DA32D                  5      6  0
N04  D                 DS
N04  D  XALMLB                 1      6  2                                      LAVERE M.INNT.LAND
N04  D  DA33H                  1      4  0
N04  D  DA33D                  5      6  0
     D                 DS
     D  LETTE                  1      4
     D  KAP                    1      1
     D                 DS
     D  ENH                    1     12
     D  ENH11                  1      1
     D  ENH16                  1      6
     D                 DS
     D  MENGDE                 1     12
     D  TA1                    1      9
     D                                     DIM(3)
     D                 DS
     D  MENGD2                 1     12
     D  TA2                    2     10
     D                                     DIM(3)
     D                 DS
     D  MENGD3                 1     12
     D  TA3                    3     11
     D                                     DIM(3)
     ISYTIRCV   NC  01
     I                                  1   12  RESTRI
     I                                 13   20 0TARINR
     I                                 21   24 0DAT1H
     I                                 26   27 0DAT1D
     I                                 28   39  ENH
     I                                 40   43 0DAT2H
     I                                 45   46 0DAT2D
     I                                 47   50 0DAT3H
     I                                 52   53 0DAT3D
     I                                 54   57 0DAT4H
     I                                 59   60 0DAT4D
     I                                 61   64 0DAT5H
     I                                 66   67 0DAT5D
     I                                 68   71 0DAT6H
     I                                 73   74 0DAT6D
     I                                 75   78 0DAT7H
     I                                 80   81 0DAT7D
     I                                 82   85 0DAT8H
     I                                 87   88 0DAT8D
     I                                 89   92 0DAT9H
     I                                 94   95 0DAT9D
     I                                 96   99 0DA10H
     I                                101  102 0DA10D
     I                                103  106 0DA11H
     I                                108  109 0DA11D
     I                                110  113 0DA12H
     I                                115  116 0DA12D
     I                                117  120 0DA13H
     I                                122  123 0DA13D
     I                                124  127 0DA14H
     I                                129  130 0DA14D
     I                                131  134 0DA15H
     I                                136  137 0DA15D
     I                                138  141 0DA16H
     I                                143  144 0DA16D
     I                                145  148 0DA17H
     I                                150  151 0DA17D
     I                                152  155 0DA18H
     I                                157  158 0DA18D
     I                                159  162 0DA19H
     I                                164  165 0DA19D
     I                                166  169 0DA20H
     I                                171  172 0DA20D
     I                                173  176 0DA21H
     I                                178  179 0DA21D
     I                                180  183 0DA22H
     I                                185  186 0DA22D
     I                                187  190 0DA23H
     I                                192  193 0DA23D
     I                                194  197 0DA24H
     I                                199  200 0DA24D
     I                                201  204 0DA25H
     I                                206  207 0DA25D
N04  I                                208  211 0DA26H
N04  I                                213  214 0DA26D
N04  I                                215  218 0DA27H
N04  I                                220  221 0DA27D
N04  I                                222  225 0DA28H
N04  I                                227  228 0DA28D
N04  I                                229  232 0DA29H
N04  I                                234  235 0DA29D
N04  I                                236  239 0DA30H
N04  I                                241  242 0DA30D
N04  I                                243  246 0DA31H
N04  I                                248  249 0DA31D
N04  I                                250  253 0DA32H
N04  I                                255  256 0DA32D
N04  I                                257  260 0DA33H
N04  I                                262  263 0DA33D
S04  I*                               208  219  MENGDE
S04  I*                               208  210  MENGDE3
S04  I*                               208  208  MENGD1
S04  I*                               220  223  LETTE
N04  I                                264  275  MENGDE
N04  I                                264  266  MENGDE3
N04  I                                264  264  MENGD1
N04  I                                276  279  LETTE
     ITARIKAP   NS  02
     I                                  5   19  NYALFA
      *
     C     *ENTRY        PLIST
     C                   PARM                    INST              1
N03  C                   PARM                    BATCH             1
      *HENTER DAGENS DATO KUN EN GANG
     C  N99              DO
     C                   CALL      'SYGE15C'
     C                   PARM                    WDATO             8
     C                   PARM                    WTID              6
     C                   SETON                                        99
     C                   MOVE      WDATO         XDATO
     C                   MOVE      XDTD          WSDTD
     C                   MOVE      XDTM          WSDTM
     C                   MOVE      XDTÅ          WSDTÅ
N03  C                   MOVE      WSDATO        XDATO
N03  C     BATCH         IFNE      'J'
n03  c                   open      SYTITA1D
     C                   WRITE     WINDOWSZ
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   MOVE      '0'           *IN30
     C                   MOVE      WSDTÅ         UÅÅ               2 0
     C                   MOVE      WSDTM         UMM               2 0
     C                   MOVE      WSDTD         UDD               2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDD
     C                   PARM                    UMM
     C                   PARM                    UÅÅ
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      30
     C   30              MOVE      'SPD0001'     MSGNR
     C   30              GOTO      START
n03  c                   close     SYTITA1D
N03  C                   END
     C                   MOVE      WSDTD         XDTD
     C                   MOVE      WSDTM         XDTM
     C     2000          ADD       WSDTÅ         XDTÅ
N01  C                   MOVE      XDATO         UDATO
     C                   END
      *
      * ER MODUL INSTALLERT ?????
     C     MODOK         IFNE      'J'
     C                   MOVEL     'SYTADINT'    UMODUL           15
     C                   MOVE      '       '     UMODUL
     C                   CALL      'SYPRODT'
     C                   PARM                    UMODUL
     C                   PARM                    UMFLAG            1 0
     C     UMFLAG        IFEQ      1
     C                   MOVE      UMFLAG        INST
     C                   SETON                                        LR
     C                   RETURN
     C                   END
     C                   MOVE      'J'           MODOK             1
     C                   END
     C* AVBRYT HVIS FIL UTVIDET (NYE KOLONNER/FORSKYVING AV MENGD MM.)
     C     MENGD1        IFGE      '0'
     C     MENGD1        ANDLE     '9'
     C                   MOVE      '2'           INST
     C                   SETON                                        LR
     C                   RETURN
     C                   END
     C*
     C                   MOVE      MENGDE        MENGD2
     C                   MOVE      MENGDE        MENGD3
     C                   IF        MENGDE3 = 'KGM'
     C                   MOVEL     '   '         MENGDE
     C                   END
     C     KAP           IFEQ      'M'
     C                   MOVE      *ZEROS        XAORDB
     C                   END
     C                   IF        XAORDB = 999,99 OR XAORDB = 9999,99
     C                   Z-ADD     99999,99      TAORDB
     C                   ELSE
     C                   Z-ADD     XAORDB        TAORDB
     C                   END
     C                   IF        XAEFB  = 999,99 OR XAEFB  = 9999,99
     C                   Z-ADD     99999,99      TAEFB
     C                   ELSE
     C                   Z-ADD     XAEFB         TAEFB
     C                   END
     C                   IF        XAEFTB = 999,99 OR XAEFTB = 9999,99
     C                   Z-ADD     99999,99      TAEFTB
     C                   ELSE
     C                   Z-ADD     XAEFTB        TAEFTB
     C                   END
     C                   IF        XAEØSB = 999,99 OR XAEØSB = 9999,99
     C                   Z-ADD     99999,99      TAEØSB
     C                   ELSE
     C                   Z-ADD     XAEØSB        TAEØSB
     C                   END
S04  C*                  IF        XAKROB = 999,99 OR XAKROB = 9999,99
S04  C*                  Z-ADD     99999,99      TATSJB
S04  C*                  ELSE
S04  C*                  Z-ADD     XAKROB        TATSJB
S04  C*                  END
     C                   IF        XATYRB = 999,99 OR XATYRB = 9999,99
     C                   Z-ADD     99999,99      TATYRB
     C                   ELSE
     C                   Z-ADD     XATYRB        TATYRB
     C                   END
     C                   IF        XAISRB = 999,99 OR XAISRB = 9999,99
     C                   Z-ADD     99999,99      TAISRB
     C                   ELSE
     C                   Z-ADD     XAISRB        TAISRB
     C                   END
     C                   IF        XASINB = 999,99 OR XASINB = 9999,99
     C                   Z-ADD     99999,99      TAELLB
     C                   ELSE
     C                   Z-ADD     XASINB        TAELLB
     C                   END
     C                   IF        XACHIB = 999,99 OR XACHIB = 9999,99
     C                   Z-ADD     99999,99      TABULB
     C                   ELSE
     C                   Z-ADD     XACHIB        TABULB
     C                   END
     C                   IF        XAMAKB = 999,99 OR XAMAKB = 9999,99
     C                   Z-ADD     99999,99      TAPOLB
     C                   ELSE
     C                   Z-ADD     XAMAKB        TAPOLB
     C                   END
     C                   IF        XASKOB = 999,99 OR XASKOB = 9999,99
     C                   Z-ADD     99999,99      TAROMB
     C                   ELSE
     C                   Z-ADD     XASKOB        TAROMB
     C                   END
     C                   IF        XAJORB = 999,99 OR XAJORB = 9999,99
     C                   Z-ADD     99999,99      TAUNGB
     C                   ELSE
     C                   Z-ADD     XAJORB        TAUNGB
     C                   END
     C                   IF        XATUNB = 999,99 OR XATUNB = 9999,99
     C                   Z-ADD     99999,99      TASLOB
     C                   ELSE
     C                   Z-ADD     XATUNB        TASLOB
     C                   END
     C                   IF        XAMULB = 999,99 OR XAMULB = 9999,99
     C                   Z-ADD     99999,99      TAMULB
     C                   ELSE
     C                   Z-ADD     XAMULB        TAMULB
     C                   END
     C                   IF        XAOULB = 999,99 OR XAOULB = 9999,99
     C                   Z-ADD     99999,99      TAOULB
     C                   ELSE
     C                   Z-ADD     XAOULB        TAOULB
     C                   END
     C                   IF        XAGRLB = 999,99 OR XAGRLB = 9999,99
     C                   Z-ADD     99999,99      TAGRLB
     C                   ELSE
     C                   Z-ADD     XAGRLB        TAGRLB
     C                   END
     C                   IF        XAFÆRB = 999,99 OR XAFÆRB = 9999,99
     C                   Z-ADD     99999,99      TAFÆRB
     C                   ELSE
     C                   Z-ADD     XAFÆRB        TAFÆRB
     C                   END
     C                   IF        XAISTB = 999,99 OR XAISTB = 9999,99
     C                   Z-ADD     99999,99      TAISTB
     C                   ELSE
     C                   Z-ADD     XAISTB        TAISTB
     C                   END
     C                   IF        XAMARB = 999,99 OR XAMARB = 9999,99
     C                   Z-ADD     99999,99      TAMARB
     C                   ELSE
     C                   Z-ADD     XAMARB        TAMARB
     C                   END
     C                   IF        XAMEXB = 999,99 OR XAMEXB = 9999,99
     C                   Z-ADD     99999,99      TAMEXB
     C                   ELSE
     C                   Z-ADD     XAMEXB        TAMEXB
     C                   END
     C                   IF        XAVGAB = 999,99 OR XAVGAB = 9999,99
     C                   Z-ADD     99999,99      TAVGAB
     C                   ELSE
     C                   Z-ADD     XAVGAB        TAVGAB
     C                   END
     C                   IF        XALIBB = 999,99 OR XALIBB = 9999,99
     C                   Z-ADD     99999,99      TAN01B
     C                   ELSE
     C                   Z-ADD     XALIBB        TAN01B
     C                   END
     C                   IF        XASACB = 999,99 OR XASACB = 9999,99
     C                   Z-ADD     99999,99      TAN02B
     C                   ELSE
     C                   Z-ADD     XASACB        TAN02B
     C                   END
     C                   IF        XAEGYB = 999,99 OR XAEGYB = 9999,99
     C                   Z-ADD     99999,99      TAN03B
     C                   ELSE
     C                   Z-ADD     XAEGYB        TAN03B
     C                   END
     C                   IF        XACANB = 999,99 OR XACANB = 9999,99
     C                   Z-ADD     99999,99      TAN04B
     C                   ELSE
     C                   Z-ADD     XACANB        TAN04B
     C                   END
N04  C                   IF        XASWAB = 999,99 OR XASWAB = 9999,99
N04  C                   Z-ADD     99999,99      TATSJB
N04  C                   ELSE
N04  C                   Z-ADD     XASWAB        TATSJB
N04  C                   END
N04  C                   IF        XASERB = 999,99 OR XASERB = 9999,99
N04  C                   Z-ADD     99999,99      TAN05B
N04  C                   ELSE
N04  C                   Z-ADD     XASERB        TAN05B
N04  C                   END
N04  C                   IF        XAALBB = 999,99 OR XAALBB = 9999,99
N04  C                   Z-ADD     99999,99      TAN06B
N04  C                   ELSE
N04  C                   Z-ADD     XAALBB        TAN06B
N04  C                   END
N04  C                   IF        XAUKRB = 999,99 OR XAUKRB = 9999,99
N04  C                   Z-ADD     99999,99      TAN07B
N04  C                   ELSE
N04  C                   Z-ADD     XAUKRB        TAN07B
N04  C                   END
N04  C                   IF        XAPERB = 999,99 OR XAPERB = 9999,99
N04  C                   Z-ADD     99999,99      TAN08B
N04  C                   ELSE
N04  C                   Z-ADD     XAPERB        TAN08B
N04  C                   END
N04  C                   IF        XAMONB = 999,99 OR XAMONB = 9999,99
N04  C                   Z-ADD     99999,99      TAN09B
N04  C                   ELSE
N04  C                   Z-ADD     XAMONB        TAN09B
N04  C                   END
N04  C                   IF        XAHKOB = 999,99 OR XAHKOB = 9999,99
N04  C                   Z-ADD     99999,99      TAN10B
N04  C                   ELSE
N04  C                   Z-ADD     XAHKOB        TAN10B
N04  C                   END
N04  C                   IF        XABNSB = 999,99 OR XABNSB = 9999,99
N04  C                   Z-ADD     99999,99      TAN11B
N04  C                   ELSE
N04  C                   Z-ADD     XABNSB        TAN11B
N04  C                   END
N04  C                   IF        XALMLB = 999,99 OR XALMLB = 9999,99
N04  C                   Z-ADD     99999,99      TAN12B
N04  C                   ELSE
N04  C                   Z-ADD     XALMLB        TAN12B
N04  C                   END
     C                   MOVE      'V'           TAORDK
     C                   MOVE      'V'           TAEFK
     C                   MOVE      'V'           TAEFTK
     C     ENH11         IFEQ      '%'
     C                   MOVE      'P'           TAORDK
     C                   MOVE      'P'           TAEFK
     C                   MOVE      'P'           TAEFTK
     C                   END
     C     ENH16         IFEQ      'PR.STK'
     C     ENH16         OREQ      'PR. ST'
     C                   MOVE      'A'           TAORDK
     C                   MOVE      'A'           TAEFK
     C                   MOVE      'A'           TAEFTK
     C                   END
     C     ENH16         IFEQ      'PR.100'
     C                   MOVE      'W'           TAORDK
     C                   MOVE      'W'           TAEFK
     C                   MOVE      'W'           TAEFTK
     C                   END
     C     ENH16         IFEQ      'PR.LIT'
     C                   MOVE      'A'           TAORDK
     C                   MOVE      'A'           TAEFK
     C                   MOVE      'A'           TAEFTK
     C                   END
     C     TAORDB        IFEQ      *ZEROS
     C                   MOVE      'F'           TAORDK
     C                   END
     C*
     C     TAEFB         IFEQ      *ZEROS
     C                   MOVE      'F'           TAEFK
     C                   END
     C*
     C     TAEFTB        IFEQ      *ZEROS
     C                   MOVE      'F'           TAEFTK
     C                   END
     C*
N02  C                   IF        TARINR <> 35022090 OR XIKKE <> 'J'
     C                   MOVE      TARINR        TATANR
     C                   MOVEL     TARINR        TAKAPN
     C                   MOVE      KAP           TAKAP                          LETTELSER
     C                   MOVE      RESTRI        TAKAPA                         RESTRIKSJONE
     C                   EXSR      TESTKO
     C                   MOVE      XDATO         TADATO
     C                   MOVE      WDATO         TADTR
     C                   WRITE     TARIR
N02  C                   IF        TARINR = 35022090
N02  C                   MOVE      'J'           XIKKE             1
N02  C                   ELSE
N02  C                   MOVE      'N'           XIKKE
N02  C                   END
N02  C                   END
      *
     C                   MOVE      '0'           INST
      *
     C******************************************
     C     TESTKO        BEGSR
     C******************************************
     C                   MOVE      ' '           STK               1
     C                   MOVE      '   '         ENHET             3
     C*
     C                   SETOFF                                       33
      *
     C                   MOVE      'KGM'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'KGM'         ENHET             3
     C   33              GOTO      UTENH
      *
     C                   MOVE      'KSD'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'KSD'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'NMB'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'stk'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'STK'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'stk'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'MTK'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'm2 '         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'MTQ'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'm3 '         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'MTO'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'm3 '         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'LIT'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'lit'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'LTR'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'lit'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'BR.'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'brt'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'GT '         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'brt'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'GRM'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'gra'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'PAR'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'par'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'NPR'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'par'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'MWH'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'mwh'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C*
     C                   MOVE      'MET'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'MTR'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'MTR'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'MTR'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'KAR'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'HE '         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'HE '         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'HE '         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'FAT'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'BLL'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C                   MOVE      'BLL'         AENHET            3
     C                   EXSR      TSTENH
     C   33              MOVE      'J'           STK               1
     C   33              MOVE      'BLL'         ENHET             3
     C   33              GOTO      UTENH
     C*
     C     UTENH         TAG
     C*
     C*
     C                   MOVE      STK           TASTK
     C                   MOVE      ENHET         TAENHE
     C     TATANR        SETLL     TARI
     C     TATANR        READE     TARI                                   33
     C                   IF        *IN33 = *OFF
     C                   DOW       *IN33 = *OFF
     C                   MOVE      GM_TAALFA     TAALFA
     C                   MOVE      GM_TATXT      TATXT
     C     TATANR        READE     TARI                                   33
     C                   ENDDO
     C                   ELSE
     C                   MOVEL     TATANR        TANR4             4 0
     C     TANR4         CHAIN     TARIKAP                            33
     C   33              MOVE      *BLANKS       TAALFA
     C  N33              MOVE      NYALFA        TAALFA
     C                   END
     C*
     C                   ENDSR
     C******************************************
     C     TSTENH        BEGSR
     C******************************************
     C                   SORTA     TA1
     C                   SORTA     TA2
     C                   SORTA     TA3
     C                   SETOFF                                       33
     C     AENHET        LOOKUP    TA1                                    33
     C  N33AENHET        LOOKUP    TA2                                    33
     C  N33AENHET        LOOKUP    TA3                                    33
     C                   ENDSR
      *
