********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 OPDATER FEIL TIL.DATO
********************************************************************
     H DATEDIT(*DMY)
     FSADSD     UP   E             DISK
     FSADSDNY   UF   E           K DISK    RENAME(SADSDR:SADSDRX)
     F                                     PREFIX(NY_)
      *
     C                   IF        XINIT <> 'J'
     C     KEY           KLIST
     C                   KFLD                    SDTNRF
     C                   KFLD                    SDKDAÆ
     C                   KFLD                    SDKDSÆ
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   IF        SDKDAÆ = 'RT'
     C     KEY           CHAIN     SADSDNY                            33
     C                   IF        *IN33 = *OFF
     C                   IF        NY_SDDTF < SDDTF
     C                   MOVE      NY_SDDTF      SDDTF
     C                   END
     C                   MOVE      NY_SDDTT      SDDTT
     C                   DELETE    SADSDRX
N01  C                   ELSE
N01  C                   MOVE      WDT           SDDTT
     C                   END
S01  C*                  ELSE
S01  C*                  MOVE      WDT           SDDTT
     C                   END
      *
     C                   UPDATE    SADSDR
      *
