      * LES GAMMEL SADAVGE
      * HVIS POST IKKE FINNES I SADSDNYE,
      * SETT SLUTTDATO = DAGENSDATO - 1.
     FSADAVGE   UP   E             DISK
     FSADSDNYE  IF   E           K DISK
     D                 DS
     D  XDT2                   1      8  0
     D  XDT2Å                  1      4  0
     D  XDT2M                  5      6  0
     D  XDT2D                  7      8  0
      *
     C     XINIT         IFEQ      ' '
     C     KEY           KLIST
     C                   KFLD                    AGTANR
     C                   KFLD                    AGAKD
     C                   KFLD                    AGSKV
     C                   MOVE      'J'           XINIT             1
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           XDT               8 0
     C                   MOVE      WDT           XDT2              8 0
     C                   IF        XDT2M < 3
     C                   EVAL      XDT2 = XDT2 - 9000
     C                   ELSE
     C                   EVAL      XDT2 = XDT2 - 200
     C                   END
     C                   MOVE      'SUB'         UFUNK             3
     C                   MOVE      WDT           UDT1              8 0
     C                   Z-ADD     1             UDAG              5 0
     C                   CALL      'SYGE20'
     C                   PARM                    UFUNK
     C                   PARM                    UDT1              8 0
     C                   PARM                    UDT2              8 0
     C                   PARM                    UDAG              5 0
     C                   END
      *
     C                   IF        AGDTT < XDT2
     C                   DELETE    SADAVGER
     C                   ELSE
     C                   IF        AGDTT > XDT
     C     KEY           CHAIN     SADSDNYE                           33
     C   33              MOVE      UDT2          AGDTT
     C                   END
      *
     C                   UPDATE    SADAVGER
     C                   END
      *
