     FSYTIHENT  O  A F   80        DISK
      * INPUT PARAMETER
     C     *ENTRY        PLIST
     C                   PARM                    FILE             15
     C                   PARM                    STMF             30
      * USERID AND PASSWORD RECORD
     C                   MOVEL(P)  'anonymous'   DATA             80
     C                   CAT       'pass':1      DATA
     C                   EXCEPT    AWRK
      * NAMEFMT
     C                   MOVEL(P)  'NAMEFMT 1'   DATA
     C                   EXCEPT    AWRK
      * BIN
     C                   MOVEL(P)  'BIN'         DATA
     C                   EXCEPT    AWRK
      * sendpasv 0
     C                   MOVEL(P)  'sendepsv 0'  DATA
     C                   EXCEPT    AWRK
      * GET
     C                   MOVEL(P)  'get'         DATA
     C                   CAT       FILE:1        DATA
     C                   CAT       '/':1         DATA
     C                   CAT       STMF:0        DATA
     C                   CAT       '(REPLACE':1  DATA
     C                   EXCEPT    AWRK

      * QUIT COMMAND RECORD
     C                   MOVEL(P)  'quit'        DATA
     C                   EXCEPT    AWRK
     C                   MOVE      '1'           *INLR
     OSYTIHENT  EADD         AWRK
     O                       DATA                80
