     FTURER20   UF   E           K DISK
     C*
     C                   Z-ADD     1             TUSJA1
      *
     C     TUSJA1        SETLL     TURER20
     C                   READ      TURER20                                33
     C     *IN33         DOWEQ     '0'
     C     TUTST4        IFEQ      '1'
     C     TUDT          ANDLT     20070821
     C                   MOVE      '2'           TUTST4
     C                   UPDATE    TURERR
     C                   END
     C                   READ      TURER20                                33
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
