     FTURER14   IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    TURNR            17
     C                   PARM                    BILN             13
     C                   PARM                    FRA              20
     C                   PARM                    TIL              20
     C                   PARM                    TOLL              8
     C                   MOVE      *BLANKS       BILN
     C                   MOVE      *BLANKS       FRA
     C                   MOVE      *BLANKS       TIL
     C                   MOVE      *BLANKS       TOLL
     C                   MOVEL     TURNR         TURNUM            8 0
     C     KEY           KLIST
     C                   KFLD                    TURNUM
     C     KEY           CHAIN     TURER14                            33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     TUBILN        BILN
     C                   MOVEL     TUSDF         FRA
     C                   MOVEL     TUSDT         TIL
     C                   MOVEL     TUTO1A        TOLL
     C                   END
     C                   SETON                                        LR
     C                   RETURN
      *
