********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 LINK ER ENDRET FRA 31 TIL 50 LAND
********************************************************************
      *
      ************************************************************
      *** PROGRAM SKAL VISE HYPERKOBLING TIL PDF
     F**************************************************************
     FFIRM      IF   E           K DISK
     FFIRMPDF   IF   E           K DISK
     Fsytl08fm  CF   E             WORKSTN
     C     *ENTRY        PLIST
S01  C*                  PARM                    link             31
N01  C                   PARM                    link             50
     c                   read      firm                                   33
     c                   read      firmpdf                                33
     c                   movel     'http://'     updf             70
     C     updf          CAT       pdipad:0      updf
     C     updf          CAT       link:0        updf
     C*
     C     START         TAG
     C     XWIN          IFEQ      ' '
     C                   MOVE      'J'           XWIN              1
     C                   WRITE     WINDOWSZ
     C                   END
     C                   EXFMT     BILDE01
     C*
     C   03              GOTO      SLUTT
     C                   GOTO      START
     C*
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
