      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE PROFIL GODSJOURNAL           ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER                                     ***
      **************************************************************
      *
     FGODSFI    UF A E           K DISK
     FSYTL03FM  CF   E             WORKSTN
     C     *ENTRY        PLIST
     C                   PARM                    UKOD              5
     C                   PARM                    UKOD2             1
     C                   PARM                    UFUNK             1
     C     UKOD          IFNE      *BLANKS
     C                   MOVE      UKOD          WSLBKO
     C                   MOVE      UKOD2         WSENH
     C                   END
     C     KEY           KLIST
     C                   KFLD                    WSLBKO
     C                   KFLD                    WSENH
      *
     C     KEY           CHAIN(N)  GODSFI                             50
     C     *IN50         IFEQ      *OFF
      * KOPI - SETT INDIKATOR FOR NY
     C     UFUNK         IFEQ      '3'
     C                   MOVE      *ON           *IN50
     C                   END
     C                   MOVE      GFLBKO        WSLBKO
     C                   MOVE      GFENH         WSENH
     C                   MOVE      GFLBS1        WSLBS1
     C                   MOVE      GFLBS2        WSLBS2
     C                   MOVE      GFLBS3        WSLBS3
     C                   MOVE      GFLBS4        WSLBS4
     C                   MOVE      GFPRT         WSPRT
     C                   MOVE      GFFAX         WSFAX
     C                   ENDIF
     C     START         TAG
     C                   EXFMT     BILDE1
      **  AVSLUTT
     C     *IN03         IFEQ      *ON
     C                   GOTO      SLUTT
     C                   ENDIF                                                  <*IN03
      **
     C                   MOVE      '0'           *IN30
     C*
     C* TESTER
      *   KAN IKKE VæRE BLANK
     C     WSLBKO        IFEQ      *BLANKS
     C                   MOVE      'JOV0726'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
      * 3 SISTE SIFFER UDEFINERT, SETT BLANK
     C     WSENH         IFLT      '0'
     C     WSENH         ORGT      '9'
     C                   MOVE      ' '           WSENH
     C                   END
     C*   50 = NY .... KAN IKKE FINNES FRA FøR...
     C     *IN50         IFEQ      '1'
     C     KEY           CHAIN(N)  GODSFIR                            33
     C     *IN33         IFEQ      '0'
     C                   MOVE      'JOV0727'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     KEY           CHAIN     GODSFIR                            50
     C                   MOVE      WSLBKO        GFLBKO
     C                   MOVE      WSENH         GFENH
     C                   MOVE      WSLBS1        GFLBS1
     C                   MOVE      WSLBS2        GFLBS2
     C                   MOVE      WSLBS3        GFLBS3
     C                   MOVE      WSLBS4        GFLBS4
     C                   MOVE      WSPRT         GFPRT
     C                   MOVE      WSFAX         GFFAX
     C*
     C     *IN50         IFEQ      *ON
     C                   WRITE     GODSFIR
     C                   ELSE
     C                   UPDATE    GODSFIR
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
