     C                   CALL      'SYTR10A'
     C                   PARM      0080          UAVD              4 0
     C                   PARM      0201535       UOPD              7 0
     C                   PARM      'ZX1'         UTTACTI           3
     C                   PARM      20140227      UTTDATE           8 0
     C                   PARM      210537        UTTTIME           6 0
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
