     F*_________________________________________________
     F* OMKJØRING INTEROVERFØRING
     F*"""""""""""""""""""""""""""""""""""""""""""""""""
     FSYTR35OF  CF   E             WORKSTN
     FFIRM      IF   E           K DISK
     FFAK3      IF   E           K DISK
     FSYSRL01   UF   E           K DISK
     FPOSTB1    UF A E           K DISK
     FPOSTA1    o  A E             DISK
     D                 DS
     D  FADATO                 1      8  0
     D  BILAAR                 1      4  0
     D  BILMND                 5      6  0
     D  BILDAG                 7      8  0
     C*
     C* DETALJBEHANDLING
     C*
     C                   EXSR      SRINIT
     C     START         TAG
     C                   EXFMT     BILDE01
     C   03              GOTO      SLUTT
     C                   Z-ADD     WSFAKT        BILNR
     C                   Z-ADD     WSFAKT        XXFAKT            7 0
     C     WSFAKT        IFEQ      0
     C                   GOTO      START
     C                   END
     C     FAKKEY        SETLL     FAK3
     C     *IN50         DOWEQ     '0'
     C     FAKKEY        READE     FAK3                                   50
     C     *IN50         IFEQ      '0'
     C     FASK          IFEQ      'I'
     C                   EXSR      DET
     C                   END
     C                   END
     C                   END
      * minst en detaljpost funnet..
     c     POSLNR        ifne      *zeros
     C                   EXSR      GETSUR
     C                   WRITE     POSAR
     c                   end
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C***************************************************
     C     DET           BEGSR
     C***************************************************
     C*
     C* STED/BÆRER
     C*
     C                   MOVE      FAAVDR        KSTED
     C                   MOVE      FABÆR         KBARER
     C                   Z-ADD     FAACCN        KONTO
     C*
     C                   MOVEL     FACC          PERAAR
     C                   MOVE      FAÅR          PERAAR
     C                   Z-ADD     FAMND         PERNR
     C     SKEY          CHAIN     POSTB1                             44
     C     *IN44         ifeq      '1'
     C                   Z-SUB     FABELN        BBELOP
     C                   EXSR      GETSUR
     C                   WRITE     POSBR
     c                   else
     C                   SUB       FABELN        BBELOP
     C                   UPDATE    POSBR
     c                   end
     C                   ENDSR
     C*__________________________________________________________
     C* SR FOR INITIERING                                  SRINIT
     C***********************************************************
     C     SRINIT        BEGSR
     C***********************************************************
     C*
     C     FAKKEY        KLIST
     C                   KFLD                    XXOPKO
     C                   KFLD                    XXFAKT
     C                   MOVE      'O'           XXOPKO            1
     C                   READ      FIRM                                   33
     C*
     C     SKEY          KLIST
     C                   KFLD                    PERNR
     C                   KFLD                    PERAAR
     C                   KFLD                    KONTO
     C                   KFLD                    KSTED
     C                   KFLD                    KBARER
     C                   KFLD                    MOMSK
     C                   KFLD                    PROSNR
     C* INITIERER DATAFELT POSTERINGSREGISTER
     C*
     C                   MOVE      FIFIRM        FIRMA
     C                   MOVE      'A'           AKTKOD
     C                   MOVE      'H'           TYPE
     C                   MOVE      '0'           MOMSK
     C                   MOVE      'J'           OPDKOD
     C                   MOVE      'H'           TYPE
     C                   MOVEL     'INTERBEL'    BILTXT
     C                   MOVE      'ASTNING'     BILTXT
     C                   ENDSR
     C******************************************
     C     GETSUR        BEGSR
     C******************************************
     C*
     C* HENT NYTT SURRUGATNR - FRA SYSRF
     C*
     C     SURKEY        KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    REGNAV            6
     C                   MOVE      'SYS   '      REGNAV
     C     SURKEY        CHAIN     SYSRL01                            30
     C  N30              ADD       1             SISSGT
     C  N30              UPDATE    SYSRR
     C                   Z-ADD     SISSGT        POSLNR           13 0
     C                   ADD       1             POSNR
     C                   ENDSR
     C*
