     FUSRDFT    IF   E           K DISK
     D                SDS
     D  ZUSER                254    263
     C     *ENTRY        PLIST
     C                   PARM                    UFLAG             1
     C     ZUSER         CHAIN     USRDFT                             33
     C   33              MOVE      '1'           UFLAG
     C                   SETON                                        LR
     C                   RETURN
