********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 NULLSTILL UDS
********************************************************************
      *
      *** PROGRAM SOM SKRIVER UT TURLISTER                         ***
      ***
     FSYTRTUFM  CF   E             WORKSTN
     FTURER     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     D                UDS
     D  UDSFIR                 1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
N01  D  UOPD                  82     89
N01  D  UFBNR                 90     92
     C*
     C                   EXSR      INIT
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309899
     C                   SETOFF                                       97
     C   03              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99WSAVD         COMP      *ZEROS                                 99
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C*
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C*
      * MÅ OPPGI TURNR NÅR.... (IKKE VED KJØRING AV TURKONV.)
     C     WSPRO         IFNE      *ZEROS
     C     WSTY          ORNE      *BLANKS
     C     WSGOD         OREQ      'J'
     C     WSLAS         OREQ      'J'
     C     TURERK        CHAIN     TURER                              97
     C   97              MOVE      'SPT0002'     MSGNR
     C   97              SETON                                        30
     C   97              GOTO      START
     C                   END
     C     WSTY          IFEQ      'I'
     C     WSTY          OREQ      'E'
     C     WSTY          OREQ      'B'
     C                   EXSR      ORDRE
     C                   END
     C     WSKON         IFEQ      'J'
     C                   EXSR      KONV
     C                   END
     C     WSGOD         IFEQ      'J'
     C                   EXSR      GODS
     C                   END
     C     WSLAS         IFEQ      'J'
     C                   EXSR      LAST
     C                   END
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     ORDRE         BEGSR
     C***********************************************
     C                   MOVE      WSAVD         AAAVD             4
     C                   MOVE      WSPRO         AAPRO             8
N01  C                   MOVE      *ZEROS        AAOPD             7
     C                   CALL      'SYTR40CB'
     C                   PARM                    AAAVD
     C                   PARM                    AAPRO
N01  C                   PARM                    AAOPD
     C                   PARM                    WSTY
      *
     C                   ENDSR
      *
      *
     C***********************************************
     C     KONV          BEGSR
     C***********************************************
     C                   CALL      'SYTR22CD'
     C                   PARM                    WSAVD
     C                   PARM                    WSSG
     C                   PARM                    WSPRO
      *
     C                   ENDSR
     C***********************************************
     C     GODS          BEGSR
     C***********************************************
     C* GODSLISTE
     C                   MOVE      WSAVD         XXAVD             4
     C                   MOVE      WSPRO         XXPRO             8
     C                   MOVE      *ZEROS        XXAGEN            8
     C                   MOVE      'N'           XXFAX             1
     C                   MOVE      'N'           XXADR             1
     C                   CALL      'SYFA55'
     C                   PARM                    XXAVD
     C                   PARM                    XXPRO
     C                   PARM                    XXAGEN
     C                   PARM                    XXBELJ            1
     C                   PARM                    XXFAX
     C                   PARM                    XXADR
     C                   ENDSR
     C***********************************************
     C     LAST          BEGSR
     C***********************************************
     C* LASTELISTE
     C                   MOVE      WSAVD         XXAVD             4
     C                   MOVE      WSPRO         XXPRO             8
     C                   CALL      'SYFA54CD'
     C                   PARM                    XXAVD
     C                   PARM                    XXPRO
     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UPRO              8 0
     C     KODSFK        KLIST
     C                   KFLD                    WSSFUN
     C                   KFLD                    WSSG
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSAVD
     C     TURERK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSPRO
     C*
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      UAVD          WSAVD
     C                   MOVE      USG           WSSG
     C                   MOVE      UPRO          WSPRO
N01  C                   MOVE      *ZEROS        UOPD
N01  C                   MOVE      *ZEROS        UFBNR
     C                   READ      FIRM                                   33
     C                   ENDSR
