      ************************************************************
      *** UTSKRIFT AV RUNDTURER                                ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FUNITL01   IF   E           K DISK
     FBILK      IF   E           K DISK
     FTRAN      IF   E           K DISK
     FSYTR92FA  CF   E             WORKSTN
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    ZSVAVD            4
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD
     C                   PARM                    WBILNR           10
     C                   PARM                    WBILKD            3
     C                   PARM                    ZTRAN             8
     C                   PARM                    ZFPER             4
     C                   PARM                    ZTPER             4
     C                   PARM                    WSJOBQ
     C*
     C                   MOVE      ZSVAVD        WSVAVD            4 0
     C                   MOVE      ZTRAN         WTRAN             8 0
     C*
     C     *LIKE         DEFINE    BILNR         XBILNR
     C     *LIKE         DEFINE    TRANNR        XTRAN
     C     *LIKE         DEFINE    BILKOD        XBILKD
     C     *LIKE         DEFINE    FIFIRM        FIRMA
     C     *LIKE         DEFINE    TRANNR        TRANSP
     C                   MOVE      'J'           SOK               1
     C*
     C     SOK1          KLIST
     C                   KFLD                    FIRMA
     C                   KFLD                    TRANSP
     C*
     C                   READ      FIRM                                   33
     C                   MOVEL     FIFIRM        FIRMA
     C                   MOVE      '0'           UIN01
     C                   MOVE      'Y'           WSJOBQ
     C*
     C                   SETON                                        50
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   CLEAR                   MSGNR
     C                   SETOFF                                       309899
     C                   SETOFF                                       979670
     C                   SETOFF                                       7172
     C*
     C     *IN03         IFEQ      '1'
     C                   MOVE      *ON           UIN01
     C                   GOTO      SLUTT
     C                   END
     C*
     C     *IN04         IFEQ      '1'
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C     LINNBR        IFEQ      4
     C                   CALL      'SYTR19'
     C                   PARM                    XBILNR
     C                   MOVEL     XBILNR        BILNR
     C                   END
     C     LINNBR        IFEQ      6
     C                   CALL      'SYTR21A'
     C                   PARM                    XBILKD
     C                   MOVEL     XBILKD        BILKOD
     C                   END
     C     LINNBR        IFEQ      8
     C                   CALL      'SYTR04A'
     C                   PARM                    XTRAN
     C                   Z-ADD     XTRAN         TRANNR
     C                   END
     C                   GOTO      START
     C                   END
     C*
     C     BILNR         IFEQ      *BLANKS
     C     BILKOD        ANDEQ     *BLANKS
     C     TRANNR        ANDEQ     0
     C                   MOVE      'TBR0038'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     BILNR         IFNE      *BLANKS
     C     BILNR         CHAIN     UNITR                              70
     C     *IN70         IFEQ      '1'
     C                   MOVE      'TBR0039'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     BILKOD        IFNE      *BLANKS
     C     BILKOD        CHAIN     BILKR                              71
     C     *IN71         IFEQ      '1'
     C                   MOVE      'TBR0040'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     TRANNR        IFNE      0
     C                   Z-ADD     TRANNR        TRANSP
     C     SOK1          CHAIN     TRANR                              72
     C     *IN72         IFEQ      '1'
     C                   MOVE      'TBR0041'     MSGNR
     C                   MOVE      *ON           *IN30
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     BILNR         IFNE      *BLANKS
     C     BILKOD        ANDNE     *BLANKS
     C     TRANNR        ANDNE     0
     C                   MOVE      'TBR0038'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     BILNR         IFNE      *BLANKS
     C     BILKOD        ANDNE     *BLANKS
     C                   MOVE      'TBR0038'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     BILNR         IFNE      *BLANKS
     C     TRANNR        ANDNE     0
     C                   MOVE      'TBR0038'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     BILKOD        IFNE      *BLANKS
     C     TRANNR        ANDNE     0
     C                   MOVE      'TBR0038'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     FPER          IFEQ      *ZEROS
     C                   MOVE      'TBR0042'     MSGNR
     C                   Z-ADD     11            LINNBR
     C                   Z-ADD     29            POSNBR
     C                   MOVE      *ON           *IN30
     C                   GOTO      START
     C                   END                                                    <NAKUND
     C*
     C     TPER          IFEQ      *ZEROS
     C                   Z-ADD     FPER          TPER
     C                   GOTO      START
     C                   END
     C*
     C* HENTER STANDARD PRINTERSTYRING
     C*
     C                   SETON                                        50
     C                   Z-ADD     29            PRTNR             3 0
     C     BILNR         IFNE      *BLANKS
     C                   CALL      'SYGE01'
     C                   PARM                    WSVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C                   END
     C*
     C                   SETOFF                                       50
     C                   EXFMT     BILDE01
     C*
     C     *IN03         IFEQ      '1'
     C                   MOVE      '1'           UIN01
     C                   GOTO      SLUTT
     C                   END
     C*
     C                   MOVE      BILNR         WBILNR
     C                   MOVE      BILKOD        WBILKD
     C                   Z-ADD     TRANNR        WTRAN
     C                   MOVE      WTRAN         ZTRAN
     C                   MOVE      FPER          ZFPER
     C                   MOVE      FPER          ZTPER
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
