      *
      ************************************************************
      *** FINN NESTE LØPENR PR TUR FOR FRAKT-SAMTAKSERING
      ************************************************************
      *
     FSYTR88S1  IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UPRO              8 0
     C                   PARM                    ULNR              2 0
     C                   Z-ADD     98            ULNR
      *
     C     KEY           KLIST
     C                   KFLD                    UPRO
     C                   KFLD                    ULNR
      *
     C     KEY           SETGT     SYTR88S1
     C     UPRO          READPE    SYTR88S1                               33
     C   33              MOVE      *ZEROS        STNR
     C     STNR          ADD       1             ULNR
      *
     C                   SETON                                        LR
     C                   RETURN
      *
