      *
      ************************************************************
      *** UTSKRIFT AV TURKONVOLUTT                             ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FKODTV     IF   E           K DISK
     FSYTR41FA  CF   E             WORKSTN
     D                 DS
     D  UDATO                  1      6  0
     D  UÅR                    1      2  0
     D  UMN                    3      4  0
     D  UDG                    5      6  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18  0
     D  USG                   19     21
     C*
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSVAVD
     C     KODTV2        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSVAV2
     C                   Z-ADD     UAVD          WSVAV2            4 0
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    UUVAVD            4
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD
     C                   PARM                    UUDATO            6
     C                   PARM                    UUDAT2            6
     C                   PARM                    WSTY
     C                   PARM                    WSSORT
     C                   PARM                    WSTILL
     C                   PARM                    WSFAKT
     C                   PARM                    WSREK
     C                   PARM                    WSJOBQ
     C                   PARM                    WSANTB
     C                   PARM                    WSCPI
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      '10'          WSCPI
     C                   MOVE      '0'           UIN01
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      UUVAVD        WSVAVD
     C                   MOVE      UYEAR         UÅR
     C                   MOVE      UMONTH        UMN
     C                   MOVE      UDAY          UDG
     C                   MOVE      UDATO         WSDATO
     C                   CALL      'DATFM3'
     C                   PARM                    FIDTFM
     C                   PARM                    WSDATO
     C                   MOVE      WSDATO        WSDAT2
     C*
     C                   SETON                                        50
     C*
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309899
     C                   SETOFF                                       9796
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     WSVAVD        IFNE      *ZEROS
     C     KODTVK        CHAIN     KODTV                              99
     C                   ELSE
     C     KODTV2        SETLL     KODTV
     C                   READ      KODTV                                  99
     C                   END
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C*
     C     WSTY          IFNE      'D'
     C     WSTY          ANDNE     'U'
     C     WSTY          ANDNE     ' '
     C                   MOVE      'DIV5006'     MSGNR
     C                   SETON                                        3096
     C                   GOTO      START
     C                   END
     C*
     C* HENTER STANDARD PRINTERSTYRING
     C*
     C                   Z-ADD     53            PRTNR             3 0
     C     WSVAVD        IFNE      *ZEROS
     C                   CALL      'SYGE01'
     C                   PARM                    WSVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C*
     C                   ELSE
     C                   CALL      'SYGE01'
     C                   PARM                    KOVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C                   END
     C*
     C                   SETOFF                                       50
     C                   EXFMT     BILDE01
     C   03              MOVE      '1'           UIN01
     C*
     C     SLUTT         TAG
     C                   MOVE      WSVAVD        UUVAVD
     C                   MOVE      WSDATO        UUDATO
     C                   MOVE      WSDAT2        UUDAT2
     C                   SETON                                        LR
     C                   RETURN
     C*
