      *****************************************************************
      *** PROGRAMMET HENTER DIV. INFO FRA OVERORDNET OPPDRAG(V/DUP) ***
      *****************************************************************
     FHEADF     IF   E           K DISK
     D                 DS
     D  DUPADS                 1    256
     D  DAAVD0                 1      4  0
     D  DAOPD0                 5     11  0
     D  DAAVD1                12     15  0
     D  DAOPD1                16     22  0
     D  DAAVD2                23     26  0
     D  DAOPD2                27     33  0
     D  DATLE                 34     39
     D  DATLL                 40     49
     D  DATLKU                50     50
     D  DAGN                  51     65
     D  DAPOS1                66     72
     D  DAPOS2                73     76  0
     C     *ENTRY        PLIST
     C                   PARM                    XXAVD             4 0
     C                   PARM                    XXOPD             7 0
     C                   PARM                    XXPADS          256
      *
     C     HEADFK        KLIST
     C                   KFLD                    XXAVD
     C                   KFLD                    XXOPD
      *
     C     HEADFK        CHAIN(N)  HEADF                              33
      *
     C                   Z-ADD     TRAVD0        DAAVD0
     C                   Z-ADD     TROPD0        DAOPD0
     C                   Z-ADD     TRAVD1        DAAVD1
     C                   Z-ADD     TROPD1        DAOPD1
     C                   Z-ADD     TRAVD2        DAAVD2
     C                   Z-ADD     TROPD2        DAOPD2
     C                   MOVE      HETLE         DATLE
     C                   MOVE      HETLL         DATLL
     C                   MOVE      HETLKU        DATLKU
     C                   MOVE      HEGN          DAGN
     C                   MOVE      HEPOS1        DAPOS1
     C                   Z-ADD     HEPOS2        DAPOS2
      *
     C                   MOVE      DUPADS        XXPADS
      *
     C                   SETON                                        LR
     C                   RETURN
