     FKODTA     IF   E           K DISK
     C*
     C                   EXSR      INIT
     C*
     C                   EXSR      BEREGN
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4 0
     C                   PARM                    UUOPD             7 0
     C                   PARM                    UUBEL            13 2
     C                   MOVE      UUAVD         WSAVD             4 0
     C                   MOVE      UUOPD         WSOPD             7 0
      *
      *
     C     KODKEY        KLIST
     C                   KFLD                    KODUNI            1
     C                   KFLD                    WSAVD
      *
     C                   MOVE      'A'           KODUNI
      *
     C     KODKEY        CHAIN     KODTA                              33
      *
     C                   ENDSR
      *
     C******************************************
     C     BEREGN        BEGSR
     C******************************************
     C* POSTNUMMERBASERT KALKULASJON
      * Finn frakt i kundersfraktavtale
     C                   MOVE      *BLANKS       UUVAL             3
     C                   MOVE      'FRA'         UGEB              3
     C                   MOVE      'FRA'         UGEBKO            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C* LEGGER INN DUMMY "S" FOR PART (ULIK A=OPPDATER FR.BER.VEKT)
     C                   MOVE      'S'           USKA              1
     C                   CALL      'SYGE04'
     C                   PARM                    UGEBKO
     C                   PARM                    UGEB
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    KOAKNR
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    UAVNR             9 0
     C                   PARM                    UAVMSG           50
     C                   PARM                    USKA
     C                   MOVE      'A'           XKDA
      *
      *
     C     UUBELØ        IFEQ      0
     C                   MOVE      'B'           XKDA              1
     C                   MOVE      *BLANKS       UUVAL
     C                   MOVE      *ZEROS        URABAT
     C                   CALL      'SYGE03'
     C                   PARM                    UGEB
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    USONE             5
     C                   PARM                    URABAT            5 2
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    KOAKNR
     C                   PARM                    UAVNR             9 0
     C     URABAT        IFNE      *ZEROS
     C                   MOVE      'A'           XKDA
     C                   END
     C                   END
      *
      *
     C                   Z-ADD     UUBELØ        UUBEL
      *
     C                   ENDSR
     C*
