********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10187 * 01 SH  PTF10 innført epostadresse ...
********************************************************************
      ***********************************************************
      *** FAX/MOBILNR PR BIL                                  ***
      ***********************************************************
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      ***********************************************************
      *
     FUNITFX    UF A E             DISK
     FUNITFX1   IF   E           K DISK
     F                                     RENAME(UNITFXR:UFXR)
     F                                     INFDS(UNITDS)
     FSYTR09FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D UNITDS          DS
     D  RECNOB               397    400B 0
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     UFBILN        SETLL     UNITFX1
     C     UFBILN        READE(N)  UNITFX1                                94
      *
     C     *IN94         DOWEQ     '0'
     C     UMODUS        IFEQ      'P'
     C     UFFAX         ANDEQ     *BLANKS
     C                   GOTO      NESTE
     C                   END
     C                   Z-ADD     RECNOB        RECNUM
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     NESTE         TAG
     C     UFBILN        READE(N)  UNITFX1                                94
     C  N94              END
     C*  VIS SUBFIL
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     START3        TAG
     C  N98              Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
N01  C                   Z-ADD     1             ZRECNO
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C                   SETOFF                                       989089
     C                   SETOFF                                       30
     C*
     C*** AVSLUTT
     C   03
     COR 12              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** BLA VIDERE
     C     *IN25         IFEQ      '1'
     C                   ADD       5             ZRECNO
     C     ZRECNO        IFGT      YRECNO
     C                   MOVE      YRECNO        ZRECNO
     C                   END
     C                   MOVE      '0'           *IN25
     C                   GOTO      START3
     C                   END
     C*** BLA VIDERE
     C     *IN26         IFEQ      '1'
     C                   SUB       5             ZRECNO
     C     ZRECNO        IFLE      0
     C     YRECNO        IFGT      0
     C                   Z-ADD     1             ZRECNO
     C                   ELSE
     C                   MOVE      *ZEROS        ZRECNO
     C                   END
     C                   END
     C                   MOVE      '0'           *IN26
     C                   GOTO      START3
     C                   END
      * NY FRA TOPPLINJA..
     C     W2NR          IFEQ      '1'
     C                   EXSR      TESTB1
     C                   GOTO      START3
     C                   END
     C*  VALG
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C     W2TXT         COMP      *BLANKS                                89
     C   89              DO
     C                   MOVE      'JOV0786'     MSGNR
     C                   Z-ADD     9             POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C                   MOVE      W2FAX         UFFAX
     C                   MOVE      W2MOB         UFMOB
N01  C                   MOVE      W2EPO         UFEPO
     C                   MOVE      W2TXT         UFTXT
     C                   WRITE     UNITFXR
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   MOVE      *BLANKS       W2NR
     C                   MOVE      *BLANKS       W2FAX
     C                   MOVE      *BLANKS       W2MOB
N01  C                   MOVE      *blanks       W2EPO
     C                   MOVE      *BLANKS       W2TXT
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVE      '0'           *IN99
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C  N98WSNR          IFEQ      '1'
     C     UFFAX         COMP      '*DL'                                  98
     C   98              GOTO      SLHENT
     C                   MOVE      UFFAX         XXFAX
     C                   MOVE      UFTXT         XXTXT
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     UFFAX         COMP      '*DL'                                  98
     C   98              GOTO      SLHENT
     C     RECNUM        CHAIN     UNITFX                             33
     C  N33              DELETE    UNITFXR
     C                   MOVE      '1'           *IN99
     C                   MOVE      *BLANKS       UFFAX
     C                   MOVE      '*DL'         UFFAX
     C                   MOVE      *BLANKS       UFMOB
N01  C                   MOVE      *blanks       UFEPO
     C                   MOVE      *BLANKS       UFTXT
     C                   MOVE      ' '           WSNR
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
      *
     C  N99              MOVE      'DIV0012'     MSGNR
     C  N99              SETON                                            30
     C   99              MOVE      '0'           *IN98
     C*
     C     SLHENT        ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    UFBILN
     C                   PARM                    XXFAX            15
     C                   PARM                    XXTXT            20
     C                   PARM                    UMODUS            1
      *
      * FINNES EN OG BARE EN POST MED MED FAXNR--
     C     UMODUS        IFEQ      'P'
     C                   MOVE      *BLANKS       XXFAX
     C     UFBILN        SETLL     UNITFX1
     C     UFBILN        READE(N)  UNITFX1                                94
      *
     C     *IN94         DOWEQ     '0'
     C     UFFAX         IFNE      *BLANKS
     C     XXFAX         IFNE      *BLANKS
     C                   GOTO      MANGE
     C                   END
     C                   MOVE      UFFAX         XXFAX
     C                   MOVE      UFTXT         XXTXT
     C                   END
     C     UFBILN        READE(N)  UNITFX1                                94
     C  N94              END
     C     XXFAX         IFNE      *BLANKS
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C                   END
      *
      *
     C     MANGE         TAG
     C                   MOVE      *BLANKS       XXFAX
     C                   MOVE      *BLANKS       XXTXT
      *
     C                   WRITE     WINDOWSZ
     C*
     C                   ENDSR
     C*
