      ***********************************************************
      *** TEST AT SENDINGSNR IKKE ER BRUKT FØR                ***
      ***********************************************************
     FHEAD39    IF   E           K DISK
     FHENOS01   IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    USNDN            20
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UFLAG             1
      *
     c                   Move      UFLAG         FraHent           1
     C                   MOVE      '0'           UFLAG
     C     USNDN         CHAIN     HEAD39                             33
      * FUNNET EN...- HVIS DETTE ER EN ANNEN EN DEN EN STÅR PÅ - FEIK (SAMME=OK)
     C     *IN33         IFEQ      '0'
     C     HEAVD         IFNE      UAVD
     C     HEOPD         ORNE      UOPD
     C                   MOVE      '1'           UFLAG
     C                   END
     C                   END
      * Blant HENTE-OPPDRAG - ÅPEN .. IKKE TILLATT  (men dette testes ikke v/kall far H-oppdr)
     C     FraHent       Ifne      'H'
     C     USNDN         CHAIN     HENOS01                            33
     C     *IN33         IFEQ      '0'
     C     HSST          ANDEQ     ' '
     C                   MOVE      '1'           UFLAG
     C                   END
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
