      *        HENT SUM transp-utbet ETT oppdr.nr                 **
      *
     FTRAVV4    IF   E           K DISK
     FTRAVV5    IF   E           K DISK
     F                                     RENAME(TRAVVR:TRAV5R)
     C     *ENTRY        PLIST
     C                   PARM                    TVTUNR
     C                   PARM                    UUOAVD            4 0
     C                   PARM                    UUOPD             7 0
     C                   PARM                    UUBEL             9 2
     C                   MOVE      *ZEROS        UUBEL
      *
     C     TV4KEY        KLIST
     C                   KFLD                    TVTUNR
     C     TV5KEY        KLIST
     C                   KFLD                    TVTAVD
     C                   KFLD                    TVTUNR
     C                   KFLD                    TVST
     C                   KFLD                    UUOAVD
     C                   KFLD                    UUOPD
     C*
     C     TV4KEY        CHAIN     TRAVV4                             33
     C     *IN33         IFEQ      '0'
     C     TV5KEY        SETLL     TRAVV5
     C     TV5KEY        READE     TRAVV5                                 33
     C     *IN33         DOWEQ     '0'
     C                   ADD       TVBLL         UUBEL
     C     TV5KEY        READE     TRAVV5                                 33
     C                   END
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
