      ***********************************************************
      *** Finne hente-status                                  ***
      *** dersom hentemail ikke finnes - hopp ut              ***
      ***********************************************************
     FHEADF     IF   E           K DISK
     FTRACKL02  IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPD              7 0
     C                   PARM                    UHSTAT            2
      *
     C     HEAkey        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C     TrackKEY      KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UOPD
     C                   KFLD                    TTFBNR            3 0
     C                   KFLD                    TTACTI            3
     C     HEAkey        chain     Headf
      *
     c                   eval      UHSTAT = '00'
N23   * CMS = Hentemail sendt = vilkår for å sette farge
N23  C                   MOVE      'CMS'         TTACTI                         POD-Levert
N23  C     TrackKEY      Chain     TRACKL02                           33
N23  C   33              goto      UtHenFarg                                    00=normal/gronn
      *
N23  C                   MOVE      'TEI'         TTACTI
N23  C     TrackKEY      Chain     TRACKL02                           33
N23   * Henteoppdrag ANKOMMT TERM/satt på tur = ingen farge=ferdig fulgt opp
N23  c                   if        *in33='0' and HEPRO<>0
     c                   eval      UHSTAT = '99'                                99=ferdig=grønn
N23  c                   goto      UtHenFarg
N23  c                   endif
N23  C  N33              eval      UHSTAT = '60'                                60=Blå=Ankommet TERM
N23  C  N33              goto      UtHenFarg
N23   *
N23  C                   MOVE      'COL'         TTACTI                         Collected
N23  C     TrackKEY      Chain     TRACKL02                           33
N23  C  N33              eval      UHSTAT = '50'                                50=Turkis=Hentet Avs
N23  C  N33              goto      UtHenFarg
N23   *
N23  C                   MOVE      'CCT'         TTACTI                         Coll ConfirmedTransp
N23  C     TrackKEY      Chain     TRACKL02                           33
N23  C  N33              eval      UHSTAT = '40'                                Hvit=BekreftetTransp
N23  C  N33              goto      UtHenFarg
N23   *
N23  C                   MOVE      'CAT'         TTACTI                         Coll Assigned Transp
N23  C     TrackKEY      Chain     TRACKL02                           33
N23  C  N33              eval      UHSTAT = '30'                                Gul =Tildelet transp
N23  C  N33              goto      UtHenFarg
N23   *
N23  C                   MOVE      'RFC'         TTACTI                         Ready For Collection
N23  C     TrackKEY      Chain     TRACKL02                           33
N23  C  N33              eval      UHSTAT = '20'                                Pink=Klar for hentin
N23  C  N33              goto      UtHenFarg
N23   *
N23   ** CMS finnes, men ikke RFC/CAT/COL...
N23  C                   eval      UHSTAT = '10'                                Rød =Ikke bekreftet
      *
      *
N23  C     UtHenFarg     tag
      *
     C                   SETON                                        LR
     C                   RETURN
