      ***********************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE KONTO FOR INTERNBELASTNING***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 04 06 07 09-11 13-24       ***
      *** LEDIGE INDIKATORER 27-32 34-90 95-97                ***
      ***********************************************************
      *
     FKODTGE    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FKONTL01   IF   E           K DISK
     FBILK      IF   E           K DISK
     FKODTGI    UF A E           K DISK
     FKODTGI1   IF   E           K DISK
     F                                     RENAME(KODTGIR:KOGI1R)
     FSYTR14FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D LN              S              2  0 DIM(20)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     IKOGI1R
     I              KGIKOD                      X1
     I              KGIAVD                      X2
     I              KGIINT                      X3
     I              KGIKOS                      X4
     I              KGIBKO                      X5
     I              KGIBYT                      X6
     C*
     C                   EXSR      INIT
     C*
     C*
     C* VEDLIKEHOLD AV PRINTERSTYRING
     C* HENTE UTSKRIFTTYPER
     C*
     C                   EXSR      HENTP
     C*
     C*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     C     ST1           TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   Z-ADD     *ZEROS        YLNR              3 0
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     WSIKOD        SETLL     KODTGI
     C     ST2           TAG
     C                   READ(N)   KODTGI                                 94
      *
     C     ST3           TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   READ(N)   KODTGI                                 94
     C  N94              END
     C                   END
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     3             POSNBR
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     ST4           TAG
     C                   MOVEA     '11'          *IN(91)
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   MOVE      KGIKOD        WSIKOD
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       98
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C                   MOVE      *BLANKS       WSIKOD
     C   05              GOTO      ST1
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     07            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA UTSKRIFT TYPE
     C   08              GOTO      ST7
     C*** GÅ TIL BILDE02
     C   12              GOTO      SLUTT
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94              READP(N)  KODTGI                                 94
     C  N94              READ(N)   KODTGI                                 94
     C                   GOTO      ST3
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      ST4
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      ST4
     C*
     C*
     C*** SØK FRA UTSKRIFTTYPE
     C     ST7           TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C                   EXFMT     VAREL2
     C   12              GOTO      ST4
     C                   GOTO      ST1
     C*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   SETON                                        40
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     W2NR          IFEQ      '2'
     C                   SETON                                        99
     C                   EXSR      CHGP
     C   12              GOTO      SLHENT
     C                   END
     C     W2NR          IFEQ      '4'
     C                   SETON                                        99
     C                   EXSR      DLTP
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     3             POSNBR
     C                   SETOFF                                       99
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGP          BEGSR
     C***********************************************
     C     KOKEY1        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2IINT
     C     KOKEY2        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    W2IKOS
     C     BYTTKE        KLIST
     C                   KFLD                    KGIKOD
     C                   KFLD                    XXBYTT            1
     C*
     C                   Z-ADD     27            LINNBR
     C                   Z-ADD     18            POSNBR
     C                   MOVE      KGIINT        W2IINT
     C                   MOVE      KGIKOS        W2IKOS
     C                   MOVE      KGIBYT        W2BYTT
     C*
     C     FEIL          TAG
     C                   EXFMT     VARELI
     C   12              GOTO      SLCHG
     C*
     C* MÅ IKKE FINNES MED ANNEN BYTTKODE(PÅ ANNEN AVD/BILKODE)
     C                   SETOFF                                       307273
     C     W2BYTT        IFEQ      'J'
     C                   MOVE      'N'           XXBYTT
     C                   ELSE
     C                   MOVE      'N'           W2BYTT
     C                   MOVE      'J'           XXBYTT
     C                   END
     C     BYTTKE        CHAIN     KODTGI1                            33
     C  N33              SETON                                        72
     C* HVIS VAREKODEN ER EN BILKODE KAN/VIL BILKODEN HENTET FRA TUR
     C* VÆRE DEN SAMME ANDRE KOMBINASJOENR ER UTENKELIG
     C* (KUNNE VÆRT BLANK I REGISTERET HER, MEN UTFYLT MED LIK VERDI
     C*  SPARES DET NOEN CHAIN I SYTR35 I FORH. TIL BLANK)
     C     KGIKOD        CHAIN     BILK                               33
     C  N33KGIBKO        IFNE      *BLANKS
     C     KGIBKO        ANDNE     KGIKOD
     C  N33              SETON                                        73
     C                   END
     C*
     C     KOKEY1        CHAIN     KONTL01                            70
     C     KOKEY2        CHAIN     KONTL01                            71
     C*
     C   72              MOVE      'JOV0303'     MSGNR
     C   70
     COR 71              MOVE      'SPK0022'     MSGNR
     C   73              MOVE      'JOV0302'     MSGNR
     C*
     C   70
     COR 72
     COR 73
     COR 71              SETON                                        30
     C   30              GOTO      FEIL
     C     KGIKEY        CHAIN     KODTGI                             33
     C                   MOVE      W2IINT        KGIINT
     C                   MOVE      W2IKOS        KGIKOS
     C                   MOVE      W2BYTT        KGIBYT
     C  N33              UPDATE    KODTGIR
     C*
     C     SLCHG         TAG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   MOVE      ' '           W2NR
     C                   UPDATE    SUBFIL
     C                   MOVE      *ZEROS        W2IINT
     C                   MOVE      *ZEROS        W2IKOS
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTP          BEGSR
     C***********************************************
     C*
     C                   Z-ADD     27            LINNBR
     C                   Z-ADD     18            POSNBR
     C                   MOVE      KGIINT        W2IINT
     C                   MOVE      KGIKOS        W2IKOS
     C                   MOVE      KGIBYT        W2BYTT
     C*
     C     HELP01        TAG
     C                   EXFMT     VARELI
     C   12              GOTO      SLDLT
     C*
     C*
     C     KGIKEY        CHAIN     KODTGI                             33
     C  N33              DELETE    KODTGIR
     C*
     C     SLDLT         TAG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   MOVE      ' '           W2NR
     C                   MOVE      '*D*'         KGIKOD
     C                   UPDATE    SUBFIL
     C                   MOVE      *ZEROS        W2IINT
     C                   MOVE      *ZEROS        W2IKOS
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     HENTP         BEGSR
     C***********************************************
     C     KEY           KLIST
     C                   KFLD                    KGEUNI
     C                   KFLD                    KGEKOD
     C                   MOVE      'GE'          KGEUNI            2
     C                   MOVE      *BLANKS       KGEKOD            3
     C     KEY           SETLL     KODTGE
     C     STHP          TAG
     C                   SETOFF                                       33
     C                   READ      KODTGE                                 33
     C  N33              DO
     C                   MOVE      KGEKOD        KGIKOD
     C                   MOVE      *BLANKS       KGIBKO
     C     KGIKEY        CHAIN     KODTGI                             33
     C   33              MOVE      *ZEROS        KGIAVD
     C   33              MOVE      *BLANKS       KGIBKO
     C   33              MOVE      99999         KGIINT
     C   33              MOVE      99999         KGIKOS
     C   33              MOVE      'N'           KGIBYT
     C   33              WRITE     KODTGIR
     C  N33              UPDATE    KODTGIR
     C                   GOTO      STHP
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KGIKEY        KLIST
     C                   KFLD                    KGIKOD
     C                   KFLD                    KGIAVD
     C                   KFLD                    KGIBKO
     C*
     C     FIFIRM        SETLL     FIRM
     C                   READ      FIRM                                   33
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C*
     C                   MOVE      *ZEROS        W2IKOS
     C                   MOVE      *ZEROS        W2IINT
     C                   MOVE      *BLANKS       W2BYTT
     C                   MOVE      *ZEROS        KGIAVD
     C                   MOVE      *BLANKS       KGIKOD
     C                   MOVE      *BLANKS       KGIBKO
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C                   SETOFF                                       307071
     C                   SETOFF                                       7273
     C     KGIKEY        CHAIN     KODTGI                             33
     C  N33              SETON                                        30
     C   30              MOVE      'JOV0304'     MSGNR
     C  N33              GOTO      UTTB1
     C*
     C     KOKEY1        CHAIN     KONTL01                            70
     C     KOKEY2        CHAIN     KONTL01                            71
     C* MÅ IKKE FINNES MED ANNEN BYTTKODE(PÅ ANNEN AVD/BILKODE)
     C     W2BYTT        IFEQ      'J'
     C                   MOVE      'N'           XXBYTT
     C                   ELSE
     C                   MOVE      'N'           W2BYTT
     C                   MOVE      'J'           XXBYTT
     C                   END
     C     BYTTKE        CHAIN     KODTGI1                            33
     C  N33              SETON                                        72
     C* HVIS VAREKODEN ER EN BILKODE KAN/VIL BILKODEN HENTET FRA TUR
     C* VÆRE DEN SAMME ANDRE KOMBINASJOENR ER UTENKELIG
     C* (KUNNE VÆRT BLANK I REGISTERET HER, MEN UTFYLT MED LIK VERDI
     C*  SPARES DET NOEN CHAIN I SYTR35 I FORH. TIL BLANK)
     C     KGIKOD        CHAIN     BILK                               33
     C  N33KGIBKO        IFNE      *BLANKS
     C     KGIBKO        ANDNE     KGIKOD
     C  N33              SETON                                        73
     C                   END
     C*
     C   72              MOVE      'JOV0303'     MSGNR
     C   70
     COR 71              MOVE      'SPK0022'     MSGNR
     C   73              MOVE      'JOV0302'     MSGNR
     C   70
     COR 72
     COR 73
     COR 71              SETON                                        30
     C   30              GOTO      UTTB1
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C                   MOVE      W2IINT        KGIINT
     C                   MOVE      W2IKOS        KGIKOS
     C                   MOVE      W2BYTT        KGIBYT
     C                   WRITE     KODTGIR
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C*
     C     UTTB1         ENDSR
     C*
