      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE FERJEPRISAVTALER             ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97       ***
      **************************************************************
      *
     FTRAA      UF A E           K DISK
     FTRAN      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FLEVEL01   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FSYTR03FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  TRFROM                 1      5
     D  XDLT                   1      5
     D                 DS
     D  TRDATE                 1      8  0
     D  TRYEAR                 1      4  0
     D  TRMONT                 5      6  0
     D  TRDAY                  7      8  0
     D                 DS
     D  WRDATE                 1      6  0
     D  WRDAY                  1      2  0
     D  WRMONT                 3      4  0
     D  WRYEAR                 5      6  0
     D                 DS
     D  WSDATE                 1      6  0
     D  WSDAY                  1      2  0
     D  WSMONT                 3      4  0
     D  WSYEAR                 5      6  0
     D                 DS
     D  YSDATE                 1      8  0
     D  YSYEAR                 1      4  0
     D  YSMONT                 5      6  0
     D  YSDAY                  7      8  0
     D                 DS
     D  W2DATE                 1      6  0
     D  W2DAY                  1      2  0
     D  W2MONT                 3      4  0
     D  W2YEAR                 5      6  0
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C     STINI         TAG
     C                   EXSR      INIT
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2FERR        YSFERR
     C                   MOVE      W2FROM        YSFROM
     C                   MOVE      W2TO          YSTO
     C     W2YEAR        IFEQ      0
     C                   MOVE      *ZEROS        YSDATE
     C                   ELSE
     C     W2YEAR        IFGT      50
     C     W2YEAR        ADD       1900          YSYEAR
     C                   ELSE
     C     W2YEAR        ADD       2000          YSYEAR
     C                   END
     C                   END
     C                   MOVE      W2MONT        YSMONT
     C                   MOVE      W2DAY         YSDAY
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSI1        SETLL     TRAA
     C     START1        TAG
     C     WSFIRM        READE(N)  TRAA                                   94
     C     *IN94         IFEQ      '0'
     C                   MOVE      TRFROM        YSFROM
     C                   MOVE      TRFERR        YSFERR
     C                   MOVE      TRTO          YSTO
     C                   MOVE      TRDATE        YSDATE
     C                   END
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   MOVE      TRYEAR        WRYEAR
     C                   MOVE      TRMONT        WRMONT
     C                   MOVE      TRDAY         WRDAY
     C     LEVEK3        CHAIN     LEVEL01                            88
     C  N88              MOVE      LNAVN         WSNAM2
     C                   WRITE     SUBFIL
     C     WSFIRM        READE(N)  TRAA                                   94
     C     *IN94         IFEQ      '0'
     C                   MOVE      TRFROM        YSFROM
     C                   MOVE      TRFERR        YSFERR
     C                   MOVE      TRTO          YSTO
     C                   MOVE      TRDATE        YSDATE
     C                   END
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     2             POSNBR
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      STINI
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     2             POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODSI3        SETLL     TRAA
     C  N94WSFIRM        READE(N)  TRAA                                   94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     2             POSNBR
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C   04              DO
     C                   EXSR      KALL
     C                   MOVE      NUMMER        WSFERR
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   EXFMT     VARELI
     C                   END
     C                   SETOFF                                       72
     C     WSFERR        IFNE      *ZEROS
     C     LEVEK2        CHAIN     LEVEL01                            72
     C   72              MOVE      'SPM0007'     MSGNR
     C   72              SETON                                        30
     C  N72              MOVE      LNAVN         WSNAM2
     C   72              Z-ADD     02            POSNBR
     C   30              GOTO      SLTB
     C                   END
     C*
     C* TEST FROM PLACE
     C                   SETOFF                                       70
     C     WSFROM        IFNE      *BLANKS
     C     WSFROM        CHAIN     STED2                              70
     C   70              MOVE      'SPS0012'     MSGNR
     C   70              SETON                                        30
     C   70              Z-ADD     50            POSNBR
     C   30              GOTO      SLTB
     C                   END
     C* TEST TO PLACE
     C                   SETOFF                                       71
     C     WSTO          IFNE      *BLANKS
     C     WSTO          CHAIN     STED2                              71
     C   71              MOVE      'SPS0013'     MSGNR
     C   71              SETON                                        30
     C   71              Z-ADD     56            POSNBR
     C   30              GOTO      SLTB
     C                   END
     C*
     C  N90WSMONT        COMP      *ZEROS                                 90
     C  N90WSDAY         COMP      *ZEROS                                 90
     C  N90WSPRO         COMP      *ZEROS                                 90
     C   90              MOVE      'SPG0011'     MSGNR
     C  N90              DO
     C                   MOVE      WSDAY         TRDAY
     C                   MOVE      WSMONT        TRMONT
     C     WSYEAR        IFGT      50
     C     WSYEAR        ADD       1900          TRYEAR
     C                   ELSE
     C     WSYEAR        ADD       2000          TRYEAR
     C                   END
     C                   END
     C  N90KODSIK        CHAIN(N)  TRAA                               33
     C  N90
     CANN33              DO
     C                   SETON                                        90
     C                   MOVE      'SPF0108'     MSGNR
     C                   END
     C   90              SETON                                        30
     C   90              Z-ADD     50            POSNBR
     C                   END
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSIK        CHAIN     TRAA                               33
     C                   EXSR      MOVWSI
     C  N33              UPDATE    TRAAR
     C   33              WRITE     TRAAR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSI
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSI
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSI         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      TRFROM        WSFROM
     C                   MOVE      TRFERR        WSFERR
     C                   MOVE      TRTO          WSTO
     C                   MOVE      TRPRO         WSPRO
     C                   MOVE      TRYEAR        WSYEAR
     C                   MOVE      TRMONT        WSMONT
     C                   MOVE      TRDAY         WSDAY
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSIK        CHAIN     TRAA                               33
     C  N33              DELETE    TRAAR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSI         BEGSR
     C***********************************************
     C                   EXSR      MOVSIW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       TRFROM
     C                   MOVE      *ZEROS        TRFERR
     C                   MOVE      *BLANKS       TRTO
     C                   MOVE      *ZEROS        TRPRO
     C                   MOVE      *ZEROS        TRYEAR
     C                   MOVE      *ZEROS        TRMONT
     C                   MOVE      *ZEROS        TRDAY
     C                   MOVE      *ZEROS        WRDATE
     C*
     C                   MOVEL     '*DEL*'       XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSFROM
     C                   MOVE      *ZEROS        WSFERR
     C                   MOVE      *BLANKS       WSTO
     C                   MOVE      *ZEROS        WSPRO
     C                   MOVE      *ZEROS        WSYEAR
     C                   MOVE      *ZEROS        WSMONT
     C                   MOVE      *ZEROS        WSDAY
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSIW        BEGSR
     C***********************************************
     C                   MOVE      TRFROM        WSFROM
     C                   MOVE      TRFERR        WSFERR
     C                   MOVE      TRTO          WSTO
     C                   MOVE      TRPRO         WSPRO
     C                   MOVE      TRYEAR        WSYEAR
     C                   MOVE      TRMONT        WSMONT
     C                   MOVE      TRDAY         WSDAY
     C*
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     73            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSI        BEGSR
     C***********************************************
     C* FIX KEY IF NOT FOUND
     C   33              DO
     C                   MOVE      WSFROM        TRFROM
     C                   MOVE      WSFERR        TRFERR
     C                   MOVE      WSTO          TRTO
     C                   END
     C*
     C* FIXES VARIABLES
     C                   MOVE      WSPRO         TRPRO
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    TRFROM        YSFROM
     C     *LIKE         DEFINE    TRFERR        YSFERR
     C     *LIKE         DEFINE    TRTO          YSTO
     C     KODSIK        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSFERR
     C                   KFLD                    WSFROM
     C                   KFLD                    WSTO
     C                   KFLD                    TRDATE
     C     KODSI1        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    W2FERR
     C                   KFLD                    W2FROM
     C                   KFLD                    W2TO
     C                   KFLD                    YSDATE
     C     KODSI3        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    YSFERR
     C                   KFLD                    YSFROM
     C                   KFLD                    YSTO
     C                   KFLD                    YSDATE
     C*
     C     LEVEK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFIRM
     C                   READ      FIRM                                   33
     C*
     C*
     C     LEVEK2        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFERR
     C*
     C     TRANK3        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFIRM
     C     LEVEK3        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    TRFERR
     C     KUNDK3        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    VMTRKU
     C     LEVKK3        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    VMTRLE
     C                   MOVE      *ZEROS        TRDATE
     C                   MOVE      *ZEROS        WRDATE
     C                   MOVE      *ZEROS        WSDATE
     C                   MOVE      *ZEROS        YSDATE
     C                   MOVE      *ZEROS        W2DATE
     C*
     C     STI           TAG
     C                   EXFMT     BILDE1
     C   03              GOTO      UTI
     C   04              DO
     C                   MOVE      'J'           SOK               1
     C*
     C                   CALL      'SYTR04A'
     C                   PARM                    NUMMER
     C                   MOVE      NUMMER        WSFIRM
     C                   END
     C     TRANK3        CHAIN     TRAN                               88
     C   88              MOVE      'SPT0133'     MSGNR
     C   88              GOTO      STI
     C     KUNDK3        CHAIN     CUNDL01                            44
     C  N44              MOVE      KNAVN         WSNAVN
     C   44              DO
     C     LEVKK3        CHAIN     LEVEL01                            44
     C  N44              MOVE      LNAVN         WSNAVN
     C                   END
     C   44              MOVE      'SPT0134'     MSGNR
     C   44              SETON                                        30
     C   44              GOTO      STI
     C                   MOVE      WSFIRM        TRFIRM
     C*
     C     UTI           ENDSR
     C*
     C*
     C***********************************************
     C     KALL          BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       UUSNAV           30
     C                   CALL      'SO1LEV'
     C                   PARM                    NUMMER            8 0
     C                   PARM                    FIFIRM
     C                   PARM                    UUSNAV
     C                   ENDSR
