      ************************************************************
      *** UTSKRIFT AV TRALLE-BRUK                              ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FKODTV     IF   E           K DISK
     FSYTR42FA  CF   E             WORKSTN
     D                 DS
     D  UDATO                  1      6  0
     D  UÅR                    1      2  0
     D  UMN                    3      4  0
     D  UDG                    5      6  0
     D                UDS
     D  UFIRM                  1      2
     D  UAVDA                 15     18
     D  USG                   19     21
     C*
     C     KODTV2        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    UAVD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD
     C                   PARM                    WSPER             2 0
     C                   PARM                    WSAAR             2 0
     C                   PARM                    WSPERT            2 0
     C                   PARM                    WSAART            2 0
     C                   PARM                    WSTRAN            8 0
     C                   PARM                    WSBILK            3
     C                   PARM                    WSHENG           10
     C                   PARM                    WSSORT            1
     C*
     C                   READ      FIRM                                   33
     C                   MOVE      '0'           UIN01
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'Y'           WSJOBQ
     C     UAVDA         IFGE      '0000'
     C     UAVDA         ANDLE     '9999'
     C                   MOVE      UAVDA         UAVD              4 0
     C                   ELSE
     C                   MOVE      *ZEROS        UAVD
     C                   MOVE      *BLANKS       USG
     C                   END
     C*
     C                   SETON                                        50
     C*
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C                   SETOFF                                       309899
     C                   SETOFF                                       9796
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C     KODTV2        CHAIN     KODTV                              99
     C*
     C* HENTER STANDARD PRINTERSTYRING
     C*
     C                   Z-ADD     54            PRTNR             3 0
     C                   CALL      'SYGE01'
     C                   PARM                    KOVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C*
     C                   SETOFF                                       50
     C                   EXFMT     BILDE01
     C   03              MOVE      '1'           UIN01
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
