********************************************************************
      * VIS DETALJER - ETT KOLLI - FRA SKYTEFIL INN                *
********************************************************************
     FCARGOF    IF   E           K DISK
     FSYTR33K2M CF   E             WORKSTN
      *____
      * Inz
      *""""
     C     *ENTRY        PLIST
     C                   PARM                    UKOID
     C                   PARM                    UKOTERM
     C     *LIKE         DEFINE    KOID          UKOID
     C     *LIKE         DEFINE    KOTERM        UKOTERM
     C     KEYCAR        KLIST
     C                   KFLD                    UKOID
     C                   KFLD                    UKOTERM
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KEYCAR        CHAIN     CARGOF                             51
     C  N51              movel     KOGTYP        KOGTYPA
     C  N51              WRITE     WIND01
     C  N51              EXFMT     DETAIL
     C                   SETON                                        LR
