     FHEAD11    IF   E           K DISK
     FTURER     UF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UPRO              8 0
     C     TURKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UPRO
     C     HEADFK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     TURKEY        CHAIN     TURER                              33
     C  N33              DO
     C                   MOVE      *ZEROS        TUAO
     C                   MOVE      *ZEROS        TUTS
     C                   MOVE      *ZEROS        TUTVKT
     C                   MOVE      *ZEROS        TUTM3
     C                   MOVE      *ZEROS        TUTLM
     C     UPRO          SETLL     HEAD11
     C     STCAL         TAG
     C     UPRO          READE     HEAD11                                 33
     C  N33              DO
     C*
     C                   ADD       HENT          TUTS
     C                   ADD       HEVKT         TUTVKT
     C                   ADD       HEM3          TUTM3
     C                   ADD       HELM          TUTLM
     C                   ADD       1             TUAO
     C                   GOTO      STCAL
     C                   END
     C                   UPDATE    TURERR
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
