      *****************************************************************
      * SKRIVE UT TURER FRA/TIL DATO                                ***
      *****************************************************************
     FHODE      IF   E           K DISK
     FHEADF     IF   E           K DISK
     FTURER     IF   E           K DISK
     FDISPL12   IF   E           K DISK
     FWRKDISP   UF A E           K DISK
     FWRKDISP1  IF   E           K DISK
     F                                     RENAME(WDISPR:WDISP1R)
     FWRKDISP2  IF   E           K DISK
     F                                     RENAME(WDISPR:WDISP2R)
     FWRKDISP3  IF   E           K DISK
     F                                     RENAME(WDISPR:WDISP3R)
     FSYTR41PF  O    E             PRINTER OFLIND(*IN88)
     FFIRM      IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FLEVEL01   IF   E           K DISK
     FTUFE      IF   E           K DISK
     FREIS      IF   E           K DISK
     FTILL      IF   E           K DISK
     FKOSBU2    IF   E           K DISK
     FKOSBU9    IF   E           K DISK
     F                                     RENAME(KOSBUR:KOSB9R)
     FFAK2      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FHESTED    IF   E           K DISK
     D                 DS
     D  BUTXT                  1     35
     D  DSAVD                 14     17
     D  DSOPD                 19     25
     D                 DS
     D  ENGAD3                 1     30
     D  SYPOGE                 1      9
     D  ADR3                  11     34
     D                 DS
     D  TUSJN1                 1     30
     D  TUSJ15                 1     15
     D                 DS
     D  FEDAT2                 1      8  0
     D  FEMON2                 5      6  0
     D  FEDAY2                 7      8  0
     D                 DS
     D  HEVKT                  1      9  0
     D  XXVKT                  5      9  0
     D                 DS
     D  XXSTEF                 1     20
     D  XXSTF1                 1      2
     D  XXSTF2                 4      8
     D  XXSTF3                10     20
     D                 DS
     D  XXSTET                 1     20
     D  XXSTT1                 1      2
     D  XXSTT2                 4      8
     D  XXSTT3                10     20
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C                   EXSR      INIT
     C* LEGG UT I WORKFILE ALLE SOM TILFREDSTIIILER UTVALG
     C                   EXSR      ADDWRK
     C* HENT INN FRA SORTERT WORKFILE - SKRIV HVERT OPPDRAG
     C   60*LOVAL        SETLL     WRKDISP
     C   61*LOVAL        SETLL     WRKDISP1
     C   62*LOVAL        SETLL     WRKDISP2
     C   63*LOVAL        SETLL     WRKDISP3
     C   60              READ      WRKDISP                                35
     C   61              READ      WRKDISP1                               35
     C   62              READ      WRKDISP2                               35
     C   63              READ      WRKDISP3                               35
     C     *IN35         DOWNE     '1'
     C                   EXSR      ETTOPD
     C   60              READ      WRKDISP                                35
     C   61              READ      WRKDISP1                               35
     C   62              READ      WRKDISP2                               35
     C   63              READ      WRKDISP3                               35
     C  N35              END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
     C*
     C***********************************************
     C     ADDWRK        BEGSR
     C***********************************************
     C*
     C     DISKEY        SETLL     DISPL12
     C*
     C*
     C     START         TAG
     C*
     C                   READ      DISPL12                                32
     C  N66              DO
     C  N32DIDATF        COMP      UDAT21                             32
     C  N32UAVD          COMP      DIAVD                              3232
     C                   END
     C   66
     CANN32              DO
     C     UAVD          IFNE      DIAVD
     C                   MOVE      DIAVD         UAVD
     C     DISKEY        SETLL     DISPL12
     C                   GOTO      START
     C                   END
     C   66
     CANN32DIDATF        IFGT      UDAT21
     C                   ADD       1             UAVD
     C     DISKEY        SETLL     DISPL12
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C   32              GOTO      SLUTT
     C*
     C*
     C     UTYPE         IFEQ      'D'
     C     DITUR         IFEQ      *ZEROS
     C                   GOTO      START
     C                   END
     C                   END
     C*
     C     UTYPE         IFEQ      'U'
     C     DITUR         IFNE      *ZEROS
     C                   GOTO      START
     C                   END
     C                   END
     C* DENNE SKAL VÆRE MED - HENT LANDKODER/POSTNUMMER TIL WRKDISP
     C* UTENLANDSK LANDKODE/POSTNR FØRST I KEYEN
     C                   MOVE      *BLANKS       XXLK1
     C                   MOVE      *ZEROS        XXPNR1
     C                   MOVE      *BLANKS       XXSTE1
     C                   MOVE      *BLANKS       XXLK2
     C                   MOVE      *ZEROS        XXPNR2
     C                   MOVE      *BLANKS       XXSTE2
     C     HEAKEY        CHAIN     HEADF                              33
     C  N33HEST          COMP      'S'                                    33
     C   33              GOTO      START
     C* DERSOM HESTED-FINNES ER DET POSTNRBASERT DEST.ANGIVELSE
     C     HEAKEY        CHAIN     HESTED                             53
     C     *IN53         IFEQ      '0'
     C                   MOVE      HELKA         XXSTF1
     C                   MOVE      HESDF         XXSTF2
     C                   MOVEL     HSFROM        XXSTF3
     C     HELKA         IFNE      'NO'
     C                   MOVE      HELKA         XXLK1
     C                   TESTN                   HESDF                34
     C   34              MOVE      HESDF         XXPNR1
     C                   MOVE      HESDF         XXSTE1
     C                   ELSE
     C                   MOVE      HELKA         XXLK2
     C                   TESTN                   HESDF                34
     C   34              MOVE      HESDF         XXPNR2
     C                   MOVE      HESDF         XXSTE2
     C                   END
     C                   MOVE      HETRI         XXSTT1
     C                   MOVE      HESDT         XXSTT2
     C                   MOVEL     HSTO          XXSTT3
     C  N33XXLK1         IFEQ      *BLANKS
     C                   MOVE      HETRI         XXLK1
     C                   TESTN                   HESDT                34
     C   34              MOVE      HESDT         XXPNR1
     C                   MOVE      HESDT         XXSTE1
     C                   ELSE
     C                   MOVE      HETRI         XXLK2
     C                   TESTN                   HESDT                34
     C   34              MOVE      HESDT         XXPNR2
     C                   MOVE      HESDT         XXSTE2
     C                   END
     C                   ELSE
     C     HESDF         CHAIN     STED2                              33
     C  N33              MOVE      ST2LK         XXSTF1
     C  N33              MOVE      ST2PNR        XXSTF2
     C  N33              MOVEL     ST2NVN        XXSTF3
     C  N33ST2LK         IFNE      'NO'
     C                   MOVE      ST2LK         XXLK1
     C                   MOVE      ST2PNR        XXPNR1
     C                   MOVE      HESDF         XXSTE1
     C                   ELSE
     C                   MOVE      ST2LK         XXLK2
     C                   MOVE      ST2PNR        XXPNR2
     C                   MOVE      HESDF         XXSTE2
     C                   END
     C     HESDT         CHAIN     STED2                              33
     C  N33              MOVE      ST2LK         XXSTT1
     C  N33              MOVE      ST2PNR        XXSTT2
     C  N33              MOVEL     ST2NVN        XXSTT3
     C  N33XXLK1         IFEQ      *BLANKS
     C                   MOVE      ST2LK         XXLK1
     C                   MOVE      ST2PNR        XXPNR1
     C                   MOVE      HESDT         XXSTE1
     C                   ELSE
     C                   MOVE      ST2LK         XXLK2
     C                   MOVE      ST2PNR        XXPNR2
     C                   MOVE      HESDT         XXSTE2
     C                   END
     C                   END
     C                   WRITE     WDISPR
     C                   GOTO      START
     C*
     C     SLUTT         ENDSR
     C*
     C***********************************************
     C     ETTOPD        BEGSR
     C***********************************************
     C                   SETOFF                                       50
     C     DITUR         IFNE      *ZEROS
     C     KEYTUR        CHAIN     TURER                              33
     C  N33              SETON                                        50
     C                   END
     C     HEAKEY        CHAIN     HEADF                              33
     C* OPPDRAGSGIVER
     C     KUNKEO        CHAIN     CUNDL01                            33
     C* SNUR DATOER
     C     FIDTFM        IFNE      3
     C                   MOVE      TRSDFD        XRSDFD
     C                   MOVE      TRSDTD        XRSDTD
     C                   MOVE      TRSFFD        XRSFFD            6 0
     C                   MOVE      TRSVTD        XRSVTD            6 0
     C                   CALL      'DATFM4'
     C                   PARM                    FIDTFM
     C                   PARM                    XRSDFD
     C                   PARM                    XRSDTD
     C                   PARM                    XRSFFD
     C                   PARM                    XRSVTD
     C                   END
     C*
     C*
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   SETOFF                                       88
     C                   ELSE
     C                   WRITE     HEAD0
     C                   SETOFF                                       88
     C                   END
     C*
     C   50DITUR         IFNE      GMTUR
     C                   EXSR      TURSR
     C                   END                                                    *END 50..DI.
     C*
     C                   MOVE      DITUR         GMTUR
     C                   WRITE     DET2
     C* ER OPPDRAGET INNH/UTKJ.FOR ET ANNET OPPDRAG ??
     C     TROPD0        IFNE      *ZEROS
     C     HOVKEY        CHAIN     HESTED                             71
     C     TRSLAG        IFEQ      'FF'
     C                   WRITE     DETINF                                       *INNH FOR...
     C                   ELSE
     C                   WRITE     DETUTF                                       *UTKJ FOR...
     C                   END
     C                   END
     C* HAR OPPDRAGET INNHENT.  (DUP) UNDER SEG / ORDNES AV-ER ORDNET??
     C     TROPD1        IFNE      *ZEROS
     C     INNKEY        CHAIN     HESTED                             71
     C     INNKEY        CHAIN     HEADF                              71
     C     HEPRO         COMP      *ZEROS                                 72    *IKKE PÅ BIL
     C                   WRITE     DETINA
     C                   END
     C* HAR OPPDRAGET UTKJØRING (DUP) UNDER SEG / ORDNES AV-ER ORDNET??
     C     TROPD2        IFNE      *ZEROS
     C     UTKKEY        CHAIN     HESTED                             71
     C     UTKKEY        CHAIN     HEADF                              71
     C     HEPRO         COMP      *ZEROS                                 72    *IKKE PÅ BIL
     C                   WRITE     DETUTA
     C                   END
     C* EN LINJE LUFT ETTER EVT. UNDERPOSTER PÅ OPPDRAGSNIVÅ
     C                   SETOFF                                       54
     C* SUM FAKTURALINJER
     C     UFAK          IFEQ      'J'
     C     UFAK          OREQ      'Y'
     C                   EXSR      FAKTSR
     C                   END
     C* REKVISISJONER PÅ OPPDRAGSNIVÅ.
     C     UREK          IFEQ      'J'
     C     UREK          OREQ      'Y'
     C                   EXSR      REKOSR
     C                   END
     C   54              WRITE     LUFT
     C  N50UANTB         IFNE      0
     C                   EXSR      LUFT2
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     LUFT2         BEGSR
     C***********************************************
     C*
     C     1             DO        UANTB
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   SETOFF                                       88
     C                   GOTO      UTLUFT
     C                   ELSE
     C                   WRITE     HEAD0
     C                   SETOFF                                       88
     C                   GOTO      UTLUFT
     C                   END
     C                   WRITE     LUFT
     C                   END
     C     UTLUFT        ENDSR
     C*
     C***********************************************
     C     TURSR         BEGSR
     C***********************************************
     C* PÅ EGNE BILER SKRIV SJÅFØRS NAVN - FREMMEDE TRANSPORTØRS NAVN
     C     TUBILK        IFEQ      '001'
     C                   MOVEL     TUSJN1        XXSJN1           15
     C                   ELSE
     C                   MOVEL     TUNAT         XXSJN1
     C                   END
     C                   EXSR      REISSR
     C                   EXSR      FERRSR
     C                   WRITE     DET1
     C* NULLSTILL INDIKATOR FOR  UNDERPOST PÅ TURNIVÅ FUNNET
     C                   SETOFF                                       54
     C* TILLATELSER .....
     C     UTILL         IFEQ      'J'
     C     UTILL         OREQ      'Y'
     C                   EXSR      TILLSR
     C                   END
     C* REKVISISJONER PÅ TURNIVÅ
     C     UREK          IFEQ      'J'
     C     UREK          OREQ      'Y'
     C                   EXSR      REKTSR
     C                   END
     C* EN LINJE LUFT ETTER EVT. UNDERPOSTER PÅ TURNIVÅ
     C   54              WRITE     LUFT
     C                   ENDSR
     C*
     C***********************************************
     C     REISSR        BEGSR
     C***********************************************
     C* REISEKASSE - MER ENN EN SETT '*'
     C                   MOVE      *BLANKS       XXRNBR            5
     C                   MOVE      *BLANKS       XXRVAL            3
     C                   MOVE      *ZEROS        XXRBEL            9 2
     C                   MOVE      ' '           XXRFLE            1
     C     KEYTUR        CHAIN     REIS                               33
     C  N33              MOVEL     RENBR         XXRNBR
     C  N33              MOVE      REVAL         XXRVAL
     C  N33              MOVE      REBEL         XXRBEL
     C  N33KEYTUR        READE     REIS                                   33
     C  N33              MOVE      '*'           XXRFLE            1
     C                   ENDSR
     C*
     C***********************************************
     C     FERRSR        BEGSR
     C***********************************************
     C* FERJER     - MER ENN EN SETT '*'
     C                   MOVE      *BLANKS       XXFROM            5
     C                   MOVE      *BLANKS       XXTO              5
     C                   MOVE      *BLANKS       XXFERR           10
     C                   MOVE      *BLANKS       XXLENG            3
     C                   MOVE      *ZEROS        XXDAMN            4 0
     C                   MOVE      *ZEROS        XXTIME            4 0
     C                   MOVE      ' '           XXFFLE            1
     C     KEYTUR        CHAIN     TUFE                               33
     C  N33              DO
     C     LEVKEY        CHAIN     LEVEL01                            33
     C  N33              MOVEL     LNAVN         XXFERR
     C                   MOVE      FEFROM        XXFROM
     C                   MOVE      FETO          XXTO
     C                   MOVEL     FEDAY2        XXDAMN
     C                   MOVE      FEMON2        XXDAMN
     C                   MOVE      FETIME        XXTIME
     C                   MOVE      FELENG        XXLENG
     C     KEYTUR        READE     TUFE                                   33
     C  N33              MOVE      '*'           XXFFLE
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     TILLSR        BEGSR
     C***********************************************
     C                   SETOFF                                       51        *LEDETEKST
     C     KEYTUR        CHAIN     TILL                               33
     C     *IN33         DOWNE     '1'
     C* SIDESKIFT??
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   ELSE
     C                   WRITE     HEAD0
     C                   END
     C   88              SETOFF                                       88
     C                   MOVE      TIDATE        XIDATE
     C     FIDTFM        IFNE      3
     C                   CALL      'DATFM3'
     C                   PARM                    FIDTFM
     C                   PARM                    XIDATE
     C                   END
     C                   WRITE     DETTIL
     C                   SETON                                        51        *LEDETXT SKR
     C     KEYTUR        READE     TILL                                   33
     C  N33              END
     C* MINST EN LINJE SKREVET - SETT LUFTINDIKATOR
     C   51              SETON                                        54
     C                   ENDSR
     C*
     C***********************************************
     C     REKTSR        BEGSR
     C***********************************************
     C                   SETOFF                                       51        *LEDETEKST
     C                   SETOFF                                       55         *SLETTET
     C                   MOVE      ' '           YBUST
     C     STARTA        TAG
     C     KOSB2K        CHAIN     KOSBU2                             33
     C     *IN33         DOWNE     '1'
     C     BUOPD         IFEQ      *ZEROS
     C     BUFER         ANDNE     'F'                                          *IKKE FERJE
     C* SIDESKIFT??
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   ELSE
     C                   WRITE     HEAD0
     C                   END
     C   88              SETOFF                                       88
     C                   MOVE      BUFEDT        XUFEDT
     C     FIDTFM        IFNE      3
     C                   CALL      'DATFM3'
     C                   PARM                    FIDTFM
     C                   PARM                    XUFEDT
     C                   END
     C                   WRITE     DETREK
     C                   SETON                                        51        *LEDETXT SKR
     C                   END
     C     KOSB2K        READE     KOSBU2                                 33
     C  N33              END
     C* GÅ GJENNOM ALLE STATUSER
     C     YBUST         IFEQ      ' '
     C                   MOVE      'F'           YBUST
     C                   GOTO      STARTA
     C                   END
     C     YBUST         IFEQ      'F'
     C                   MOVE      'A'           YBUST
     C                   GOTO      STARTA
     C                   END
     C     YBUST         IFEQ      'A'
     C                   MOVE      'D'           YBUST
     C                   GOTO      STARTA
     C                   END
     C     YBUST         IFEQ      'D'
     C                   MOVE      'S'           YBUST
     C                   SETON                                        55         *SLETTET
     C                   GOTO      STARTA
     C                   END
     C* MINST EN LINJE SKREVET - SETT LUFTINDIKATOR
     C   51              SETON                                        54
     C                   ENDSR
     C*
     C***********************************************
     C     REKOSR        BEGSR
     C***********************************************
     C                   SETOFF                                       51        *LEDETEKST
     C                   SETOFF                                       55         *SLETTET
     C                   MOVE      ' '           YBUST
     C     STARTB        TAG
     C     KOSB9K        CHAIN     KOSBU9                             33
     C     *IN33         DOWNE     '1'
     C* SIDESKIFT??
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   ELSE
     C                   WRITE     HEAD0
     C                   END
     C   88              SETOFF                                       88
     C     BUST          IFEQ      'D'
     C     DSAVD         IFGE      '0000'
     C     DSAVD         ANDLE     '9999'
     C                   MOVE      DSAVD         FAAVD
     C                   ELSE
     C                   MOVE      *ZEROS        FAAVD
     C                   END
     C     DSOPD         IFGE      '0000000'
     C     DSOPD         ANDLE     '9999999'
     C                   MOVE      DSOPD         FAOPD
     C                   ELSE
     C                   MOVE      *ZEROS        FAOPD
     C                   END
     C                   MOVE      'T'           BUBLST
     C                   MOVE      *ZEROS        BUBL
     C     DUPKEY        SETLL     FAK2
     C     DUPKEY        READE     FAK2                                   34
     C     *IN33         DOWNE     '1'
     C     FAKDA         IFNE      'K'
     C     FAKDA         ANDNE     'D'
     C                   ADD       FABELN        BUBL
     C                   END
     C     DUPKEY        READE     FAK2                                   34
     C  N34              END
     C                   END
     C                   MOVE      BUFEDT        XUFEDT
     C     FIDTFM        IFNE      3
     C                   CALL      'DATFM3'
     C                   PARM                    FIDTFM
     C                   PARM                    XUFEDT
     C                   END
     C                   WRITE     DETREK
     C                   SETON                                        51        *LEDETXT SKR
     C     KOSB9K        READE     KOSBU9                                 33
     C  N33              END
     C* GÅ GJENNOM ALLE STATUSER
     C     YBUST         IFEQ      ' '
     C                   MOVE      'F'           YBUST
     C                   GOTO      STARTB
     C                   END
     C     YBUST         IFEQ      'F'
     C                   MOVE      'A'           YBUST
     C                   GOTO      STARTB
     C                   END
     C     YBUST         IFEQ      'A'
     C                   MOVE      'D'           YBUST
     C                   GOTO      STARTB
     C                   END
     C     YBUST         IFEQ      'D'
     C                   MOVE      'S'           YBUST
     C                   SETON                                        55         *SLETTET
     C                   GOTO      STARTB
     C                   END
     C* MINST EN LINJE SKREVET - SETT LUFTINDIKATOR
     C   51              SETON                                        54
     C                   ENDSR
     C***********************************************
     C     FAKTSR        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        FABL              9 2
     C     HEAKEY        SETLL     FAK2
     C     HEAKEY        READE     FAK2                                   34
     C     *IN33         DOWNE     '1'
     C     FAKDA         IFNE      'K'
     C     FAKDA         ANDNE     'D'
     C                   ADD       FABELN        FABL
     C                   END
     C     HEAKEY        READE     FAK2                                   34
     C  N34              END
     C* UTSKRIFT KUN DERSOM ULIK NULL
     C     FABL          IFNE      *ZEROS
     C* SIDESKIFT??
     C   88UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   ELSE
     C                   WRITE     HEAD0
     C                   END
     C   88              SETOFF                                       88
     C                   WRITE     DETFAK
     C* MINST EN LINJE SKREVET - SETT LUFTINDIKATOR
     C                   SETON                                        54
     C                   END
     C                   ENDSR
     C*****************************************************************
     C     INIT          BEGSR
     C*****************************************************************
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UUAVD             4
     C                   PARM                    UDAT1             6
     C                   PARM                    UDAT2             6
     C                   PARM                    UTYPE             1
     C                   PARM                    UHEAD             1
     C                   PARM                    USORT             1
     C                   PARM                    UFAK              1
     C                   PARM                    UREK              1
     C                   PARM                    UTILL             1
     C                   PARM                    UANT              3 0
     C                   PARM                    UUANTB            1
     C* FLYTT PARAM INN I NUMERISKE FELT
     C                   MOVE      UUAVD         UAVD              4 0
     C                   MOVE      UDAT1         UDATO1            6 0
     C                   MOVE      UDAT2         UDATO2            6 0
     C                   MOVE      UUANTB        UANTB             1 0
     C* SETT INDIKATOR FOR SORTERINGSFIL
     C     USORT         COMP      '1'                                    60
     C     USORT         COMP      '2'                                    61
     C     USORT         COMP      '3'                                    62
     C     USORT         COMP      '4'                                    63
     C     USORT         IFLT      '1'
     C     USORT         ORGT      '4'
     C                   SETON                                            60
     C                   END
     C* BARE UDISPONERTE (INDIKATOR FOR HEADING)
     C     UTYPE         COMP      'U'                                    52
     C     DISKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UDAT11
     C     HEAKEY        KLIST
     C                   KFLD                    DIAVD
     C                   KFLD                    DIOPD
     C     KUNKEO        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    TRKNFA
     C     LEVKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    FEFIRM                         (FERJESELSK.)
     C     KEYTUR        KLIST
     C                   KFLD                    DITUAV
     C                   KFLD                    DITUR
     C     HODEK         KLIST
     C                   KFLD                    YNET
     C                   KFLD                    TUAVD
     C     KOSB9K        KLIST
     C                   KFLD                    YBUST
     C                   KFLD                    DIAVD
     C                   KFLD                    DIOPD
     C     KOSB2K        KLIST
     C                   KFLD                    YBUST
     C                   KFLD                    DITUR
     C*
     C     DUPKEY        KLIST
     C                   KFLD                    FAAVD
     C                   KFLD                    FAOPD
     C* ER OPPDRAGET BARN AV./ MODER FOR ??
     C     HOVKEY        KLIST
     C                   KFLD                    TRAVD0
     C                   KFLD                    TROPD0
     C     INNKEY        KLIST
     C                   KFLD                    TRAVD1
     C                   KFLD                    TROPD1
     C     UTKKEY        KLIST
     C                   KFLD                    TRAVD2
     C                   KFLD                    TROPD2
     C*
     C                   MOVE      ' '           YBUST             1
     C                   MOVE      ' '           YNET              1
     C                   MOVE      'K'           KODEKO            1
     C                   MOVE      'Y'           STAT              1
     C                   MOVE      *ZEROS        KEDATO            6 0
     C                   Z-ADD     99999999      GMTUR             8 0
     C*
     C     UAVD          COMP      *ZEROS                                 66
     C   66              Z-ADD     1             UAVD
     C*
     C     UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C     HODEK         CHAIN     HODE                               33
     C                   END
     C                   READ      FIRM                                   33
     C*
     C     FIDTFM        IFNE      3
     C                   CALL      'DATFM5'
     C                   PARM                    FIDTFM
     C                   PARM                    UDATO1
     C                   CALL      'DATFM5'
     C                   PARM                    FIDTFM
     C                   PARM                    UDATO2
     C                   END
     C     UDATO1        IFEQ      0
     C                   MOVE      *ZEROS        UDAT11            8 0
     C                   ELSE
     C     UDATO1        IFGT      501231
     C     UDATO1        ADD       19000000      UDAT11
     C                   ELSE
     C     UDATO1        ADD       20000000      UDAT11
     C                   END
     C                   END
     C     UDATO2        IFEQ      0
     C                   MOVE      *ZEROS        UDAT21            8 0
     C                   ELSE
     C     UDATO2        IFGT      501231
     C     UDATO2        ADD       19000000      UDAT21
     C                   ELSE
     C     UDATO2        ADD       20000000      UDAT21
     C                   END
     C                   END
     C*
     C     UHEAD         IFEQ      'J'
     C     UHEAD         OREQ      'Y'
     C                   WRITE     HEADP
     C                   ELSE
     C                   WRITE     HEAD0
     C                   END
     C*
     C                   ENDSR
