      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE FERJEPRISAVTALER             ***
      **************************************************************
      *
     FTRAB      UF A E           K DISK
     FTRAN      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSYTR05FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  TBGEB                  1      3
     D  XDLT                   1      3
     D                 DS
     D  TBDATE                 1      8  0
     D  TBYEAR                 1      4  0
     D  TBMONT                 5      6  0
     D  TBDAY                  7      8  0
     D                 DS
     D  WBDATE                 1      6  0
     D  WBDAY                  1      2  0
     D  WBMONT                 3      4  0
     D  WBYEAR                 5      6  0
     D                 DS
     D  WSDATE                 1      6  0
     D  WSDAY                  1      2  0
     D  WSMONT                 3      4  0
     D  WSYEAR                 5      6  0
     C*
     C     STINI         TAG
     C                   EXSR      INIT
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSI1        SETLL     TRAB
     C     START1        TAG
     C     WSFIRM        READE(N)  TRAB                                   94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C                   MOVE      TBYEAR        WBYEAR
     C                   MOVE      TBMONT        WBMONT
     C                   MOVE      TBDAY         WBDAY
     C                   WRITE     SUBFIL
     C     WSFIRM        READE(N)  TRAB                                   94
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     4             POSNBR
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      STINI
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     05            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94WSFIRM        READPE(N) TRAB                                   94
     C  N94WSFIRM        READE(N)  TRAB                                   94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     04            POSNBR
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C     WSLIN         COMP      *ZEROS                                 90
     C  N90WSDATE        COMP      *ZEROS                                 90
     C   90              MOVE      'JOV0127'     MSGNR
     C  N90
     CANN40KODSIK        CHAIN(N)  TRAB                               33
     C  N90
     CANN33
     CANN40              DO
     C                   SETON                                        90
     C                   MOVE      'SPF0109'     MSGNR
     C                   END
     C   90              SETON                                        30
     C   90              Z-ADD     5             POSNBR
     C   90
     CAN 40              Z-ADD     12            POSNBR
     C*                    END
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSIK        CHAIN     TRAB                               33
     C                   EXSR      MOVWSI
     C  N33              UPDATE    TRABR
     C   33              WRITE     TRABR
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      'DEL'                                  98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSI
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      'DEL'                                  98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSI
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSI         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      TBLIN         WSLIN
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSIK        CHAIN     TRAB                               33
     C  N33              DELETE    TRABR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSI         BEGSR
     C***********************************************
     C                   EXSR      MOVSIW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        TBAVD
     C                   MOVE      *BLANKS       TBGEB
     C                   MOVE      *ZEROS        TBPRO
     C                   MOVE      *ZEROS        TBDATE
     C                   MOVE      *ZEROS        WBDATE
     C                   MOVE      *ZEROS        TBLIN
     C                   MOVE      *BLANKS       TBTKAT
     C                   MOVE      *BLANKS       TBUNIT
     C                   MOVE      *BLANKS       TBLK
     C                   MOVE      *BLANKS       TBOPTY
     C*
     C                   MOVEL     'DEL'         XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSAVD
     C                   MOVE      *BLANKS       WSGEB
     C                   MOVE      *ZEROS        WSPRO
     C                   MOVE      *ZEROS        WSDATE
     C                   MOVE      *ZEROS        WSLIN
     C   39              MOVE      *BLANKS       WSTKAT                         *GENERELL
     C  N39              MOVE      VMTKAT        WSTKAT                         EN TRANSP
     C                   MOVE      *BLANKS       WSUNIT
     C                   MOVE      *BLANKS       WSLK
     C                   MOVE      *BLANKS       WSOPTY
     C                   MOVE      *ZEROS        WSVKTT
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSIW        BEGSR
     C***********************************************
     C                   MOVE      TBAVD         WSAVD
     C                   MOVE      TBGEB         WSGEB
     C                   MOVE      TBPRO         WSPRO
     C                   MOVE      TBYEAR        WSYEAR
     C                   MOVE      TBMONT        WSMONT
     C                   MOVE      TBDAY         WSDAY
     C                   MOVE      TBLIN         WSLIN
     C   39              MOVE      TBTKAT        WSTKAT
     C  N39              MOVE      VMTKAT        WSTKAT                         *EN TRANSP
     C                   MOVE      TBUNIT        WSUNIT
     C                   MOVE      TBLK          WSLK
     C                   MOVE      TBOPTY        WSOPTY
     C                   MOVE      TBVKTT        WSVKTT
     C*
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C   39              Z-ADD     12            POSNBR
     C  N39              Z-ADD     16            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSI        BEGSR
     C***********************************************
     C* FIX KEY IF NOT FOUND
     C   33              DO
     C                   MOVE      WSLIN         TBLIN
     C                   END
     C*
     C* FIXES VARIABLES
     C                   MOVE      WSAVD         TBAVD
     C                   MOVE      WSGEB         TBGEB
     C     WSYEAR        IFGT      50
     C     WSYEAR        ADD       1900          TBYEAR
     C                   ELSE
     C     WSYEAR        ADD       2000          TBYEAR
     C                   END
     C                   MOVE      WSMONT        TBMONT
     C                   MOVE      WSDAY         TBDAY
     C                   MOVE      WSTKAT        TBTKAT
     C                   MOVE      WSUNIT        TBUNIT
     C                   MOVE      WSLK          TBLK
     C                   MOVE      WSOPTY        TBOPTY
     C                   MOVE      WSVKTT        TBVKTT
     C                   MOVE      WSPRO         TBPRO
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODSIK        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSLIN
     C     KODSI1        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    W2LIN
     C     LEVEK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFIRM
     C                   READ      FIRM                                   33
     C                   MOVE      *ZEROS        WSDATE
     C                   MOVE      *ZEROS        TBDATE
     C                   MOVE      *ZEROS        WBDATE
     C*
     C     STI           TAG
     C                   EXFMT     BILDE1
     C   04              DO
     C                   CALL      'SYTR04A'
     C                   PARM                    UTRAN             8 0
     C                   MOVE      UTRAN         WSFIRM
     C                   END
     C   03              GOTO      UTI
     C  N06LEVEK         CHAIN     TRAN                               44
     C   44
     CANN06              MOVE      'SPT0105'     MSGNR
     C   44
     CANN06              GOTO      STI
     C                   MOVE      WSFIRM        TBFIRM
     C  N06              MOVE      VMNAVN        WSNAVN
     C   06              MOVE      *BLANKS       WSNAVN
     C   06              MOVEL     'GENERELL'    WSNAVN
     C  N06              SETOFF                                           39
     C   06              SETON                                            39
     C*
     C     UTI           ENDSR
     C*
