      *
      **************************************************************
      *** PROGRAM SOM setter transportør på headf               ***
      **************************************************************
      *
     Fturer14   IF   E           K DISK
     Ftran      IF   E           K DISK
     Ffirm      IF   E           K DISK
     Fhead11    UF   E           K DISK
      *
     C     *entry        plist
     C                   parm                    upro              8
     C                   move      upro          tupro
      *
     C     trakey        klist
     C                   kfld                    fifirm
     C                   kfld                    tuknt2
     c                   read      firm                                   33
     C     tukey         klist
     C                   kfld                    tupro
      *
     C     tupro         ifeq      *zeros
     C                   exsr      alle
     c                   else
     C     TUKEY         CHAIN     TURER14                            33
     C  N33TUKNT2        IFNE      *ZEROS
     c     trakey        chain     tran                               35
     c  n35vmtrku        ifne      *zeros
     c                   exsr      en
     c                   end
     c                   end
     c                   end
     c                   seton                                        lr
     c                   return
     c*******************************************************************
     c     alle          begsr
     c*******************************************************************
     c     *in33         doweq     '0'
     c                   read      turer14                                33
     c     *in33         ifeq      '0'
     C     TUKNT2        ANDNE     0
     c     trakey        chain     tran                               35
     c  n35vmtrku        ifne      *zeros
     c                   exsr      en
     c                   end
     c                   end
     c                   end
     c                   endsr
     c*******************************************************************
     c     en            begsr
     c*******************************************************************
     C                   SETOFF                                       34
     C     TUKEY         SETLL     HEAD11
     C     *IN34         DOWEQ     '0'
     C     TUKEY         READE     HEAD11                                 34
      *
      * OPPDATERER NÅR TRANSPORTØR FINNES OG DET ER UR=H  TRANSPORTDISPONERING
      *
     C     *IN34         IFEQ      '0'
     C     HEUR          ANDEQ     'H'
     C     TUKNT2        ANDNE     0
      *
      * SETTER TRANSPORTØR VED STATUS A OG B
      *
     C     TUST          IFEQ      'B'
     C     TUST          OREQ      'C'
     C                   MOVE      VMTRKU        HEKNT
     C                   UPDATE    HEADFR
     C                   END
      *
      * SETTER TRANSPORTØR=0  VED STATUS D = SLETTET
      *
     C     TUST          IFEQ      'D'
     C                   MOVE      *ZEROS        HEKNT
     C                   UPDATE    HEADFR
     C                   END
     C                   END
     C                   END
     C                   ENDSR
