     FHEADF     IF   E           K DISK
     FFRISOK    IF   E           K DISK
     FBRIDF     IF   E           K DISK
     FBRPARF    IF   E           K DISK
     FFIRM      IF   E           K DISK
     FFIRMARC   IF   E           K DISK
     FARKSRC160 O    E             DISK    RENAME(ARKSRC160:ARCDAT)
     FSYTR33WM  CF   E             WORKSTN
      *____
      * Inz
      *""""
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   EXFMT     BILDE
      *
     C                   IF        *IN12
     C                   MOVE      'N'           UOK
     C                   GOTO      SLUTT
     C                   END
     C     *IN05         CABEQ     *OFF          START
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C                   EVAL      UAVSNA = FIFT
     C     FIFIRM        CHAIN     FIRMARC                            33
      *
     C                   MOVE      *ZEROS        SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = WSTXT1
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = *BLANKS
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = WSTXT2
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = *BLANKS
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = WSTXT3
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
     C                   EVAL      SRCDTA = *BLANKS
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
      *
     C                   EVAL      SRCDTA = 'http://'
     C                             + %TRIM(ARCPAE)
     C                             + '/sycgip/syso02.pgm'
     C                             + '?user=NN'
     C                             + '&UsrSpcName=InT5WXz4BJ'
     C                             + '&heavd=' + %TRIM(UAVD)
     C                             + '&heOPd=' + %TRIM(UOPD)
     C                   ADD       1             SRCSEQ
     C                   WRITE     ARCDAT
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      *_____________________________________________________
      * INIT
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     INIT          BEGSR
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4
     C                   PARM                    UOPD              7
     C                   PARM                    UAVSNA           30
     C                   PARM                    WSAVSEP
     C                   PARM                    WSEP01
     C                   PARM                    WSEP02
     C                   PARM                    WSEP03
     C                   PARM                    WSEP04
     C                   PARM                    WSEP05
     C                   PARM                    WSEMNE
     C                   PARM                    UOK
     C                   MOVE      'J'           UOK               1
      *
     C     HEADFK        KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C     FRISOKK       KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
     C                   MOVE      'WUI'         FSKODE
     C     BRPARFK       KLIST
     C                   KFLD                    BIBRID
     C                   KFLD                    PAKUNR
     C                   KFLD                    PAID
      *
     C                   MOVE      UAVD          FSAVD
     C                   MOVE      UOPD          FSOPD
     C     FRISOKK       CHAIN     FRISOK                             33
     C                   IF        *IN33 = *OFF
     C                   EVAL      BIBRID = FSSOK
     C     BIBRID        CHAIN     BRIDF                              33
     C  N33HEADFK        CHAIN     HEADF                              33
     C  N33HEKNA         IFNE      BIKUNR
     C     TRKNFA        ANDNE     BIKUNR
     C     HEKNS         ANDNE     BIKUNR
     C     HEKNSF        ANDNE     BIKUNR
     C     HEKNK         ANDNE     BIKUNR
     C     HEKNKF        ANDNE     BIKUNR
     C                   MOVE      *ON           *IN33
     C                   END
     C                   END
      *
     C                   IF        *IN33 = *OFF
     C                   MOVE      *BLANKS       WSAVSEP
     C                   MOVE      *BLANKS       WSEP01
     C                   MOVE      *BLANKS       WSEP02
     C                   MOVE      *BLANKS       WSEP03
     C                   MOVE      *BLANKS       WSEP04
     C                   MOVE      *BLANKS       WSEP05
     C                   MOVE      *BLANKS       WSTXT1
     C                   MOVE      *BLANKS       WSTXT2
     C                   MOVE      *BLANKS       WSTXT3
      *
     C                   MOVE      'HEUMA'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C  N33              EVAL      WSAVSEP = PAVRDA
      *
     C                   MOVE      'HEUMT'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C  N33              EVAL      WSEP01 = PAVRDA
     C  N33BRPARFK       READE     BRPARF                                 33
     C  N33              EVAL      WSEP02 = PAVRDA
     C  N33BRPARFK       READE     BRPARF                                 33
     C  N33              EVAL      WSEP03 = PAVRDA
     C  N33BRPARFK       READE     BRPARF                                 33
     C  N33              EVAL      WSEP04 = PAVRDA
     C  N33BRPARFK       READE     BRPARF                                 33
     C  N33              EVAL      WSEP05 = PAVRDA
      *
     C                   EVAL      WSEMNE = 'Order '
     C*                            + %TRIM(UAVD) + '/'
     C*                            + %TRIM(UOPD)
     C                             + %TRIM(HERFA)
     C                             + ' is changed. '
     C*                            + 'Please check it by click link.'
      *
     C                   ELSE
     C                   SETON                                        LR
     C                   RETURN
      *
     C                   END
      *
     C                   WRITE     WIND01
      *
     C                   ENDSR
      *
