      *
      ***************************************************************
      *** PROGRAM SKAL FINNE/OPDATERE I UNITREGISTER SIST UTFØRTE TUR
      ***************************************************************
      *
     FUNITL01   UF   E           K DISK
     FTURER2    IF   E           K DISK
     FTURER15   IF   E           K DISK
     F                                     RENAME(TURERR:TUR15R)
     C     *ENTRY        PLIST
     C                   PARM                    UBILNR           10
     C                   PARM                    UBILHE            1
     C*
     C     TURKEY        KLIST
     C                   KFLD                    UBILNR
     C                   KFLD                    YYDATO            8 0
     C                   Z-ADD     99999999      YYDATO
     C*
     C*  EN SKAL FINNE SISTE/NEST SISTE TUR FOR BILEN(TREKKVOGN)
     C     UBILHE        IFEQ      'B'
     C     UBILHE        OREQ      'C'
     C     TURKEY        SETLL     TURER2
     C     UBILNR        READPE    TURER2                                 33
     C  N33UBILHE        IFEQ      'C'                                           *NEST SISTE
     C     UBILNR        READPE    TURER2                                 33
     C                   END
     C                   ELSE
     C*  EN SKAL FINNE SISTE/NEST SISTE TUR FOR HENGEREN
     C     TURKEY        SETLL     TURER15
     C     UBILNR        READPE    TURER15                                33
     C  N33UBILHE        IFEQ      'I'                                           *NEST SISTE
     C     UBILNR        READPE    TURER15                                33
     C                   END
     C                   END
     C* OPPDATER SIST UTFØRTE TUR I UNITREGISTERET
     C* MEN IKKE HVIS DET ER NEST SISTE..............
     C     UBILHE        IFEQ      'B'
     C     UBILHE        OREQ      'H'
     C     UBILNR        CHAIN     UNITL01                            34
     C  N34
     CAN 33              MOVE      *ZEROS        UNRUND
     C  N34
     CAN 33              MOVE      *ZEROS        UNSAVD
     C  N34
     CAN 33              MOVE      *ZEROS        UNSPRO
     C  N34
     CANN33              MOVE      TURUND        UNRUND
     C  N34
     CANN33              MOVE      TUAVD         UNSAVD
     C  N34
     CANN33              MOVE      TUPRO         UNSPRO
     C  N34              UPDATE    UNITR
     C                   ELSE
     C* RETURNER TURNR VIA PARAMETEREN UBILNR
     C  N34
     CANN33              MOVE      TUPRO         UBILNR
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
