      *
      **************************************************************
      *** PROGRAM FOR
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97       ***
      **************************************************************
      *
     FFEDE      UF A E           K DISK
     FLEVEL01   IF   E           K DISK
     FFIRM      IF   E           K DISK
     FSTED2     IF   E           K DISK
     FSYTR02FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  FEFROM                 1      5
     D  XDLT                   1      5
     C*
     C     TAGB1         TAG
     C                   EXSR      INIT
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2FROM        YSFROM
     C                   MOVE      W2TO          YSTO
     C                   MOVE      W2TIME        YSTIME
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KODSI1        SETLL     FEDE
     C     START1        TAG
     C     WSFIRM        READE(N)  FEDE                                   94
     C  N94              MOVE      WSFROM        YSFROM
     C  N94              MOVE      WSTO          YSTO
     C  N94              MOVE      WSTIME        YSTIME
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        7
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     WSFIRM        READE(N)  FEDE                                   94
     C  N94              MOVE      WSFROM        YSFROM
     C  N94              MOVE      WSTO          YSTO
     C  N94              MOVE      WSTIME        YSTIME
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     4             POSNBR
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      TAGB1
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     04            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94KODSI3        SETLL     FEDE
     C  N94WSFIRM        READE(N)  FEDE                                   94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              EXSR      MOVB2
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     04            POSNBR
     C                   EXFMT     VAREL2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C   12              GOTO      START3
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C  N40              DO
     C* TEST FROM PLACE
     C     WSFROM        CHAIN     STED2                              70
     C   70              MOVE      'SPS0012'     MSGNR
     C   70              SETON                                        30
     C   30              GOTO      SLTB
     C* TEST TO PLACE
     C     WSTO          CHAIN     STED2                              71
     C   71              MOVE      'SPS0013'     MSGNR
     C   71              SETON                                        30
     C   71              Z-ADD     10            POSNBR
     C   30              GOTO      SLTB
     C*
     C  N90WSTIME        COMP      *ZEROS                                 90
     C   90              MOVE      'SPT0103'     MSGNR
     C  N90KODSIK        CHAIN     FEDE                               33
     C  N90
     CANN33              DO
     C                   UPDATE    FEDER
     C                   SETON                                        90
     C                   MOVE      'SPF0108'     MSGNR
     C                   END
     C   90              Z-ADD     21            POSNBR
     C   90              SETON                                        30
     C                   END
     C*
     C   30              GOTO      SLTB
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSIK        CHAIN     FEDE                               33
     C                   EXSR      MOVWSI
     C  N33              UPDATE    FEDER
     C   33              WRITE     FEDER
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSI
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTSI
     C   12              GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSI         BEGSR
     C***********************************************
     C                   SETON                                        99
     C                   MOVE      FEFROM        WSFROM
     C                   MOVE      FETO          WSTO
     C                   MOVE      FETIME        WSTIME
     C                   MOVE      FETXT         WSTXT
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSIK        CHAIN     FEDE                               33
     C  N33              DELETE    FEDER
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSI         BEGSR
     C***********************************************
     C                   EXSR      MOVSIW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   SETOFF                                       309089
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       FEFROM
     C                   MOVE      *BLANKS       FETO
     C                   MOVE      *ZEROS        FETIME
     C                   MOVE      *BLANKS       FETXT
     C*
     C                   MOVEL     '*DEL*'       XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *BLANKS       WSFROM
     C                   MOVE      *BLANKS       WSTO
     C                   MOVE      *ZEROS        WSTIME
     C                   MOVE      *BLANKS       WSTXT
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSIW        BEGSR
     C***********************************************
     C                   MOVE      FEFROM        WSFROM
     C                   MOVE      FETO          WSTO
     C                   MOVE      FETIME        WSTIME
     C                   MOVE      FETXT         WSTXT
     C*
     C                   SETON                                        40
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     31            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSI        BEGSR
     C***********************************************
     C* FIX KEY IF NOT FOUND
     C   33              DO
     C                   MOVE      WSFROM        FEFROM
     C                   MOVE      WSTO          FETO
     C                   MOVE      WSTIME        FETIME
     C                   END
     C*
     C* FIXES VARIABLES
     C                   MOVE      WSTXT         FETXT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *LIKE         DEFINE    FEFROM        YSFROM
     C     *LIKE         DEFINE    FETO          YSTO
     C     *LIKE         DEFINE    FETIME        YSTIME
     C     KODSIK        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSFROM
     C                   KFLD                    WSTO
     C                   KFLD                    WSTIME
     C     KODSI1        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    W2FROM
     C                   KFLD                    W2TO
     C                   KFLD                    W2TIME
     C     KODSI3        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    YSFROM
     C                   KFLD                    YSTO
     C                   KFLD                    YSTIME
     C*
     C     LEVEK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFIRM
     C                   READ      FIRM                                   33
     C*
     C     STI           TAG
     C                   EXFMT     BILDE1
     C   03              GOTO      UTI
     C   04              DO
     C                   MOVE      *BLANKS       UUSNAV           30
     C                   CALL      'SO1LEV'
     C                   PARM                    WSFIRM
     C                   PARM                    FIFIRM
     C                   PARM                    UUSNAV
     C                   GOTO      STI
     C                   END
     C     LEVEK         CHAIN     LEVEL01                            44
     C   44              MOVE      'SPM0007'     MSGNR
     C   44              GOTO      STI
     C                   MOVE      WSFIRM        FEFIRM
     C                   MOVE      LNAVN         WSNAVN
     C*
     C     UTI           ENDSR
     C*
