********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 behold kopitekst variabel ved flere
********************************************************************
      *
      ************************************************************
P10226*** Eget bestillingsprof for KOPI    (KREDITNOTA)        ***
      *** (UTGANGSPKT I GML SYTR23A MED MINIMUM ENDRING for å   **
      ***  takle fra til)                                       **
      ************************************************************
      *
     FFIRM      IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTW     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FTRAVH6    IF   E           K DISK
     FTRAVV6    IF   E           K DISK
     FSYTR23AKD CF   E             WORKSTN
      *
     C                   EXSR      INIT
      *
     C     WSVAVD        IFGT      0
     C                   GOTO      START2
     C                   ELSE
     C                   SETON                                        50        IKKE VIS NEDRE DEL.
     C                   END
     C*
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C     START2        TAG
     C                   SETOFF                                       309899
     C                   SETOFF                                       97
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C   12              MOVE      '1'           UIN01
     C   12              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C  N99KODTWK        CHAIN     KODTW                              99
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        3050
     C   99              GOTO      START
     C*
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        3050
     C   98              GOTO      START
     C*
     C* HENTER STANDARD PRINTERSTYRING - FAKTURA
     C*
     c     FØRSTE        ifeq      'J'
     C                   Z-ADD     102           PRTNR             3 0
     C                   CALL      'SYGE01'
     C                   PARM                    WSVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C*
     C                   SETOFF                                       50         VIS NEDRE DEL
     C*
     C     STA11         TAG
     C                   EXFMT     BILDE01
     C* NY AVD??
     C   12              DO
     C                   SETON                                        50
     C                   MOVE      *BLANKS       WSPRT
     C                   MOVE      *BLANKS       WSFORM
     C                   MOVE      *BLANKS       WSHEAD
     C                   GOTO      START
     C                   END
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C*
     C*
     C                   EXSR      TESTB1
     C   30              GOTO      STA11
     c                   else
     c                   exsr      FINNTRAN
     c                   endif
     C*
     C     SLUTT         TAG
     C                   MOVE      WSVAVD        UUVAVD                          *ALPHA
     C     WSJOBQ        IFEQ      'Y'
     C     WSJOBQ        OREQ      'J'
     C                   MOVE      'SPU0010'     UMSGNR            7
     C                   ELSE
     C                   MOVE      'SPU0011'     UMSGNR
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*
     C                   MOVEA     '0'           *IN(30)
     C                   MOVEA     '00000000'    *IN(70)
      *
     c                   exsr      FINNTRAN
     c     *in72         ifeq      *off
     c     WSFAKTT       IFEQ      *zeros
     c                   move      WSFAKT        WSFAKTT
     c                   ENDIF
     c     WSFAKTT       sub       WSFAKT        AntBest           7 0
     C     AntBest       COMP      500                                72
     c                   endif
     C   72              DO
     C                   MOVE      'JOV1600'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     FINNTRAN      BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        UTNR              8 0
     C     WSFAKT        COMP      *ZEROS                                 72
     C     *IN72         IFEQ      *OFF
     C     WSFAKT        CHAIN     TRAVH6                             72
     c  N72THST          ifne      'F'
     c     THST          andne     'O'
     c                   seton                                        72
     c                   endif
     C  N72              MOVE      THTNR         UTNR              8 0
      * FANT INGEN HOVED-POSTER.. - SJEKKE I GODSKR. UTENOM TUR..
     C     *IN72         IFEQ      *ON
     C     WSFAKT        CHAIN     TRAVV6                             72
     c  N72TVST          ifne      'F'
     c     TVST          andne     'O'
     c                   seton                                        72
     c                   endif
     C  N72              MOVE      TVTUNR        UTNR              8 0
     C                   END
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1            *AVBRUDD (=1)
     C                   PARM                    UUVAVD            4            *ALPHA
     C                   PARM                    WSSFSI                         *SIGN
     C                   PARM                    WSPRT                          *PRINTER/UTKØ
     C                   PARM                    WSFORM                         *BLANKETT
     C                   PARM                    KOWHOD                         *HODE-FAKTURA
     C                   PARM                    WSVEDL                         *OGSÅ VEDLEGG
     C                   PARM                    WSJOBQ                         *JOBKØ
     C                   PARM                    UMSGNR                         *MELDING FRA FOREG.
     C                   PARM                    UTNR                           *TRANSP
     C                   PARM                    WSPERÅ            2 0          *PERIODEÅR
     C                   PARM                    WSPERM            2 0          *PERIODEMND
     C* SEPARAT GIRO
     C                   PARM                    WSALFA                         *ALFASORT
     C                   PARM                    WSFAKT                         *BIL.NR KOPI
     C                   PARM                    WSFAKTT                        *BIL.NR KOPI
      *
      * 51 ON = KOPIKJØRING
      *
     C     WSFAKT        COMP      *ZEROS                             5151
N01  C   51WSFAKT        IFEQ      9999999
S01  C*  51              MOVE      'J'           WSALFA                         SKRIV *KOPI*
N01  C                   MOVE      'J'           WSALFA                         SKRIV *KOPI*
N01  C                   END
     C   51WSFAKT        IFEQ      9999999                                      1. GANG
     c                   move      'J'           FØRSTE            1
     C                   MOVE      *ZEROS        WSFAKT
     C                   ENDIF
     C     KODSFK        KLIST
     C                   KFLD                    WSSFUN
     C                   KFLD                    WSSFSI
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSVAVD
     C     KODTWK        KLIST
     C                   KFLD                    WSWUNI
     C                   KFLD                    WSVAVD
     C*
     C     UUVAVD        IFGT      '0000'
     C     UUVAVD        ANDLE     '9999'
     C                   MOVE      UUVAVD        WSVAVD                         *NUMERIC
     C                   ELSE
     C                   MOVE      *ZEROS        WSVAVD
     C                   END
     C                   MOVE      '0'           UIN01
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'W'           WSWUNI            1
     C                   READ      FIRM                                   33
     C*
     C     UTI           ENDSR
     C*
     C*
