      *
      **************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE TRANSPORTØRER                ***
      *** FUNKSJON FOR SØKING ER OGSÅ LAGT INN                   ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER       ***
      *** LEDIGE INDIKATORER 01 02 04 07 09-11 13-24             ***
      *** LEDIGE INDIKATORER 27-29 31 32 34-39 41-88 95-97       ***
      **************************************************************
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 JOV PTF11 F14 = flere parameter ..
********************************************************************
      *
     FTRAN      UF A E           K DISK
     FTRANL01   IF   E           K DISK
     F                                     RENAME(TRANR:TRANR2)
     FLEVEL01   IF   E           K DISK
     FUNIT      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FFIRTR     IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FSYTR04FM  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  VMNAVN                 1     30
     D  XDLT                   1      5
     D                 DS
     D  VMSTDA                 1      8  0
     D  VMSTDD                 1      4  0
     D  VMSTDM                 5      6  0
     D  VMSTDÅ                 7      8  0
     D                 DS
     D  WSSTDA                 1      6  0
     D  WSSTDD                 1      2  0
     D  WSSTDM                 3      4  0
     D  WSSTDÅ                 5      6  0
     D                 DS
     D  XTIME                  1     14  0
     D  XTID                   1      6  0
     D  XDD                    7      8  0
     D  XMM                    9     10  0
     D  XÅÅ                   11     14  0
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C                   EXSR      INIT
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2TRAN        YSTRAN
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C  N51KODSI1        SETLL     TRAN
     C   51ALFKEY        SETLL     TRANL01
     C                   Clear                   W2TRAN
     C                   Clear                   WSALFA
     C     START1        TAG
     C  N51WSFIRM        READE(N)  TRAN                                   94
     C   51              READ      TRANL01                                94
     C  N51
     CANN94              MOVE      WSTRAN        YSTRAN
     C  N94              MOVEL     VM0004        WW0004
     C  N94              MOVEL     VM0010        WW0010
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        14
     C                   ADD       1             ZRECNO
     C     VMSTOP        COMP      'J'                                    55     *RED
     C     VMSTOP        COMP      'N'                                    56     *WHT
     C                   WRITE     SUBFIL
     C  N51WSFIRM        READE(N)  TRAN                                   94
     C   51              READ      TRANL01                                94
     C  N94
     CANN51              MOVE      WSTRAN        YSTRAN
     C  N94              MOVEL     VM0004        WW0004
     C  N94              MOVEL     VM0010        WW0010
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     4             POSNBR
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     SUBCTL
     C                   EXFMT     BUNN
     C                   END
     C*
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
     C***
     C*
     C                   SETOFF                                       9899
     C*
     C*** AVSLUTT
     C   03              GOTO      SLUTT
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** LAGE NY
     C   06              DO
     C                   Z-ADD     3             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   EXSR      MOVB2
     C                   GOTO      START5
     C                   END
     C*** SØK FRA
     C   08              GOTO      START6
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94
     CANN51              MOVE      VMTRAN        YSTRAN
     C  N94
     CANN51KODSI3        SETLL     TRAN
     C  N94
     CANN51WSFIRM        READE(N)  TRAN                                   94
     C                   GOTO      START2
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C   50UTRANS        IFNE      *ZEROS
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C   98XRECNO        IFNE      0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END
     C                   GOTO      START3
     C*
     C*** LAGE NY
     C     START5        TAG
     C                   EXFMT     VARELI
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   MOVEA     '000000'      *IN(70)
     C                   SETOFF                                       30
     C   12              EXSR      MOVB2
     C**** SØKE ALFA
     C   04              DO
     C                   SELECT
     C     LINNBR        WHENEQ    4
     C                   EXSR      SØKKUN
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     21            POSNBR
     C     LINNBR        WHENEQ    5
     C                   EXSR      SØKLEV
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     21            POSNBR
     C     LINNBR        WHENEQ    20
     C                   EVAL      XKFTYP  = 'TRACKPREFI'
     C                   MOVE      'N'           UUPDAT            1
     C                   MOVE      *BLANKS       XKFKOD            5
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP           10
     C                   PARM                    UUPDAT
     C                   PARM                    XKFKOD
     C     XKFKOD        IFNE      *BLANKS
     C                   MOVEL     XKFKOD        WSINTP
     C                   END
     C                   ENDSL
     C                   GOTO      START5
     C                   END
N01   * Flere parametre
N01  C     *in14         ifeq      '1'
N01  C     WSTRKU        ifne      *ZEROS
N01  C                   MOVE      WSTRKU        UKUNDA
N01  C                   CALL      'SYPR03R'
N01  C                   PARM                    UKUNDA            8
N01  C                   PARM                    UAVDA             4
N01  C                   PARM                    XXSER            10
N01  C                   PARM                    XXLAGG            1
N01  C                   endif
N01  C                   GOTO      START5
N01  C                   endif
     C*
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      START5
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   GOTO      START3
     C*
     C*** SØK FRA
     C     START6        TAG
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     04            POSNBR
     C*OBS HER BØR UTEN BETINGELSE VISES ETT BILDE MED BEGGE SØKEVEIER
     C                   Z-ADD     22            LINNBR
     C  N51              Z-ADD     4             POSNBR
     C   51              Z-ADD     33            POSNBR
     C                   EXFMT     VAREL2
     C   12              GOTO      START3
     C     W2TRAN        IFNE      *ZEROS
     C                   MOVE      *OFF          *IN51                      TRAN=VIA NR
     C                   ELSE
     C                   MOVE      *ON           *IN51                      TRANL01=VIA NAVN
     C                   END
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C* N40 = NY
     C  N40WSTRAN        IFEQ      *ZEROS
     C                   SETON                                        7030
     C                   MOVE      'SPT0104'     MSGNR
     C                   ELSE
     C     KODSIK        CHAIN     TRAN                               33
     C  N33              DO
     C                   UPDATE    TRANR
     C                   SETON                                        3070
     C                   MOVE      'SPT0104'     MSGNR
     C                   END
     C                   END
     C*
     C   30              Z-ADD     3             LINNBR
     C   30              Z-ADD     21            POSNBR
     C   30              GOTO      SLTB
     C* TEST CUSTOMERS
     C                   MOVE      *BLANKS       KNAVN
     C     WSINCR        IFEQ      0
     C     FAVREG        ANDNE     'K'
     C     WSTRKU        ORNE      0
     C     KUNKEY        CHAIN     CUNDL01                            71
     C  N71              MOVE      KNAVN         WSNAVN
     C  N71              MOVE      SONAVN        WSALF
     C   71              DO
     C                   MOVE      'SPK0001'     MSGNR
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C                   END
     C* TEST TO PLACE
     C                   MOVE      *BLANKS       LNAVN
     C     WSINCR        IFEQ      1
     C     WSTRLE        ORNE      0
     C     FAVREG        OREQ      'L'
     C     LEVKEY        CHAIN     LEVEL01                            72
     C  N72WSNAVN        IFEQ      *BLANKS
     C                   MOVE      LNAVN         WSNAVN
     C                   END
     C  N72WSALF         IFEQ      *BLANKS
     C                   MOVE      SONAVN        WSALF
     C                   END
     C   72              DO
     C                   MOVE      'SPM0007'     MSGNR
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     21            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C                   END
     C*
     C*** TEST OMREGNINGSFAKTOR
     C     WSLMOM        COMP      0                                      73
     C   73              DO
     C                   MOVE      'SPO0037'     MSGNR
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     21            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C     WSM3OM        COMP      0                                      74
     C   74              DO
     C                   MOVE      'SPO0037'     MSGNR
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     21            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C*
     C* TEKST/KODE FOR STOPP MÅ BEGGE VÆRE UTFYLT ELLER BEGGE BLANK
     C     WSTEXT        IFNE      *BLANKS
     C     WSSTOP        IFEQ      *BLANKS
     C                   SETON                                        75
     C                   END
     C                   ELSE
     C     WSSTOP        IFNE      *BLANKS
     C                   SETON                                        75
     C                   END
     C                   END
     C  N30
     CAN 75              DO
     C                   MOVE      'JOV0253'     MSGNR
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     21            POSNBR
     C                   SETON                                        30
     C                   GOTO      SLTB
     C                   END
     C*
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C     KODSIK        CHAIN     TRAN                               33
     C                   EXSR      MOVWSI
     C  N33              UPDATE    TRANR
     C   33              WRITE     TRANR
     C     VMSTOP        COMP      'J'                                    55     *RED
     C     VMSTOP        COMP      'N'                                    56     *WHT
     C   40              UPDATE    SUBFIL
     C  N40              ADD       1             YRECNO
     C  N40              Z-ADD     YRECNO        ZRECNO
     C  N40              WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   EXSR      MOVB2
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C                   SETOFF                                       30
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       14            LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C     WSNR          IFEQ      '2'                                          ENDRE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGSI
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '4'                                          SLETTE
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C     VMTRAN        CHAIN     UNIT                               33
     C     *IN33         IFEQ      '0'
     C                   MOVE      '1'           *IN30
     C                   MOVE      'JOV1150'     MSGNR
     C                   GOTO      SLHENT
     C                   END
     C                   EXSR      DLTSI
     C   12              GOTO      SLHENT
     C                   END
     C     WSNR          IFEQ      '6'                                          BILER
     C                   MOVE      ' '           WSNR
     C     XDLT          COMP      '*DEL*'                                98
     C   98              GOTO      SLHENT
     C                   CALL      'SYTR06'
     C                   PARM                    VMTRAN
     C                   UPDATE    SUBFIL
     C                   END
     C   50WSNR          IFEQ      '1'                                          SLETTE
     C                   MOVE      VMTRAN        UTRANS
     C                   GOTO      SLHENT
     C                   END
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       5             LINNBR
     C                   Z-ADD     2             POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     DLTSI         BEGSR
     C***********************************************
     C                   MOVE      VMTRAN        WSTRAN
     C                   MOVE      VMTRKU        WSTRKU
     C     KUNKEY        CHAIN     CUNDL01                            99
     C   99              MOVE      *BLANKS       KNAVN
     C                   MOVE      VMTRLE        WSTRLE
     C     LEVKEY        CHAIN     LEVEL01                            99
     C   99              MOVE      *BLANKS       LNAVN
     C                   SETON                                        99
     C*
     C                   EXFMT     VAREL3
     C  N12              DO
     C     KODSIK        CHAIN     TRAN                               33
     C  N33              DELETE    TRANR
     C                   EXSR      MOVB1
     C                   END
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C                   UPDATE    SUBFIL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     CHGSI         BEGSR
     C***********************************************
     C                   EXSR      MOVSIW
     C                   SETON                                        99
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C***
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C                   MOVEA     '000000'      *IN(70)
     C                   SETOFF                                       30
     C*
     C   12              DO
     C                   UPDATE    SUBFIL
     C                   EXSR      MOVB2
     C                   END
     C**** SØKE ALFA
     C   04              DO
     C                   SELECT
     C     LINNBR        WHENEQ    4
     C     POSNBR        ANDGE     21
     C     POSNBR        ANDLE     29
     C                   EXSR      SØKKUN
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     22            POSNBR
     C     LINNBR        WHENEQ    5
     C     POSNBR        ANDGE     21
     C     POSNBR        ANDLE     29
     C                   EXSR      SØKLEV
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     21            POSNBR
     C     LINNBR        WHENEQ    20
     C                   EVAL      XKFTYP  = 'TRACKPREFI'
     C                   MOVE      'N'           UUPDAT            1
     C                   MOVE      *BLANKS       XKFKOD            5
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP           10
     C                   PARM                    UUPDAT
     C                   PARM                    XKFKOD
     C     XKFKOD        IFNE      *BLANKS
     C                   MOVEL     XKFKOD        WSINTP
     C                   END
     C                   ENDSL
     C                   GOTO      STCHG
     C                   END
N01   * Flere parametre
N01  C     *in14         ifeq      '1'
N01  C     WSTRKU        ifne      *ZEROS
N01  C                   MOVE      WSTRKU        UKUNDA
N01  C                   CALL      'SYPR03R'
N01  C                   PARM                    UKUNDA            8
N01  C                   PARM                    UAVDA             4
N01  C                   PARM                    XXSER            10
N01  C                   PARM                    XXLAGG            1
N01  C                   endif
N01  C                   GOTO      STCHG
N01  C                   endif
     C*
     C  N12              EXSR      TESTB1
     C  N12
     CAN 30              GOTO      STCHG
     C     XLIN          IFEQ      0
     C                   Z-ADD     14            LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        VMTRAN
     C                   MOVE      *ZEROS        VMTRKU
     C                   MOVE      *ZEROS        VMTRLE
     C                   MOVE      *ZEROS        VMINCR
     C                   MOVE      *ZEROS        VMLMOM
     C                   MOVE      *ZEROS        VMM3OM
     C                   MOVE      *ZEROS        VMRAB
     C                   MOVE      *BLANKS       VMNAVN
     C                   MOVE      *BLANKS       VM0004
     C                   MOVE      *BLANKS       VM0010
     C                   MOVE      *BLANKS       VM0035
     C                   MOVE      *BLANKS       VMPREF
     C                   MOVE      *BLANKS       VMRECN
     C                   MOVE      *BLANKS       VMSNLA
     C                   MOVE      *BLANKS       VMSNLE
     C                   MOVE      *BLANKS       VMLAYO
     C                   MOVE      *BLANKS       VMALFA
     C                   MOVE      *BLANKS       VMTKAT
     C                   MOVE      *BLANKS       VMTEXT
     C                   MOVE      *BLANKS       VMSTOP
     C                   MOVE      *ZEROS        VMSTDA
     C                   MOVE      *BLANKS       VMINTP
     C*
     C                   MOVEL     '*DEL*'       XDLT
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB2         BEGSR
     C***********************************************
     C                   SETOFF                                       40
     C                   MOVE      *ZEROS        WSTRAN
     C                   MOVE      *ZEROS        WSTRKU
     C                   MOVE      *ZEROS        WSTRLE
     C                   MOVE      *ZEROS        WSINCR
     C                   MOVE      *ZEROS        WSLMOM
     C                   MOVE      *ZEROS        WSM3OM
     C                   MOVE      *ZEROS        WSRAB
     C                   MOVE      *BLANKS       WSNAVN
     C                   MOVE      *BLANKS       KNAVN
     C                   MOVE      *BLANKS       LNAVN
     C                   MOVE      *BLANKS       WS0004
     C                   MOVE      *BLANKS       WS0010
     C                   MOVE      *BLANKS       WS0035
     C                   MOVE      *BLANKS       WSPREF
     C                   MOVE      *BLANKS       WSRECN
     C                   MOVE      *BLANKS       WSSNLE
     C                   MOVE      *BLANKS       WSSNLA
     C                   MOVE      *BLANKS       WSRECM
     C                   MOVE      *BLANKS       WSLAYO
     C                   MOVE      *BLANKS       WSALF
     C                   MOVE      *BLANKS       WSTKAT
     C                   MOVE      *BLANKS       WSTEXT
     C                   MOVE      *BLANKS       WSSTOP
     C                   MOVE      *ZEROS        WSSTDA
     C                   MOVE      *BLANKS       WSINTP
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVSIW        BEGSR
     C***********************************************
     C                   MOVE      VMTRAN        WSTRAN
     C                   MOVE      VMTRKU        WSTRKU
     C                   MOVE      VMTRLE        WSTRLE
     C                   MOVE      VMINCR        WSINCR
     C                   MOVE      VMNAVN        WSNAVN
     C                   MOVE      VM0004        WS0004
     C                   MOVE      VM0010        WS0010
     C                   MOVE      VM0035        WS0035
     C                   MOVE      VMPREF        WSPREF
     C                   MOVE      VMRECN        WSRECN
     C                   MOVE      VMSNLA        WSSNLA
     C                   MOVE      VMSNLE        WSSNLE
     C                   MOVE      VMRECM        WSRECM
     C                   MOVE      VMLAYO        WSLAYO
     C                   MOVE      VMLMOM        WSLMOM
     C                   MOVE      VMM3OM        WSM3OM
     C                   MOVE      VMRAB         WSRAB
     C                   MOVE      VMALFA        WSALF
     C                   MOVE      VMTKAT        WSTKAT
     C                   MOVE      VMTEXT        WSTEXT
     C                   MOVE      VMSTOP        WSSTOP
     C                   MOVE      VMSTDD        WSSTDD
     C                   MOVE      VMSTDM        WSSTDM
     C                   MOVE      VMSTDÅ        WSSTDÅ
     C                   MOVE      VMINTP        WSINTP
     C     KUNKEY        CHAIN     CUNDL01                            40
     C   40              MOVE      *BLANKS       KNAVN
     C     LEVKEY        CHAIN     LEVEL01                            40
     C   40              MOVE      *BLANKS       LNAVN
     C*
     C                   SETON                                        40
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     21            POSNBR
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWSI        BEGSR
     C***********************************************
     C* FIX KEY IF NOT FOUND
     C   33              DO
     C                   MOVE      WSTRAN        VMTRAN
     C                   END
     C*
     C* FIXES VARIABLES
     C                   MOVE      WSTRKU        VMTRKU
     C                   MOVE      WSTRLE        VMTRLE
     C                   MOVE      WSINCR        VMINCR
     C                   MOVE      WSNAVN        VMNAVN
     C                   MOVE      WS0004        VM0004
     C                   MOVE      WS0010        VM0010
     C                   MOVE      WS0035        VM0035
     C                   MOVE      WSPREF        VMPREF
     C                   MOVE      WSRECN        VMRECN
     C                   MOVE      WSSNLA        VMSNLA
     C                   MOVE      WSSNLE        VMSNLE
     C                   MOVE      WSRECM        VMRECM
     C                   MOVE      WSLAYO        VMLAYO
     C                   MOVE      WSLMOM        VMLMOM
     C                   MOVE      WSM3OM        VMM3OM
     C                   MOVE      WSRAB         VMRAB
     C                   MOVE      WSALF         VMALFA
     C                   MOVE      WSTKAT        VMTKAT
     C     WSTEXT        IFNE      VMTEXT
     C     WSSTOP        ORNE      VMSTOP
     C                   MOVE      XDD           VMSTDD
     C                   MOVE      XMM           VMSTDM
     C                   MOVE      XÅÅ           VMSTDÅ
     C                   END
     C                   MOVE      WSTEXT        VMTEXT
     C                   MOVE      WSSTOP        VMSTOP
     C                   MOVE      WSINTP        VMINTP
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     *ENTRY        PLIST
     C                   PARM                    SØK               1
     C                   PARM                    UTRANS            8 0
     C     SØK           COMP      'J'                                    50
     C* TIDLIGERE VAR IND 50 -"FRA SØK/PLUKK"OGSÅ STYRENDE FOR
     C* SORTERINGSREKKEFØLGE - BYTTES UT MED IND 51 I ALLE DISSE
     C* SAMMENHENGER. IND 51 SETTES FAST ON (ALLTID ALFASØK)
     C* PÅ SIKT BØR DETTE BYTTES UT MED AT F8-SØKEBILDE VISER
     C* BÅDE NUMERISK OG ALFASØK - INNPUTFELT - SETT IND 51 ETTER DET
     C* VALG SOM OPERATØREN HAR GJORT
     C                   SETON                                        51
     C     *LIKE         DEFINE    VMTRAN        YSTRAN
     C     ALFKEY        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSALFA
     C     KODSIK        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSTRAN
     C     KODSI1        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    W2TRAN
     C     KODSI3        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    YSTRAN
     C*
     C     LEVKEY        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSTRLE
     C     KUNKEY        KLIST
     C                   KFLD                    WSFIRM
     C                   KFLD                    WSTRKU
     C                   READ      FIRM                                   33
     C                   READ      FIRTR                                  33
     C*
     C                   MOVE      FIFIRM        VMFIRM
     C                   MOVE      FIFIRM        WSFIRM            2
     C                   MOVE      *ZEROS        WSSTDA
     C                   MOVE      *ZEROS        VMSTDA
     C                   TIME                    XTIME
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKKUN        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSTRKU
     C                   PARM                    FIFIRM
     C                   PARM                    USØKKN           30
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     SØKLEV        BEGSR
     C***********************************************
     C                   MOVE      *BLANKS       UUSNAV           30
     C                   CALL      'SO1LEV'
     C                   PARM                    WSTRLE
     C                   PARM                    FIFIRM
     C                   PARM                    UUSNAV
     C                   ENDSR
     C*
