      * SYBRINGTMS
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF11
10XXX * 02 JOV PTF11 leg kundenr På adviseringstillegg mm (innland)
10XXX * 03 JOV PTF11 Krav om dato på oppdraget selv om det er oversjø booking
10XXX * 04 SH  PTF11 tilleggsgebyrer
      *****************************************************************
      *** PROGRAM SKAL VEDLIKEHOLDE OPPDRAG (TRANSPORTDISP.MODUL)   ***
      ***  OBS!!!! PROGREMMET SETTER IKKE LAST RECORD !!!!          ***
      *****************************************************************
      *                      46(96,97)RESERVET TIL TESTB2
      *                      31=RESERVERT "TILFELDIG ARBEIDS INDIKATOR"
      *****************************************************************
      *
     FDOKUFV    UF A E           K DISK
     FDOKUFVF   UF A E           K DISK
Nxx  FADRUNNRF  IF   E           K DISK
     FLEVEL01   IF   E           K DISK
     FKODTS2    IF   E           K DISK
     FPRIK      IF   E           K DISK
     FSAML1     UF   E           K DISK
     FFERDL01   UF   E           K DISK
     FAVFRHL01  IF   E           K DISK
     FTRACKF    O  A E           K DISK    USROPN
     FTRACKT    UF A E           K DISK
     FFAKT      UF A E           K DISK
     FDOKUF     UF A E           K DISK
     FDOKUFM    UF A E           K DISK
     FDISP      UF A E           K DISK
     FDOKUT     UF A E           K DISK
     FHEADF     UF A E           K DISK
     FZEADF     O    E           K DISK
     F                                     RENAME(HEADFR:ZEADFR)
     FZREETXT   O    E           K DISK
     F                                     RENAME(FREETXTR:ZREETX2R)
     FZTELL     UF   E           K DISK
     FENADSF    IF   E           K DISK
     FKUNKO2    IF   E           K DISK
     FHESTED    UF A E           K DISK
     FMULTKODT  IF   E           K DISK
     FDOKEC     IF A E           K DISK
     FKODTD     IF   E           K DISK
     FOAVT      IF   E           K DISK
     FKAVT      IF   E           K DISK
     FFIRM      IF   E           K DISK
     FFIRINL    IF   E           K DISK
     FNOPNR     IF   E           K DISK
     FKODTRI    IF   E           K DISK
     FKODTAG    IF   E           K DISK
     FKODTAG1   IF   E           K DISK
     F                                     RENAME(KODTAGR:KODTAG1R)
     FUSRDFT    IF   E           K DISK
     FVALUL01   IF   E           K DISK
     FSTED2     IF   E           K DISK
     FSTED2D    IF A E           K DISK
     F                                     RENAME(STED2R:STEDDR)
     FSTEDIL01  IF   E           K DISK
     FFRATXT    IF   E           K DISK
     FTELL      UF   E           K DISK
     FVADR      IF   E           K DISK
     FVADR3     IF   E           K DISK
     F                                     RENAME(VADRR:VADRR3)
     FCUNDL01   IF   E           K DISK
     Fcum3lm    IF   E           K DISK
     FCUTRAN    IF   E           K DISK
     FFREETXT   IF   E           K DISK
     FFREETXT2  IF A E           K DISK
     F                                     RENAME(FREETXTR:FREETX2R)
     FKOFAST    IF   E           K DISK
     FKUFAST    IF   E           K DISK
     F                                     RENAME(KOFASTR:KUFASTR)
     FKODTU     IF   E           K DISK
     FUTLLOGF   IF A E           K DISK
     FTURER     IF   E           K DISK
     FTURER14   IF   E           K DISK
     F                                     RENAME(TURERR:TUR14R)
     FHETRIU    UF A E           K DISK
     FUNITL01   IF   E           K DISK
     FTRAN      IF   E           K DISK
     FTRAB      IF   E           K DISK
     FKOSTT     UF A E           K DISK
     FKOSBU     UF A E           K DISK
     FCUOTI     IF   E           K DISK
     FFRISOK    UF A E           K DISK
     FKODFRI    IF   E           K DISK
     FBRPARF    IF   E           K DISK
     FSYPARL1   IF   E           K DISK
     FDOKUDGS   IF A E           K DISK
     FSYTR10FM  CF   E             WORKSTN USROPN
     F                                     INFDS(FBAREA)
     D AA              S              1    DIM(15)
     D AB              S              1    DIM(15)
     D HØ              S              3  2 DIM(12)
     D LE              S              3  2 DIM(12)
     D BR              S              3  2 DIM(12)
     D AN              S              3  0 DIM(12)
     D                 DS
     D  ØN151                  1     15  1
     D  ØA151H                 1     14
     D  ØA151X                 5     14
     D  ØA151D                15     15
     D                 DS
     D  ØN152                  1     15  2
     D  ØA152H                 1     13
     D  ØA152X                 5     13
     D  ØA152D                14     15
     D  ØA152T                15     15
     D                 DS
     D  ØA12                   1     12
     D  Ø12                    1     12
     D                                     DIM(12)
     D                 DS
     D  FST                    1      3
     D                                     DIM(3)
     D  WSSLI1                 1      1
     D  WSSLI2                 2      2
     D  WSSLI3                 3      3
n04  D                 DS
n04  D  WTG                    1      5
n04  D                                     DIM(5)
n04  D  WSSTN1                 1      1
n04  D  WSSTN2                 2      2
n04  D  WSSTN3                 3      3
n04  D  WSSTN4                 4      4
n04  D  WSSTN5                 5      5
n04  D  WTGX                   1      5
n04  D                 DS
n04  D  FTG                    1      5
n04  D                                     DIM(5)
n04  D  HESTN1                 1      1
n04  D  HESTN2                 2      2
n04  D  HESTN3                 3      3
n04  D  HESTN4                 4      4
n04  D  HESTN5                 5      5
n04  D  HTGX                   1      5
     D                 DS
     D  FGM                    1     45
     D                                     DIM(3)
     D  wsgm01                 1     15
     D  wsgm02                16     30
     D  wsgm03                31     45
     D                 DS
     D  FNT                    1     21  0
     D                                     DIM(3)
     D  wsant1                 1      7  0
     D  wsant2                 8     14  0
     D  wsant3                15     21  0
     D                 DS
     D  FFP                    1     21
     D                                     DIM(3)
     D  wspakn1                1      7
     D  wspakn2                8     14
     D  wspakn3               15     21
     D                 DS
     D  FVT                    1     75
     D                                     DIM(3)
     D  wsvt1                  1     25
     D  wsvt2                 26     50
     D  wsvt3                 51     75
     D                 DS
     D  FVK                    1     27  0
     D                                     DIM(3)
     D  wsvkt1                 1      9  0
     D  wsvkt2                10     18  0
     D  wsvkt3                19     27  0
     D                 DS
     D  FM3                    1     21  3
     D                                     DIM(3)
     D  wsvol1                 1      7  3
     D  wsvol2                 8     14  3
     D  wsvol3                15     21  3
     D                 DS
     D  FLM                    1     12  2
     D                                     DIM(3)
     D  wslm1                  1      4  2
     D  wslm2                  5      8  2
     D  wslm3                  9     12  2
     D                 DS
     D  FLM2                   1     12  2
     D                                     DIM(3)
     D  wslm1b                 1      4  2
     D  wslm2b                 5      8  2
     D  wslm3b                 9     12  2
      *lengde
     D                 DS
     D  FLE                    1     12  0
     D                                     DIM(3)
     D  wsle01                 1      4  0
     D  wsle02                 5      8  0
     D  wsle03                 9     12  0
      * bredde
     D                 DS
     D  FBR                    1     12  0
     D                                     DIM(3)
     D  wsbr01                 1      4  0
     D  wsbr02                 5      8  0
     D  wsbr03                 9     12  0
      * høyde
     D                 DS
     D  FHO                    1     12  0
     D                                     DIM(3)
     D  wsho01                 1      4  0
     D  wsho02                 5      8  0
     D  wsho03                 9     12  0
      * unnummer
     D                 DS
     D  FUN                    1     12
     D                                     DIM(3)
     D  wsunn1                 1      4
     D  wsunn2                 5      8
     D  wsunn3                 9     12
      * emg
     D                 DS
     D  FEM                    1      9
     D                                     DIM(3)
     D  wsemb1                 1      3
     D  wsemb2                 4      6
     D  wsemb3                 7      9
      * adr kolli
     D                 DS
     D  FAK                    1      6  0
     D                                     DIM(3)
     D  wsank1                 1      2  0
     D  wsank2                 3      4  0
     D  wsank3                 5      6  0
      * antall mmengde
     D                 DS
     D  FAM                    1     12  0
     D                                     DIM(3)
     D  wsanm1                 1      4  0
     D  wsanm2                 5      8  0
     D  wsanm3                 9     12  0
      * mengde type L/K
     D                 DS
     D  FMT                    1      3
     D                                     DIM(3)
     D  wsenh1                 1      1
     D  wsenh2                 2      2
     D  wsenh3                 3      3
      * adr poeng
     D                 DS
     D  FAP                    1      9  0
     D                                     DIM(3)
     D  wspoe1                 1      3  0
     D  wspoe2                 4      6  0
     D  wspoe3                 7      9  0
     D*
     D* DEFINERING AV ALFA-VARIABLER SOM ER PÅ OVER 256 TEGN
     D MSGTXT          DS          1024
     D MSGTX2          DS          1024
     D CMD             DS          1024
     D*
     D* DEFINERING AV TEKSTKONSTANTER - FOR "DUPMELDING"
     D* OBS - når flere linjer: avslutt med - (strek) UTEN appostrof,
     D*       hver ny dellinje må BEGYNNE med appostrof
     D*       Siste dellinje må slutte med appostrof
     D                 DS
     D TXT1FF          C                   CONST('Internt innhentings-
     D                                     oppdrag er mottatt -
     D                                     fra megler')
     D TXT1VF          C                   CONST('Internt utkjørings-
     D                                     oppdrag er mottatt -
     D                                     fra megler')
     D TXT2            C                   CONST('Aksepteres -
     D                                     oppdraget ?')
     D CMD1            C                   CONST('SNDMSG MSG(')
     D CMD2            C                   CONST(') TOMSGQ(')
     D CMD3            C                   CONST(') MSGTYPE(*INQ)')
     D AVRTX0          C                   CONST('*** AVREGNET ****')
     D                 DS
     D  HEDTRÅ                 1      4  0
     D  HEDTRM                 5      6  0
     D  HEDTRD                 7      8  0
     D  HEDTR                  1      8  0
     D                 DS
     D  WSDTRD                 1      2  0
     D  WSDTRM                 3      4  0
     D  WSDTRÅ                 5      6  0
     D  WSDTR                  1      6  0
     D*
     D* TEKSTKONSTANTER - Søkebilde kunder
     D                 DS
     D SKTXT1          C                   CONST('Op.giver')
     D SKTXT2a         C                   CONST('Fakt.mo1')
     D SKTXT2b         C                   CONST('Fakt.mo2')
     D SKTXT3          C                   CONST('Avsender')
     D SKTXT4          C                   CONST('Mottaker')
     D SKTXT5          C                   CONST('Fo.agent')
     D DSDUP           C                   CONST('     *DUP*')
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZJOB                 244    253
     D  ZUSER                254    263
     D  ZJOBNR               264    269  0
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      * CURSOR LOKASJON AV AKTIV VINDU
     D  WSCLOW               382    383B 0
     D                 DS
     D  US                     1     60
     D                                     DIM(6)
     D  KODUS1                 1     10
     D  KODUS2                11     20
     D  KODUS3                21     30
     D  KODUS4                31     40
     D  KODUS5                41     50
     D  KODUS6                51     60
     D                 DS
     D  WSVALP                 1      3  1
     D  XVALP                  1      3  3
     D                 DS
     D  XMÅL1                  5      7
     D  XMÅL2                  9     10
     D  XMÅL                   1     10
     D                 DS
     D  WSMSG                  1     62
     D  XKN                    7     14
     D  XLIKOD                31     31
     D  XLINAV                33     62
     D                 DS
     D  TMDTD                  1      2  0
     D  TMDTM                  3      4  0
     D  TMDTÅ                  5      6  0
     D  TMPDAT                 1      6  0
     D                 DS
     D  WSDTD1                 1      2  0
     D  WSDTM1                 3      4  0
     D  WSDTÅ1                 5      6  0
     D  WSSDFD                 1      6  0
     D                 DS
     D  HEDTÅ                  1      4  0
     D  HEDTM                  5      6  0
     D  HEDTD                  7      8  0
     D  HEDTOP                 1      8  0
     D                 DS
     D  XDFDÅÅ                 1      4  0
     D  XDFDMM                 5      6  0
     D  XDFDDD                 7      8  0
     D  TRSDFD                 1      8  0
     D                 DS
     D  XDTDÅÅ                 1      4  0
     D  XDTDMM                 5      6  0
     D  XDTDDD                 7      8  0
     D  TRSDTD                 1      8  0
     D                 DS
     D  XFFDÅÅ                 1      4  0
     D  XFFDMM                 5      6  0
     D  XFFDDD                 7      8  0
     D  TRSFFD                 1      8  0
     D                 DS
     D  XVTDÅÅ                 1      4  0
     D  XVTDMM                 5      6  0
     D  XVTDDD                 7      8  0
     D  TRSVTD                 1      8  0
     D                 DS
     D  WSDTD2                 1      2  0
     D  WSDTM2                 3      4  0
     D  WSDTÅ2                 5      6  0
     D  WSSDTD                 1      6  0
     D                 DS
     D  WSDTD3                 1      2  0
     D  WSDTM3                 3      4  0
     D  WSDTÅ3                 5      6  0
     D  WSSFFD                 1      6  0
     D                 DS
     D  WSDTD4                 1      2  0
     D  WSDTM4                 3      4  0
     D  WSDTÅ4                 5      6  0
     D  WSSVTD                 1      6  0
     D                 DS
     D  DSPONR                 1     20  0
     D  WSPNRF                 1      5  0
     D  WSPNRT                 6     10  0
     D  WSPNR1                11     15  0
     D  WSPNR2                16     20  0
     D                 DS
     D  DSLK                   1     20
     D  WSLANF                 1      2
     D  WSLANT                 3      4
     D  WSLAN1                 5      6
     D  WSLAN2                 7      8
     D  WSSONF                 9     11
     D  WSSONT                12     14
     D  WSSON1                15     17
     D  WSSON2                18     20
     D*
     D* DATOER I ÅR MND DAG
     D*
     D                 DS
     D  UDT3A                  1      4  0
     D  UDT2A                  5      6  0
     D  UDT1A                  7      8  0
     D  UDATOA                 1      8  0
     D                 DS
     D  UDT3B                  1      4  0
     D  UDT2B                  5      6  0
     D  UDT1B                  7      8  0
     D  UDATOB                 1      8  0
     D                 DS
     D  UDT3C                  1      4  0
     D  UDT2C                  5      6  0
     D  UDT1C                  7      8  0
     D  UDATOC                 1      8  0
     D                 DS
     D  UDT3D                  1      4  0
     D  UDT2D                  5      6  0
     D  UDT1D                  7      8  0
     D  UDATOD                 1      8  0
     D                 DS
     D  ENGAD3                 1     30
     D  SYPOGE                 1      9
     D  ADR3                  11     34
     D                 DS
     D  DSTXT                  1     35
     D  DSTXTA                 1     12
     D  DSAVD                 14     17  0
     D  DSTXTB                18     18
     D  DSOPD                 19     25  0
     D  HESDF                 27     31
     D  DSTXTC                32     32
     D  HESDT                 33     37
      * PARAMETERSTRENG FOR KALL PÅ SYKS12
     D                 DS
     D  P1DS                   1    256
     D  P1FLAG                 1      1
     D  P1BNR                  2      8  0
     D  P1AVD                  9     12  0
     D  P1TUNR                13     20  0
     D  P1OAVD                21     24  0
     D  P1OPD                 25     31  0
     D  P1BL                  32     44  2
     D                 DS
     D  WSSNDN                 1     20
     D  WSSNEA                 1      3
     D  WSSN17                 4     20
     D  WSSN10                 1     10
     D  WSSN9A                 1      9
     D  WSSN9B                10     10
     D  WSSN9C                11     20
     D  WSSN20                20     20
     D                 DS
     D  WSNT                   1      7  0
     D  WSNTWS                 3      7  0
     D                 DS
     D  WSFRAB                 1     13  2
     D  WSFRAF                 5     11  0
     D                 DS
     D  WSPOS1                 1      7
     D  WSPOSA                 1      3
     D                 DS
     D  WSFA11                 1      7
     D  WSVARM                 1      1
     D                 DS
     D  WSFA21                 1      7
     D  WSFARL                 1      1
     D                 DS
     D  WSFA12                 1      4
     D  WSLENG                 1      1
     D                 DS
     D  WSFA22                 1      4
     D  WSADVI                 1      1
     D                 DS
     D  WSSDL                  1     20
     D  WSSDL1                 1      1
     D  WSSDL2                 2     20
     D                 DS
     D  WSSDLA                 1     20
     D  WSSDLA1                1      1
     D  WSSDLA2                2     20
     D                 DS
     D  WSLNAV                 1     30
     D  WSLNAV1                1      1
     D  WSLNAV2                2     30
     D                 DS
     D  WSHNAV                 1     30
     D  WSHNAV1                1      1
     D  WSHNAV2                2     30
     D                 DS
     D  WSFT1                  1     51
     D  WSFT1A                 1     30
     D  WSFT1B                31     45
     D                 DS
     D  HEFT1                  1     51
     D  HEFT1A                 1     30
     D  HEFT1B                31     45
     D                 DS
     D  XULTID                 1     14  0
     D  XULTM                  1      6  0
     D  XULDD                  7      8  0
     D  XULMM                  9     10  0
     D  XULÅÅ                 11     14  0
     D                 DS
     D  ULÅÅ                   1      4  0
     D  ULMM                   5      6  0
     D  ULDD                   7      8  0
     D  ULDT                   1      8  0
     D                 DS
     D  WSGN                   1     15
     D  WSGNA                  1      4
     D  WSGNB                  5      9
     D  WSGNC                 10     15
     D                 DS
     D  WSNASF                 1     30
     D  WSNASF28               1     28
     D                 DS
     D  WSNAKF                 1     30
     D  WSNAKF28               1     28
     D                 DS
     D  WSNAK                  1     30
      * SØK VIA KUNDES KUNDENR...
     D  WSSTJ1                 1      1
     D  WSKURE                 2     18
      * SØK VIA KUNDEREGISTER (IKKE VADR)
     D  WSNAKA                 1      2
     D  WSNAKB                 3     30
     D LDADS          UDS
     D  UFIRM                  1      2
     D  UAVD                  15     18
     D  USG                   19     21
     D  UOPD                  22     28
     D  UUSR                 301    310
     D  DSTINF               801    872
     D* Datastruktur for returdata fra plukking i hurtigbookingsmodul
     D DSA1            DS
     D  HUDS                   1    218
     D  OPDG1                  1     10
     D  AM1                   11     11
     D  FRA1                  12     19
     D  FRA112                12     13
     D  FRA115                12     16
     D  FRA137                14     18
     D  FDATO1                20     25  0
     D  TIL1                  26     33
     D  TIL112                26     27
     D  TIL115                26     30
     D  TIL137                28     32
     D  TDATO1                34     39  0
     D  ANT1                  40     43  0
     D  VAREB1                44     68
     D  M31                   69     75  3
     D  LM1                   76     79  2
     D  VEKT1                 80     86  1
     D  FRI11                 87    116
     D  FRI21                117    146
     D  FRI31                147    176
     D  FRI41                177    206
     D  DATE1                207    212  0
     D  TIME1                213    218  0
     D                 DS            11
     D NUM             C                   CONST('1234567890 ')
     D                 DS
     D  QDATA                  1    109
     D  QDA01                  1      2
     D  QDA02                  3      6
     D  QDA03                  7     13
     D  QDA04                 14     15
     D  QDA05                 16     16
     D  QDA06                 17     20
     D  QDA07                 21     24
     D  QDA08                 25     26
     D  QDA09                 27     28
     D  QDA10                 29     29
     D  QDA11                 30     30
     D  QDA12                 31     37
     D  QDA13                 38     38
     D  QDA14                 39    100
     D  QDA15                101    101
     D  QDA16                102    102
     D  QDA17                103    103
     D  QDA18                104    109
      *
     D SLTTXT          C                   CONST('*SLETTET*')
      * DS FOR DEFAULTTEKST INNH/UTKJØRING
     D CFT1            C                   CONST('INNHENTING')
     D CFT2            C                   CONST('->')
     D CVT1            C                   CONST('UTKJØRING ')
     D CVT2            C                   CONST('->')
      * INNH.
     D                 DS
     D  DSFFTX                 1     35
     D  DSFT1                  1     10
     D  DXPNS1                12     21
     D  DSFT2                 23     24
     D  DXPNS3                26     35
      * UTKJ.
     D                 DS
     D  DSVFTX                 1     35
     D  DSVT1                  1     10
     D  DXPNS4                12     21
     D  DSVT2                 23     24
     D  DXPNS2                26     35
     D                 DS
     D  HXHEAD                 1    256
     D  HXUR                   1      1
     D  HXFR                   2      4
     D  HXKDPL                 5      5
     D  HXLKA                  6      7
     D  HXSDF                  8     12
     D  HXTRI                 13     14
     D  HXSDT                 15     19
     D  HXLKS                 20     21
     D  HXSDFF                22     26
     D  HXLKK                 27     28
     D  HXSDVT                29     33
     D  HXVKT                 34     42  0
     D  HXFBV                 43     51  0
     D  HXM3                  52     58  3
     D  HXLM                  59     62  2
     D  HXNT                  63     69  0
     D  HXVERV                70     72
     D  HXVERB                73     75  2
     IKUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C**************************************************************************
     C                   OPEN      SYTR10FM
     C     START0        TAG
     C                   EXSR      INIT
     C*
     C*
     C* KALL FRA ULIKE OPTIONS/F-FASTER GIR FØLGENDE VERDIER I:
     C* Inngang................   UURETU(opt) UUFUNK(F-tast) CALLFR
     C*
     C* F6=NY fra subfil i SYTR33     ' '        '6'         'A'
     C* F9=NY MAL subfil i SYTR33     ' '        '9'         'A'
     C* Opt 2 sytr33                  '2'        '0'         'A'
     C*(Opt 2 sytr33-MAL(FØR INIT:)   '2'        '9'         'A')
     C* Opt 3 sytr33                  '3'        '0'         'A'
     C* Opt 6 sytr33 (-->til SYFI10X) '6'        '0'         'A'
     C* Opt 5 sytr33                  'S'        '0'         'A'
     C* Opt 8 sytr33 notis-Går IKKE innom SYTR10.........
     C*
     C* F8=Rett til opd fra SØKEBILDE '2'        '0'         'A'
     C* F9=Rett til faktura fra SØKEBILDE - IKKE innom SYTR10......
     C* (opt 6 fra subfil bør gå direkte til SYFI10X slik som F9/SØK)
     C*
     C* KALL FRA SYTR88..(Turdisponering)
     C* Opt 2 - Endre oppdrag         '2'        '0'         'T'
     C*
     C*
     C*
     C     START         TAG
     C                   MOVE      USG           WSSG
     C* Retur fra annet prog. med F3 (SYFI10X...)
     C     UUFUNK        IFEQ      '3'
     C                   GOTO      SLUTT
     C                   END
     C* F6= lag ny  / F9= lag nytt mønsteroppdrag
     C     UUFUNK        IFEQ      '6'
     C     UUFUNK        OREQ      '9'
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   GOTO      START1
     C                   END
     C* kopiere..(kopier fra HEAVD/HEOPD - ulik 0 --> *IN28 *ON)
     C                   MOVE      *OFF          *IN28
     C     UURETU        IFEQ      '3'
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      WSAVDC        HEAVD
     C                   MOVE      *ZEROS        WSOPD
     C                   MOVE      *ON           *IN28
     C                   GOTO      START1
     C                   END
     C* endre eller rett til faktura...
     C     UURETU        IFEQ      '2'
     C     UURETU        OREQ      '6'
     C     UURETU        OREQ      'S'
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   GOTO      START1
     C                   END
     C     STXXB1        TAG
     C                   EXFMT     BILDE01
     C*
     C                   SETOFF                                       30
     C                   MOVEA     '000'         *IN(97)
     C*
     C   03              GOTO      SLUTT
     C   12              GOTO      START2
     C     START1        TAG
     C                   EXSR      TESTB1
     C*
     C*** UURETU = Opt 6 Fra subfil i sytr33 - GÅ TIL FAKTURA
     C* FEIL på BILDE 1 (skjult)
     C   30UURETU        IFNE      '6'
     C                   GOTO      STXXB1
     C                   ELSE
     C                   GOTO      SLUTT
     C                   END
     C**
     C**
     C* INGEN FEIL PÅ BILDE 1.(skjult)
     C**
     C*
     C*** UURETU = Opt 6 Fra subfil i sytr33 - GÅ TIL FAKTURA
     C     UURETU        IFEQ      '6'
     C                   EXSR      TESTB2
     C                   EXSR      FAKTUR
     C                   GOTO      SLUTT
     C                   END
     C* F5 fra bilde 1 - rett til faktura (GAMMEL LOGIKK)
     C   05              DO
     C                   EXSR      TESTB2
     C                   GOTO      START3
     C                   END
     C*
     C     START2        TAG
     C* 16 *ON = F16 inne i SYTR10 - til neste oppdrag (på turen).
     C   16              DO
     C                   EXSR      MOVB1
     C                   EXSR      SETOFI
     C                   MOVEA     '00'          *IN(43)
     C                   MOVE      HEOPD         WSOPDG
     C                   MOVE      *ZEROS        HEOPD
     C     INNLAN        IFNE      'J'
     C                   Z-ADD     3             LINNBR
     C                   ELSE
     C                   Z-ADD     2             LINNBR
     C                   END
     C                   Z-ADD     8             POSNBR
     C                   MOVE      'NY'          XNYGML            2
     C                   END
     C*
     C*
     C  N30
     CANN16              Z-ADD     3             LINNBR
     C  N30
     CANN16WSKDAK        IFNE      ' '
     C     WSKNA         ANDEQ     *ZEROS
     C                   Z-ADD     10            POSNBR
     C                   ELSE
     C                   Z-ADD     8             POSNBR
     C                   END
     C     INNLAN        IFEQ      'J'
     C     WSSNDN        ANDEQ     *BLANKS
     C  N30              Z-ADD     2             LINNBR
     C  N30              Z-ADD     8             POSNBR
     C                   END
     C*
     C     ST21          TAG
     C*
     C*** TEST OM DET ER OPPLYSNINGER TIL OPPDRAG
     C* SET INDIKATOR FOR RØDT OPPDRNR (NOTAT FINNES)
     C                   SETOFF                                       29
     C     WSOPD         IFNE      *ZEROS
     C     FREETK        SETLL     FREETXT
     C     FREETK        READE     FREETXT                                29
     C                   END
     C*
     C                   EXSR      KDTFMT
     C     WSOPD         COMP      *ZEROS                                 45
     C* TESTER OM FAKTURERT
     C                   SETOFF                                       36
     C     XXFAKE        CHAIN(N)  FAKT                               33
     c  N33              MOVE      FAKDA         XKDA
     c   33              MOVE      ' '           XKDA
     C  N33FAOPKO        COMP      ' '                                3636
     C  N33
     CAN 36FAOPKO        COMP      'C'                                3636
     C     WSSTAF        COMP      'F'                                    43
     C  N43WSSTAF        COMP      'O'                                    43
     C     WSSTAE        COMP      'F'                                    44
     C  N44WSSTAE        COMP      'O'                                    44
     C     TROPD0        COMP      *ZEROS                                 41
     C   42              EXSR      MOVWP
      *
      *  skjulte felter skal være blank / null ...
      *  for å beholde enkel modus
      *
     C     *IN32         IFEQ      '1'
     C     WSANS         IFNE      *ZEROS
     C     WSKDFS        ORNE      *BLANKS
     C     WSSDFF        ORNE      *BLANKS
     C     WPSDFF        ORNE      *BLANKS
     C     WSSDVT        ORNE      *BLANKS
     C     WPSDVT        ORNE      *BLANKS
     C     WSKNFA        ORNE      *ZEROS
     C     WSKF          ORNE      *BLANKS
     C     WSVERV        ORNE      *BLANKS
     C     WSETTV        ORNE      *BLANKS
     C     WSFA11        ORNE      *BLANKS
     C     WSFA21        ORNE      *BLANKS
     C                   MOVE      '0'           *IN32
     C                   END
     C                   END
      * Fakturamottakers valutakode...
     C                   MOVE      '1'           *IN28
     C     *IN32         IFEQ      '1'
     C     *IN65         ANDEQ     '0'
     C     WSVALS        IFNE      *BLANKS
     C     WSVALS        ANDNE     FICURR
     C     WSVALS        ANDNE     KUNVAL
     C                   MOVE      '0'           *IN28
     C                   END
     C     *IN66         IFEQ      '1'
     C                   MOVE      '0'           *IN28
     C                   END
     C                   END
      * Enkel modus er slått av - gi melding, men ikke ved første visn.
     C     *IN32         IFEQ      '0'
     C     *IN30         ANDEQ     '0'
     C     FØRVIS        IFEQ      'N'
     C                   MOVE      'JOV0804'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   ELSE
     C                   MOVE      'N'           FØRVIS
     C                   END
     C                   END
      *
      * IMP/EKS/INB/TRA I RETNING - KAN BENYTTES I SENERE TESTER
     C*
N36  C     HELKA         IFEQ      FILAND
N36  C     HETRI         IFNE      FILAND
N36  C                   MOVE      'EKS'         RETNING           3
N36  C                   ELSE
N36  C                   MOVE      'INN'         RETNING
N36  C                   END
N36  C                   ELSE
N36  C     HETRI         IFEQ      FILAND
N36  C                   MOVE      'IMP'         RETNING
N36  C                   ELSE
N36  C                   MOVE      'TRA'         RETNING
N36  C                   END
N36  C                   END
     C
      *
     C   32
     CAN 28WSVALT        COMP      *BLANKS                                28
     C                   MOVE      WSKDFF        GMKDFF            1
      *
     C     HEADFK        SETLL     ENADSF                                 33
     C                   IF        *IN33
     C     HEADFK        READE     ENADSF                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        N3039 <> *BLANKS
     C                   IF        NKN = 0
     C                   LEAVE
     C                   ELSE
     C                   EVAL      KUINTN = N3039
     C     KUNKO2K       CHAIN     KUNKO2                             34
     C   34              LEAVE
     C                   END
     C                   END
     C     HEADFK        READE     ENADSF                                 33
     C                   ENDDO
     C  N33              EVAL      WSEDIINF = 'EDI-ADR. F14'
     C   33              EVAL      WSEDIINF = *BLANKS
     C                   ELSE
     C                   EVAL      WSEDIINF = *BLANKS
     C                   END
     C                   MOVEA     '00'          *IN(34)
     C     WSOPD         IFNE      *ZEROS
     C     PROTACT       ANDEQ     'J'                                          PROTECT ATD/ATA J/N
     C     HEADFK        CHAIN(N)  TRACKT                             33
     C  N33TXATDD        COMP      *zeros                             34
     C  N33TXATAD        COMP      *zeros                             35
     C                   if        wsmsg = *blanks
     C                             and (*in34 or *in35)
     C                   eval      wsmsg=protTxt
     C                   endif
     C                   ENDIF
      *
     C     CALLFR        IFNE      'I'
     C     CALLFR        ANDNE     'U'
     C     UURETU        IFNE      'S'
     C                   EXFMT     BILDE02
     C                   ELSE
     C                   EXSR      SNUREGD
     C                   EXFMT     BILDE02V
     C                   END
     C                   ELSE
     C     INFULL        IFEQ      'J'
     C                   SETOFF                                       32
     C                   EXFMT     BILDE02
     C                   ELSE
      *
      *FINN BELØP NÅR OPPDRAG ER GENERERT
      *
     C     WSOPD         IFNE      *ZEROS
     C                   EXSR      GETBEL
     C                   END
     C                   MOVE      WSTSTA        GMTSTA            1
      *
     C                   EXFMT     BILDE22
      *
      *OPPDATER EVT ENDREDE BELØP M.M.
     C     WSOPD         IFNE      *ZEROS
     C     *IN12         ANDNE     '1'
     C                   SETOFF                                       30
     C                   EXSR      CHGBEL
     C   30              GOTO      ST21
     C                   END
     C                   END
     C                   END
      *
      * SIKRE AT IKKE FAKTURERTE LINJER BLIR BERØRT.
      *
     C                   SETOFF                                       36
     C     XXFAKE        CHAIN(N)  FAKT                               33
     C  N33FAOPKO        COMP      ' '                                3636
     C  N33
     CAN 36FAOPKO        COMP      'C'                                3636
      *
      * HVIS ÅPEN OG HVIS ENDRET S/K-KODE BYTT ALLE LINJER
      *
     C*
     C* F22 GÅ I HURTIGBOOKINGSMODUL
     C*
     C*
     C   22              DO
     C* Plukk tillatt kun fra oppdrag under oppretting (*NY*)
     C     *IN45         IFEQ      *ON
     C                   MOVE      'J'           HUPLUK            1
     C                   ELSE
     C                   MOVE      'N'           HUPLUK
     C                   END
     C                   MOVE      *BLANKS       HUDATA          218
     C                   CALL      'SYHU10'
     C                   PARM                    HUPLUK
     C                   PARM                    HUDATA
     C* Ikke plukket vis bilde
     C     HUDATA        IFEQ      *BLANKS
     C                   GOTO      ST21
     C                   ELSE
     C* Dersom plukket - fyll inn data - test
     C                   EXSR      MOVHUW
     C                   END
     C                   END
     C*
      * SØK KUNDENR/POSTSTEDSNR.
     C  N03
     CANN04
     CANN12
     CANN24
     CANN07
     CANN02
     CANN14
     CANN18              EXSR      SØKING
      *
     C   42              EXSR      MOVPW
     C                   EXSR      KDTFMT
     C                   EXSR      SETOFI
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C                   Z-ADD     WSSUBN        XRECNO            4 0
     C*
     C   02              DO
     C     CALLFR        IFNE      'I'
     C     CALLFR        ANDNE     'U'
     C     *IN32         IFEQ      '1'
     C                   MOVE      '0'           *IN32
     C                   ELSE
     C                   MOVE      '1'           *IN32
     C                   END
     C                   ELSE
     C                   MOVE      '0'           *IN32
     C     INFULL        IFEQ      'J'
     C                   MOVE      'N'           INFULL            1
     C                   ELSE
     C                   MOVE      'J'           INFULL            1
     C                   END
     C                   END
     C                   GOTO      ST21
     C                   END
      *
      * KUN 17 FYLT UT?  - LEGG PÅ 401
     C     INNLAN        IFEQ      'J'
     c     WSSN9C        ANDNE     *blanks
     c     WSSN20        ANDEQ     *blanks
     c                   movel     WSSNDN        Tmp17            17
     c                   eval      WSSNDN = '401'+Tmp17
     c                   end
     C     INNLAN        IFEQ      'J'
     C     WSOPD         ANDEQ     *ZEROS
     C     WSKNA         ANDEQ     *ZEROS
     C     WSNAA         ANDEQ     *BLANKS
     C     WSKNSF        ANDEQ     *ZEROS
     C     WSSNDN        ANDNE     *BLANKS
     C                   MOVE      *ZEROS        SNDAVD            4 0
     C                   MOVE      *ZEROS        SNDOPD            7 0
     C                   CALL      'SYTR10B'
     C                   PARM                    WSSNDN
     C                   PARM                    SNDAVD
     C                   PARM                    SNDOPD
     C     SNDOPD        IFNE      *ZEROS
     C                   MOVE      SNDAVD        WSAVD
     C                   MOVE      SNDOPD        WSOPD
     C                   MOVE      '2'           UURETU
     C                   MOVE      '0'           UUFUNK
     C                   GOTO      START0
     C                   END
     C                   END
     C   24              DO
     C                   EXSR      UTCMDL
     C                   GOTO      ST21
     C                   END
     C   07              DO
      * dersom en står på DUP av/Innh/Utkj-oppdrag v/F7, gå rett på spørring på det oppdraget
     c                   move      *zeros        SpDirAvd          4 0
     c                   move      *zeros        SpDirOpd          7 0
     c     Innlan        ifeq      'J'
     c                   select
     C     LINNBR        wheneq    17
     c                   move      TRAVD0        SpDirAvd
     c                   move      TROPD0        SpDirOpd
     C     LINNBR        wheneq    18
     c                   move      TRAVD1        SpDirAvd
     c                   move      TROPD1        SpDirOpd
     C     LINNBR        wheneq    20
     c                   move      TRAVD2        SpDirAvd
     c                   move      TROPD2        SpDirOpd
     c                   endsl
     c                   else
     c                   select
     C     LINNBR        wheneq    20
     c                   move      TRAVD0        SpDirAvd
     c                   move      TROPD0        SpDirOpd
     C     LINNBR        wheneq    21
     c     POSNBR        ifle      66
     c                   move      TRAVD1        SpDirAvd
     c                   move      TROPD1        SpDirOpd
     c                   else
     c                   move      TRAVD2        SpDirAvd
     c                   move      TROPD2        SpDirOpd
     c                   endif
     c                   endsl
     c                   endif
      * var der dupav/innh/utkj. på aktuell linje - i så fall slå opp
     c     SpDirOpd      ifne      *zeros
     C                   MOVE      *ZEROS        SpDirFlag         1 0
     C                   CALL      'SYFM21A'
     C                   PARM                    FIFIRM
     C                   PARM                    SpDirAvd
     C                   PARM                    SpDirOpd
     C                   PARM                    SpDirFlag
     C                   GOTO      ST21
     c                   endif
      * elles - vanlig F7-søk som før..
      *
     C                   MOVE      'J'           TR33SP            1
     C                   MOVE      ' '           UURETU            1
     C                   MOVE      ' '           UUFUNK            1
     C                   MOVE      'S'           UTYPE2            1
     C                   CALL      'SYFM21'
     C                   PARM                    UTYPE2
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSSG
     C                   GOTO      ST21
     C                   END
     C* F2 = BYTT AVDELING
     C*
     C   02WSOPD         IFEQ      *ZEROS
     C                   MOVE      *ZEROS        HEAVD
     C                   MOVE      *ZEROS        HEOPD
     C                   GOTO      STXXB1
     C                   END
     C* F13= SE ØVRIGE DATOER
     c     *IN13         IFEQ      *ON
     C     LINNBR        andle     10
     C                   Z-ADD     1             TTFLAG            1 0
     C                   CALL      'SYTT02CL'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    TTFLAG
      * evt endret dato/tid over i skjermvariable..
     C     HEADFK        CHAIN(N)  HEADF                              33
     C                   MOVE      XDFDDD        WSDTD1
     C                   MOVE      XDFDMM        WSDTM1
     C                   MOVE      XDFDÅÅ        WSDTÅ1
     C                   MOVE      TRSDFK        WSSDFK
     C                   MOVE      XDTDDD        WSDTD2
     C                   MOVE      XDTDMM        WSDTM2
     C                   MOVE      XDTDÅÅ        WSDTÅ2
     C                   MOVE      TRSDTK        WSSDTK
     C                   GOTO      ST21
     c                   ENDIF
     C* Printe skilleark
     C   23              DO
     C                   exsr      prtskill
     C                   GOTO      ST21
     c                   end
     C* FRI SØKEVEI
     C   15              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0126'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSKNA
     C                   PARM                    WSKNSF
     C                   GOTO      ST21
     C                   END
     C* FREETEXT
     C   18              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SPO0106'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      VISFRE
     C                   GOTO      ST21
     C                   END
     C* LASTEBÆRERE/VARELINJER
     C     *IN08         IFEQ      *ON
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'JOV0934'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      OPDHEA
     C                   EXSR      VARELIN
     C                   EXSR      MOVFVW
     C                   GOTO      ST21
     C                   END
     C* 06 = BEREGN KUBIKK
     C     *IN06         IFEQ      *ON
     C                   EXSR      KUBIKK
     C                   GOTO      ST21
     C                   END
     C*
     C* SEARCH CUSTOMER
     C   04              DO
     C                   EXSR      SØKDTA
     C   30              GOTO      ST21
     C     UFLAGG        IFEQ      1
     C                   GOTO      ST21
     C                   END
     C                   END
     C*
     C* 09 TIL PLANLEGGING
     C*
     C   09              DO
     C     CALLFR        IFNE      'T'
     C     HEADFK        CHAIN(N)  DISP                               33
     C     WSOPD         IFNE      *ZEROS
     C   33              EXSR      OPDDIS
     C                   MOVE      WSAVD         XAVD              4 0
     C                   MOVE      WSOPD         XOPD              7 0
     C                   MOVE      WSPRO         XPRO              8 0
     C                   MOVE      WSRUND        XRUND             8 0
     C                   MOVE      'P'           USPØR             1
     C     WSPRO         IFNE      *ZEROS
     C                   MOVE      'A'           USPØR             1
     C                   END
     C                   CALL      'SYTR88'
     C                   PARM                    XPRO
     C                   PARM                    XRUND
     C                   PARM                    XAVD
     C                   PARM                    XOPD
     C                   PARM                    USPØR
     C                   PARM                    UFLAGG
     C     HEADFK        CHAIN(N)  DISP                               33
     C                   MOVE      DITUR         WSPRO
     C                   MOVE      DIRUND        WSRUND
     C     HEADFK        CHAIN(N)  HEADF                              33
     C                   MOVEL     HEHAWB        WSHAWB
     C                   GOTO      START2
     C                   ELSE
     C                   MOVE      'SPO0034'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      START2
     C                   END
     C                   ELSE
     C                   MOVE      'SHU0011'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      START2
     C                   END
     C                   END
     C*
     C*   F10 = FULLOAD/OPPRETT TUR - SE PÅ/ARBEIDE MED EKSISTERENDE
     C*
     C   10              DO
     C     CALLFR        IFNE      'T'
     C     WSOPD         IFNE      *ZEROS
     C                   EXSR      OPDHEA
     C                   MOVE      WSAVD         XAVD              4 0
     C                   MOVE      WSOPD         XOPD              7 0
     C                   MOVE      'F'           USPØR             1
     C*NÅR ALT ER SATT PÅ TUR KAN DENNE TUREN TILHØRE ANNEN AVD.
     C     DITUAV        IFNE      *ZEROS
     C                   MOVE      DITUAV        XAVD              4 0
     C                   END
     C     DISTA1        IFNE      ' '
     C                   MOVE      'J'           USPØR             1
     C                   END
     C                   CALL      'SYTR88A'
     C                   PARM                    UFIRM
     C                   PARM                    XAVD
     C                   PARM                    WSPRO
     C                   PARM                    WSRUND
     C                   PARM                    XOPD
     C                   PARM                    AVDZER
     C                   PARM                    USPØR
     C                   PARM                    UFLAGG            1 0
     C     HEADFK        CHAIN(N)  DISP                               33
     C                   MOVE      DITUR         WSPRO
     C                   MOVE      DIRUND        WSRUND
     C     HEADFK        CHAIN(N)  HEADF                              33
     C                   MOVEL     HEHAWB        WSHAWB
     C                   GOTO      START2
     C                   ELSE
     C                   MOVE      'SPO0034'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      START2
     C                   END
     C                   ELSE
     C                   MOVE      'SHU0011'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      START2
     C                   END
     C                   END
      *
      * GÅ TIL REKVISISJON-
      *
     C   11              DO
     C     WSOPD         IFNE      *ZEROS
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              DO
     C                   MOVE      WSSTAE        TRSTAE
     C                   MOVE      WSSTAF        TRSTAF
     C                   UPDATE    HEADFR
     C                   END
     C                   MOVE      'O'           P1FLAG
     C                   MOVE      *ZEROS        P1BNR
     C                   MOVE      *ZEROS        P1AVD
     C                   MOVE      *ZEROS        P1TUNR
     C                   MOVE      WSAVD         P1OAVD
     C                   MOVE      WSOPD         P1OPD
     C                   MOVE      *ZEROS        P1BL
     C                   MOVE      P1DS          PARM1           256
     C                   CALL      'SYKS12'
     C                   PARM                    PARM1
     C     HEADFK        CHAIN(N)  HEADF                              33
     C  N33              DO
     C                   MOVE      TRSTAE        WSSTAE
     C                   MOVE      TRSTAF        WSSTAF
     C                   END
     C                   GOTO      START2
     C                   ELSE
     C                   MOVE      'SPO0035'     MSGNR
     C                   SETON                                        3097
     C                   GOTO      START2
     C                   END
     C                   END
     C*
     C*
     C   12              DO
     C     WSOPD         IFNE      *ZEROS
     C     XNYGML        IFEQ      'NY'
     C                   EXSR      FAKTUR
     C                   END
     C                   END
     C                   GOTO      SLUTT
     C                   END
     C*
     C* SLUTT PÅ 12
     C*
     C   14              DO
     C                   EXSR      VISOPL
     C                   GOTO      ST21
     C                   END
     C* Simuler avregning
     C   19              DO
     C     WSOPD         cabeq     *ZEROS        st21
     C                   EXSR      OPDHEA
     C                   EXSR      VISAVR
     C                   GOTO      ST21
     C                   END
     C*
     C*
     C* F20/21 ER OVER TIL FAXSYSTEM
     C*
     C   21
     COR 20              DO
     C     WSOPD         IFEQ      *ZEROS
     C                   MOVE      'SHU0210'     MSGNR
     C                   SETON                                        30
     C                   GOTO      ST21
     C                   END
     C                   EXSR      OPDHEA
     C                   EXSR      FAX
     C                   GOTO      ST21
     C                   END
     C*
     C                   EXSR      TESTB2
     C*
     C* VED KOPIERINGSMAL (VIA F9/OPT 2 PÅ STATUS M.) IKKE FEIL
     C     *IN37         IFEQ      *ON
     C                   MOVE      *OFF          *IN30
     C   03              EXSR      OPDHEA
     C   03WSPK7         IFEQ      'C'
     C                   EXSR      CMRFBR
     C   12              GOTO      START2
     C                   END
     C   03              GOTO      SLUTT
     C   12              GOTO      SLUTT
     C* ALT ANNET ENN F3-AVSL./LAGRE OG F12 AVBRYT. GIR VIS BILDE PÅ NY
     C                   GOTO      ST21
     C                   END
     C*
     C   30              GOTO      ST21
      * summerer varelinjer kan gjøres i skjerm hvis ikke flere enn 3
     c     wssli4        ifne      'P'
     c     wsopd         ifeq      0
     c     fler3         oreq      *BLANKS
     c                   exsr      sumdokufw
     c                   else
     c                   exsr      sumdokuf
     c                   end
     c                   end
     C*
     c                   exsr      OPDDOKUFV
     C**
     C  N03
     CANN05
     CANN16              GOTO      START2
     C*
     C                   EXSR      OPDHEA
      *
      * TEST OM GODS ER KOMMET (ATA <> 0) VED WEB-BOOKING (SJØ)
     C                   IF        *IN30 = *OFF
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   IF        *IN33 = *OFF
     C     HEOT          SCAN      PAVRDA                                 33
     C                   IF        *IN33
     C     HEADFK        CHAIN(N)  TRACKT                             33
     C  N33              IF        ((TXATAD = 0) AND (*IN03 <> '1'))
     C                   MOVE      *ON           *IN30
     C                   MOVE      'YBC1933'     MSGNR
     C                   GOTO      START2
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C*
     C* LAGER EVENTUELLT DUPLIKATOPPDRAG
     C*
     C* FØRST FORFRAKT
     C*
     C     WSSDFF        IFNE      *BLANKS
     C     WPPNS3        ORNE      *BLANKS
     C     TRAVD1        IFEQ      *ZEROS
     C     WSSTAF        IFEQ      *BLANKS
     C                   EXSR      DUPLIK
     C   12              GOTO      START2
     C                   GOTO      UTDUP
     C                   END
     C                   END
     C                   END
     C*
     C* DERETTER ETTERFRAKT
     C*
     C     WSSDVT        IFNE      *BLANKS
     C     WPPNS4        ORNE      *BLANKS
     C     TRAVD2        IFEQ      *ZEROS
     C     WSSTAE        IFEQ      *BLANKS
     C                   EXSR      DUPLIK
     C   12              GOTO      START2
     C                   GOTO      UTDUP
     C                   END
     C                   END
     C                   END
     C*
     C   05WSSDFF        IFNE      *BLANKS
     C     WSSDVT        ORNE      *BLANKS
     C     WPPNS3        ORNE      *BLANKS
     C     WPPNS4        ORNE      *BLANKS
     C                   EXSR      DUPLIK
     C   12              GOTO      START2
     C                   END
     C*
     C     UTDUP         TAG
     C*
     C*
     C*
     C*
     C*** BILL OF LADING
     C     WSPK7         IFEQ      'B'
     C                   EXSR      BILLOF
     C   12              GOTO      START2
     C                   END
     C*** BILL OF LADING
     C     WSPK7         IFEQ      'W'
     C                   EXSR      BILLOFW
     C   12              GOTO      START2
     C                   END
     C*
     C*** CMR FRAKTBREV
     C     WSPK7         IFEQ      'C'
     C                   EXSR      CMRFBR
     C   12              GOTO      START2
     C                   END
     C*
     C*** FORPASSING PÅ SAD
     C     WSPK2         IFEQ      'J'
     C     DOKUTK        CHAIN     DOKUT                              33
     C                   EXSR      MOVWDT
     C   33              WRITE     DOKUTR
     C  N33              UPDATE    DOKUTR
     C                   MOVE      *ZEROS        W2TOLL
     C                   END
     C* FRAKTBREV
     C     WSPK1         IFEQ      'J'
     C     DOKUFK        CHAIN(N)  DOKUF                              33
     C   03
     CAN 33
     COR 16
     CAN 33              EXSR      MOVWDF
     C*
     C*** REGISTRERE FRAKTBREV
     C  N03
     CANN16              EXSR      FRABR
     C   12              GOTO      START2
     C                   END
     C*
     C*** AIRWAYBILL
     C     WSPK8         IFEQ      'J'
     C     WSPK8         OREQ      'S'
     C                   EXSR      EFRABR
     C   12              GOTO      START2
     C                   END
     C*
     C*** FAKTURA
     C     START3        TAG
     C     XNYGML        IFEQ      'NY'
     C                   EXSR      FAKTUR
     C                   ELSE
     C   05              EXSR      FAKTUR
     C                   END
     C*
     C   03              GOTO      SLUTT
     C   16
     COR 12              GOTO      START2
     C   08              MOVE      '1'           UIN08
     C*
     C     SLUTT         TAG
      *
      *
      * DERSOM EN HAR ENDRET GAMMELT OPPDRAG MED DUP-UNDER SEG
      * OPPDATER AUTOMATISK ANT. VEKT. M.M. PÅ DUP.OPPDRAGET
      *
     C  N12GMNT          IFGT      *ZEROS
     C     GMNT          IFNE      WSNT
     C     GMVKT         ORNE      WSVKT
     C     GMFBV         ORNE      WSFBV
     C     GMLM          ORNE      WSLM
     C     GMM3          ORNE      WSM3
      * erstattes med kall som tar hele dup-kjeden
      *   HELE LOGIKKEN bør kanskje flyttes til OPDHEA !!!!!
      * Dersom oppdraget inngår i en dup-kjede - kall for å oppdatere andre
      * OBS!!! MÅ TA HENSYN TIL SPREDNINGSDUP I SYTR10A (ikke grort pr 27.02.2014)
      * (nå kalles ikke SYTR10A ved VF - vekt endres ikke ved levering- dvs Spredning ikke prob)
      * Hvis (NÅR) en begynner å logge vekt/vol LM-endring i T&T så medsendes det
     c                   if        TRopd0<>0 or TRopd1<>0 or TRopd2<>0
     c                   if        TRSLAG='HO' or TRSLAG='FF'
     C                   CALL      'SYTR10A'
     C                   PARM                    HEAVD             4 0
     C                   PARM                    HEOPD             7 0
     C                   PARM                    UTTACTI           3
     C                   PARM                    UTTDATE           8 0
     C                   PARM                    UTTTIME           6 0
     c                   endif
     c                   endif
     C                   END
     C                   END
      *
      * SLUTT DUPOPPDRAG
      *
     C*
      * VED INNLAND /AVBRUDD F12 KAN AVD VÆRE 0
     C     WSAVD         IFNE      *ZEROS
     C                   EXSR      GMLSTA
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSOPDG        UOPD
     C     UIN08         IFEQ      '1'
     C                   MOVE      WSAVD         UAVD
     C                   MOVE      WSOPD         UOPD
     C                   END
     C                   ELSE
     C                   MOVE      UAVD          WSAVD
     C                   END
      *
     C                   CLOSE     SYTR10FM
     C                   MOVE      *ON           *INLR
     C                   RETURN
     C*
     C***********************************************
     C     GMLSTA        BEGSR
     C***********************************************
      * FERDIG MED VEDLIKEHOLD AV DETTE OPPDRAGET
      * SETT STATUS X-> GML VERDI ("ÅPNE" EVT U-OPPDRAG, UFERDIG.)
     C     HEADFK        CHAIN     HEADF                              33
     C     *IN33         IFEQ      '0'
     C     GMST          IFEQ      'U'
     C     *IN12         IFEQ      '0'
     C                   MOVE      ' '           GMST
     C                   END
     C                   END
     C                   MOVE      GMST          HEST
     C                   UPDATE    HEADFR
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     SETOFI        BEGSR
     C***********************************************
     C                   SETOFF                                       30
     C                   MOVEA     '00000000'    *IN(92)
     C                   MOVEA     '00000000'    *IN(84)
     C                   MOVEA     '00000000'    *IN(76)
     C                   MOVEA     '00000000'    *IN(68)
     C                   MOVEA     '00000000'    *IN(60)
     C                   MOVEA     '00000000'    *IN(52)
     C                   MOVEA     '0000000'     *IN(45)
     C                   MOVEA     '00'          *IN(39)
     C                   ENDSR
     C***********************************************
     C     GETBEL        BEGSR
     C***********************************************
      * UTFØRES UMIDDELBART FØR!!! VISNING AV BILDE22.
      * FLYTTET TILE EGEN SR (CHGBEL)
     C                   Z-ADD     WSFRAF        WSFRAA
     c                   MOVE      'N'           GRPRJN            1
     c*                  MOVE      'J'           GRPRJN            1
      * Hvis grunntall finnes - bruk det som avregningsgrunnlag (highlight=ferdig utregnet..)
     c     GRPRJN        ifeq      'J'
     c                   exsr      GetGRUN
     c                   end
     C                   MOVE      *zeros        USKNT             8 0
      * default transp på avdelingen
     C                   Move      *zeros        DFTTRA            8 0
     C     WSPRO         IFeq      *zeros
     C     WSAVD         CHAIN     KODTAG                             31
     C  n31              Move      AGDFTR        DFTTRA
     C                   end
     C     WSPRO         IFNE      *zeros
     C     DFTTRA        OrNE      *zeros
     C                   exsr      GetSBel
     C     *IN63         Ifeq      *ON
     C                   Z-ADD     Sbel          WSFRAA
     C                   end
     c                   end
     C                   MOVE      *ZEROS        WSINHF
     C                   MOVE      *ZEROS        WSUTKF
     C                   MOVE      *ZEROS        WSFRJF
     C                   MOVE      *ZEROS        WSSUMF
     C                   MOVE      *ZEROS        WSINHA
     C                   MOVE      *ZEROS        WSUTKA
     C                   MOVE      *ZEROS        WSFRJA
     C                   MOVE      *ZEROS        WSSUMA
      * LINJER PÅ OPPDRAGET
      *    0. LINJE 0 (HOVEDFRAKT) ER ALT TATT MED I GRUNNLAG
      *    1. LINJER SOM SKAL INNGÅ I AVR.GRUNNLAGET...
      *    2. FRAKT-JUSTERING (=REDUKSJON AV AVR.GRUNNLAGET.)
     C     HEADFK        SETLL     FAKT
     C     HEADFK        READE(N)  FAKT                                   31
     C     *IN31         DOWEQ     '0'
     C     FALI          CABEQ     *ZEROS        NXLIN
      * TREKK UT ILINJER (LIGGER MED MINUS) PÅ HOVED-OPD FRA AVR.GRL
     C     TRSLAG        IFEQ      'HO'
     C     FASK          ANDEQ     'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSFRJA
     C                   GOTO      NXLIN
     C                   END
      * TREKK UT RESERVERT KODE "FRJ" FRA AVR.GRL
     C     FAVK          IFEQ      'FRJ'
     C     FASK          ANDEQ     'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSFRJA
     C                   GOTO      NXLIN
     C                   END
      * ANDRE LINJER SOM SKAL INNGÅ I GRUNNLAGET
     C     FAKDA         IFNE      'I'
     C     FAKDA         ANDNE     'K'
     C     KODGEA        CHAIN     KOGER                              31
     C  N31KGEAVR        IFEQ      'T'
     C                   ADD       FABELN        WSFRJF
     C                   ADD       FABELN        WSFRJA
     C                   END
     C                   END
     C     NXLIN         TAG
     C     HEADFK        READE(N)  FAKT                                   31
     C                   END
      *
      * HENT EVT. FORFRAKT VIA REKVISISJON.
     C                   MOVE      'FF'          XXSLAG
     C     TRIKEY        CHAIN(N)  HETRIU                             31
     C     *IN31         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN(N)  KOSBU                              31
     C     *IN31         IFEQ      '0'
     C                   ADD       BUBL          WSINHA
     C  N63              SUB       BUBL          WSFRAA
     C                   END
     C                   END
      * HENT EVT. VIDEREFR VIA REKVISISJON.
     C                   MOVE      'VF'          XXSLAG
     C     TRIKEY        CHAIN(N)  HETRIU                             31
     C     *IN31         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN(N)  KOSBU                              31
     C     *IN31         IFEQ      '0'
     C                   ADD       BUBL          WSUTKA
     C  N63              SUB       BUBL          WSFRAA
     C                   END
     C                   END
      *
      * HENT EVT. FORFRAKT M.M. VIA DUP
     C     TRAVD1        IFNE      *ZEROS
     C                   MOVE      TRAVD1        WSAVD1
     C                   MOVE      TROPD1        WSOPD1
     C     FFKEY         SETLL     FAKT
     C     FFKEY         READE(N)  FAKT                                   31
     C     *IN31         DOWEQ     '0'
      * AKKUMULER ILINJER (MEN IKKE STATISTISKE MOTLINJER-DUP PÅ DUP)
     C     FAKDA         IFNE      'K'
     C     FASK          IFEQ      'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSINHA
     C  N63              SUB       FABELN        WSFRAA
     C                   END
     C                   END
     C     FFKEY         READE(N)  FAKT                                   31
     C                   END
     C                   END
      * HENT EVT. VIDEREFR M.M. VIA DUP
     C     TRAVD2        IFNE      *ZEROS
     C                   MOVE      TRAVD2        WSAVD2
     C                   MOVE      TROPD2        WSOPD2
     C     VFKEY         SETLL     FAKT
     C     VFKEY         READE(N)  FAKT                                   31
     C     *IN31         DOWEQ     '0'
      * AKKUMULER ILINJER (MEN IKKE STATISTISKE MOTLINJER-DUP PÅ DUP)
     C     FAKDA         IFNE      'K'
     C     FASK          IFEQ      'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSUTKA
     C  N63              SUB       FABELN        WSFRAA
     C                   END
     C                   END
     C     VFKEY         READE(N)  FAKT                                   31
     C                   END
     C                   END
      * SUM MOT KUNDE..
     C     WSINHF        ADD       WSFRAF        WSSUMF
     C                   ADD       WSUTKF        WSSUMF
     C                   ADD       WSFRJF        WSSUMF
      * SUM AVR. GRUNNLAG.
     C  N63WSINHA        ADD       WSFRAA        WSSUMA
     C   63WSINHA        ADD       WSFRAF        WSSUMA
     C                   ADD       WSUTKA        WSSUMA
     C                   ADD       WSFRJA        WSSUMA
     C                   MOVE      WSFRJA        GMFRJA            7 0
     C                   MOVE      WSUTKA        GMUTKA            7 0
     C                   MOVE      WSKNFA        GMKNFA            8 0
      * ANDRE FELT EN FØLGE MED GML/NY - (TESTE KUN HVIS ENDRET)
     C  N90              MOVE      WSSNDN        GMSNDN           20
     C                   ENDSR
     C***********************************************
     C     GETGRUN       BEGSR
     C***********************************************
     C* BEREGN GRUNNPRIS ETTER G-TABELL
     C* (låner innparameter SONE for å indikerer G-pris-beregning.)
     C                   MOVE      *ZEROS        GRRAB
     C                   MOVE      *BLANKS       GRVAL             3
     C                   MOVE      'FRA'         GRGEB             3
     C                   MOVE      *ZEROS        GRBELØ           13 2
     C                   MOVE      *ZEROS        GRKUND            8 0
     C                   MOVE      HEAVD         GRAVD             4 0
     C                   MOVE      HEOPD         GROPD             7 0
     C                   MOVE      'G    '       GRSONE
     C                   CALL      'SYGE03'
     C                   PARM                    GRGEB
     C                   PARM                    GRAVD
     C                   PARM                    GROPD
     C                   PARM                    GRVAL
     C                   PARM                    GRBELØ
     C                   PARM                    GRSONE            5
     C                   PARM                    GRRAB             5 2
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    GRKUND
     C                   PARM                    GRavnr            9 0
     c                   parm                    atdum             1
     c     GRBELØ        ifne      *zeros
     C                   Z-ADD(H)  GRBELØ        WSFRAA
     C                   Z-ADD     WSFRAA        GRBELØ
     c                   end
     C                   ENDSR
     C***********************************************
     C     PROV          BEGSR
     C***********************************************
     C     TRABK         KLIST
     C                   KFLD                    YYTNR
     C                   KFLD                    YYLIN
     C     *LIKE         DEFINE    TBFIRM        YYTNR
     C     *LIKE         DEFINE    TBLIN         YYLIN
     C                   MOVE      *ZEROS        YYLIN
     c                   move      VMTRAN        YYTNR
      *
     C     PROVSTR       TAG
     C     TRABK         SETLL     TRAB
     C     YYTNR         READE     TRAB                                   33
     C     *IN33         DOWEQ     '0'
     C     YYTNR         IFEQ      *ZEROS                                       KUN VED GENERELL..
     C     TBTKAT        ANDNE     *BLANKS                                      *KATEGORI
     C     TBTKAT        ANDNE     VMTKAT                                       (MEDLEM/IKKE
     C                   GOTO      NESTE                                         M.M....)
     C                   END
     C     TBUNIT        IFNE      *BLANKS                                      KUN BILNR...
     C     TBUNIT        ANDNE     TUBILN
     C                   GOTO      NESTE
     C                   END
     C     TBAVD         IFNE      *ZEROS                                       KUN AVDELING..
     C     TBAVD         ANDNE     WSAVD
     C                   GOTO      NESTE
     C                   END
     C     TBGEB         IFNE      *BLANKS                                      KUN GEBYR...
     C     TBGEB         ANDNE     'FRA'
     C                   GOTO      NESTE
     C                   END
     C     TBLK          IFNE      *BLANKS                                      KUN LANDKODE..
     C* INNLAND - BEGGE KODER MÅ MATCHE
     C     TBLK          IFEQ      FILAND
     C     TBLK          IFNE      WPLANF                                           FRA
     C     TBLK          ORNE      WPLANT                                           TIL
     C                   GOTO      NESTE
     C                   END
     C                   ELSE
     C* IMP/EKSP- ENTEN FRA ELLER TIL MÅ MATCHE...
     C     TBLK          IFNE      WPLANF                                           FRA
     C     TBLK          ANDNE     WPLANT                                           TIL
     C                   GOTO      NESTE
     C                   END
     C                   END
     C                   END
     C     TBOPTY        IFNE      *BLANKS                                      KUN BILNR...
     C     TBOPTY        ANDNE     WSOT
     C                   GOTO      NESTE
     C                   END
     C     TBVKTT        IFNE      *ZEROS                                       KUN Vekt T.o.m..
     C     TBVKTT        ANDLT     WSFBV
     C                   GOTO      NESTE
     C                   END
     C*    TBDATE        IFLT      TUDT                                         UTLØPT DATO...
     C*                  GOTO      NESTE
     C*                  END
     C* OK!! - Er gjennom alle testene - gyldig prov.linje er funnet.....
     C                   GOTO      ENDPRO
     C***
     C* Kommer hit når ett av vilkårene ikke ble oppfylt
     C     NESTE         TAG
     C     YYTNR         READE     TRAB                                   33
     C  N33              END
     C* GÅR UT HER - HAR IKKE FUNNET PROV
     C     YYTNR         IFNE      *ZEROS
     C                   MOVE      *ZEROS        YYTNR
     C                   GOTO      PROVSTR
     C                   END
     C***  IKKE FUNNET
     C                   MOVE      *ZEROS        TBPRO
     C***
     C     ENDPRO        ENDSR
     C*
     C***********************************************
     C     GETSBel       BEGSR
     C***********************************************
     C                   move      *zeros        Sbel             13 2
     C     TUKNT2        IFNE      *ZEROS
     C                   MOVE      TUKNT2        USKNT             8 0
     C                   ELSE
     C                   MOVE      DFTTRA        USKNT             8 0
     C                   END
     C                   MOVE      USKNT         TRANUM
     C     TRAKEY        CHAIN     TRAN                               31
     C     *IN33         IFEQ      *OFF
     C     VMINCR        IFEQ      4
     C     VMINCR        OREQ      5
     C                   move      *ON           *IN63
     C                   MOVE      'J'           UMID              1
     C                   call      'SYTR12AS'
     C                   parm                    HEAVD
     C                   parm                    HEOPD
     C                   PARM                    HEPRO
     C                   PARM                    VMTRAN
     C                   PARM                    VMTRKU
     C                   PARM                    VMTRLE
     C                   PARM                    VMINCR
     C                   PARM                    UMID
     C                   PARM                    SBEL
     C                   PARM                    UBNR              7 0
     C* når det IKKE er på send niv| - vis evt GR-pris med fratrekk for provisj.sats
     C                   else
     C     GRBELØ        IFne      *zeros
     C     VMINCR        andeq     0
     c                   exsr      PROV
     C     TBPRO         IFNE      *ZEROS
     C     100           SUB       TBPRO         XPRFAK            7 4
     C                   DIV       100           XPRFAK
     C     GRBELØ        MULT(H)   XPRFAK        XXXTMP            9 0
     C                   z-add     xxxTMP        Sbel
     C                   move      *ON           *IN63
     C                   end
     C                   end
     C                   END
     C                   END
     C                   CLEAR                   TUKNT2
     C                   ENDSR
     C***********************************************
     C     CHGBEL        BEGSR
     C***********************************************
      * UTFØRES UMIDDELBART ETTER!!! VISNING AV BILDE22.
     C     WSFRJA        IFNE      GMFRJA
     C                   EXSR      OPDILI
     C                   END
     C     WSUTKA        IFNE      GMUTKA
     C     WSKNFA        ORNE      GMKNFA
     C                   EXSR      OPDUTK
     C                   END
     C                   ENDSR
     C***********************************************
     C     OPDILI        BEGSR
     C***********************************************
     C                   SETOFF                                       31
     C     WSFRJA        SUB       GMFRJA        DIFRJA            7 0
     C     HEADFK        SETLL     FAKT
     C     *IN31         DOWEQ     '0'
     C     HEADFK        READE(N)  FAKT                                   31
     C     *IN31         IFEQ      '1'
      * SLUTT
      * LAG NY POST
     C                   CLEAR                   FAKTR
     C                   MOVE      'I'           FASK
     C                   MOVE      WSAVD         FAAVD
     C                   MOVE      WSAVD         FAAVDR
     C                   MOVE      WSOPD         FAOPD
     C                   MOVE      'FRA'         FAVK
     C                   MOVE      'NOK'         FAVAL
     C                   MOVE      'NOK'         FACU33
     C                   MOVE      'N'           FAKDM
     C                   MOVE      'M'           FAKDA
     C                   ADD       DIFRJA        FABELN
     C                   ADD       DIFRJA        FABELV
     C                   CALL      'SYGE06'
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FALI
     C                   WRITE     FAKTR
     C                   ELSE
     C     FALI          IFNE      *ZEROS
     C     FASK          ANDEQ     'I'
     C     FAKDA         ANDNE     'I'
     C     FAVK          ANDEQ     'FRA'
     C     FAAVDR        ANDEQ     FAAVD
     C                   MOVE      FALI          XXFALI
     C     XXFAKE        CHAIN     FAKT                               31
     C     *IN31         IFEQ      '0'
     C                   ADD       DIFRJA        FABELN
     C                   ADD       DIFRJA        FABELV
     C                   UPDATE    FAKTR
     C                   MOVE      *ZEROS        XXFALI
     C                   GOTO      UTLINI
     C                   END
     C                   END
     C                   END
     C                   END
     C     UTLINI        ENDSR
      *
     C***********************************************
     C     OPDUTK        BEGSR
     C***********************************************
     C                   SETOFF                                       31
     C                   MOVE      'N'           DIUTOK            1
     C     WSUTKA        SUB       GMUTKA        DIUTKA            7 0
     C                   MOVE      'VF'          XXSLAG
     C     TRIKEY        CHAIN(N)  HETRIU                             31
     C     *IN31         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN     KOSBU                              31
     C     *IN31         IFEQ      '0'
     C     BUST          IFEQ      ' '
     C     BUBLST        ANDEQ     'T'
     C                   ADD       DIUTKA        BUBL
     C     WSKNFA        IFNE      GMKNFA
     C     WSKNFA        CHAIN     KODTAG1                            31
     C  N31              MOVE      AGTRNR        BUTNR
     C                   END
     C                   MOVE      'J'           DIUTOK
     C                   END
     C                   UPDATE    KOSBUR
     C                   END
     C                   END
      * FANT IKKE... FEILMELDING.
     C     DIUTOK        IFEQ      'N'
     C     *IN30         ANDEQ     '0'
     C                   SETON                                        30
     C                   MOVE      'JOV1214'     MSGNR
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     73            POSNBR
     C                   END
     C                   ENDSR
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C                   MOVE      'DIV0000'     MSGNR
     C                   MOVE      'N'           XKOPI             1
     C                   MOVE      ' '           GMST              1
      * BOOKING UNDERVEIS I OVERSJØSYSTEM - FERRE TESTER
     C                   MOVE      'N'           OVBOOK            1
     C     WSOPD         IFNE      0
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   IF        *IN33 = *OFF
     C     HEOT          SCAN      PAVRDA                                 33
     C                   IF        *IN33
     C     HEADFK        CHAIN(N)  TRACKT                             33
     C  N33              IF        TXATAD = 0
     C                   MOVE      'J'           OVBOOK
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C* HENT AVDELINGSVERDIER
     C     KODTAK        CHAIN     KOAR                               98
     C     KODTVK        CHAIN     KOVR                               98
     C* POSTNUMMERBASERT FRAKTANGIVELSE ???
     C     KOAPOS        COMP      'J'                                    42
     C* GAMMEL??
     C                   MOVE      'GM'          XNYGML
     C* NY
     C     WSOPD         IFEQ      0
     C                   MOVE      'NY'          XNYGML
     C* Kopiering
     C   28HEADKK        CHAIN(N)  HEADF                              33
     C   28HEOPD         IFLT      0
     C                   MOVE      'J'           XKOPI
     C                   MOVE      HEAVD         XKAVD             4 0
     C                   MOVE      HEOPD         XKOPD             7 0
     C                   END
     C   28              EXSR      MOVHFW
     C   28              EXSR      TESTKU
     C   28              EXSR      SRSTED
     C* Fra bunnen..(ordinær eller "mønster/mal-ordre")
     C  N28              EXSR      MOVB1
     C                   ELSE
     C* ENDRING
     C* DUPOPPDRAG SKAL TAS OVER AV FØRSTE PERSON SOM GÅR INNPÅ DET
     C* DET SAMME GJELDER EDI-OPPDRAG SOM IKKE ER BEHANDLET VED MOTTAK
     C     HEADFK        CHAIN     HEADF                              33
     C  N33HEST          IFEQ      'X'
     C                   UPDATE    HEADFR
     C                   EXFMT     STATFEIL
     C                   CLOSE     SYTR10FM
     C                   RETURN
     C                   END
     C  N33HESG          IFEQ      'DUP'
     C     HESG          OREQ      'EDI'
     C     HESG          OREQ      'WEB'
     C     HESG          OREQ      '   '
     C                   MOVE      WSSG          HESG
     C                   END
     C  N33WSSG          IFNE      HESG
     C                   MOVE      HESG          WSSG
     C                   MOVE      'YBC0036'     MSGNR
     C                   END
     C  N33              MOVE      HEST          GMST              1
     C  N33              MOVE      'X'           HEST
     C  N33              UPDATE    HEADFR
     C                   EXSR      MOVHFW
     C                   EXSR      MOVFVW
     C                   EXSR      TESTKU
     C                   EXSR      SRSTED
     C                   END
     C* SØRG FOR IKKE RETUR TIL BILDE 1 VED FEIL PÅ KUNDE/STED BILDE2
     C                   MOVE      *OFF          *IN30
     C*
     C     SLT1          ENDSR
     C*
      ***********************************************
     C     SØKING        BEGSR
      ***********************************************
     C     WSKNA         IFEQ      0
     C     WSNAA         ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNA
     C                   PARM                    FIFIRM
     C                   PARM                    WSNAA
     C                   END
      *
     C     WSKNSF        IFEQ      0
     C     WSNASF        ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNSF
     C                   PARM                    FIFIRM
     C                   PARM                    WSNASF
     C                   END
      *
     C     WSKNKF        IFEQ      0
     C     WSNAKF        ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNKF
     C                   PARM                    FIFIRM
     C                   PARM                    WSNAKF
     C                   END
      *
     C     WSKNFA        IFEQ      0
     C     WSNAFA        ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNFA
     C                   PARM                    FIFIRM
     C                   PARM                    WSNAFA
     C     INNLAN        IFEQ      'J'
     C     INFULL        ANDNE     'J'
     C     WSOPD         ANDNE     *ZEROS
     C     WSKNFA        ANDNE     *ZEROS
     C     WSKNFA        ANDNE     GMKNFA
     C                   EXSR      OPDUTK
     C                   END
     C                   END
      *
     C     WSKNS         IFEQ      0
     C     WSNAMS        ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNS
     C                   PARM                    FIFIRM
     C                   PARM                    WSNAMS
     C                   END
      *
     C     WSKNK         IFEQ      0
     C     WSNAMK        ANDNE     *BLANKS
     C                   CALL      'SOEKKUN'
     C                   PARM                    WSKNK
     C                   PARM                    FIFIRM
     C                   PARM                    WSNAMK
     C                   END
     C*FINN LEV.ADR VIA KUNDENS KUNDENUMMER  (I VADR..)
     C     WSSTJ1        IFEQ      '*'
     C                   EXSR      SOKUKU
     C                   END
      * FINN LEV.ADR VIA KUNDEREGISTER (VED AVVIK FRA KJØPER..)
     C     WSNAKA        IFEQ      'K*'
     C                   EXSR      SOKUVA
     C                   END
      *
     C   42WPSDF         IFEQ      *BLANKS
     C     WPPNS1        ANDNE     *BLANKS
     C                   MOVE      *BLANKS       USØKPN
     C                   MOVEL     WPPNS1        USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDF
     C                   PARM                    USØKPN
     C                   PARM                    WPLANF
     C                   MOVEL     USØKPN        WPPNS1
     C                   END
      *
     C   42WPSDT         IFEQ      *BLANKS
     C     WPPNS2        ANDNE     *BLANKS
     C                   MOVE      *BLANKS       USØKPN
     C                   MOVEL     WPPNS2        USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDT
     C                   PARM                    USØKPN
     C                   PARM                    WPLANT
     C                   MOVEL     USØKPN        WPPNS2
     C                   END
      *
     C   42WPSDFF        IFEQ      *BLANKS
     C     WPPNS3        ANDNE     *BLANKS
     C                   MOVE      *BLANKS       USØKPN
     C                   MOVEL     WPPNS3        USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDFF
     C                   PARM                    USØKPN
     C                   PARM                    WPLAN1
     C                   MOVEL     USØKPN        WPPNS3
     C                   END
      *
     C   42WPSDVT        IFEQ      *BLANKS
     C     WPPNS4        ANDNE     *BLANKS
     C                   MOVE      *BLANKS       USØKPN
     C                   MOVEL     WPPNS4        USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDVT
     C                   PARM                    USØKPN
     C                   PARM                    WPLAN2
     C                   MOVEL     USØKPN        WPPNS4
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     TESTB2        BEGSR
     C***********************************************
     C                   MOVE      'DIV0000'     MSGNR
     C     WSSG          IFEQ      *BLANKS
     C                   MOVE      USG           WSSG
     C                   END
      *
     C     INNLAN        IFEQ      'J'
     C     WSSNDN        IFEQ      '*'
     C                   CALL      'SYGE15'
     C                   PARM                    WSSNDN
     C                   END
     C     WSSNEA        IFEQ      '*D*'
     C                   SETOFF                                       90
     C                   GOTO      SKIPSN
     C                   END
      *GAMMELT KORT NUMMER ELLER LANGT...
      * 9 SIFFER ER GITT - BEREGN KONTR.SIFFER
     C     WSSN9A        IFNE      *BLANKS
     C     WSSN9B        ANDEQ     *BLANKS
     C     WSSN9C        ANDEQ     *BLANKS
     C                   TESTN                   WSSN9A               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      *ZEROS        XBAK              1 0
     C                   MOVE      *ZEROS        UPAR21           21
     C                   MOVE      WSSN9A        UPAR21
     C                   CALL      'SYGE09'
     C                   PARM                    UPAR21
     C                   PARM                    XBAK
     C                   MOVE      XBAK          WSSN9B
     C                   END
     C                   END
     C                   MOVE      '0'           SNFLAG
      * FORMAT PÅ SEND.NR TESTES KUN VED NY OG VED ENDRET VERDI..
     C     WSOPD         IFNE      *ZEROS
     C     WSSNDN        ANDEQ     GMSNDN
     C                   GOTO      SKIPSN
     C                   END
      * OPD = 0 ELLER SENDNR ER ENDRET.. TEST.
     C     WSSNDN        COMP      *BLANKS                                90
      * KORT NR - TEST MODULUS 10.
     C     *IN90         IFEQ      *OFF
     C     WSSN9C        ANDEQ     *BLANKS
     C                   TESTN                   WSSN9A               33
     C     *IN33         IFEQ      '0'
     C                   SETON                                            90
     C                   ELSE
     C                   MOVE      *ZEROS        XBAK              1 0
     C                   MOVE      *ZEROS        UPAR21           21
     C                   MOVE      WSSN9A        UPAR21
     C                   CALL      'SYGE09'
     C                   PARM                    UPAR21
     C                   PARM                    XBAK
     C                   MOVE      XBAK          XBAKA             1
     C     WSSN9B        COMP      XBAKA                              9090
     C                   END
     C                   END
      * LANGT NR - TEST EAN KTRL-SIFFER (3 FØRSTE KAN VÆRE 401/402)
     C     *IN90         IFEQ      *OFF
     C     WSSN9C        ANDNE     *BLANKS
     C                   TESTN                   WSSNDN               33
     C     *IN33         IFEQ      '0'
     C                   SETON                                            90
     C                   ELSE
      * TEST KONTROLLSIFFER
     C                   MOVE      *ZEROS        UAN22            22
     C                   MOVE      WSSN17        UAN22            22
     C                   MOVE      '0'           UAN22
     C                   CALL      'SYGE08'
     C                   PARM                    UAN22
     C                   MOVE      UAN22         UFN17            17
     C                   MOVE      UFN17         XBAKA
     C     WSSN20        COMP      XBAKA                              9090
     C     *IN90         IFEQ      '0'
     C     WSSNEA        COMP      '401'                              9090
     C   90WSSNEA        COMP      '402'                              9090
     C                   END
     C                   END
     C                   END
      * SKAL IKKE VÆRE BRUKT FØR... (MEN 402-NR ER FELLES FOR FLERE)
     C     *IN90         IFEQ      '0'
     C     WSSNEA        ANDNE     '402'
     C                   MOVE      WSSNDN        SNSNDN           20
     C                   MOVE      WSAVD         SNDAVD            4 0
     C                   MOVE      WSOPD         SNDOPD            7 0
     C                   MOVE      '0'           SNFLAG            1
     C                   CALL      'SYTR10C'
     C                   PARM                    SNSNDN
     C                   PARM                    SNDAVD
     C                   PARM                    SNDOPD
     C                   PARM                    SNFLAG
     C     SNFLAG        COMP      '1'                                    90
     C                   END
      *
     C     SKIPSN        TAG
     C   90              SETON                                        30
      * FINNE AVD??
     C     WSOPD         IFEQ      *ZEROS
     C     INNLIU        IFEQ      'U'
     C                   MOVEL     WPSDT         TSTPNR            4
     C                   ELSE
     C                   MOVEL     WPSDF         TSTPNR            4
     C                   END
     C                   TESTN                   TSTPNR               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TSTPNR        NUMPNR
      * FINN AVD
      * OM DET FINNES I NOPNR SÅ BRUK DET
     C     KODRIK        CHAIN     NOPNR                              33
     C     *IN33         IFEQ      *OFF
     C     NOAVDU        ANDNE     *ZEROS
     C     NOAVDI        ANDNE     *ZEROS
     C                   MOVE      NOAVDU        RIAVDU
     C                   MOVE      NOAVDI        RIAVDI
     C                   goto      AvdOK
     C                   END
     C     KODRIK        SETGT     KODTRI
     C     RITERM        READPE    KODTRI                                 33
     C  N33NUMPNR        IFGE      RIPNRF
     C     NUMPNR        ANDLE     RIPNRT
     C     AvdOk         Tag
     C     INNLIU        IFEQ      'U'
     C                   MOVE      RIAVDU        WSAVD
     C     WSTSTA        IFNE      'N'
     C     WSAVD         CHAIN     KODTAG                             33
     C  N33AGTRNR        comp      *zeros                                 33
     C  N33              MOVE      'J'           WSTSTA
     C   33              MOVE      ' '           WSTSTA
     C                   END
     C                   ELSE
     C                   MOVE      RIAVDI        WSAVD
     C                   END
     C                   ENDIF
      *
     C                   END
     C                   ELSE
      * OPPDR.NR (OG AVD) ER GITT V. INNLAND..
     C                   SELECT
      * ENDRET TIL 'N' I AGENTKODE = FJERN VIA2. M.M.
     C     WSTSTA        WHENEQ    'N'
     C     GMTSTA        ANDNE     'N'
     C                   EXSR      FJVIA2
      * ENDRET TIL 'J' I AGENTKODE = SETT VIA2. M.M.
     C     WSTSTA        WHENEQ    'J'
     C     GMTSTA        ANDNE     'J'
     C                   EXSR      OPDHEA
     C                   EXSR      STVIA2
      * ENDRET TIL 'R' (FRA J) I AGENTKODE = REFRESH PRIS
     C     WSTSTA        WHENEQ    'R'
     C                   EXSR      OPDHEA
     C                   EXSR      STVIA2
     C                   MOVE      'J'           WSTSTA
     C                   ENDSL
     C                   END
     C                   END
      *
     C     WSAVD         IFEQ      0
     C     INNLAN        IFEQ      'N'
     C                   MOVE      UAVD          WSAVD
     C                   END
     C                   ELSE
     C     KODTAK        CHAIN     KOAR                               33
     C  N33KODTVK        CHAIN     KOVR                               33
     C   33              DO
     C                   MOVE      UAVD          WSAVD
     C     KODTAK        CHAIN     KOAR                               33
     C     KODTVK        CHAIN     KOVR                               33
     C                   END
     C     KOAPOS        COMP      'J'                                    42
     C                   END
     C*
      * KOPIERE EN SLETTET??
     C     WSOPD         IFEQ      *ZEROS
     C     WSNAS         ANDEQ     SLTTXT
     C                   MOVE      *BLANKS       WSNAS
     C                   END
     C*** TEST OPDGI, TRANSPORTØR, SELGER OG KJØPER
     C                   EXSR      TESTKU
     C*
     C* TESTER KODE FAKTURAMOTAGGER
     C*
     C     WSKDFF        IFNE      'S'
     C     WSKDFF        ANDNE     'K'
     C                   SETON                                        9330
     C                   END
     C
      * TESTER OPPDRAGSGIVERS REF
     C*
     C     WSRFA         COMP      *BLANKS                                59
     C   59              SETON                                        30
     C*
     C* VED BLANK MVAKODE - DEFAULT : J OM BEGGE DEST=NO / ELLERS N
     C                   MOVE      'J'           XXMVA             1
     C*
     C*** TEST ALLE DESTINASJONER
     C*
     C                   EXSR      SRSTED
     C*
     C*** TEST DATO FRA    IND 60
     C  N37WSSDFD        IFNE      *ZEROS
     C     WSSDFD        IFLT      3999
     C                   MOVE      WSSDFD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSDFD
     C                   END
     C                   MOVE      WSDTD1        UDT1              2 0
     C                   MOVE      WSDTM1        UDT2              2 0
     C                   MOVE      WSDTÅ1        UDT3              2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      60
     C   60              SETON                                        30
     C                   ELSE
S03  C*    OVBOOK        IFEQ      'N'
     C                   SETON                                        3060
S03  C*                  END
     C                   END
     C*
     C* TESTER KLOKKESLETT
     C     WSSDFK        IFNE      *ZEROS
     C     WSSDFK        IFGT      2400
     C                   SETON                                        3072
     C                   END
     C                   END
     C*** TEST DATO TIL    IND 64
     C  N37WSSDTD        IFNE      *ZEROS
     C     WSSDTD        IFLT      3999
     C                   MOVE      WSSDTD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSDTD
     C                   END
     C                   MOVE      WSDTD2        UDT1              2 0
     C                   MOVE      WSDTM2        UDT2              2 0
     C                   MOVE      WSDTÅ2        UDT3              2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      64
     C  N64UDATOB        COMP      UDATOA                               64
     C   64              SETON                                        30
     C                   ELSE
S03  C*    OVBOOK        IFEQ      'N'
     C                   SETON                                        3064
S03  C*                  END
     C                   END
     C*
     C*
     C* TESTER KLOKKESLETT
     C     WSSDTK        IFNE      *ZEROS
     C     WSSDTK        ANDGT     2400
     C                   SETON                                        3073
     C                   END
     C*
     C*** TEST TILLEGGS FRAKT
     C     WSVALT        IFNE      *BLANKS
     C     KODGEK        CHAIN     KOGER                              76
     C   76              SETON                                        30
     C                   END
      *
      * tilleggsgebyr
      *
N04  C                   MOVE      'N'           FEILTI            1
     c     wtgx          ifne      *blanks
     c     1             do        5             NR
N04  C     WTG(NR)       ifne      *blanks
N04  C                   EVAL      YKFTYP = 'AVTTIL'
N04  C                   EVAL      KFKOD = WTG(NR)
N04  C     KUFASK        CHAIN     KUFAST                             33
N04  C   33              MOVE      'J'           FEILTI            1
N04  C   33              seton                                        30
N04  C                   ENDIF
N04  C                   ENDDO
N04  C                   ENDIF
     C*
     C*** HENTE LOSSESTED
     C     WSSDL2        IFEQ      *BLANKS
     C     KODTEK        CHAIN     KOTMR                              33
     C  N33              MOVE      KOTMNV        WSSDL
     C                   END
     C*** HENTE LasteSTED
     C     WSSDLA2       IFEQ      *BLANKS
     C     KODTEK2       CHAIN     KOTMR                              33
     C  N33              MOVE      KOTMNV        WSSDLA
     C                   END
     C*
     C*
     C*** TEST DATO FORFRA IND 69
     C     WSSFFD        IFEQ      *ZEROS
     C     WSSDFF        ANDNE     *BLANKS
     C     WSSDFD        ANDNE     *ZEROS
     C     *IN60         ANDNE     '1'
     C                   MOVE      WSSDFD        WSSFFD
     C                   END
     C     WSSFFD        IFNE      *ZEROS
     C     WSSFFD        IFLT      3999
     C                   MOVE      WSSFFD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSFFD
     C                   END
     C                   MOVE      WSDTD3        UDT1              2 0
     C                   MOVE      WSDTM3        UDT2              2 0
     C                   MOVE      WSDTÅ3        UDT3              2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      69
     C  N69UDATOC        COMP      UDATOA                               69
     C  N69UDATOC        COMP      UDATOB                             69
     C   69              SETON                                        30
     C                   END
     C*
     C* TESTER KLOKKESLETT FORFRAKT
     C*
     C     WSSFFK        IFNE      *ZEROS
     C     WSSFFK        IFGT      2400
     C                   SETON                                        3074
     C                   END
     C                   END
     C*
     C*
     C* TESTER KODE FORFRAKT REKVIRERES
     C*
     C     WSSTAF        IFNE      ' '
     C     WSSTAF        ANDNE     'R'
     C     WSSTAF        ANDNE     'F'
     C     WSSTAF        ANDNE     'A'
     C     WSSTAF        ANDNE     'O'
     C                   SETON                                        3048
     C                   END
     C*
     C*** TEST DATO VIDERRE ND 71
     C*
     C     WSSVTD        IFEQ      *ZEROS
     C     WSSDVT        ANDNE     *BLANKS
     C     WSSDTD        ANDNE     *ZEROS
     C     *IN64         ANDNE     '1'
     C                   MOVE      WSSDTD        WSSVTD
     C                   END
     C     WSSVTD        IFNE      *ZEROS
     C     WSSVTD        IFLT      3999
     C                   MOVE      WSSVTD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSVTD
     C                   END
     C                   MOVE      WSDTD4        UDT1              2 0
     C                   MOVE      WSDTM4        UDT2              2 0
     C                   MOVE      WSDTÅ4        UDT3              2 0
     C                   CALL      'TESTDATO'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   PARM                    UFLAGG            1 0
     C     UFLAGG        COMP      1                                      71
     C  N71UDATOD        COMP      UDATOB                             71
     C  N71UDATOD        COMP      UDATOA                               71
     C   71              SETON                                        30
     C                   END
     C*
     C* TESTER KLOKKESLETT  VIDERFRAKT
     C*
     C     WSSVTK        IFNE      *ZEROS
     C     WSSVTK        IFGT      2400
     C                   SETON                                        3075
     C                   END
     C                   END
     C*
     C* TESTER KODE VIDEREFRAKT REKVIRERES
     C*
     C     WSSTAE        IFNE      ' '
     C     WSSTAE        ANDNE     'R'
     C     WSSTAE        ANDNE     'F'
     C     WSSTAE        ANDNE     'A'
     C     WSSTAE        ANDNE     'O'
     C                   SETON                                        3047
     C                   END
     C* AGENT / SELGER / KJØPER ER TESTET I EGNE SR LENGER OPPE.
      * SETTING AV IND 30 FJERNET FRA TESTKU.
     C     *IN61         IFEQ      '1'
     C     *IN62         OREQ      '1'
     C     *IN67         OREQ      '1'
     C     *IN68         OREQ      '1'
     C     *IN82         OREQ      '1'
     C                   MOVE      *ON           *IN30
     C                   END
     C*
     C     INNLAN        IFEQ      'J'
     C     WSOT          ANDEQ     *BLANKS
     C     WSVKT         IFNE      *ZEROS
     C     WSM3          ORNE      *ZEROS
     C     WSLM          ORNE      *ZEROS
     C                   EXSR      FINNVK
     C     WSFBV         IFLE      IFOTVG
     C                   MOVEL     IFOTHO        WSOT
     C                   ELSE
     C                   MOVEL     IFO2HO        WSOT
     C                   END
     C     TRSLAG        IFEQ      'FF'
     C     WSFBV         IFLE      IFOTVG
     C                   MOVEL     IFOTFF        WSOT
     C                   ELSE
     C                   MOVEL     IFO2FF        WSOT
     C                   END
     C                   END
     C     TRSLAG        IFEQ      'VF'
     C     WSFBV         IFLE      IFOTVG
     C                   MOVEL     IFOTVF        WSOT
     C                   ELSE
     C                   MOVEL     IFO2VF        WSOT
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C*** TEST OPPDRAGSTYPE
     C*
     C     KODOTK        CHAIN     KOOTYR                             89
     C   89              SETON                                        30
     C  N89OAVTKS        CHAIN     OAVT                               33
     C  N89
     CANN33              MOVE      OAOT          WSOT
     C*
     C     INNLAN        IFEQ      'J'
     C     WSFR          ANDEQ     *BLANKS
     C                   MOVEL     IFFRHO        WSFR
     C     TRSLAG        IFEQ      'FF'
     C                   MOVEL     IFFRFF        WSFR
     C                   END
     C     TRSLAG        IFEQ      'VF'
     C                   MOVEL     IFFRVF        WSFR
     C                   END
     C                   END
     C*
     C*** TEST FRANKATUR
     C*
     C     OVBOOK        IFEQ      'N'
     C     KODFRK        CHAIN     KOFRR                              88
     C   88              SETON                                        30
     C                   END
     C*
     C*** TEST ANTALL KOLLI
     C*
     C*    WSNT          COMP      0                                      87
     C     WSANT1        COMP      0                                      87
     C   87              SETON                                        30
     C*
     C*** TEST ENHET/VARESLAG
     C*
     C     INNLAN        IFEQ      'J'
     C     WSVS1         ANDEQ     *BLANKS
     C                   MOVEL     'KLL'         WSVS1
     C                   END
     C*    WSVS1         COMP      *BLANKS                                86
     C     WSVT1         COMP      *BLANKS                                86
     C   86              SETON                                        30
     C*
     C                   SETOFF                                           85
     C*
     C*** TEST ANTALL VEKT, MEN KUN VED REN INNLAND
     C*
     C     INNLAN        IFEQ      'J'
     C     WSVKT         COMP      0                                      85
     C   85              SETON                                        30
     C                   Else
     C     WSFRAB        IFne      *zeros
     C*    WSVKT         COMP      0                                      85
     C     WSVKT1        COMP      0                                      85
     C   85WSM3          COMP      0                                      85
     C   85WSLM          COMP      0                                      85
     C   85              SETON                                        30
     C                   END
     C                   END
     C*
     C*** HENTE UTLEVERINGSFORBEHOLD
     C*
     C     WSKF          IFNE      '  '
     C     WSKF          CHAIN     KODTU                              40
     C   40
     CANN30              MOVE      'YBC0487'     MSGNR
     C   40              SETON                                        30
     C  N40WSFT1A        IFEQ      *BLANKS
     C                   MOVE      KUTX          WSFT1A
     C                   END
     C  N40WSKFT1        IFEQ      ' '
     C                   MOVE      KUKD2         WSKFT1
     C                   END
     C                   END
      *
sh   C*** 8=Farlig gods opsjon
      *
     c     wsopd         ifne      0
     c                   move      WSavd         fvavd
     c                   move      WSopd         fvopd
     C                   Z-ADD     1             FVFBNR
     c     1             do        3             NR
     C     FST(NR)       IFEQ      '8'
     C     FST(NR)       OREQ      '6'
     C                   Z-ADD     NR            FVLINR
     C     DOKUFVK       chain     dokufv                             33
     c     *in33         ifeq      '0'
     C     FST(NR)       IFEQ      '8'
     C                   CALL      'SYFA10D'
     C                   PARM                    FVAVD
     C                   PARM                    FVOPD
     C                   PARM                    FVFBNR
     C                   PARM                    FVLINR
     C                   PARM                    UVIS              1
     c                   end
     C     FST(NR)       IFEQ      '6'
     C                   CALL      'SYFA10B'
     C                   PARM                    FVAVD
     C                   PARM                    FVOPD
     C                   PARM                    FVFBNR
     C                   PARM                    FVLINR
     C                   PARM                    UVIS              1
     c                   end
     C                   EXSR      MOVFVW
     c                   move      *blanks       FST(NR)
     c                   ENDIF
     c                   ENDIF
     c                   ENDDO
     c                   endif
      *
SH    * test farlig godslinjer
      *
     c                   MOVE      'N'           FEILADR           1
     c                   movea     *blanks       FST
     c     1             do        3             NR
     c     FUN(NR)       ifne      *blanks
     c                   movel     FUN(NR)       FFUNNR
     c                   movel     FEM(NR)       FFEMBG
     C     UnNrKeyF      chain     ADRUNNRF                           33
     c   33              seton                                        30
     c                   MOVE      'J'           FEILADR           1
     c   33              move      '*'           FST(NR)
     c                   endif
     C                   ENDDO
      *
      *** TEST OM UTLEVERINGSFORBEHOLD ER AKTIV
     C                   MOVEL     WSKFT1        XKFKOD
     C     KOFASK        CHAIN     KOFAST                             39
     C   39
     CANN30              MOVE      'YBC0488'     MSGNR
     C   39              SETON                                        30
     C*** TEST OM PRODUKTSKODE
     C     *IN42         IFEQ      '1'
     C                   MOVEL     WSKDPL        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C     KUFASK        CHAIN     KUFAST                             96
     C  N30*IN96         IFEQ      '1'
     C                   MOVE      'YBC0360'     MSGNR
     C                   SETON                                        30
     C                   END
     C                   END
     C*
     C* TESTER VALUTAKODE/BELØP VAREVERDI
     C*
     C     WSVERB        IFNE      *ZEROS
     C     WSVERV        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSVERV
     C                   END
     C                   END
     C     WSVERV        IFNE      *BLANKS
     C     VALKE1        CHAIN     VALUL01                            49
     C   49              SETON                                        30
     C* BELØP MÅ VÆRE UTFYLLT
     C     WSVERB        IFEQ      *ZEROS
     C                   SETON                                        5630
     C                   END
     C                   END
     C*
     C* TESTER VALUTAKODE/BELØP ETTERKRAV
     C*
     C     WSETTB        IFNE      *ZEROS
     C     WSETTV        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSETTV
     C                   END
     C                   END
     C     WSETTV        IFNE      *BLANKS
     C     VALKE2        CHAIN     VALUL01                            55
     C   55              SETON                                        30
     C* BELØP MÅ VÆRE UTFYLLT
     C     WSETTB        IFEQ      *ZEROS
     C                   SETON                                        5430
     C                   END
     C                   END
     C*
     C* TESTER VALUTAKODE/BELØP FRAKT
     C* LEGGER ALLTID INHOUSE-KODE INN
     C*
     C*
     C     WSFRAV        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSFRAV
     C                   END
     C*
     C* KODE KAN KUN VÆRE A/E/M/N/
     C*
     C     WSFRAK        IFNE      'A'
     C     WSFRAK        ANDNE     'B'
     C     WSFRAK        ANDNE     'E'
     C     WSFRAK        ANDNE     'M'
     C     WSFRAK        ANDNE     'N'
     C     WSFRAK        ANDNE     ' '
     C                   SETON                                        3053
     C                   END
     C*
     C* VALUTAKODE MÅ VÆRE GYLDIG
     C*
     C     VALKE3        CHAIN     VALUL01                            52
     C   52              SETON                                        30
     C*
     C* BELØP MÅ VÆRE UTFYLLT
     C*
     C     WSFRAB        IFEQ      *ZEROS
     C     WSFRAK        ANDEQ     'E'
     C                   SETON                                        5130
     C                   END
     C*
     C* BELØP FOR STORT
     C*
     C     INNLAN        IFEQ      'N'
     C     WSFRAB        IFGT      9000000
     C     FICURR        ANDEQ     WSFRAV
     C                   SETON                                        5130
     C                   END
     C                   ELSE
      * Innenlands duppoppdrag som har pris trenger IKKE godkj.signatur (men må innom/UT)
     c     wsblgk        Ifeq      *blanks
     c     wsfrab        andne     *Zeros
     c     TROPD0        andne     *zeros
     c                   move      '*A*'         WSBLGK
     C                   END
     C     WSFRAF        IFGT      1000000
     C     FICURR        ANDEQ     WSFRAV
     C                   SETON                                        5130
     C                   END
      * INNHENTINGS/UTKJØRINGS-BELØP KAN IKKE VÆRE 0 NÅR AGENT GITT
     C     WSBLGK        IFNE      *BLANKS
     C     WSKNFA        ANDNE     *ZEROS
     C     INNLIU        IFEQ      'U'
     C     WSUTKA        ANDLE     *ZEROS
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     73            POSNBR
     C                   MOVE      'JOV1218'     MSGNR
     C                   SETON                                        30
     C                   END
     C     INNLIU        IFEQ      'I'
     C     WSINHA        ANDLE     *ZEROS
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     73            POSNBR
     C                   MOVE      'JOV1219'     MSGNR
     C                   SETON                                        30
     C                   END
     C                   END
     C                   END
     C*
     C* TESTER MOMS J/N
     C*
     C* VED BLANK MVAKODE - DEFAULT : J OM BEGGE DEST=NO / ELLERS N
     C  N30WSMVA         IFEQ      ' '
     C                   MOVE      XXMVA         WSMVA
     C                   END
     C     WSMVA         IFNE      'J'
     C     WSMVA         ANDNE     'N'
     C                   SETON                                        3050
     C                   END
     C*
     C*
     C* TESTER TRANSITTSTATUS   1/2(T1/T2 LISTE)  3/4 (ENKELT T1/T2 DOKUM.)
     C*    ETTER UTSKRIFT.....  A/B ............. C/D ...........
     C     INNLAN        IFEQ      'N'
     C     WSTSTA        COMP      ' '                                9090
     C   90WSTSTA        COMP      '1'                                9090
     C   90WSTSTA        COMP      '2'                                9090
     C   90WSTSTA        COMP      '3'                                9090
     C   90WSTSTA        COMP      '4'                                9090
     C   90WSTSTA        COMP      'A'                                9090
     C   90WSTSTA        COMP      'B'                                9090
     C   90WSTSTA        COMP      'C'                                9090
     C   90WSTSTA        COMP      'D'                                9090
     C   90WSTSTA        COMP      'J'                                9090
     C   90WSTSTA        COMP      'N'                                9090
     C   90              SETON                                        30
     C                   END
     C*
     C*** HENTE PRINTERKODE
     C     KODO2K        CHAIN     KOOT2R                             33
     C  N33              DO
     C     WSPK3         IFEQ      ' '
     C                   MOVE      KO2KK         WSPK3
     C                   END
     C     WSPK4         IFEQ      ' '
     C                   MOVE      KO2TI         WSPK4
     C                   END
     C     WSPK5         IFEQ      ' '
     C                   MOVE      KO2FI         WSPK5
     C                   END
     C     WSPK6         IFEQ      ' '
     C                   MOVE      KO2TE         WSPK6
     C                   END
     C     WSPK1         IFEQ      ' '
     C                   MOVE      KO2FB         WSPK1
     C                   END
     C     WSPK2         IFEQ      ' '
     C                   MOVE      KO2FPS        WSPK2
     C                   END
     C     WSPK7         IFEQ      ' '
     C     KO2BI         IFNE      'N'
     C                   MOVE      'B'           WSPK7
     C                   ELSE
     C     KO2CM         IFNE      'N'
     C                   MOVE      'C'           WSPK7
     C                   ELSE
     C                   MOVE      'N'           WSPK7
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C*** TEST PRINTEKODE FOR ARBEIDSORDRE
     C     WSPK3         COMP      ' '                                    80
     C   80              SETON                                        30
     C*
     C*** TEST PRINTEKODE FOR ARBEIDSORDRE EKSTERN
     C     WSPK5         COMP      ' '                                    80
     C   80              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR TOLLDEKRALASJON
     C     WSPK6         COMP      ' '                                    79
     C  N79WSPK6         COMP      ' '                                    79
     C   79              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR BILL OF LADING ELLER CMR
     C     WSPK7         COMP      ' '                                    81
     C   81              SETON                                        30
     C*
     C*
     C*** TEST PRINTKODE FOR FRAKTBREV
     C     WSPK1         COMP      ' '                                    77
     C   77              SETON                                        30
     C*
     C*** TEST PRINTKODE FOR FORPASSING
     C     WSPK2         COMP      ' '                                    78
     C   78              SETON                                        30
     C*
     C*
     C*** TEST TOLLSTED OG VAREPOST
     C     W2TOLL        IFNE      0
     C     KODTSK        CHAIN     KOTSTR                             58
     C   58              SETON                                        30
     C                   END
     C  N58WSPK2         IFEQ      'J'
     C     W2TOLL        COMP      0                                      58
     C   58              SETON                                        30
     C     WSNTVS        COMP      0                                      57
     C   57              SETON                                        30
     C                   END
     C*
     C  N30WSAVD         COMP      *ZEROS                                 30
     C*
     C*** BEREGN FRAKTBREGNETVEKT
     C                   EXSR      FINNVK
     C*** automatisk endring av produktkode basrt på høy F-vekt??
     C     *IN30         IFEQ      *OFF
     C     WSKDPL        ANDEQ     ' '
     C     TONNKEY       CHAIN     SYPARL1                            33
     C     *IN33         IFEQ      *OFF
     C     WSFBV         ANDGT     SYVRDN
     C     SYVRDA        ANDNE     ' '
     C                   MOVEL     SYVRDA        WSKDPL
     C                   MOVE      'JOV1453'     MSGNR
     C                   SETON                                        3096
     C                   END
     C                   END
      *
     C* FINN EVT DFT FOR FRAKT-TILLEGG (VAL/OLJ..., MEN KUN VED NY)
     C  N30              EXSR      GETFRT
     C     SLT2          TAG
     C   30              EXSR      SETCUR
     C*
     C*
     C* OPDATERER NYE OPPDRAG
     C*
     C  N30WSOPD         IFEQ      *ZEROS
     C                   EXSR      OPDHEA
     C                   END
     C*
     C  N30
     CANN36              EXSR      BERFRA
     C  N30              EXSR      FINNVK
     C  N30              EXSR      SRBRU
     C*
     C                   MOVE      *BLANKS       WSAVVA
     C                   MOVE      *BLANKS       WSAVV2
     C     Innlan        Ifeq      'J'
     C     *IN30         andeq     *OFF
      * Vis evt avvikende  fakturavaluta ved innland
     C     *In66         IFNE      *Blanks
     C     WSVALS        Andne     FICURR
     C                   eval      WsAvVa = 'Fakturavaluta: ' + WSVALS
     C                   end
      * Ved utenlandsk kunde vis også momskode
     C     SYLAND        IFNE      '  '
     C     SYLAND        ANDNE     FILAND
     C                   eval      WsAvV2 = 'Mva:' + WSMVA
     C                   end
      * Vis evt avvikender fraktpris-valuta
     C     WSFRAV        IFNE      *blanks
     C     WSFRAV        Andne     FICURR
     C                   move      WSFRAV        WsAvV2
     C                   end
     C                   end
     C                   ENDSR
     C***********************************************
     C     FIXDAT        BEGSR
     C***********************************************
      * KUN 2 SIFFER GITT - DAG.
     C     TMPDAT        IFLE      99
     C                   MOVE      TMDTÅ         TMDTD
     C                   MOVE      UMONTH        TMDTM
     C                   MOVE      UYEAR         TMDTÅ
     C                   ELSE
      * mer enn 2 siffer gitt - DAG /MND
     C                   MOVE      TMDTM         TMDTD
     C                   MOVE      TMDTÅ         TMDTM
     C                   MOVE      UYEAR         TMDTÅ
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     FJVIA2        BEGSR
     C***********************************************
     C*
     C                   MOVE      '0'           XXFLAG            1
     C                   MOVE      'VF'          XXVIA             2
     C                   CALL      'SYTR33B'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XXVIA
     C                   PARM                    XXFLAG
     C     XXFLAG        IFEQ      '0'
     C                   MOVE      *ZEROS        WSKNFA
     C                   MOVE      *ZEROS        WPSVTD
     C                   MOVE      *ZEROS        WSSVTD
     C                   MOVE      *ZEROS        WPSVTK
     C                   MOVE      *ZEROS        WSSVTK
     C                   MOVE      *BLANKS       WPSTAE
     C                   MOVE      *BLANKS       WSSTAE
     C                   MOVE      *BLANKS       WPLAN2
     C                   MOVE      *BLANKS       WPSDVT
     C                   MOVE      *BLANKS       WSSDVT
     C                   MOVE      *BLANKS       WPPNS4
     C                   END
     C                   ENDSR
      *
     C***********************************************
     C     STVIA2        BEGSR
     C***********************************************
     C* SETT VIA2 - AGENT MM.
     C     WSTSTA        IFEQ      'R'
     C                   MOVE      'R'           XXFLAG            1
     C                   ELSE
     C     WSAVD         CHAIN     KODTAG                             33
     C  N33AGTRNR        comp      *zeros                                 33
      * ikke fast agent på avdelingen - kan ad hoc være opgitt
     c   33WSKNFA        Ifne      *zeros
     C     9998          setll     KODTAG
     C     9998          reade     KODTAG                                 33
     C     *in33         doweq     '0'
     c     AGTRKU        ifeq      WSKNFA
     c                   leave
     c                   end
     C     9998          reade     KODTAG                                 33
     c                   enddo
     c                   end
     C     *IN33         CABEQ     '1'           UTSTVI
     C                   MOVE      '0'           XXFLAG            1
     C                   END
     C                   MOVE      'VF'          XXVIA             2
     C                   CALL      'SYTR33C'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XXVIA
     C                   PARM                    XXFLAG
     C*
     C     XXFLAG        IFEQ      '0'
     C     HEADFK        CHAIN(N)  HEADF                              33
     C     HEADFK        CHAIN(N)  HESTED                             33
     C                   MOVE      HEKNA         WSKNFA
     C                   MOVE      XVTDDD        WSDTD4
     C                   MOVE      XVTDMM        WSDTM4
     C                   MOVE      XVTDÅÅ        WSDTÅ4
     C                   MOVE      WSSVTD        WPSVTD
     C                   MOVE      TRSVTK        WPSVTK
     C                   MOVE      TRSVTK        WSSVTK
     C                   MOVE      TRSTAE        WPSTAE
     C                   MOVE      TRSTAE        WSSTAE
     C                   MOVE      HELKK         WPLAN2
     C                   MOVE      HESDVT        WPSDVT
     C                   MOVE      HESDVT        WSSDVT
     C                   MOVEL     HSVIA2        WPPNS4
     C                   END
     C     UTSTVI        ENDSR
     C***********************************************
     C     SRSTED        BEGSR
     C***********************************************
     C* BRUK POSTNR FRA AVS/MOTTAKER DERSOM IKKE MAUELT UTFYLT
     C   42WPSDF         IFEQ      *BLANKS
     C                   MOVEL     WSADS3        TSTFRA            5
     C     TSTFRA        IFGT      '00000'
     C     TSTFRA        ANDLE     '99999'
     C                   MOVE      TSTFRA        WPSDF
     C                   MOVE      TSTFRA        WSSDF
     C                   END
     C                   END
     C   42WPSDT         IFEQ      *BLANKS
     C                   MOVEL     WSADK3        TSTTIL            5
     C     TSTTIL        IFGT      '00000'
     C     TSTTIL        ANDLE     '99999'
     C                   MOVE      TSTTIL        WPSDT
     C                   MOVE      TSTTIL        WSSDT
     C                   END
     C                   END
     C* TEST STED FRA
     C     STF           TAG
     C                   MOVE      *BLANKS       USDFT            18
     C  N42WSSDF         CHAIN     STED2                              95
     C   42WSSDF         IFEQ      '99999'
     C     WPPNS1        ANDNE     *BLANKS
     C                   GOTO      STT
     C                   END
     C   42WKSDF         CHAIN     STED2D                             95
     C  N95              DO
     C                   MOVE      ST2LK         WSLANF
     C                   MOVE      ST2SOL        WSSONF
     C                   MOVE      ST2PNR        WSPNRF
     C   42              MOVEL     ST2NVN        WPPNS1
     C     *IN42         IFEQ      '1'
     C     WSNAS         ANDNE     *BLANKS
     C     WSADS3        ANDEQ     *BLANKS
     C                   MOVEL     ST2KOD        TMPAD1           36
     C                   MOVE      ST2NVN        TMPAD1
     C                   MOVEL     TMPAD1        WSADS3
     C                   MOVE      '   '         WSADS3
     C                   MOVE      ST2LK         WSADS3
     C                   END
     C  N42ST2LK         IFNE      FILAND
     C                   MOVE      'N'           XXMVA
     C                   END
     C                   MOVEL     ST2NVN        USDFT
     C                   END
     C*AUTOMATISK OPPDATERING TILLATT NÅR 42 ON (POSTNRBASERT)
     C   42
     CAN 95              DO
     C     WKSDF         SETLL     STEDIL01
     C     WPLANF        READE     STEDIL01                               95
      * Utenfor gyldige postnrsoner...
     C   95
     CANN30              MOVE      'SHU0120'     MSGNR
     C*
     C  N95STINPF        IFLE      WSSDF
      * Innenfor gyldige postnrsoner...
     C     WPPNS1        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WPLANF        IFEQ      GPLANF
     C     WPSDF         ANDEQ     GPSDF
     C                   MOVE      *BLANKS       GPLANF            2
     C                   MOVE      *BLANKS       GPSDF             5
     C* Hent disponeringssone fra basested (i STED2D)
     C                   MOVE      WPLANF        SONLK
     C                   MOVE      STINBA        SONKOD
     C     SONKEY        CHAIN     STED2D                             95
     C                   SETOFF                                       95
     C                   MOVE      WPLANF        ST2LK
     C                   MOVEL     WPPNS1        ST2NVN
     C                   MOVE      WSSDF         ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STEDDR
     C                   GOTO      STF
     C                   ELSE
     C                   SETON                                        95
     C   95
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        95
     C   95
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
      * Utenfor gyldige postnrsoner...
     C                   SETON                                        95
     C   95
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
     C                   END
     C*
     C   95
     CANN42              MOVE      'N'           XXMVA
     C   95              SETON                                        30
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN42         IFEQ      *ON
     C     *IN95         ANDEQ     *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WPLANF        GPLANF            2
     C                   MOVE      WPSDF         GPSDF             5
     C                   END
     C                   END
     C*
     C*** TEST STED TIL
     C     STT           TAG
     C                   MOVE      *BLANKS       USDTT            18
     C  N42WSSDT         CHAIN     STED2                              94
     C   42WSSDT         IFEQ      '99999'
     C     WPPNS2        ANDNE     *BLANKS
     C                   GOTO      STFF
     C                   END
     C   42WKSDT         CHAIN     STED2D                             94
     C  N94              DO
     C                   MOVE      ST2LK         WSLANT
     C                   MOVE      ST2SOL        WSSONT
     C                   MOVE      ST2PNR        WSPNRT
     C   42              MOVEL     ST2NVN        WPPNS2
     C     *IN42         IFEQ      '1'
     C     WSNAK         ANDNE     *BLANKS
     C     WSADK3        ANDEQ     *BLANKS
     C                   MOVEL     ST2KOD        TMPAD1           36
     C                   MOVE      ST2NVN        TMPAD1
     C                   MOVEL     TMPAD1        WSADK3
     C                   MOVE      '   '         WSADK3
     C                   MOVE      ST2LK         WSADK3
     C                   END
     C  N42ST2LK         IFNE      FILAND
     C                   MOVE      'N'           XXMVA
     C                   END
     C                   MOVEL     ST2NVN        USDTT
     C                   END
     C*AUTOMATISK OPPDATERING TILLATT NÅR 42 ON (POSTNRBASERT)
     C   42
     CAN 94              DO
     C     WKSDT         SETLL     STEDIL01
     C     WPLANT        READE     STEDIL01                               94
      * Utenfor gyldige postnrsoner...
     C   94
     CANN30              MOVE      'SHU0120'     MSGNR
     C*
     C  N94STINPF        IFLE      WSSDT
      * Innenfor gyldige postnrsoner...
     C     WPPNS2        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WPLANT        IFEQ      GPLANT
     C     WPSDT         ANDEQ     GPSDT
     C                   MOVE      *BLANKS       GPLANT            2
     C                   MOVE      *BLANKS       GPSDT             5
     C* Hent disponeringssone fra basested (i STED2D)
     C                   MOVE      WPLANT        SONLK
     C                   MOVE      STINBA        SONKOD
     C     SONKEY        CHAIN     STED2D                             94
     C                   SETOFF                                       94
     C                   MOVE      WPLANT        ST2LK
     C                   MOVEL     WPPNS2        ST2NVN
     C                   MOVE      WSSDT         ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STEDDR
     C                   GOTO      STT
     C                   ELSE
     C                   SETON                                        94
     C   94
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        94
     C   94
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
     C                   SETON                                        94
     C   94
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
     C                   END
     C*
     C   94
     CANN42              MOVE      'N'           XXMVA
     C   94              SETON                                        30
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN42         IFEQ      *ON
     C     *IN94         ANDEQ     *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WPLANT        GPLANT            2
     C                   MOVE      WPSDT         GPSDT             5
     C                   END
     C                   END
     C*
     C*** TEST FORFRAKT FRA
     C     STFF          TAG
     C     WSSDFF        IFNE      *BLANKS
     C     WSSDFF        ANDNE     '99999'
     c   42              if        WPLAN1=*blanks
     c                   eval      WPLAN1=WPLANF
     c                   endif
     C  N42WSSDFF        CHAIN     STED2                              84
     C   42WKSDFF        CHAIN     STED2D                             84
     C  N84              MOVE      ST2LK         WSLAN1
     C  N84              MOVE      ST2SOL        WSSON1
     C  N84              MOVE      ST2PNR        WSPNR1
     C  N84
     CAN 42              MOVEL     ST2NVN        WPPNS3
     C*AUTOMATISK OPPDATERING TILLATT NÅR 42 ON (POSTNRBASERT)
     C   42
     CAN 84              DO
     C     WKSDFF        SETLL     STEDIL01
     C     WPLAN1        READE     STEDIL01                               84
      * Utenfor gyldige postnrsoner...
     C   84
     CANN30              MOVE      'SHU0120'     MSGNR
     C*
     C  N84STINPF        IFLT      WSSDFF
      * Innenfor gyldige postnrsoner...
     C*
     C     WPPNS3        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WPLAN1        IFEQ      GPLAN1
     C     WPSDFF        ANDEQ     GPSDFF
     C                   MOVE      *BLANKS       GPLAN1            2
     C                   MOVE      *BLANKS       GPSDFF            5
     C* Hent disponeringssone fra basested (i STED2D)
     C                   MOVE      WPLAN1        SONLK
     C                   MOVE      STINBA        SONKOD
     C     SONKEY        CHAIN     STED2D                             84
     C                   SETOFF                                       84
     C                   MOVE      WPLAN1        ST2LK
     C                   MOVEL     WPPNS3        ST2NVN
     C                   MOVE      WSSDFF        ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STEDDR
     C                   GOTO      STFF
     C                   ELSE
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
     C                   SETON                                        84
     C   84
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
     C                   END
     C*
     C   84              SETON                                        30
     C                   END
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN42         IFEQ      *ON
     C     *IN84         ANDEQ     *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WPLAN1        GPLAN1            2
     C                   MOVE      WPSDFF        GPSDFF            5
     C                   END
     C                   END
     C*
     C*** TEST VIDEREFRAKT TIL
     C     WSSDVT        IFNE      *BLANKS
     C     WSSDVT        ANDNE     '99999'
     C     STVT          TAG
     c   42              if        WPLAN2=*blanks
     c                   eval      WPLAN2=WPLANT
     c                   endif
     C  N42WSSDVT        CHAIN     STED2                              83
     C   42WKSDVT        CHAIN     STED2D                             83
     C  N83              MOVE      ST2LK         WSLAN2
     C  N83              MOVE      ST2SOL        WSSON2
     C  N83              MOVE      ST2PNR        WSPNR2
     C  N83
     CAN 42              MOVEL     ST2NVN        WPPNS4
     C*AUTOMATISK OPPDATERING TILLATT NÅR 42 ON (POSTNRBASERT)
     C   42
     CAN 83              DO
     C     WKSDVT        SETLL     STEDIL01
     C     WPLAN2        READE     STEDIL01                               83
      * Utenfor gyldige postnrsoner...
     C   83
     CANN30              MOVE      'SHU0120'     MSGNR
     C*
     C  N83STINPF        IFLT      WSSDVT
      * Innenfor gyldige postnrsoner...
     C*
     C     WPPNS4        IFNE      *BLANKS
      * Auto-oppretting tillates kun når varsel ER gitt på LK/PNR
     C     WPLAN2        IFEQ      GPLAN2
     C     WPSDVT        ANDEQ     GPSDVT
     C                   MOVE      *BLANKS       GPLAN2            2
     C                   MOVE      *BLANKS       GPSDVT            5
     C* Hent disponeringssone fra basested (i STED2D)
     C                   MOVE      WPLAN2        SONLK
     C                   MOVE      STINBA        SONKOD
     C     SONKEY        CHAIN     STED2D                             83
     C                   SETOFF                                       83
     C                   MOVE      WPLAN2        ST2LK
     C                   MOVEL     WPPNS4        ST2NVN
     C                   MOVE      WSSDVT        ST2KOD
     C                   MOVE      STINBA        ST2KO2
     C                   WRITE     STEDDR
     C                   GOTO      STVT
     C                   ELSE
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'JOV1086'     MSGNR
     C                   END
     C                   ELSE
      * Navn ikke gitt - info / invitasjon til å opprette.
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'JOV0079'     MSGNR
     C                   END
     C                   ELSE
     C                   SETON                                        83
     C   83
     CANN30              MOVE      'SHU0120'     MSGNR
     C                   END
     C                   END
     C*
     C   83              SETON                                        30
     C                   END
      * Husk LK/PNR som saksbeh. gis warning om..
     C     *IN42         IFEQ      *ON
     C     *IN83         ANDEQ     *ON
     C     MSGNR         IFEQ      'JOV0079'
     C     MSGNR         OREQ      'JOV1086'
     C                   MOVE      WPLAN2        GPLAN2            2
     C                   MOVE      WPSDVT        GPSDVT            5
     C                   END
     C                   END
     C* SETT MOMSKODE KUN DERSOM BEGGE LANDKODER GITT
      *  momsproblematikk
     C   42              MOVE      ' '           XXMVA
     C   42WPLANF        IFNE      '  '
     C     WPLANT        ANDNE     '  '
     C     WPLANF        IFEQ      FILAND
     C     WPLANT        ANDEQ     FILAND
     C                   MOVE      'J'           XXMVA
     c     wskdff        ifeq      'S'
     C                   MOVE      WSKNSF        KUNDNR
     c                   else
     c                   move      wsknkf        kundnr
     c                   end
     C     KUND1K        CHAIN     CUNDL01                            33
     C     *IN33         IFEQ      '0'
     C     SYLAND        ANDNE     '  '
     C     SYLAND        ANDNE     FILAND
     C                   MOVE      'N'           XXMVA
     C                   END
     C                   ELSE
     C                   MOVE      'N'           XXMVA
     C                   END
     C                   END
      * unntak for eu (KS2PRE=B)
     C                   MOVE      FILAND        KS2LK
     C     KODTS2K       CHAIN     KODTS2                             33
      * EGET LAND ER EU
     C  N33KS2PRE        IFEQ      'B'
      * UT OG INN AV LANDET
     C     WPLANF        IFNE      WPLANT
      *
     C     WPLANF        IFEQ      FILAND
     C                   MOVE      WPLANT        KS2LK
     C                   ELSE
     C                   MOVE      WPLANF        KS2LK
     C                   END
      *
     C     KODTS2K       CHAIN     KODTS2                             33
      * TIL FRA EU OG KUNDE SITTER I EGET LAND  J TIL MVA
     C  N33KS2PRE        IFEQ      'B'
     C     SYLAND        ANDEQ     FILAND
     C                   MOVE      'J'           XXMVA
     C                   END
     C                   END
     C                   END
     C*         K
     C* DERSOM KUN LAND XXX OG KUN IMP/EKSP GI FEILMELDING
     C  N30KOALK         IFNE      *BLANKS
     C     KOALK         COMP      WSLANF                             9595
     C   95KOALK         COMP      WSLANT                             9595
     C   95              MOVE      'JOV0078'     MSGNR
     C                   END
     C  N30
     CANN95KOAIE         IFEQ      'I'
     C     WSLANF        COMP      FILAND                                 95
     C   95              MOVE      'JOV0077'     MSGNR
     C                   END
     C  N30
     CANN95KOAIE         IFEQ      'E'
     C     WSLANT        COMP      FILAND                                 95
     C   95              MOVE      'JOV0076'     MSGNR
     C                   END
     C                   MOVE      ' '           XFEIEL            1
     C  N30
     CAN 95              MOVE      'J'           XFEIEL
     C  N30
     CAN 95              SETON                                        30
     C*
     C                   ENDSR
     C***********************************************
     C     SETCUR        BEGSR
     C***********************************************
      *** FRA OG MED LINJE 6 ER DET ULIK REKKEFØLGE
      *** VED "KLASSISK" (BÅDE FULLT OG FORENKLET BILDE)
      *** I FORHOLD TIL DET RENE OPTIMALISERTE INNLANDSBILDET...
     C*** VED INNLANSDBILDET STÅR DET I HØYREMAREN         OBS,INNL!
      *
     C* SENDINGSNR VED INNLAND FØRST..
     C     INNLAN        IFEQ      'J'
     C     *IN90         ANDEQ     '1'
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   MOVE      'JOV1209'     MSGNR
     C     SNFLAG        IFEQ      '1'
     C                   MOVE      'JOV1220'     MSGNR
     C                   END
     C                   GOTO      UTSETC
     C                   END
      *
     C* FELLES TESTER FOR ALLE MODUS...
     C* OPPDRAGSGIVER
     C   70              Z-ADD     3             LINNBR
     C   70              Z-ADD     8             POSNBR
     C   70STOPPO        IFEQ      'J'
     C                   MOVE      'SPL0030'     MSGNR
     C                   ELSE
     C                   MOVE      'SPO0033'     MSGNR
     C                   END
     C     *IN32         IFEQ      *ON
     C     WSKNA         ANDEQ     *ZEROS
     C     WSKDAK        ANDEQ     ' '
     C                   MOVE      'JOV0874'     MSGNR
     C                   END
     C   70              GOTO      UTSETC
     C*
     C* FORTOLLINGSAGENT FINNES IKKE / BLANK VED UTFYLT TRANSITTSTATUS
     C*
     C   82              Z-ADD     3             LINNBR
     C   82              Z-ADD     92            POSNBR
     C   82              MOVE      'DIV2300'     MSGNR
     C   82              GOTO      UTSETC
     C*
     C*
     C* ER FAKTUMOTTAGER S ELLER K
     C*
     C   93              Z-ADD     4             LINNBR
     C   93              Z-ADD     8             POSNBR
     C   93              MOVE      'SPK0051'     MSGNR
     C   93              GOTO      UTSETC
     C*
     C* SØKEREFERANSE
     C*
     C   59              Z-ADD     4             LINNBR
     C   59              Z-ADD     18            POSNBR
      *spesial innland forenklet
     c   59CALLFR        ifeq      'I'
     c     CALLFR        oreq      'U'
     C     INFULL        ifne      'J'
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     8             POSNBR
     c                   end
     c                   end
     C   59              MOVE      'JOV0861'     MSGNR
     C   59              GOTO      UTSETC
     C*
     C* VALUTAKODE FAKTURAMOTTEGER
     C*
     C   66              Z-ADD     9             LINNBR
     C   66              Z-ADD     91            POSNBR
     C   66              MOVE      'SPV0001'     MSGNR
     C   66              GOTO      UTSETC
     C*
     C* VAREKODE TILLEGG
     C*
     C* VALUTA/OLJE-TILLEGG
     C   76              Z-ADD     22            LINNBR
     C   76              Z-ADD     57            POSNBR
     C   76              MOVE      'SPV0006'     MSGNR
     C   76              GOTO      UTSETC
      *
      *
      *** FRA OG MED LINJE 6 ER DET ULIK REKKEFØLGE VED OPTIM.INNLAND.
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C*
     C* STED FRA
     C*(VED FEIL PGA IMPO./EKSP./FAST LANKODE - MSGNR ER GITT(XFEIEL=J)
     C   95              Z-ADD     5             LINNBR
     C   95              Z-ADD     8             POSNBR
     C   95
     CAN 42WPLANF        IFNE      *BLANKS
     C                   Z-ADD     11            POSNBR
     C                   END
     C   95
     CANN42XFEIEL        IFNE      'J'
     C                   MOVE      'SPS0012'     MSGNR
     C                   END
     C   95              GOTO      UTSETC
     C*
     C* DATO FRA
     C*
     C   60              Z-ADD     5             LINNBR
     C   60
     CANN42              Z-ADD     14            POSNBR
     C   60
     CAN 42              Z-ADD     17            POSNBR
     C   60              MOVE      'SPD0001'     MSGNR
     C   60              GOTO      UTSETC
     C*
     C* KLOKKESLETT FRA
     C*
     C   72              Z-ADD     5             LINNBR
     C   72
     CANN42              Z-ADD     21            POSNBR
     C   72
     CAN 42              Z-ADD     24            POSNBR
     C   72              MOVE      'SPK0006'     MSGNR
     C   72              GOTO      UTSETC
     C*
     C* STED TIL
     C*
     C   94              Z-ADD     5             LINNBR
     C   94              Z-ADD     48            POSNBR
     C   94
     CAN 42WPLANT        IFNE      *BLANKS
     C                   Z-ADD     51            POSNBR
     C                   END
     C   94
     CANN42              MOVE      'SPS0013'     MSGNR
     C   94              GOTO      UTSETC
     C*
     C* DATO TIL
     C*
     C   64              Z-ADD     5             LINNBR
     C   64
     CANN42              Z-ADD     54            POSNBR
     C   64
     CAN 42              Z-ADD     57            POSNBR
     C   64              MOVE      'SPD0001'     MSGNR
     C   64              GOTO      UTSETC
     C*
     C* KLOKKESLETT TIL
     C*
     C   73              Z-ADD     5             LINNBR
     C   73
     CANN42              Z-ADD     61            POSNBR
     C   73
     CAN 42              Z-ADD     64            POSNBR
     C   73              MOVE      'SPK0006'     MSGNR
     C   73              GOTO      UTSETC
     C*
     C* FORFRAKT FRA
     C*
     C   84              Z-ADD     6             LINNBR
     C   84              Z-ADD     8             POSNBR
     C   84
     CAN 42WPLAN1        IFNE      *BLANKS
     C                   Z-ADD     11            POSNBR
     C                   END
     C   84
     CANN42              MOVE      'SPS0016'     MSGNR
     C   84              GOTO      UTSETC
     C*
     C* FORFRAKT DATO
     C*
     C   69              Z-ADD     6             LINNBR
     C   69
     CANN42              Z-ADD     14            POSNBR
     C   69
     CAN 42              Z-ADD     17            POSNBR
     C   69              MOVE      'SPD0001'     MSGNR
     C   69              GOTO      UTSETC
     C*
     C* FORFRAKT KLOKKA
     C*
     C   74              Z-ADD     6             LINNBR
     C   74
     CANN42              Z-ADD     21            POSNBR
     C   74
     CAN 42              Z-ADD     24            POSNBR
     C   74              MOVE      'SPK0006'     MSGNR
     C   74              GOTO      UTSETC
     C*
     C* FORFRAKT REKVIRERES - STATUSKODE
     C*
     C   48              Z-ADD     6             LINNBR
     C   48
     CANN42              Z-ADD     26            POSNBR
     C   48
     CAN 42              Z-ADD     29            POSNBR
     C   48              MOVE      'DIV2303'     MSGNR
     C   48              GOTO      UTSETC
     C*
     C*
     C* VIDEREFRAKT TIL
     C   83              Z-ADD     6             LINNBR
     C   83              Z-ADD     48            POSNBR
     C   83
     CAN 42WPLAN2        IFNE      *BLANKS
     C                   Z-ADD     51            POSNBR
     C                   END
     C   83
     CANN42              MOVE      'SPS0017'     MSGNR
     C   83              GOTO      UTSETC
     C*
     C* VIDEREFRAKT DATO
     C*
     C   71              Z-ADD     6             LINNBR
     C   71
     CANN42              Z-ADD     54            POSNBR
     C   71
     CAN 42              Z-ADD     57            POSNBR
     C   71              MOVE      'SPD0001'     MSGNR
     C   71              GOTO      UTSETC
     C*
     C* VIDEREFRAKT KLOKKA
     C*
     C   75              Z-ADD     6             LINNBR
     C   75
     CANN42              Z-ADD     61            POSNBR
     C   75
     CAN 42              Z-ADD     64            POSNBR
     C   75              MOVE      'SPK0006'     MSGNR
     C   75              GOTO      UTSETC
     C*
     C*
     C* VIDEREFRAKT REKVIRERES - STATUSKODE
     C*
     C   47              Z-ADD     6             LINNBR
     C   47
     CANN42              Z-ADD     66            POSNBR
     C   47
     CAN 42              Z-ADD     69            POSNBR
     C   47              MOVE      'DIV2302'     MSGNR
     C   47              GOTO      UTSETC
     C*
     C*
     C* OPPDRAGSTYPE
     C   89              Z-ADD     7             LINNBR
     C   89              Z-ADD     8             POSNBR
     C   89              MOVE      'SPO0007'     MSGNR
     C   89              GOTO      UTSETC
     C*
     C* FRANKATUR
     C*
     C   88              Z-ADD     7             LINNBR
     C   88              Z-ADD     21            POSNBR
     C   88              MOVE      'SPF0006'     MSGNR
     C   88              GOTO      UTSETC
     C*
     C* SELGER   0 ELLER FINNES IKKE
     C*
     C   68              Z-ADD     8             LINNBR
     C   68              Z-ADD     8             POSNBR
     C   68              MOVE      'SPK0010'     MSGNR
     C   68              GOTO      UTSETC
     C   67
     CANN32              Z-ADD     9             LINNBR
     C   67
     CANN32              Z-ADD     19            POSNBR
     C   67
     CAN 32              Z-ADD     9             LINNBR
     C   67
     CAN 32              Z-ADD     19            POSNBR
     C   67              MOVE      'SPN0005'     MSGNR
     C   67              GOTO      UTSETC
     C*
     C* FAKTURAMOTTAGER
     C*
     C   65              Z-ADD     8             LINNBR
     C   65              Z-ADD     86            POSNBR
     C   65KRGR          IFEQ      'J'
     C                   MOVE      'SPK0050'     MSGNR
     C                   ELSE
     C     STOPPO        IFEQ      'J'
     C                   MOVE      'SPL0030'     MSGNR
     C                   ELSE
     C                   MOVE      'SPK0049'     MSGNR
     C                   END
     C                   END
     C   65              GOTO      UTSETC
     C*
     C*
     C* KJØPER 0 ELLER FINNES IKKE
     C*
     C*
     C   61              Z-ADD     12            LINNBR
     C   61              Z-ADD     8             POSNBR
     C   61              MOVE      'SPK0013'     MSGNR
     C   61              GOTO      UTSETC
     C*
     C   62
     CANN32              Z-ADD     12            LINNBR
     C   62
     CANN32              Z-ADD     8             POSNBR
     C   62
     CAN 32              Z-ADD     13            LINNBR
     C   62
     CAN 32              Z-ADD     19            POSNBR
     C   62              MOVE      'SPN0006'     MSGNR
     C   62              GOTO      UTSETC
     C*
     C* FAKTURAMOTTAGER kjøper
     C*
     C   17              Z-ADD     12            LINNBR
     C   17              Z-ADD     86            POSNBR
     C   17KRGR2         IFEQ      'J'
     C                   MOVE      'SPK0050'     MSGNR
     C                   ELSE
     C     STOPPF2       IFEQ      'J'
     C                   MOVE      'SPL0030'     MSGNR
     C                   ELSE
     c     WSKDFK        IFeq      'X'
     C                   MOVE      'SHU1215'     MSGNR
     c                   else
     C                   MOVE      'SPK0049'     MSGNR
     C                   END
     C                   END
     C                   END
     C   17              GOTO      UTSETC
     C*
     C* ANT KOLLI
     C*
     C   87              Z-ADD     16            LINNBR
     C   87              Z-ADD     20            POSNBR
     C   87              MOVE      'SPN0003'     MSGNR
     C   87              GOTO      UTSETC
     C*
     C* VARESLAG
     C*
     C   86              Z-ADD     16            LINNBR
     C   86              Z-ADD     36            POSNBR
     C   86              MOVE      'SPV0005'     MSGNR
     C   86              GOTO      UTSETC
     C*
     C* VEKT
     C*
     C   85              Z-ADD     16            LINNBR
     C   85              Z-ADD     62            POSNBR
     C   85INNLAN        IFEQ      'J'
     C   85              MOVE      'SPV0002'     MSGNR
     C                   else
     C   85              MOVE      'JOV1436'     MSGNR
     C                   end
     C   85              GOTO      UTSETC
     C*
      * ADR gods
     c     FEILADR       ifeq      'J'
     C                   MOVE      'SHU1522'     MSGNR
     c                   z-add     18            linnbr
     c                   z-add     108           posnbr
     c     wssli1        ifeq      '*'
     c                   z-add     16            LINNBR
     c                   else
     c     wssli2        ifeq      '*'
     c                   z-add     17            linnbr
     c                   end
     c                   end
     C                   GOTO      UTSETC
     c                   end
     c
      *
     C   40              Z-ADD     18            LINNBR
     C   40              Z-ADD     9             POSNBR
     C   40              GOTO      UTSETC
     C   39              Z-ADD     18            LINNBR
     C   39              Z-ADD     12            POSNBR
     C   39              GOTO      UTSETC
     C* VALUTA VERDI
     C*
     C   96              Z-ADD     22            LINNBR
     C   96              Z-ADD     47            POSNBR
     C   96              GOTO      UTSETC
     C*
     C   49              Z-ADD     19            LINNBR
     C   49              Z-ADD     9             POSNBR
     C   49              MOVE      'SPV0001'     MSGNR
     C   49              GOTO      UTSETC
     C*
     C* BELØP VAREVERDI
     C*
     C   56              Z-ADD     19            LINNBR
     C   56              Z-ADD     13            POSNBR
     C   56              MOVE      'SPB0007'     MSGNR
     C   56              GOTO      UTSETC
     C*
     C* VALUTA ETTERKRAV
     C*
     C   55              Z-ADD     19            LINNBR
     C   55              Z-ADD     30            POSNBR
     C   55              MOVE      'SPV0001'     MSGNR
     C   55              GOTO      UTSETC
     C*
     C* VERDI ETTERKRAV
     C*
     C   54              Z-ADD     19            LINNBR
     C   54              Z-ADD     34            POSNBR
     C   54              MOVE      'SPB0007'     MSGNR
     C   54              GOTO      UTSETC
     C*
     C* KODE E/A FRAKTBELØP
     C*
     C   53              Z-ADD     19            LINNBR
     C   53              Z-ADD     55            POSNBR
     C   53              MOVE      'SPB0010'     MSGNR
     C   53              GOTO      UTSETC
     C*
     C* VALUTAKODE FRAKT
     C*
     C   52              Z-ADD     19            LINNBR
     C   52              Z-ADD     57            POSNBR
     C   52              MOVE      'SPV0001'     MSGNR
     C   52              GOTO      UTSETC
     C*
     C* BELØP FRAKT
     C*
     C   51              Z-ADD     19            LINNBR
     C   51              Z-ADD     61            POSNBR
     C   51              MOVE      'SHU0601'     MSGNR
     C   51              GOTO      UTSETC
     C*
     C* MVA J/N
     C*
     C   50              Z-ADD     19            LINNBR
     C   50              Z-ADD     78            POSNBR
     C   50              MOVE      'SPM0004'     MSGNR
     C   50              GOTO      UTSETC
     C*
     C*
     C* TRANSITERINGSKODE
     C*
     C   90              Z-ADD     8             LINNBR
     C   90              Z-ADD     79            POSNBR
     C   90              MOVE      'DIV2301'     MSGNR
     C   90              GOTO      UTSETC
     C*
     C* ARB.ORDRE
     C   80              Z-ADD     22            LINNBR
     C   80              Z-ADD     9             POSNBR
     C   80              MOVE      'SPP0008'     MSGNR
     C   80              GOTO      UTSETC
     C*
     C* TOLLDEK
     C*
     C   79              Z-ADD     22            LINNBR
     C   79              Z-ADD     19            POSNBR
     C   79              MOVE      'SPP0005'     MSGNR
     C   79              GOTO      UTSETC
     C*
     C* BOL/CMR
     C   81              Z-ADD     22            LINNBR
     C   81              Z-ADD     28            POSNBR
     C   81              MOVE      'SPP0009'     MSGNR
     C   81              GOTO      UTSETC
     C*
     C* FRAKTBREV
     C*
     C*
     C   77              Z-ADD     22            LINNBR
     C   77              Z-ADD     35            POSNBR
     C   77              MOVE      'SPP0002'     MSGNR
     C   77              GOTO      UTSETC
     C*
     C* FORPASSING
     C   78              Z-ADD     22            LINNBR
     C   78              Z-ADD     55            POSNBR
     C   78              MOVE      'SPP0003'     MSGNR
     C   78              GOTO      UTSETC
     C*
     C* TOLLSTED FORP
     C*
     C   58              Z-ADD     22            LINNBR
     C   58              Z-ADD     37            POSNBR
     C   58              MOVE      'SPT0001'     MSGNR
     C   58              GOTO      UTSETC
     C*
     C* ANTALL VAREPOSTER
     C*
     C   57              Z-ADD     22            LINNBR
     C   57              Z-ADD     57            POSNBR
     C   57              MOVE      'SPN0004'     MSGNR
     C   57              GOTO      UTSETC
     C*
      *** FRA OG MED LINJE 6 ER DET ULIK REKKEFØLGE VED OPTIM.INNLAND.
     C                   ELSE
     C*                                                    OBS,INNL!
     C* SELGERS KUNDENR                                    OBS,INNL!
     C   68              Z-ADD     6             LINNBR
     C   68              Z-ADD     8             POSNBR
     C   68              MOVE      'SPK0010'     MSGNR
     C   68              GOTO      UTSETC
     C*  HENTE-ADRESSE                                     OBS,INNL!
     C   67              Z-ADD     7             LINNBR
     C   67              Z-ADD     19            POSNBR
     C   67              MOVE      'SPN0005'     MSGNR
     C   67              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* KJØPERS KUNDENR                                    OBS,INNL!
     C*                                                    OBS,INNL!
     C   61              Z-ADD     9             LINNBR
     C   61              Z-ADD     8             POSNBR
     C   61              MOVE      'SPK0013'     MSGNR
     C   61              GOTO      UTSETC
     C*  LEV.  ADRESSE                                     OBS,INNL!
     C   62              Z-ADD     10            LINNBR
     C   62              Z-ADD     19            POSNBR
     C   62              MOVE      'SPN0006'     MSGNR
     C   62              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* AGENT                                              OBS,INNL!
     C*                                                    OBS,INNL!
     C   82              Z-ADD     12            LINNBR
     C   82              Z-ADD     8             POSNBR
     C   82              MOVE      'JOV1196'     MSGNR
     C   82              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* STED FRA                                           OBS,INNL!
     C*                                                    OBS,INNL!
     C   95              Z-ADD     13            LINNBR
     C   95              Z-ADD     8             POSNBR
     C   95              MOVE      'SPS0012'     MSGNR
     C   95              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* STED TIL                                           OBS,INNL!
     C*                                                    OBS,INNL!
     C   94              Z-ADD     13            LINNBR
     C   94              Z-ADD     54            POSNBR
     C   94              MOVE      'SPS0013'     MSGNR
     C   94              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* OPPDRAGSTYPE                                       OBS,INNL!
     C* TEST OPPDR.TYPE HER KUN NÅR VEKT ER GITT,          OBS,INNL!
     C*                                                    OBS,INNL!
     C     *IN85         IFEQ      '0'
     C   89              Z-ADD     16            LINNBR
     C   89              Z-ADD     2             POSNBR
     C   89              MOVE      'SPO0007'     MSGNR
     C   89              GOTO      UTSETC
     C                   END
     C*                                                    OBS,INNL!
     C* FRANKATUR                                          OBS,INNL!
     C*                                                    OBS,INNL!
     C   88              Z-ADD     16            LINNBR
     C   88              Z-ADD     5             POSNBR
     C   88              MOVE      'SPF0006'     MSGNR
     C   88              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* ANT KOLLI                                          OBS,INNL!
     C*                                                    OBS,INNL!
     C   87              Z-ADD     16            LINNBR
     C   87              Z-ADD     10            POSNBR
     C   87              MOVE      'SPN0003'     MSGNR
     C   87              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C*                                                    OBS,INNL!
     C* VEKT                                               OBS,INNL!
     C*                                                    OBS,INNL!
     C   85              Z-ADD     16            LINNBR
     C   85              Z-ADD     43            POSNBR
     C   85              MOVE      'SPV0002'     MSGNR
     C   85              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* UTL.FORBEH. KODE                                   OBS,INNL!
     C*                                                    OBS,INNL!
     C   40              Z-ADD     18            LINNBR
     C   40              Z-ADD     8             POSNBR
     C   40              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* UTL.FORBEH. KVITTERINGSKODE.                       OBS,INNL!
     C*                                                    OBS,INNL!
     C   39              Z-ADD     18            LINNBR
     C   39              Z-ADD     11            POSNBR
     C   39              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* KODE FRAKTBELØP                                    OBS,INNL!
     C   53              Z-ADD     19            LINNBR
     C   53              Z-ADD     64            POSNBR
     C   53              MOVE      'SPB0010'     MSGNR
     C   53              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* BELØP FRAKT                                        OBS,INNL!
     C*                                                    OBS,INNL!
     C   51              Z-ADD     19            LINNBR
     C   51              Z-ADD     66            POSNBR
     C   51              MOVE      'SHU0601'     MSGNR
     C   51              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* ARB.ORDRE                                          OBS,INNL!
     C*                                                    OBS,INNL!
     C   80              Z-ADD     22            LINNBR
     C   80              Z-ADD     9             POSNBR
     C   80              MOVE      'SPP0008'     MSGNR
     C   80              GOTO      UTSETC
     C*                                                    OBS,INNL!
     C* FRAKTBREV                                          OBS,INNL!
     C*                                                    OBS,INNL!
     C   77              Z-ADD     22            LINNBR
     C   77              Z-ADD     18            POSNBR
     C   77              MOVE      'SPP0002'     MSGNR
     C   77              GOTO      UTSETC
     C*                                                    OBS,INNL!
      *                                                    OBS,INNL!
     C                   END
      *
     C     WSAVD         IFEQ      *ZEROS
     C                   Z-ADD     2             LINNBR
     C                   Z-ADD     34            POSNBR
     C                   MOVE      'JOV1208'     MSGNR
     C                   END
     C*
     C     UTSETC        ENDSR
     C*
     C***********************************************
     C     TESTKU        BEGSR
     C***********************************************
     C                   MOVE      *zeros        WSHBRE            8 6
     C                   MOVE      *zeros        WSHLEN            9 6
     C                   MOVE      *zeros        WSLBRE            8 6
     C                   MOVE      *zeros        WSLLEN            9 6
     C                   MOVE      ' '           STOPPF            1
     C                   MOVE      ' '           STOPPF2           1
     C                   MOVE      ' '           STOPPO            1
     C                   MOVE      *BLANKS       WSMSG
     C                   MOVE      'N'           KRGR
     C                   MOVE      'N'           KRGR2
     C                   SETOFF                                       9899
     c     wskdff        ifeq      ' '
     c                   move      wskdak        wskdff
     c                   end
     C*---------------------------------------------------
     C*---------------------------------------------------
     C*** TEST OPPDRAGSGIVER
     C*---------------------------------------------------
     C*---------------------------------------------------
     C* KREVES VED INNLAND FORDI DET AUTOMATISERER VIDERE UTFYLLING!
     C*
     C     INNLAN        IFEQ      'J'
     C     WSKNA         ANDEQ     *ZEROS
     C                   SETON                                        70
     C                   END
     C     WSKNA         IFNE      *ZEROS
     C                   MOVE      *BLANKS       WSNAA
     C                   MOVE      *BLANKS       WSADA
     C                   MOVE      WSKNA         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            70
     C   70              MOVE      *BLANKS       WSNAA
     C   70              MOVE      *BLANKS       WSADA
     C   70              SETON                                        30
     C  N70              MOVE      KNAVN         WSNAA
     C*
     C  N70POSTNR        IFEQ      0
     C*
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADA
     C                   ELSE
     C                   MOVE      ENGAD3        WSADA
     C                   END
     C*
     C                   ELSE
     C                   MOVEL     POSTNR        WSADA
     C                   MOVE      ADR3          WSADA
     C                   END
     C*
     C  N70              DO
     C                   MOVE      WSKNA         FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        98
     C*
     C*** TEST STOPPEKODE
     C*
     C     SYLIKV        COMP      ' '                                9191
     C*
     C   91              DO
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      WSKNA         XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C  N33              MOVE      KLINAV        WSADA
     C     KLISTO        IFEQ      'J'
     C                   MOVE      'J'           STOPPO
     C                   SETON                                        3070
     C                   END
     C                   END
     C                   END
     C                   ENDIF
      *    OPPDRAGSGIVER OG S/K-KODE GIS
     C     *IN70         IFEQ      *OFF
     C     WSKNA         COMP      *ZEROS                                 70
     C  N70WSKDAK        COMP      ' '                                    70
     C                   END
     C*
     C*----------------------------------------------------------------------
     C*----------------------------------------------------------------------
     C*** TEST SELGER
     C*----------------------------------------------------------------------
     C*----------------------------------------------------------------------
      * SELGER/KJØPER KOMMER LANGT NED PÅ SKJERMBILDE (ETTER SRSTED)
      * SETT FEILINDIK. MEN VENT MED Å SETTE IND-30 TIL ETTER SRSTED
     C*
     C     WSKDAK        IFEQ      'S'
     C                   MOVE      WSKNA         WSKNS
     C                   END
     C* Ved blank selger kopier ned selgers F.mot
      * (men kode bak kan indikere IKKE kopier. Dft SKKopiKode er blank - blank bak betyr da KOPIER)
     C                   MOVE      *BLANKS       XSTLF            15
     C                   MOVE      *BLANKS       WSNAMS
     C                   MOVE      *BLANKS       WSADRS
     C     WSKNS         IFEQ      0
     C     WSNAS         COMP      *BLANKS                                67
     C                   MOVE      *ZEROS        FMOT
     C                   ELSE
     C                   MOVE      WSKNS         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            68
     C  N68              DO
      *
      * flytter eventuelt selfgers fakturamottager over
      *
     C     WSKNSF        IFEQ      0                                             2<-B
     C     WSKDFF        andeq     'S'
     c                   move      ' '           WSKDFS
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNS         WSKNSF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNSF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      * hvis ikke wsknsf tar attitude fra selger
     C     wsknsf        ifeq      0
     C                   MOVE      XXBRE         WSHBRE
     C                   MOVE      XXLEN         WSHLEN
     C                   MOVE      KNAVN         WSNAMS
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADRS
     C                   ELSE
     C                   MOVE      ENGAD3        WSADRS
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADRS
     C                   MOVE      ADR3          WSADRS
     C                   END
     C   42WPLANF        IFEQ      *BLANKS
     C     WPSDF         ANDNE     *BLANKS
     C                   MOVE      SYLAND        WPLANF
     C                   END
     C                   END
      *
     C  N68              MOVE      TLF           XSTLF
     C  N68WSNAS         IFEQ      *BLANKS
     C                   MOVE      WSKNS         KUNDNR
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      *BLANKS       WSADS3
     C  N33              DO
     C                   MOVE      VADRNA        WSNAS
     C                   MOVE      VADRN1        WSADS1
     C                   MOVE      VADRN2        WSADS2
     C                   MOVE      VADRN3        WSADS3
     C     valand        ifne      *blanks
     c                   move      '   '         wsads3
     c                   move      valand        wsads3
     c                   end
     C                   END
     C   33              DO
     C                   MOVE      KNAVN         WSNAS
     C     DKUND         IFEQ      'D'
     C                   MOVE      *BLANKS       WSADS1
     C                   MOVE      *BLANKS       WSADS2
     C                   GOTO      UTDSEL
     C                   END
     C                   MOVE      ADR1          WSADS1
     C                   MOVE      ADR2          WSADS2
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADS3
     C                   MOVEL     ADR3          WSADRS
     C                   ELSE
     C                   MOVE      ENGAD3        WSADS3
     C                   MOVE      ENGAD3        WSADRS
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADS3
     C                   MOVE      ADR3          WSADS3
     C                   MOVEL     POSTNR        WSADRS
     C                   MOVE      ADR3          WSADRS
     C                   END
     C     syland        ifne      *blanks
     c                   move      '   '         wsads3
     c                   move      syland        wsads3
     c                   end
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C     UTDSEL        TAG
     C* SLUTT TESTER AV SELGER
     C*
     C*
     C*------------------------------------------------------------------------------
     C*------------------------------------------------------------------------------
     C*** TEST         FAKTURAMOTTAGER Selger
     C*-----------------------------------------------------------------------------
     C*-----------------------------------------------------------------------------
     C     WSKNSF        IFNE      *ZEROS
     C                   MOVE      *BLANKS       WSNASF
     C                   MOVE      *BLANKS       WSADSF
     C                   ENDIF
     C   32WSKNSF        IFEQ      0
     C                   MOVE      'X'           WSKDFS
     C                   END
      *
      * tester mot wsknsf selgers fakturapart
      *
     C  N70WSKDFF        IFEQ      ' '
     C                   MOVE      WSKDAK        WSKDFF
     C                   END
     c     wskdfs        ifne      'X'
     c     wsknsf        orne      0
     C                   MOVE      WSKNSF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            65
     c     TRSLAG        iFEQ      'HO'                                         FERDIG HO
     c     WSOPD         OREQ      *ZEROS                                       UFERDIG MANUELT
     C  N65AKTKOD        COMP      'A'                                6565
     C  N65AKTKOD        COMP      'I'                                    65
     c                   endif
     C   65              SETON                                        30
     C*** TEST OM TASTET VALUTAKODEN TIL FAKTURAMOTTAGER ER GYLDIG
     C*
     C                   MOVE      *BLANKS       KUNVAL            3
     C  N65              DO
     C                   MOVE      VALKOD        KUNVAL
     C                   MOVE      KNAVN         WSNASF
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADSF
     C                   ELSE
     C                   MOVE      ENGAD3        WSADSF
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADSF
     C                   MOVE      ADR3          WSADSF
     C                   END
     C*
     C*
     C*** SJEKK VALUTAKODE
     C*
     C     WSVALS        IFEQ      *BLANKS
     C     VALKOD        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSVALS
     C                   ELSE
     C                   MOVE      VALKOD        WSVALS
     C                   END
     C                   END
     C*
     C     WSVALS        IFNE      *BLANKS
     C     KODVAS        CHAIN     VALUL01                            66
     C   66              SETON                                        30
     C                   END
     C*
     C     SYUTLP        IFEQ      0
     C                   MOVE      FIUPS         XSUTL             4 2
     C                   MOVE      FIUPM         XSUMIN            2 0
     C                   ELSE
     C                   Z-ADD     SYUTLP        XSUTL
     C                   Z-ADD     SYMINU        XSUMIN
     C                   END
     C     XSUTL         IFEQ      99.99
     C                   MOVE      *ZEROS        XSUTL
     C                   END
     C*
     C*** TEST SALDO ER GÅTT OVER KREDITTGRENSE
     C     WSKNSF        IFNE      0
     C     KGRENS        IFNE      0
     C     WSKDFS        ANDNE     'X'
     C     KGRENS        MULT      1000          XKOVER           13 2
     C                   MOVE      *ZEROS        KSALDO
     C                   movel     wsavd         avdopd           11
     C                   move      wsopd         avdopd           11
     C                   movel     avdopd        ksaldo
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
      * legg til evt ufakturert fra oppdr-bildet..
     C     XXFAKE        CHAIN(N)  FAKT                               33
     C     *IN33         ifeq      *off
     C     FAKUNR        ANDEQ     KUNDNR
     C     FAOPKO        COMP      ' '                                3636
     C   36FAOPKO        COMP      'C'                                3636       *PROTECT
     C     *IN36         ifeq      *off
     C     WSFRAV        IFEQ      FICURR
     C                   ADD       WSFRAB        KSALDO
     C                   ELSE
     C     VALKFA        CHAIN     VALUL01                            95
     C  N95              DO
     C     WSFRAB        MULT      VALKU1        XWORK            15 4
     C     XWORK         DIV(H)    OMRFAK        FRANOK           15 2
     C                   ADD       FRANOK        KSALDO
     C                   END
     C                   END
     C                   end
     C                   end
     C     KSALDO        COMP      XKOVER                             65
     C   65
     CANN30              MOVE      'J'           KRGR              1
     C                   END
     C   65              SETON                                        30
     C*** TEST STOPPEKODE
     C*
     C     SYLIKV        COMP      ' '                                9292
     C   92              DO
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      WSKNSF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C  N33              MOVE      KLINAV        WSADSF
     C  N30KLISTO        IFEQ      'J'
     C                   MOVE      'J'           STOPPF
     C                   SETON                                        3065
     C                   END
     C                   END
     C                   END
     C*
      * henter nytt oljetillegg kun 1  gang
     C  N30PREVALT       ifeq      0
     C     HEKNSF        IFNE      0
     C     HEKNSF        IFNE      WSKNSF
     C                   EXSR      ENDVALT
     C                   move      'J'           byttfap           1
     C                   END
     C                   ELSE
      * KJØPER
     C     HEKNKF        IFNE      WSKNSF
     C                   EXSR      ENDVALT
     C                   move      'J'           byttfap           1
     C                   END
     C                   END
     C                   else
     c     PREVALT       ifne      wsknsf
     C                   EXSR      ENDVALT
     C                   END
     C                   END
     C*
     C*** TEST OM SELGERSMOTTAGER HAR OPPLYSNING. HVIS DET, SETT 99 PÅ
     C*
     C                   MOVE      WSKNSF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        99
     C                   END
     C                   END
     C*
     C*
     C*------------------------------------------------------------------------
     C*------------------------------------------------------------------------
     C*** TEST FORTOLLINGSAGENT    ( KUN VED 1/2 ELLER T I FELT FOR TRANSIT)
     C*------------------------------------------------------------------------
     C*------------------------------------------------------------------------
     C*
     C                   SETOFF                                       82
     C                   SETOFF                                       23
     C                   MOVE      *BLANKS       WSNAFA
     C                   MOVE      *BLANKS       WSADFA           30
     C*
     C     WSTSTA        COMP      '1'                                    82
     C  N82WSTSTA        COMP      '2'                                    82
     C     WSKNFA        IFNE      0
     C     WSTSTA        IFEQ      ' '
     C     INNLAN        ANDEQ     'N'
     C                   MOVE      '1'           WSTSTA
     C                   END
     C                   MOVE      WSKNFA        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            82
     C  N82INNLAN        IFEQ      'J'
     C     WSKNFA        CHAIN     KODTAG1                            82
     C                   END
     C  N82              DO
     C                   MOVE      WSKNFA        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        23
     C                   end
     C*
     C  N82              MOVE      KNAVN         WSNAFA
     C  N82POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADFA
     C                   ELSE
     C                   MOVE      ENGAD3        WSADFA
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADFA
     C                   MOVE      ADR3          WSADFA
     C                   END
     C                   MOVEL     WSADFA        WSADFX
     C                   END
     C*-----------------------------------------------------------------------
     C*-----------------------------------------------------------------------
     C*** TEST KJØPER
     C*-----------------------------------------------------------------------
     C*-----------------------------------------------------------------------
     C*
     C                   MOVE      *BLANKS       XKTLF            15
     C                   MOVE      *BLANKS       WSNAMK
     C                   MOVE      *BLANKS       WSADRK
     C     WSKDAK        IFEQ      'K'
     C                   MOVE      WSKNA         WSKNK
     C                   END
     C* Ved blank kjøper kopier ned Kjøpers F.mot
      * (men kode bak kan indikere IKKE kopier. Dft SKKopiKode er blank - blank bak betyr da KOPIER)
     C*
     C     WSKNK         IFEQ      0
     C     WSNAK         COMP      *BLANKS                                62
     C                   ELSE
     C                   MOVE      WSKNK         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            61
     C  N61              DO
      *
      * flytter eventuelt kjøpers  fakturamottager over
      *
     C     WSKNKF        IFEQ      0                                             2<-B
     C     WSKDFF        andeq     'K'
     C                   move      ' '           WSKDFK
     C     FMOT          IFEQ      0                                              3<-B
     C                   MOVE      WSKNK         WSKNKF
     C                   ELSE                                                     3
     C                   MOVE      FMOT          WSKNKF
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   MOVE      XXBRE         WSLBRE
     C                   MOVE      XXLEN         WSLLEN
     C  N61SYKONT        IFEQ      0
     C     WSPK4         ANDEQ     'J'
     C                   MOVEL     MANGLE        WSMSG
     C                   END
     C                   MOVE      KNAVN         WSNAMK
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADRK
     C                   ELSE
     C                   MOVE      ENGAD3        WSADRK
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADRK
     C                   MOVE      ADR3          WSADRK
     C                   END
     C   42WPLANT        IFEQ      *BLANKS
     C     WPSDT         ANDNE     *BLANKS
     C                   MOVE      SYLAND        WPLANT
     C                   END
     C                   END
     C  N61              MOVE      TLF           XKTLF
     C  N61WSOT          IFEQ      *BLANKS
     C                   MOVE      SYOPDT        WSOT
     C                   MOVE      'H'           UUR               1
     C                   CALL      'SYFA24'
     C                   PARM      WSKNA         UKNOP             8 0
     C                   PARM                    UUR
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM                    WSOT
     C                   END
     C*
     C  N61WSNAK         IFEQ      *BLANKS
     C                   MOVE      WSKNK         KUNDNR
     C     VADRK         CHAIN     VADR                               33
     C                   MOVE      *BLANKS       WSADK3
     C  N33              DO
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C     valand        ifne      *blanks
     c                   move      '   '         wsadk3
     c                   move      valand        wsadk3
     c                   end
     C                   END
     C   33              DO
     C                   MOVE      KNAVN         WSNAK
     C     DKUND         IFEQ      'D'
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   GOTO      UTDKJØ
     C                   END
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE
     C                   MOVE      ENGAD3        WSADK3
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END
     C     syland        ifne      *blanks
     c                   move      '   '         wsadk3
     c                   move      syland        wsadk3
     c                   end
     C                   END
     C                   END
     C*
     C*
     C                   END
     C*** END PÅ <WSKNK IFEQ 0>
     C     UTDKJØ        TAG
     C*
     C*
     C*
     C*
     C     SLTKU         TAG
     C     WSMSG         COMP      *BLANKS                            2727
     C*
     C*-----------------------------------------------------------------------
     C*-----------------------------------------------------------------------
     C*** TEST         FAKTURAMOTTAGER  kjøper   17  = feil
     C*-----------------------------------------------------------------------
     C*-----------------------------------------------------------------------
     C*
      *
      * VED FORENKLET MODUS FLYTT X OVER
      *
     C   32WSKNKF        IFEQ      0
     C                   MOVE      'X'           WSKDFK
     C                   END
     C     CALLFR        IFEQ      'I'
     C     CALLFR        OREQ      'U'
     C     INFULL        IFNE      'J'
     C                   MOVE      'X'           WSKDFK
     C                   END
     C                   END
     C*
     C                   SETOFF                                       17
     C     WSKDFK        IFEQ      'X'
     c     wsknkf        andeq     0
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      *BLANKS       WSVALk
     C                   ELSE
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      WSKNKF        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            17
     C  N17AKTKOD        COMP      'A'                                1717
     C  N17AKTKOD        COMP      'I'                                    17
     c  N17WSKDFK        COMP      'X'                                    17
     C   17              SETON                                        30
     C     *IN17         ifeq      '0'
     C                   MOVE      WSKNKF        FXKNR
     C     FRATXK        CHAIN     FRATXT                             33
     C   33FRAT2K        CHAIN     FRATXT                             33
     C  N33              SETON                                        46
     C                   END
     C*
     C*** TEST OM TASTET VALUTAKODEN TIL FAKTURAMOTTAGER ER GYLDIG
     C*
     C                   MOVE      *BLANKS       KUNVAL            3
     C  N17              DO
     C                   MOVE      KNAVN         WSNAKF
     C*
     C                   END
     C*
     C*
     C*** SJEKK VALUTAKODE
     C*
     C     WSVALk        IFEQ      *BLANKS
     c     *in17         andeq     *off
     C     VALKOD        IFEQ      *BLANKS
     C                   MOVE      FICURR        WSVALk
     C                   ELSE
     C                   MOVE      VALKOD        WSVALk
     C                   END
     C                   END
     C*
     C     WSVALk        IFNE      *BLANKS
     C     KODVAK        CHAIN     VALUL01                            66
     C   66              SETON                                        30
     C                   END
     C*
     C     SYUTLP        IFEQ      0
     C                   MOVE      FIUPS         XKUTL             4 2
     C                   MOVE      FIUPM         XKUMIN            2 0
     C                   ELSE
     C                   Z-ADD     SYUTLP        XKUTL
     C                   Z-ADD     SYMINU        XKUMIN
     C                   END
     C     XSUTL         IFEQ      99.99
     C                   MOVE      *ZEROS        XKUTL
     C                   END
     C*
     C*** TEST SALDO ER GÅTT OVER KREDITTGRENSE
     C     WSKNKF        IFNE      0
     C     KGRENS        IFNE      0
     C     WSKDFK        ANDNE     'X'
     C     KGRENS        MULT      1000          XKOVER           13 2
     C                   MOVE      *ZEROS        KSALDO
     C                   movel     wsavd         avdopd           11
     C                   move      wsopd         avdopd           11
     C                   movel     avdopd        ksaldo
     C                   CALL      'SYGE07CL'
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C                   PARM                    KSALDO           13 2
      * legg til evt ufakturert fra oppdr-bildet..
     C     XXFAKE        CHAIN(N)  FAKT                               33
     C     *IN33         ifeq      *off
     C     FAKUNR        ANDEQ     KUNDNR
     C     FAOPKO        COMP      ' '                                3636
     C   36FAOPKO        COMP      'C'                                3636       *PROTECT
     C     *IN36         ifeq      *off
     C     WSFRAV        IFEQ      FICURR
     C                   ADD       WSFRAB        KSALDO
     C                   ELSE
     C     VALKFA        CHAIN     VALUL01                            95
     C  N95              DO
     C     WSFRAB        MULT      VALKU1        XWORK            15 4
     C     XWORK         DIV(H)    OMRFAK        FRANOK           15 2
     C                   ADD       FRANOK        KSALDO
     C                   END
     C                   END
     C                   end
     C                   end
     C     KSALDO        COMP      XKOVER                             17
     C   17
     CANN30              MOVE      'J'           KRGR2             1
     C                   END
     C   17              SETON                                        30
     C*** TEST STOPPEKODE
     C*
     C     SYLIKV        COMP      ' '                                9292
     C   92              DO
     C                   MOVE      SYLIKV        KLIKOD
     C     KODLIK        CHAIN     KOLIKR                             33
     C  N33              MOVE      WSKNSF        XKN
     C  N33              MOVE      KLIKOD        XLIKOD
     C  N33              MOVE      KLINAV        XLINAV
     C  N33              MOVE      KLINAV        WSADSF
     C  N30KLISTO        IFEQ      'J'
     C                   MOVE      'J'           STOPPF2           1
     C                   SETON                                        3017
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C******************************************
     C     FINNVK        BEGSR
     C******************************************
     C*
     C* FINNER FRAKTBEREGNINGSVEKT
     C*
     C                   MOVE      KOVKKG        XXXKKG            5 0
     C                   MOVE      KOVLKG        XXXLKG            5 0
     C*
      *
      * SKJEKK AVVIKENDE OMREGNING i spesiafik kundeavtale
      *
     C                   move      'N'           AFOMRJN           1
     C     XXFAKE        CHAIN(N)  FAKT                               33
     C  N33FAAGRN        IFNE      *ZEROS
     C     FAAGRN        CHAIN     AVFRHL01                           33
     c  N33FAKUNR        IFEQ      AFKUND
     c     KUAVTA        oreq      AFKUND
     c     AFLKFR        ANDNE     '%%'
     C  N33              MOVE      AFOMRM        XXXKKG            5 0
     C  N33              MOVE      AFOMRL        XXXLKG            5 0
     C  N33              move      'J'           AFOMRJN
     C                   end
     C                   END
      *
      * skjekk om kunde har avvik generelt (lavere prio enn spesifik postal avtale..)
      *
     c     AFOMRJN       ifeq      'N'
     C                   MOVE      WSKNSF        FAKUNR
     C                   MOVE      FAKUNR        KUNDNR
     C     KUND1K        CHAIN     CUM3LM                             33
     C     *IN33         IFEQ      '0'
     C     m3m3          IFne      *zeros
     C                   Z-ADD     m3m3          XXXKKG
     C                   END
     C     mllm          IFne      *zeros
     C                   Z-ADD     mllm          XXXLKG
     C                   END
     C                   END
     C                   END
      *
     C     WSLM          MULT      XXXLKG        XFBV1             9 0
     C     WSM3          MULT      XXXKKG        XFBV2             9 0
     C     WSVKT         IFGE      XFBV1
     C                   Z-ADD     WSVKT         WSFBV
     C                   ELSE
     C                   Z-ADD     XFBV1         WSFBV
     C                   END
     C     WSFBV         IFLT      XFBV2
     C                   Z-ADD     XFBV2         WSFBV
     C                   END
      *
      * tar vare på fakturapart på frakt
      *
     c     wskdff        ifeq      'S'
     c                   move      wsknsf        frabet            8 0
     c                   end
     c     wskdff        ifeq      'K'
     c                   move      wsknkf        frabet            8 0
     c                   end
     C                   ENDSR
     C***********************************************
     C     MOVHUW        BEGSR
     C***********************************************
     C*
     C* Data er plukket fra hurtigbookingen - splitt via DS
     C                   MOVE      HUDATA        HUDS
     C                   MOVE      *BLANKS       HUDATA
     C* fyll workfelt
     C* A/M for avsender/mottaker gjøres om til koder for Selger/kjøper
     C     AM1           IFEQ      'A'
     C                   MOVE      'S'           AM1
     C                   END
     C     AM1           IFEQ      'M'
     C                   MOVE      'K'           AM1
     C                   END
     C*
     C     WSKDAK        IFEQ      *BLANKS
     C                   MOVE      AM1           WSKDAK
     C                   ENDIF
     C     OPDG1         IFNE      *BLANKS
     C     NUM           CHECK     OPDG1         TSTRES            1 0
     C     TSTRES        IFEQ      *ZEROS
     C                   MOVEA     OPDG1         AA
     C                   EXSR      SRNFLY
     C                   Z-ADD     ANUM          WSKNA
     C                   ELSE
     C     WSNAA         IFEQ      *BLANKS
     C                   MOVEL     OPDG1         WSNAA
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C     WSVS1         IFEQ      *BLANKS
     C                   MOVEL     VAREB1        WSVS1
     C                   ENDIF
     C     AM1           IFEQ      'S'
     C     WSNAK         IFEQ      *BLANKS
     C                   MOVE      FRI11         WSNAK
     C                   ENDIF
     C     WSADK1        IFEQ      *BLANKS
     C                   MOVE      FRI21         WSADK1
     C                   ENDIF
     C     WSADK2        IFEQ      *BLANKS
     C                   MOVE      FRI31         WSADK2
     C                   ENDIF
     C     WSADK3        IFEQ      *BLANKS
     C                   MOVE      FRI41         WSADK3
     C                   ENDIF
     C                   ELSE
     C     WSNAS         IFEQ      *BLANKS
     C                   MOVE      FRI11         WSNAS
     C                   ENDIF
     C     WSADS1        IFEQ      *BLANKS
     C                   MOVE      FRI21         WSADS1
     C                   ENDIF
     C     WSADS2        IFEQ      *BLANKS
     C                   MOVE      FRI31         WSADS2
     C                   ENDIF
     C     WSADS3        IFEQ      *BLANKS
     C                   MOVE      FRI41         WSADS3
     C                   ENDIF
     C                   END
     C     WSNT          IFEQ      *ZEROS
     C                   Z-ADD     ANT1          WSNT
     C                   ENDIF
     C     WSVKT         IFEQ      *ZEROS
     C                   Z-ADD     VEKT1         WSVKT
     C                   ENDIF
     C     WSM3          IFEQ      *ZEROS
     C                   Z-ADD     M31           WSM3
     C                   ENDIF
     C     WSLM          IFEQ      *ZEROS
     C                   Z-ADD     LM1           WSLM
     C                   ENDIF
     C* Stedsnavn/kode
     C* Når IKKE postnrbasert må være kode
     C     *IN42         IFEQ      *OFF
     C     WSSDFD        IFEQ      *ZEROS
     C                   MOVE      FDATO1        WSSDFD
     C                   ENDIF
     C     WSSDTD        IFEQ      *ZEROS
     C                   MOVE      TDATO1        WSSDTD
     C                   ENDIF
     C     WSSDF         IFEQ      *BLANKS
     C                   MOVEL     FRA1          WSSDF
     C                   ENDIF
     C     WSSDT         IFEQ      *BLANKS
     C                   MOVEL     TIL1          WSSDT
     C                   ENDIF
     C                   ELSE
     C     WPSDFD        IFEQ      *ZEROS
     C                   MOVE      FDATO1        WPSDFD
     C                   ENDIF
     C     WPSDTD        IFEQ      *ZEROS
     C                   MOVE      TDATO1        WPSDTD
     C                   ENDIF
     C* Når postnrbasert - frasted ....
     C*     kan være rent postnummer.......
     C     FRA115        IFGE      '00000'
     C     FRA115        ANDLE     '99999'
     C     WPSDF         IFEQ      *BLANKS
     C                   MOVE      FRA115        WPSDF
     C                   ENDIF
     C                   ELSE
     C*     eller landkode + postnummer.......
     C     FRA137        IFGE      '00000'
     C     FRA137        ANDLE     '99999'
     C     WPLANF        IFEQ      *BLANKS
     C                   MOVE      FRA112        WPLANF
     C                   ENDIF
     C     WPSDF         IFEQ      *BLANKS
     C                   MOVE      FRA137        WPSDF
     C                   ENDIF
     C                   ELSE
     C*     eller rent alfa stedsnavn  ......
     C     WPPNS1        IFEQ      *BLANKS
     C                   MOVEL     FRA1          WPPNS1
     C                   ENDIF
     C                   END
     C                   END
     C* Når postnrbasert - tilsted ....
     C*     kan være rent postnummer.......
     C     TIL115        IFGE      '00000'
     C     TIL115        ANDLE     '99999'
     C     WPSDT         IFEQ      *BLANKS
     C                   MOVE      TIL115        WPSDT
     C                   ENDIF
     C                   ELSE
     C*     eller landkode + postnummer.......
     C     TIL137        IFGE      '00000'
     C     TIL137        ANDLE     '99999'
     C     WPLANT        IFEQ      *BLANKS
     C                   MOVE      TIL112        WPLANT
     C                   ENDIF
     C     WPSDT         IFEQ      *BLANKS
     C                   MOVE      TIL137        WPSDT
     C                   ENDIF
     C                   ELSE
     C*     eller rent alfa stedsnavn  ......
     C     WPPNS2        IFEQ      *BLANKS
     C                   MOVEL     TIL1          WPPNS2
     C                   ENDIF
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C***********************************************
     C     SRNFLY        BEGSR
     C***********************************************
     C                   MOVEA     *BLANKS       AB
     C                   Z-ADD     15            X                 3 0
     C                   Z-ADD     15            Y                 3 0
     C* Finner bakerste posisjon med tall i.
     C     AA(Y)         DOWEQ     *BLANK
     C                   SUB       1             Y                      3333
     C  N33              ENDDO
     C* Flytter fra AA til AB.
     C     Y             DOWGT     0
     C     AA(Y)         IFGE      '0'
     C     AA(Y)         ANDLE     '9'
     C                   MOVEA     AA(Y)         AB(X)
     C                   SUB       1             X
     C                   ENDIF
     C                   SUB       1             Y
     C                   ENDDO
     C* Fyll resten med null (0).
     C     X             DOWGT     0
     C                   MOVEA     '0'           AB(X)
     C                   SUB       1             X
     C                   ENDDO
     C* Flytt over til resultatfelt
     C                   MOVEA     AB            ACHAR            15
     C                   MOVEL     ACHAR         ANUM             15 0
     C                   ENDSR
     C***********************************************
     C     MOVHFW        BEGSR
     C***********************************************
      * TOTALT OMSKREVET KUNDFLYTT
      *
      * selger
     C                   MOVE      HEKDFS        WSKDFS
     C                   MOVE      HEVALS        WSVALS
     C                   MOVE      HEKNSF        WSKNSF
     C                   MOVE      HEANS         WSANS
     C     HEKNSF        ifne      0
     C                   MOVE      HENASF        WSNASF
     c                   end
      * kjøper
     C                   MOVE      HEKDFK        WSKDFK
     C                   MOVE      HEVALK        WSVALK
     C                   MOVE      HEKNKF        WSKNKF
     C                   MOVE      HEANK         WSANK
     C     HEKNKF        ifne      0
     C                   MOVE      HENAKF        WSNAKF
     C                   end
      *
     C*
     C                   MOVE      TRKDFF        WSKDFF
     C                   MOVE      HESDL         WSSDL
     C                   MOVE      HESDLA        WSSDLA
     C  N28              MOVE      HESG          WSSG
     C  N28              MOVE      HEPRO         WSPRO
     C   28              MOVE      *ZEROS        WSPRO
     C  N28              MOVEL     HEHAWB        WSHAWB
     C   28              MOVE      *BLANKS       WSHAWB
     C  N28              MOVEL     HXSNDN        WSSNDN
     C   28              MOVE      *BLANKS       WSSNDN
     C  N28              MOVE      HXPALL        WSAPLL
     C   28              MOVE      *ZEROS        WSAPLL
     C  N28              MOVEL     HXBLGK        WSBLGK
     C   28              MOVE      *BLANKS       WSBLGK
     C  N28              MOVEL     HXLKOD        WSLKOD
     C   28              MOVE      *BLANKS       WSLKOD
     C  N28              MOVEL     HXLLST        WSLLST
     C  N28              Z-add     hepoen        wspoen
     C   28              MOVE      *BLANKS       WSLLST
     C                   MOVE      HEPOS2        WSPOS2
     C                   MOVE      HEPOS1        WSPOS1
     C                   MOVE      HEGN          WSGN
     C   28              MOVE      *BLANKS       WSGN
     C                   MOVE      HETLE         WSTLE
     C   28              MOVE      *BLANKS       WSTLE
     C                   MOVE      HETLL         WSTLL
     C   28              MOVE      *BLANKS       WSTLL
     C                   MOVE      HETLKU        WSTLKU
     C   28              MOVE      *BLANKS       WSTLKU
     C                   MOVE      HENTVS        WSNTVS
     C                   MOVEL     HERFA         WSRFA
     C                   MOVEL     HERFK         WSRFK
     C   28              MOVE      *blanks       WSRFA
     C   28              MOVE      *blanks       WSRFK
     C                   MOVE      HESDF         WSSDF
     C                   MOVE      HESDT         WSSDT
     C   42              MOVE      HESDF         WPSDF
     C   42              MOVE      HESDT         WPSDT
     C                   MOVE      HESDFF        WSSDFF
     C                   MOVE      HESDVT        WSSDVT
     C                   MOVE      HEVALT        WSVALT
     C                   MOVE      HEVALP        XVALP
     C* Ved IKKE postal hentes landkoder WSLANF/WSLANT... via stedskode
     C   42              MOVE      HELKA         WPLANF
     C   42              MOVE      HETRI         WPLANT
     C   42              MOVE      HELKS         WPLAN1
     C   42              MOVE      HELKK         WPLAN2
     C                   MOVE      TRKNFA        WSKNA
     C                   MOVE      HENAA         WSNAA
     C                   MOVE      HEKNS         WSKNS
     C                   MOVE      HENAS         WSNAS
     C                   MOVE      HEADS1        WSADS1
     C                   MOVE      HEADS2        WSADS2
     C                   MOVE      HEADS3        WSADS3
     C                   MOVE      HEKNK         WSKNK
     C                   MOVE      HENAK         WSNAK
     C                   MOVE      HEADK1        WSADK1
     C                   MOVE      HEADK2        WSADK2
     C                   MOVE      HEADK3        WSADK3
     C                   MOVE      HEOT          WSOT
     C                   MOVE      HEFR          WSFR
     C   42              MOVE      HEKDPL        WSKDPL
     C                   MOVE      HEGM1         WSGM1
     C                   MOVE      HENT          WSNT
     C                   MOVE      HEVS1         WSVS1
     C                   MOVE      HESTL4        WSSLI4
N04  C                   MOVE      HTGX          WTGX
n04  C                   MOVE      HESTN6        WSSTN6
     C                   MOVE      HEVKT         WSVKT
     C                   MOVE      HELM          WSLM
     C                   MOVE      HEFBV         WSFBV
     C                   MOVE      HEGM2         WSGM2
     C                   MOVE      HEVS2         WSVS2
     C                   MOVE      HEPK1         WSPK1
     C                   MOVE      HEPK2         WSPK2
     C                   MOVE      HEPK3         WSPK3
     C                   MOVE      HEPK4         WSPK4
     C                   MOVE      HEPK5         WSPK5
     C                   MOVE      HEPK6         WSPK6
     C                   MOVE      HEPK7         WSPK7
     C                   MOVE      HEPK8         WSPK8
     C                   MOVE      HEKF          WSKF
     C                   MOVE      HEKFT1        WSKFT1
     C                   MOVE      HEFT1         WSFT1
      *
     C                   MOVE      *BLANKS       WSUSR
     C     WSOPD         IFNE      0
     C     UTLLGK        SETGT     UTLLOGF
     C     UTLL2K        READPE    UTLLOGF                                33
     C  N33              MOVE      ULUSR         WSUSR
     C                   END
     C* FELT I HEADFR
     C                   MOVE      TRRUND        WSRUND
     C                   if        TRSTAE = 'O' and TRAVD2 = 0
     C                   eval      TRSTAE = ' '
     c                   endif
     C                   if        TRSTAF = 'O' and TRAVD1 = 0
     C                   eval      TRSTAF = ' '
     c                   endif
     C                   MOVE      TRSTAE        WSSTAE
     C                   MOVE      TRSTAF        WSSTAF
     C                   MOVE      HEM3          WSM3
     C  N28WSSTAF        COMP      'F'                                    43
     C  N28
     CANN43WSSTAF        COMP      'O'                                    43
     C  N28WSSTAE        COMP      'F'                                    44
     C  N28
     CANN44WSSTAE        COMP      'O'                                    44
     C                   MOVE      XDFDDD        WSDTD1
     C                   MOVE      XDFDMM        WSDTM1
     C                   MOVE      XDFDÅÅ        WSDTÅ1
     C                   MOVE      TRSDFK        WSSDFK
     C                   MOVE      XDTDDD        WSDTD2
     C                   MOVE      XDTDMM        WSDTM2
     C                   MOVE      XDTDÅÅ        WSDTÅ2
     C                   MOVE      TRSDTK        WSSDTK
     C                   MOVE      XFFDDD        WSDTD3
     C                   MOVE      XFFDMM        WSDTM3
     C                   MOVE      XFFDÅÅ        WSDTÅ3
     C                   MOVE      TRSFFK        WSSFFK
     C                   MOVE      XVTDDD        WSDTD4
     C                   MOVE      XVTDMM        WSDTM4
     C                   MOVE      XVTDÅÅ        WSDTÅ4
     C                   MOVE      TRSVTK        WSSVTK
     C                   MOVE      TRKDAK        WSKDAK
     C                   MOVE      TRVERV        WSVERV
     C                   MOVE      TRVERB        WSVERB
     C                   MOVE      TRETTV        WSETTV
     C                   MOVE      TRETTB        WSETTB
     C                   MOVE      TRFRAK        WSFRAK
     C                   MOVE      TRFRAV        WSFRAV
     C                   MOVE      TRFRAB        WSFRAB
     C                   MOVE      TRMVA         WSMVA
     C                   MOVE      TRFA11        WSFA11
     C                   MOVE      TRFA12        WSFA12
     C                   MOVE      TRFLP1        WSFLP1
     C                   MOVE      TRFA21        WSFA21
     C                   MOVE      TRFA22        WSFA22
     C                   MOVE      TRFLP2        WSFLP2
     C                   MOVE      HEKNA         WSKNFA
     C                   MOVE      TRTSTA        WSTSTA
      * Div.felt som vises kun i output ved innland...
      * (mangel på ledige indikatore / bruker hjelpewrkfelt
     C                   clear                   WSETTX
     C                   clear                   WSET82
     C                   clear                   WSUFTX
     C     Innlan        IFEQ      'J'
     C     WSETTB        IFne      *zeros
     C                   move      'Ek/COD'      WSETTX
     C                   z-add     WSETTB        WSET82
     C                   end
     C     WSKF          IFne      *blanks
     C                   move      'U.fbh'       WSUFTX
     C                   end
     C                   end
      *
     C* DERSOM PÅ TUR - VIA/DISP/TURER SJEKK AVREGNINGSSTATUS
     C                   MOVE      *blanks       AVRTXT
     C  N28HEPRO         IFNE      *ZEROS
     C     HEADFK        CHAIN(N)  DISP                               35
     C  N35TURKEY        CHAIN     TURER                              35
     C  N35TUAVRE        IFEQ      'X'
     C                   MOVE      AVRTX0        AVRTXT
     C                   end
     C                   END
     C*
     C* FELT I HESTED (STEDSNAVN I KLARTEKST VED POSTNR-KODE)
     C   28
     CAN 42HEADKK        CHAIN(N)  HESTED                             35
     C  N28
     CAN 42HEADFK        CHAIN(N)  HESTED                             35
     C  N35              DO
     C                   MOVEL     HSFROM        WPPNS1
     C                   MOVEL     HSTO          WPPNS2
     C                   MOVEL     HSVIA1        WPPNS3
     C                   MOVEL     HSVIA2        WPPNS4
     C                   END
     C*
     C* INDIKATOR 28 = KOPIERING
     C*
     C   28              DO
     C                   MOVE      *BLANKS       WSSTAE
     C                   MOVE      *BLANKS       WSSTAF
     C                   MOVE      *ZEROS        WSRUND
     C     XKOPI         IFNE      'J'
     C                   MOVE      ' '           WSPK1
     C                   MOVE      ' '           WSPK2
     C                   MOVE      ' '           WSPK3
     C                   MOVE      ' '           WSPK4
     C                   MOVE      ' '           WSPK5
     C                   MOVE      ' '           WSPK6
     C                   MOVE      ' '           WSPK7
     C                   MOVE      ' '           HE01
     C                   END
     C                   Z-ADD     0             HENTF
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C     INNLAN        IFNE      'J'
     C                   MOVE      *ZEROS        WSSDFD
     C                   MOVE      *ZEROS        WPSDFD
     C                   MOVE      *ZEROS        WSSDTD
     C                   MOVE      *ZEROS        WPSDTD
     C                   ELSE
     C                   MOVE      UDAY          WSDTD1
     C                   MOVE      UMONTH        WSDTM1
     C                   MOVE      UYEAR         WSDTÅ1
     C                   MOVE      WSSDFD        WSSDTD
     C                   END
     C                   END
     C* VED ENDRING AV OPPDRAG MED DUP UNDER SEG  SJEKK OM VISSE
     C* DATA ER ENDRET (I SÅ FALL AUTOM. OPPDATERING PÅ DUP).
     C* (ANT.FELT ER MANDATORY-GMNT ULIK 0 ER "INDIKATOR" PÅ SJEKK.)
     C                   MOVE      WSNT          GMNT
     C                   MOVE      WSVKT         GMVKT
     C                   MOVE      WSFBV         GMFBV
     C                   MOVE      WSLM          GMLM
     C                   MOVE      WSM3          GMM3
     C* For sjekk om vekt er endret av ekstern prosess
     C                   MOVE      WSVKT         GMVKT2
     C                   MOVE      WSM3          GMM32
     C*
      * ta vare på gamle kundeverdier
     c                   move      wsknkf        wsknkfg           8 0
     c                   move      wsknsf        wsknsfg           8 0
     C                   ENDSR
     C*
     C***********************************************
     C     MOVFVW        BEGSR
     C***********************************************
      *
      * flytter fra varelinjer fraktbrev varelinjer ved oppstart
      * tømmer poeng farlig gods
      *
     c                   movea     *zeros        FAP
     c                   move      *zeros        WSPOEP
     c                   move      *zeros        WSPOEN
     C                   MOVE      *BLANKS       FLER3             5
     C                   Z-ADD     1             FVLINR
     C                   Z-ADD     1             FVFBNR
     c                   move      heavd         fvavd
     c                   move      heopd         fvopd
     C                   MOVE      'F'           FVRI
     C                   Z-ADD     0             NR                5 0
     C                   setoff                                       33
      *------------------------------------------------------------------
      * Varelinjer   DOKUFV
      *------------------------------------------------------------------
     C     DOKUFVK       setll     dokufv
      *
     C     *in33         DOWEQ     '0'
     C     DOKUFVKE      reade(n)  dokufv                                 33
      *
      * fikser gamle oppdrag som mangler i DOKUFV
      *
     C     *in33         ifeq      '1'
     c     nr            andeq     0
     c                   move      wsvs1         fvt(1)
     c                   z-add     wsvkt         fvk(1)
     c                   z-add     wsm3          fm3(1)
     c                   z-add     wslm          flm(1)
     c                   z-add     wsnt          fnt(1)
     c                   movel     wsgm1         fgm(1)
     c                   goto      utfv
     c                   end
     C     *in33         ifeq      '0'
     C***                add       1             nr
     C                   z-add     FVLINR        nr
      * kun 3 første fra DOKUFV
     C     NR            iflt      4
     c                   movel     FVANT         FNT(NR)
     c                   movel     FVPAKN        FFP(NR)
     c                   movel     FVVT          FVT(NR)
     c                   movel     FVVKT         FVK(NR)
     c                   movel     FVVOL         FM3(NR)
     c                   movel     FVLM          FLM(NR)
     c                   movel     FVLM2         FLM2(NR)
     c                   movel     FVLEN         FLE(NR)
     c                   movel     FVBRD         FBR(NR)
     c                   movel     FVHOY         FHO(NR)
     c                   move      fvavd         fmavd
     c                   move      fvopd         fmopd
     C                   Z-ADD     FVFBNR        FMFBNR
     C                   Z-ADD     FVLINR        FMLINR
     C                   MOVE      'F'           FMRI
     C                   Z-ADD     1             FMMKNR
     C                   Z-ADD     1             FMLONR
      *------------------------------------------------------------------
      * merke nummer DOKUFM
      *------------------------------------------------------------------
     c     dokufM11K     chain(n)  dokufm                             34
     c  N34              movel     FMMRK1        FGM(NR)
     c                   else
     c                   move      '+(F8)'       FLER3
     C                   endif
      *------------------------------------------------------------------
      * Farlig gods  DOKUFVF
      *------------------------------------------------------------------
     c                   move      fvavd         ffavd
     c                   move      fvopd         ffopd
     C                   Z-ADD     FVFBNR        FFFBNR
     C                   Z-ADD     FVLINR        FFLINR
     c                   z-add     1             FFLIN2
     c                   setoff                                       34
     c     dokufvfk      setll     dokufvf
     c     *in34         doweq     '0'
     c     dokufvfk      reade     dokufvf                                34
     c     *in34         ifeq      '0'
     C     NR            iflt      4
     c     fflin2        ifeq      1
     c                   movel     FFUNNR        FUN(NR)
     c                   movel     FFEMBG        FEM(NR)
     c                   movel     FFENH         FMT(NR)
     c                   z-add     FFANTK        FAK(NR)
     c                   z-add     FFANTE        FAM(NR)
     c                   end
      * for poeng summeres alle linjer
     c                   add       FFPOEN        FAP(NR)
     c                   add       FFPOEN        WSPOEN
     c                   else
     c                   add       FFPOEN        WSPOEP
     c                   add       FFPOEN        WSPOEN
     c                   end
     c                   end
     c                   end
      *
      *
     C                   endif
     C                   ENDDO
     C     utfv          ENDSR
     C***********************************************
     C     OPDDOKUFV     BEGSR
     C***********************************************
      * oppdaterer dokufv fra OPDHEA
      *
     c*                  clear                   dokufmr
     c                   clear                   dokufvr
     c                   move      heavd         fvavd
     c                   move      heopd         fvopd
     C                   Z-ADD     1             FVFBNR
     C                   Z-ADD     1             FVLINR
     C                   MOVE      'F'           FVRI
     C                   Z-ADD     0             NR                5 0
     C                   setoff                                       33
      *
     C     1             DO        3             NR
     C     FNT(NR)       ifne      0
     C                   Z-ADD     NR            FVLINR
     C     DOKUFVK       chain     dokufv                             33
     C     FLE(NR)       IFNE      0
     C     FBR(NR)       ANDNE     0
     C     FHO(NR)       ANDNE     0
     C     FNT(NR)       ANDNE     0
     C     FLE(NR)       MULT      FBR(NR)       XM3F             15 4
     C                   MULT      FBR(NR)       XM3F             15 4
     C                   MULT      FNT(NR)       XM3F
     C     XM3F          DIV       1000000       FM3(NR)
     C                   END
     c                   movel     FNT(NR)       FVANT
     c                   movel     FFP(NR)       FVPAKN
     c                   movel     FVT(NR)       FVVT
     c                   movel     FVK(NR)       FVVKT
     c                   movel     FM3(NR)       FVVOL
     c                   movel     FLM(NR)       FVLM
     c                   movel     FLM2(NR)      FVLM2
     c                   movel     FLE(NR)       FVLEN
     c                   movel     FBR(NR)       FVBRD
     c                   movel     FHO(NR)       FVHOY
     c   33              write     dokufvr
     c  N33              update    dokufvr
      *
      * merke og nummer til dokufm
      *
     c                   clear                   dokufmr
     c                   move      fvavd         fmavd
     c                   move      fvopd         fmopd
     C                   Z-ADD     1             FMFBNR
     C                   Z-ADD     FVLINR        FMLINR
     C                   MOVE      'F'           FMRI
     C                   Z-ADD     1             FMMKNR
     C                   Z-ADD     1             FMLONR
     c     dokufM11K     chain     dokufm                             34
     c                   movel     FGM(NR)       FMMRK1
     c     FGM(NR)       ifne      *blanks
     c  N34              update    dokufmr
     c   34              write     dokufmr
     c                   else
     c  N34              delete    dokufmr
     c                   endif
      *
      * farlig gods  DOKUFVF
      *
     c                   clear                   dokufvfr
     c                   move      fvavd         ffavd
     c                   move      fvopd         ffopd
     C                   Z-ADD     FVFBNR        FFFBNR
     C                   Z-ADD     FVLINR        FFLINR
     C                   Z-ADD     1             FFLIN2
     c     dokufvfk      chain     dokufvf                            34
     c                   movel     FUN(NR)       FFUNNR
     c                   movel     FEM(NR)       FFEMBG
     c     fmt(nr)       ifeq      'L'
     c                   movel     'LTR'         FFENH
     c                   end
     c     fmt(nr)       ifeq      'K'
     c                   movel     'KG '         FFENH
     c                   end
     c                   z-add     FAK(NR)       FFANTK
     c                   z-add     FAM(NR)       FFANTE
     C     UnNrKeyF      chain     ADRUNNRF                           33
     C  N33              MOVE      ADKLAS        FFKLAS
     C  N33              MOVE      ADSEDD        FFSEDD
     C  N33              MOVE      ADFAKT        FFFAKT
     C  N33              EVAL      FFPOEN = FFANTE * FFFAKT
     c                   z-add     FFPOEN        FAP(NR)
     c     FUN(NR)       ifne      *blanks
     c  N34              update    dokufvfr
     c   34              write     dokufvfr
     c                   else
     c  N34              delete    dokufvfr
     c                   endif
     c                   endif
     C                   ENDDO
     C**                 XFOOT     FAP           WSPOEN
     C                   ENDSR
     C***********************************************
     C     SUMDOKUFW     BEGSR
     C***********************************************
      *
      * summerer varelinje fra skjermen
      *  WSNT  WSVKT WSM3  WSLM WSLMLA
      *
     C     1             DO        3             NR
     C     FLE(NR)       IFNE      0
     C     FBR(NR)       ANDNE     0
     C     FHO(NR)       ANDNE     0
     C     FNT(NR)       ANDNE     0
     C     FLE(NR)       MULT      FBR(NR)       XM3F
     C                   MULT      FBR(NR)       XM3F
     C                   MULT      FNT(NR)       XM3F
     C     XM3F          DIV(h)    1000000       FM3(NR)
     C                   END
     C                   ENDDO
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *BLANKS       WSVS2
     C                   XFOOT     FNT           WSNT
     C                   XFOOT     FVK           WSVKT
     C                   XFOOT     FM3           WSM3
     C                   XFOOT     FLM           WSLM
     C                   XFOOT     FLM2          WSLMLA
     C                   MOVEL     FGM(1)        WSGM1
     C     FFP(1)        ifne      *blanks
     C                   MOVEL     FFP(1)        WSVS1
     C     WSVS1         CAT       FVT(1):1      WSVS1
     C                   ELSE
     C                   EVAL      WSVS1=FVT(1)
     C                   END
     C                   MOVEL     FGM(2)        WSGM2
     C                   MOVEL     FFP(2)        WSVS2
     C     WSVS2         CAT       FVT(2):1      WSVS2
     C                   ENDSR
     C***********************************************
     C     SUMDOKUF      BEGSR
     C***********************************************
      * summerer fra dokuf
     C                   exsr      OPDDOKUFV
     C                   Z-ADD     1             FVLINR
     C                   Z-ADD     1             FVFBNR
     c                   move      heavd         fvavd
     c                   move      heopd         fvopd
     C                   MOVE      'F'           FVRI
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *BLANKS       WSVS2
     c                   move      *zeros        WSNT
     c                   move      *zeros        WSVKT
     c                   move      *zeros        WSM3
     c                   move      *zeros        WSLM
     c                   move      *zeros        WSLMLA
     C                   setoff                                       33
     C     DOKUFVK       setll     dokufv
      *
     C     *in33         DOWEQ     '0'
     C     DOKUFVKE      reade(n)  dokufv                                 33
     C     *in33         ifeq      '0'
     C                   ADD       FVANT         WSNT
     C                   add       fvvkt         WSVKT
     C                   add       fvvol         WSM3
     C                   add       fvlm          WSlm
     C                   add       fvlm2         WSlmLA
     C                   endif
     C                   ENDDO
     C     WSGM1         IFEQ      *BLANKS
     C                   MOVEL     FGM(1)        WSGM1
     C                   END
     c     WSVS1         ifeq      *blanks
     C     FFP(1)        IFNE      *BLANKS
     C                   MOVEL     FFP(1)        WSVS1
     C     WSVS1         CAT       FVT(1):1      WSVS1
     C                   ELSE
     C                   EVAL      WSVS1=FVT(1)
     C                   END
     C                   END
     C     WSGM2         IFEQ      *BLANKS
     C                   MOVEL     FGM(2)        WSGM2
     C                   END
     C     WSVS2         IFEQ      *blanks
     C                   MOVEL     FFP(2)        WSVS2
     C     WSVT2         CAT       FVT(2):1      WSVS2
     c                   end
     C                   ENDSR
     C***********************************************
     C     MOVB1         BEGSR
     C***********************************************
      * 16 ON = TASTET F16 PÅ EKSISTERENDE OPPDRAG FOR Å SKAPE NYTT
     C   16              EXSR      GMLSTA
     C   16              MOVE      ' '           GMST
     C                   MOVE      *ZEROS        DSPONR
     C                   MOVE      *BLANKS       DSLK
     C                   MOVE      *ZEROS        WSOPD
     C*BEVAR DISPONERINGS-TURAVDELING FOR Å OPPDATERE DISP VED F16.
     C   16              MOVE      DITUAV        XITUAV            4 0
     C  N16              MOVE      *ZEROS        WSPRO
     C  N16              MOVE      *BLANKS       WSHAWB
     C                   MOVE      *BLANKS       WSSNDN
     C                   MOVE      *BLANKS       WSRFA
     C                   MOVE      *BLANKS       WSRFK
     C                   MOVE      *BLANKS       WSSDF
     C                   MOVE      *BLANKS       WSSDT
     C                   MOVE      *BLANKS       WSVALT
     C                   MOVE      *ZEROS        WSVALP
     C  N16              MOVE      *BLANKS       WPLANF
     C  N16              MOVE      *BLANKS       WPLANT
     C  N16
     CAN 42KOAIE         IFEQ      'E'
     C                   MOVE      FILAND        WPLANF
     C                   MOVE      KOALK         WPLANT
     C                   ELSE
     C     KOAIE         IFEQ      'I'
     C                   MOVE      KOALK         WPLANF
     C                   MOVE      FILAND        WPLANT
     C                   ELSE
     C     KOAIE         IFEQ      'D'
     C                   MOVE      FILAND        WPLANF
     C                   MOVE      FILAND        WPLANT
     C                   END
     C                   END
     C                   END
     C  N16              MOVE      *BLANKS       WPLAN1
     C  N16              MOVE      *BLANKS       WPLAN2
     C     INNLAN        IFEQ      'J'
     C  N16              MOVE      *ZEROS        WSKNA
     C  N16              MOVE      *BLANKS       WSNAA
     C  N16              MOVE      *BLANKS       WSADA
     C                   ELSE
     C                   MOVE      *ZEROS        WSKNA
     C                   MOVE      *BLANKS       WSNAA
     C                   MOVE      *BLANKS       WSADA
     C                   END
     C                   MOVE      *ZEROS        WSKNS
     C                   MOVE      *ZEROS        WSANS
     C                   MOVE      *BLANKS       WSKDFS
     C                   MOVE      *BLANKS       WSVALS
     C                   MOVE      *BLANKS       WSSDL
     C                   MOVE      *BLANKS       WSSDLA
     C                   MOVE      *ZEROS        WSKNSF
     C                   MOVE      *BLANKS       WSNASF
     C                   MOVE      *BLANKS       WSADSF
     C                   MOVE      *ZEROS        WSKNKF
     C                   MOVE      *BLANKS       WSNAKF
     C                   MOVE      *ZEROS        WSANK
     C                   MOVE      *BLANKS       WSKDFK
     C                   MOVE      *BLANKS       WSVALK
     C                   MOVE      *BLANKS       WSNAMS
     C                   MOVE      *BLANKS       WSADRS
     C                   MOVE      *BLANKS       WSNAS
     C                   MOVE      *BLANKS       WSADS1
     C                   MOVE      *BLANKS       WSADS2
     C                   MOVE      *BLANKS       WSADS3
     C                   MOVE      *ZEROS        WSKNK
     C                   MOVE      *BLANKS       WSNAMK
     C                   MOVE      *BLANKS       WSNAFA
     C                   MOVE      *BLANKS       WSADFX
     C                   MOVE      *BLANKS       WSADRK
     C                   MOVE      *BLANKS       WSNAK
     C                   MOVE      *BLANKS       WSADK1
     C                   MOVE      *BLANKS       WSADK2
     C                   MOVE      *BLANKS       WSADK3
     C                   MOVE      *BLANKS       WSOT
     C                   MOVE      *BLANKS       WSFR
     C                   MOVE      *BLANKS       WSKDPL
     C                   MOVE      *BLANKS       WSGM1
     C                   MOVE      *ZEROS        WSNT
     C                   MOVE      *BLANKS       WSVS1
     C                   MOVE      *BLANKS       WSSLI4
N04  C                   MOVE      *BLANKS       WTGX
n04  C                   MOVE      *blanks       WSSTN6
     C                   MOVE      *ZEROS        WSVKT
     C                   MOVE      *ZEROS        GMVKT2
     C                   MOVE      *ZEROS        GMM32
     C                   MOVE      *ZEROS        WSLM
     C                   MOVE      *ZEROS        WSFBV
     C                   MOVE      *BLANKS       WSGM2
     C                   MOVE      *BLANKS       WSVS2
     C                   MOVE      *BLANKS       WSSDFF
     C                   MOVE      *BLANKS       WSSDVT
     C                   MOVE      *BLANKS       WSPK1
     C                   MOVE      *BLANKS       WSPK2
     C                   MOVE      *BLANKS       WSPK3
     C                   MOVE      *BLANKS       WSPK4
     C                   MOVE      *BLANKS       WSPK5
     C                   MOVE      *BLANKS       WSPK6
     C                   MOVE      *BLANKS       WSPK7
     C                   MOVE      *BLANKS       WSKF
     C                   MOVE      *BLANKS       WSKFT1
     C                   MOVE      *BLANKS       WSFT1
     C                   MOVE      *BLANKS       WSUSR
     C                   MOVE      *BLANKS       WSTLE
     C                   MOVE      *BLANKS       WSTLL
     C                   MOVE      *BLANKS       WSTLKU
     C  N16              MOVE      *BLANKS       WSGN
     C  N16              MOVE      *BLANKS       WSPOS1
     C  N16              MOVE      *ZEROS        WSPOS2
     C   16WSPOS1        IFNE      *BLANKS
     C     WSPOS2        IFEQ      *ZEROS
     C                   CALL      'SYFA10C'
     C                   PARM                    WSPOS1
     C                   ELSE
     C                   ADD       1             WSPOS2
     C                   END
     C                   END
     C* FELT I HESTED (NÅR POSTNUMMERBASERT STED)
     C   42              MOVE      *BLANKS       WPPNS1
     C   42              MOVE      *BLANKS       WPPNS2
     C   42              MOVE      *BLANKS       WPPNS3
     C   42              MOVE      *BLANKS       WPPNS4
     C* FELT I HEADFR
     C                   MOVE      *ZEROS        WSM3
     C                   MOVE      *BLANKS       WSSTAF
     C                   MOVE      *BLANKS       WSSTAE
     C  N16              MOVE      *ZEROS        WSRUND
     C  N16              MOVE      *ZEROS        WSSDFD
     C  N16              MOVE      *ZEROS        WSSDFK
     C  N16              MOVE      *ZEROS        WSSDTD
     C  N16              MOVE      *ZEROS        WSSDTK
     C                   MOVE      *ZEROS        WSSFFD
     C                   MOVE      *ZEROS        WSSFFK
     C                   MOVE      *ZEROS        WSSVTD
     C                   MOVE      *ZEROS        WSSVTK
     C     INNLAN        IFEQ      'J'
     C  N16              MOVE      *BLANKS       WSKDAK
     C                   ELSE
     C                   MOVE      *BLANKS       WSKDAK
     C                   END
     C                   MOVE      *BLANKS       WSKDFF
     C                   MOVE      *BLANKS       WSVERV
     C                   MOVE      *ZEROS        WSVERB
     C                   MOVE      *BLANKS       WSETTV
     C                   MOVE      *ZEROS        WSETTB
     C                   MOVE      *BLANKS       WSFRAK
     C                   MOVE      *BLANKS       WSFRAV
     C                   MOVE      *ZEROS        WSFRAB
     C                   MOVE      ' '           WSMVA
     C                   MOVE      *BLANKS       WSFA11
     C                   MOVE      *BLANKS       WSFA12
     C                   MOVE      *ZEROS        WSFLP1
     C                   MOVE      *BLANKS       WSFA21
     C                   MOVE      *BLANKS       WSFA22
     C                   MOVE      *ZEROS        WSFLP2
     C     INNLAN        IFEQ      'J'
     C                   MOVE      *ZEROS        WSKNFA
     C                   MOVE      *BLANKS       WSTSTA
     C                   ELSE
     C  N16              MOVE      *ZEROS        WSKNFA
     C  N16              MOVE      *BLANKS       WSTSTA
     C                   END
     C                   MOVE      *ZEROS        TRAVD0
     C                   MOVE      *ZEROS        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C  N16
     CAN 42CALLFR        IFEQ      'U'
     C     CALLFR        OREQ      'I'
     C                   MOVE      *ZEROS        WSAVD
     C                   MOVE      FILAND        WPLANF
     C                   MOVE      FILAND        WPLANT
     C                   MOVE      UDAY          WSDTD1
     C                   MOVE      UMONTH        WSDTM1
     C                   MOVE      UYEAR         WSDTÅ1
     C                   MOVE      WSSDFD        WSSDTD
     C     CALLFR        IFEQ      'U'
     C                   MOVE      'S'           WSKDAK
     C                   ELSE
     C                   MOVE      'K'           WSKDAK
     C                   END
     C                   END
     C*
     C     INNLAN        IFEQ      'J'
     C                   EXSR      MOVB1I
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     MOVB1I        BEGSR
     C***********************************************
     C                   CLEAR                   WSFBV
     C                   CLEAR                   WSLKOD
     C                   CLEAR                   WSLLST
     C                   clear                   wspoen
     C                   CLEAR                   WSPOS1
     C                   CLEAR                   WSAPLL
     C                   CLEAR                   WSBLGK
     C                   CLEAR                   WSINHF
     C                   CLEAR                   WSINHA
     C                   CLEAR                   WSFRAF
     C                   CLEAR                   WSFRAA
     C                   CLEAR                   WSUTKF
     C                   CLEAR                   WSUTKA
     C                   CLEAR                   WSFRJF
     C                   CLEAR                   WSFRJA
     C                   CLEAR                   WSSUMF
     C                   CLEAR                   WSSUMA
      *
     C                   CLEAR                   GMFRJA
     C                   CLEAR                   GMUTKA
     C                   CLEAR                   GMTSTA
     C                   CLEAR                   GMKNFA
     C                   CLEAR                   GMSNDN
     C                   ENDSR
     C*
     C***********************************************
     C     OPDHEA        BEGSR
     C***********************************************
     C                   move      'N'           UTLLOG            1            Utlev.forbeh endret?
     C     HEADFK        CHAIN     HEADF                              33
      * Dersom vekt/M3 endret siden hent fra HEADF ( av Cargoscan / annet ekster
     c     *in33         Ifeq      *off
     c     GMVKT2        Ifne      HEVKT
     c     GMM32         orne      HEM3
     c                   exfmt     ENDRET
     c                   move      HEVKT         WSVKT
     c                   move      HEM3          WSM3
     c                   end
     c                   end
      *
      * Tømmer alle variable når ny record skrives
      *
     C   33              CLEAR                   HEADFR
     C  N33WSKF          IFNE      HEKF
     C     WSKFT1        ORNE      HEKFT1
     C     WSFT1A        ORNE      HEFT1A
     C     WSFT1B        ORNE      HEFT1B
     C                   EXSR      OPDLOG
     C                   move      'J'           UTLLOG            1            Utlev.forbeh endret!
     C                   END
      *EVENTUELT ENDRE FAKTURALINJER
      *
      * sjekker vaelinjer uansett ved gammel ordre
      *
     C  N33              EXSR      SRFALI
      *
      * BYTTET FAKTURAKUNDE
      *
      * SELGER
      *
     C                   EXSR      MOVWHF
     C                   EXSR      OPDHTR
     C     HELKA         IFEQ      FILAND
     C                   MOVE      UDATOA        HEDTOP
      * AVVIK INNLAND
     C     HETRI         IFEQ      FILAND
     C     TRKDAK        ANDEQ     'K'
     C                   MOVE      UDATOB        HEDTOP
     C                   END
      * AVVIK INNLAND SLUTT
     C                   ELSE
      * NÅR AVSENDER ER NORSK
     C     HETRI         IFEQ      FILAND
     C                   MOVE      UDATOB        HEDTOP
     C                   ELSE
      * NÅR AVSENDER ER UTENLANDSK (BEGGE ER UTENLANDSK)
     C                   MOVE      UDATOA        HEDTOP
     C                   END
      * AVVIK INNLAND SLUTT
     C                   END
     C     INNLAN        IFEQ      'J'
     C     HXBLGK        ANDNE     *BLANKS
     C     TRFRAK        ANDEQ     'M'
     C                   MOVE      'B'           TRFRAK
     C                   END
      *
      * Oppdaterer Headingpost
      *
      * ved heur S fra skipssystem gjøres om til H
      *
     c     heur          ifeq      'S'
     c                   move      'H'           heur
     c                   end
      *
     C  N33              UPDATE    HEADFR
      *----------------------------------------------------------
      ************  33 BEHANDLE NY ORDRE START
      *----------------------------------------------------------
     C   33              DO
      * Nytt, vanlig oppdrag - hent neste nr fra telleverk.
     C     UUFUNK        IFNE      '9'
     C     WSAVD         CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C     TEOPDN        IFEQ      0
     C                   Z-ADD     1             TEOPDN
     C                   END
     C                   UPDATE    TELLR
     C                   ELSE
      * Mønsteroppdrag/kopieringsmal, neste NEGATIVE nummer...
     C                   CALL      'SYGE10'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   MOVE      ' '           HEST
     C                   END
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      'H'           HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD         HEAVD
     C                   MOVE      *ZEROS        HESTD
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      ' '           HEPK5
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *Zeros        HEKLMO
     C                   MOVE      ' '           HEPK8
     C                   MOVE      ' '           HEPK9
     C                   MOVE      *BLANKS       HEGNN
     C                   MOVE      ' '           HXEDIK
     C* Mønsteroppdrag/Maler for kopiering med neg.fortegn på oppdr.nr
     C* (skal ligge igjen ved reorganiseringer - vil da ikke kollidere
     C*  med nye oppdrag ved tilbakestilte telleverk(unntatt ekstremt))
     C     WSKF          IFNE      *BLANKS
     C     WSKFT1        ORNE      *BLANKS
     C     WSFT1A        ORNE      *BLANKS
     C     WSFT1B        ORNE      *BLANKS
     C                   EXSR      OPDLOG
     C                   END
     C                   MOVE      ULDT          HEDTR
     C                   WRITE     HEADFR
     C     XKOPI         IFEQ      'J'
     C                   EXSR      MERKPI
     C                   END
      * LIGGER DET KOLLI-ID'S SOM ER MANUELT MAPPET/PRINTET PÅ TERMINAL...
     C     INNLAN        IFEQ      'J'
     C                   EXSR      KOLLIID
     C                   END
      *
      * SKRIVER TIL TRACK AND TRACE
      *
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
      * VED NY OG 'J' I INDIKATOR FOR LAG SETT VIA 2....
     C     INNLAN        IFEQ      'J'
     C     WSFRJA        IFNE      *ZEROS
     C                   EXSR      OPDILI
     C                   MOVE      WSFRJA        GMFRJA            7 0
     C                   END
     C                   MOVE      ' '           GMTSTA
     C     WSTSTA        IFEQ      'J'
     C                   EXSR      STVIA2
     C     XXFLAG        IFEQ      '0'
     C                   MOVE      WSKNFA        KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            82
     C  N82              MOVE      KNAVN         WSNAFA
     C  N82              MOVEL     POSTNR        WSADFA
     C  N82              MOVE      ADR3          WSADFA
     C                   END
     C                   END
     C                   END
     C                   END
      *----------------------------------------------------------
      ************  33 BEHANDLE NY ORDRE SLUTT
      *----------------------------------------------------------
      *----------------------------------------------------------
      ************     synkroniserer DOKUFV/DOKUFM/DOKUFVF
      *----------------------------------------------------------
     C                   EXSR      OPDDOKUFV
      *
      * VED POTNRBASERT OPPDATAER HESTED
      *
     C   42              EXSR      OPHEST
     C*
     C* OPPDATERER DISPONERINGSFILE
     C*
     C                   MOVE      'H'           DISTYP            1
     C                   EXSR      OPDDIS
     C*
     C* HVIS SATT PÅ TUR REBEREGNES TURTOTALER
     C*
     C     DITUAV        IFNE      *ZEROS
     C                   CALL      'SYTR36'
     C                   PARM                    DITUAV
     C                   PARM                    DITUR
     C                   END
     C*
     C                   MOVE      ' '           DISTYP
      * OPPDATER OPPDRAGSDATO PÅ ALLE FRISØKEVEIER
     C     HEADFK        SETLL     FRISOK
     C     HEADFK        READE     FRISOK                                 33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      HEDTOP        FSDTOP
     C                   UPDATE    FRISOKR
     C     HEADFK        READE     FRISOK                                 33
     C  N33              ENDDO
     C* husk sist lagrede vekt/vil for å sjekke endring fra CS...
     c                   move      HEVKT         GMVKT2
     c                   move      HEM3          GMM32
      * Oppdatere advisering.. Dersom det er definert i FIRINL (kun på oppdrag med blank status)
     C     GMST          ifeq      ' '
     C     IFADVG        andne     *blanks
      * fjerne evt åpen
     c                   move      'N'           AdvFinns          1
     C     HEADFK        SETLL     FAKT
     C     HEADFK        READE     FAKT                                   33
     C     *IN33         DOWEQ     '0'
     C     FAVK          ifeq      IFADVG
     C     FAOPKO        ifle      'C'
     C                   DELETE    FAKTR
     c                   else
     c                   move      'J'           AdvFinns
     C                   UPDATE    FAKTR
     c                   endif
     C                   leave
     c                   endif
     C                   UPDATE    FAKTR
     C     HEADFK        READE     FAKT                                   33
     C                   enddo
      *
     c     TRFA22        ifeq      'X'
     c     AdvFinns      andeq     'N'
     C                   Move      IFADVB        XXADVB            3 0
     C     KUAVTA        Chain     CUTRAN                             33
     C     *in33         Ifeq      *OFF
     C     CTAVAD        Ifne      *zeros
     C                   Move      CTAVAD        XXADVB
     C                   end
     C     CTIKAD        Ifeq      'X'
     C                   Move      *ZEROS        XXADVB
     C                   end
     C                   end
     C     XXADVB        Ifne      *zeros
     C                   CLEAR                   FAKTR
     C                   MOVE      WSKDFF        FASK
     C                   MOVE      WSAVD         FAAVD
     C                   MOVE      WSOPD         FAOPD
     C                   MOVE      IFADVG        FAVK
     C                   MOVE      'NOK'         FAVAL
S02  C*                  MOVE      'NOK'         FACU33
N02  C                   MOVE      frabet        FAKUNR
     C                   MOVE      'J'           FAKDM
     C                   MOVE      'M'           FAKDA
     C                   Z-ADD     XXADVB        FABELN
     C                   Z-ADD     XXADVB        FABELV
     C                   CALL      'SYGE06'
     C                   PARM                    FAAVD
     C                   PARM                    FAOPD
     C                   PARM                    FALI
     C                   WRITE     FAKTR
     c                   endif
     c                   endif
     c                   endif

      * oppdater ETD/ETA dersom ATD/ATA ikke er satt   - Logg evt endring i T&T/CHD
     C                   CLEAR                   TRACKTR
     C     HEADFK        CHAIN     TRACKT                             33
     C   33              MOVE      HEAVD         TXAVD
     C   33              MOVE      HEOPD         TXOPD
     c     TXATDD        ifeq      *zeros
     C  N33              IF        TRSDFD<>TXETDD OR TRSDFK<>TXETDK
     C                   CALL      'SYTTCHD'
     C                   PARM                    TXAVD
     C                   PARM                    TXOPD
     C                   PARM      'CHD'         UACTI             3
     C                   PARM      'ETD'         UTYPTT           20
     C                   PARM      'ETD'         UTYPTTE          20
     C                   PARM      TXETDD        UGMDAT            8 0
     C                   PARM      TXETDK        UGMTID            4 0
     C                   PARM      TRSDFD        UNYDAT            8 0
     C                   PARM      TRSDFK        UNYTID            4 0
     C                   PARM                    UXTXT            70
     c                   endif
     C                   MOVE      TRSDFD        TXETDD
     C                   MOVE      TRSDFK        TXETDK
     c                   endif
     C   33              MOVE      TRSDFD        TXETDD
     C   33              MOVE      TRSDFK        TXETDK
     c     TXATAD        ifeq      *zeros
     C  N33              IF        TRSDTD<>TXETAD OR TRSDTK<>TXETAK
     C                   CALL      'SYTTCHD'
     C                   PARM                    TXAVD
     C                   PARM                    TXOPD
     C                   PARM      'CHD'         UACTI             3
     C                   PARM      'ETA'         UTYPTT           20
     C                   PARM      'ETA'         UTYPTTE          20
     C                   PARM      TXETAD        UGMDAT            8 0
     C                   PARM      TXETAK        UGMTID            4 0
     C                   PARM      TRSDTD        UNYDAT            8 0
     C                   PARM      TRSDTK        UNYTID            4 0
     C                   PARM                    UXTXT            70
     c                   endif
     C                   MOVE      TRSDTD        TXETAD
     C                   MOVE      TRSDTK        TXETAK
     c                   endif
     C   33              MOVE      TRSDTD        TXETAD
     C   33              MOVE      TRSDTK        TXETAK
     C  N33              UPDATE    TRACKTR
     C   33              WRITE     TRACKTR
     C
      *
      * Utlev-forbehold endret på mor-oppdrag, utfør også ev dup-er
     c     UTLLOG        IFEQ      'J'
     c     TRSLAG        andeq     'HO'
     c                   exsr      OPDLOGUtk
     c                   ENDIF
      *
     C                   ENDSR
     C***********************************************
     C     KOLLIID       BEGSR
     C***********************************************
      * Linjer fjernet fysisk/erstattet av eksternt kall
     C                   z-add     HEAVD         FMAVD             4 0
     C                   z-add     HEOPD         FMOPD             7 0
     C                   z-add     1             FMFBNR            3 0
     C                   CALL      'SYTR34D'
     C                   PARM                    WSSN17
     C                   PARM                    FMAVD
     C                   PARM                    FMOPD
     C                   PARM                    FMFBNR
     C                   PARM                    WSKDFF
     C                   PARM                    ANTLAB            3 0
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDLOGUtk     BEGSR
     C***********************************************
      *sett/frigi Utl.forbehold også på utkjøringsdup
     C                   move      TRAVD2        WSAVD2
     C                   move      TROPD2        WSOPD2
     c                   IF        WSOPD2<>0
     c                   exsr      OPDLOGUtk2
     C                   ENDIF
      * Utkjøringsdup via fraktbrev ?
     C     DokufKeyA     setll     DOKUF
     C     DokufKeyA     reade(N)  DOKUF                                  33
     C     *in33         doweq     '0'
     c                   If        %subst(DFBREF:1:5)='U.op:'
     c                             and %subst(DFBREF:10:1)='/'
     c                   eval      WSAVD2 = %int(%subst(DFBREF:6:4))
     c                   eval      WSOPD2 = %int(%subst(DFBREF:11:7))
     c                   IF        WSOPD2<>0
     c                   exsr      OPDLOGUtk2
     C                   ENDIF
     C                   endif
     C     DokufKeyA     reade(N)  DOKUF                                  33
     C                   enddo
      * Hent inn igjen HEADF-info fra hovedoppdraget - i fall det trengs videre
     C     HEADFK        CHAIN(N)  HEADF                              33
     C                   ENDSR
     C***********************************************
     C     OPDLOGUtk2    BEGSR
     C***********************************************
      *sett/frigi Utl.forbehold også på utkjøringsdup
     C     VFKEY         CHAIN     HEADF                              33
     C  N33WSKF          IFNE      HEKF
     C     WSKFT1        ORNE      HEKFT1
     C     WSFT1A        ORNE      HEFT1A
     C     WSFT1B        ORNE      HEFT1B
     C                   EXSR      OPDLOG
     C                   MOVE      WSKF          HEKF
     C                   MOVE      WSKFT1        HEKFT1
     C                   MOVE      WSFT1         HEFT1
     C                   END
     c  N33              Update    HEADFR
     C                   ENDSR
     C***********************************************
     C     OPDLOG        BEGSR
     C***********************************************
     C                   MOVE      HEAVD         ULAVD
     C                   MOVE      HEOPD         ULOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      XULTM         ULTID
     C                   MOVE      ZUSER         ULUSR
     C                   MOVE      WSKF          ULKF
     C                   MOVE      WSKFT1        ULKFT1
     C                   MOVE      WSFT1A        ULFT1A
     C                   MOVE      WSFT1B        ULFT1B
     C                   WRITE     UTLLOGR
     C                   MOVE      ZUSER         WSUSR
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPDDIS        BEGSR
     C***********************************************
     C*
     C*
     C* OPPDATERER DISPONERINGSFILE
     C*
     C     DISPKE        KLIST
     C                   KFLD                    DIAVD
     C                   KFLD                    DIOPD
     C*
     C                   MOVE      HEOPD         DIOPD
     C                   MOVE      HEAVD         DIAVD
     C     DISPKE        CHAIN     DISP                               34
     C                   MOVE      HEOT          DIOT
      * VED NY...
     C   34HEPRO         IFEQ      *ZEROS
     C                   MOVE      *ZEROS        DIRUND
     C                   MOVE      *ZEROS        DITUR
     C                   MOVE      *ZEROS        DITUAV
     C                   ELSE
     C                   Z-ADD     TRRUND        DIRUND
     C                   Z-ADD     HEPRO         DITUR
     C                   MOVE      XITUAV        DITUAV
     C                   END
      * TUR GITT, MEN TURENS AVD UDEFINERT (FRA EDI-PLUKK)
     C     DITUR         IFNE      *ZEROS
     C     DITUAV        ANDEQ     *ZEROS
     C     DITUR         CHAIN     TURER14                            33
     C  N33              MOVE      TUAVD         DITUAV
     C                   END
     C                   MOVE      HESDF         DISTEF
     C                   MOVE      HESDT         DISTET
     C                   MOVE      TRSDFD        DIDATF
     C                   MOVE      TRSDTD        DIDATT
     C                   MOVE      TRSDFK        DITIMF
     C                   MOVE      TRSDTK        DITIMT
     C     HESDFF        IFNE      *BLANKS
     C     WSSTAF        IFEQ      ' '
     C     WSSTAF        OREQ      'R'
     C     WSSTAF        OREQ      'F'
     C     WSSTAF        OREQ      'O'
     C                   MOVE      TRSFFD        DIDATF
     C                   MOVE      HESDFF        DISTEF
     C                   MOVE      TRSFFK        DITIMF
     C                   END
     C                   END
     C     HESDVT        IFNE      *BLANKS
     C     WSSTAE        IFEQ      ' '
     C     WSSTAE        OREQ      'R'
     C     WSSTAE        OREQ      'F'
     C     WSSTAE        OREQ      'O'
     C                   MOVE      TRSVTD        DIDATT
     C                   MOVE      HESDVT        DISTET
     C                   MOVE      TRSVTK        DITIMT
     C                   END
     C                   END
     C                   MOVE      *BLANKS       DISONF
     C                   MOVE      *BLANKS       DISONT
     C  N42DISTEF        CHAIN     STED2                              33
     C   42WKSDF         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2LK         DISONF
     C  N33              MOVE      ST2SOL        DISONF
     C  N42DISTET        CHAIN     STED2                              33
     C   42WKSDT         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2LK         DISONT
     C  N33              MOVE      ST2SOL        DISONT
     C   34              MOVE      ' '           DISTA1
      * ved dup til innlandsmodul sett dispstatus E=Skjult 'E-sending' inntil strekkodeskutt inn
     C   34TRSLAG        IFEQ      'VF'
     C     DUPINL        andeq     'J'
     C                   MOVE      'E'           DISTA1
      * legg ut fri søkevei EDS som samler(v/F13) 'Esendinger' fra aktuell avsender (avds kundenr)
     C                   MOVE      HEAVD         FSAVD
     C                   MOVE      HEOPD         FSOPD
     C                   MOVE      'EDS'         FSKODE
     c                   MOVE      *blanks       FSDOKK
     c                   MOVE      HEKNSF        AAKNFA            8
     c                   MOVE      HEDTOP        AADTOP            8
     C                   EVAL      FSSOK=AAKNFA+' '+AADTOP+' '+GMTURA+' '+GMBILA
     C                   WRITE     FRISOKR
     c                   endif
     C* Dersom kopieringsmal(*IN37 ON) - sett dispon.status til "M"
     C   37              MOVE      'M'           DISTA1
     C     *IN34         IFEQ      *ON
     C     HEUR          ANDEQ     'H'
     C                   WRITE     DISPR
     C                   ENDIF
     C  N34              UPDATE    DISPR
     C                   ENDSR
     C*
     C***********************************************
     C     GETFRT        BEGSR
     C***********************************************
      * SR SOM HENTER VERDI FOR FRAKTTILLEGG (OLJE/VAL...)
     C     WSVALT        IFEQ      *BLANKS
     C                   MOVE      'H'           UUR
     C                   MOVE      *ZEROS        UVALP
     C                   CALL      'SYFA24B'
     C                   PARM                    UUR               1
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM      FRABET        UKNOP             8 0
     C                   PARM                    WSVALT
     C                   PARM                    UVALP             3 1
     C                   MOVE      UVALP         WSVALP
     C     WSVALT        IFNE      *BLANKS
     C     KODGEK        CHAIN     KOGER                              76
     C   76              SETON                                        30
     C                   END
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     DUPLIK        BEGSR
     C***********************************************
     C                   MOVE      'N'           DUPOPD            1
     C                   MOVE      XNYGML        YNYGML            2
     C     KEYTRG        KLIST
     C                   KFLD                    HEAVDG
     C                   KFLD                    HEOPDG
     C                   MOVE      WSAVD         HEAVDG            4 0
     C                   MOVE      WSOPD         HEOPDG            7 0
     C                   MOVE      WSPRO         HEPROG            8 0
     C                   MOVE      WSSG          HESGG             3
     C                   move      HEPRO         GMTURA            8
     C                   movel     HEHAWB        GMBILA            8
      *
     C                   MOVE      HEFR          WSFRFF
     C                   MOVE      HEFR          WSFRVT
      *
      * HENT EVT. FORFRAKT VIA REKVISISJON.
     C                   MOVE      *BLANKS       WSFFBN
     C                   MOVE      *ZEROS        WSFFTN
     C                   MOVE      *ZEROS        XXFFLN            8 0
     C                   MOVE      *ZEROS        WSFFBL
     C                   MOVE      ' '           WSFFAE
     C                   MOVE      *BLANKS       WSFFTX
     C                   MOVE      'FF'          XXSLAG
     C     TRIKEY        CHAIN     HETRIU                             34
     C     *IN34         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN(N)  KOSBU                              34
     C     *IN34         IFEQ      '0'
     C                   MOVE      BUBILN        WSFFBN
     C                   MOVE      BUTNR         WSFFTN
     C                   MOVE      BULNR         XXFFLN
     C                   MOVE      BUBL          WSFFBL
     C                   MOVE      BUTYPE        WSFFAE
     C                   MOVE      BUTXT         WSFFTX
     C                   END
     C                   END
      * HENT EVT. VIDEREFR VIA REKVISISJON.
     C                   MOVE      *BLANKS       WSVFBN
     C                   MOVE      *ZEROS        WSVFTN
     C                   MOVE      *ZEROS        XXVFLN            8 0
     C                   MOVE      *ZEROS        WSVFBL
     C                   MOVE      ' '           WSVFAE
     C                   MOVE      *BLANKS       WSVFTX
     C                   MOVE      'VF'          XXSLAG
     C     TRIKEY        CHAIN     HETRIU                             34
     C     *IN34         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C     TIBURF        CHAIN(N)  KOSBU                              34
     C     *IN34         IFEQ      '0'
     C                   MOVE      BUBILN        WSVFBN
     C                   MOVE      BUTNR         WSVFTN
     C                   MOVE      BULNR         XXVFLN
     C                   MOVE      BUBL          WSVFBL
     C                   MOVE      BUTYPE        WSVFAE
     C                   MOVE      BUTXT         WSVFTX
     C                   END
     C                   END
      *
      *  VERDIENE MÅ TIL WS-VARIABLER FØR FF/VF-OPPDRAG CHAINES
     C                   MOVE      TRAVD1        WSAVD1
     C                   MOVE      TROPD1        WSOPD1
     C                   MOVE      TRAVD2        WSAVD2
     C                   MOVE      TROPD2        WSOPD2
      *  91 ON - PROTECTES (ER TATT HÅND OM/SKAL IKKE TAS HÅND OM)
     C     WSAVD1        COMP      *ZEROS                             91
     C  N91WSSDFF        COMP      *BLANKS                                91
     C  N91
     CAN 42WPPNS3        COMP      *BLANKS                                91
     C  N91WSSTAF        COMP      *BLANKS                            9191
     C     WSOPD1        IFNE      *ZEROS
     C                   MOVE      WSAVD1        XDUAVD
     C                   MOVE      WSOPD1        XDUOPD
     C                   MOVE      *ZEROS        XXFALI
     C                   MOVE      *ZEROS        WSFFBL
     C     FFKEY         SETLL     FAKT
     C     FFKEY         READE(N)  FAKT                                   31
     C     *IN31         DOWEQ     '0'
      * AKKUMULER ILINJER (MEN IKKE STATISTISKE MOTLINJER-DUP PÅ DUP)
     C     FASK          IFEQ      'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSFFBL
     C                   END
     C     FFKEY         READE(N)  FAKT                                   31
     C                   END
      *
     C     FFKEY         CHAIN(N)  HEADF                              31
     C     *IN31         IFEQ      '0'
     C                   MOVE      HEUR          WSURF
     C                   MOVE      HEOT          WSOTFF
     C                   MOVE      HEFR          WSFRFF
     C                   MOVE      HEKDPL        WSPKFF
     C                   MOVE      HENAK         WSLNAV
     C                   MOVEL     HEHAWB        WSFFBN
     C                   END
     C                   END
      *  92 ON - PROTECTES (ER TATT HÅND OM/SKAL IKKE TAS HÅND OM)
     C     WSAVD2        COMP      *ZEROS                             92
     C  N92WSSDVT        COMP      *BLANKS                                92
     C  N92
     CAN 42WPPNS4        COMP      *BLANKS                                92
     C  N92WSSTAE        COMP      *BLANKS                            9292
      * Vis pris på evt dupoppdrag
     C     WSOPD2        IFNE      *ZEROS
     C                   MOVE      WSAVD2        XDUAVD
     C                   MOVE      WSOPD2        XDUOPD
     C                   MOVE      *ZEROS        XXFALI
     C                   MOVE      *ZEROS        WSVFBL
     C     VFKEY         SETLL     FAKT
     C     VFKEY         READE(N)  FAKT                                   31
     C     *IN31         DOWEQ     '0'
      * AKKUMULER ILINJER (MEN IKKE STATISTISKE MOTLINJER-DUP PÅ DUP)
     C     FASK          IFEQ      'I'
     C     FAKDA         ANDNE     'I'
     C                   ADD       FABELN        WSVFBL
     C                   END
     C     VFKEY         READE(N)  FAKT                                   31
     C                   END
      *
     C     VFKEY         CHAIN(N)  HEADF                              31
     C     *IN31         IFEQ      '0'
     C                   MOVE      HEUR          WSURE
     C                   MOVE      HEOT          WSOTVT
     C                   MOVE      HEFR          WSFRVT
     C                   MOVE      HEKDPL        WSPKVT
     C                   MOVE      HENAS         WSHNAV
     C                   MOVEL     HEHAWB        WSVFBN
     C                   END
     C                   END
      * HAR CHAINET INNH. OG/ELLER UTKJ.OPPDRAG. HENT INN IGJEN HOVED..
     C     WSOPD1        IFNE      *ZEROS
     C     WSOPD2        ORNE      *ZEROS
     C     KEYTRG        CHAIN(N)  HEADF                              31
     C                   END
      * VIS NAVN...
     C                   MOVE      *BLANKS       XXPNS1           14
     C                   MOVE      *BLANKS       XXPNS2           12
     C                   MOVE      *BLANKS       XXPNS3           12
     C                   MOVE      *BLANKS       XXPNS4           10
     C     *IN42         IFEQ      '1'
     C                   MOVE      WPPNS1        XXPNS1
     C                   MOVE      WPPNS2        XXPNS2
     C                   MOVE      WPPNS3        XXPNS3
     C                   MOVE      WPPNS4        XXPNS4
     C     WPPNS3        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       XXPNS1
     C                   END
     C     WPPNS4        IFEQ      *BLANKS
     C                   MOVE      *BLANKS       XXPNS2
     C                   END
     C                   ELSE
     C     WSSDFF        IFNE      *BLANKS
     C     WSSDF         CHAIN     STED2                              35
     C  N35              MOVEL     ST2NVN        XXPNS1
     C     WSSDFF        CHAIN     STED2                              35
     C  N35              MOVEL     ST2NVN        XXPNS3
     C                   END
     C     WSSDVT        IFNE      *BLANKS
     C     WSSDVT        CHAIN     STED2                              35
     C  N35              MOVEL     ST2NVN        XXPNS4
     C     WSSDT         CHAIN     STED2                              35
     C  N35              MOVEL     ST2NVN        XXPNS2
     C                   END
     C                   END
     C                   MOVEL     XXPNS1        DXPNS1           10
     C                   MOVEL     XXPNS2        DXPNS2           10
     C                   MOVEL     XXPNS3        DXPNS3           10
     C                   MOVEL     XXPNS4        DXPNS4           10
      *
      * 34 ON= IKKE FORFRAKT/INNHENTING  35 ON=IKKE VIDEREFRAKT/UTKJ.
     C     WSSDFF        COMP      *BLANKS                                34
     C     WSSDVT        COMP      *BLANKS                                35
      * hent innl-avd via postnr
     c                   If        DUPINL = 'J'
     c                   If        (WSSDFF<>*blanks and WSAVD1=*zeros)
     c                             or (WSSDVT<>*blanks and WSAVD2=*zeros)
     c                   exsr      GetDupAvd
     c                   endif
     c                   endif
      *
     C  N91              Z-ADD     6             LINNBR
     C   91              Z-ADD     13            LINNBR
     C                   Z-ADD     49            POSNBR
      *
     C     *IN91         IFEQ      '0'
     C     *IN92         OREQ      '0'
     C     KEYFTG        KLIST
     C                   KFLD                    HEAVDG
     C                   KFLD                    HEOPDG
     C                   END
      *
     C                   MOVE      *ZEROS        XXFFBLM           9 2
     C                   MOVE      *ZEROS        XXVFBLM           9 2
      *
     C     STDUP         TAG
     C     WSURF         IFEQ      *BLANKS
     C                   MOVEL     'H'           WSURF
     C                   END
     C     WSURE         IFEQ      *BLANKS
     C                   MOVEL     'H'           WSURE
     C                   END
     C     WSHNAV2       IFEQ      *BLANKS
     C     WSHNAV1       ANDNE     *blank
     C     KODTEKH       CHAIN     KOTMR                              31
     C  N31              MOVE      KOTMNV        WSHNAV
     C                   END
     C     WSLNAV2       IFEQ      *BLANKS
     C     WSLNAV1       ANDNE     *blank
     C     KODTEKL       CHAIN     KOTMR                              31
     C  N31              MOVE      KOTMNV        WSLNAV
     C                   END
     C                   EXFMT     BILDE03
     C                   MOVE      'N'           WZFIL             1
      * FF
     C     WSAVD1        IFNE      0
     C     KODTA1        CHAIN     KOAR                               31
     C     *IN31         IFEQ      *OFF
     C                   MOVE      KOANVN        WAVD5             5
     C     WAVD5         IFEQ      '*DUP*'
     C                   MOVE      'J'           WZFIL             1
     C                   ENDIF
     C     KODTAK        CHAIN     KOAR                               31
     C                   ENDIF
     C                   ENDIF
      * VF
     C     WSAVD2        IFNE      0
     C     KODTA2        CHAIN     KOAR                               31
     C     *IN31         IFEQ      *OFF
     C                   MOVE      KOANVN        WAVD5             5
     C     WAVD5         IFEQ      '*DUP*'
     C                   MOVE      'J'           WZFIL             1
     C                   ENDIF
     C     KODTAK        CHAIN     KOAR                               31
     C                   ENDIF
     C                   ENDIF
     C                   SETOFF                                       30
     C   12              SETOFF                                       989192
     C   12              GOTO      UTDUPS
     C                   SETOFF                                       98
     C*
     C     *IN04         IFEQ      '1'
     C   91
     CAN 92              GOTO      STDUP
     C                   EXSR      SØKDUP
     C                   GOTO      STDUP
     C                   END
     C*
      * HVIS BEGGE ALT ER TATT HÅND OM - HOPP UT ETTER AT BILDE VIST.
     C   91
     CAN 92              GOTO      UTDUPS
      *
     C*
     C* TESTER AT TASTET AVDELING HAR TELLER
     C*
     C  N91WSAVD1        IFNE      *ZEROS
     C     WSAVD1        CHAIN(N)  TELL                               98
     C   98AVDZER        CHAIN(N)  TELL                               98
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     49            POSNBR
     C   98              MOVE      'SPA0001'     MSGNR2
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C  N98KODOTF        CHAIN     KOOTYR                             98
     C  N98KODO2F        CHAIN     KOOT2R                             98
     C   98              MOVE      'SPO0007'     MSGNR2
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     54            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C                   MOVEL     WSPKFF        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C     KUFASK        CHAIN     KUFAST                             98
     C   98              MOVE      'YBC0360'     MSGNR2
     C   98              Z-ADD     7             LINNBR
     C   98              Z-ADD     55            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C     KODFRF        CHAIN     KOFRR                              98
     C   98              MOVE      'SPF0006'     MSGNR2
     C   98              Z-ADD     7             LINNBR
     C   98              Z-ADD     64            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
     C                   MOVE      KO2FB         FKO2FB            1
     C                   MOVE      KO2FPS        FO2FPS            1
     C                   MOVE      KO2KK         FKO2KK            1
     C                   MOVE      KO2TI         FKO2TI            1
     C                   MOVE      KO2FI         FKO2FI            1
     C                   MOVE      KO2TE         FKO2TE            1
      *
     C                   END
      *
     C  N91WSFFBN        IFNE      *BLANKS
     C     WSFFTN        ORNE      *ZEROS
      * ikke tillat med Rekv hvis dup (avd) er valgt
     C     WSAVD1        Ifne      *zeros
     C                   MOVE      'JOV1373'     MSGNR2
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     49            POSNBR
     C                   SETON                                        3098
     C                   GOTO      STDUP
     c                   end
     C     WSFFTN        IFEQ      *ZEROS
     C     WSFFBN        CHAIN     UNITL01                            98
     C  N98              MOVE      UNTRAN        WSFFTN
     C                   END
     C                   MOVE      WSFFTN        TRANUM
     C     TRAKEY        CHAIN     TRAN                               98
     C     *IN98         IFEQ      '0'
     C                   MOVE      VMTRLE        XXFFLN
     C                   ELSE
     C                   MOVE      'JOV0704'     MSGNR2
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     60            POSNBR
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
     C*
     C  N92WSAVD2        IFNE      *ZEROS
     C     WSAVD2        CHAIN(N)  TELL                               98
     C   98AVDZER        CHAIN(N)  TELL                               98
     C   98              MOVE      'SPA0001'     MSGNR2
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     49            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C  N98KODOTV        CHAIN     KOOTYR                             98
     C  N98KODO2V        CHAIN     KOOT2R                             98
     C*                    Z-ADD12        LINNBR
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     54            POSNBR
     C   98              MOVE      'SPO0007'     MSGNR2
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C                   MOVEL     WSPKVT        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C     KUFASK        CHAIN     KUFAST                             98
     C   98              MOVE      'YBC0360'     MSGNR2
     C   98              Z-ADD     4             LINNBR
     C   98              Z-ADD     55            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
      *
     C     KODFRV        CHAIN     KOFRR                              98
     C   98              MOVE      'SPF0006'     MSGNR2
     C   98              Z-ADD     14            LINNBR
     C   98              Z-ADD     64            POSNBR
     C   98              SETON                                        30
     C   98              GOTO      STDUP
     C                   MOVE      KO2FB         VKO2FB            1
     C                   MOVE      KO2FPS        VO2FPS            1
     C                   MOVE      KO2KK         VKO2KK            1
     C                   MOVE      KO2TI         VKO2TI            1
     C                   MOVE      KO2FI         VKO2FI            1
     C                   MOVE      KO2TE         VKO2TE            1
     C                   END
      *
     C  N92WSVFBN        IFNE      *BLANKS
     C     WSVFTN        ORNE      *ZEROS
      * ikke tillat med Rekv hvis dup (avd) er valgt
     C     WSAVD2        Ifne      *zeros
     C                   MOVE      'JOV1373'     MSGNR2
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     49            POSNBR
     C                   SETON                                        3098
     C                   GOTO      STDUP
     c                   end
     C     WSVFTN        IFEQ      *ZEROS
     C     WSVFBN        CHAIN     UNITL01                            98
     C  N98              MOVE      UNTRAN        WSVFTN
     C                   END
     C                   MOVE      WSVFTN        TRANUM
     C     TRAKEY        CHAIN     TRAN                               98
     C     *IN98         IFEQ      '0'
     C                   MOVE      VMTRLE        XXVFLN
     C                   ELSE
     C                   Z-ADD     15            LINNBR
     C                   Z-ADD     60            POSNBR
     C                   MOVE      'JOV0704'     MSGNR2
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
      *
      * BEREGN DUP-FRAKT OM DEN IKKE ALT ER SATT
     C     *IN42         IFEQ      *ON
     C  N91WSAVD1        IFNE      *ZEROS
     C     WSFFBL        ANDEQ     *ZEROS
     C     WSFFAE        ANDNE     'A'
     C     WSFFAE        ANDNE     'E'
     C                   MOVE      'F'           DUPTYP            1
     C                   EXSR      BERDUP
     C     UUBELØ        IFNE      *ZEROS
     C                   Z-ADD     UUBELØ        WSFFBL
     C                   Z-ADD     UUBELØ        XXFFBLM
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   MOVE      'JOV1298'     MSGNR2
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
      *
     C  N92WSAVD2        IFNE      *ZEROS
     C     WSVFBL        ANDEQ     *ZEROS
     C     WSVFAE        ANDNE     'A'
     C     WSVFAE        ANDNE     'E'
     C                   MOVE      'V'           DUPTYP            1
     C                   EXSR      BERDUP
     C     UUBELØ        IFNE      *ZEROS
     C                   Z-ADD     UUBELØ        WSVFBL
     C                   Z-ADD     UUBELØ        XXVFBLM
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     10            POSNBR
     C                   MOVE      'JOV1299'     MSGNR2
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
     C                   END
      *
      * (FLYTTET ETTER ALLE TESTER...)
     C* GÅR TIL START HVIS INGEN F-TAST ER BENYTTET
     C*
     C  N03
     CANN05
     CANN16              GOTO      STDUP
     C*
     C* FORSØKER Å AVSLUTTE UTEN Å PLASSERE PÅ AVD  (ELLER PÅ REKV)
     C*
     C  N91WSFFBN        IFNE      *BLANKS
     C     WSFFTN        ORNE      *ZEROS
     C                   MOVE      'FF'          XXSLAG
     C                   EXSR      KOST
     C                   ELSE
     C  N91WSAVD1        IFEQ      *ZEROS
     C                   Z-ADD     6             LINNBR
     C                   Z-ADD     49            POSNBR
     C                   MOVE      'JOV0705'     MSGNR2
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
      *
     C  N92WSVFBN        IFNE      *BLANKS
     C     WSVFTN        ORNE      *ZEROS
     C                   MOVE      'VF'          XXSLAG
     C                   EXSR      KOST
     C                   ELSE
     C  N92WSAVD2        IFEQ      *ZEROS
     C                   Z-ADD     13            LINNBR
     C                   Z-ADD     49            POSNBR
     C                   MOVE      'JOV0705'     MSGNR2
     C                   SETON                                        30
     C                   GOTO      STDUP
     C                   END
     C                   END
     C*
     C                   MOVE      'N'           DIN03             1
     C                   MOVE      'N'           DIN05             1
     C                   MOVE      'N'           DIN16             1
     C   03              MOVE      'J'           DIN03
     C   05              DO
     C                   MOVE      'J'           XIN05             1
     C                   SETON                                        03
     C                   SETOFF                                       05
     C                   MOVE      'J'           DIN03             1
     C                   END
     C   16              MOVE      'J'           DIN16
     C*
     C**********************************************
     C* OPPDATERER FORTRANSPORT DUPLIKATOPPDRAG
     C*
     C  N91WSAVD1        IFNE      *ZEROS
     C                   EXSR      MOVWHF
     C     WZFIL         IFEQ      'J'
     C                   Z-ADD     0             WSOPD
     C                   ELSE
     C     WSAVD1        CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C     TEOPDN        IFEQ      0
     C                   Z-ADD     1             TEOPDN
     C                   END
     C                   UPDATE    TELLR
     C                   ENDIF
     C* DATA SOM SKAL BYTTES
     C                   MOVE      WSOTFF        HEOT
     C                   MOVE      WSFRFF        HEFR
     C                   MOVE      WSPKFF        HEKDPL
     C     WSLNAV        IFNE      *BLANKS
     C                   MOVE      WSLNAV        HENAK
     C                   MOVE      *BLANKS       HEADK1
     C                   MOVE      *BLANKS       HEADK2
     C                   MOVE      *BLANKS       HEADK3
     C                   END
     C                   MOVE      WSSDFF        HESDT
     C   42              MOVE      WPLAN1        HETRI
     C  N42              MOVE      WSLAN1        HETRI
     C                   MOVE      UDATOC        TRSDTD
     C                   MOVE      WSSFFK        TRSDTK
     C                   MOVE      *BLANKS       HELKS
     C                   MOVE      *BLANKS       HELKK
     C                   MOVE      *BLANKS       HESDFF
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSFFK
     C                   MOVE      *BLANKS       HESDVT
     C                   MOVE      *ZEROS        TRSVTD
     C                   MOVE      *ZEROS        TRSVTK
     C                   MOVE      ' '           TRMVA
     C                   MOVE      *ZEROS        HEPRO
     C*
     C     HELKA         IFEQ      FILAND
     C                   MOVE      UDATOA        HEDTOP
     C                   ELSE
     C                   MOVE      UDATOB        HEDTOP
     C                   END
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      WSOPD         WSOPD1
     C                   MOVE      'H'           HEUR
     C                   MOVE      WSURF         HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD1        HEAVD
     C                   MOVE      WSAVD1        WSAVD
     C                   MOVE      *ZEROS        HESTD
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      ' '           HEPK8
     C                   MOVE      ' '           HEPK9
     C                   MOVE      FKO2FB        HEPK1
     C                   MOVE      FO2FPS        HEPK2
     C                   MOVE      FKO2KK        HEPK3
     C                   MOVE      FKO2TI        HEPK4
     C                   MOVE      FKO2FI        HEPK5
     C                   MOVE      FKO2TE        HEPK6
     C                   MOVE      'N'           HEPK7
     C                   MOVE      'N'           HEPK8
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *Zeros        HEKLMO
     C                   MOVE      *BLANKS       HEGNN
     C                   MOVE      ' '           HEST
     C                   MOVE      'DUP'         HESG
     C                   MOVEL     HESGG         HELB
     C                   MOVE      *BLANKS       HEPOS1
     C                   MOVE      *ZEROS        HEPOS2
     C                   MOVE      *BLANKS       HEGN
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      *BLANKS       HETLKU
     C                   MOVE      *BLANKS       HEHAWB
     c                   MOVE      *BLANKS       HEVALS
     c                   MOVE      *BLANKS       HEVALK
     C                   MOVE      *zeros        HEKNT
     C*
     C*   BYTTER  FAKTURAMOTTAGER
     C*
     C     TRKDFF        IFEQ      'S'
     C                   MOVE      KOAKNR        HEKNSF
     C                   MOVE      *ZEROS        HEKNKF
     C                   ELSE
     C                   MOVE      KOAKNR        HEKNKF
     C                   MOVE      *ZEROS        HEKNSF
     C                   END
     C*FLYTTET OPP LINJER FRA NEDE I RUTINEN
     C*
     C* OPPADSTIGENDE REFERANSE I EGNE DATAFELT
     C* AVD0/OPD0 - REF TIL MODEROPPDRAG (SOM GJERNE OGSÅ KAN VÆRE DUP)
     C                   MOVE      'FF'          TRSLAG
     C                   MOVE      HEAVDG        TRAVD0
     C                   MOVE      HEOPDG        TROPD0
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      ' '           TRSTAF
     C                   MOVE      ' '           TRSTAE
     C                   EXSR      OPDHTD
     C                   MOVE      ULDT          HEDTR
     C     WZFIL         IFEQ      'J'
     C                   MOVEL     DSDUP         HEREFF
     C                   MOVEL     HEAVD         HEREFF
     C     FIFIRM        CHAIN     ZTELL                              31
     C  N31              Z-ADD     ZUNIK         HEUNIK
     C  N31              ADD       1             ZUNIK
     C  N31              UPDATE    ZTELLR
     C                   WRITE     ZEADFR
     C                   ELSE
     C                   WRITE     HEADFR
     C                   ENDIF
     C     XKOPI         IFEQ      'J'
     C                   EXSR      MERKPI
     C                   END
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
     C                   EXSR      DOKUFVSR
      * DUPLISER FRITEKST????
     C     KEYFTG        CHAIN     FREETXT2                           31
     C     *IN31         DOWEQ     '0'
     C                   MOVE      HEAVD         FRTAVD
     C                   MOVE      HEOPD         FRTOPD
     C     WZFIL         IFEQ      'J'
     C                   MOVEL     HEUNIK        FRUNIK
     C                   MOVEL     HEREFF        FRREFF
     C                   WRITE     ZREETX2R
     C                   ELSE
     C                   WRITE     FREETX2R
     C                   ENDIF
     C     KEYFTG        READE     FREETXT2                               31
     C                   END
      * FRITEKST TIL OPPDRAG
     C     WSFRD1        IFEQ      'J'
     C                   EXSR      VISFRE
     C                   END
     C* VED POSTNR.BASERT - LEGG UT OGSÅ POST MED STEDSNAVN
     C   42              DO
     C                   CLEAR                   HESTEDR
     C                   MOVE      HEAVD         HSAVD
     C                   MOVE      HEOPD         HSOPD
     C                   MOVEL     WPPNS1        HSFROM
     C                   MOVEL     WPPNS3        HSTO
     C                   WRITE     HESTEDR
     C                   END
     C* WP/WS... KEY I POSTAL ...
     C   42              MOVE      WPLANT        GMLK              2
     C   42              MOVE      WSSDT         GMSD              5
     C   42              MOVE      WPLAN1        WPLANT
     C   42              MOVE      WSSDFF        WSSDT
     C                   EXSR      OPDDIS
     C   42              MOVE      GMLK          WPLANT
     C   42              MOVE      GMSD          WSSDT
     C* Send varsel til USER-profiles knyttet til avdelingen
     C                   EXSR      SNDMSG
     C                   MOVE      'J'           DUPOPD
     C                   MOVE      'NY'          XNYGML
     C                   EXSR      FAKTUR
     C                   MOVE      YNYGML        XNYGML
     C* LEGG UT DUMMY REKVISISJON FOR Å LETTE SENERE SPØRRING
     C                   EXSR      DUMREK
     C                   END
     C*
     C* SLUTT DUPLIKATOPPDRAG FOR FORFRAKT
     C*
     C*
     C**********************************************
     C* OPPDATERER VIDERETRANSPORT DUPLIKATOPPDRAG
     C*
     C  N92WSAVD2        IFNE      *ZEROS
      * SIKRE AT ALLE HEADF/HEADTR OPPL ER OK HVIS OGSÅ FF.ER LAGT UT..
     C     DUPOPD        IFEQ      'J'
     C     KEYTRG        CHAIN(N)  HEADF                              98
     C                   END
     C                   EXSR      MOVWHF
     C     WZFIL         IFEQ      'J'
     C                   Z-ADD     0             WSOPD
     C                   ELSE
     C     WSAVD2        CHAIN     TELL                               33
     C   33AVDZER        CHAIN     TELL                               33
     C                   MOVE      TEOPDN        WSOPD
     C                   ADD       1             TEOPDN
     C     TEOPDN        IFEQ      0
     C                   Z-ADD     1             TEOPDN
     C                   END
     C                   UPDATE    TELLR
     C                   ENDIF
     C* DATA SOM SKAL BYTTES
     C                   MOVE      WSOTVT        HEOT
     C                   MOVE      WSFRVT        HEFR
     C                   MOVE      WSPKVT        HEKDPL
     C     WSHNAV        IFNE      *BLANKS
     C                   MOVE      WSHNAV        HENAS
     C                   MOVE      *BLANKS       HEADS1
     C                   MOVE      *BLANKS       HEADS2
     C                   MOVE      *BLANKS       HEADS3
     C                   END
     C                   MOVE      WSSDVT        HESDF
     C   42              MOVE      WPLAN2        HELKA
     C  N42              MOVE      WSLAN2        HELKA
     C                   MOVE      UDATOD        TRSDFD
     C                   MOVE      WSSVTK        TRSDFK
     C                   MOVE      UDATOB        TRSDTD
     C                   MOVE      WSSDTK        TRSDTK
     C                   MOVE      *BLANKS       HELKS
     C                   MOVE      *BLANKS       HELKK
     C                   MOVE      *BLANKS       HESDVT
     C                   MOVE      *ZEROS        TRSVTD
     C                   MOVE      *ZEROS        TRSVTK
     C                   MOVE      *BLANKS       HESDFF
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSFFK
     C                   MOVE      ' '           TRMVA
     C                   MOVE      *ZEROS        HEPRO
     C*
     C                   MOVE      WSOPD         HEOPD
     C                   MOVE      WSOPD         WSOPD2
     C                   MOVE      'H'           HEUR
     C                   MOVE      WSURE         HEUR
     C                   Z-ADD     0             HENTF
     C                   MOVE      WSAVD2        HEAVD
     C                   MOVE      WSAVD2        WSAVD
     C                   MOVE      *ZEROS        HESTD
     C                   MOVE      *ZEROS        HEDTMP
     C                   MOVE      *ZEROS        HEDTÅP
     C                   MOVE      *ZEROS        HEDTCP
     C                   MOVE      *ZEROS        HEBELT
     C                   MOVE      *ZEROS        HEBELM
     C                   MOVE      ' '           HEKDTM
     C                   MOVE      *ZEROS        HEFBK
     C                   MOVE      *ZEROS        HEVN
     C                   MOVE      ' '           HEKDKK
     C                   MOVE      *ZEROS        HEFNGK
     C                   MOVE      *ZEROS        HEFNGS
     C                   MOVE      ' '           HEPK8
     C                   MOVE      ' '           HEPK9
     C                   MOVE      VKO2FB        HEPK1
     C                   MOVE      VO2FPS        HEPK2
     C                   MOVE      VKO2KK        HEPK3
     C                   MOVE      VKO2TI        HEPK4
     C                   MOVE      VKO2FI        HEPK5
     C                   MOVE      VKO2TE        HEPK6
     C                   MOVE      'N'           HEPK7
     C                   MOVE      'N'           HEPK8
     C                   MOVE      *BLANKS       HESGM
     C                   MOVE      *BLANKS       HEDTMO
     C                   MOVE      *Zeros        HEKLMO
     C                   MOVE      *BLANKS       HEGNN
     C                   MOVE      ' '           HEST
     C                   MOVE      'DUP'         HESG
     C                   MOVEL     HESGG         HELB
     C                   MOVE      *BLANKS       HEPOS1
     C                   MOVE      *ZEROS        HEPOS2
     C                   MOVE      *BLANKS       HEGN
     C                   MOVE      *BLANKS       HETLE
     C                   MOVE      *BLANKS       HETLL
     C                   MOVE      *BLANKS       HETLKU
     C                   MOVE      *BLANKS       HEHAWB
     C                   MOVE      *zeros        heknt
     c                   MOVE      *BLANKS       HEVALS
     c                   MOVE      *BLANKS       HEVALK
      * VF-Dup til Innlans distr-avd..  - avsender av xxxxx c/o dupavdelingens k.nr
     C     KODTA2        CHAIN     KOAR                               31
     C                   IF        KOAIE = '1'
     c                   if        HXSNDN = *blanks
     C                   call      'SYGE15'
     C                   parm                    HXSNDN
     C                   endif
     C     FIRAVD        CHAIN     CUNDL01                            34
     C     *IN34         IFEQ      '0'
     c                   eval      HENAS = %subst(HENAS:1:15) + ' c/o:'
     c                             + FIKRTN
     c                   eval      HEADS1= ADR1
     c                   eval      HEADS2= *blanks
     c                   movel     POSTNR        HEADS3
     c                   eval      HEADS3= %subst(HEADS3:1:4) +' '+ADR3
     C                   endif
     C                   ENDIF
      * flytt ovetr kolli-IDs til utkj.oppdraget ubetinget..
      * Dette KAN VÆRE FOR TØFT..
      *  .. hensikten er å kunne skyte UT terminal-->PÅ BIL / denmde EDI fra innland mm
      * (V12 - alltid kan holde kolliene på mor.oppdraget?? Heller fixe prog som skal bruke de??)
     c                   move      HEAVDG        FMAVDx
     c                   move      HEOPDG        FMOPDx
     C                   z-add     1             XXFBNR
     C     DOKFMKey      Setll     DOKUFM
     C     DOKFMKey      READE     DOKUFM                                 33
     C     *in33         doweq     '0'
     C     FMST          IFEQ      'E'                                          Ekstern
     C     FMST          OREQ      'I'                                          Intern
     C     FMST          OREQ      'M'                                          Mankomerket
     C     FMST          OREQ      'O'                                          Ompakket/Original
     C                   delete    dokufmr
     C                   move      heavd         FMAVD
     C                   move      heopd         FMOPD
     C                   z-add     1             FMFBNR
     C                   write     dokufmr
     C                   end
     C     DOKFMKey      READE     DOKUFM                                 33
     C                   end
      * hent opp igen HO-oppdragets avd-info
     C     KODTAK        CHAIN     KOAR                               31
     c
     C*
     C*   BYTTER  FAKTURAMOTTAGER
     C*
     C     TRKDFF        IFEQ      'S'
     C                   MOVE      KOAKNR        HEKNSF
     C                   MOVE      *ZEROS        HEKNKF
     C                   ELSE
     C                   MOVE      KOAKNR        HEKNKF
     C                   MOVE      *ZEROS        HEKNSF
     C                   END
     C* FLYTTET LINJER NEDENFOR OPP HIT
     C* OPPADSTIGENDE REFERANSE I EGNE DATAFELT
     C* AVD0/OPD0 - REF TIL MODEROPPDRAG (SOM GJERNE OGSÅ KAN VÆRE DUP)
     C                   MOVE      'VF'          TRSLAG
     C                   MOVE      HEAVDG        TRAVD0
     C                   MOVE      HEOPDG        TROPD0
     C                   MOVE      *ZEROS        TRAVD2
     C                   MOVE      *ZEROS        TROPD2
     C                   MOVE      *ZEROS        TRAVD1
     C                   MOVE      *ZEROS        TROPD1
     C                   MOVE      ' '           TRSTAF
     C                   MOVE      ' '           TRSTAE
     C                   EXSR      OPDHTD
     C                   MOVE      ULDT          HEDTR
     C     WZFIL         IFEQ      'J'
     C                   MOVEL     DSDUP         HEREFF
     C                   MOVEL     HEAVD         HEREFF
     C     FIFIRM        CHAIN     ZTELL                              31
     C  N31              Z-ADD     ZUNIK         HEUNIK
     C  N31              ADD       1             ZUNIK
     C  N31              UPDATE    ZTELLR
     C                   WRITE     ZEADFR
     C                   ELSE
     C                   WRITE     HEADFR
     C                   ENDIF
     C     XKOPI         IFEQ      'J'
     C                   EXSR      MERKPI
     C                   END
     C     FIURBL        IFEQ      'J'
     C                   EXSR      TTSR
     C                   END
     C                   EXSR      DOKUFVSR
      * DUPLISER FRITEKST????
     C     KEYFTG        CHAIN     FREETXT2                           31
     C     *IN31         DOWEQ     '0'
     C                   MOVE      HEAVD         FRTAVD
     C                   MOVE      HEOPD         FRTOPD
     C     WZFIL         IFEQ      'J'
     C                   MOVEL     HEUNIK        FRUNIK
     C                   MOVEL     HEREFF        FRREFF
     C                   WRITE     ZREETX2R
     C                   ELSE
     C                   WRITE     FREETX2R
     C                   ENDIF
     C     KEYFTG        READE     FREETXT2                               31
     C                   END
      * FRITEKST TIL OPPDRAG
     C     WSFRD2        IFEQ      'J'
     C                   EXSR      VISFRE
     C                   END
     C* VED POSTNR.BASERT - LEGG UT OGSÅ POST MED STEDSNAVN
     C   42              DO
     C                   CLEAR                   HESTEDR
     C                   MOVE      HEAVD         HSAVD
     C                   MOVE      HEOPD         HSOPD
     C                   MOVEL     WPPNS4        HSFROM
     C                   MOVEL     WPPNS2        HSTO
     C                   WRITE     HESTEDR
     C                   END
     C   42              MOVE      WPLANF        GMLK
     C   42              MOVE      WSSDF         GMSD
     C   42              MOVE      WPLAN2        WPLANF
     C   42              MOVE      WSSDVT        WSSDF
     C                   EXSR      OPDDIS
     C   42              MOVE      GMLK          WPLANF
     C   42              MOVE      GMSD          WSSDF
     C* Send varsel til USER-profiles knyttet til avdelingen
     C                   EXSR      SNDMSG
     C                   MOVE      'J'           DUPOPD
     C                   MOVE      'NY'          XNYGML
     C                   SETOFF                                       030516
     C     DIN03         IFEQ      'J'
     C                   SETON                                        03
     C                   END
     C     DIN05         IFEQ      'J'
     C                   SETON                                        05
     C                   END
     C     DIN16         IFEQ      'J'
     C                   SETON                                        16
     C                   END
     C                   EXSR      FAKTUR
     C                   MOVE      YNYGML        XNYGML
     C* LEGG UT DUMMY REKVISISJON FOR Å LETTE SENERE SPØRRING
     C                   EXSR      DUMREK
     C                   END
     C*
     C* SLUTT DUPLIKATOPPDRAG FOR VIDERETRANSPORT
     C*
     C*
     C* OPPDATERER KRYSSREFERANSE GAMMELT OPPDRAG
     C*
     C     DUPOPD        IFEQ      'J'
     C*
     C     KEYTRG        CHAIN     HEADF                              98
     C  N98              MOVE      WSAVD1        TRAVD1
     C  N98              MOVE      WSOPD1        TROPD1
     C  N98              MOVE      WSAVD2        TRAVD2
     C  N98              MOVE      WSOPD2        TROPD2
     C  N98WSSTAF        IFEQ      ' '
     C     WSOPD1        IFNE      *ZEROS
     C                   MOVE      'O'           WSSTAF
     C                   MOVE      'O'           TRSTAF
     C                   END
     C                   END
     C  N98WSSTAE        IFEQ      ' '
     C     WSOPD2        IFNE      *ZEROS
     C                   MOVE      'O'           WSSTAE
     C                   MOVE      'O'           TRSTAE
     C                   END
     C                   END
     C  N98              UPDATE    HEADFR
     C                   END
     C                   SETOFF                                       030516
     C     DIN03         IFEQ      'J'
     C                   SETON                                        03
     C                   END
     C     XIN05         IFEQ      'J'
     C                   SETON                                        05
     C                   SETOFF                                       03
     C                   END
     C     DIN16         IFEQ      'J'
     C                   SETON                                        16
     C                   END
     C                   MOVE      HEAVDG        WSAVD
     C                   MOVE      HEOPDG        WSOPD
     C                   MOVE      HEPROG        WSPRO
     C                   MOVE      HEAVDG        HEAVD
     C                   MOVE      HEOPDG        HEOPD
     C                   MOVE      HEPROG        HEPRO
     C                   MOVE      HESGG         HESG
     C     DUPOPD        IFEQ      'J'
     C     KEYTRG        CHAIN(N)  HEADF                              98
     C                   MOVE      *OFF          *IN28
     C                   EXSR      MOVHFW
     C                   END
     C*
     C                   SETOFF                                       919298
     C     UTDUPS        ENDSR
      *
     C***********************************************
     C     GetDupAvd     BEGSR
     C***********************************************
      * FORELØPIG er det ingen som benytter Innland som distr-modul utenom NOREGE
      *           (åpner ikke før det før det gjøres som bevisst valg - mye jobb antakelig)
      * Benytt Dupens Via-som term..
     C                   MOVE      RITERM        RITERMG           4 0
      * Finn avd for Innhentingsdup (primært via NOPNR - sekundært via sone-liste)
     c                   If        WSSDFF<>*blanks and WSAVD1=*zeros
     c                             and WPLANF='NO' and WPLAN1='NO'
      * Benytt Dupens Via som term..
     C                   MOVEL     WSSDFF        TSTPNR            4
     C                   TESTN                   TSTPNR               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TSTPNR        RITERM
     C                   ENDIF
     C                   MOVEL     WSSDF         TSTPNR            4
     C                   TESTN                   TSTPNR               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TSTPNR        NUMPNR
     C     KODRIK        CHAIN     NOPNR                              33
     C     *IN33         IFEQ      *OFF
     C     NOAVDU        ANDNE     *ZEROS
     C                   MOVE      NOAVDI        WSAVD1
     C                   goto      UtAvd1
     C                   END
     C     KODRIK        SETGT     KODTRI
     C     RITERM        READPE    KODTRI                                 33
     C  N33NUMPNR        IFGE      RIPNRF
     C     NUMPNR        ANDLE     RIPNRT
     C                   MOVE      RIAVDI        WSAVD1
     C                   goto      UtAvd1
     c                   ENDIF
     C                   ENDIF                                                  end OK Num avd
     c     UtAvd1        tag
      * ved autosatt avd-sett også OTY/Frank
     c                   If        WSAVD1<>*zeros
     c                   eval      WSOTFF=IFOTFF
     c                   If        HEFBV >IFOTVG
     c                   eval      WSOTFF=IFO2FF
     c                   endif
     c                   eval      WSFRFF=IFFRFF
     c                   endif
     c                   endif                                                  end wsadv2...
      *
      * Finn avd for Utkjøringsdup. (primært via NOPNR - sekundært via sone-liste)
     c                   if        WSSDVT<>*blanks and WSAVD2=*zeros
     c                             and WPLAN2='NO' and WPLANT='NO'
      * Benytt Dupens Via som term..
     C                   MOVEL     WSSDVT        TSTPNR            4
     C                   TESTN                   TSTPNR               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TSTPNR        RITERM
     C                   ENDIF
     C                   MOVEL     WSSDT         TSTPNR            4
     C                   TESTN                   TSTPNR               33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TSTPNR        NUMPNR
     C     KODRIK        CHAIN     NOPNR                              33
     C     *IN33         IFEQ      *OFF
     C     NOAVDU        ANDNE     *ZEROS
     C                   MOVE      NOAVDU        WSAVD2
     C                   goto      UtAvd2
     C                   END
     C     KODRIK        SETGT     KODTRI
     C     RITERM        READPE    KODTRI                                 33
     C  N33NUMPNR        IFGE      RIPNRF
     C     NUMPNR        ANDLE     RIPNRT
     C                   MOVE      RIAVDU        WSAVD2
     C                   goto      UtAvd2
     c                   ENDIF
     C                   ENDIF                                                  end OK Num avd
     c     UtAvd2        tag
      * ved autosatt avd-sett også OTY/Frank
     c                   If        WSAVD2<>*zeros
     c                   eval      WSOTVT=IFOTVF
     c                   If        HEFBV >IFOTVG
     c                   eval      WSOTVT=IFO2VF
     c                   endif
     c                   eval      WSFRVT=IFFRVF
     c                   endif
     c                   endif                                                  end wsadv2...
      *
     C                   MOVE      RITERMG       RITERM
     c                   endsr
     C***********************************************
     C     BERDUP        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        UUBELØ
     C     DUPTYP        IFEQ      'F'
     C                   MOVE      WSAVD2        DUPAVD            4 0
     C                   MOVE      WSFRFF        HXFR
     C                   MOVE      WSPKFF        HXKDPL
     C                   MOVE      WPLANF        HXLKA
     C                   MOVE      WPSDF         HXSDF
     C                   MOVE      WPLAN1        HXTRI
     C                   MOVE      WPSDFF        HXSDT
     C                   ELSE
     C                   MOVE      WSAVD1        DUPAVD            4 0
     C                   MOVE      WSFRVT        HXFR
     C                   MOVE      WSPKVT        HXKDPL
     C                   MOVE      WPLAN2        HXLKA
     C                   MOVE      WPSDVT        HXSDF
     C                   MOVE      WPLANT        HXTRI
     C                   MOVE      WPSDT         HXSDT
     C                   END
     C                   MOVE      HEUR          HXUR
     C                   MOVE      *BLANKS       HXLKS
     C                   MOVE      *BLANKS       HXSDFF
     C                   MOVE      *BLANKS       HXLKK
     C                   MOVE      *BLANKS       HXSDVT
     C                   MOVE      HEVKT         HXVKT
     C                   MOVE      HEFBV         HXFBV
     C                   MOVE      HEM3          HXM3
     C                   MOVE      HELM          HXLM
     C                   MOVE      HENT          HXNT
     C                   MOVE      TRVERV        HXVERV
     C                   MOVE      TRVERB        HXVERB
      *
     C                   MOVE      *ZEROS        N5                5 0
     C                   MOVE      ' '           USKA              1
     C                   MOVE      *ZEROS        DUVNR             9 0
     C                   MOVE      *BLANK        DUVMSG           50
      * FINN FRAKT I KUNDERSFRAKTAVTALE
     C                   Z-ADD     KOAKNR        UUKN              8 0
     C                   MOVE      *BLANKS       UUVAL             3
     C                   MOVE      'FRA'         UGEB              3
     C                   MOVE      'FRA'         UGEBKO            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C                   MOVE      HXHEAD        UHEAD           256
     C                   CALL      'SYGE14'
     C                   PARM                    UGEBKO
     C                   PARM                    UGEB
     C                   PARM                    DUPAVD
     C                   PARM                    N5
     C                   PARM                    UUKN
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    DUVNR             9 0
     C                   PARM                    DUVMSG           50
     C                   PARM                    USKA
     C                   PARM                    UHEAD
      * BRUTTO
     C     UUBELØ        IFEQ      0
     C                   MOVE      *BLANKS       USONE
     C                   MOVE      *BLANKS       UUVAL
     C                   MOVE      *ZEROS        URABAT
     C                   MOVE      HXHEAD        UHEAD           256
     C                   CALL      'SYGE13'
     C                   PARM                    UGEB
     C                   PARM                    DUPAVD
     C                   PARM                    N5
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    USONE             5
     C                   PARM                    URABAT            5 2
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    UUKN
     C                   PARM                    UHEAD
     c                   parm                    atdum             1
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     SØKDUP        BEGSR
     C***********************************************
     C     WSCLOW        DIV       256           LINNBR
     C                   MVR                     POSNBR
      * SØK PÅ INNHENTINGSSIDA....
     C     *IN91         IFEQ      '0'
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     49
     C     POSNBR        ANDLE     51
     C                   CALL      'SYFA14B'
     C                   PARM                    WSAVD1
     C                   Z-ADD     54            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      *
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDGE     54
     C     POSNBR        ANDLE     55
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOTFF
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * søk laste lossested
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     17
     C     POSNBR        ANDLE     46
     C                   CALL      'SYFI10J'
     C                   PARM                    WSLNAV
     C                   Z-ADD     7             LINNBR
     C                   Z-ADD     55            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * PROD.KODE
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDEQ     55
     C                   MOVEL     WSPKFF        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C                   CALL      'SYKUKD'
     C                   PARM                    YKFTYP
     C                   PARM                    UUPDAT
     C                   PARM                    KFKOD
     C                   MOVEL     KFKOD         WSPKFF
     C                   Z-ADD     64            POSNBR
     C                   GOTO      SLSØDU
     C                   END
     C* FRANKATUR
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     64
     C     POSNBR        ANDLE     66
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFRFF
     C                   PARM                    USPED
     C                   GOTO      SLSØDU
     C                   END
     C*
      * BILNUMMER
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     49
     C     POSNBR        ANDLE     58
     C                   CALL      'SYTR19'
     C                   PARM                    WSFFBN
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      *
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     60
     C     POSNBR        ANDLE     67
     C                   CALL      'SYTR04A'
     C                   PARM                    WSFFTN
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * MODUL
     C     LINNBR        IFEQ      6
     C     POSNBR        ANDEQ     69
     C                   MOVEL     'DELSYS'      UTYP
     C                   MOVEL     *BLANKS       RETURK
     C                   CALL      'SYFAKDA'
     C                   PARM                    UTYP             10
     C                   PARM                    VEDL              1
     C                   PARM                    RETURK            5
     C     RETURK        IFNE      *BLANKS
     C                   MOVEL     RETURK        WSURF
     C                   END
     C                   GOTO      SLSØDU
     C                   END
      *
     C                   END
      *
      * SØK PÅ UTKJØRINGSSIDA  ...
     C     *IN92         IFEQ      '0'
      *
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     49
     C     POSNBR        ANDLE     51
     C                   CALL      'SYFA14B'
     C                   PARM                    WSAVD2
     C                   Z-ADD     54            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      *
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     54
     C     POSNBR        ANDLE     55
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOTVT
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     55            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * søk laste lossested
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     17
     C     POSNBR        ANDLE     46
     C                   CALL      'SYFI10J'
     C                   PARM                    WSHNAV
     C                   Z-ADD     14            LINNBR
     C                   Z-ADD     55            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * PROD.KODE
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDEQ     55
     C                   MOVEL     WSPKVT        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C                   CALL      'SYKUKD'
     C                   PARM                    YKFTYP
     C                   PARM                    UUPDAT
     C                   PARM                    KFKOD
     C                   MOVEL     KFKOD         WSPKVT
     C                   Z-ADD     64            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      *
      * FRANKATUR
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     64
     C     POSNBR        ANDLE     66
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFRVT
     C                   PARM                    USPED
     C                   GOTO      SLSØDU
     C                   END
      * BILNR
     C     LINNBR        IFEQ      15
     C     POSNBR        ANDGE     49
     C     POSNBR        ANDLE     58
     C                   CALL      'SYTR19'
     C                   PARM                    WSVFBN
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     10            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * TRANSPORTØR
     C     LINNBR        IFEQ      15
     C     POSNBR        ANDGE     60
     C     POSNBR        ANDLE     67
     C                   CALL      'SYTR04A'
     C                   PARM                    WSVFTN
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     10            POSNBR
     C                   GOTO      SLSØDU
     C                   END
      * MODUL
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDEQ     69
     C                   MOVEL     'DELSYS'      UTYP
     C                   MOVEL     *BLANKS       RETURK
     C                   CALL      'SYFAKDA'
     C                   PARM                    UTYP             10
     C                   PARM                    VEDL              1
     C                   PARM                    RETURK            5
     C     RETURK        IFNE      *BLANKS
     C                   MOVEL     RETURK        WSURE
     C                   END
     C                   GOTO      SLSØDU
     C                   END
      *
     C                   END
      *
     C                   MOVE      'DIV1037'     MSGNR2
     C                   SETON                                        30
     C*
     C     SLSØDU        ENDSR
     C*
     C***********************************************
     C     SNDMSG        BEGSR
     C***********************************************
     C* Skal noen av brukerne varsles om at oppdrag er overført ?
     C     HEAVD         CHAIN     KODTD                              33
     C     *IN33         IFNE      *ON
     C*Konverter numeriske felt til venstrestilt alfa
     C                   Z-ADD     HEAVD         ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AAAVD            10
     C                   Z-ADD     HEOPD         ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AAOPD            10
     C                   Z-ADD     TRSDFD        ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AASDFD           10
     C                   Z-ADD     TRSDFK        ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AASDFK           10
     C                   Z-ADD     TRSDTD        ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AASDTD           10
     C                   Z-ADD     TRSDTK        ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AASDTK           10
     C                   Z-ADD     WSNT          ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AANT             10
     C                   Z-ADD     WSVKT         ØN151
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AAVKT            10
     C                   Z-ADD     WSLM          ØN152
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AALM             10
     C                   Z-ADD     WSM3          ØN152
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           AAM3             10
     C*
     C*Komponer tekst av: tekstkonstanter(lange), tekst(små), VARIABLER
     C*OBS! KUN ALFA.variabler
     C     TRSLAG        IFEQ      'FF'
     C** :0 (:1 :2...) angir hvor mange blanke FORAN aktuelt felt
     C     TXT1FF        CAT(P)    WSSG:1        MSGTXT
     C                   ELSE
     C     TXT1VF        CAT(P)    WSSG:1        MSGTXT
     C                   END
     C                   CAT       '.   Av':0    MSGTXT
     C                   CAT       'd/opd:':0    MSGTXT
     C                   CAT       AAAVD:1       MSGTXT
     C                   CAT       '/':0         MSGTXT
     C                   CAT       AAOPD:0       MSGTXT
     C                   CAT       'Fra':5       MSGTXT
     C                   CAT       HSFROM:1      MSGTXT
     C                   CAT       '(':1         MSGTXT
     C                   CAT       AASDFD:0      MSGTXT
     C                   CAT       AASDFK:1      MSGTXT
     C                   CAT       ')':0         MSGTXT
     C                   CAT       'til':2       MSGTXT
     C                   CAT       HSTO:1        MSGTXT
     C                   CAT       '(':1         MSGTXT
     C                   CAT       AASDTD:0      MSGTXT
     C                   CAT       AASDTK:1      MSGTXT
     C                   CAT       ')':0         MSGTXT
     C                   CAT       'for':2       MSGTXT
     C                   CAT       WSNAA:1       MSGTXT
     C                   CAT       '(':3         MSGTXT
     C                   CAT       AANT:0        MSGTXT
     C                   CAT       WSVS1:1       MSGTXT
     C                   CAT       'Vekt:':2     MSGTXT
     C                   CAT       AAVKT:1       MSGTXT
     C                   CAT       'LM:':2       MSGTXT
     C                   CAT       AALM:1        MSGTXT
     C                   CAT       'M3:':2       MSGTXT
     C                   CAT       AAM3:1        MSGTXT
     C                   CAT       ')':0         MSGTXT
     C                   CAT       TXT2:5        MSGTXT
     C* Loop så lenge det finnes usere å sende til
     C     1             DO        6             UNR               3 0
     C     US(UNR)       CABEQ     *BLANKS       UTUSR
     C     US(UNR)       IFEQ      '*PRINT'
      * SKRIV KJØREORDRE.....
     C                   MOVE      HEAVD         YYTAVD            4
     C                   MOVE      *ZEROS        YYTPRO            8
     C                   MOVE      HEOPD         YYTOPD            7
     C                   MOVE      'S'           YYTY              1
     C                   CALL      'SYTR40CB'
     C                   PARM      YYTAVD        YYTAVD
     C                   PARM      YYTPRO        YYTPRO
     C                   PARM      YYTOPD        YYTOPD
     C                   PARM      YYTY          YYTY
     C                   ELSE
     C* Sett inn user (msgq) - i front av tekst Eks: 'PETTER - Innh...
     C     APP           CAT(P)    US(UNR):0     MSGTX2
     C                   CAT       '-':1         MSGTX2
     C                   CAT       MSGTXT:1      MSGTX2
     C                   CAT       APP:0         MSGTX2
     C* Komponer kommando av blanding av tekstkonstanter/variabler
     C     CMD1          CAT       MSGTX2:0      CMD
     C                   CAT       CMD2:0        CMD
     C                   CAT       US(UNR):0     CMD
     C                   CAT       CMD3:0        CMD
     C* Utfør kommandoen via QCMDEXEC
     C                   Z-ADD     1024          CMDLE            15 5
     C                   CALL      'QCMDEXC'                            33
     C                   PARM                    CMD
     C                   PARM                    CMDLE
     C                   END
     C                   END
     C                   END
     C     UTUSR         ENDSR
     C*
      *////////////////////////////////////////////////////////////
      *  Leftjustify num.fields                              SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
     C                   Z-ADD     0             ØX                2 0
      * Move correct value into alpha 12-field
     C                   MOVE      *ZEROS        ØA12
     C     ØN152         IFGT      0
     C     ØA152T        ANDEQ     '0'
     C                   Z-ADD     ØN152         ØN151
     C                   ENDIF
     C     ØN151         IFEQ      0
     C     ØA152D        IFEQ      '00'
     C                   MOVE      ØA152H        ØA12
     C                   ELSE
     C                   MOVEL     ØA152X        ØA12
     C                   MOVE      '.  '         ØA12
     C                   MOVE      ØA152D        ØA12
     C                   END
     C                   ELSE
     C     ØA151D        IFEQ      '0'
     C                   MOVE      ØA151H        ØA12
     C                   ELSE
     C                   MOVEL     ØA151X        ØA12
     C                   MOVE      '. '          ØA12
     C                   MOVE      ØA151D        ØA12
     C                   END
     C                   ENDIF
      * search from left and find first sign over 0
     C     1             DO        11            ØX
     C     Ø12(ØX)       IFNE      '0'
     C                   GOTO      SRNE1
     C                   END
     C                   END
     C     SRNE1         TAG
      * Leftjustify to a new field
     C     ØA152D        IFGT      '00'
     C     ØA152X        ANDEQ     *ZEROS
     C     ØA151D        ORGT      '0'
     C     ØA151X        ANDEQ     *ZEROS
     C                   SUB       1             ØX
     C                   ENDIF
     C                   MOVE      *BLANKS       ØAN              12
     C                   MOVEA     Ø12(ØX)       ØAN
     C                   Z-ADD     0             ØN151
     C                   Z-ADD     0             ØN152
      *
     C                   ENDSR
     C***********************************************
     C     DUMREK        BEGSR
     C***********************************************
     C* DUMMY REKVISISJON FOR Å LETTE SENERE SPØRRING
     C     'Å'           CHAIN     KOSTT                              34
     C   34              MOVE      'Å'           KTTYP
     C   34              Z-ADD     1000000       KTNR
     C   34              WRITE     KOSTTR
     C  N34              ADD       1             KTNR
     C  N34              UPDATE    KOSTTR
     C*
     C     KTNR          CHAIN     KOSBU                              34
     C   34              MOVE      'D'           BUST
     C     BUST          IFEQ      'D'
     C                   MOVE      KTNR          BUBNR
     C     UYEAR         IFGT      50
     C                   MOVE      '19'          BUPCC
     C                   ELSE
     C                   MOVE      '20'          BUPCC
     C                   END
     C                   MOVE      UYEAR         BUPÅR
     C                   MOVE      UMONTH        BUPMN
     C                   MOVE      *ZEROS        BUTNR
     C                   MOVE      *ZEROS        BULNR
     C                   MOVE      FICURR        BUVAL
     C                   MOVE      *ZEROS        BUBL
     C                   MOVE      'FRA'         BUVK
     C                   MOVE      HESGG         BUSG
     C                   MOVE      *ZEROS        BUTAVD
     C                   MOVE      *ZEROS        BUTUNR
     C                   MOVE      HEAVDG        BUOAVD
     C                   MOVE      HEOPDG        BUOPD
     C                   MOVE      'E'           BUBLST
     C                   MOVE      'E'           BUTYPE
     C                   MOVEL     '*DUPOPPD'    DSTXTA
     C                   MOVE      'RAG*'        DSTXTA
     C                   MOVE      '/'           DSTXTB
     C                   MOVE      '-'           DSTXTC
     C                   MOVE      HEAVD         DSAVD
     C                   MOVE      HEOPD         DSOPD
     C                   MOVE      DSTXT         BUTXT
     C                   MOVE      *BLANKS       BUBILK
     C                   MOVE      *BLANKS       BUBILN
     C                   MOVE      *ZEROS        BUFEDT
     C                   MOVE      'O'           BUFER
     C                   MOVE      *ZEROS        BUBNR2
     C                   MOVE      *ZEROS        BUBNR3
     C                   MOVE      *ZEROS        BULNR3
     C                   MOVE      *ZEROS        BUBLFD
     C                   END
     C   34              WRITE     KOSBUR
     C  N34              UPDATE    KOSBUR
     C                   ENDSR
      *
     C***********************************************
     C     KOST          BEGSR
     C***********************************************
     C     TRIKEY        CHAIN(N)  HETRIU                             34
     C     *IN34         IFEQ      '0'
     C     TIBURF        ANDNE     *ZEROS
     C                   MOVE      TIBURF        KTNR
     C                   ELSE
     C     'Å'           CHAIN     KOSTT                              34
     C   34              MOVE      'Å'           KTTYP
     C   34              Z-ADD     1000000       KTNR
     C   34              WRITE     KOSTTR
     C  N34              ADD       1             KTNR
     C  N34              UPDATE    KOSTTR
     C                   END
     C*
     C     KTNR          CHAIN     KOSBU                              34
     C   34              MOVE      ' '           BUST
     C* TILLATER IKKE ENDRING HVIS REKVISISJONEN HAR STATUS.
     C     BUST          IFEQ      ' '
     C                   MOVE      KTNR          BUBNR
     C                   MOVEL     HEDTÅ         BUPCC
     C                   MOVE      HEDTÅ         BUPÅR
     C                   MOVE      HEDTM         BUPMN
     C     XXSLAG        IFEQ      'FF'
     C                   MOVE      WSFFBN        BUBILN
     C                   MOVE      WSFFTN        BUTNR
     C                   MOVE      XXFFLN        BULNR
     C                   MOVE      WSFFBL        BUBL
     c     WSFFAE        IFEQ      ' '
     C                   MOVE      'A'           WSFFAE
     c                   end
     C                   MOVE      WSFFAE        BUTYPE
     C     WSFFTX        IFEQ      *BLANKS
     C                   MOVE      DSFFTX        WSFFTX
     C                   END
     C                   MOVE      WSFFTX        BUTXT
     C                   ELSE
     C                   MOVE      WSVFBN        BUBILN
     C                   MOVE      WSVFTN        BUTNR
     C                   MOVE      XXVFLN        BULNR
     C                   MOVE      WSVFBL        BUBL
     c     WSVFAE        IFEQ      ' '
     C                   MOVE      'A'           WSVFAE
     c                   end
     C                   MOVE      WSVFAE        BUTYPE
     C     WSVFTX        IFEQ      *BLANKS
     C                   MOVE      DSVFTX        WSVFTX
     C                   END
     C                   MOVE      WSVFTX        BUTXT
     C                   END
     C     BUBILN        IFEQ      *BLANKS
     C                   MOVEL     'XX'          BUBILN
     C                   END
     C   34              MOVE      FICURR        BUVAL
     C   34              MOVE      'FRA'         BUVK
     C                   MOVE      HESG          BUSG
     C                   MOVE      *ZEROS        BUTAVD
     C                   MOVE      *ZEROS        BUTUNR
     C     HEPRO         IFNE      *ZEROS
     C     HEPRO         CHAIN     TURER14                            35
     C  N35              MOVE      TUAVD         BUTAVD
     C  N35              MOVE      TUPRO         BUTUNR
     C                   END
     C                   MOVE      HEAVD         BUOAVD
     C                   MOVE      HEOPD         BUOPD
     C                   MOVE      'T'           BUBLST
     C                   MOVE      *BLANKS       BUBILK
     C                   MOVE      HEDTOP        BUFEDT
     C                   MOVE      'O'           BUFER
     C                   MOVE      *ZEROS        BUBNR2
     C                   MOVE      *ZEROS        BUBNR3
     C                   MOVE      *ZEROS        BULNR3
     C                   MOVE      *ZEROS        BUBLFD
     C                   END
     C   34              WRITE     KOSBUR
     C  N34              UPDATE    KOSBUR
      *
      * OPPDATER LINK MELLOM OPPDRAG OG REKVISISJON...
     C     TRIKEY        CHAIN     HETRIU                             34
     C     *IN34         IFEQ      '1'
     C                   CLEAR                   HETRIUR
     C                   MOVE      HEAVD         TIAVD
     C                   MOVE      HEOPD         TIOPD
     C                   MOVE      XXSLAG        TISLAG
     C                   MOVE      KTNR          TIBURF
     C                   WRITE     HETRIUR
     C                   ELSE
     C                   MOVE      KTNR          TIBURF
     C                   UPDATE    HETRIUR
     C                   END
      * OPPDATER KODE MED F=FREDIG REKVIRERT
     C     KEYTRG        CHAIN     HEADF                              34
     C     TISLAG        IFEQ      'FF'
     C                   MOVE      'F'           TRSTAF
     C                   MOVE      'F'           WSSTAF
     C                   ELSE
     C                   MOVE      'F'           TRSTAE
     C                   MOVE      'F'           WSSTAE
     C                   END
     C  N34              UPDATE    HEADFR
     C*
     C                   ENDSR
      *
     C***********************************************
     C     OPDHTR        BEGSR
     C***********************************************
     C                   MOVE      WSM3          HEM3
     C                   MOVE      WSRUND        TRRUND
     C                   MOVE      UDATOA        TRSDFD
     C                   MOVE      WSSDFK        TRSDFK
     C                   MOVE      UDATOB        TRSDTD
     C                   MOVE      WSSDTK        TRSDTK
     C                   MOVE      UDATOC        TRSFFD
     C                   MOVE      WSSFFK        TRSFFK
     C                   MOVE      UDATOD        TRSVTD
     C                   MOVE      WSSVTK        TRSVTK
     C                   MOVE      WSKDAK        TRKDAK
     C                   MOVE      WSVERV        TRVERV
     C                   MOVE      WSVERB        TRVERB
     C                   MOVE      WSETTV        TRETTV
     C                   MOVE      WSETTB        TRETTB
     C                   MOVE      WSFRAK        TRFRAK
     C                   MOVE      WSFRAV        TRFRAV
     C                   MOVE      WSFRAB        TRFRAB
     C                   MOVE      WSMVA         TRMVA
     C                   MOVE      WSFA11        TRFA11
     C                   MOVE      WSFA12        TRFA12
     C                   MOVE      WSFLP1        TRFLP1
     C                   MOVE      WSFA21        TRFA21
     C                   MOVE      WSFA22        TRFA22
     C                   MOVE      WSFLP2        TRFLP2
     C                   MOVE      WSKNFA        HEKNA
     C                   MOVE      WSTSTA        TRTSTA
     C                   MOVE      WSSTAF        TRSTAF
     C                   MOVE      WSSTAE        TRSTAE
     C                   MOVE      WSKDFF        TRKDFF
     C   33              MOVE      'HO'          TRSLAG
     C   33              MOVE      *ZEROS        TRAVD1
     C   33              MOVE      *ZEROS        TROPD1
     C   33              MOVE      *ZEROS        TRAVD2
     C   33              MOVE      *ZEROS        TROPD2
     C*
     C                   ENDSR
      *
     C***********************************************
     C     OPHEST        BEGSR
     C***********************************************
     C* NÅR POSTNUMMERBASERT: OPPDATER OGSÅ STEDSNAVN (TEKST) I HESTED
     C                   MOVE      HEAVD         HSAVD
     C                   MOVE      HEOPD         HSOPD
     C     HEADFK        CHAIN     HESTED                             33
     C                   MOVEL     WPPNS1        HSFROM
     C                   MOVEL     WPPNS2        HSTO
     C                   MOVEL     WPPNS3        HSVIA1
     C                   MOVEL     WPPNS4        HSVIA2
     C   33              WRITE     HESTEDR
     C  N33              UPDATE    HESTEDR
     C                   ENDSR
     C***********************************************
     C     OPDHTD        BEGSR
     C***********************************************
     C* OPPDTARER DUPLIKATOPPDRAG
     C                   MOVE      ' '           HXEDIK
     C                   MOVE      *ZEROS        TRRUND
     C                   MOVE      WSKDAK        TRKDAK
     C                   MOVE      WSM3          HEM3
     C                   MOVE      *BLANKS       TRVERV
     C                   MOVE      *ZEROS        TRVERB
     C                   MOVE      *BLANKS       TRETTV
     C                   MOVE      *ZEROS        TRETTB
     C                   MOVE      *BLANKS       TRFRAK
     C                   MOVE      *BLANKS       TRFRAV
     C                   MOVE      *ZEROS        TRFRAB
     C                   MOVE      WSFA11        TRFA11
     C                   MOVE      WSFA12        TRFA12
     C                   MOVE      WSFLP1        TRFLP1
     C                   MOVE      WSFA21        TRFA21
     C                   MOVE      WSFA22        TRFA22
     C                   MOVE      WSFLP2        TRFLP2
     C                   MOVE      *ZEROS        HEKNA
     C                   MOVE      *BLANKS       TRTSTA
     C                   MOVE      'N'           TRMVA
     C     WSFFBL        IFNE      *ZEROS
     C     TRSLAG        ANDEQ     'FF'
     C                   MOVE      WSFFAE        TRFRAK
     C     TRFRAK        IFEQ      ' '
     C                   MOVE      'M'           TRFRAK
     C     WSFFBL        IFNE      XXFFBLM
     C                   MOVE      'A'           TRFRAK
     C                   END
     C                   END
     C                   MOVE      FICURR        TRFRAV
     C                   Z-ADD     WSFFBL        TRFRAB
     C                   MOVE      HEAVD         XDUAVD
     C                   MOVE      HEOPD         XDUOPD
     C                   MOVE      *ZEROS        XXFALI
     C                   EXSR      ILINFR
     C                   END
     C     WSVFBL        IFNE      *ZEROS
     C     TRSLAG        ANDEQ     'VF'
     C                   MOVE      WSVFAE        TRFRAK
     C     TRFRAK        IFEQ      ' '
     C                   MOVE      'M'           TRFRAK
     C     WSVFBL        IFNE      XXVFBLM
     C                   MOVE      'A'           TRFRAK
     C                   END
     C                   END
     C                   MOVE      FICURR        TRFRAV
     C                   Z-ADD     WSVFBL        TRFRAB
     C                   MOVE      HEAVD         XDUAVD
     C                   MOVE      HEOPD         XDUOPD
     C                   MOVE      *ZEROS        XXFALI
     C                   EXSR      ILINFR
     C                   END
     C                   ENDSR
     C***********************************************
     C     ILINFR        BEGSR
     C***********************************************
     C     YYFAKE        CHAIN     FAKT                               31
     C                   CLEAR                   FAKTR
     C                   MOVE      *ZEROS        FALI
     C                   MOVE      WSAVD         FAAVD
     C                   MOVE      WSOPD         FAOPD
     C                   Z-ADD     TRFRAB        FABELV
     C                   Z-ADD     TRFRAB        FABELN
     C                   MOVE      'FRA'         FAVK
     C                   MOVE      FICURR        FAVAL
     C                   MOVE      'I'           FASK
     C                   MOVE      TRMVA         FAKDM
     C                   MOVE      'M'           FAKDA
     C                   Z-ADD     TRAVD0        FAAVDR
     C                   EXSR      DECI
     C                   MOVE      FRABET        FAKUNR
     C                   MOVE      FAKUNR        PKKNR
     C     PRIKKEY       CHAIN     PRIK                               33
     C  N33              MOVE      PKSAMM        FACD11
     C  N31              UPDATE    FAKTR
     C   31              WRITE     FAKTR
     C                   ENDSR
     C***********************************************
     C     MOVWHF        BEGSR
     C***********************************************
      * totalt endret flytting ikke merket
      *
      * selger
     C                   MOVE      WSKDFS        HEKDFS
     C                   MOVE      WSVALS        HEVALS
     C                   MOVE      WSKNSF        HEKNSF
     C                   MOVE      WSANS         HEANS
     C                   MOVE      WSNASF        HENASF
      * kjøper
     C                   MOVE      WSKDFK        HEKDFK
     C                   MOVE      WSVALK        HEVALK
     C                   MOVE      WSKNKF        HEKNKF
     C                   MOVE      WSANK         HEANK
     C                   MOVE      WSNAKF        HENAKF
      *
     C                   MOVE      WSSDL         HESDL
     C                   MOVE      WSSDLA        HESDLA
     C                   MOVE      WSSG          HESG
     C                   MOVE      WSPOS2        HEPOS2
     C                   MOVE      WSPOS1        HEPOS1
     C                   MOVE      WSGN          HEGN
      * KUN OPPDATER LØPENR MM. HVIS EKSPORT
     C     RETNING       IFEQ      'EKS'
     C                   IF        WSTLE <> *BLANKS
     C                   MOVE      WSTLE         HETLE
     C                   END
     C                   IF        WSTLL <> *BLANKS
     C                   MOVE      WSTLL         HETLL
     C                   END
     C                   MOVE      WSTLKU        HETLKU
     C                   END
     C                   MOVE      WSNTVS        HENTVS
     C                   MOVE      WSPK1         HEPK1
     C                   MOVE      WSPK2         HEPK2
     C                   MOVE      'X'           HEST
     C                   MOVE      *ZEROS        HESTD
     C                   MOVE      WSPRO         HEPRO
     C                   MOVEL     WSHAWB        HEHAWB
     C                   MOVE      XVALP         HEVALP
     C                   MOVE      WSVALT        HEVALT
     C                   MOVE      WSSDF         HESDF
     C                   MOVE      WSSDT         HESDT
     C                   MOVE      WSKNA         TRKNFA
     C                   MOVE      WSNAA         HENAA
     C                   MOVE      WSKNS         HEKNS
     C                   MOVE      WSNAS         HENAS
     C                   MOVE      WSADS1        HEADS1
     C                   MOVE      WSADS2        HEADS2
     C                   MOVE      WSADS3        HEADS3
     C                   MOVE      WSKNK         HEKNK
     C                   MOVE      WSNAK         HENAK
     C                   MOVE      WSADK1        HEADK1
     C                   MOVE      WSADK2        HEADK2
     C                   MOVE      WSADK3        HEADK3
      * Geolokasjon på hente/lev-side basert på kunde
     C                   IF        HEHBRE=*ZEROS OR HEHBLK='K'
     C                   MOVE      WSHBRE        HEHBRE
     C                   MOVE      WSHLEN        HEHLEN
     C                   MOVE      ' '           HEHBLK
     C                   IF        HEHBRE<>*ZEROS
     C                   MOVE      'K'           HEHBLK
     C                   ENDIF
     C                   ENDIF
     C                   IF        HELBRE=*ZEROS OR HELBLK='K'
     C                   MOVE      WSLBRE        HELBRE
     C                   MOVE      WSLLEN        HELLEN
     C                   MOVE      ' '           HELBLK
     C                   IF        HELBRE<>*ZEROS
     C                   MOVE      'K'           HELBLK
     C                   ENDIF
     C                   ENDIF
     C                   MOVE      WSOT          HEOT
     C                   MOVE      WSFR          HEFR
     C                   MOVE      WSKDPL        HEKDPL
     C                   MOVE      WSNT          HENT
     C                   MOVE      WSVS1         HEVS1
     C                   MOVE      WSSLI4        HESTL4
N04  C                   MOVE      WTGX          HTGX
n04  C                   MOVE      WSSTN6        HESTN6
     C                   MOVE      WSVKT         HEVKT
     C                   MOVE      WSLM          HELM
     C                   MOVE      WSSDFF        HESDFF
     C                   MOVE      WSSDVT        HESDVT
     C                   MOVE      WSPK3         HEPK3
     C                   MOVE      WSPK4         HEPK4
     C                   MOVE      WSPK5         HEPK5
     C                   MOVE      WSPK6         HEPK6
     C                   MOVE      WSPK7         HEPK7
     C                   MOVE      WSPK8         HEPK8
     C  N42              MOVE      WSLANF        HELKA
     C  N42              MOVE      WSLANT        HETRI
     C  N42              MOVE      WSLAN1        HELKS
     C  N42              MOVE      WSLAN2        HELKK
     C   42              MOVE      WPLANF        HELKA
     C   42              MOVE      WPLANT        HETRI
     C   42              MOVE      WPLAN1        HELKS
     C   42              MOVE      WPLAN2        HELKK
     C                   MOVE      WSFBV         HEFBV
     C                   MOVEL     WSSNDN        HXSNDN
     C                   MOVE      WSAPLL        HXPALL
     C                   MOVEL     WSBLGK        HXBLGK
     C                   MOVEL     WSLKOD        HXLKOD
     C                   MOVEL     WSLLST        HXLLST
     C                   z-add     wspoen        hepoen
     C*                  MOVE      WSRFA         HERFA
     C                   MOVEL     WSRFA         HERFA
N82  C                   MOVEL     WSRFK         HERFK
     C                   MOVE      WSGM1         HEGM1
     C                   MOVE      WSGM2         HEGM2
     C                   MOVE      WSVS2         HEVS2
     C                   MOVE      WSKF          HEKF
     C                   MOVE      WSKFT1        HEKFT1
     C                   MOVE      WSFT1         HEFT1
     C*
     C                   ENDSR
     C***********************************************
     C     MOVWP         BEGSR
     C***********************************************
     C* VED 42 ON - POSTNRBASERT STEDSANGIVELSE/FRAKTBEREGNING
     C* MÅ EN DEL WSFELT FLYTTES TIL WPFELT UMIDDELBART FØR SKJERMVISN.
     C  N04              MOVE      WSSDF         WPSDF
     C  N04              MOVE      WSSDT         WPSDT
     C  N04              MOVE      WSSDFF        WPSDFF
     C  N04              MOVE      WSSDVT        WPSDVT
     C                   MOVE      WSSDFD        WPSDFD
     C                   MOVE      WSSDTD        WPSDTD
     C                   MOVE      WSSFFD        WPSFFD
     C                   MOVE      WSSVTD        WPSVTD
     C                   MOVE      WSSDFK        WPSDFK
     C                   MOVE      WSSDTK        WPSDTK
     C                   MOVE      WSSFFK        WPSFFK
     C                   MOVE      WSSVTK        WPSVTK
     C                   MOVE      WSSTAF        WPSTAF
     C                   MOVE      WSSTAE        WPSTAE
     C                   ENDSR
     C***********************************************
     C     MOVPW         BEGSR
     C***********************************************
     C* VED 42 ON - POSTNRBASERT STEDSANGIVELSE/FRAKTBEREGNING
     C* MÅ EN DEL WPFELT FLYTTES TIL WSFELT UMIDDELBART ETTER SKJ.VISN.
     C                   MOVE      WPSDF         WSSDF
     C                   MOVE      WPSDT         WSSDT
     C                   MOVE      WPSDFF        WSSDFF
     C                   MOVE      WPSDVT        WSSDVT
     C                   MOVE      WPSDFD        WSSDFD
     C                   MOVE      WPSDTD        WSSDTD
     C                   MOVE      WPSFFD        WSSFFD
     C                   MOVE      WPSVTD        WSSVTD
     C                   MOVE      WPSDFK        WSSDFK
     C                   MOVE      WPSDTK        WSSDTK
     C                   MOVE      WPSFFK        WSSFFK
     C                   MOVE      WPSVTK        WSSVTK
     C                   MOVE      WPSTAF        WSSTAF
     C                   MOVE      WPSTAE        WSSTAE
     C                   ENDSR
     C***********************************************
     C     SØKKUN        BEGSR
     C***********************************************
     C                   CALL      'SOEKKUN'
     C                   PARM                    SOKKNR
     C                   PARM                    FIFIRM
     C                   PARM                    NAVN30           30
     c                   endsr
      *********************************************************
     c     SØKKU2        BEGSR
      *********************************************************
     C                   EXSR      TESTB2
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C                   EXSR      SETOFI
     C     WSKDAK        IFEQ      ' '
     C                   Z-ADD     8             POSNBR
     C                   Z-ADD     3             LINNBR
     C                   END
     C     WSRFA         IFEQ      *BLANKS
     C                   Z-ADD     8             POSNBR
     C                   Z-ADD     4             LINNBR
     C                   END
     C                   END
      *
     C     INNLAN        IFEQ      'J'
     C     INFULL        ANDNE     'J'
     C     WSOPD         ANDNE     *ZEROS
     C     WSKNFA        ANDNE     *ZEROS
     C     WSKNFA        ANDNE     GMKNFA
     C                   EXSR      OPDUTK
     C                   END
     C*
     C                   Z-ADD     1             UFLAGG
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKKUN8       BEGSR
     C***********************************************
      * ønsker også å kunne søke på gamlemåten med alle på en gang
     C                   CALL      'SOEKUN'
     C                   PARM                    FIFIRM
     C                   PARM                    SOANTK
     C                   PARM      SKTXT1        SOTXT1            8
     C                   PARM                    WSKNA
     C                   PARM      SKTXT2a       SOTXT2            8
     C                   PARM                    WSKNSF
     C                   PARM      SKTXT3        SOTXT3            8
     C                   PARM                    WSKNS
     C                   PARM      SKTXT4        SOTXT4            8
     C                   PARM                    WSKNK
     C                   PARM      SKTXT5        SOTXT5            8
     C                   PARM                    WSKNFA
     C                   PARM      SKTXT2b       SOTXT6            8
     C                   PARM                    WSKNKF
     C                   PARM                    SOTXT7
     C                   PARM                    SOKNR7
     C                   PARM                    SOTXT8
     C                   PARM                    SOKNR8
     c                   endsr
     C***********************************************
     C     VISOPL        BEGSR
     C***********************************************
     C     LINNBR        IFEQ      18
     C     WSOPD         ANDNE     0
     C                   CALL      'SYFA19R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      SLVISO
     C                   END
      *
     C     LINNBR        IFEQ      3
     C                   MOVE      SKTXT1        XSKMOT            8
     C                   MOVE      WSKNA         XSKKNR            8 0
     C                   GOTO      STVISO
     C                   END
     C     LINNBR        IFEQ      4
     C                   MOVE      SKTXT2a       XSKMOT
     C                   MOVE      WSKNSF        XSKKNR
     C                   GOTO      STVISO
     C                   END
     C     LINNBR        IFEQ      5
     C                   MOVE      SKTXT2b       XSKMOT
     C                   MOVE      WSKNKF        XSKKNR
     C                   GOTO      STVISO
     C                   END
     C* fortollingsagent
     C     LINNBR        IFEQ      3
     C     POSNBR        andge     92
     c     posnbr        andle     99
     C                   MOVE      SKTXT5        XSKMOT
     C                   MOVE      WSKNFA        XSKKNR
     C                   GOTO      STVISO
     C                   END
     C*
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
     C     WSKNS         ANDNE     0
     C                   MOVE      SKTXT3        XSKMOT
     C                   MOVE      WSKNs         XSKKNR
     C                   GOTO      STVISO
     C                   END
     C*
     C     LINNBR        IFEQ      12
     C     WSKNK         ANDNE     0
     C                   MOVE      SKTXT4        XSKMOT
     C                   MOVE      WSKNK         XSKKNR
     C                   GOTO      STVISO
     C                   END
      *
     C     LINNBR        IFEQ      11
     C     POSNBR        ANDGE     2
     C     POSNBR        ANDLE     16
     C                   CALL      'EDI90R'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   GOTO      SLVISO
     C                   END
     C*
     C*
     C                   MOVE      'DIV1036'     MSGNR
     C                   SETON                                        30
     C                   GOTO      SLVISO
     C*
     C     STVISO        TAG
     C                   MOVE      *ZEROS        UFLAGG
     C                   CALL      'FRITXTSK'
     C                   PARM                    FIFIRM
     C                   PARM                    XSKKNR
     C                   PARM                    XSKMOT
     C                   PARM                    UFLAGG
     C                   PARM                    DELSYI
     C                   GOTO      SLVISO
     C*
     C     SLVISO        ENDSR
     C*
     C***********************************************
     C     SØKVA1        BEGSR
     C***********************************************
     C* SELGER
     C* HVIS SELGER/AVSENDER IKKE ER OPPGITT SJEKK PÅ KJØPER/MOTT.SIDE
     C* (FASTE HENTEADRESSER(MOTPART)   FOR EN MOTTAKER.....)
     C                   MOVE      WSKNS         XXKNVA            8 0
     C     XXKNVA        IFEQ      *ZEROS
     C                   MOVE      WSKNK         XXKNVA
     C                   END
     C     XXKNVA        IFEQ      *ZEROS
     C                   MOVE      WSKNA         XXKNVA
     C                   END
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    XXKNVA
     C                   PARM                    WSNAS
     C                   PARM                    WSADS1
     C                   PARM                    WSADS2
     C                   PARM                    WSADS3
     C                   PARM                    WSLAND            2
     C                   PARM                    UADRNR            5
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKVA2        BEGSR
     C***********************************************
     C* KJØPER
     C*FINN LEV.ADR VIA KUNDENS KUNDENUMMER  (I VADR..)
     C     WSSTJ1        IFEQ      '*'
     C                   EXSR      SOKUKU
     C                   GOTO      UTVA2
     C                   END
      * FINN LEV.ADR VIA KUNDEREGISTER?(VED AVVIK FRA KJØPER..)
     C     WSNAKA        IFEQ      'K*'
     C                   EXSR      SOKUVA
     C                   GOTO      UTVA2
     C                   END
     C* HVIS KJØPER/MOTTAKER IKKE ER OPPGITT SJEKK PÅ SELGER/AVS.SIDE
     C* (FASTE LEV.ADRESSE(MOTPART)   KNYTTET TIL AVSENDER....)
     C                   MOVE      WSKNK         XXKNVA            8 0
     C     XXKNVA        IFEQ      *ZEROS
     C                   MOVE      WSKNS         XXKNVA
     C                   END
     C     XXKNVA        IFEQ      *ZEROS
     C                   MOVE      WSKNA         XXKNVA
     C                   END
     C                   CALL      'SOEKVADR'
     C                   PARM                    FIFIRM
     C                   PARM                    XXKNVA
     C                   PARM                    WSNAK
     C                   PARM                    WSADK1
     C                   PARM                    WSADK2
     C                   PARM                    WSADK3
     C                   PARM                    WSLAND            2
     C                   PARM                    UADRNR            5
     C*
     C     UTVA2         TAG
     C                   ENDSR
     C***********************************************
     C     SOKUKU        BEGSR
     C***********************************************
     C     VADKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSKNK
     C                   KFLD                    WSKURE
     C     VADKEY        CHAIN     VADR3                              33
     C  N33              DO
     C                   MOVE      VADRNA        WSNAK
     C                   MOVE      VADRN1        WSADK1
     C                   MOVE      VADRN2        WSADK2
     C                   MOVE      VADRN3        WSADK3
     C     valand        ifne      *blanks
     c                   move      '   '         wsadk3
     c                   move      valand        wsadk3
     c                   end
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     SOKUVA        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        XXXKN             8 0
     C                   MOVEL     WSNAKB        XXXNA            30
     C                   CALL      'SOEKKUN'
     C                   PARM                    XXXKN
     C                   PARM                    FIFIRM
     C                   PARM                    XXXNA
     C     XXXKN         IFNE      *ZEROS
     C                   MOVE      XXXKN         KUNDNR
     C     KUND1K        CHAIN     CUNDL01                            33
     C     *IN33         IFEQ      *OFF
     C                   MOVE      KNAVN         WSNAK
     C                   MOVE      ADR1          WSADK1
     C                   MOVE      ADR2          WSADK2
     C     POSTNR        IFEQ      0
     C     SYPOGE        IFEQ      *BLANKS
     C                   MOVEL     ADR3          WSADK3
     C                   ELSE
     C                   MOVE      ENGAD3        WSADK3
     C                   END
     C                   ELSE
     C                   MOVEL     POSTNR        WSADK3
     C                   MOVE      ADR3          WSADK3
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     FAKTUR        BEGSR
     C***********************************************
      * SJEKK OM TVUNGET (ELLER FRITT) VEDLIKEHOLD AV FRIE SØKEVEIER
      * BASERT PÅ KUNDENR. (OPPDR.GIVERS OG FAKT.MOTT. KUNDENR)
     C                   MOVE      'N'           OTIAUT            1
     c     TRSLAG        ifeq      'HO'
     C                   MOVE      WSKNA         OTIKU1            8 0
     C                   MOVE      *ZEROS        OTIKU2            8 0
     C     FRABET        IFNE      WSKNA
     C                   MOVE      FRABET        OTIKU2
     C                   END
     C* FØRST KUNDE 1
     C                   MOVE      OTIKU1        OTIKNR
     C     OTI0          TAG
     C                   MOVE      WSAVD         OTIAVD
     C     OTI1          TAG
     C                   MOVE      'N'           OTIJN             1
     C     OTIKEY        SETLL     CUOTI
     C     OTIKEY        READE     CUOTI                                  33
     C     *IN33         DOWEQ     '0'
      * Kundespesif. søkevei.. Finnes koden fra før/hvis ikke lag den
     C                   MOVE      'J'           OTIJN
     C                   MOVE      WSAVD         FSAVD
     C                   MOVE      WSOPD         FSOPD
     C                   MOVE      COKODE        FSKODE
     C     FSOKEY        CHAIN     FRISOK                             33
     C  N33              UPDATE    FRISOKR
     C     *IN33         IFEQ      '1'
     C                   MOVE      *BLANKS       FSSOK
     C     FSKODE        CHAIN     KODFRI                             33
     C  N33              MOVE      KFSODK        FSDOKK
     C   33              MOVE      *BLANKS       FSDOKK
     C                   MOVE      HEDTOP        FSDTOP
     C                   WRITE     FRISOKR
     C                   END
      *  Hvis kravfelt.. er det utfyllt ...  hvis ikke AUTO INN..
     C     COKRAV        IFEQ      '1'
     C     COKRAV        OREQ      '2'
     C     FSSOK         IFEQ      *BLANKS
     C                   MOVE      'J'           OTIAUT
     C                   END
     C                   END
     C     OTIKEY        READE     CUOTI                                  33
     C                   END
      * Hvis ingenting fantes på spesifik avdeling, prøv med 0 i avd.
     C     OTIJN         IFEQ      'N'
     C     OTIAVD        ANDNE     *ZEROS
     C                   MOVE      *ZEROS        OTIAVD
     C                   GOTO      OTI1
     C                   END
      * DERETTER KUNDE 2 (F.MOT) HVIS FORSKJ. FRA KUNDE 1 (OPPDGI.)
     C     OTIKU2        IFNE      *ZEROS
     C                   MOVE      OTIKU2        OTIKNR
     C                   MOVE      *ZEROS        OTIKU2
     C                   GOTO      OTI0
     C                   END
     C                   END
      *
     C* HVIS UTILFREDSSTILTE KRAVFELT - AUTO-VIS FRIE SØKEV.
     C     OTIAUT        IFEQ      'J'
     C                   CALL      'SYFA64'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSKNA
     C                   PARM                    FRABET
     C                   END
     C*
     C                   Z-ADD     0             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   12              Z-ADD     3             UFLAGG
     C   16              Z-ADD     6             UFLAGG
     C                   MOVE      *ZEROS        UKFRA             7 0
     C                   MOVE      ' '           WSMELD            1
     C     WSKDFF        IFEQ      'K'
     C                   MOVE      XSUTL         XKUTL             4 2
     C                   MOVE      XSUMIN        XKUMIN            2 0
     C                   MOVE      *ZEROS        XSUTL
     C                   MOVE      *ZEROS        XSUMIN
     C                   END
     C     *IN37         IFNE      '1'
      * I BATCH...
     C     UFLAGG        IFEQ      3
     C     UFLAGG        OREQ      6
     C                   GOTO      BAT
     C                   END
      * ONLINE  ..
     C                   CALL      'SYFI10X'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XNYGML
     C                   PARM                    KO2UTL
     C                   PARM                    XKUTL
     C                   PARM                    XSUTL
     C                   PARM                    XKUMIN
     C                   PARM                    XSUMIN
     C                   PARM                    KO2MVK
     C                   PARM                    KO2MVS
     C                   PARM                    UKFRA
     C                   PARM                    KOVAVR
     C                   PARM                    WSMSG
     C                   PARM                    WSMELD
     C                   PARM                    UFLAGG
     C                   PARM                    UKODE             1
     C                   PARM                    USECUR            6
     C                   GOTO      UTFAK
     C     BAT           TAG
     C                   MOVEL     FIFIRM        QDA01
     C                   MOVEL     WSAVD         QDA02
     C                   MOVEL     WSOPD         QDA03
     C                   MOVEL     XNYGML        QDA04
     C                   MOVEL     KO2UTL        QDA05
     C                   MOVEL     XKUTL         QDA06
     C                   MOVEL     XSUTL         QDA07
     C                   MOVEL     XKUMIN        QDA08
     C                   MOVEL     XSUMIN        QDA09
     C                   MOVEL     KO2MVK        QDA10
     C                   MOVEL     KO2MVS        QDA11
     C                   MOVEL     UKFRA         QDA12
     C                   MOVEL     KOVAVR        QDA13
     C                   MOVEL     WSMSG         QDA14
     C                   MOVEL     WSMELD        QDA15
     C                   MOVEL     UFLAGG        QDA16
     C                   MOVEL     UKODE         QDA17
     C                   MOVEL     USECUR        QDA18
     C                   MOVEL     'SYFI10XQ'    QDTAQ            10
     C                   MOVEL     '*LIBL'       QLIB             10
     C                   Z-ADD     109           QRLEN             5 0
     C                   CALL      'QSNDDTAQ'
     C                   PARM                    QDTAQ
     C                   PARM                    QLIB
     C                   PARM                    QRLEN
     C                   PARM                    QDATA
     C                   END
     C     UTFAK         TAG
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      8                                      08
     C     UFLAGG        COMP      1                                      12
     C  N33
     CAN 16              MOVE      HEOPD         WSOPDG
      * VED F12-> TILBAKE TIL OPPDRAGSBILDE BELØP/KODE KAN VÆRE ENDRET!
     C   12              DO
     C     HEADFK        CHAIN(N)  HEADF                              33
     C                   MOVE      TRFRAK        WSFRAK
     C                   MOVE      TRFRAB        WSFRAB
     C                   MOVE      TRMVA         WSMVA
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     BILLOFW       BEGSR
     C***********************************************
      * ny kode W benyttes for forenklet Wabill (kode B blir full sjø-B/L)
     C                   Z-ADD     0             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   16              Z-ADD     6             UFLAGG
     C                   CALL      'SYEX10A'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     BILLOF        BEGSR
     C***********************************************

     c                   move      wsavd         uavd2
     c                   move      wsopd         uopd2
     c                   move      wssg          usg2
     C     RETNING       IFEQ      'IMP'
     C                   Z-ADD     8             UFLAGG                         8=Import  TRMOD
     C                   ELSE
     C                   Z-ADD     9             UFLAGG                         9=Eksport TRMOD
     C                   END
     C                   CALL      'SYSJ50I'
     C                   PARM                    UAVD2             4 0
     C                   PARM                    UOPD2             7 0
     C                   PARM                    USG2              3
     C                   PARM      'N'           UKUNB             1
     C                   PARM                    UAVD3             4 0
     C                   PARM                    UOPD3             7 0
     C                   PARM                    UFLAGG
     C                   PARM      0             ULUNIK            9 0
      * foreløpig alltid tilbake til fakturabilde
     C                   Z-ADD     5             UFLAGG
      *
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C
     C                   ENDSR
     C*
     C***********************************************
     C     CMRFBR        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C   03              Z-ADD     3             UFLAGG
     C   16              Z-ADD     6             UFLAGG
     C     FILAND        IFEQ      '  '
     C     FILAND        OREQ      'NO'
     C                   CALL      'SYEX10B'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   ELSE
     C                   CALL      'SYEX10E'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   END
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     SØKDTA        BEGSR
     C***********************************************
     C                   move      *blanks       navn30
     C                   Z-ADD     1             UFLAGG
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     10
     C     POSNBR        ANDLE     17
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFGT      10
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wskna         sokknr            8 0
     c                   move      wsnaa         navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wskna             8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
     C* Fakturapart selger
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     86
     C     POSNBR        ANDLE     93
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFGT      86
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsknsf        sokknr            8 0
     c                   move      wsnasf        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknsf            8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
     C* Fakturapart kjøper
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     86
     C     POSNBR        ANDLE     93
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFGT      86
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsknkf        sokknr            8 0
     c                   move      wsnakf        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknkf            8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
      * AGENT/SELGER/KJØPER
     C* FULLT BILDE.
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C     LINNBR        IFEQ      3
     C     POSNBR        ANDGE     92
     C     POSNBR        ANDLE     90
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      92
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsknfa        sokknr            8 0
     c                   move      wsnafa        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknfa            8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
     c*
     C* selger
     c*
     C     LINNBR        IFEQ      8
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      8
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wskns         sokknr            8 0
     C                   EXSR      SØKKUN
     C                   move      sokknr        wskns             8 0
     c                   move      wsnams        navn30
     c                   END
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
     C*
     c*
     C* kjøper
     c*
     C     LINNBR        IFEQ      12
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     15
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      8
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsknk         sokknr            8 0
     c                   move      wsnamk        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknk             8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     C                   END
      * INNL.MODUS
     C                   ELSE
     C     POSNBR        IFGE      8
     C     POSNBR        ANDLE     15
     C     LINNBR        IFEQ      6
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      8
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wskns         sokknr            8 0
     c                   move      wsnams        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wskns             8 0
     c                   endif
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     c                   end
     C     LINNBR        IFEQ      9
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      8
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsknk         sokknr            8 0
     c                   move      wsnamk        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknk             8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     c                   end
     C     LINNBR        IFEQ      12
      * Cursor i BAK første i feltet = søk på gamlemåte (alle knr..)
     C     POSNBR        IFgt      8
     C                   EXSR      SØKKUN8
     c                   else
     C                   move      wsnafa        sokknr            8 0
     c                   move      wsnamk        navn30
     C                   EXSR      SØKKUN
     C                   move      sokknr        wsknfa            8 0
     c                   end
     C                   EXSR      SØKKU2
     C                   GOTO      SLSØK
     c                   end
     C                   END
     C                   END
     C*
     C*
      * HENTE-ADRESSER
     C*
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C     LINNBR        IFGE      09
     C     LINNBR        ANDLE     10
     C     POSNBR        ANDGE     9
     C     POSNBR        ANDLE     79
     C                   EXSR      SØKVA1
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
      * levadr DRESSER
     C*
     C     LINNBR        IFGE      13
     C     LINNBR        ANDLE     14
     C     POSNBR        ANDGE     9
     C     POSNBR        ANDLE     79
     C                   EXSR      SØKVA2
     C                   GOTO      SLSØK
     C                   END
      * INNL.MODUS
     C                   ELSE
     C     LINNBR        IFGE      7
     C     LINNBR        ANDLE     8
     C                   EXSR      SØKVA1
     C                   GOTO      SLSØK
     C                   END
     C*
     C     LINNBR        IFGE      10
     C     LINNBR        ANDLE     11
     C                   EXSR      SØKVA2
     C                   GOTO      SLSØK
     C                   END
     C                   END
      *
     C* LOSSESTED
     C* FULLT BILDE.
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C     LINNBR        IFEQ      14
     C     POSNBR        ANDGE     97
     C     POSNBR        ANDLE     116
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDL
     C                   Z-ADD     16            LINNBR
     C                   Z-ADD     4             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   ELSE
      * innland
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     28
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDL
     C                   GOTO      SLSØK
     C                   END
     C                   END
      *
     C* Lastested
     C* FULLT BILDE.
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C     LINNBR        IFEQ      10
     C     POSNBR        ANDGE     97
     C     POSNBR        ANDLE     116
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDLA
     C                   Z-ADD     12            LINNBR
     C                   Z-ADD     08            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   ELSE
      * innland
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     28
     C                   CALL      'SYFI10J'
     C                   PARM                    WSSDLA
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C* Val/OIL-tillegg
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     57
     C     POSNBR        ANDLE     59
     C                   CALL      'SYFI10D'
     C                   PARM                    WSVALT
     C                   Z-ADD     63            POSNBR
     C                   GOTO      SLSØK
     C                   END

      * STEDSREGISTER  V innlandsbilde
     C     INNLAN        IFEQ      'J'
     C     INFULL        andne     'J'
     C   42LINNBR        IFEQ      13
     C     POSNBR        ANDGE     08
     C     POSNBR        ANDLE     12
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDF
     C                   PARM                    USØKPN
     C                   PARM                    WPLANF
     C                   GOTO      SLSØK
     C                   END
     C   42LINNBR        IFEQ      13
     C     POSNBR        ANDGE     54
     C     POSNBR        ANDLE     58
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDT
     C                   PARM                    USØKPN
     C                   PARM                    WPLANT
     C                   GOTO      SLSØK
     C                   END
     C                   END
      * STEDSREGISTER M.M. - KUN VED FULLT BILDE1
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C  N42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     12
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDF
     C                   PARM                    USØKPN
     C                   PARM                    WSLANF
     C                   Z-ADD     14            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C   42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WPLANF
     C                   PARM                    USPED
     C                   Z-ADD     11            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     11
     C     POSNBR        ANDLE     15
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDF
     C                   PARM                    USØKPN
     C                   PARM                    WPLANF
     C                   Z-ADD     17            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C  N42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     48
     C     POSNBR        ANDLE     52
     C                   MOVE      *BLANKS       USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDT
     C                   PARM                    USØKPN
     C                   PARM                    WSLANT
     C                   Z-ADD     54            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C   42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     48
     C     POSNBR        ANDLE     49
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WPLANT
     C                   PARM                    USPED
     C                   Z-ADD     51            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      5
     C     POSNBR        ANDGE     51
     C     POSNBR        ANDLE     55
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDT
     C                   PARM                    USØKPN
     C                   PARM                    WPLANT
     C                   Z-ADD     57            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
      * valutakode selger
      *
     C     LINNBR        IFEQ      9
     C     POSNBR        ANDGE     91
     C     POSNBR        ANDLE     93
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALS
     C                   Z-ADD     106           POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
      *
      * valutakode KJØPER
      *
     C     LINNBR        IFEQ      13
     C     POSNBR        ANDGE     91
     C     POSNBR        ANDLE     93
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVALK
     C                   Z-ADD     106           POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* FORFRAKT /  VIA 1
     C*
     C  N42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     12
     C                   MOVE      *BLANKS       USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDFF
     C                   PARM                    USØKPN
     C                   PARM                    WSLAN1
     C                   Z-ADD     14            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WPLAN1
     C                   PARM                    USPED
     C                   Z-ADD     11            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     11
     C     POSNBR        ANDLE     15
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDFF
     C                   PARM                    USØKPN
     C                   PARM                    WPLAN1
     C                   Z-ADD     17            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C* VIDEREFRAKT /  VIA 2
     C*
     C  N42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     48
     C     POSNBR        ANDLE     52
     C                   MOVE      *BLANKS       USØKPN
     C                   CALL      'SYFI10F'
     C                   PARM                    WSSDVT
     C                   PARM                    USØKPN
     C                   PARM                    WSLAN2
     C                   Z-ADD     54            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     48
     C     POSNBR        ANDLE     49
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10L'
     C                   PARM                    WPLAN2
     C                   PARM                    USPED
     C                   Z-ADD     51            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C   42LINNBR        IFEQ      6
     C     POSNBR        ANDGE     51
     C     POSNBR        ANDLE     55
     C                   MOVE      *BLANKS       USØKPN           30
     C                   CALL      'SYFI10F'
     C                   PARM                    WPSDVT
     C                   PARM                    USØKPN
     C                   PARM                    WPLAN2
     C                   Z-ADD     57            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C*
     C                   END
     C*
     C* OPPDRAGSTYPE
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   CALL      'SYFI10C'
     C                   PARM                    WSOT
     C                   Z-ADD     21            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* FRANKATUR
     C*
     C*
     C     LINNBR        IFEQ      7
     C     POSNBR        ANDGE     21
     C     POSNBR        ANDLE     23
     C                   MOVE      'J'           USPED             1
     C                   CALL      'SYFI10G'
     C                   PARM                    WSFR
     C                   PARM                    USPED
     C                   Z-ADD     8             LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
      *
      * KALKULATOR ANTALL,VEKT,M3,LM, ULIK PLASSERING INNLAND/FULL
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C* KALKULATOR ANTALL
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     20
     C     POSNBR        ANDLE     26
     C                   Z-ADD     WSNT          UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSNT
     C                   Z-ADD     33            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR BRUTTOVEKT
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     62
     C     POSNBR        ANDLE     70
     C                   Z-ADD     WSVKT         UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSVKT
     C                   Z-ADD     72            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR KUBIKK
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     87
     C     POSNBR        ANDLE     94
     C                   Z-ADD     WSM3          UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSM3
     C                   Z-ADD     17            LINNBR
     C                   Z-ADD     9             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR LASTEMETER
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     96
     C     POSNBR        ANDLE     100
     C                   Z-ADD     WSLM          UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSLM
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     9             POSNBR
     C                   GOTO      SLSØK
     C                   END
     c* søk farlig gods
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     108
     C     POSNBR        ANDLE     116
     c                   CALL      'SYFA10D2'
     c                   parm                    WSUNN1
     c                   parm                    WSEMB1
     c                   end
     c* søk farlig gods
     C     LINNBR        IFEQ      17
     C     POSNBR        ANDGE     108
     C     POSNBR        ANDLE     116
     c                   CALL      'SYFA10D2'
     c                   parm                    WSUNN2
     c                   parm                    WSEMB2
     c                   end
     c* søk farlig gods
     C     LINNBR        IFEQ      18
     C     POSNBR        ANDGE     108
     C     POSNBR        ANDLE     116
     c                   CALL      'SYFA10D2'
     c                   parm                    WSUNN3
     c                   parm                    WSEMB3
     c                   end
     C*
     C* KALKULATOR VAREVERDI
     C     LINNBR        IFEQ      21
     C     POSNBR        ANDGE     118
     C     POSNBR        ANDLE     131
     C                   Z-ADD     WSVERB        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSVERB
     C                   Z-ADD     30            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR FRAKTBELØP
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     17
     C     POSNBR        ANDLE     30
     C                   Z-ADD     WSFRAB        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C     WSFRAB        IFNE      UNU132
     C                   MOVE      'A'           WSFRAK
     C                   END
     C                   Z-ADD     UNU132        WSFRAB
     C                   GOTO      SLSØK
     C                   END
     C*
     C                   ELSE
      * INNLANDSBILDE
     C* KALKULATOR ANTALL
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     10
     C     POSNBR        ANDLE     14
     C                   Z-ADD     WSNTWS        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSNTWS
     C                   Z-ADD     16            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR BRUTTOVEKT
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     43
     C     POSNBR        ANDLE     51
     C                   Z-ADD     WSVKT         UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSVKT
     C                   Z-ADD     53            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR KUBIKK
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     53
     C     POSNBR        ANDLE     60
     C                   Z-ADD     WSM3          UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSM3
     C                   Z-ADD     62            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C*
     C* KALKULATOR LASTEMETER
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDGE     62
     C     POSNBR        ANDLE     66
     C                   Z-ADD     WSLM          UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C                   Z-ADD     UNU132        WSLM
     C                   Z-ADD     79            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C* KALKULATOR FRAKTBELØP
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     64
     C     POSNBR        ANDLE     71
     C                   Z-ADD     WSFRAF        UNU132           13 2
     C                   CALL      'SYGE11'
     C                   PARM                    UNU132
     C     WSFRAF        IFNE      UNU132
     C                   MOVE      'A'           WSFRAK
     C                   END
     C                   Z-ADD     UNU132        WSFRAF
     C                   GOTO      SLSØK
     C                   END
     C*
      *
     C                   END
      *
      * UTL-FORBEH.KODE / KVITTERINGSKODE
      *
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C     LINNBR        IFEQ      23
     C     POSNBR        ANDGE     9
     C     POSNBR        ANDLE     10
     C                   CALL      'SYFA71A'
     C                   PARM                    WSKF
     C                   Z-ADD     12            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      23
     C     POSNBR        ANDEQ     12
     C                   MOVE      *BLANKS       XKFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP
     C                   PARM                    UUPDAT            1
     C                   PARM                    XKFKOD
     C                   MOVEL     XKFKOD        WSKFT1
     C                   Z-ADD     15            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *INNLAND
     C                   ELSE
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDGE     8
     C     POSNBR        ANDLE     9
     C                   CALL      'SYFA71A'
     C                   PARM                    WSKF
     C                   Z-ADD     11            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
     C     LINNBR        IFEQ      19
     C     POSNBR        ANDEQ     11
     C                   MOVE      *BLANKS       XKFKOD
     C                   CALL      'SYFAKDA'
     C                   PARM                    XKFTYP
     C                   PARM                    UUPDAT            1
     C                   PARM                    XKFKOD
     C                   MOVEL     XKFKOD        WSKFT1
     C                   Z-ADD     20            LINNBR
     C                   Z-ADD     13            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
      *
      * PRODUKT-KODE
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
     C   42LINNBR        IFEQ      22
     C     POSNBR        ANDEQ     47
     C                   MOVEL     WSKDPL        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C                   CALL      'SYKUKD'
     C                   PARM                    YKFTYP
     C                   PARM                    UUPDAT
     C                   PARM                    KFKOD
     C                   MOVEL     KFKOD         WSKDPL
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     57            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *INNLAND
     C                   ELSE
     C     LINNBR        IFEQ      16
     C     POSNBR        ANDEQ     79
     C                   MOVEL     WSKDPL        KFKOD
N04  C                   EVAL      YKFTYP = 'PRODTYPE'
     C                   CALL      'SYKUKD'
     C                   PARM                    YKFTYP
     C                   PARM                    UUPDAT
     C                   PARM                    KFKOD
     C                   MOVEL     KFKOD         WSKDPL
     C                   Z-ADD     18            LINNBR
     C                   Z-ADD     8             POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
      * VALKODE FOR VAREVERDI
     C     INNLAN        IFEQ      'N'
     C     INFULL        OREQ      'J'
      *
     C     LINNBR        IFEQ      21
     C     POSNBR        ANDGE     114
     C     POSNBR        ANDLE     116
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSVERV
     C                   Z-ADD     118           POSNBR
     C                   GOTO      SLSØK
     C                   END
      * ETTERKRAV
     C     LINNBR        IFEQ      22
     C     POSNBR        ANDGE     114
     C     POSNBR        ANDLE     116
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSETTV
     C                   Z-ADD     118           POSNBR
     C                   GOTO      SLSØK
     C                   END
      * FRAKTBELØP
     C  N36LINNBR        IFEQ      22
     C     POSNBR        ANDGE     12
     C     POSNBR        ANDLE     14
     C                   CALL      'V200SY'
     C                   PARM                    USØK
     C                   PARM                    WSFRAV
     C                   Z-ADD     16            POSNBR
     C                   GOTO      SLSØK
     C                   END
      *
      * TOLLSTEDKODE
      *
     C     LINNBR        IFEQ      25
     C     POSNBR        ANDGE     37
     C     POSNBR        ANDLE     40
     C                   CALL      'SYFI10H'
     C                   PARM                    W2TOLL
     C                   Z-ADD     43            POSNBR
     C                   GOTO      SLSØK
     C                   END
     C                   END
     C*
     C*
     C                   MOVE      'DIV1037'     MSGNR
     C                   SETON                                        30
     C*
     C     SLSØK         ENDSR
     C*
     C***********************************************
     C     FAX           BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        FAXKUN            8 0
     C   21              MOVE      'M'           FAXTYP            1
     C   20              MOVE      'A'           FAXTYP
     C                   MOVE      ' '           FAXPAR
     C                   MOVE      ' '           FAXPA2
     C* TRANSP/NR-BILNR
     C* HVIS F20 (AUTO) ON - FORSØK MED TRANSPORTØR, HVIS FAXNR ...
     C     LINNBR        IFEQ      2
     C                   MOVE      *BLANKS       TFAXNR
     C                   MOVE      *ZEROS        FAXKUN
      * AUTO-FORSØK
     C     *IN20         IFEQ      *ON
     C     HEPRO         ANDNE     *ZEROS
     C     HEPRO         CHAIN     TURER14                            30
     C  N30              MOVE      TUKNT2        TRANUM
     C  N30TRAKEY        CHAIN     TRAN                               30
     C  N30              MOVE      VMTRKU        FAXKUN
     C  N30              MOVE      VMTRKU        KUNDNR
     C  N30KUND1K        CHAIN     CUNDL01                            30
     C                   END
      *
     C     TFAXNR        IFNE      *BLANKS
     C                   MOVE      'T'           FAXPAR            1
     C                   ELSE
     C                   MOVE      *ZEROS        FAXKUN
     C                   MOVE      'B'           FAXPA2
     C                   END
     C                   END
     C*
     C*OPPDRAGSGIVER
     C     LINNBR        IFEQ      3
     C                   MOVE      WSKNA         FAXKUN
     C                   MOVE      'O'           FAXPAR            1
     C                   END
     C*
     C*FAKTURAMOTTAKER
     C     LINNBR        IFEQ      4
     C                   MOVE      FRABET        FAXKUN
     C                   MOVE      WSKDFF        FAXPAR            1
     C                   END
     C* AGENT
     C     LINNBR        IFEQ      3
     c     posnbr        andge     92
     c     posnbr        andle     99
     C                   MOVE      WSKNFA        FAXKUN
     C                   MOVE      'A'           FAXPAR            1
     C                   END
     C* SELGER / AVSENDER
     C     LINNBR        IFEQ      9
     C                   MOVE      WSKNS         FAXKUN
     C                   MOVE      'S'           FAXPAR            1
     C                   END
     C     LINNBR        IFEQ      10
     C     LINNBR        OREQ      11
     C                   MOVE      'S'           FAXPA2            1
     C                   END
     C*KJØPER / MOTTAKER
     C     LINNBR        IFEQ      13
     C                   MOVE      WSKNK         FAXKUN
     C                   MOVE      'K'           FAXPAR            1
     C                   END
     C     LINNBR        IFEQ      14
     C     LINNBR        OREQ      15
     C                   MOVE      'K'           FAXPA2            1
     C                   END
     C   20FAXPAR        IFEQ      ' '
     C                   MOVE      'M'           FAXTYP
     C                   END
     C* GÅ TIL FAXMODUL
     C                   CALL      'FAX010CL'
     C                   PARM                    FAXKUN
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    FAXTYP
     C                   PARM                    FAXPAR
     C                   PARM                    FAXPA2
     C* GI MELDING TIL BRUKER
     C     FAXTYP        IFEQ      'A'
     C                   SETON                                        30
     C                   MOVE      'SHU0242'     MSGNR
     C                   END
     C*
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     UTCMDL        BEGSR
     C***********************************************
      * SNUDD PÅ REKKEFØLGE UTEN MERKING....
     C                   MOVE      'DIV0029'     MSGLN4                         F24=Flere Ftaster
     C     XCMD          IFEQ      0
     C                   MOVE      'JOV0859'     MSGLN1                         F2=Endre reg.modus
     C                   MOVE      'DIV0032'     MSGLN2                         F4=Søking
     C                   MOVE      'DIV3572'     MSGLN3                         F18=Notis
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      1
     C                   MOVE      'DIV0985'     MSGLN1                         F9=Til planlegging
     C                   MOVE      'DIV4037'     MSGLN2                         F10=Fulload/se tur
     C                   MOVE      'DIV0031'     MSGLN3                         F16=Neste oppdrag
     C                   ADD       1             XCMD
     C                   ELSE
     C     XCMD          IFEQ      2
     C                   MOVE      'DIV0020'     MSGLN1                         F3=Avslutt
     C                   MOVE      'DIV0030'     MSGLN2                         F5=Videre
     C                   MOVE      'DIV0024'     MSGLN3                         F12=Forrige
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C     XCMD          IFEQ      3
     C                   MOVE      'DIV0037'     MSGLN1                         F14=Vis opplysning
     C                   MOVE      'SHU0127'     MSGLN2                         F15=Frie søkeveier
     C                   MOVE      'SHU0209'     MSGLN3                         F20/21=Send fax
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C     XCMD          IFEQ      4
     C                   MOVE      'DIV0041'     MSGLN1                         F6=Beregn kubikk
     C                   MOVE      'DIV4098'     MSGLN2                         F11= Rekvisisjon
     C                   MOVE      'JOV0279'     MSGLN3                         F22=Hurtigbooking
     C                   MOVE      'JOV1631'     MSGLN4                         F23=Skillark
     C                   ADD       1             XCMD              1 0
     C                   ELSE
     C                   MOVE      'DIV0033'     MSGLN1                         F7=Gå til spørring
     C                   MOVE      'JOV1623'     MSGLN2                         F8=Varelinjer
     C                   MOVE      'JOV1630'     MSGLN3                         F13=ATD/ATA...
     C                   Z-ADD     0             XCMD
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTS2K       KLIST
     C                   KFLD                    KS2UNI
     C                   KFLD                    KS2LK
     C                   MOVEL     'S2'          KS2UNI
     C     PRIKKEY       KLIST
     C                   KFLD                    PKKNR
     C                   KFLD                    PKAVTN
     C                   KFLD                    PKGEBY
     C                   MOVE      '0'           PKAVTN
     C                   MOVE      'FRA'         PKGEBY
     C     FIRAVD        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KOAKNR
     C     VALKE1        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSVERV
     C     VALKE2        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSETTV
     C     VALKE3        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFRAV
     C*
     C     VALKE4        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    FAVAL
     C*
     C                   MOVE      'F'           XDFSTA            1
     C                   MOVE      'T'           XDTSTA            1
     C                   MOVE      '001'         XFBNR             3 0
     C     DOKUFK        KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     DokufKeyA     KLIST
     C                   KFLD                    XDFSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     DOKFMKey      KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    FMAVDx            4 0
     C                   KFLD                    FMOPDx            7 0
     C                   KFLD                    XXFBNR            3 0
     C                   MOVE      'F'           FMRI
     C     *LIKE         DEFINE    DGSLINR       WDGSLINR
     C                   EVAL      WDGSLINR=99
     C     DOKUDGK       KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     TURKEY        KLIST
     C                   KFLD                    DITUAV
     C                   KFLD                    DITUR
     C     DOKUTK        KLIST
     C                   KFLD                    XDTSTA
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XFBNR
     C     KOTRKE        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    XXKNSY            8 0
     C                   KFLD                    HEKNT
     C*
     C                   MOVE      'TST'         XTSUNI            3
     C     KODTSK        KLIST
     C                   KFLD                    XTSUNI
     C                   KFLD                    W2TOLL
     C     HEADFK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     HEADKK        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     KPIKEY        KLIST
     C                   KFLD                    XKAVD
     C                   KFLD                    XKOPD
     C     HEDU1K        KLIST
     C                   KFLD                    TRAVD1
     C                   KFLD                    TROPD1
     C     HEDU2K        KLIST
     C                   KFLD                    TRAVD2
     C                   KFLD                    TROPD2
     C     TRIKEY        KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    XXSLAG            2
     C     FREETK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     KODTAK        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    WSAVD
     C     KODTA1        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    WSAVD1
     C     KODTA2        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    WSAVD2
     C     KOINLK        KLIST
     C                   KFLD                    XAUNI
     C                   KFLD                    UAVDNU            4 0
     C     KODRIK        KLIST
     C                   KFLD                    RITERM
     C                   KFLD                    NUMPNR            4 0
     C     KODTVK        KLIST
     C                   KFLD                    XVUNI
     C                   KFLD                    WSAVD
     C     KODSFK        KLIST
     C                   KFLD                    XSFUNI
     C                   KFLD                    WSSG
     C     KODOTK        KLIST
     C                   KFLD                    XOTUNI
     C                   KFLD                    WSOT
     C     OAVTKS        KLIST
     C                   KFLD                    WSKNA
     C                   KFLD                    WSOT
     C     KODOTF        KLIST
     C                   KFLD                    XOTUNI
     C                   KFLD                    WSOTFF
     C     KODOTV        KLIST
     C                   KFLD                    XOTUNI
     C                   KFLD                    WSOTVT
     C     KODO2K        KLIST
     C                   KFLD                    XO2UNI
     C                   KFLD                    WSOT
     C     KODO2F        KLIST
     C                   KFLD                    XO2UNI
     C                   KFLD                    WSOTFF
     C     KODO2V        KLIST
     C                   KFLD                    XO2UNI
     C                   KFLD                    WSOTVT
     C     KODLIK        KLIST
     C                   KFLD                    KLIUNI
     C                   KFLD                    KLIKOD
     C     KODGEK        KLIST
     C                   KFLD                    XGEUNI
     C                   KFLD                    WSVALT
     C     KODGEA        KLIST
     C                   KFLD                    XGEUNI
     C                   KFLD                    FAVK
     C     KODGE2K       KLIST
     C                   KFLD                    XG2UNI
     C                   KFLD                    FAVK
     C     LEVE1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    FALEVN
     C     KODFRK        KLIST
     C                   KFLD                    XFRUNI
     C                   KFLD                    WSFR
     C     KODVAS        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSVALS
     C     KODVAK        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSVALK
     C     KODTEK        KLIST
     C                   KFLD                    KOTMUN
     C                   KFLD                    WSSDL1
     C                   MOVE      'TERM'        KOTMUN
     C     KODTEK2       KLIST
     C                   KFLD                    KOTMUN
     C                   KFLD                    WSSDLA1
     C                   MOVE      'TERM'        KOTMUN
     C     KODTEKH       KLIST
     C                   KFLD                    KOTMUN
     C                   KFLD                    WSLNAV1
     C     KODTEKL       KLIST
     C                   KFLD                    KOTMUN
     C                   KFLD                    WSHNAV1
     C     FRATXK        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYI            1
     C                   MOVE      'H'           DELSYI
     C     FRAT2K        KLIST
     C                   KFLD                    FXKNR
     C                   KFLD                    DELSYB            1
     C     VADRK         KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C                   KFLD                    XVADRN
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
     C     TRAKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    TRANUM            8 0
     C     XXFAKE        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    XXFALI
     C     YYFAKE        KLIST
     C                   KFLD                    XDUAVD            4 0
     C                   KFLD                    XDUOPD            7 0
     C                   KFLD                    XXFALI
     C     FFKEY         KLIST
     C                   KFLD                    WSAVD1
     C                   KFLD                    WSOPD1
     C     VFKEY         KLIST
     C                   KFLD                    WSAVD2
     C                   KFLD                    WSOPD2
     C     KODFRF        KLIST
     C                   KFLD                    XFRUNI
     C                   KFLD                    WSFRFF
     C     KODFRV        KLIST
     C                   KFLD                    XFRUNI
     C                   KFLD                    WSFRVT
     C                   MOVE      'FR'          XFRUNI            2
     C     DOKUFVKG      KLIST
     C                   KFLD                    FVRI
     C                   KFLD                    HEAVDG
     C                   KFLD                    HEOPDG
     C                   KFLD                    FVFBNR
     c                   KFLD                    FVLINR
     C                   MOVE      'F'           FVRI
     C                   Z-ADD     1             FVLINR
     C                   Z-ADD     1             FVFBNR
     C     DOKUFVKN      KLIST
     C                   KFLD                    FVRI
     C                   KFLD                    FVAVD
     C                   KFLD                    FVOPD
     C                   KFLD                    FVFBNR
     c                   KFLD                    FVLINR
     C     DOKUFVK       KLIST
     C                   KFLD                    FVRI
     C                   KFLD                    FVAVD
     C                   KFLD                    FVOPD
     C                   KFLD                    FVFBNR
     c                   KFLD                    FVLINR
     C     DOKUFVFk      KLIST
     C                   KFLD                    FFAVD
     C                   KFLD                    FFOPD
     C                   KFLD                    FFFBNR
     c                   KFLD                    FFLINR
     C     UnNrKeyF      KLIST
     C                   KFLD                    FFUNNR
     C                   KFLD                    FFEMBG
     C     DOKUFVKE      KLIST
     C                   KFLD                    FVRI
     C                   KFLD                    FVAVD
     C                   KFLD                    FVOPD
     C                   KFLD                    FVFBNR
     C     dokufM11K     KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    FMAVD
     C                   KFLD                    FMOPD
     C                   KFLD                    FMFBNR
     c                   KFLD                    FMLINR
     c                   KFLD                    FMMKNR                         Kollinr = 1
     c                   KFLD                    FMLONR                         Løpenr = 1
     C     WKSDF         KLIST
     C                   KFLD                    WPLANF
     C                   KFLD                    WSSDF
     C     WKSDT         KLIST
     C                   KFLD                    WPLANT
     C                   KFLD                    WSSDT
     C     WKSDFF        KLIST
     C                   KFLD                    WPLAN1
     C                   KFLD                    WSSDFF
     C     WKSDVT        KLIST
     C                   KFLD                    WPLAN2
     C                   KFLD                    WSSDVT
     C     SONKEY        KLIST
     C                   KFLD                    SONLK             2
     C                   KFLD                    SONKOD            5
     C     KUFASK        KLIST
     C                   KFLD                    YKFTYP
     C                   KFLD                    KFKOD
S04  C*                  MOVEL     'PRODTYPE'    YKFTYP
     C     *LIKE         DEFINE    KFTYP         YKFTYP
     C                   MOVE      'N'           UUPDAT            1
     C     KOFASK        KLIST
     C                   KFLD                    XKFTYP
     C                   KFLD                    XKFKOD
     C                   MOVEL     'UTLKOD'      XKFTYP
     C     *LIKE         DEFINE    KFTYP         XKFTYP
     C     *LIKE         DEFINE    KFKOD         XKFKOD
     C     UTLLGK        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C                   KFLD                    YUTLDT            8 0
     C                   MOVE      '99999999'    YUTLDT
     C     UTLL2K        KLIST
     C                   KFLD                    WSAVD
     C                   KFLD                    WSOPD
     C     OTIKEY        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    OTIKNR            8 0
     C                   KFLD                    OTIAVD            4 0
     C     FSOKEY        KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C                   KFLD                    FSKODE
      *
      * NØKKEL FOR AVTALEBYTE
     C     KAVTK         KLIST
     C                   KFLD                    WSKNK
     C                   KFLD                    WSKDFF
     C                   KFLD                    WSOT
     C                   KFLD                    WSFR
     C     KAVTS         KLIST
     C                   KFLD                    WSKNS
     C                   KFLD                    WSKDFF
     C                   KFLD                    WSOT
     C                   KFLD                    WSFR
     C     BRPARFK       KLIST
     C                   KFLD                    PABRID
     C                   KFLD                    PAKUNR
     C                   KFLD                    PAID
     C     TONNKEY       KLIST
     C                   KFLD                    FRABET
     C                   KFLD                    TonnID
     C                   movel     'TONN '       TonnID            5
     C     SYPARKEY      KLIST
     C                   KFLD                    SYKUNR
     C                   KFLD                    SYPAID
     C     KUNKO2K       KLIST
     C                   KFLD                    NKN
     C                   KFLD                    KUINTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    WSAVD             4 0
     C                   PARM                    WSAVDC            4 0
     C                   PARM                    WSOPD             7 0
     C                   PARM                    CALLFR            1
     C                   PARM                    UURETU            1
     C                   PARM                    UUFUNK            1
      *
      *
      * LEGGER DAGENS DATO I ULDT
      *
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      XULTM         ULTID
     C                   move      *zeros        prevalt
      * UDS  tømmer datastrukturer
     c                   movea     *zeros        FNT
     c                   movea     FVPAKN        FFP
     c                   movea     *zeros        FVK
     c                   movea     *zeros        FM3
     c                   movea     *zeros        FLM
     c                   movel     *zeros        FLE
     c                   movel     *zeros        FBR
     c                   movel     *zeros        FHO
     C                   movel     *zeros        WSPOEN            5 0
     C                   MOVE      *ZEROS        TRSDFD
     C                   MOVE      *ZEROS        TRSDTD
     C                   MOVE      *ZEROS        TRSFFD
     C                   MOVE      *ZEROS        TRSVTD
     C                   MOVE      *ZEROS        HEDTOP
     C                   MOVE      WSAVD         XAVD
     C                   MOVE      WSOPD         XOPD
     C                   CLEAR                   BILDE01
     C                   CLEAR                   BILDE02
     C                   CLEAR                   BILDE22
     C                   CLEAR                   BILDE03
     C                   MOVEA     *ZEROS        *IN
     C     XOPD          IFNE      *ZEROS
     C                   MOVE      XAVD          WSAVD
     C                   MOVE      XOPD          WSOPD
     C                   END
     C     CALLFR        IFNE      'I'
     C     CALLFR        ANDNE     'U'
     C                   MOVE      XAVD          WSAVD
     C                   END
     C                   MOVE      *ZEROS        WSVKT
     C                   MOVE      *ZEROS        WSFBV
     C*
     C* KALL FRA ULIKE OPTIONS/F-FASTER GIR FØLGENDE VERDIER I:
     C* Inngang................   UURETU(opt) UUFUNK(F-tast) CALLFR
     C*
     C* F6=NY fra subfil i SYTR33     ' '        '6'         'A'
     C* F9=NY MAL subfil i SYTR33     ' '        '9'         'A'
     C*
     C* Opt 2 sytr33                  '2'        '0'         'A'
     C* Opt 2 sytr33-MAL(FØR INIT:)   '2'        '9'         'A'
     C* Opt 3 sytr33                  '3'        '0'         'A'
     C* Opt 6 sytr33 (-->til SYFI10X) '6'        '0'         'A'
     C* Opt 5 sytr33 spørr-Går IKKE innom SYTR10......
     C* Opt 8 sytr33 notis-Går IKKE innom SYTR10.........
     C*
     C* F8=Rett til opd fra SØKEBILDE '2'        '0'         'A'
     C* F9=Rett til faktura fra SØKEBILDE - IKKE innom SYTR10......
     C* (opt 6 fra subfil bør gå direkte til SYFI10X slik som F9/SØK)
     C*
     C* FRA INNLAND -                 ...        ...         'I'
     C* KALL FRA SYTR88..(Turdisponering)
     C* Opt 2 - Endre oppdrag         '2'        '0'         'T'
     C*
     C                   MOVE      *OFF          *IN37
     C     UUFUNK        IFEQ      '9'
     C                   MOVE      *ON           *IN37
     C     UURETU        IFEQ      '2'
     C                   MOVE      '0'           UUFUNK
     C                   END
     C                   END
     C*                    MOVE INITSG    WSSG
     C                   MOVE      '0'           UIN08             1
     C*
     C     *LIKE         DEFINE    WSNT          GMNT
     C     *LIKE         DEFINE    WSVKT         GMVKT
     C     *LIKE         DEFINE    WSFBV         GMFBV
     C     *LIKE         DEFINE    WSLM          GMLM
     C     *LIKE         DEFINE    WSM3          GMM3
     C     *LIKE         DEFINE    HEVKT         GMVKT2
     C     *LIKE         DEFINE    HEM3          GMM32
     C     *LIKE         DEFINE    HEVS1         GMVS1
     C     *LIKE         DEFINE    HEVS2         GMVS2
     C     *LIKE         DEFINE    HEGM1         GMGM1
     C     *LIKE         DEFINE    HEGM2         GMGM2
     C                   MOVE      *ZEROS        GMVKT2
     C                   MOVE      *ZEROS        GMM32
     C                   MOVE      *ZEROS        GMNT
     C                   MOVE      *ZEROS        GMVKT
     C                   MOVE      *ZEROS        GMFBV
     C                   MOVE      *ZEROS        GMLM
     C                   MOVE      *ZEROS        GMM3
     C                   MOVE      *BLANKS       GMVS1
     C                   MOVE      *BLANKS       GMVS2
     C                   MOVE      *BLANKS       GMGM1
     C                   MOVE      *BLANKS       GMGM2
     C                   CLEAR                   GMFRJA
     C                   CLEAR                   GMUTKA
     C                   CLEAR                   GMTSTA
     C                   CLEAR                   GMKNFA
     C                   CLEAR                   GMSNDN
     C     *LIKE         DEFINE    WSAVD         AVDZER
     C                   MOVE      'J'           USØK              1
     C                   Z-ADD     6             SOANTK            1 0
     C                   MOVE      *BLANKS       SOTXT5            8
     C                   MOVE      *BLANKS       SOTXT6            8
     C                   MOVE      *BLANKS       SOTXT7            8
     C                   MOVE      *BLANKS       SOTXT8            8
     C                   MOVE      *ZEROS        SOKNR5            8 0
     C                   MOVE      *ZEROS        SOKNR6            8 0
     C                   MOVE      *ZEROS        SOKNR7            8 0
     C                   MOVE      *ZEROS        SOKNR8            8 0
     C                   MOVE      *ZEROS        DSPONR
     C                   Z-ADD     0             XXFALI            5 0
     C*
     C                   MOVE      'A'           XAUNI             1
     C                   MOVE      'V'           XVUNI             1
     C                   MOVE      'SF'          XSFUNI            2
     C                   MOVE      'OTY'         XOTUNI            3
     C                   MOVE      'O2Y'         XO2UNI            3
     C                   MOVE      'FR'          XFRUNI            2
     C                   MOVE      'GE'          XGEUNI            2
     C                   MOVE      'G2'          XG2UNI            2
     C                   MOVE      'LK '         XLKUNI            3
     C                   MOVE      'LIKO'        KLIUNI
     C                   MOVE      'VA'          XVAUNI            2
     C                   MOVE      *ZEROS        XFXLNR            2 0
     C                   Z-ADD     1             XVADRN            5 0
     C                   MOVE      *ZEROS        XVALP
     C                   MOVEL     'M³ = '       XMÅL
     C                   MOVE      *ZEROS        WSSDFD
     C                   MOVE      *ZEROS        WSSDTD
     C                   MOVE      *ZEROS        WSSFFD
     C                   MOVE      *ZEROS        WSSVTD
     C                   MOVE      *ZEROS        UDATOA
     C                   MOVE      *ZEROS        UDATOB
     C                   MOVE      *ZEROS        UDATOC
     C                   MOVE      *ZEROS        UDATOD
     C                   MOVE      *ZEROS        VALINJ            2 0
     C                   MOVE      *blanks       AVRTXT
     C* Appostrof inn i variabel via bitmanipulering
     C                   BITON     '123457'      APP               1
     C                   BITOFF    '06'          APP
     C                   MOVE      *ZEROS        ØN152
     C                   MOVE      *ZEROS        ØN151
     C                   MOVE      CFT1          DSFT1
     C                   MOVE      CFT2          DSFT2
     C                   MOVE      CVT1          DSVT1
     C                   MOVE      CVT2          DSVT2
     C*
     C                   MOVE      *BLANKS       FIFIRM
     C     FIFIRM        SETLL     FIRM
     C                   SETOFF                                       33
     C                   READ      FIRM                                   33
     C                   EXSR      UTCMDL
      *
     C                   EVAL      PABRID = '*KUNDFT*' + %TRIM(FIFIRM)
     C                   EVAL      PAID   = 'OSOTY'
     C*
      * Hent parametre for innland uvh. av om der er INL
     C     *LOVAL        SETLL     FIRINL
     C                   READ      FIRINL                                 33
     C     ZUSER         CHAIN     USRDFT                             33
     C                   MOVE      ZZTERM        RITERM
     C                   MOVE      'N'           INNLAN            1
     C     CALLFR        IFEQ      'I'
     C     CALLFR        OREQ      'U'
     C                   MOVE      CALLFR        INNLIU            1
     C     CALLFR        IFEQ      'I'
     C                   MOVE      'YBC1796'     MSGIN
     C                   ELSE
     C                   MOVE      'YBC1797'     MSGIN
     C                   END
      *
     C* VED INNLAND BRUKES VARIABEL INFULL SOM "SWITCH"
     C                   MOVE      'J'           INNLAN            1
     C                   SETOFF                                       32
     C                   MOVE      'N'           INFULL            1
     C                   MOVE      'J'           KOAPOS
     C                   MOVE      FILAND        WPLANF
     C                   MOVE      FILAND        WPLANT
     C                   ELSE
     C* 32 ON, ENKEL MODUS=DEFAULT,
     C                   SETON                                        32
     C* VED FØRSTE VISNING SKAL IKKE VARSEL GIS OM 32 "TVINGES" OFF
     C                   MOVE      'J'           FØRVIS            1
     C                   END
     C*
      * Ved blank selger/kjøper kopiers selgers/kjøpers F.mot (nytt i V10).PTF8=Kan hindre dette
      * Kode bak kan indikere IKKE kopier. Dft SKKopiKode er blank - blank bak betyr da KOPIER
      * Ved å parametersette koden (firmanivå) til J må bruker AKTIVT velge J for å kopiere.
     c                   move      ' '           SKKopKo           1
     C                   Move      *zeros        SYKUNR
     C                   move      'SKKOK'       SYPAID
     C     SyParKey      CHAIN     SYPARL1                            33
     c  N33              movel     SYVRDA        SKKopKo
     C*
     c                   move      'N'           PROTACT           1
     C                   move      'PRACT'       SYPAID
     C     SyParKey      CHAIN     SYPARL1                            33
     c  N33              movel     SYVRDA        PROTACT
     C*
     c                   move      'N'           DUPINL            1
     C                   move      'DUPIN'       SYPAID
     C     SyParKey      CHAIN     SYPARL1                            33
     c  N33              movel     SYVRDA        DUPINL
     C*
     C                   MOVE      'SHU0917'     XMSGNR            7
     C                   Z-ADD     3             XLEVEL            1 0
     C                   Z-ADD     0             XRETUR            1 0
     C                   Z-ADD     62            XMSGL             4 0
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          MANGLE           62
     C*protect ATD/ATA-txt
     C                   MOVE      'JOV1604'     XMSGNR            7
     C                   Z-ADD     3             XLEVEL            1 0
     C                   Z-ADD     0             XRETUR            1 0
     C                   Z-ADD     62            XMSGL             4 0
     C                   EXSR      HENTMS
     C                   MOVEL     XMSG          protTxt          80
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     HENTMS        BEGSR
     C***********************************************
     C                   CALL      'SUBR23R3'
     C                   PARM                    XMSGNR
     C                   PARM                    XMSG             62
     C                   PARM                    XLEVEL
     C                   PARM                    XRETUR
     C                   PARM                    XMSGL
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     KDTFMT        BEGSR
     C***********************************************
     C*
     C* DATO 1
     C*
     C     WSSDFD        IFEQ      0
     C                   MOVE      *ZEROS        UDATOA
     C                   ELSE
     C     WSSDFD        IFLT      3999
     C                   MOVE      WSSDFD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSDFD
     C                   END
     C                   MOVE      WSDTD1        UDT1              2 0
     C                   MOVE      WSDTM1        UDT2              2 0
     C                   MOVE      WSDTÅ1        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          UDT1A             2 0
     C                   MOVE      UDT2          UDT2A             2 0
     C     UDT3          IFGT      50
     C     UDT3          ADD       1900          UDT3A
     C                   ELSE
     C     UDT3          ADD       2000          UDT3A
     C                   END
     C                   MOVE      UDT1          WSDTD1
     C                   MOVE      UDT2          WSDTM1
     C                   MOVE      UDT3          WSDTÅ1
     C                   END
     C*
     C*
     C* DATO 2
     C*
     C     WSSDTD        IFEQ      0
     C                   MOVE      *ZEROS        UDATOB
     C                   ELSE
     C     WSSDTD        IFLT      3999
     C                   MOVE      WSSDTD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSDTD
     C                   END
     C                   MOVE      WSDTD2        UDT1              2 0
     C                   MOVE      WSDTM2        UDT2              2 0
     C                   MOVE      WSDTÅ2        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD2
     C                   MOVE      UDT2          WSDTM2
     C                   MOVE      UDT3          WSDTÅ2
     C                   MOVE      UDT1          UDT1B             2 0
     C                   MOVE      UDT2          UDT2B             2 0
     C     UDT3          IFGT      50
     C     UDT3          ADD       1900          UDT3B
     C                   ELSE
     C     UDT3          ADD       2000          UDT3B
     C                   END
     C                   END
     C*
     C*
     C* DATO 3
     C*
     C     WSSFFD        IFEQ      0
     C                   MOVE      *ZEROS        UDATOC
     C                   ELSE
     C     WSSFFD        IFLT      3999
     C                   MOVE      WSSFFD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSFFD
     C                   END
     C                   MOVE      WSDTD3        UDT1              2 0
     C                   MOVE      WSDTM3        UDT2              2 0
     C                   MOVE      WSDTÅ3        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD3
     C                   MOVE      UDT2          WSDTM3
     C                   MOVE      UDT3          WSDTÅ3
     C                   MOVE      UDT1          UDT1C             2 0
     C                   MOVE      UDT2          UDT2C             2 0
     C     UDT3          IFGT      50
     C     UDT3          ADD       1900          UDT3C
     C                   ELSE
     C     UDT3          ADD       2000          UDT3C
     C                   END
     C                   END
     C*
     C*
     C* DATO 4
     C*
     C     WSSVTD        IFEQ      0
     C                   MOVE      *ZEROS        UDATOD
     C                   ELSE
     C     WSSVTD        IFLT      3999
     C                   MOVE      WSSVTD        TMPDAT
     C                   EXSR      FIXDAT
     C                   MOVE      TMPDAT        WSSVTD
     C                   END
     C                   MOVE      WSDTD4        UDT1              2 0
     C                   MOVE      WSDTM4        UDT2              2 0
     C                   MOVE      WSDTÅ4        UDT3              2 0
     C                   CALL      'DATOFMT'
     C                   PARM                    UDT1
     C                   PARM                    UDT2
     C                   PARM                    UDT3
     C                   MOVE      UDT1          WSDTD4
     C                   MOVE      UDT2          WSDTM4
     C                   MOVE      UDT3          WSDTÅ4
     C                   MOVE      UDT1          UDT1D             2 0
     C                   MOVE      UDT2          UDT2D             2 0
     C     UDT3          IFGT      50
     C     UDT3          ADD       1900          UDT3D
     C                   ELSE
     C     UDT3          ADD       2000          UDT3D
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     VISFRE        BEGSR
     C***********************************************
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFA31CL'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   ENDSR
     C***********************************************
     C     VISAVR        BEGSR
     C***********************************************
     c                   move      USKNT         WSATRA
      * valgbilde  for transportør - men ikke når oppdrag på tur
     c     WSPRO         ifeq      *zeros
     C                   MOVE      *zeros        DITUAV                         BURDE VÆRE
     C                   MOVE      *zeros        DITUR                          UNØDVEND,MEN..
     C                   MOVE      WSATRA        TRANUM
     c                   move      *blanks       VMNAVN
     C     TRAKEY        CHAIN     TRAN                               31
     c     VisaStr       tag
     C                   EXFMT     VELGTRAN
     C                   SETOFF                                       3031
     c     *IN12         CABEQ     *ON           VisaSlutt
     c     *IN04         ifeq      *ON
     C                   CALL      'SYTR04A'
     C                   PARM                    WSATRA
     C                   MOVE      WSATRA        TRANUM
     c                   move      *blanks       VMNAVN
     C     TRAKEY        CHAIN     TRAN                               31
     C   31              MOVE      'SPT0133'     MSGNR3
     C   31              SETON                                        30
     c                   goto      VisaStr
     c                   end
      * Transp er valgt - gyldig??
     C                   MOVE      WSATRA        TRANUM
     c                   move      *blanks       VMNAVN
     C     TRAKEY        CHAIN     TRAN                               31
     c     *IN31         ifeq      *ON
     C                   MOVE      'SPT0133'     MSGNR3
     C                   SETON                                        30
     c                   goto      VisaStr
     c                   end
     c                   end
      * simuer/vis avregning
     C                   MOVE      'J'           XXVIS             1
     C                   CALL      'SYTR12A'
     C                   PARM                    DITUAV
     C                   PARM                    DITUR
     C                   PARM                    XXVIS
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    WSATRA
      *
     C     VisaSlutt     ENDSR
     C*
      *
     C***********************************************
     C     VARELIN       BEGSR
     C***********************************************
     C     *like         define    WSVS1         WSVS1X
     C     *like         define    WSNT          WSNTX
     C     *like         define    WSVKT         WSVKTX
     C     *like         define    WSM3          WSM3X
     C     *like         define    WSLM          WSLMX
     C     *like         define    WSLMLA        WSLMLAX
     C     *like         define    WSPOEN        WSPOENX
     C                   MOVE      *BLANK        UVIS              1            ARB. MED (ULIK J)
     C                   MOVEL     WSGM1         WSGM1X           12
     C                   MOVEL     WSGM2         WSGM2X           12
     C                   MOVE      WSVS1         WSVS1X
     C                   Z-ADD     WSNT          WSNTX
     C                   Z-ADD     WSVKT         WSVKTX
     C                   Z-ADD     WSM3          WSM3X
     C                   Z-ADD     WSLM          WSLMX
     C                   Z-ADD     WSLMLA        WSLMLAX
     C                   Z-ADD     WSPOEN        WSPOENX
     C                   CALL      'SYFA10A'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XFBNR
     C                   PARM                    WSNTX
     C                   PARM                    WSVKTX
     C                   PARM                    WSLMX
     C                   PARM                    WSLMLAX
     C                   PARM                    WSM3X
     C                   PARM                    WSPOENX
     C                   PARM                    WSGM1X
     C                   PARM                    WSGM2X
     C                   PARM                    XXCMN             1            BRUKES IKKE
     C                   PARM                    WSVS1X
     C                   PARM                    UVIS
     C
     C*                  if        WSNTX <> WSNT or WSVKTX <> WSVKT
     C*                            or WSM3X <> WSM3 or WSLMX <> WSLM
     C*                            or WSLMLAX <> WSLMLA or WSPOENX <> WSPOEN
     C*    HEADFK        CHAIN     HEADF                              33
     c*                  if        *in33 = *off
     C*                  Z-ADD     WSNTX         WSNT
     C*                  Z-ADD     WSVKTX        WSVKT
     C*                  Z-ADD     WSM3X         WSM3
     C*                  Z-ADD     WSLMX         WSLM
     C*                  Z-ADD     WSLMLAX       WSLMLA
     C*                  Z-ADD     WSPOENX       WSPOEN
     C*                  Z-ADD     WSNTX         HENT
     C*                  Z-ADD     WSVKTX        HEVKT
     C*                  Z-ADD     WSM3X         HEM3
     C*                  Z-ADD     WSLMX         HELM
     C*                  Z-ADD     WSLMLAX       HELMLA
     C*                  Z-ADD     WSPOENX       HEPOEN
     C*                  EXSR      FINNVK
     C*                  UPDATE    HEADFR
     C* For å hindre at det varsles om at vekt mm er endret av ekstern prosess
     C*                  MOVE      WSVKT         GMVKT2
     C*                  MOVE      WSM3          GMM32
     c*                  endif
     c*                  endif
     C*
     C                   ENDSR
      *
     C***********************************************
     C     MOVWDF        BEGSR
     C***********************************************
      *
     C                   CLEAR                   DOKUFR
      *
     C                   MOVE      ' '           DFST
     C                   MOVEL     KOVXXX        DFBELA
     C     DFBELA        IFEQ      ' '
     C     FILFB         IFEQ      'S'
     C     FILFB         OREQ      'M'
     C                   MOVE      FILFB         DFBELA
     C                   END
     C                   END
     C     INNLAN        IFEQ      'J'
     C     TRKDFF        IFeq      'S'
     C                   MOVE      'S'           DFBELA
     c                   else
     C                   MOVE      'M'           DFBELA
     c                   end
     C                   MOVE      HEKNS         DFKNSS
     C                   MOVE      HENAS         DFNAVS
     C                   MOVE      HEADS1        DFAD1S
     C                   MOVE      *BLANKS       DFAD2S
     C                   MOVEL     HEADS3        TMPPUL            4
     C                   TESTN                   TMPPUL               77
     C     *IN77         IFEQ      '1'
     C                   MOVE      TMPPUL        DFPNLS
     C                   MOVE      HEADS3        TMPAD3           25
     C                   MOVEL     TMPAD3        DFAD3S
     C                   ELSE
     C                   MOVEL     HEADS3        DFAD3S
     C                   END
     C                   MOVEL     WSKNA         DFFASE                         Oppdragsgiver v innl
     C                   ELSE
      * "SPEDISJON"
     C                   MOVE      KOAKNR        DFKNSS
     C                   MOVEL     WSNAS         DFFASE
     C     FIRAVD        CHAIN     CUNDL01                            34
     C     *IN34         IFEQ      '0'
     C                   MOVE      KNAVN         DFNAVS
     C                   MOVE      ADR1          DFAD1S
     C                   MOVE      *BLANKS       DFAD2S
     C                   MOVEL     ADR3          DFAD3S
     C                   MOVE      POSTNR        DFPNLS
     C                   END
     C                   END
     C                   MOVE      WSNT          DFNTLA
     C                   MOVE      W2TOLL        DFTOLL
     C                   MOVE      WSNAK         DFNAVL
     C                   MOVE      WSADK1        DFAD1L
     C                   MOVE      *BLANKS       DFAD2L
     C                   IF        %SUBST(WSADK3:5:1) = *BLANKS
     C                   MOVEL     WSADK3        TMPPUL            4
     C                   TESTN                   TMPPUL               77
     C                   ELSE
     C                   EVAL      *IN77 = *OFF
     C                   END
     C     *IN77         IFEQ      '1'
     C                   MOVE      TMPPUL        DFPOUL
     C                   MOVE      WSADK3        TMPAD3           25
     C                   MOVEL     TMPAD3        DFADUL
     C                   ELSE
     C                   MOVEL     WSADK3        DFADUL
     C                   END
     C                   MOVEL     XTRNV         DFNAT
     C                   MOVE      W2KDE         DFKDE
     C                   MOVE      W2KDME        DFKDME
     C                   MOVE      WSKNK         DFKNSM
     C                   MOVE      WSNAK         DFNAVM
     C                   MOVE      WSADK1        DFAD1M
     C                   MOVE      WSADK3        DFAD3M
     C                   MOVEL     WSGM1         DFGM
     C                   MOVE      WSNT          DFNT
     C                   MOVE      WSVS1         DFVS
     C                   MOVE      WSVKT         DFVKT
     C                   MOVE      WSLM          DFLM
     C                   MOVE      WSM3          DFM3
     C                   MOVEL     WSGM2         DFGM2
     C                   MOVEL     WSVS2         DFVS2
     C                   MOVE      WSFBV         DFVKTF
     C                   MOVE      WSSG          DFSG
     C                   MOVE      'F'           DFRI
     C                   MOVE      WSAVD         DFAVD
     C                   MOVE      WSOPD         DFOPD
     C                   MOVE      XFBNR         DFFBNR
     C                   MOVE      DFKNSS        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNS
     C                   MOVE      DFKNSM        XXKNSY
     C     KOTRKE        CHAIN     KODTTRR                            77
     C  N77              MOVE      KTRAK3        DFKNM
      *
      * Tildeling av fraktbrevsnr
      * (tør ikke stole på modulparameter, kan ha gått inn på innl-oppdrag via TRANS1 pkt 1)
     C*    INNLAN        IFEQ      'J'
     C     HXSNDN        IFNE      *ZEROS
     C                   MOVE      HXSNDN        WSSNDN
     C     WSSNEA        IFEQ      '401'
     C     WSSNEA        OREQ      '402'
     C                   MOVEL     WSSN17        DF1004
     C                   ELSE
     C                   MOVEL     WSSN10        DF1004
     C                   END
     c                   else
      * Finnes som IFB (edi-mottatt??)
     C                   MOVE      WSAVD         FSAVD
     C                   MOVE      WSOPD         FSOPD
     C                   move      'IFB'         FSKODE
     C     FSOKEY        chain(N)  frisok                             88
     C     *IN88         ifeq      '0'
     C                   movel     FSSOK         FBR17            17
      * Langt(EAN)nr  ???
     C                   TESTN                   FBR17                34
      * skjekker 10 langt nummer
     C     *IN34         ifeq      '0'
     C                   MOVEL     FSSOK         FBR10            10
     C                   TESTN                   FBR10                34
     C                   EVAL      FBR17=FBR10
     C                   endif
     C     *IN34         ifeq      '1'
     C                   MOVEL     FBR17         DF1004
     C                   else
     C                   exsr      tildel
     C                   endif
     C                   else
     C                   exsr      tildel
     C                   endif
     C                   END
      * Farlig gods
     C     WSFA11        IFNE      *BLANKS
     C                   CLEAR                   DOKUDGSR
     C                   MOVE      WSAVD         DGSAVD
     C                   MOVE      WSOPD         DGSOPD
     C                   MOVE      XFBNR         DGSFBNR
     C                   EVAL      DGSLINR=99
     C                   EVAL      DGS8351=WSFA11
     C                   EVAL      DGS7106=WSFLP1
     C                   MOVE      WSFA12        DGS7124
     C                   WRITE     DOKUDGSR
     C                   ENDIF
     C*
     C                   WRITE     DOKUFR
     C*
     C                   ENDSR
     C***********************************************
     C     TILDEL        BEGSR
     C***********************************************
     C                   CALL      'SYGE15'
     C                   PARM                    Sndn20           20
     c                   eval      DF1004=%subst(Sndn20:4:17)
     c                   eval      FSSOK =%subst(Sndn20:4:17)
     c                   eval      FSDOKK='GL'
     c                   write     FRISOKR
     c                   endsr
     C*
     C***********************************************
     C     FRABR         BEGSR
     C***********************************************
      * Farlig gods
     C     WSFA11        IFNE      *BLANKS
     C     DOKUDGK       CHAIN     DOKUDGS                            37
     C                   IF        *IN37
     C                   CLEAR                   DOKUDGSR
     C                   MOVE      WSAVD         DGSAVD
     C                   MOVE      WSOPD         DGSOPD
     C                   MOVE      XFBNR         DGSFBNR
     C                   EVAL      DGSLINR=99
     C                   EVAL      DGS8351=WSFA11
     C                   EVAL      DGS7106=WSFLP1
     C                   MOVE      WSFA12        DGS7124
     C                   WRITE     DOKUDGSR
     C                   ENDIF
     C                   ENDIF
     C   33              MOVE      *BLANKS       XTRNV            30
     C                   Z-ADD     0             UFLAGG
     C                   CALL      'SYFI10P'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UFLAGG
     C                   PARM                    XFBNR
     C                   PARM                    TEST              1
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C*
     C     TEST          IFEQ      '2'
     C                   CALL      'SYFI10A'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    XFBNR
     C                   PARM                    KOAKNR
     C                   PARM                    XTRNV
     C                   PARM                    W2KDME
     C                   PARM                    W2KDE
     C                   PARM                    W2TOLL
     C                   PARM                    FILFB
     C                   PARM                    FILTB
     C                   PARM                    WSMSG
     C                   PARM                    UFLAGG
     C                   PARM                    TEST
     C                   MOVE      *BLANKS       TEST
     C                   END
     C*
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      6                                      16
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     MOVWDT        BEGSR
     C***********************************************
     C                   MOVE      ' '           DTST
     C                   MOVE      W2TOLL        DTTOLL
     C                   MOVE      WSSG          DTSG
     C                   MOVE      'T'           DTRI
     C                   MOVE      WSAVD         DTAVD
     C                   MOVE      WSOPD         DTOPD
     C                   MOVE      XFBNR         DTFBNR
     C*
     C                   ENDSR
     C*
     C*
     C***********************************************
     C     BERFRA        BEGSR
     C***********************************************
      *
     C                   Move      ' '           XVOPKO            1
     C                   MOVE      ' '           XKDA
      * SELGER BETALER, FAST KODE FOR AT KJØPERS AVTALE SKAL BRUKES...
     C     WSKDFS        IFEQ      ' '
     C     WSKDFF        ANDEQ     'S'
     C     WSKNK         ANDNE     *ZEROS
     C     KAVTK         CHAIN     KAVT                               33
     C  N33              MOVE      'B'           WSKDFS
     C                   END
      * KJØPER BETALER, FAST KODE FOR AT SELGERS AVTALE SKAL BRUKES...
     C     WSKDFS        IFEQ      ' '
     C     WSKDFF        ANDEQ     'K'
     C     WSKNS         ANDNE     *ZEROS
     C     KAVTS         CHAIN     KAVT                               33
     C  N33              MOVE      'B'           WSKDFS
     C                   END
     C                   Z-ADD     1             BYLOOP            1 0
      *
     C                   MOVE      FRABET        KUNDNR
      *
     C     BYTTAG        TAG
     C     KUND1K        CHAIN     CUNDL01                            33
     C  N33AKNRKU        IFNE      *ZEROS
     C                   MOVE      AKNRKU        KUAVTA            8 0
     C                   ELSE
     C                   MOVE      KUNDNR        KUAVTA
     C                   END
      *
     C                   MOVE      *ZEROS        PARBEL
     C*
     C* OPPDATERER FIL VED MASKINELL BEREGNING
     C*
     C     WSFRAK        IFNE      'A'
     C     WSFRAK        ANDNE     'B'
     C     WSFRAK        IFNE      'E'
     C     WSFRAK        IFNE      'N'
     C     HEADFK        CHAIN     HEADF                              33
     C  N33              DO
     c     GMVKT2        Ifne      HEVKT
     c     GMM32         orne      HEM3
     c                   exfmt     ENDRET
     c                   move      HEVKT         WSVKT
     c                   move      HEM3          WSM3
     c                   end
     C                   MOVE      WSM3          HEM3
     C                   MOVE      WSVERV        TRVERV
     C                   MOVE      WSVERB        TRVERB
     C                   MOVE      WSLM          HELM
     C                   MOVE      WSNT          HENT
     C                   MOVE      WSVKT         HEVKT
     c                   move      WSVKT         GMVKT2
     c                   move      WSM3          GMM32
     C                   MOVE      WSFBV         HEFBV
     C                   MOVE      WSOT          HEOT
     C                   MOVE      WSFR          HEFR
     C                   MOVE      WSKDPL        HEKDPL
     C                   MOVE      WSSDF         HESDF
     C                   MOVE      WSSDT         HESDT
     C                   MOVE      WSSDFF        HESDFF
     C                   MOVE      WSSDVT        HESDVT
     C  N42              MOVE      WSLANF        HELKA
     C  N42              MOVE      WSLANT        HETRI
     C  N42              MOVE      WSLAN1        HELKS
     C  N42              MOVE      WSLAN2        HELKK
     C   42              MOVE      WPLANF        HELKA
     C   42              MOVE      WPLANT        HETRI
     C   42              MOVE      WPLAN1        HELKS
     C   42              MOVE      WPLAN2        HELKK
     C                   UPDATE    HEADFR
     C                   END
     C*
     C* frakt beregnes IKKE dersom vekt er 0 (og det er IKKE krav om vekt hvis FRAB = 0)
     C     wsfbv         ifne      *zeros
     C  N42              DO
     C                   MOVE      WSVALS        UUVAL             3
     C                   Z-ADD     0             UUFRAB           13 2
     C                   CALL      'SYGE02'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    DUMGEB            3
     C                   PARM                    KUAVTA
     C                   PARM                    WSKDFF
     C                   PARM                    WSANS
     C                   PARM                    WSKOMP            1 0
     C                   PARM                    XKDA              1
     C                   PARM                    PARBEL            9 2
     C                   PARM                    UUVAL
     C                   PARM                    UUFRAB
     C                   Z-ADD     UUFRAB        WSFRAB           13 2
     C                   END
     C   42              EXSR      BERFRP
     C                   end
     C*
     C     WSFRAB        IFNE      *ZEROS
     C                   MOVE      UUVAL         WSFRAV
     C                   MOVE      'M'           WSFRAK
     C                   END
      * HVIS MASKINELL BEREGNING(POSTAL) OG AVTALE IKKE ER FUNNET...
      * DERSOM KODE FOR BYTT AVTALE ER SATT/VILKÅR OK- PRØV PÅ NY.....
      * KODE E=EGEN AVTALE (F.EKS IKKE SELGERS F.MOT MEN SELGER..)
     C     BYLOOP        IFEQ      1
     C     XKDA          ANDNE     'A'
     C                   ADD       1             BYLOOP
      * E=EGEN (BRUK F.EKS IKKE SELG.F.MOT MEN SELGERS AVT).
     C     WSKDFS        IFEQ      'E'
     C     WSKDFF        IFEQ      'S'
     C     WSKNS         IFNE      *ZEROS
     C                   MOVE      WSKNS         KUNDNR
     C                   GOTO      BYTTAG
     C                   END
     C                   ELSE
     C     WSKNK         IFNE      *ZEROS
     C                   MOVE      WSKNK         KUNDNR
     C                   GOTO      BYTTAG
     C                   END
     C                   END
     C                   END
      * B=BYTT (BRUK MOTPARTS AVT.) (F.EKS IKKE SELG.F.MOT MEN KJØPER.)
     C     WSKDFS        IFEQ      'B'
     C     WSKDFF        IFEQ      'S'
     C     WSKNK         IFNE      *ZEROS
     C                   MOVE      WSKNK         KUNDNR
     C                   GOTO      BYTTAG
     C                   END
     C                   ELSE
     C     WSKNS         IFNE      *ZEROS
     C                   MOVE      WSKNS         KUNDNR
     C                   GOTO      BYTTAG
     C                   END
     C                   END
     C                   END
     C*
     C                   END
     C*
     C                   END
     C                   END
     C                   END
     C*
     C* SLUTT MASKINELL BEREGNING
     C*
     C*
     C* SLETTER VARELINJER FOR VALUTATILLEGG
     C* (SOM IKKE ER FAKTURERT)
      * (men IKKE dersom hovedfrakten ER fakturert - da kan det være kredit el/ektradebet)
     c                   move      ' '           HoFRAstat         1
     c                   move      *zeros        fr12no           13 2
     c                   move      *zeros        fr12va           13 2
     C     WSVALT        IFNE      *BLANKS
     C                   SETOFF                                       33
     C     HEADFK        SETLL     FAKT
     C     *IN33         DOWEQ     '0'
     C     HEADFK        READE     FAKT                                   33
      *
     c     *in(33)       ifeq      '0'
     C     KODGEA        CHAIN     KOGER                              36
     C  N36KGETYP        ifeq      'FR1'
     c     KGETYP        oreq      'FR2'
     c     KGETYP        oreq      'FRA'
     C     FALI          IFNE      0
     C     FAVK          andne     WSVALT
     C     FAOPKO        andne     'O'
     C     FASK          ANDNE     'I'
     C     FAKDA         ANDNE     'K'
     c                   add       fabeln        fr12no
     c                   add       fabelv        fr12va
     c                   end
     c                   end
     c     FALI          ifeq      0
     c                   move      FAOPKO        HoFRAstat         1
     c                   endif
     C     FAVK          IFEQ      WSVALT
     C     FAFAKT        IFEQ      *ZEROS
     C     HoFRAstat     andle     'C'
     c                   Move      FAOPKO        XVOPKO            1
     C                   DELETE    FAKTR
     C                   END
     C                   END
     C                   END
     C                   END
     C                   END
     C*
     C     XXFAKE        CHAIN     FAKT                               33
      * Ytterliger sikre mot endring av fakturert (fra annen sesjon?)
     C  N33FAOPKO        COMP      ' '                                3636
     C  N33
     CAN 36FAOPKO        COMP      'C'                                3636
     C  N33
     CAN 36              UPDATE    FAKTR
     C  N33
     CAN 36              GOTO      UTOPDF
     C* HVIS EN HAR SATT "N"=NEI I FRAKT (OVERSTYRE MASKINELL BEREGN.)
     C* SLETT EVT. EKSISTERENDE FAKTURALINJE
     C*
     C     WSFRAK        IFEQ      'N'
     C  N33              DELETE    FAKTR
     C  N33              Z-ADD     FAJOUR        KTNR
     C  N33KTNR          CHAIN     KOSBU                              34
     C  N34BUST          IFNE      'F'
     C  N33
     CANN34              DELETE    KOSBUR
     C                   END
     C                   MOVE      *ZEROS        WSFRAB
     C                   GOTO      UTOPDF
     C                   END
      *
     C* KLARGJØR  FELT FOR UPDATE/CHANGE AV FRAKTLINA (NR 00000)
     C                   Z-ADD     0             FALI
     C                   MOVE      WSAVD         FAAVD
     C                   MOVE      WSOPD         FAOPD
     C                   Z-ADD     WSFRAB        FABELV
     C                   MOVE      'FRA'         FAVK
     C                   MOVE      WSVALS        FAVAL
     C                   MOVE      WSKDFF        FASK
     C                   MOVE      WSMVA         FAKDM
     C                   MOVE      'M'           FAKDA
      * setter eventuellt A B i fakda
     c     xkda          ifne      *blanks
     c                   move      xkda          fakda
     c                   end
     C*
     C     WSFRAK        IFEQ      'E'
     C                   MOVE      'E'           FASK
     C                   END
     C*
     C     WSFRAK        IFNE      'M'
     C     FAVAL         IFEQ      FICURR
     C     WSFRAV        ANDEQ     FICURR
     C                   Z-ADD     WSFRAB        FABELN
     C                   ELSE
     C                   EXSR      TESTVA
     C                   END
     C*
     C                   ELSE
     C* BEREGNET FRAKT
     C     FAVAL         IFEQ      FICURR
     C     FAVAL         ANDEQ     WSFRAV
     C                   Z-ADD     FABELV        FABELN
     C                   ELSE
     C                   EXSR      TESTVA
     C                   END
     C                   END
     C     TRSLAG        IFEQ      'HO'
     C                   MOVE      *ZEROS        FAAVDR
     C                   ELSE
     C                   MOVE      'I'           FASK
     C                   Z-ADD     TRAVD0        FAAVDR
     C                   END
     C  N42              MOVE      *ZEROS        FAAGRN
     C   42              Z-ADD     UAVNR         FAAGRN
      * INITIERING AV UBRUKTE FELTER KUN VED NY - MERKET E55
      * BETINGER MED 33 - MERKET KUN MED E55
     C   33              MOVE      *ZEROS        FAEXRA
     C   33              MOVE      *ZEROS        FATAXA
     C   33              MOVE      *ZEROS        FAAMOU
     C   33              MOVE      *BLANKS       FAMADE
     C     WSVALS        IFEQ      FICURR
     C                   MOVE      *BLANKS       FACURI
     C                   ELSE
     C                   MOVE      WSVALS        FACURI
     C                   END
     C   33              MOVE      *BLANKS       FAVT
     C   33              MOVE      *BLANKS       FACD11
     C   33              MOVE      *BLANKS       FACD12
     C   33              MOVE      *BLANKS       FACD13
     C   33              MOVE      *BLANKS       FACD21
     C   33              MOVE      *BLANKS       FACD22
     C   33              MOVE      *BLANKS       FACD23
     C   33              MOVE      *BLANKS       FACD31
     C   33              MOVE      *BLANKS       FACD32
     C   33              MOVE      *BLANKS       FACU33
     C     WSFRAV        IFNE      FAVAL
     C                   MOVE      FAVAL         FACU33
     C                   MOVE      WSFRAV        FAVAL
     C                   END
     C  N33              EXSR      DECI
     C  N33              MOVE      FRABET        FAKUNR
     C                   MOVE      FAKUNR        PKKNR
     C     PRIKKEY       CHAIN     PRIK                               34
     C  N34              MOVE      PKSAMM        FACD11
      *
      * beregner automatisk bedsjett
      *
     C     KODGE2K       CHAIN     KOG2R                              34
     C     KG2XXX        IFEQ      'A'
     C                   EXSR      ABUD
     C                   END
     C  N33              UPDATE    FAKTR
     C* NY LINJE LEGGES SELV OM BELØP = 0 (FOR Å FÅ SAMM.KODE)
     C   33              EXSR      DECI
     C   33              MOVE      FRABET        FAKUNR
     C   33              MOVE      ' '           FAOPKO
     C   33              EXCEPT    NYFAKU
     C   33              MOVE      *ZEROS        FAJOUR
     C   33              MOVE      *ZEROS        KTNR
     C*
     C* VAREKODE TILLEGG
     C*
     C     WSVALT        IFNE      *BLANKS
     C     FABELV        ANDNE     *ZEROS
     C     wsvalp        andne     *zeros
     C                   EXSR      VALTIL
     C                   END
     C*
     C*
     C     UTOPDF        ENDSR
     C******************************************
     C     BERFRP        BEGSR
     C******************************************
     C* POSTNUMMERBASERT KALKULASJON
      * Finn frakt i kundersfraktavtale
     C                   MOVE      *BLANKS       UUVAL             3
     C                   MOVE      'FRA'         UGEB              3
     C                   MOVE      'FRA'         UGEBKO            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C* LEGGER INN DUMMY "S" FOR PART (ULIK A=OPPDATER FR.BER.VEKT)
     C                   MOVE      'S'           USKA              1
     C                   CALL      'SYGE04'
     C                   PARM                    UGEBKO
     C                   PARM                    UGEB
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    KUAVTA
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    UAVNR             9 0
     C                   PARM                    UAVMSG           50
     C                   PARM                    USKA
     C                   MOVE      'A'           XKDA
     C     UAVMSG        IFNE      *BLANKS
     C     UUBELØ        ANDNE     *ZEROS
     C                   MOVEL     UAVMSG        WSMSG
     C                   SETON                                        27
     C  N92              MOVEL     UAVMSG        WSADSF
     C  N92              SETON                                        92
     C                   END
      *
     C     UUBELØ        IFEQ      0
     C                   MOVE      'B'           XKDA              1
     C                   MOVE      *BLANKS       USONE
     C                   MOVE      *BLANKS       UUVAL
     C                   MOVE      *ZEROS        URABAT
     C                   CALL      'SYGE03'
     C                   PARM                    UGEB
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    UUVAL
     C                   PARM                    UUBELØ
     C                   PARM                    USONE             5
     C                   PARM                    URABAT            5 2
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    KUAVTA
     C                   PARM                    UAVNR             9 0
     c                   parm                    atdum             1
     C     URABAT        IFNE      *ZEROS
     C                   MOVE      'A'           XKDA
     C                   END
     C                   END
     C                   Z-ADD     UUBELØ        WSFRAB
     C                   Z-ADD     UUBELØ        PARBEL
      *
     C     INNLAN        IFEQ      'J'
      * % PÅSLAG FRA FIRMAFIL - kan være overstyr (saka ikke ha..) på kunde.
     C                   Move      IFFARP        XXFARP            4 3
     C                   Move      IFVARP        XXVARP            4 3
     C                   Move      IFLENP        XXLENP            4 3
     C                   clear                   cutranr
     C     KUAVTA        Chain     CUTRAN                             33
     C     *in33         Ifeq      *OFF
     C     CTIKFA        Ifeq      'X'
     C                   Move      *ZEROS        XXFARP
     C                   end
     C     CTIKVA        Ifeq      'X'
     C                   Move      *ZEROS        XXVARP
     C                   end
     C     CTIKLG        Ifeq      'X'
     C                   Move      *ZEROS        XXLENP
     C                   else
     C     CTAVLP        Ifne      *zeros
     C                   Move      CTAVLP        XXLENP
     C                   end
     C                   end
     C                   end
     C     UUBELØ        IFNE      *ZEROS
     C     WSVARM        IFNE      *BLANKS
     C     XXVARP        ANDNE     *ZEROS
     C     UUBELØ        MULT(H)   XXVARP        XXTILL            7 0
     C                   ADD       XXTILL        WSFRAB
     C                   ADD       XXTILL        PARBEL
     C                   END
     C     WSFARL        IFNE      *BLANKS
     C     XXFARP        ANDNE     *ZEROS
     C     UUBELØ        MULT(H)   XXFARP        XXTILL            7 0
     C                   ADD       XXTILL        WSFRAB
     C                   ADD       XXTILL        PARBEL
     C                   END
     C     WSLENG        IFNE      *BLANKS
     C     XXLENP        ANDNE     *ZEROS
     C     UUBELØ        MULT(H)   XXLENP        XXTILL            7 0
     C                   ADD       XXTILL        WSFRAB
     C                   ADD       XXTILL        PARBEL
     C                   END
     C                   END
      * Minstefrakt på hoved-oppdrag / normalfrak
      * egne felt for fjerntrafikk  (men ved fjern så dyttes det inn i eksisterend kundefelt..)
     c     IFFJKO        ifne      ' '
     c                   movel     USONE         TstFjK            1
     c     TstFjK        ifeq      IFFJKO
     C                   move      CTAFMF        CTAVFM                         Kunde avv min fjern
     C                   move      CTIFMF        CTIKFM                         Kunde ikke min fjern
     C     CTAVFM        IFEQ      *ZEROS
     C                   z-add     IFMIFF        CTAVFM                         Firma Minste fjern..
     C                   END
     C                   END
     C                   END
     C     CTAVFM        IFEQ      *ZEROS
     C                   z-add     IFMIFR        CTAVFM
     C                   END
     C     TRSLAG        IFEQ      'HO'
     C     WSKDPL        andeq     ' '
     C     CTAVFM        andne     *zeros
     C     CTIKFM        andne     'X'
     C     wsfrab        andgt     *zeros
     C     wsfrab        andlt     CTAVFM
     C                   z-add     CTAVFM        WSFRAB
     C                   z-add     CTAVFM        PARBEL
     C                   END
     C                   END
     C                   ENDSR
     C*
     C***********************************************
     C     TESTVA        BEGSR
     C***********************************************
     C     VALKFA        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WSFRAV
     C*
     C     VALKFA        CHAIN     VALUL01                            95
     C  N95              DO
     C     FABELV        MULT      VALKU1        XWORK            15 4
     C     XWORK         DIV(H)    OMRFAK        FABELN
     C*
     C* OMREGNER TIL FAKTURAVALUTA HVIS FORSKJELLIG FRA WSVALS
     C     WSVALS        IFNE      FICURR
     C     WSFRAV        IFNE      WSVALS
     C                   MOVE      WSVALS        WSFRAV
     C*
     C     VALKFA        CHAIN     VALUL01                            95
     C  N95              DO
     C     FABELN        DIV       VALKU1        XWORK            15 4
     C     XWORK         MULT(H)   OMRFAK        FABELV
     C                   Z-ADD     FABELV        WSFRAB
     C*
     C                   END
     C                   END
     C                   END
     C                   END
     C                   SETOFF                                       95
     C                   ENDSR
     C*
     C***********************************************
     C     VALTIL        BEGSR
     C***********************************************
     C                   move      *zeros        fajour
     C                   MOVE      *ZEROS        FABELU
     C                   MOVE      *BLANKS       FACU33
     C                   MOVE      *BLANKS       FAKDUK
     c                   move      *blanks       favt
     C     FABELV        MULT(H)   WSVALP        FABELV
     C     FABELN        MULT(H)   WSVALP        FABELN
     C                   DIV       100           FABELV
     C                   DIV       100           FABELN
     C                   MOVE      WSVALT        FAVK
     C                   EXSR      DECI
     C                   CALL      'SYGE06'
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    FALI
     C                   MOVE      FRABET        FAKUNR
     C                   MOVE      XVOPKO        FAOPKO
     C                   EXSR      ABUD
     C                   EXCEPT    NYFAKU
     C   33              MOVE      *ZEROS        FAJOUR
     C   33              MOVE      *ZEROS        KTNR
     C                   ENDSR
     C*
     C***********************************************
     C     DECI          BEGSR
     C***********************************************
     C* TEST FIRMS NUMBER OF DECIMALS
     C*
     C* NO DECIMALS
     C     FIDECI        IFEQ      0
     C                   Z-ADD(H)  FABELN        FABEL0           11 0
     C                   Z-ADD     FABEL0        FABELN
     C                   Z-ADD(H)  FABELU        FABEL0           11 0
     C                   Z-ADD     FABEL0        FABELU
     C                   ELSE
     C* 1 DECIMAL
     C     FIDECI        IFEQ      1
     C                   Z-ADD(H)  FABELN        FABEL1           12 1
     C                   Z-ADD     FABEL1        FABELN
     C                   Z-ADD(H)  FABELU        FABEL1           12 1
     C                   Z-ADD     FABEL1        FABELU
     C                   END
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     TTSR          BEGSR
     C***********************************************
     C                   OPEN      TRACKF
      * OPPDRAG OPPRETTET (POST I FIL TRACKF)
     C                   MOVE      HEAVD         TTAVD
     C                   MOVE      HEOPD         TTOPD
     C                   TIME                    XULTID
     C                   MOVE      XULDD         ULDD
     C                   MOVE      XULMM         ULMM
     C                   MOVE      XULÅÅ         ULÅÅ
     C                   MOVE      'STR'         TTACTI
     C                   MOVE      ULDT          TTDATE
     C                   MOVE      XULTM         TTTIME
     C                   MOVE      TTDATE        TTDATL
     C                   MOVE      TTTIME        TTTIML
     C                   MOVE      ZUSER         TTUSER
     C                   MOVEL     'Order en'    XXTEXT           16
     C                   MOVE      'tered   '    XXTEXT
     C                   MOVEL     XXTEXT        TTTEXT
     c                   eval      tttexl='ordre opprettet'
     C                   WRITE     TRACKFR
     C                   CLOSE     TRACKF
     C                   ENDSR
     C***********************************************
     C     SRBRU         BEGSR
     C***********************************************
      *
      *  HENTER BRUTTOPRIS
      *
     C                   MOVE      *ZEROS        WSBRUT
     C                   MOVE      *ZEROS        BRRAB
     C                   MOVE      *BLANKS       BRVAL             3
     C                   MOVE      'FRA'         BRGEB             3
     C                   MOVE      *ZEROS        BRBELØ           13 2
     C                   MOVE      *ZEROS        BRKUND            8 0
     C                   MOVE      *BLANKS       BRSONE
     C                   CALL      'SYGE03'
     C                   PARM                    BRGEB
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    BRVAL
     C                   PARM                    BRBELØ
     C                   PARM                    BRSONE            5
     C                   PARM                    BRRAB             5 2
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    N5                5 0
     C                   PARM                    BRKUND
     C                   PARM                    UAVNR             9 0
     c                   parm                    atdum             1
     C                   Z-ADD     BRBELØ        WSBRUT
     C                   ENDSR
     C***********************************************
     C     MERKPI        BEGSR
     C***********************************************
     C     KPIKEY        SETLL     FREETXT
     C     KPIKEY        READE     FREETXT                                33
     C     *IN33         DOWEQ     '0'
     C                   MOVE      HEAVD         FRTAVD
     C                   MOVE      HEOPD         FRTOPD
     C                   WRITE     FREETX2R
     C     KPIKEY        READE     FREETXT                                33
     C  N33              ENDDO
      *
     C     HEPK7         IFEQ      'C'
     C     KPIKEY        CHAIN     DOKEC                              33
     C                   MOVE      HEAVD         DCAVD
     C                   MOVE      HEOPD         DCOPD
     C                   WRITE     DOKECR
     C                   ENDIF
      *
     C                   ENDSR
      *
     C***********************************************
     C     KUBIKK        BEGSR
     C***********************************************
     C                   MOVE      'J'           XFLYTM
     c     WSOPD         ifne      *zeros
     C                   MOVE      'O'           XFLYTM
     C                   clear                   HØ
     C                   clear                   LE
     C                   clear                   BR
     C                   clear                   AN
     c                   z-add     wsavd         UUavd
     c                   z-add     wsopd         UUopd
     c                   end
     C* SUBROUTINE FOR CUBIKK
     C                   CALL      'SYIN10B'
     C                   PARM                    UUavd             4 0
     C                   PARM                    UUopd             7 0
     C                   PARM                    UUfbn             3 0
     C                   PARM                    XFLYTM            1
     C                   PARM                    UM3               7 3
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C     UM3           IFNE      *ZEROS
     C                   Z-ADD     UM3           WSM3
     C                   END
     C*
     C                   ENDSR
      **************************************************************************
     c     srfali        begsr
      **************************************************************************
     C                   move      'N'           slettf            1
     c                   move      'N'           slett             1
     C                   SETOFF                                       34
     C     HEADFK        SETLL     FAKT
      *
      * start leseløkke
      *
     C     *IN34         DOWEQ     '0'
     C     HEADFK        READE     FAKT                                   34
      *
      * IKKE FAKTURERT og linje 0 blir tatt hånd om annet sted
      *
     C  N34FAFAKT        ifeq      *ZEROS
     c     faopko        andle     'C'
     c     fali          andne     0
      *
      * KUN S OG K LINJER
      *
     C     FASK          IFEQ      'S'
     C     FASK          OREQ      'K'
     C                   MOVE      FACURI        FACURG            3
     C                   move      fakunr        fakung            8 0
      *
      * RETTER S/K LINJER m.h.t. PART KUNDENUMMER OG VALUTAKODE
      *
      *------------------------------------------
      * WSKNKF = 0 FIKS WSKNSF TIL RIKTIG SIDE
      * FAKTURERING KUN MOT 1 SIDE
      *------------------------------------------
     C     WSKNKF        IFEQ      0
     C                   MOVE      WSKDFF        FASK
     C                   MOVE      FRABET        FAKUNR
     C     WSVALS        IFEQ      FICURR
     C                   MOVE      *BLANKS       FACURI
     C                   MOVE      FICURR        FAVAL
     C                   ELSE
     C                   MOVE      WSVALS        FACURI
     C                   MOVE      WSVALS        FAVAL
     C                   END
     C                   ELSE
      *------------------------------------------
      * WSKNKF <> 0 FIKS WSKNSF TIL RIKTIG SIDE
      * FAKTURERING MOT TO PARTER
      *------------------------------------------
      *
     C     WSKDFF        IFEQ      FASK
     C     WSVALS        IFEQ      FICURR
     C                   MOVE      FRABET        FAKUNR
     C                   MOVE      *BLANKS       FACURI
     C                   MOVE      FICURR        FAVAL
     C                   ELSE
     C                   MOVE      WSVALS        FACURI
     C                   MOVE      WSVALS        FAVAL
     C                   END
     C                   ELSE
     C                   MOVE      WSKNKF        FAKUNR
     C     WSVALK        IFEQ      FICURR
     C                   MOVE      *BLANKS       FACURI
     C                   MOVE      FICURR        FAVAL
     C                   ELSE
     C                   MOVE      WSVALK        FACURI
     C                   MOVE      WSVALK        FAVAL
     C                   END
     C     WSVALK        IFEQ      FICURR
     C                   MOVE      *BLANKS       FACURI
     C                   MOVE      FICURR        FAVAL
     C                   ELSE
     C                   MOVE      WSVALK        FACURI
     C                   MOVE      WSVALK        FAVAL
     C                   END
     C                   END
     C                   END
     C*                  END
     C*
     C* TESTER VALUTAKODE/BELØP VAREVERDI
      *
      * valutakode endret
      *
     c     facuri        ifne      facurg
     C     FACURI        IFEQ      *blanks
     C                   Z-add     FABELN        FABELV
     C                   else
     C     valke4        chain     valul01                            49
     C     *IN49         IFEQ      '0'
     C     FABELN        MULT      OMRFAK        XWORK            15 4
     C     XWORK         DIV(H)    VALKU1        FABELV
     C                   end
     C                   end
     C                   end
     c     facuri        ifne      facurg
     c     fakunr        orne      fakung
     c                   move      'J'           slett             1
     c*                  end
     C                   UPDATE    FAKTR
     c                   end
     C                   end
     C                   end
     C                   END
      *
      * SLUTT PÅ LESELØKKEN
      *
      *
      * sletter eventuell ferdigmeldte samlefaktura
      * hvis valta eller kunde er edret
     C     TRKDFF        ifne      WSKDFF
     c     WSKNKF        orne      wsknkfg
     c     wsknsf        orne      wsknsfg
     c     slett         oreq      'J'
     c                   setoff                                       34
     c     HEADFK        setll     saml1
     c     *in(34)       doweq     '0'
     C     HEADFK        reade     saml1                                  34
     c     *in(34)       ifeq      '0'
     c                   delete    samlr
     c                   move      'J'           slettf
     c                   end
     c                   end
      *
      * sletter eventuell ferdigmeldt til faktura
      *
     c                   setoff                                       34
     c     HEADFK        setll     ferdl01
     c     *in(34)       doweq     '0'
     C     HEADFK        reade     ferdl01                                34
     c     *in(34)       ifeq      '0'
     c                   delete    ferdr
     c                   move      'J'           slettf
     c                   end
     c                   end
     c     slettf        ifeq      'J'
     c                   exfmt     SLETFERD
     c                   end
     c                   end
     c                   endsr
      **********************************************************
     C     endvalt       begsr
      **********************************************************
      *
      * HENTER INFO OM FRAKTTILLEGG PÅ NY
     C                   MOVE      'H'           UUR
     C                   MOVE      *ZEROS        UVALP
     C                   CALL      'SYFA24B'
     C                   PARM                    UUR               1
     C                   PARM      WSAVD         UAVDOP            4 0
     C                   PARM      FRABET        UKNOP             8 0
     C                   PARM                    WSVALT
     C                   PARM                    UVALP             3 1
     C                   MOVE      UVALP         WSVALP
     C                   move      FRABET        prevalt           8 0
     C                   ENDSR
     C***********************************************
     C     EFRABR        BEGSR
     C***********************************************
     C*
      * Gir local data area navnet LDADS internt i programmet.
      * Dette for å få oppdatert LDA etter å ha hentet routing
     C     *DTAARA       DEFINE    *LDA          LDADS
     C                   MOVEL     *BLANKS       DSTINF
     C                   OUT       LDADS
     C                   MOVE      'N'           XANRUT            1
     C                   MOVE      'N'           XFLYTM            1
     C                   Z-ADD     0             UFLAGG
     C                   Z-add     1             uulope            3 0
     C     WSPK8         IFEQ      'J'
     C                   CALL      'SYEF10B'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    uulope
     C                   PARM                    XSTLF            15
     C                   PARM                    XKTLF            15
     C                   PARM                    XANRUT            1
     C                   PARM                    XFLYTM            1
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C*
     C                   ELSE
     C                   CALL      'SYEF10C'
     C                   PARM                    FIFIRM
     C                   PARM                    WSAVD
     C                   PARM                    WSOPD
     C                   PARM                    uulope
     C                   PARM                    XSTLF            15
     C                   PARM                    XKTLF            15
     C                   PARM                    XANRUT            1
     C                   PARM                    XFLYTM            1
     C                   PARM                    HØ
     C                   PARM                    LE
     C                   PARM                    BR
     C                   PARM                    AN
     C                   PARM                    WSMSG
     C     UFLAGG        PARM      UFLAGG        UFLAGG
     C                   END
     C*
     C     UFLAGG        COMP      3                                      03
     C     UFLAGG        COMP      5                                      05
     C     UFLAGG        COMP      1                                      12
     C*
     C                   ENDSR
     C*
      ***********************************************
     C     PRTSKILL      BEGSR
      ***********************************************
     C
     C                   MOVE      '  '          SCATYP            2
     C                   MOVEL     WSAVD         SCASTR11         11
     C                   MOVE      WSOPD         SCASTR11         11
     C                   MOVEL     SCASTR11      SCASTR           20
     C                   CALL      'ARCA000CL'
     C                   PARM                    SCATYP
     C                   PARM                    SCASTR
     C                   ENDSR
      ***********************************************
     C     ABUD          BEGSR
      ***********************************************
     C     PRIKK         KLIST
     C                   KFLD                    KUNDALF           8
     C                   KFLD                    XAVTN             1
     C                   KFLD                    FAVK
     C                   MOVE      '0'           XAVTN             1
     C     hepro         ifne      0
     C     HEPRO         CHAIN     TURER14                            34
     C  N34              MOVE      TUKNT2        TRANUM
     C  N34TRAKEY        CHAIN     TRAN                               34
     C  N34              Z-ADD     VMTRLE        FALEVN
     C  N34LEVE1K        CHAIN     LEVEL01                            34
     C                   MOVE      KUNDNR        KUNDALF
     c     *IN34         ifeq      '0'
     C     PRIKK         CHAIN     PRIK                               34
     C                   MOVE      KUNDNR        KUNDGM            8 0
     c                   move      heavd         uavda             4
     c                   move      heopd         uopda             7
     c                   move      kundnr        uknrA             8
     C                   MOVE      *BLANKS       UVAL              3
     C                   MOVE      'FRA'         UGEB              3
     C                   MOVE      'FRA'         UGEBTY            3
     C                   MOVE      *ZEROS        UUBELØ           13 2
     C                   MOVE      KUNDNR        UUKN              8 0
     C                   MOVE      FASK          USKA              1
     C                   CALL      'SYGE14A'
     C                   PARM                    UAVDA
     C                   PARM                    UOPDA
     C                   PARM                    UKNRA
     C                   parm                    uska
     C                   PARM                    UGEB
     C                   PARM                    UGEBTY
     C                   PARM                    UVAL
     C                   PARM                    UUBELØ
     C                   MOVE      KUNDGM        KUNDNR            8 0
     C     UUBELØ        IFNE      0
     C     PKBELØ        IFNE      0
     c  N34              mult      pkbeLØ        uubelØ
     c  N34              div       100           uubelØ
     C                   END
     C                   Z-add     UUBELØ        FABELU
     C                   MOVE      UVAL          FACU33
     C                   MOVE      'A'           FAKDUK
     C                   EXSR      KOSTAU
     C                   end
     C                   end
     C                   END
     C                   ENDSR
      ***********************************************
     C     KOSTAU        BEGSR
      ***********************************************
      *  Automatisk budsjettering
      *  BRUKER FAJOUR - TIL Å LAGRE X-REF TIL KOSBU
      *  FAJOUR ER "LEDIG" HELT TIL OVERFØRING TIL REGNSKAP.
      *
     C                   Z-ADD     FAJOUR        KTNR
      * TILDELER REFNUMMER
      *
     C     KTNR          CHAIN(N)  KOSBU                              34
     C  N34BUST          IFNE      'F'
     C   34              MOVE      *ZEROS        FAJOUR
     C     FAJOUR        IFEQ      *ZEROS
     C     'Å'           CHAIN     KOSTT                              34
     C   34              MOVE      'Å'           KTTYP
     C   34              Z-ADD     1000000       KTNR
     C   34              WRITE     KOSTTR
     C  N34              ADD       1             KTNR
     C  N34              UPDATE    KOSTTR
     C                   END
      *
     C     KTNR          CHAIN     KOSBU                              34
     C   34              MOVE      ' '           BUST
     C   34              MOVE      *ZEROS        BUBNR2
     C* IKKE OPPDATER HVIS FØRT/PLUKKET TIL KOSTN.BILAG..
     C     BUST          IFEQ      ' '
     C     BUBNR2        ANDEQ     *ZEROS
     C                   MOVE      KTNR          BUBNR
     C                   MOVEL     HEDTÅ         BUPCC
     C                   MOVE      HEDTÅ         BUPÅR
     C                   MOVE      HEDTM         BUPMN
     C                   MOVE      *ZEROS        BUTNR
     C                   MOVE      FALEVN        BULNR
     C                   MOVE      FACU33        BUVAL
     C     BUVAL         IFEQ      '   '
     C                   MOVE      FICURR        BUVAL
     C                   END
     C                   Z-ADD     FABELU        BUBL
     C                   MOVE      FAVK          BUVK
     C                   MOVE      HESG          BUSG
      * Sikre riktig BUTAVD (kan være ulik HEAVD hvis samlast)
     C                   MOVE      *ZEROS        TUAVD
     C                   MOVE      *ZEROS        TUPRO
     C     HEPRO         IFNE      *ZEROS
     C     HEPRO         CHAIN     TURER14                            31
     C                   MOVE      TUAVD         BUTAVD
     C                   MOVE      TUPRO         BUTUNR
     C                   END
     C                   MOVE      HEAVD         BUOAVD
     C                   MOVE      HEOPD         BUOPD
     C* + VISSE FELTER "INITIERES" KUN VED NY (BETING  34 LAGT PÅ)
     C   33              MOVE      'E'           BUBLST
     C   33              MOVE      'E'           BUTYPE
     C   33              MOVE      *BLANKS       BUTXT
     C   33              MOVE      *BLANKS       BUBILK                         *BILKODE
     C   33              MOVE      *BLANKS       BUBILN                         *BILNUMMER
     C   33              MOVE      *ZEROS        BUFEDT                         *FERJ/TURDTO
     C   33              MOVE      'O'           BUFER                          *O = OPPDRAG
     C   33              MOVE      *ZEROS        BUBNR2                         *FØRT BNR
     C   33              MOVE      *ZEROS        BUBNR3                         *"SLAVE" AV.
     C   33              MOVE      *ZEROS        BULNR3                         SLAVE-LØPENR
     C   33              MOVE      *ZEROS        BUBLFD                         *FORDELT BEL
     C                   END
     C   34              WRITE     KOSBUR
     C  N34              UPDATE    KOSBUR
     C                   MOVE      KTNR          FAJOUR
     C                   END
     C                   ENDSR
     C***********************************************
     C     DOKUFVSR      BEGSR
     C***********************************************
      * HENTER VERDIER FRA MOROPPDRAG
     C     DOKUFVKG      CHAIN(N)  DOKUFV                             31
     C     *IN31         IFEQ      '0'
     C                   MOVE      HEAVD         FVAVD
     C                   MOVE      HEOPD         FVOPD
      * SER OM DENNE LINJE ER PÅ DUPP
     C     DOKUFVKN      CHAIN(N)  DOKUFV                             31
     C   31              WRITE     DOKUFVR
     C                   END
     C                   ENDSR
     C***********************************************
     C     SNUREGD       BEGSR
     C***********************************************
      * snu registreringsdato
     C                   MOVE      HEDTRD        UDT1              2 0
     C                   MOVE      HEDTRM        UDT2              2 0
     C                   MOVE      HEDTRÅ        UDT3              2 0
     C                   MOVE      UDT1          WSDTRD
     C                   MOVE      UDT2          WSDTRM
     C                   MOVE      UDT3          WSDTRÅ
     C                   ENDSR
     C*
     OFAKTR     EADD         NYFAKU
     O                       FA01
     O                       FALI
     O                       FAAVD
     O                       FAOPD
     O                       FASK
     O                       FAVK
     O                       FAVT
     O                       FAVAL
     O                       FABELV
     O                       FAKDM
     O                       FABELN
     O                       FAKDA
     O                       FAAVDR
     O                       FAKUNR
     O                       FACURI
     O                       FAOPKO
     O                       FACD11
     O                       FABELU
     O                       FAJOUR
     O                       FACU33
     O                       FAKDUK
