KINGS * *******************************************************
KINGS * PROG FOR Å ENDRE PRISER PÅ FERJE NÅR DER ER KOSTN.FØRT
KINGS * *******************************************************
     FTURER14   IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UUPRO             8 0
     C                   Z-ADD     UUPRO         TUPRO
      *
     C     TUPRO         CHAIN     TURER14                            33
     C  N33              DO
     C                   MOVE      TUAVD         XXAVD             4 0
     C                   MOVE      TUPRO         XXTUNR            8 0
     C                   MOVE      TURUND        XXRUND            8 0
     C                   MOVE      'X'           XXKOST            1
     C* GÅ I MODUL FOR FERGEOVERSIKT / PLUKK
     C     XXAVD         IFNE      *ZEROS
     C                   CALL      'SYTR17'
     C                   PARM                    XXAVD
     C                   PARM                    XXTUNR
     C                   PARM                    XXRUND
     C                   PARM                    XXKOST
     C                   ELSE
     C                   CALL      'SYTR17A'
     C                   PARM                    XXAVD
     C                   PARM                    XXTUNR
     C                   PARM                    XXRUND
     C                   PARM                    XXKOST
     C                   END
     C                   END
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
