      ************************************************************
      *** UTSKRIFT AV TURKONVOLUTT                             ***
      ************************************************************
     FFIRM      IF   E           K DISK
     FKODTV     IF   E           K DISK
     FKODTSF    IF   E           K DISK
     FSYTR51FA  CF   E             WORKSTN
     C*
     C     KODSFK        KLIST
     C                   KFLD                    WSSFUN
     C                   KFLD                    WSSFSI
     C     KODTVK        KLIST
     C                   KFLD                    WSVUNI
     C                   KFLD                    WSVAVD
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UIN01             1
     C                   PARM                    UUVAVD            4            *ALPHA
     C                   PARM                    WSSFSI
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD
     C*
     C                   MOVE      '0'           UIN01
     C                   MOVE      'SF'          WSSFUN            2
     C                   MOVE      'V'           WSVUNI            1
     C                   MOVE      'Y'           WSJOBQ
     C*
     C     UUVAVD        IFGT      '0000'
     C     UUVAVD        ANDLE     '9999'
     C                   MOVE      UUVAVD        WSVAVD                         *NUMERIC
     C                   GOTO      START2
     C                   ELSE
     C                   MOVE      *ZEROS        WSVAVD
     C                   SETON                                        50        IKKE VIS NEDRE DEL.
     C                   END
     C*
     C*
     C     START         TAG
     C                   EXFMT     BILDE01
     C     START2        TAG
     C                   SETOFF                                       309899
     C                   SETOFF                                       97
     C*
     C   03              MOVE      '1'           UIN01
     C   03              GOTO      SLUTT
     C   12              MOVE      '1'           UIN01
     C   12              GOTO      SLUTT
     C*
     C     KODTVK        CHAIN     KODTV                              99
     C   99              MOVE      'SPA0001'     MSGNR
     C   99              SETON                                        30
     C   99              GOTO      START
     C*
     C     KODSFK        CHAIN     KODTSF                             98
     C   98              MOVE      'SPS0001'     MSGNR
     C   98              SETON                                        30
     C   98              GOTO      START
     C*
     C*
     C                   READ      FIRM                                   98
     C     WSSFSI        IFEQ      '0  '
     C                   MOVE      *BLANKS       WSSFSI
     C                   END
     C*
     C* HENTER STANDARD PRINTERSTYRING
     C*
     C                   Z-ADD     52            PRTNR             3 0
     C                   CALL      'SYGE01'
     C                   PARM                    WSVAVD
     C                   PARM                    PRTNR
     C                   PARM                    WSPRT
     C                   PARM                    WSFORM
     C                   PARM                    WSHEAD            1
     C                   PARM                    WKOPFM            5
     C*
     C                   SETOFF                                       50         VIS NEDRE DEL
     C                   EXFMT     BILDE01
     C* NY AVD??
     C   12              DO
     C                   SETON                                        50
     C                   MOVE      *BLANKS       WSPRT
     C                   MOVE      *BLANKS       WSFORM
     C                   MOVE      *BLANKS       WSHEAD
     C                   GOTO      START
     C                   END
     C   03              MOVE      '1'           UIN01
     C*
     C     SLUTT         TAG
     C                   MOVE      WSVAVD        UUVAVD                          *ALPHA
     C                   SETON                                        LR
     C                   RETURN
     C*
