********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FILNAVN ER UTVIDERT FRA 70 TIL 120
********************************************************************
     FXMLULG    O  A E             DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    UMBR             10
S01  C*                  PARM                    UFIL             70
S01  C*                  PARM                    UDOK1            70
S01  C*                  PARM                    UDOK2            70
N01  C                   PARM                    UFIL            120
N01  C                   PARM                    UDOK1           120
N01  C                   PARM                    UDOK2           120
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      *
     C                   MOVE      WDT           XLGDT
     C                   MOVE      WTM           XLGTID
     C                   MOVE      UMBR          XLGMBR
     C                   MOVE      UFIL          XLGFIL
     C                   MOVE      UDOK1         XLGDK1
     C                   MOVE      UDOK2         XLGDK2
     C                   WRITE     XMLULGR
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
