      * VISER HVORDAN EN MED BRUK AV RPG free FÅR MER OVERSIKTLIG KODE
      * NÅR LANGE TEKSTSTRENGER SKAL BYGGES..
      * (CL KOPIERER SÅ INNHOLD TIL IFS-FIL  /SYSPEDDEV/TEMP/XMLTEST.XML FOR Å SE I IEXPLORE)
      *
      * OBS! BIBLIOTEK LIBHTTP INNEHOLDER MYE SNADDER  VEDR XML (INN)  MM . (Scott Klement )
      *
      *
     FHEADF     IF   E           K DISK
      * Fila QTEMP/Q vil vel være EDESE1K i en reell situasjon...
     FQ         O  A F 1024        DISK
      *
     D HAWB            s             20A
     D PINumber        s              5A
     D ProblemC        s             50A
     D Pieces          s              5i 0
     D ActionDa        s             19A
     D ProductG        s              3A
      *
     c                   move      *blanks       DATA           1024
      *  INIT
     c                   exsr      SeksjonINI
     C                   EXCEPT    QData
      *
      * STATUS
      * .. TEI
     c                   eval      HAWB     = '1033078185'
     c                   eval      PINumber = 'SH001'
     c                   eval      ProblemC = ' />'
     c                   eval      Pieces   = 1
     c                   eval      ActionDa = '2009-04-06T07:35:00'
     c                   eval      ProductG = 'EXP'
     c                   exsr      SeksjonXXX
     C                   EXCEPT    QData
      * .. TEU
     c                   eval      HAWB     = '1033078185'
     c                   eval      PINumber = 'SH003'
     c                   eval      ProblemC = ' />'
     c                   eval      Pieces   = 1
     c                   eval      ActionDa = '2009-04-06T09:15:00'
     c                   eval      ProductG = 'EXP'
     c                   exsr      SeksjonXXX
     C                   EXCEPT    QData
      * .. POD
     c                   eval      HAWB     = '1033078185'
     c                   eval      PINumber = 'SH005'
     c                   eval      ProblemC = ' />'
     c                   eval      Pieces   = 1
     c                   eval      ActionDa = '2009-04-06T11:46:00'
     c                   eval      ProductG = 'EXP'
     c                   exsr      SeksjonXXX
     C                   EXCEPT    QData
      *  AVSLUTT
     c                   exsr      SeksjonEND
     C                   EXCEPT    QData
     C*
     c                   seton                                        LR
     c                   return
      *

      ***********************************************
     C     SeksjonINI    BEGSR
      ***********************************************
      /free
       DATA =
        '<?xml version="1.0" ?>'
       +'<InfoLinkDocument>'
       +'<AccessRequest>'
       +'<DocumentType>3</DocumentType>'
       +'<Version>1.20</Version>'
       +'<EntityID>3621</EntityID>'
       +'<EntityPIN>OSL123</EntityPIN>'
       +'<TimeStamp>2009-04-08T11:13:42</TimeStamp>'
       +'<Reference1>HAWBs Updates</Reference1>'
       +'<ReplyEmailAddress>morten.holmen@leman.no</ReplyEmailAddress>'
       +'<NotifyOnSuccess>False</NotifyOnSuccess>'
       +'</AccessRequest>';
      /end-free

     C                   ENDSR


      ***********************************************
     C     SeksjonXXX    BEGSR
      ***********************************************
      /free
       DATA =
        '<HAWBUpdate>'
       +'<HAWBNumber>' + %trim(HAWB) + '</HAWBNumber>'
       +'<UpdateEntity>3621</UpdateEntity>'
       +'<PINumber>' + PINumber + '</PINumber>'
       +'<ProblemCode' + %trim(ProblemC)
       +'<Pieces>' +%trim(%editc(Pieces:'3'))+ '</Pieces>'
       +'<ActionDate>' + ActionDa + '</ActionDate>'
       +'<SourceID>2</SourceID>'
       +'<ProductGroup>' + ProductG + '</ProductGroup>'
       +'</HAWBUpdate>';
      /end-free

     C                   ENDSR


      ***********************************************
     C     SeksjonEND    BEGSR
      ***********************************************
      /free
       DATA =
        '</InfoLinkDocument>';

      /end-free

     C                   ENDSR
      *
     OQ         EADD         Qdata
     O                       DATA              1024
