      *
      ************************************************************
      *** PROGRAM SKAL BE BRUKER BESTEMMER OM UTSKRIFT SKAL    ***
      ***            OVERFØRES TIL TEKSTMAPPE                  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER     ***
      *** LEDIGE INDIKATORER 01 02 04-26                       ***
      *** LEDIGE INDIKATORER 27-98                             ***
      ************************************************************
      *
     FPRTDOCC   UF A E           K DISK
     FSYYA02FA  CF   E             WORKSTN
     C*
     C     *ENTRY        PLIST
     C                   PARM                    UNAME            10
     C                   PARM                    UDOCN             8
     C                   PARM                    USVAR             1
     C                   MOVE      'N'           USVAR
     C*
     C     START         TAG
     C                   EXFMT     BILDE
     C                   SETOFF                                       99
     C*
     C   03              GOTO      SLUTT
     C     WSSVAR        IFEQ      ' '
     C                   GOTO      START
     C                   END
     C*
     C                   MOVE      WSSVAR        USVAR
     C     WSSVAR        IFEQ      'J'
     C                   MOVE      'A'           PCUNI
     C     PCUNI         CHAIN     PRTDOCC                            99
     C     PCTELL        IFEQ      99999
     C                   Z-ADD     1             PCTELL
     C                   ELSE
     C                   ADD       1             PCTELL
     C                   END
     C   99              WRITE     PRTDOCCR
     C  N99              UPDATE    PRTDOCCR
     C                   MOVEL     'DOC'         UDOCN
     C                   MOVE      PCTELL        UDOCN
     C                   END
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
