     FTARI      UP   E             DISK
     FTARIGM    IF   E           K DISK
     F                                     RENAME(TARIR:XXXX)
     C     TATANR        CHAIN     TARIGM                             33
     C  N33TATXT         IFNE      *BLANKS
     C                   EXCEPT    UPD
     C                   END
     OTARIR     E            UPD
     O                       TATXT
     O                       TAALFA
