     FTARI      UP   E             DISK
     FTARIGM    IF   E           K DISK
     F                                     RENAME(TARIR:XXXX)
     C     TATANR        CHAIN     TARIGM                             33
     C     *IN33         IFEQ      '0'
     C     TATXT         ANDNE     *BLANKS
     C                   EXCEPT    UPD
     C                   END
     OTARIR     E            UPD
     O                       TATXT
     O                       TAALFA
