      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TDKG005R MODULE(*LIBL/TDKG005R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FDKTKD     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D WSONAVN         S             35
     D JSONstring      s          32000
     D Error           S            150
     D Wtyp            S              3
     D Wkode1          S             20
     D Wkode3          S              5
     D DKIH_25         S              1
     D DKIH_26         S              1
     D AntLest         S              9  0
     d pos             S              5U 0
     D ZB              S              1    DIM(20)

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬typ¬ : ¬'+%trim(WTYP)+'¬, '
        +'¬kode1¬ : ¬'+%trim(WKODE1)+'¬, '
        +'¬kode3¬ : ¬'+%trim(WKODE3)+'¬, '
        +'¬dkih_25¬ : ¬'+%trim(DKIH_25)+'¬, '
        +'¬dkih_26¬ : ¬'+%trim(DKIH_26)+'¬, '
        +'¬sonavn¬ : ¬'+%trim(WSONAVN)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"kodlista" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Hæmta varuslag
      *
     c     Error         ifeq      *blanks
     C     WTYP          SETLL     DKTKD
     C     WTYP          READE     DKTKD                                  55
     C                   ENDIF
     C     *IN55         DOWEQ     *OFF
     C     WKODE3        IFNE      *BLANKS
     C     DKKD_KD3      IFNE      WKODE3
     C     DKKD_KD3      IFNE      '0'
     C                   GOTO      NEXT
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C     WTYP          IFEQ      '017'
     C     DKIH_25       ANDNE     *BLANKS
     C     DKIH_25       ANDNE     '7'
     C     DKIH_25       ANDNE     '8'
     C     DKIH_25       ANDNE     '9'
     C     DKKD_KD3      ANDNE     '0'
     C     DKKD_KD3      ANDNE     DKIH_25
     C                   GOTO      NEXT
     C                   ENDIF
     C                   EVAL      POS=1
      /free
           if wkode1 <> *blanks;
             pos=0;
             pos = %scan (%trim(WKODE1) : DKKD_KD);
           endif;
      /end-free
     C     POS           IFEQ      *ZEROS
     C                   GOTO      NEXT
     C                   ENDIF
     C                   EVAL      POS=1
      /free
           if wsonavn <> *blanks;
             pos=0;
             pos = %scan (%trim(WSONAVN) : DKKD_TXT);
           endif;
      /end-free
     C     POS           IFEQ      *ZEROS
     C                   GOTO      NEXT
     C                   ENDIF
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬dkkd_kd¬ : ¬'+%trim(DKKD_KD)+'¬, '
          +'¬dkkd_kd2¬ : ¬'+%trim(DKKD_KD2)+'¬, '
          +'¬dkkd_kd3¬ : ¬'+%trim(DKKD_KD3)+'¬, '
          +'¬dkkf_txt¬ : ¬'+%trim(DKKD_TXT)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
     C     NEXT          TAG
     C     WTYP          READE     DKTKD                                  55
     C                   ENDDO
     C     UTLES         TAG
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     DKTKD

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      WTYP    = zhbgetvar('TYP')
     C                   EVAL      WKODE1  = zhbgetvar('KODE1')
     C                   EVAL      WKODE3  = zhbgetvar('KODE3')
     C                   EVAL      DKIH_25  = zhbgetvar('DKIH_25')
     C                   EVAL      DKIH_26  = zhbgetvar('DKIH_26')
     C                   EVAL      WSONAVN = zhbgetvar('SONAVN')
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end
      *
     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      DKTKD

     c                   endsr
      *
