      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVG016R MODULE(*LIBL/TSVG016R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FSVTLK     IF   E           K DISK    USROPN
     FSVTAR1    IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D WIE             S              1
     D WKOD            S             10
     D WLK             S              2
     D WXTRA           S              1
     D STOPP           S             10
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     D ZB              S              1    DIM(10)

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬ie¬ : ¬'+%trim(WIE)+'¬, '
        +'¬kod¬ : ¬'+%trim(WKOD)+'¬, '
        +'¬lk¬ : ¬'+%trim(WLK)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"xtramangdenhet" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Hæmta varukod/varukoder
      *
     C                   EXSR      XTRA
     c     Error         ifeq      *blanks

     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬xtra¬ : ¬'+%trim(WXTRA)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')


     C     UTLES         TAG
     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     SVTLK
     C  N50              CLOSE     SVTAR1

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      WIE = zhbgetvar('IE')
     C                   EVAL      WKOD = zhbgetvar('KOD')
     C                   EVAL      WLK = zhbgetvar('LK')
     c                   ENDSR
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C     SVTAKEY       KLIST
     C                   KFLD                    WIE
     C                   KFLD                    WKOD
     C                   KFLD                    WVTA_MTI
     C     SVTLKKEY      KLIST
     C                   KFLD                    WLK
     C                   KFLD                    SVTA_RG
     C     *LIKE         DEFINE    SVTA_MTI      WVTA_MTI
     C                   EVAL      WVTA_MTI='110'

     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      SVTLK
     C  N50              OPEN      SVTAR1

     C                   ENDSR
      *********************************************************
     C     XTRA          Begsr
      *********************************************************
     C                   EVAL      WXTRA='N'
     C     SVTAKEY       SETLL     SVTAR1
     C     SVTAKEY       READE     SVTAR1                                 55
     C     *IN55         DOWEQ     *OFF
      * Er landkoden riktig ?
     C     SVTA_RG       CABEQ     WLK           SRB1
      * Eller stæmmer regionen ?
     C     SVTLKKEY      CHAIN     SVTLK                              56
     C     *IN56         CABEQ     *OFF          SRB1
     C                   GOTO      SRB2
     C     SRB1          TAG
      * Har nå funnet x-mängdenhet
     C     SVTA_MUC      IFEQ      *BLANKS
     C                   EVAL      WXTRA='N'
     C                   ELSE
     C                   EVAL      WXTRA='Y'
     C                   ENDIF
     C                   EVAL      *IN55=*ON
     C     SRB2          TAG
     C     SVTAKEY       READE     SVTAR1                                 55
     C                   ENDDO
     C                   ENDSR
