     H DATEDIT(*YMD)
      ***********************************************************
      *** AGENT TO AGENT SENDING INFORMATION                  ***
      ***                                                     ***
      * Programmet forutsetter at hvis samlastnummer og sted er
      * utfylt i parameterlisten så skal det plukkes fra samlast
      * oversikten. Avd/opd utfylt --> direkte til sendingsbildet.
      ***********************************************************
      *
     FHEADF     IF   E           K DISK
     FHEAD19    IF   E           K DISK
     F                                     RENAME(HEADFR:HEADF7)
     FDOKEM     IF   E           K DISK
     FCUNDL01   IF   E           K DISK
     FFIRM      IF   E             DISK
     FSAMLB     IF   E           K DISK
     FPARL01    IF   E           K DISK
     FTDV20D    CF   E             WORKSTN
     F                                     SFILE(TDV20H50:ZRECNO)
     F                                     INFDS(FBAREA)
     FFRISOK    IF   E           K DISK
      ***********************************************************
     D FBAREA          DS
     D  WSCLOC               370    371B 0
      *____________________________________________________________
      * NUM contains only numeric values for check purpose
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     D NUM             C                   CONST('0123456789')
     D                 DS
     D  SMSD                   1      3
     D  SMLNR                  4      6  0
     D  SAMREF                 1      6
      *____________________________________________________________
      * Parameter list
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    PAVD
     C                   PARM                    POPD
     C                   PARM                    PSMSD
     C                   PARM                    PSMLNR
      *____________________________________________________________
      * Initialize subroutine
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C                   EXSR      INIT
      *____________________________________________________________
      * Main logic
      *""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     START1        TAG
     C     WSMSD         IFNE      *BLANKS
     C     WSMLNR        ANDNE     *ZEROS
     C                   EXSR      MASTER
     C                   ELSE
     C     OPDKEY        CHAIN     HEADF                              90
     C     *IN90         IFEQ      *OFF
     C                   EXSR      SEND
     C                   ENDIF
     C                   ENDIF
      *
     C     ENDPGM        TAG
     C                   MOVE      *ON           *INLR
     C                   RETURN
      *
     C                   MOVEA     '00000000'    *IN(30)
     C                   MOVEA     '00000000'    *IN(38)
      *****************************************************************
     C     MASTER        BEGSR
      * Select parts or all elements of the master
      *****************************************************************
      *______________
      * Clear Subfil
      *""""""""""""""
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     TDV20K60
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     0             ZRECNO
      *_____________
      * Fyll Subfil
      *"""""""""""""
     C     MASKEY        CHAIN     SAMLB                              90
     C     *IN90         IFEQ      *OFF
     C     DOKEMK        CHAIN     DOKEM                              90
     C     *IN90         IFEQ      *OFF
     C     KUND1K        CHAIN     CUNDL01                            90
     C     *IN90         IFEQ      *OFF
     C                   MOVEL     KNAVN         WAGENT
     C                   ELSE
     C                   MOVEL     *BLANKS       WAGENT
     C                   ENDIF
     C                   ADD       1             ZRECNO
     C                   MOVEL     *BLANKS       WIDENT
     C                   MOVEL     SMMAWB        WIDENT
     C                   MOVEL     'FWB-MAWB'    WTYPE
     C                   Z-ADD     DFNTT         WENT
     C                   Z-ADD     DFVKTT        WEVKT
     C                   MOVEL     DFSD          WESDT
     C                   MOVEL     DFSDF         WESDF
     C                   MOVEL     SMSD          SFSD
     C                   MOVEL     SMLNR         SFLNR
     C                   WRITE     TDV20H50
      *
     C                   ADD       1             ZRECNO
     C                   MOVEL     *BLANKS       WIDENT
     C                   MOVEL     SAMREF        WIDENT
     C                   MOVEL     'AZF-CONS'    WTYPE
     C                   Z-ADD     DFNTT         WENT
     C                   Z-ADD     DFVKTT        WEVKT
     C                   MOVEL     SMSD          WESDT
     C                   MOVEL     SMSDF         WESDF
     C                   MOVEL     SMSD          SFSD
     C                   MOVEL     SMLNR         SFLNR
     C                   WRITE     TDV20H50
      *
     C     HEAD71        TAG
     C     SAMREF        SETLL     HEAD19
     C     SAMREF        READE     HEAD19                                 94
     C     *IN94         CABEQ     *ON           START2
     C     SAMREF        SETLL     HEAD19
     C     SAMREF        READE     HEAD19                                 94
     C     *IN94         DOWEQ     *OFF
     C                   ADD       1             ZRECNO
     C                   MOVEL     *BLANKS       WIDENT
     C                   MOVEL     HEHAWB        WIDENT
     C                   MOVEL     'AZB-HAWB'    WTYPE
     C                   Z-ADD     HENT          WENT
     C                   Z-ADD     HEVKT         WEVKT
     C                   MOVEL     HENAS         WAGENT
     C                   MOVEL     HESDT         WESDT
     C                   MOVEL     HESDF         WESDF
     C                   Z-ADD     HEAVD         SFAVD
     C                   Z-ADD     HEOPD         SFOPD
     C                   MOVE      HEHAWB        SFHAWB
     C                   WRITE     TDV20H50
     C     SAMREF        READE     HEAD19                                 94
     C                   ENDDO
      *
     C     START2        TAG
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   ENDIF                                                  <*IN90
     C                   ENDIF                                                  <*IN90
      *________________
      * Display Subfil
      *""""""""""""""""
     C     START3        TAG
     C     ZRECNO        IFEQ      0
     C                   MOVEA     '01'          *IN(91)
     C                   ELSE
     C                   Z-ADD     1             ZRECNO
     C                   MOVEA     '11'          *IN(91)
     C                   ENDIF
      *
     C                   WRITE     TDV20B20
     C                   EXFMT     TDV20K60
      *
     C                   MOVEA     '0000000'     *IN(30)
     C                   MOVE      *OFF          *IN45
     C                   MOVE      *OFF          *IN46
      *
     C                   SETOFF                                       9998
      * F3 = Gå ut
     C     *IN03         CABEQ     '1'           MASTE9
      * F12 = Annuller
     C     *IN12         CABEQ     '1'           MASTE9
      * F10 = send alle avmerkede til samme
     C     *IN10         IFEQ      *ON
     C                   MOVE      *ON           *IN44
     C                   ELSE
     C                   MOVE      *OFF          *IN44
     C                   ENDIF
     C                   MOVE      *ON           *IN46
      * Finn valg
     C     ZRECNO        IFNE      0
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     TDV20H50                               98
     C     *IN98         CABEQ     '1'           START3
      * blank
     C     WSNR          IFEQ      ' '
     C                   MOVE      *BLANK        WSNR
     C                   UPDATE    TDV20H50
     C                   END                                                    <WSNR
      * Poster merket med 1 skal sendes. Det bestemmes inne i SR SEND
      * om alle poster skal sendes til samme (F10) eller til foskjellige
      * adresser.
     C     WSNR          IFEQ      '1'
     C                   EXSR      SEND
     C                   MOVE      *BLANK        WSNR
     C                   UPDATE    TDV20H50
     C     *IN03         CABEQ     *ON           MASTE9
     C     *IN12         CABEQ     *ON           START3
     C                   END                                                    <WSNR
      *
     C                   ENDDO                                                  <*IN98
     C                   END                                                    <ZRECNO
      *
     C                   GOTO      START3
     C     MASTE9        ENDSR
      *****************************************************************
     C     SEND          BEGSR
      * Get values for sending information
      *****************************************************************
      * Decide type, id and agent/seller of message
     C     WAVD          IFNE      *ZEROS
     C     WOPD          ANDNE     *ZEROS
     C                   MOVEL     *BLANKS       WIDENT
     C                   SELECT
     C     HEUR          WHENEQ    'D'
     C     HESAML        IFEQ      *BLANKS
      *          HEHAWB    ANDEQ*BLANKS
     C                   MOVEL     'FWB-AWBE'    WTYPE
     C     11            SUBST     HEGN:5        WIDENT
     C                   MOVEL     HENAS         WAGENT
     C                   ENDIF
     C     HESAML        IFNE      *BLANKS
      *          HEHAWB    ANDNE*BLANKS
     C                   MOVEL     'AZB-HAWB'    WTYPE
     C                   MOVEL     HEHAWB        WIDENT
     C                   MOVEL     HENAS         WAGENT
     C                   Z-ADD     HEAVD         SFAVD
     C                   Z-ADD     HEOPD         SFOPD
     C                   MOVE      HEHAWB        SFHAWB
     C                   ENDIF
     C     HEUR          WHENEQ    'E'
     C                   MOVEL     'FWB-AWBD'    WTYPE
     C     11            SUBST     HEGN:5        WIDENT
     C                   MOVEL     HENAS         WAGENT
     C     HEUR          WHENEQ    'C'
     C     FRIKEY        CHAIN     FRISOK                             51
     C     *IN51         IFEQ      *OFF
     C                   MOVEL     'FWB-AWBD'    WTYPE
     C                   MOVEL(P)  FSSOK         WIDENT
     C                   MOVEL     HENAS         WAGENT
     C                   ENDIF
     C                   ENDSL
     C                   Z-ADD     HENT          WENT
     C                   Z-ADD     HEVKT         WEVKT
     C                   ELSE
      * Else records are selected from master overwiew and these
      * values are alredy defined in SR MASTER.
     C                   ENDIF
      *
     C     SEND02        TAG
     C     *IN45         IFEQ      *OFF
     C                   EXFMT     TDV20B10
     C                   MOVEA     '0000'        *IN(30)
     C     *IN03         CABEQ     *ON           SEND99
     C     *IN12         CABEQ     *ON           SEND99
     C     WSCLOC        DIV       256           LINNBR            3 0
     C     *IN09         IFEQ      *ON
     C                   EXSR      NEWPAR
     C                   GOTO      SEND02
     C                   ENDIF
     C     *IN08         IFEQ      *ON
     C                   EXSR      SOEK
     C                   GOTO      SEND02
     C                   ENDIF
     C                   ENDIF                                                  <*IN45
     C     *IN10         IFEQ      *ON
     C     WID1          IFEQ      *BLANKS
     C     WADR1         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN31
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WMODE1        IFEQ      *BLANKS
     C     WADR1         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN31
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WMODE1        IFEQ      *BLANKS
     C     WID1          ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN31
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WID2          IFNE      *BLANKS
     C     WADR2         ORNE      *BLANKS
     C     WMODE2        ORNE      *BLANKS
     C     WID2          IFEQ      *BLANKS
     C     WADR2         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN32
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WMODE2        IFEQ      *BLANKS
     C     WADR2         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN32
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WID2          IFEQ      *BLANKS
     C     WMODE2        ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN32
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C                   ENDIF
     C     WID3          IFNE      *BLANKS
     C     WADR3         ORNE      *BLANKS
     C     WMODE3        ORNE      *BLANKS
     C     WID3          IFEQ      *BLANKS
     C     WADR3         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN33
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WMODE3        IFEQ      *BLANKS
     C     WADR3         ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN33
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C     WID3          IFEQ      *BLANKS
     C     WMODE3        ANDEQ     *BLANKS
     C                   MOVE      *ON           *IN30
     C                   MOVE      *ON           *IN33
     C                   MOVE      'BBA0116'     MSGNR
     C                   GOTO      SEND02
     C                   ENDIF
     C                   ENDIF
     C     *IN44         IFEQ      *ON
     C                   MOVE      *ON           *IN45
     C                   ENDIF
     C                   EXSR      SNDRQS
     C                   MOVE      *ON           *IN30
     C                   MOVE      'BBA0120'     MSGNR
     C     *IN46         IFEQ      *ON
     C                   GOTO      SEND99
     C                   ELSE
     C                   GOTO      SEND02
     C                   ENDIF
     C                   ENDIF
      *
     C     WID1          IFEQ      *BLANKS
     C     WADR1         ANDEQ     *BLANKS
     C                   MOVEL     *BLANKS       WMODE1
     C                   MOVEL     *BLANKS       WNAME1
     C                   ENDIF
     C     WID2          IFEQ      *BLANKS
     C     WADR2         ANDEQ     *BLANKS
     C                   MOVEL     *BLANKS       WMODE2
     C                   MOVEL     *BLANKS       WNAME2
     C                   ENDIF
     C     WID3          IFEQ      *BLANKS
     C     WADR3         ANDEQ     *BLANKS
     C                   MOVEL     *BLANKS       WMODE3
     C                   MOVEL     *BLANKS       WNAME3
     C                   ENDIF
     C     WID1          IFNE      *BLANKS
     C     WADR1         ANDEQ     *BLANKS
     C     WID1          CHAIN     PARL01                             90
     C     *IN90         IFEQ      *OFF
     C                   MOVEL     PANETA        WADR1
     C                   MOVEL     PAMTM         WMODE1
     C                   MOVEL     PANAM         WNAME1
     C                   ENDIF
     C                   ENDIF
     C     WID2          IFNE      *BLANKS
     C     WADR2         ANDEQ     *BLANKS
     C     WID2          CHAIN     PARL01                             90
     C     *IN90         IFEQ      *OFF
     C                   MOVEL     PANETA        WADR2
     C                   MOVEL     PAMTM         WMODE2
     C                   MOVEL     PANAM         WNAME2
     C                   ENDIF
     C                   ENDIF
     C     WID3          IFNE      *BLANKS
     C     WADR3         ANDEQ     *BLANKS
     C     WID3          CHAIN     PARL01                             90
     C     *IN90         IFEQ      *OFF
     C                   MOVEL     PANETA        WADR3
     C                   MOVEL     PAMTM         WMODE3
     C                   MOVEL     PANAM         WNAME3
     C                   ENDIF
     C                   ENDIF
      *
     C                   GOTO      SEND02
      *
     C     SEND99        ENDSR
      *****************************************************************
     C     INIT          BEGSR
      *****************************************************************
     C     *LIKE         DEFINE    HEAVD         WAVD
     C     *LIKE         DEFINE    HEOPD         WOPD
     C     *LIKE         DEFINE    SMSD          WSMSD
     C     *LIKE         DEFINE    SMLNR         WSMLNR
     C     *LIKE         DEFINE    HEAVD         PAVD
     C     *LIKE         DEFINE    HEOPD         POPD
     C     *LIKE         DEFINE    SMSD          PSMSD
     C     *LIKE         DEFINE    SMLNR         PSMLNR
     C     *LIKE         DEFINE    KNAVN         WNAVN
     C     *LIKE         DEFINE    KUNDNR        WKUND
     C     *LIKE         DEFINE    FSKODE        WSKODE
     C                   MOVEL     'IAW'         WSKODE
     C                   Z-ADD     PAVD          WAVD
     C                   Z-ADD     POPD          WOPD
     C                   Z-ADD     PSMLNR        WSMLNR
     C                   MOVEL     PSMSD         WSMSD
     C                   Z-ADD     0             W                 1 0
     C                   Z-ADD     0             X                 3 0
     C                   Z-ADD     5             A                 2 0
     C                   Z-ADD     45            B                 3 0
     C                   Z-ADD     0             RRECNR            9 0
     C                   READ      FIRM                                   90
     C                   MOVEL     *BLANKS       DEFADR           17
      *
     C     OPDKEY        KLIST
     C                   KFLD                    WAVD
     C                   KFLD                    WOPD
     C     MASKEY        KLIST
     C                   KFLD                    WSMSD
     C                   KFLD                    WSMLNR
     C     DOKEMK        KLIST
     C                   KFLD                    YRIM
     C                   KFLD                    WSMSD
     C                   KFLD                    WSMLNR
     C                   MOVE      'M'           YRIM              1
     C     KUND1K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    SMKNS
     C     KUND2K        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    WKUND
     C     FRIKEY        KLIST
     C                   KFLD                    WAVD
     C                   KFLD                    WOPD
     C                   KFLD                    WSKODE
      *
     C                   ENDSR
      *
      *****************************************************************
     C     NEWPAR        BEGSR
      * Display window for retreive of new participant ID
      *       (For whom this message is to be sent)
      *****************************************************************
     C                   CALL      'SM900R'
     C                   PARM      *BLANKS       WDEFAD           17
     C                   PARM                    A
     C                   PARM                    B
     C                   PARM      '0'           WIN12             1
     C                   PARM      '0'           WPNONE            1
     C     WPNONE        IFEQ      '1'
     C                   MOVE      *ON           *IN30
     C                   MOVE      'BBA0118'     MSGNR
     C                   GOTO      ENDPAR
     C                   END                                                    <WPNONE
     C                   MOVE      *ON           *IN30
     C     WIN12         IFEQ      '0'
     C     WDEFAD        ANDNE     *BLANKS
     C     WDEFAD        CHAIN     PARL01                             90
     C     *IN90         IFEQ      *OFF
     C                   SELECT
     C     LINNBR        WHENLE    14
     C                   MOVEL     *BLANKS       WID1
     C                   MOVEL     *BLANKS       WADR1
     C                   MOVEL     *BLANKS       WMODE1
     C                   MOVEL     *BLANKS       WNAME1
     C                   MOVEL     WDEFAD        WID1
     C                   MOVEL     PANETA        WADR1
     C                   MOVEL     PAMTM         WMODE1
     C                   MOVEL     PANAM         WNAME1
     C     LINNBR        WHENEQ    15
     C                   MOVEL     *BLANKS       WID2
     C                   MOVEL     *BLANKS       WADR2
     C                   MOVEL     *BLANKS       WMODE2
     C                   MOVEL     *BLANKS       WNAME2
     C                   MOVEL     WDEFAD        WID2
     C                   MOVEL     PANETA        WADR2
     C                   MOVEL     PAMTM         WMODE2
     C                   MOVEL     PANAM         WNAME2
     C     LINNBR        WHENGE    16
     C                   MOVEL     *BLANKS       WID3
     C                   MOVEL     *BLANKS       WADR3
     C                   MOVEL     *BLANKS       WMODE3
     C                   MOVEL     *BLANKS       WNAME3
     C                   MOVEL     WDEFAD        WID3
     C                   MOVEL     PANETA        WADR3
     C                   MOVEL     PAMTM         WMODE3
     C                   MOVEL     PANAM         WNAME3
     C                   ENDSL
     C                   ENDIF                                                  <*IN90
     C                   ELSE                                                   <WIN12
     C                   MOVE      'BBA0119'     MSGNR
     C                   END                                                    <WIN12
      *
     C     ENDPAR        ENDSR
      *
      *****************************************************************
     C     SNDRQS        BEGSR
      *****************************************************************
     C                   SELECT
     C     WTYPE         WHENEQ    'AZF-CONS'                                   <MANIFEST
     C                   CALL      'TDV11R'
     C                   PARM                    SFSD
     C                   PARM                    SFLNR
     C                   PARM                    WID1
     C                   PARM                    WADR1
     C                   PARM                    WID2
     C                   PARM                    WADR2
     C                   PARM                    WID3
     C                   PARM                    WADR3
     C                   PARM                    WMODE1
     C                   PARM                    WMODE2
     C                   PARM                    WMODE3
     C     WTYPE         WHENEQ    'AZB-HAWB'
     C                   CALL      'TDV10R'
     C                   PARM                    SFAVD
     C                   PARM                    SFOPD
     C                   PARM                    SFHAWB
     C                   PARM                    WID1
     C                   PARM                    WADR1
     C                   PARM                    WID2
     C                   PARM                    WADR2
     C                   PARM                    WID3
     C                   PARM                    WADR3
     C                   PARM                    WMODE1
     C                   PARM                    WMODE2
     C                   PARM                    WMODE3
     C     WTYPE         WHENEQ    'FWB-MAWB'
     C                   CALL      'TDV12R'
     C                   PARM                    SFSD
     C                   PARM                    SFLNR
     C                   PARM                    WID1
     C                   PARM                    WADR1
     C                   PARM                    WID2
     C                   PARM                    WADR2
     C                   PARM                    WID3
     C                   PARM                    WADR3
     C                   PARM                    WMODE1
     C                   PARM                    WMODE2
     C                   PARM                    WMODE3
     C     WTYPE         WHENEQ    'FWB-AWBE'
     C     11            SUBST     HEGN:5        AWB
     C                   Z-ADD     1             ULOP              3 0
     C                   CALL      'TDV13R'
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
     C                   PARM                    ULOP
     C                   PARM                    AWB              11
     C                   PARM                    WID1
     C                   PARM                    WADR1
     C                   PARM                    WID2
     C                   PARM                    WADR2
     C                   PARM                    WID3
     C                   PARM                    WADR3
     C                   PARM                    WMODE1
     C                   PARM                    WMODE2
     C                   PARM                    WMODE3
     C     WTYPE         WHENEQ    'FWB-AWBD'
     C     11            SUBST     HEGN:5        AWB
     C                   CALL      'TDV14R'
     C                   PARM                    HEAVD
     C                   PARM                    HEOPD
     C                   PARM                    AWB              11
     C                   PARM                    WID1
     C                   PARM                    WADR1
     C                   PARM                    WID2
     C                   PARM                    WADR2
     C                   PARM                    WID3
     C                   PARM                    WADR3
     C                   PARM                    WMODE1
     C                   PARM                    WMODE2
     C                   PARM                    WMODE3
     C                   ENDSL
      *
     C                   ENDSR
      *****************************************************************
     C     SOEK          BEGSR
      *****************************************************************
     C                   Z-ADD     0             WKUND
     C                   MOVEL     *BLANKS       WNAVN
     C                   CALL      'SOEKKUN'
     C                   PARM                    WKUND
     C                   PARM                    FIFIRM
     C                   PARM                    WNAVN
      *
     C     WKUND         IFNE      *ZEROS
     C     KUND2K        CHAIN     CUNDL01                            90
     C     *IN90         IFEQ      *OFF
     C                   SELECT
     C     LINNBR        WHENLE    14
     C                   MOVEL     *BLANKS       WID1
     C                   MOVEL     *BLANKS       WADR1
     C                   MOVEL     *BLANKS       WMODE1
     C                   MOVEL     *BLANKS       WNAME1
     C                   MOVEL     TFAXNR        WADR1
     C                   MOVEL     'F'           WMODE1
     C                   MOVEL     KNAVN         WNAME1
     C     LINNBR        WHENEQ    15
     C                   MOVEL     *BLANKS       WID2
     C                   MOVEL     *BLANKS       WADR2
     C                   MOVEL     *BLANKS       WMODE2
     C                   MOVEL     *BLANKS       WNAME2
     C                   MOVEL     TFAXNR        WADR2
     C                   MOVEL     'F'           WMODE2
     C                   MOVEL     KNAVN         WNAME2
     C     LINNBR        WHENGE    16
     C                   MOVEL     *BLANKS       WID3
     C                   MOVEL     *BLANKS       WADR3
     C                   MOVEL     *BLANKS       WMODE3
     C                   MOVEL     *BLANKS       WNAME3
     C                   MOVEL     TFAXNR        WADR3
     C                   MOVEL     'F'           WMODE3
     C                   MOVEL     KNAVN         WNAME3
     C                   ENDSL
     C                   ENDIF
     C                   ENDIF
      *
     C                   ENDSR
