     C***************************************************************
     C*** FYLLER INN MMYY ELLER YY OM DET ER GITT DATO I KORTFORM  **
     C***************************************************************
N01  D                 DS
N01  D  TMDTD                  1      2  0
N01  D  TMDTM                  3      4  0
N01  D  TMDTÅ                  5      6  0
N01  D  TMPDAT                 1      6  0
     C     *ENTRY        PLIST
N01  C                   PARM                    TSTDAT            6 0
     C                   MOVE      TSTDAT        TMPDAT
N01   * KUN 2 SIFFER GITT - DAG.
     C                   SELECT
N01  C                   WHEN      TMPDAT <= 99
N01  C                   MOVE      TMDTÅ         TMDTD
N01  C                   MOVE      UMONTH        TMDTM
N01  C                   MOVE      UYEAR         TMDTÅ
N01   * mer enn 3-4  siffer gitt - DAG /MND
N01  C                   WHEN      TMPDAT >= 100 AND TMPDAT <= 9999
N01  C                   MOVE      TMDTM         TMDTD
N01  C                   MOVE      TMDTÅ         TMDTM
N01  C                   MOVE      UYEAR         TMDTÅ
N01  C                   ENDSL
     C                   MOVE      TMPDAT        TSTDAT
     C                   RETURN
