*****F**************************************************************
     FTESTDAFM  CF   E             WORKSTN
      *
     C     START         TAG
      *
     C                   EXFMT     BILDE01
     C   03              GOTO      SLUTT
     C                   MOVE      DATO1         DATO
     C                   CALL      'SYFA20A'
     C                   PARM                    DATO              6 0
     C                   PARM                    BETTXT           30
     C                   PARM                    UFIRM
     C                   PARM                    UBETBE
     C                   MOVE      DATO          DATO2
     C                   GOTO      START
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
