      *********************************************************************
      * Hen ett oppdrags data - Kun hovedopplysninger i dette programet. (se lenger ned for resten)
      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TJEOPD5L MODULE(*LIBL/TJEOPD5L *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      * For repeterbar informasjon finnes egne programer:
      * TJGE11R     RPGLE       TomCat/JSON Oppdragsfritekst liste (kun A, 1)
      * TJGE12R     RPGLE       TomCat/JSON Oppdragsdokumenter
      * TJGE13R     RPGLE       TomCat/JSON Oppdragsfakturar (arkivlenker)
      * TJGE14R     RPGLE       TomCat/JSON OppdragsFrie søkeveier
      * TJGE15R     RPGLE       TomCat/JSON Oppdrags T&T
      * TJGE25R     RPGLE       TomCat/JSON Oppdragsfakturar (arbeide med/se på)
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 JOV PTF11 Div nye felt
********************************************************************
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FBRPARF    IF   e           k disk    USROPN
     FHEADF     IF   E           K DISK    USROPN
     FHEAD17    IF   E           K DISK    USROPN
     F                                     RENAME(headfr:headfr17)
     FFIRM      IF   E           K DISK    USROPN
     FFRISOL01  IF   E           K DISK    USROPN
     FKOFAST    IF   E           K DISK    USROPN
     FTRACKT    IF   E           K DISK    USROPN
     FTRACKL08  IF   E           K DISK    USROPN
     FGSSCGL02  IF   E           K DISK    USROPN
     FDOKUFM    IF   E           K DISK    USROPN
     FDOKUFE    IF   E           K DISK    USROPN
     FCUNDL01   IF   E           K DISK    USROPN
     FSTED2D    IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D LNG             s              2
     D WSUSER          S             10
     D WSNA            S             30
     D KN              S              8  0 DIM(30)
     D DIR             s              1
     D WSAVD           S              4
     D WSOPD           S              7
     D EXTREF          S             35
     D WSSOK           S             80
     D WSSOKURL        S            200
     D Error           S            150
     D JSONstring      s          64000
     D ANTSND          s              5  0
     D SNR             s             17
     D WSSCONT         S             30
     D WSSTLF          S             30
     D WSSMAIL         S             70
     D WSKCONT         S             30
     D WSKTLF          S             30
     D WSKMAIL         S             70
N01  D WSSAKNR         S              8  0
N01  D WSSAKNAV        S             30
N01  D WSKAKNR         S              8  0
     D WSKAKNAV        S             30
     D WSETDK          S              4  0
     D WSATDK          S              4  0
     D WSETAK          S              4  0
     D WSATAK          S              4  0
     D WHENAS          S             30
     D WHENAK          S             30
     D WPPNS1          S             30
     D WPPNS2          S             30
     D WPPNS3          S             30
     D WPPNS4          S             30
     D HEBODT          S              8  0
     D WSBOTM          S              4  0

     D                 DS
     D  DSAVOP                 1     12
     D  DSAVD                  1      4
     D  Strek                  5      5
     D  DSOPD                  6     12
     D  DSOPD5                 6     10
     D                 DS
     D  DFS                    1     10    DIM(10)
     D  KFSODK                 1     10
     D                 DS
     D  KFTXT                  1     50
     D  KFTXTB                 5     49
     D                 DS
     D  HXSNDN                 1     20
     D  HXSNR17                4     20
     D                 DS
     D  HEGN                   1     15
     D  HEGN04                 1      4
     D  HEGN03                 5      7
     D  HEGN08                 8     15
     D  HEGN515                5     15
     D                 DS
     D  HERFA                  1     35
     D  HERFA03                1      3
     D  HERFA08                4     11
     D                 DS
     D  HEDTMO                 1      8
     D  HEDTMOD                1      2
     D  HEDTMOM                3      4
     D  HEDTMOÅ                5      6
     D  HEDTMO6                1      6
     D  HEDTMO2                7      8
     D                 DS
     D  WSATAD                 1      8  0
     D  WSATADÅ                1      4  0
     D  WSATADM                5      6  0
     D  WSATADD                7      8  0
     D                 DS
     D  WSATDD                 1      8  0
     D  WSATDDÅ                1      4  0
     D  WSATDDM                5      6  0
     D  WSATDDD                7      8  0
     D                 DS
     D  WSETAD                 1      8  0
     D  WSETADÅ                1      4  0
     D  WSETADM                5      6  0
     D  WSETADD                7      8  0
     D                 DS
     D  WSETDD                 1      8  0
     D  WSETDDÅ                1      4  0
     D  WSETDDM                5      6  0
     D  WSETDDD                7      8  0
      * For xlate mellom Upper Case og Lower Case
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3
      * Parse input
     C                   EXSR      Parse
      * Open files etc
     C                   EXSR      INIT

      *
     C                   CALLP     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   CALLP     wrtsection('top')
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬lng¬ : ¬'+%trim(LNG)+'¬, '
        +'¬wsna¬ : ¬'+%trim(WSNA)+'¬, '
        +'¬kunde¬ : ¬'+%trim(%editc(BIKUNR:'Z'))+'¬, '
        +'¬sdato¬ : ¬'+%trim(%editc(BIDTV:'Z'))+'¬, '
        +'¬stid¬ : ¬'+%trim(%editc(BITIDV:'Z'))+'¬, '
        +'¬wsavd¬ : ¬'+%trim(WSAVD)+'¬, '
        +'¬wsopd¬ : ¬'+%trim(WSOPD)+'¬, '
        +'¬dir¬ : ¬'+%trim(DIR)+'¬, '
        +'¬extref¬ : ¬'+%trim(EXTREF)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     C                   CALL      'JSONFIX'
     C                   PARM                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')

      * Skriv JSON-LISTE Start
     C                   EVAL      JSONstring ='"dspoppdrag" : ['
     C                   CALLP     UPdHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      * Hent oppdrag
     C                   EXSR      DspPart
     C                   ADD       1             AntSnd
      /free
          JSONstring=*BLANKS;
       JSONstring=%trim(JSONstring)+'{'
        +'¬heur¬ : ¬'+%trim(HEUR)+'¬, '
        +'¬fitdvi¬ : ¬'+%trim(FITDVI)+'¬, '
        +'¬heavd¬ : ¬'+%trim(%editc(HEAVD:'Z'))+'¬, '
        +'¬heopd¬ : ¬'+%trim(%editc(HEOPD:'Z'))+'¬, '
        +'¬hesg¬ : ¬'+%trim(HESG)+'¬, '
        +'¬hedtop¬ : ¬'+%trim(%editc(HEDTOP:'Z'))+'¬, '
        +'¬hedtr¬ : ¬'+%trim(%editc(HEDTR:'Z'))+'¬, '
        +'¬hesdff¬ : ¬'+%trim(HESDFF)+'¬, '
        +'¬hesdf¬ : ¬'+%trim(HESDF)+'¬, '
        +'¬hesdt¬ : ¬'+%trim(HESDT)+'¬, '
        +'¬hesdvt¬ : ¬'+%trim(HESDVT)+'¬, '
        +'¬wsetad¬ : ¬'+%trim(%editc(WSETAD:'Z'))+'¬, '
        +'¬wsetdd¬ : ¬'+%trim(%editc(WSETDD:'Z'))+'¬, '
        +'¬wsatad¬ : ¬'+%trim(%editc(WSATAD:'Z'))+'¬, '
        +'¬wsatdd¬ : ¬'+%trim(%editc(WSATDD:'Z'))+'¬, '
        +'¬wsetdk¬ : ¬'+%trim(%editc(WSETDK:'Z'))+'¬, '
        +'¬wsetak¬ : ¬'+%trim(%editc(WSETAK:'Z'))+'¬, '
        +'¬wsatdk¬ : ¬'+%trim(%editc(WSATDK:'Z'))+'¬, '
        +'¬wsatak¬ : ¬'+%trim(%editc(WSATAK:'Z'))+'¬, '
        +'¬hegn¬ : ¬'+%trim(HEGN)+'¬, '
        +'¬hegnn¬ : ¬'+%trim(HEGNN)+'¬, '
        +'¬hepro¬ : ¬'+%trim(%editc(HEPRO:'Z'))+'¬, '
        +'¬heplan¬ : ¬'+%trim(HEPLAN)+'¬, '
        +'¬trrund¬ : ¬'+%trim(%editc(TRRUND:'Z'))+'¬, '
        +'¬hepos1¬ : ¬'+%trim(HEPOS1)+'¬, '
        +'¬hepos2¬ : ¬'+%trim(%editc(HEPOS2:'Z'))+'¬, '
        +'¬trknfa¬ : ¬'+%trim(%editc(TRKNFA:'Z'))+'¬, '
        +'¬henao¬ : ¬'+%trim(HENAO)+'¬, '
        +'¬hekna¬ : ¬'+%trim(%editc(HEKNA:'Z'))+'¬, '
        +'¬henaa¬ : ¬'+%trim(HENAA)+'¬, '
        +'¬herfa¬ : ¬'+%trim(HERFA)+'¬, '
        +'¬hesaml¬ : ¬'+%trim(HESAML)+'¬, '
        +'¬hehawb¬ : ¬'+%trim(HEHAWB)+'¬, '
        +'¬hesdla¬ : ¬'+%trim(HESDLA)+'¬, '
        +'¬hesdl¬ : ¬'+%trim(HESDL)+'¬, '
        +'¬hevalt¬ : ¬'+%trim(HEVALT)+'¬, '
        +'¬hevalp¬ : ¬'+%trim(%editc(HEVALP:'4'))+'¬, '
        +'¬heknt¬ : ¬'+%trim(%editc(HEKNT:'Z'))+'¬, '
        +'¬helka¬ : ¬'+%trim(HELKA)+'¬, '
        +'¬whenas¬ : ¬'+%trim(WHENAS)+'¬, '
        +'¬hekns¬ : ¬'+%trim(%editc(HEKNS:'Z'))+'¬, '
        +'¬henas¬ : ¬'+%trim(HENAS)+'¬, '
        +'¬heads1¬ : ¬'+%trim(HEADS1)+'¬, '
        +'¬heads2¬ : ¬'+%trim(HEADS2)+'¬, '
        +'¬hepns¬ : ¬'+%trim(HEPNS)+'¬, '
        +'¬heads3¬ : ¬'+%trim(HEADS3)+'¬, '
-----   +'¬helks¬ : ¬'+%trim(HELKS)+'¬, '
-----   +'¬wsscont¬ : ¬'+%trim(WSSCONT)+'¬, '
-----   +'¬wsstlf¬ : ¬'+%trim(WSSTLF)+'¬, '
-----   +'¬wssmail¬ : ¬'+%trim(WSSMAIL)+'¬, '
        +'¬heknh¬ : ¬'+%trim(%editc(HEKNH:'Z'))+'¬, '
-----   +'¬henah¬ : ¬'+%trim(HENAH)+'¬, '
        +'¬headh1¬ : ¬'+%trim(HEADH1)+'¬, '
        +'¬headh2¬ : ¬'+%trim(HEADH2)+'¬, '
        +'¬hepnh¬ : ¬'+%trim(HEPNH)+'¬, '
        +'¬headh3¬ : ¬'+%trim(HEADH3)+'¬, '
        +'¬helkh¬ : ¬'+%trim(HELKH)+'¬, '
        +'¬hehbre¬ : ¬'+%trim(%editc(HEHBRE:'4'))+'¬, '
        +'¬hehlen¬ : ¬'+%trim(%editc(HEHLEN:'4'))+'¬, '
        +'¬hehblk¬ : ¬'+%trim(HEHBLK)+'¬, '
        +'¬hekdfs¬ : ¬'+%trim(HEKDFS)+'¬, '
        +'¬hevals¬ : ¬'+%trim(HEVALS)+'¬, '
        +'¬heknsf¬ : ¬'+%trim(%editc(HEKNSF:'Z'))+'¬, '
        +'¬heans¬ : ¬'+%trim(%editc(HEANS:'Z'))+'¬, '
        +'¬henasf¬ : ¬'+%trim(HENASF)+'¬, '
N01     +'¬avtknrs¬ : ¬'+%trim(%editc(WSSAKNR:'Z'))+'¬, '
N01     +'¬avtknavs¬ : ¬'+%trim(WSSAKNAV)+'¬, '
        +'¬whenak¬ : ¬'+%trim(WHENAK)+'¬, '
        +'¬heknk¬ : ¬'+%trim(%editc(HEKNK:'Z'))+'¬, '
        +'¬henak¬ : ¬'+%trim(HENAK)+'¬, '
        +'¬headk1¬ : ¬'+%trim(HEADK1)+'¬, '
        +'¬headk2¬ : ¬'+%trim(HEADK2)+'¬, '
        +'¬hepnk¬ : ¬'+%trim(HEPNK)+'¬, '
        +'¬headk3¬ : ¬'+%trim(HEADK3)+'¬, '
        +'¬helkk¬ : ¬'+%trim(HELKK)+'¬, '
-----   +'¬wskcont¬ : ¬'+%trim(WSKCONT)+'¬, '
-----   +'¬wsktlf¬ : ¬'+%trim(WSKTLF)+'¬, '
-----   +'¬wskmail¬ : ¬'+%trim(WSKMAIL)+'¬, '
        +'¬heknl¬ : ¬'+%trim(%editc(HEKNL:'Z'))+'¬, '
        +'¬henal¬ : ¬'+%trim(HENAL)+'¬, '
        +'¬headl1¬ : ¬'+%trim(HEADL1)+'¬, '
        +'¬headl2¬ : ¬'+%trim(HEADL2)+'¬, '
        +'¬hepnl¬ : ¬'+%trim(HEPNL)+'¬, '
        +'¬headl3¬ : ¬'+%trim(HEADL3)+'¬, '
        +'¬helkl¬ : ¬'+%trim(HELKL)+'¬, '
        +'¬helbre¬ : ¬'+%trim(%editc(HELBRE:'4'))+'¬, '
        +'¬hellen¬ : ¬'+%trim(%editc(HELLEN:'4'))+'¬, '
        +'¬helblk¬ : ¬'+%trim(HELBLK)+'¬, '
        +'¬hekdfk¬ : ¬'+%trim(HEKDFK)+'¬, '
        +'¬hevalk¬ : ¬'+%trim(HEVALK)+'¬, '
        +'¬heknkf¬ : ¬'+%trim(%editc(HEKNKF:'Z'))+'¬, '
        +'¬heank¬ : ¬'+%trim(%editc(HEANK:'Z'))+'¬, '
        +'¬henakf¬ : ¬'+%trim(HENAKF)+'¬, '
N01     +'¬avtknrk¬ : ¬'+%trim(%editc(WSKAKNR:'Z'))+'¬, '
N01     +'¬avtknavk¬ : ¬'+%trim(WSKAKNAV)+'¬, '
        +'¬heot¬ : ¬'+%trim(HEOT)+'¬, '
        +'¬hekdpl¬ : ¬'+%trim(HEKDPL)+'¬, '
        +'¬hefr¬ : ¬'+%trim(HEFR)+'¬, '
        +'¬hent¬ : ¬'+%trim(%editc(HENT:'Z'))+'¬, '
        +'¬hevs1¬ : ¬'+%trim(HEVS1)+'¬, '
        +'¬hevs2¬ : ¬'+%trim(HEVS2)+'¬, '
        +'¬hegm1¬ : ¬'+%trim(HEGM1)+'¬, '
        +'¬hegm2¬ : ¬'+%trim(HEGM2)+'¬, '
        +'¬hevkt¬ : ¬'+%trim(%editc(HEVKT:'4'))+'¬, '
        +'¬helm¬ : ¬'+%trim(%editc(HELM:'4'))+'¬, '
        +'¬hem3¬ : ¬'+%trim(%editc(HEM3:'4'))+'¬, '
        +'¬hefbv¬ : ¬'+%trim(%editc(HEFBV:'4'))+'¬, '
        +'¬hekf¬ : ¬'+%trim(HEKF)+'¬, '
        +'¬hekft1¬ : ¬'+%trim(HEKFT1)+'¬, '
        +'¬heft1¬ : ¬'+%trim(HEFT1)+'¬, '
        +'¬hedtcp¬ : ¬'+%trim(%editc(HEDTCP:'Z'))+'¬, '
        +'¬hedtap¬ : ¬'+%trim(%editc(HEDTÅP:'Z'))+'¬, '
        +'¬hedtmp¬ : ¬'+%trim(%editc(HEDTMP:'Z'))+'¬, '
        +'¬hekdkk¬ : ¬'+%trim(HEKDKK)+'¬, '
        +'¬hefngk¬ : ¬'+%trim(%editc(HEFNGK:'Z'))+'¬, '
        +'¬hefngs¬ : ¬'+%trim(%editc(HEFNGS:'Z'))+'¬, '
        +'¬hekdtm¬ : ¬'+%trim(HEKDTM)+'¬, '
        +'¬hetrm¬ : ¬'+%trim(%editc(HETRM:'Z'))+'¬, '
        +'¬hetri¬ : ¬'+%trim(HETRI)+'¬, '
        +'¬hetrc¬ : ¬'+%trim(%editc(HETRC:'Z'))+'¬, '
        +'¬hetrcn¬ : ¬'+%trim(HETRCN)+'¬, '
        +'¬hefbk¬ : ¬'+%trim(%editc(HEFBK:'4'))+'¬, '
        +'¬hetle¬ : ¬'+%trim(HETLE)+'¬, '
        +'¬hetll¬ : ¬'+%trim(HETLL)+'¬, '
        +'¬hetlku¬ : ¬'+%trim(HETLKU)+'¬, '
        +'¬hentvs¬ : ¬'+%trim(%editc(HENTVS:'Z'))+'¬, '
        +'¬hevn¬ : ¬'+%trim(%editc(HEVN:'Z'))+'¬, '
        +'¬hentf¬ : ¬'+%trim(%editc(HENTF:'Z'))+'¬, '
        +'¬hebelt¬ : ¬'+%trim(%editc(HEBELT:'4'))+'¬, '
        +'¬hebelm¬ : ¬'+%trim(%editc(HEBELM:'4'))+'¬, '
        +'¬hesgm¬ : ¬'+%trim(HESGM)+'¬, '
        +'¬hedtmo¬ : ¬'+%trim(HEDTMO)+'¬, '
        +'¬heklmo¬ : ¬'+%trim(%editc(HEKLMO:'Z'))+'¬, '
        +'¬hepk1¬ : ¬'+%trim(HEPK1)+'¬, '
        +'¬hepk2¬ : ¬'+%trim(HEPK2)+'¬, '
        +'¬hepk3¬ : ¬'+%trim(HEPK3)+'¬, '
        +'¬hepk4¬ : ¬'+%trim(HEPK4)+'¬, '
        +'¬hepk5¬ : ¬'+%trim(HEPK5)+'¬, '
        +'¬hepk6¬ : ¬'+%trim(HEPK6)+'¬, '
        +'¬hepk7¬ : ¬'+%trim(HEPK7)+'¬, '
        +'¬hepk8¬ : ¬'+%trim(HEPK8)+'¬, '
        +'¬hepk9¬ : ¬'+%trim(HEPK9)+'¬, '
        +'¬hekdl¬ : ¬'+%trim(HEKDL)+'¬, '
        +'¬helb¬ : ¬'+%trim(HELB)+'¬, '
        +'¬helkfr¬ : ¬'+%trim(HELKFR)+'¬, '
        +'¬hesdfr¬ : ¬'+%trim(HESDFR)+'¬, '
        +'¬hestfr¬ : ¬'+%trim(HESTFR)+'¬, '
        +'¬herfk¬ : ¬'+%trim(HERFK)+'¬, '
        +'¬trslag¬ : ¬'+%trim(TRSLAG)+'¬, '
        +'¬travd0¬ : ¬'+%trim(%editc(TRAVD0:'Z'))+'¬, '
        +'¬tropd0¬ : ¬'+%trim(%editc(TROPD0:'Z'))+'¬, '
        +'¬travd1¬ : ¬'+%trim(%editc(TRAVD1:'Z'))+'¬, '
        +'¬tropd1¬ : ¬'+%trim(%editc(TROPD1:'Z'))+'¬, '
        +'¬travd2¬ : ¬'+%trim(%editc(TRAVD2:'Z'))+'¬, '
        +'¬tropd2¬ : ¬'+%trim(%editc(TROPD2:'Z'))+'¬, '
        +'¬trsffd¬ : ¬'+%trim(%editc(TRSFFD:'Z'))+'¬, '
        +'¬trsffk¬ : ¬'+%trim(%editc(TRSFFK:'Z'))+'¬, '
        +'¬trsdfd¬ : ¬'+%trim(%editc(TRSDFD:'Z'))+'¬, '
        +'¬trsdfk¬ : ¬'+%trim(%editc(TRSDFK:'Z'))+'¬, '
        +'¬trsdtd¬ : ¬'+%trim(%editc(TRSDTD:'Z'))+'¬, '
        +'¬trsdtk¬ : ¬'+%trim(%editc(TRSDTK:'Z'))+'¬, '
        +'¬trsvtd¬ : ¬'+%trim(%editc(TRSVTD:'Z'))+'¬, '
        +'¬trsvtk¬ : ¬'+%trim(%editc(TRSVTK:'Z'))+'¬, '
        +'¬trkdak¬ : ¬'+%trim(TRKDAK)+'¬, '
        +'¬trkdff¬ : ¬'+%trim(TRKDFF)+'¬, '
        +'¬trverv¬ : ¬'+%trim(TRVERV)+'¬, '
        +'¬trverb¬ : ¬'+%trim(%editc(TRVERB:'Z'))+'¬, '
        +'¬trettv¬ : ¬'+%trim(TRETTV)+'¬, '
        +'¬trettb¬ : ¬'+%trim(%editc(TRETTB:'Z'))+'¬, '
        +'¬trfrak¬ : ¬'+%trim(TRFRAK)+'¬, '
        +'¬trfrav¬ : ¬'+%trim(TRFRAV)+'¬, '
        +'¬trfrab¬ : ¬'+%trim(%editc(TRFRAB:'4'))+'¬, '
        +'¬trmva¬ : ¬'+%trim(TRMVA)+'¬, '
        +'¬trfa11¬ : ¬'+%trim(TRFA11)+'¬, '
        +'¬trfa12¬ : ¬'+%trim(TRFA12)+'¬, '
        +'¬trflP1¬ : ¬'+%trim(%editc(TRFLP1:'Z'))+'¬, '
        +'¬trfa21¬ : ¬'+%trim(TRFA21)+'¬, '
        +'¬trfa22¬ : ¬'+%trim(TRFA22)+'¬, '
        +'¬trflp2¬ : ¬'+%trim(%editc(TRFLP2:'Z'))+'¬, '
        +'¬trtsta¬ : ¬'+%trim(TRTSTA)+'¬, '
        +'¬trstaf¬ : ¬'+%trim(TRSTAF)+'¬, '
        +'¬trstae¬ : ¬'+%trim(TRSTAE)+'¬, '
        +'¬trsta1¬ : ¬'+%trim(TRSTA1)+'¬, '
        +'¬trsta2¬ : ¬'+%trim(TRSTA2)+'¬, '
        +'¬trsta3¬ : ¬'+%trim(TRSTA3)+'¬, '
        +'¬trsta4¬ : ¬'+%trim(TRSTA4)+'¬, '
        +'¬trkm¬ : ¬'+%trim(%editc(TRKM:'Z'))+'¬, '
        +'¬he01¬ : ¬'+%trim(HE01)+'¬, '
        +'¬hestd¬ : ¬'+%trim(%editc(HESTD:'Z'))+'¬, '
        +'¬hxsndn¬ : ¬'+%trim(HXSNDN)+'¬, '
        +'¬hxpall¬ : ¬'+%trim(%editc(HXPALL:'Z'))+'¬, '
        +'¬hxblgk¬ : ¬'+%trim(HXBLGK)+'¬, '
        +'¬hxLkod¬ : ¬'+%trim(HXLKOD)+'¬, '
        +'¬hxllst¬ : ¬'+%trim(HXLLST)+'¬, '
        +'¬hxedik¬ : ¬'+%trim(HXEDIK)+'¬, '
        +'¬hxteri¬ : ¬'+%trim(HXTERI)+'¬, '
S01     +'¬hehakn¬ : ¬'+%trim(%editc(HEHAKN:'Z'))+'¬, '
S01     +'¬hehaan¬ : ¬'+%trim(%editc(HEHAAN:'Z'))+'¬, '
        +'¬helakn¬ : ¬'+%trim(%editc(HELAKN:'Z'))+'¬, '
        +'¬helaan¬ : ¬'+%trim(%editc(HELAAN:'Z'))+'¬, '
        +'¬helmla¬ : ¬'+%trim(%editc(HELMLA:'4'))+'¬, '
        +'¬hepoen¬ : ¬'+%trim(%editc(HEPOEN:'Z'))+'¬, '
        +'¬hestl1¬ : ¬'+%trim(HESTL1)+'¬, '
        +'¬hestl2¬ : ¬'+%trim(HESTL2)+'¬, '
        +'¬hestl3¬ : ¬'+%trim(HESTL3)+'¬, '
        +'¬hestl4¬ : ¬'+%trim(HESTL4)+'¬, '
        +'¬hestn1¬ : ¬'+%trim(HESTN1)+'¬, '
        +'¬hestn2¬ : ¬'+%trim(HESTN2)+'¬, '
        +'¬hestn3¬ : ¬'+%trim(HESTN3)+'¬, '
        +'¬hestn4¬ : ¬'+%trim(HESTN4)+'¬, '
        +'¬hestn5¬ : ¬'+%trim(HESTN5)+'¬, '
        +'¬hestn6¬ : ¬'+%trim(HESTN6)+'¬, '
        +'¬hestn7¬ : ¬'+%trim(HESTN7)+'¬, '
        +'¬hestn8¬ : ¬'+%trim(HESTN8)+'¬, '
        +'¬hestn9¬ : ¬'+%trim(HESTN9)+'¬, '
        +'¬herfed¬ : ¬'+%trim(HERFED)+'¬, '
        +'¬helib¬ : ¬'+%trim(HELIB)+'¬, '
        +'¬hefile¬ : ¬'+%trim(HEFILE)+'¬, '
        +'¬hembr¬ : ¬'+%trim(HEMBR)+'¬, '
        +'¬hetype¬ : ¬'+%trim(HETYPE)+'¬, '
        +'¬helvl¬ : ¬'+%trim(HELVL)+'¬, '
        +'¬hesnn¬ : ¬'+%trim(%editc(HESNN:'Z'))+'¬, '
        +'¬heunik¬ : ¬'+%trim(%editc(HEUNIK:'Z'))+'¬, '
        +'¬hereff¬ : ¬'+%trim(HEREFF)+'¬, '
        +'¬wppns1¬ : ¬'+%trim(WPPNS1)+'¬, '
        +'¬wppns2¬ : ¬'+%trim(WPPNS2)+'¬, '
        +'¬wppns3¬ : ¬'+%trim(WPPNS3)+'¬, '
        +'¬wppns4¬ : ¬'+%trim(WPPNS4)+'¬, '
        +'¬hebodt¬ : ¬'+%trim(%editc(HEBODT:'Z'))+'¬, '
        +'¬wsbotm¬ : ¬'+%trim(%editc(WSBOTM:'Z'))+'¬, '
        +'¬hesgm¬ : ¬'+%trim(HESGM)+'¬}';
      /end-free
     C                   CALL      'JSONFIX'
     C                   PARM                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      * Skriv JSON-Liste/Array  Avslutning
     C                   EVAL      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      * Skriv JSON-string Avsluttning
     C                   EVAL      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')

     C     SLUTT         TAG
     C                   EXSR      EXIT
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         BEGSR
     C                   EVAL      LNG     = zhbgetvar('LNG')
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C     LC:UC         XLATE     WSUSER        WSUSER
     C                   EVAL      WSNA    = zhbgetvar('WSNA')
     C                   EVAL      WSAVD   = zhbgetvar('HEAVD')
     C                   MOVE      *ZEROS        HEAVD
     C                   EVAL      HEAVD = c2n2(WSAVD)
     C                   EVAL      WSOPD   = zhbgetvar('HEOPD')
     C                   MOVE      *ZEROS        HEOPD
     C                   EVAL      HEOPD = c2n2(WSOPD)

     C                   ENDSR
      *=====================================================================******
      *  Display Product codes to select from
      *=====================================================================******
     C     DSPPART       BEGSR
      *
     C     HEADFK        CHAIN     HEADF                              33
     C     *IN(33)       IFEQ      '0'
      * Test kundenr
     C                   IF        XINTERN <> 'J'
     C     1             DO        30            XN2
     C     KN(XN2)       CABEQ     0             SLDSPPART
     C     HEKNA         IFNE      KN(XN2)
     C     TRKNFA        ANDNE     KN(XN2)
     C     HEKNS         ANDNE     KN(XN2)
     C     HEKNSF        ANDNE     KN(XN2)
     C     HEKNK         ANDNE     KN(XN2)
     C     HEKNKF        ANDNE     KN(XN2)
     C                   ELSE
     C                   LEAVE
     C                   ENDIF
     C                   ENDDO
     C                   END

     C                   END

     C     TRACKTK       CHAIN     TRACKT                             33
     C  N33              MOVE      TXETAD        WSETAD
     C  N33              MOVE      TXETDD        WSETDD
     C  N33              MOVE      TXATAD        WSATAD
     C  N33              MOVE      TXATDD        WSATDD
     C  N33              MOVE      TXETDK        WSETDK
     C  N33              MOVE      TXETAK        WSETAK
     C  N33              MOVE      TXATDK        WSATDK
     C  N33              MOVE      TXATAK        WSATAK
     C     WSATAD        IFEQ      *ZEROS
     C                   IF        ((HEDTMO <> *ZEROS) AND (HEDTMO <> *BLANKS))
     C                   IF        HEDTMO2 = *BLANKS
     C                   MOVE      HEDTMOD       WSATADD
     C                   MOVE      HEDTMOM       WSATADM
     C                   MOVE      2000          WSATADÅ
     C                   MOVE      HEDTMOÅ       WSATADÅ
     C                   ELSE
     C                   MOVE      HEDTMO        WSATAD
     C                   END
     C                   END
     C                   END
     C                   IF        HEUR = 'C'
     C                   MOVE      *BLANKS       KFKOD3
     C                   MOVEL     HERFA03       KFKOD3
     C     KOFASTK3      CHAIN     KOFAST                             33
     C   33KOFASTK5      CHAIN     KOFAST                             33
     C                   MOVE      *BLANKS       XTXT            300
     C                   MOVE      KFTXTE        XTXTA             1
     C                   MOVE      ' '           KFTXTE
     C                   MOVEL     KFTXT         XTXT
     C                   CAT       KFTXTE:0      XTXT
     C     KOFASTK4      CHAIN     KOFAST                             33
     C                   IF        *IN33 = *OFF
     C                   MOVE      KFTXTE        XTXTA             1
     C                   MOVE      ' '           KFTXTE
     C                   CAT       KFTXT:0       XTXT
     C                   CAT       KFTXTE:0      XTXT
     C                   ENDIF
     C                   IF        XTXTA = 'A'
     C                   CAT       HERFA08:0     XTXT
     C                   ENDIF

     C                   ELSE

     C                   MOVE      *BLANKS       XTXT
     C                   IF        (HEGN515 = '00000000000')
     C                             OR(HEGN515 = '           ')
     C                   MOVE      *BLANKS       HEGN
     C                   END
     C                   IF        HEGN04 = *BLANKS

      * 4 første av godnr ER IKKE fylt ut   - AWB
     C                   MOVE      *BLANKS       KFKOD3
     C                   MOVEL     HEGN03        KFKOD3
      * sjekk flyselskap / other ( med kofasttype 'WEBETRACK' )
     C     KOFASTK3      CHAIN     KOFAST                             33
     C   33KOFASTK5      CHAIN     KOFAST                             33
     C                   MOVE      *BLANKS       XTXT            300
     C                   MOVE      KFTXTE        XTXTA             1
     C                   MOVE      ' '           KFTXTE
     C                   MOVEL     KFTXT         XTXT
     C                   CAT       KFTXTE:0      XTXT
     C     KOFASTK4      CHAIN     KOFAST                             33
     C                   IF        *IN33 = *OFF
     C                   MOVE      KFTXTE        XTXTA             1
     C                   MOVE      ' '           KFTXTE
     C                   CAT       KFTXT:0       XTXT
     C                   CAT       KFTXTE:0      XTXT
     C                   ENDIF
     C                   IF        XTXTA = 'A'
     C                   CAT       HEGN08:0      XTXT
     C                   ENDIF
     C                   ENDIF

     C                   ENDIF
      * Skal link til kolli-IF vises
     C     DOKUFMKEY     CHAIN     DOKUFM                             33
     C     *IN33         IFEQ      *OFF
     C                   ENDIF
      * Kontaktopplysninger Selger
     C     CUNDL01KS     CHAIN     CUNDL01                            33
     C                   IF        *IN33=*OFF
     C                   EVAL      WSSCONT = KPERS
     C                   EVAL      WSSTLF  = TLF
     C                   EVAL      WSSMAIL = SYEPOS
     C                   EVAL      WHENAS  = KNAVN
     C                   ENDIF
     c                   MOVE      001           FE_DFFBNR
     c                   MOVE      'SH '         FE_N3035
     C     CONTKEY       CHAIN     DOKUFE                             33
     C                   IF        *IN33=*OFF
     C                   eval      WSSCONT   =   FE_C3412
     C                   eval      WSSTLF    =   FE_C3148B
     C                   eval      WSSMAIL   =   FE_C3148E
     C                   EVAL      WSKAKNR = AKNRKU
     C                   ENDIF
N01   * avtalekundenr selger.
N01  c                   If        HEKNSF <> *zeros
N01  c                   move      HEKNSF        KUNDNR
N01  C     CUNDL01K      CHAIN     CUNDL01                            33
N01  c     *in33         ifeq      '0'
N01  C                   EVAL      WSSAKNR = AKNRKU
N01  c                   If        AKNRKU <> *zeros
N01  c                   move      AKNRKU        KUNDNR
N01  C     CUNDL01K      CHAIN     CUNDL01                            33
N01  c     *in33         ifeq      '0'
N01  C                   EVAL      WSSAKNAV = KNAVN
N01  c                   endif
N01  c                   endif
N01  c                   endif
N01  c                   endif
      * Kontaktopplysninger Kjøper
     C     CUNDL01KK     CHAIN     CUNDL01                            33
     C                   IF        *IN33=*OFF
     C                   EVAL      WSKCONT = KPERS
     C                   EVAL      WSKTLF  = TLF
     C                   EVAL      WSKMAIL = SYEPOS
     C                   EVAL      WHENAK  = KNAVN
     C                   ENDIF
     c                   MOVE      001           FE_DFFBNR
     c                   MOVE      'CN '         FE_N3035
     C     CONTKEY       CHAIN     DOKUFE                             33
     C                   IF        *IN33=*OFF
     C                   eval      WSKCONT   =   FE_C3412
     C                   eval      WSKTLF    =   FE_C3148B
     C                   eval      WSKMAIL   =   FE_C3148E
     C                   ENDIF
N01   * avtalekundenr kjøper.
N01  c                   If        HEKNKF <> *zeros
N01  c                   move      HEKNKF        KUNDNR
N01  C     CUNDL01K      CHAIN     CUNDL01                            33
N01  c     *in33         ifeq      '0'
N01  C                   EVAL      WSKAKNR = AKNRKU
N01  c                   If        AKNRKU <> *zeros
N01  c                   move      AKNRKU        KUNDNR
N01  C     CUNDL01K      CHAIN     CUNDL01                            33
N01  c     *in33         ifeq      '0'
N01  C                   EVAL      WSKAKNAV = KNAVN
N01  c                   endif
N01  c                   endif
N01  c                   endif
N01  c                   endif
      * Agentnavn
     C     CUNDL01KA     CHAIN     CUNDL01                            33
     C                   IF        *IN33=*OFF
     C                   EVAL      HENAA=KNAVN
     C                   ENDIF
      * Stedsnavn
     C     WKSDF         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS1
     C     WKSDT         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS2
     C     WKSDFF        CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS3
     C     WKSDVT        CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS4
      * Bookingtid
     C                   EXSR      GETBOO
      *
     C     SLDSPPART     TAG
     C                   ENDSR
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          BEGSR
     C     HEADFK        klist
     C                   kfld                    HEAVD
     C                   kfld                    HEOPD
     C     KOFASTK1      klist
     C                   kfld                    KFTYP1           10
     C                   kfld                    KFKOD
     C                   EVAL      KFTYP1 = 'TRACKPREFI'
     C     KOFASTK2      klist
     C                   kfld                    KFTYP2           10
     C                   kfld                    KFKOD
     C                   EVAL      KFTYP2 = 'TRACKSUFFI'
     C     KOFASTK3      klist
     C                   kfld                    KFTYP3           10
     C                   kfld                    KFKOD3            5
     C                   MOVEL     'WEBETRACK'   KFTYP3
     C     KOFASTK4      klist
     C                   kfld                    KFTYP3
     C                   kfld                    KFKOD4            5
     C                   MOVEL     '   **'       KFKOD4
     C     KOFASTK5      klist
     C                   kfld                    KFTYP3
     C                   kfld                    KFKOD5            5
     C                   MOVEL     'OTHER'       KFKOD5
     C     BrParKey      klist
     C                   kfld                    PABRID
     C                   kfld                    PAKUNR
     C                   kfld                    PAID
     C     ActKey        KLIST
     C                   KFLD                    KFTYPT           10
     C                   KFLD                    KFKOD
     C                   MOVEL     'TRACKT'      KFTYPT
     C     DokufmKey     KLIST
     C                   KFLD                    FMRI
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C     CONTKEY       KLIST
     c                   KFLD                    HEAVD
     c                   KFLD                    HEOPD
     c                   KFLD                    FE_DFFBNR
     c                   KFLD                    FE_N3035
N01  C     CUNDL01K      KLIST
N01  C                   KFLD                    BIFIRM
N01  C                   KFLD                    KUNDNR
     C     CUNDL01KS     KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    HEKNS
     C     CUNDL01KK     KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    HEKNK
     C     CUNDL01KA     KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    HEKNA
     C     TRACKTK       klist
     C                   kfld                    HEAVD
     C                   kfld                    HEOPD
     C                   kfld                    WTXFBNR
     C     WKSDF         KLIST
     C                   KFLD                    HELKA
     C                   KFLD                    HESDF
     C     WKSDT         KLIST
     C                   KFLD                    HETRI
     C                   KFLD                    HESDT
     C     WKSDFF        KLIST
     C                   KFLD                    HELKS
     C                   KFLD                    HESDFF
     C     WKSDVT        KLIST
     C                   KFLD                    HELKK
     C                   KFLD                    HESDVT
     C     KEYTT         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    WTTACTI
     C     *LIKE         DEFINE    TXFBNR        WTXFBNR
     C     *LIKE         DEFINE    TTACTI        WTTACTI
     C                   EVAL      WTXFBNR=*ZEROS
     C                   MOVE      'F'           FMRI
     C                   EVAL      TTACTI='BOO'

     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
      * Ugyldig userID
     C     *IN50         IFEQ      '1'
     C                   close     BRIDF
     C                   EVAL      *INlr = *on
     C                   return
     C                   ENDIF
      * En "standardvariant" libl: CALL bound (INCGI=*MODULE) med parameter.
     C     BILIBL        IFEQ      *BLANKS
     C                   CALLb     'INCGI'
     C                   PARM                    BISTDL
     C                   ELSE
      * Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   CALL      BILIBL
     C                   END
      * Odd/Even/Rowhead-farger,Logobilde,Språk,Intern/Ekstern bruker,  mm
     C                   CALL      'ESGETPAR'
     C                   PARM                    BIBRID
     C                   PARM                    BIFIRM
     C                   PARM                    BIKUNR
     C                   PARM                    BIKNG
     C                   PARM                    RowHead          10
     C                   PARM                    Odd              10
     C                   PARM                    Even             10
     C                   PARM                    LogoImg          50
     C                   PARM                    XSPRÅK            2
     C                   PARM                    XINTERN           1
     C                   PARM                    PARMDS1        1024
     C                   PARM                    PARMDS2        1024
     C                   PARM                    PARMDS3        1024
     C                   MOVE      BIBRID        PABRID
     C                   MOVE      *ZEROS        PAKUNR
     C  N50              OPEN      HEADF
     C  N50              OPEN      FIRM
     C  N50              OPEN      FRISOL01
     C  N50              OPEN      HEAD17
     C  N50              OPEN      KOFAST
     C  N50              OPEN      BRPARF
     C  N50              OPEN      GSSCGL02
     C  N50              OPEN      TRACKT
     C  N50              OPEN      TRACKL08
     C  N50              OPEN      DOKUFM
     C  N50              OPEN      DOKUFE
     C  N50              OPEN      CUNDL01
     C  N50              OPEN      STED2D

      * Initiere DS (obs - pass at ikke verdier tatt inn i parse  nulles)
     C                   MOVE      *ZEROS        WSETAD
     C                   MOVE      *ZEROS        WSETDD
     C                   MOVE      *ZEROS        WSATAD
     C                   MOVE      *ZEROS        WSATDD

     C     BRPARFK       klist
     C                   kfld                    PABRID
     C                   kfld                    PAKUNR
     C                   kfld                    PAID

     C                   EVAL      PABRID = WSUSER

     C                   MOVEL     'NOTES'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   IF        (*IN33 OR
     C                             ((PAVRDA <> 'j') AND
     C                              (PAVRDA <> 'J')))
     C                   MOVE      'N'           XWRKNOTES         1
     C                   ELSE
     C                   MOVE      'J'           XWRKNOTES         1
     C                   END

     C                   MOVEL     'SPRÅK'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   IF        (*IN33 OR (PAVRDA <> 'EN'))
     C                   MOVE      *BLANKS       XSPRÅK            2
     C                   ELSE
     C                   MOVE      'EN'          XSPRÅK            2
     C                   END

     C                   MOVE      *ZEROS        KN
     C                   MOVE      *ZEROS        XN2               3 0
     C                   MOVEL     'KUNGR'       PAID
     C     BRPARFK       CHAIN     BRPARF                             33
     C                   IF        (*IN33 OR (PAVRDA = *BLANKS))
     C                   MOVE      BIKUNR        KN(1)
     C                   ELSE
     C                   MOVEL     PAVRDA        CGCG
     C     CGCG          SETLL     GSSCGL02
     C     CGCG          READE     GSSCGL02                               33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN2
     C                   MOVE      CGCNO         KN(XN2)
     C     CGCG          READE     GSSCGL02                               33
     C                   ENDDO
     C                   END
      * LÅNER ARKTY-PARAMETEREN FOR Å AVGJØRE OM BRUKER KAN SE FAKTURALINK
      * sjekk om arkivtypene fa,fs,fx finnes(på førstelinjer) Hvis ikke, N i se fakturalink
      * (sjekk av arkivtyper for å se pdf-dok, sker generelt annet sted)
     C                   MOVE      'N'           OKFaktLink        1
     C                   MOVE      'ARKTY'       PAID
     C     BrParKey      CHAIN     BRPARF                             33
     C     *IN33         IFEQ      '0'
     C     'fa'          scan      Pavrda                                 33
     C  N33'fs'          scan      Pavrda                                 33
     C  N33'fx'          scan      Pavrda                                 33
     C   33              MOVE      'J'           OKFaktLink
     C                   END
      * logikk ved eksternref i parameterstreng
     C     EXTREF        IFNE      *BLANKS
     C     HEAVD         ANDEQ     0
     C     HEOPD         ANDEQ     0
     C                   MOVE      'EXTRE'       PAID
     C     BrParKey      CHAIN     BRPARF                             33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     PAVRDA        FSKODE
     C                   EXSR      finnopd
     C                   ELSE
     C                   EXSR      finnopdh
     C                   END
     C                   END

     C     BIFIRM        CHAIN     FIRM                               33

     C                   ENDSR
      ****************************************************************************
     C     FINNOPD       BEGSR
      ****************************************************************************
     C     FRIHEAD       KLIST
     C                   KFLD                    FSAVD
     C                   KFLD                    FSOPD
     C     FRIKEY0       KLIST
     C                   KFLD                    FSKODE
     C                   KFLD                    FSSOK
     C                   KFLD                    FSDTOP
     C     FRIKEY1       KLIST
     C                   KFLD                    FSKODE
     C                   KFLD                    FSSOK
     C                   EVAL      FSSOK  = EXTREF
     C                   EVAL      FSDTOP = 99999999
     C     FRIKEY0       SETGT     FRISOL01
     C                   setoff                                       33
     C     *IN33         doweq     '0'
     C     FRIKEY1       readpe    FRISOL01                               33
     C     *IN33         IFEQ      '0'
     C     FRIHEAD       CHAIN     HEADF                              34
     C     *IN34         IFEQ      '0'
     C     HEKNA         IFEQ      BIKUNR
     C     TRKNFA        OREQ      BIKUNR
     C                   MOVE      heavd         wsavd
     C                   MOVE      heopd         wsopd
     C                   GOTO      UTFRI
     C                   END
     C                   END
     C                   END
     C                   END
     C                   Z-ADD     0             heavd
     C                   Z-ADD     0             heopd
     C     UTFRI         ENDSR
      ****************************************************************************
     C     FINNOPDH      BEGSR
      ****************************************************************************
     C     H17KEY        KLIST
     C                   KFLD                    HERFA
     C                   EVAL      HERFA  = EXTREF
     C     H17KEY        SETGT     HEAD17
     C                   setoff                                       33
     C     *IN33         doweq     '0'
     C     H17KEY        readpe    HEAD17                                 33
     C     *IN33         IFEQ      '0'
     C     HEKNA         ANDEQ     BIKUNR
     C                   MOVE      heavd         wsavd
     C                   MOVE      heopd         wsopd
     C                   GOTO      UTH17
     C                   END
     C                   END
     C                   Z-ADD     0             heavd
     C                   Z-ADD     0             heopd
     C     UTH17         ENDSR
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          BEGSR
     C                   close     BRIDF
     C  N50              close     HEADF
     C  N50              CLOSE     FIRM
     C  N50              CLOSE     FRISOL01
     C  N50              CLOSE     HEAD17
     C  N50              CLOSE     KOFAST
     C  N50              close     BRPARF
     C  N50              CLOSE     GSSCGL02
     C  N50              CLOSE     TRACKT
     C  N50              CLOSE     TRACKL08
     C  N50              CLOSE     DOKUFM
     C  N50              CLOSE     DOKUFE
     C  N50              CLOSE     CUNDL01
     C  N50              CLOSE     STED2D
     C                   CALLP     wrtsection('*fini')
     C                   EVAL      *INlr = *on

     C                   ENDSR
      *______________________________________________
      * Hent bookingtid                        GETBOO
      *""""""""""""""""""""""""""""""""""""""""""""""
     C     GETBOO        BEGSR

     C                   MOVE      'BOO'         WTTACTI
     C     KEYTT         CHAIN     TRACKL08                           33
     C     *IN33         IFEQ      '0'
     c                   movel     TTTIME        WSBOTM
     c                   move      TTDATE        HEBODT
     C                   ELSE
      * hvis ikke finnes ta opprettelsesdato
     C                   MOVE      'STR'         WTTACTI
     C     KEYTT         CHAIN     TRACKL08                           33
     C  N33              MOVE      TTDATE        HEBODT
     C  N33              move      1200          wsbotm
      * ikke opprettelsesdate ta forfraktdate/fra dato
     c     *in33         ifeq      '1'
     c     trsffd        ifne      *zeros
     c                   move      trsffd        hebodt
     c                   move      trsffk        wsbotm
     c                   else
     c                   move      trsdfd        hebodt
     c                   move      trsdfk        wsbotm
     c                   ENDIF
     c                   ENDIF
     c                   ENDIF

     C                   ENDSR
