      *********************************************************************
      * Hen ett oppdrags data - Kun hovedopplysninger i dette programet. (se lenger ned for resten)
      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TJEOPD5L MODULE(*LIBL/TJEOPD5L *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      * For repeterbar informasjon finnes egne programer:
      * TJGE11R     RPGLE       TomCat/JSON Oppdragsfritekst liste (kun A, 1)
      * TJGE12R     RPGLE       TomCat/JSON Oppdragsdokumenter
      * TJGE13R     RPGLE       TomCat/JSON Oppdragsfakturar (arkivlenker)
      * TJGE14R     RPGLE       TomCat/JSON OppdragsFrie søkeveier
      * TJGE15R     RPGLE       TomCat/JSON Oppdrags T&T
      * TJGE25R     RPGLE       TomCat/JSON Oppdragsfakturar (arbeide med/se på)
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 JOV PTF11 Div nye felt
11XXX * 02 JOV PTF11 K-pers  - IKKE hent far kunde
********************************************************************
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FHEADF     IF   E           K DISK    USROPN
     FFIRM      IF   E           K DISK    USROPN
     FTRACKT    IF   E           K DISK    USROPN
     FTRACKL08  IF   E           K DISK    USROPN
     FDOKUF     IF   E           K DISK    USROPN
     FDOKUFE    IF   E           K DISK    USROPN
     FCUNDL01   IF   E           K DISK    USROPN
     FSTED2D    IF   E           K DISK    USROPN
     FAVSLUTF   IF   E           K DISK    USROPN
     FAVSLUTL2  IF   E           K DISK    USROPN
     F                                     RENAME(AVSLUTFR:AVSLTURR)
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
      * Variables received from the input string
     D LNG             s              2
     D WSUSER          S             10
     D WSNA            S             30
     D DIR             s              1
     D WSAVD           S              4
     D WSOPD           S              7
     D EXTREF          S             35
     D Error           S            150
     D JSONstring      s          64000
     D WSSCONT         S             30
     D WSSTLF          S             30
     D WSSMAIL         S             70
     D WSKCONT         S             30
     D WSKTLF          S             30
     D WSKMAIL         S             70
N01  D WSSAKNR         S              8  0
N01  D WSSAKNAV        S             30
N01  D WSKAKNR         S              8  0
     D WSKAKNAV        S             30
     D*WSETDK          S              4  0
     D*WSATDK          S              4  0
     D*WSETAK          S              4  0
     D*WSATAK          S              4  0
     D WSETDK          S              4
     D WSATDK          S              4
     D WSETAK          S              4
     D WSATAK          S              4
     D WHENAS          S             30
     D WHENAK          S             30
     D WPPNS1          S             30
     D WPPNS2          S             30
     D WPPNS3          S             30
     D WPPNS4          S             30
     D HEBODT          S              8  0
     D WSBOTM          S              4  0

     D                 DS
     D  DSAVOP                 1     12
     D  DSAVD                  1      4
     D  Strek                  5      5
     D  DSOPD                  6     12
     D  DSOPD5                 6     10
     D                 DS
     D  WSATAD                 1      8  0
     D  WSATADÅ                1      4  0
     D  WSATADM                5      6  0
     D  WSATADD                7      8  0
     D                 DS
     D  WSATDD                 1      8  0
     D  WSATDDÅ                1      4  0
     D  WSATDDM                5      6  0
     D  WSATDDD                7      8  0
     D                 DS
     D  WSETAD                 1      8  0
     D  WSETADÅ                1      4  0
     D  WSETADM                5      6  0
     D  WSETADD                7      8  0
     D                 DS
     D  WSETDD                 1      8  0
     D  WSETDDÅ                1      4  0
     D  WSETDDM                5      6  0
     D  WSETDDD                7      8  0
      * For xlate mellom Upper Case og Lower Case
     D UC              C                   CONST('ABCDEFGHIJKLMNOPQRST-
     D                                     UVWXYZÆØÅ')
     D LC              C                   CONST('abcdefghijklmnopqrst-
     D                                     uvwxyzæøå')
      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3
      * Parse input
     C                   EXSR      Parse
      * Open files etc
     C                   EXSR      INIT
     C                   EXSR      TEST
      *
     C                   CALLP     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   CALLP     wrtsection('top')
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬lng¬ : ¬'+%trim(LNG)+'¬, '
        +'¬wsna¬ : ¬'+%trim(WSNA)+'¬, '
        +'¬kunde¬ : ¬'+%trim(%editc(BIKUNR:'Z'))+'¬, '
        +'¬sdato¬ : ¬'+%trim(%editc(BIDTV:'Z'))+'¬, '
        +'¬stid¬ : ¬'+%trim(%editc(BITIDV:'Z'))+'¬, '
        +'¬wsavd¬ : ¬'+%trim(WSAVD)+'¬, '
        +'¬wsopd¬ : ¬'+%trim(WSOPD)+'¬, '
        +'¬dir¬ : ¬'+%trim(DIR)+'¬, '
        +'¬extref¬ : ¬'+%trim(EXTREF)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     C                   CALL      'JSONFIX'
     C                   PARM                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')

      * Skriv JSON-LISTE Start
     C                   EVAL      JSONstring ='"dspoppdrag" : ['
     C                   CALLP     UPdHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      * Hent oppdrag
     C                   EXSR      GetInfo
     C                   if        Error=*blanks
      /free
          JSONstring=*BLANKS;
       JSONstring=%trim(JSONstring)+'{'
        +'¬heur¬ : ¬'+%trim(HEUR)+'¬, '
        +'¬fitdvi¬ : ¬'+%trim(FITDVI)+'¬, '
        +'¬heavd¬ : ¬'+%trim(%editc(HEAVD:'Z'))+'¬, '
        +'¬heopd¬ : ¬'+%trim(%editc(HEOPD:'Z'))+'¬, '
        +'¬hesg¬ : ¬'+%trim(HESG)+'¬, '
        +'¬hedtop¬ : ¬'+%trim(%editc(HEDTOP:'Z'))+'¬, '
        +'¬hedtr¬ : ¬'+%trim(%editc(HEDTR:'Z'))+'¬, '
        +'¬hesdff¬ : ¬'+%trim(HESDFF)+'¬, '
        +'¬hesdf¬ : ¬'+%trim(HESDF)+'¬, '
        +'¬hesdt¬ : ¬'+%trim(HESDT)+'¬, '
        +'¬hesdvt¬ : ¬'+%trim(HESDVT)+'¬, '
        +'¬wsetdd¬ : ¬'+%trim(%editc(WSETDD:'Z'))+'¬, '
        //+'¬wsetdk¬ : ¬'+%trim(%editc(WSETDK:'Z'))+'¬, '
        +'¬wsetdk¬ : ¬'+%trim(WSETDK)+'¬, '
        +'¬wsatdd¬ : ¬'+%trim(%editc(WSATDD:'Z'))+'¬, '
        //+'¬wsatdk¬ : ¬'+%trim(%editc(WSATDK:'Z'))+'¬, '
        +'¬wsatdk¬ : ¬'+%trim(WSATDK)+'¬, '
        +'¬wsetad¬ : ¬'+%trim(%editc(WSETAD:'Z'))+'¬, '
        //+'¬wsetak¬ : ¬'+%trim(%editc(WSETAK:'Z'))+'¬, '
        +'¬wsetak¬ : ¬'+%trim(WSETAK)+'¬, '
        +'¬wsatad¬ : ¬'+%trim(%editc(WSATAD:'Z'))+'¬, '
        //+'¬wsatak¬ : ¬'+%trim(%editc(WSATAK:'Z'))+'¬, '
        +'¬wsatak¬ : ¬'+%trim(WSATAK)+'¬, '
        +'¬hegn¬ : ¬'+%trim(HEGN)+'¬, '
        +'¬hegnn¬ : ¬'+%trim(HEGNN)+'¬, '
        +'¬hepro¬ : ¬'+%trim(%editc(HEPRO:'Z'))+'¬, '
        +'¬heplan¬ : ¬'+%trim(HEPLAN)+'¬, '
        +'¬trrund¬ : ¬'+%trim(%editc(TRRUND:'Z'))+'¬, '
        +'¬hepos1¬ : ¬'+%trim(HEPOS1)+'¬, '
        +'¬hepos2¬ : ¬'+%trim(%editc(HEPOS2:'Z'))+'¬, '
        +'¬trknfa¬ : ¬'+%trim(%editc(TRKNFA:'Z'))+'¬, '
        +'¬henao¬ : ¬'+%trim(HENAO)+'¬, '
        +'¬hekna¬ : ¬'+%trim(%editc(HEKNA:'Z'))+'¬, '
        +'¬henaa¬ : ¬'+%trim(HENAA)+'¬, '
        +'¬herfa¬ : ¬'+%trim(HERFA)+'¬, '
        +'¬hesaml¬ : ¬'+%trim(HESAML)+'¬, '
        +'¬hehawb¬ : ¬'+%trim(HEHAWB)+'¬, '
        +'¬hesdla¬ : ¬'+%trim(HESDLA)+'¬, '
        +'¬hesdl¬ : ¬'+%trim(HESDL)+'¬, '
        +'¬hevalt¬ : ¬'+%trim(HEVALT)+'¬, '
        +'¬hevalp¬ : ¬'+%trim(%editc(HEVALP:'4'))+'¬, '
        +'¬heknt¬ : ¬'+%trim(%editc(HEKNT:'Z'))+'¬, '
        +'¬helka¬ : ¬'+%trim(HELKA)+'¬, '
        +'¬whenas¬ : ¬'+%trim(WHENAS)+'¬, '
        +'¬hekns¬ : ¬'+%trim(%editc(HEKNS:'Z'))+'¬, '
        +'¬henas¬ : ¬'+%trim(HENAS)+'¬, '
        +'¬heads1¬ : ¬'+%trim(HEADS1)+'¬, '
        +'¬heads2¬ : ¬'+%trim(HEADS2)+'¬, '
        +'¬hepns¬ : ¬'+%trim(HEPNS)+'¬, '
        +'¬heads3¬ : ¬'+%trim(HEADS3)+'¬, '
-----   +'¬helks¬ : ¬'+%trim(HELKS)+'¬, '
-----   +'¬wsscont¬ : ¬'+%trim(WSSCONT)+'¬, '
-----   +'¬wsstlf¬ : ¬'+%trim(WSSTLF)+'¬, '
-----   +'¬wssmail¬ : ¬'+%trim(WSSMAIL)+'¬, '
        +'¬heknh¬ : ¬'+%trim(%editc(HEKNH:'Z'))+'¬, '
-----   +'¬henah¬ : ¬'+%trim(HENAH)+'¬, '
        +'¬headh1¬ : ¬'+%trim(HEADH1)+'¬, '
        +'¬headh2¬ : ¬'+%trim(HEADH2)+'¬, '
        +'¬hepnh¬ : ¬'+%trim(HEPNH)+'¬, '
        +'¬headh3¬ : ¬'+%trim(HEADH3)+'¬, '
        +'¬helkh¬ : ¬'+%trim(HELKH)+'¬, '
        +'¬hehbre¬ : ¬'+%trim(%editc(HEHBRE:'4'))+'¬, '
        +'¬hehlen¬ : ¬'+%trim(%editc(HEHLEN:'4'))+'¬, '
        +'¬hehblk¬ : ¬'+%trim(HEHBLK)+'¬, '
        +'¬hekdfs¬ : ¬'+%trim(HEKDFS)+'¬, '
        +'¬hevals¬ : ¬'+%trim(HEVALS)+'¬, '
        +'¬heknsf¬ : ¬'+%trim(%editc(HEKNSF:'Z'))+'¬, '
        +'¬heans¬ : ¬'+%trim(%editc(HEANS:'Z'))+'¬, '
        +'¬henasf¬ : ¬'+%trim(HENASF)+'¬, '
N01     +'¬avtknrs¬ : ¬'+%trim(%editc(WSSAKNR:'Z'))+'¬, '
N01     +'¬avtknavs¬ : ¬'+%trim(WSSAKNAV)+'¬, '
        +'¬whenak¬ : ¬'+%trim(WHENAK)+'¬, '
        +'¬heknk¬ : ¬'+%trim(%editc(HEKNK:'Z'))+'¬, '
        +'¬henak¬ : ¬'+%trim(HENAK)+'¬, '
        +'¬headk1¬ : ¬'+%trim(HEADK1)+'¬, '
        +'¬headk2¬ : ¬'+%trim(HEADK2)+'¬, '
        +'¬hepnk¬ : ¬'+%trim(HEPNK)+'¬, '
        +'¬headk3¬ : ¬'+%trim(HEADK3)+'¬, '
        +'¬helkk¬ : ¬'+%trim(HELKK)+'¬, '
-----   +'¬wskcont¬ : ¬'+%trim(WSKCONT)+'¬, '
-----   +'¬wsktlf¬ : ¬'+%trim(WSKTLF)+'¬, '
-----   +'¬wskmail¬ : ¬'+%trim(WSKMAIL)+'¬, '
        +'¬heknl¬ : ¬'+%trim(%editc(HEKNL:'Z'))+'¬, '
        +'¬henal¬ : ¬'+%trim(HENAL)+'¬, '
        +'¬headl1¬ : ¬'+%trim(HEADL1)+'¬, '
        +'¬headl2¬ : ¬'+%trim(HEADL2)+'¬, '
        +'¬hepnl¬ : ¬'+%trim(HEPNL)+'¬, '
        +'¬headl3¬ : ¬'+%trim(HEADL3)+'¬, '
        +'¬helkl¬ : ¬'+%trim(HELKL)+'¬, '
        +'¬helbre¬ : ¬'+%trim(%editc(HELBRE:'4'))+'¬, '
        +'¬hellen¬ : ¬'+%trim(%editc(HELLEN:'4'))+'¬, '
        +'¬helblk¬ : ¬'+%trim(HELBLK)+'¬, '
        +'¬hekdfk¬ : ¬'+%trim(HEKDFK)+'¬, '
        +'¬hevalk¬ : ¬'+%trim(HEVALK)+'¬, '
        +'¬heknkf¬ : ¬'+%trim(%editc(HEKNKF:'Z'))+'¬, '
        +'¬heank¬ : ¬'+%trim(%editc(HEANK:'Z'))+'¬, '
        +'¬henakf¬ : ¬'+%trim(HENAKF)+'¬, '
N01     +'¬avtknrk¬ : ¬'+%trim(%editc(WSKAKNR:'Z'))+'¬, '
N01     +'¬avtknavk¬ : ¬'+%trim(WSKAKNAV)+'¬, '
        +'¬heot¬ : ¬'+%trim(HEOT)+'¬, '
        +'¬hekdpl¬ : ¬'+%trim(HEKDPL)+'¬, '
        +'¬hefr¬ : ¬'+%trim(HEFR)+'¬, '
        +'¬hent¬ : ¬'+%trim(%editc(HENT:'Z'))+'¬, '
        +'¬hevs1¬ : ¬'+%trim(HEVS1)+'¬, '
        +'¬hevs2¬ : ¬'+%trim(HEVS2)+'¬, '
        +'¬hegm1¬ : ¬'+%trim(HEGM1)+'¬, '
        +'¬hegm2¬ : ¬'+%trim(HEGM2)+'¬, '
        +'¬hevkt¬ : ¬'+%trim(%editc(HEVKT:'4'))+'¬, '
        +'¬helm¬ : ¬'+%trim(%editc(HELM:'4'))+'¬, '
        +'¬hem3¬ : ¬'+%trim(%editc(HEM3:'4'))+'¬, '
        +'¬hefbv¬ : ¬'+%trim(%editc(HEFBV:'4'))+'¬, '
        +'¬hekf¬ : ¬'+%trim(HEKF)+'¬, '
        +'¬hekft1¬ : ¬'+%trim(HEKFT1)+'¬, '
        +'¬heft1¬ : ¬'+%trim(HEFT1)+'¬, '
        +'¬hedtcp¬ : ¬'+%trim(%editc(HEDTCP:'Z'))+'¬, '
        +'¬hedtap¬ : ¬'+%trim(%editc(HEDTÅP:'Z'))+'¬, '
        +'¬hedtmp¬ : ¬'+%trim(%editc(HEDTMP:'Z'))+'¬, '
        +'¬hekdkk¬ : ¬'+%trim(HEKDKK)+'¬, '
        +'¬hefngk¬ : ¬'+%trim(%editc(HEFNGK:'Z'))+'¬, '
        +'¬hefngs¬ : ¬'+%trim(%editc(HEFNGS:'Z'))+'¬, '
        +'¬hekdtm¬ : ¬'+%trim(HEKDTM)+'¬, '
        +'¬hetrm¬ : ¬'+%trim(%editc(HETRM:'Z'))+'¬, '
        +'¬hetri¬ : ¬'+%trim(HETRI)+'¬, '
        +'¬hetrc¬ : ¬'+%trim(%editc(HETRC:'Z'))+'¬, '
        +'¬hetrcn¬ : ¬'+%trim(HETRCN)+'¬, '
        +'¬hefbk¬ : ¬'+%trim(%editc(HEFBK:'4'))+'¬, '
        +'¬hetle¬ : ¬'+%trim(HETLE)+'¬, '
        +'¬hetll¬ : ¬'+%trim(HETLL)+'¬, '
        +'¬hetlku¬ : ¬'+%trim(HETLKU)+'¬, '
        +'¬hentvs¬ : ¬'+%trim(%editc(HENTVS:'Z'))+'¬, '
        +'¬hevn¬ : ¬'+%trim(%editc(HEVN:'Z'))+'¬, '
        +'¬hentf¬ : ¬'+%trim(%editc(HENTF:'Z'))+'¬, '
        +'¬hebelt¬ : ¬'+%trim(%editc(HEBELT:'4'))+'¬, '
        +'¬hebelm¬ : ¬'+%trim(%editc(HEBELM:'4'))+'¬, '
        +'¬hesgm¬ : ¬'+%trim(HESGM)+'¬, '
        +'¬hedtmo¬ : ¬'+%trim(HEDTMO)+'¬, '
        +'¬heklmo¬ : ¬'+%trim(%editc(HEKLMO:'Z'))+'¬, '
        +'¬hepk1¬ : ¬'+%trim(HEPK1)+'¬, '       //Fraktbrev
        +'¬dftoll¬ : ¬'+%trim(WSTOLL)+'¬, '     //tollsted
        +'¬dftran¬ : ¬'+%trim(%editc(DFTRAN:'Z'))+'¬, '  // Transp
        +'¬dfkdme¬ : ¬'+%trim(DFKDME)+'¬, '     //labelko
        +'¬hepk2¬ : ¬'+%trim(HEPK2)+'¬, '
        +'¬hepk3¬ : ¬'+%trim(HEPK3)+'¬, '
        +'¬hepk4¬ : ¬'+%trim(HEPK4)+'¬, '
        +'¬hepk5¬ : ¬'+%trim(HEPK5)+'¬, '
        +'¬hepk6¬ : ¬'+%trim(HEPK6)+'¬, '
        +'¬hepk7¬ : ¬'+%trim(HEPK7)+'¬, '
        +'¬hepk8¬ : ¬'+%trim(HEPK8)+'¬, '
        +'¬hepk9¬ : ¬'+%trim(HEPK9)+'¬, '
        +'¬hekdl¬ : ¬'+%trim(HEKDL)+'¬, '
        +'¬helb¬ : ¬'+%trim(HELB)+'¬, '
        +'¬helkfr¬ : ¬'+%trim(HELKFR)+'¬, '
        +'¬hesdfr¬ : ¬'+%trim(HESDFR)+'¬, '
        +'¬hestfr¬ : ¬'+%trim(HESTFR)+'¬, '
        +'¬herfk¬ : ¬'+%trim(HERFK)+'¬, '
        +'¬trslag¬ : ¬'+%trim(TRSLAG)+'¬, '
        +'¬travd0¬ : ¬'+%trim(%editc(TRAVD0:'Z'))+'¬, '
        +'¬tropd0¬ : ¬'+%trim(%editc(TROPD0:'Z'))+'¬, '
        +'¬travd1¬ : ¬'+%trim(%editc(TRAVD1:'Z'))+'¬, '
        +'¬tropd1¬ : ¬'+%trim(%editc(TROPD1:'Z'))+'¬, '
        +'¬travd2¬ : ¬'+%trim(%editc(TRAVD2:'Z'))+'¬, '
        +'¬tropd2¬ : ¬'+%trim(%editc(TROPD2:'Z'))+'¬, '
        +'¬trsffd¬ : ¬'+%trim(%editc(TRSFFD:'Z'))+'¬, '
        //+'¬trsffk¬ : ¬'+%trim(%editc(TRSFFK:'Z'))+'¬, '
        +'¬trsffk¬ : ¬'+%trim(TASFFK)+'¬, '
        +'¬trsdfd¬ : ¬'+%trim(%editc(TRSDFD:'Z'))+'¬, '
        //+'¬trsdfk¬ : ¬'+%trim(%editc(TRSDFK:'Z'))+'¬, '
        +'¬trsdfk¬ : ¬'+%trim(TASDFK)+'¬, '
        +'¬trsdtd¬ : ¬'+%trim(%editc(TRSDTD:'Z'))+'¬, '
        //+'¬trsdtk¬ : ¬'+%trim(%editc(TRSDTK:'Z'))+'¬, '
        +'¬trsdtk¬ : ¬'+%trim(TASDTK)+'¬, '
        +'¬trsvtd¬ : ¬'+%trim(%editc(TRSVTD:'Z'))+'¬, '
        //+'¬trsvtk¬ : ¬'+%trim(%editc(TRSVTK:'Z'))+'¬, '
        +'¬trsvtk¬ : ¬'+%trim(TASVTK)+'¬, '
        +'¬trkdak¬ : ¬'+%trim(TRKDAK)+'¬, '
        +'¬trkdff¬ : ¬'+%trim(TRKDFF)+'¬, '
        +'¬trverv¬ : ¬'+%trim(TRVERV)+'¬, '
        +'¬trverb¬ : ¬'+%trim(%editc(TRVERB:'Z'))+'¬, '
        +'¬trettv¬ : ¬'+%trim(TRETTV)+'¬, '
        +'¬trettb¬ : ¬'+%trim(%editc(TRETTB:'Z'))+'¬, '
        +'¬trfrak¬ : ¬'+%trim(TRFRAK)+'¬, '
        +'¬trfrav¬ : ¬'+%trim(TRFRAV)+'¬, '
        +'¬trfrab¬ : ¬'+%trim(%editc(TRFRAB:'4'))+'¬, '
        +'¬trmva¬ : ¬'+%trim(TRMVA)+'¬, '
        +'¬trfa11¬ : ¬'+%trim(TRFA11)+'¬, '
        +'¬trfa12¬ : ¬'+%trim(TRFA12)+'¬, '
        +'¬trflP1¬ : ¬'+%trim(%editc(TRFLP1:'Z'))+'¬, '
        +'¬trfa21¬ : ¬'+%trim(TRFA21)+'¬, '
        +'¬trfa22¬ : ¬'+%trim(TRFA22)+'¬, '
        +'¬trflp2¬ : ¬'+%trim(%editc(TRFLP2:'Z'))+'¬, '
        +'¬trtsta¬ : ¬'+%trim(TRTSTA)+'¬, '
        +'¬trstaf¬ : ¬'+%trim(TRSTAF)+'¬, '
        +'¬trstae¬ : ¬'+%trim(TRSTAE)+'¬, '
        +'¬trsta1¬ : ¬'+%trim(TRSTA1)+'¬, '
        +'¬trsta2¬ : ¬'+%trim(TRSTA2)+'¬, '
        +'¬trsta3¬ : ¬'+%trim(TRSTA3)+'¬, '
        +'¬trsta4¬ : ¬'+%trim(TRSTA4)+'¬, '
        +'¬trkm¬ : ¬'+%trim(%editc(TRKM:'Z'))+'¬, '
        +'¬he01¬ : ¬'+%trim(HE01)+'¬, '
        +'¬hestd¬ : ¬'+%trim(%editc(HESTD:'Z'))+'¬, '
        +'¬hxsndn¬ : ¬'+%trim(HXSNDN)+'¬, '
        +'¬hxpall¬ : ¬'+%trim(%editc(HXPALL:'Z'))+'¬, '
        +'¬hxblgk¬ : ¬'+%trim(HXBLGK)+'¬, '
        +'¬hxLkod¬ : ¬'+%trim(HXLKOD)+'¬, '
        +'¬hxllst¬ : ¬'+%trim(HXLLST)+'¬, '
        +'¬hxedik¬ : ¬'+%trim(HXEDIK)+'¬, '
        +'¬hxteri¬ : ¬'+%trim(HXTERI)+'¬, '
S01     +'¬hehakn¬ : ¬'+%trim(%editc(HEHAKN:'Z'))+'¬, '
S01     +'¬hehaan¬ : ¬'+%trim(%editc(HEHAAN:'Z'))+'¬, '
        +'¬helakn¬ : ¬'+%trim(%editc(HELAKN:'Z'))+'¬, '
        +'¬helaan¬ : ¬'+%trim(%editc(HELAAN:'Z'))+'¬, '
        +'¬helmla¬ : ¬'+%trim(%editc(HELMLA:'4'))+'¬, '
        +'¬hepoen¬ : ¬'+%trim(%editc(HEPOEN:'Z'))+'¬, '
        +'¬hestl1¬ : ¬'+%trim(HESTL1)+'¬, '
        +'¬hestl2¬ : ¬'+%trim(HESTL2)+'¬, '
        +'¬hestl3¬ : ¬'+%trim(HESTL3)+'¬, '
        +'¬hestl4¬ : ¬'+%trim(HESTL4)+'¬, '
        +'¬hestn1¬ : ¬'+%trim(HESTN1)+'¬, '
        +'¬hestn2¬ : ¬'+%trim(HESTN2)+'¬, '
        +'¬hestn3¬ : ¬'+%trim(HESTN3)+'¬, '
        +'¬hestn4¬ : ¬'+%trim(HESTN4)+'¬, '
        +'¬hestn5¬ : ¬'+%trim(HESTN5)+'¬, '
        +'¬hestn6¬ : ¬'+%trim(HESTN6)+'¬, '
        +'¬hestn7¬ : ¬'+%trim(HESTN7)+'¬, '
        +'¬hestn8¬ : ¬'+%trim(HESTN8)+'¬, '
        +'¬hestn9¬ : ¬'+%trim(HESTN9)+'¬, '
        +'¬herfed¬ : ¬'+%trim(HERFED)+'¬, '
        +'¬helib¬ : ¬'+%trim(HELIB)+'¬, '
        +'¬hefile¬ : ¬'+%trim(HEFILE)+'¬, '
        +'¬hembr¬ : ¬'+%trim(HEMBR)+'¬, '
        +'¬hetype¬ : ¬'+%trim(HETYPE)+'¬, '
        +'¬helvl¬ : ¬'+%trim(HELVL)+'¬, '
        +'¬hesnn¬ : ¬'+%trim(%editc(HESNN:'Z'))+'¬, '
        +'¬heunik¬ : ¬'+%trim(%editc(HEUNIK:'Z'))+'¬, '
        +'¬hereff¬ : ¬'+%trim(HEREFF)+'¬, '
        +'¬wppns1¬ : ¬'+%trim(WPPNS1)+'¬, '
        +'¬wppns2¬ : ¬'+%trim(WPPNS2)+'¬, '
        +'¬wppns3¬ : ¬'+%trim(WPPNS3)+'¬, '
        +'¬wppns4¬ : ¬'+%trim(WPPNS4)+'¬, '
        +'¬hebodt¬ : ¬'+%trim(%editc(HEBODT:'Z'))+'¬, '
        //+'¬wsbotm¬ : ¬'+%trim(%editc(WSBOTM:'Z'))+'¬, '
        +'¬wsbotm¬ : ¬'+%trim(WABOTM)+'¬, '
        +'¬hesgm¬ : ¬'+%trim(HESGM)+'¬}';
      /end-free
     C                   CALL      'JSONFIX'
     C                   PARM                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      *
     C                   ENDIF                                                  END error blank
      * Skriv JSON-Liste/Array  Avslutning
     C                   EVAL      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')
      * Skriv JSON-string Avsluttning
     C                   EVAL      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%ADDr(JSONstring)
     C                                         :%len(JSONstring))
     C                   CALLP     wrtsection('JSONlin')

     C     SLUTT         TAG
     C                   EXSR      EXIT
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         BEGSR
     C                   EVAL      LNG     = zhbgetvar('LNG')
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C     LC:UC         XLATE     WSUSER        WSUSER
     C                   EVAL      WSAVD   = zhbgetvar('HEAVD')
     C                   EVAL      HEAVD = c2n2(WSAVD)
     C                   EVAL      WSOPD   = zhbgetvar('HEOPD')
     C                   EVAL      HEOPD = c2n2(WSOPD)

     C                   ENDSR
      *=====================================================================******
      *  Display Product codes to select from
      *=====================================================================******
     C     GetInfo       BEGSR
     C     HEADFK        CHAIN     TRACKT                             33
     C  N33              MOVE      TXETAD        WSETAD
     C  N33              MOVE      TXETDD        WSETDD
     C  N33              MOVE      TXATAD        WSATAD
     C  N33              MOVE      TXATDD        WSATDD
     C  N33              MOVE      TXETDK        WSETDK
     C  N33              MOVE      TXETAK        WSETAK
     C  N33              MOVE      TXATDK        WSATDK
     C  N33              MOVE      TXATAK        WSATAK
     c                   if        WSETDK=*zeros
     C                   MOVE      *blanks       WSETDK
     C                   endif
     c                   if        WSETAK=*zeros
     C                   MOVE      *blanks       WSETAK
     C                   endif
     c                   if        WSATDK=*zeros
     C                   MOVE      *blanks       WSATDK
     C                   endif
     c                   if        WSATAK=*zeros
     C                   MOVE      *blanks       WSATAK
     C                   endif
      *
     c                   move      TRSFFK        TASFFK            4
     c                   move      TRSDFK        TASDFK            4
     c                   move      TRSDTK        TASDTK            4
     c                   move      TRSVTK        TASVTK            4
     c                   if        TRSFFK=*zeros
     C                   MOVE      *blanks       TASFFK
     C                   endif
     c                   if        TRSDFK=*zeros
     C                   MOVE      *blanks       TASDFK
     C                   endif
     c                   if        TRSDTK=*zeros
     C                   MOVE      *blanks       TASDTK
     C                   endif
     c                   if        TRSVTK=*zeros
     C                   MOVE      *blanks       TASVTK
     C                   endif
      *
     C     DOKUFKey      CHAIN     DOKUF                              33
     c                   if        DFTOLL=*zeros
     c                   move      *blanks       WSTOLL            4
     c                   else
     c                   move      DFTOLL        WSTOLL
     c                   endif
      * Kontaktopplysninger Selger
     c                   MOVE      001           FE_DFFBNR
     c                   MOVE      'SH '         FE_N3035
     C     CONTKEY       CHAIN     DOKUFE                             33
N02  c   33              MOVE      'CZ '         FE_N3035
N02  C   33CONTKEY       CHAIN     DOKUFE                             33
     C                   IF        *IN33=*OFF
     C                   eval      WSSCONT   =   FE_C3412
     C                   eval      WSSTLF    =   FE_C3148B
     C                   eval      WSSMAIL   =   FE_C3148E
     C                   ELSE
N02   * å hente K-pers reff fra kunde er egentlig en nortrail-spesial..
N02   * framtidig løsnin kabn v're parameter på KpersKode - foreløpig hardkodet
N02  c     KpersKode     ifeq      '-MAIN-'
     C     CUNDL01KS     CHAIN     CUNDL01                            33
     C                   IF        *IN33=*OFF
     C                   EVAL      WSSCONT = KPERS
     C                   EVAL      WSSTLF  = TLF
     C                   EVAL      WSSMAIL = SYEPOS
     C                   ENDIF
N02  c                   endif
     C                   ENDIF
      * Kontaktopplysninger Kjøper
     c                   MOVE      001           FE_DFFBNR
     c                   MOVE      'CN '         FE_N3035
     C     CONTKEY       CHAIN     DOKUFE                             33
N02  c   33              MOVE      'DP '         FE_N3035
N02  C   33CONTKEY       CHAIN     DOKUFE                             33
     C                   IF        *IN33=*OFF
     C                   eval      WSKCONT   =   FE_C3412
     C                   eval      WSKTLF    =   FE_C3148B
     C                   eval      WSKMAIL   =   FE_C3148E
     C                   ELSE
N02   * å hente K-pers reff fra kunde er egentlig en nortrail-spesial..
N02   * framtidig løsnin kabn v're parameter på KpersKode - foreløpig hardkodet
N02  c     KpersKode     ifeq      '-MAIN-'
     C     CUNDL01KK     CHAIN     CUNDL01                            33
     C                   IF        *IN33=*OFF
     C                   EVAL      WSKCONT = KPERS
     C                   EVAL      WSKTLF  = TLF
     C                   EVAL      WSKMAIL = SYEPOS
     C                   ENDIF
N02  c                   endif
     C                   ENDIF
      * Stedsnavn
     C     WKSDF         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS1
     C     WKSDT         CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS2
     C     WKSDFF        CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS3
     C     WKSDVT        CHAIN     STED2D                             33
     C  N33              MOVEL     ST2NVN        WPPNS4
      * Bookingtid
     C                   EXSR      GETBOO
      *
     C     UtGetInfo     ENDSR
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          BEGSR
     C     HEADFK        klist
     C                   kfld                    HEAVD
     C                   kfld                    HEOPD
     C     DOKUFKey      klist
     C                   kfld                    DFRI
     C                   kfld                    HEAVD
     C                   kfld                    HEOPD
     C                   kfld                    DFFBNR
     C                   move      'F'           DFRI
     C                   z-add     1             DFFBNR
     C     CONTKEY       KLIST
     c                   KFLD                    HEAVD
     c                   KFLD                    HEOPD
     c                   KFLD                    FE_DFFBNR
     c                   KFLD                    FE_N3035
     C     CUNDL01KS     KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    HEKNS
     C     CUNDL01KK     KLIST
     C                   KFLD                    BIFIRM
     C                   KFLD                    HEKNK
     C     WKSDF         KLIST
     C                   KFLD                    HELKA
     C                   KFLD                    HESDF
     C     WKSDT         KLIST
     C                   KFLD                    HETRI
     C                   KFLD                    HESDT
     C     WKSDFF        KLIST
     C                   KFLD                    HELKS
     C                   KFLD                    HESDFF
     C     WKSDVT        KLIST
     C                   KFLD                    HELKK
     C                   KFLD                    HESDVT
     C     KEYTT         KLIST
     C                   KFLD                    HEAVD
     C                   KFLD                    HEOPD
     C                   KFLD                    WTTACTI
     C     *LIKE         DEFINE    TXFBNR        WTXFBNR
     C     *LIKE         DEFINE    TTACTI        WTTACTI
     C                   EVAL      WTXFBNR=*ZEROS
     C                   EVAL      TTACTI='BOO'

     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
      * Ugyldig userID
     C     *IN50         IFEQ      '1'
     C                   close     BRIDF
     C                   EVAL      *INlr = *on
     C                   return
     C                   ENDIF
      * En "standardvariant" libl: CALL bound (INCGI=*MODULE) med parameter.
     C     BILIBL        IFEQ      *BLANKS
     C                   CALLb     'INCGI'
     C                   PARM                    BISTDL
     C                   ELSE
      * Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   CALL      BILIBL
     C                   END
     C  N50              OPEN      HEADF
     C  N50              OPEN      FIRM
     C  N50              OPEN      TRACKT
     C  N50              OPEN      TRACKL08
     C  N50              OPEN      DOKUF
     C  N50              OPEN      DOKUFE
     C  N50              OPEN      CUNDL01
     C  N50              OPEN      STED2D
     C  N50              OPEN      AVSLUTF
     C  N50              OPEN      AVSLUTL2

      * Initiere DS (obs - pass at ikke verdier tatt inn i parse  nulles)
     C                   MOVE      *ZEROS        WSETAD
     C                   MOVE      *ZEROS        WSETDD
     C                   MOVE      *ZEROS        WSATAD
     C                   MOVE      *ZEROS        WSATDD


     C     BIFIRM        CHAIN     FIRM                               33
N02   * tenkes potensielt parametersatt mot gitt CTYPE i CUNDC - evt -MAIN- = hovedkontakt
N02  c                   Move      *blanks       KpersKode        30

     C                   ENDSR
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          BEGSR
     C                   close     BRIDF
     C  N50              close     HEADF
     C  N50              CLOSE     FIRM
     C  N50              CLOSE     TRACKT
     C  N50              CLOSE     TRACKL08
     C  N50              CLOSE     DOKUF
     C  N50              CLOSE     DOKUFE
     C  N50              CLOSE     CUNDL01
     C  N50              CLOSE     STED2D
     C  N50              CLOSE     AVSLUTF
     C  N50              CLOSE     AVSLUTL2
     C                   CALLP     wrtsection('*fini')
     C                   EVAL      *INlr = *on

     C                   ENDSR
      *______________________________________________
      * Hent bookingtid                        GETBOO
      *""""""""""""""""""""""""""""""""""""""""""""""
     C     GETBOO        BEGSR

     C                   MOVE      'BOO'         WTTACTI
     C     KEYTT         CHAIN     TRACKL08                           33
     C     *IN33         IFEQ      '0'
     c                   movel     TTTIME        WSBOTM
     c                   move      TTDATE        HEBODT
     C*                  ELSE
      * hvis ikke finnes ta opprettelsesdato
     C*                  MOVE      'STR'         WTTACTI
     C*    KEYTT         CHAIN     TRACKL08                           33
     C* N33              MOVE      TTDATE        HEBODT
     C* N33              move      1200          wsbotm
      * ikke opprettelsesdate ta forfraktdate/fra dato
     c*    *in33         ifeq      '1'
     c*    trsffd        ifne      *zeros
     c*                  move      trsffd        hebodt
     c*                  move      trsffk        wsbotm
     c*                  else
     c*                  move      trsdfd        hebodt
     c*                  move      trsdfk        wsbotm
     c*                  ENDIF
     c*                  ENDIF
     c                   ENDIF
      *
     c                   move      wsbotm        WABOTM            4
     c                   if        wsbotm = *zeros
     c                   move      *blanks       WABOTM
     c                   endif

     C                   ENDSR
      *
      *********************************************
     C     TEST          BEGSR
      *********************************************
     c     HEOPD         ifeq      *zeros
     C                   eval      Error = 'Oppdragsnr = 0. '
     c                             +'Kan ikke vedlikeholdes'
     c                   goto      UtTest
     c                   endif
      *
     C     HEADFK        CHAIN     HEADF                              33
     c     *in33         ifeq      '1'
     C                   eval      Error = 'Ukjent oppdragsnr '
     c                             +%trim(%editc(HEAVD:'Z'))+'/'
     c                             +%trim(%editc(HEOPD:'Z'))
     c                   goto      UtTest
     c                   endif
     c     HEST          ifeq      'S'
     C                   eval      Error = 'Oppdraget er slettemerket. '
     c                             +%trim(%editc(HEAVD:'Z'))+'/'
     c                             +%trim(%editc(HEOPD:'Z'))
     c                             +' Kan ikke vedlikeholdes'
     c                   goto      UtTest
     c                   endif
      * AVSLUTTET..
      *
     C     HEADFK        CHAIN     AVSLUTF                            33
     c     *in33         ifeq      '0'
     C                   eval      Error = 'Oppdraget er merket avsluttet. '
     c                             +%trim(%editc(HEAVD:'Z'))+'/'
     c                             +%trim(%editc(HEOPD:'Z'))
     c                             +' Kan ikke vedlikeholdes'
     c                   goto      UtTest
     c                   endif
      *
     C     HEPRO         IFNE      *ZEROS
     C     HEPRO         CHAIN     AVSLUTL2                           33
     c     *in33         ifeq      '0'
     C                   eval      Error = 'Turen som oppdraget er på er '
     c                             +'merket avsluttet. '
     c                             +%trim(%editc(HEPRO:'Z'))
     c                             +' Kan ikke vedlikeholdes'
     c                   goto      UtTest
     c                   endif
     c                   endif
      *
     C     UtTest        ENDSR
