      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TNCI010R MODULE(*LIBL/TNCI010R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FSVNV      IF   E           K DISK    USROPN
     FSVNVCN    IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D TVAVD_A         S              4
     D TVAVD           S              4  0
     D TVTDN_A         S              7
     D TVTDN           S              7  0
     D JSONstring      S          32000
     D Error           S            150
     D AntLest         S              9  0
     D                 DS
     D  TVCNR1                 1     17
     D  TVCNR2                18     34
     D  TVCNR3                35     51
     D  TVCNR4                52     68
     D  TVCNR5                69     85
     D  CN                     1     85    DIM(5)

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬tvavd¬ : ¬'+%trim(%editc(TVAVD:'Z'))+'¬, '
        +'¬tvtdn¬ : ¬'+%trim(%editc(TVTDN:'Z'))+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"orderList" : ['
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Liste Ærende
      *
     c     Error         ifeq      *blanks
     C                   MOVE      *BLANKS       CN
     C     SVNVkey       setll     SVNV
     C     SVNVkey       READE     SVNV                                   55
     C     *IN55         DOWEQ     '0'
     C                   MOVE      TVCNR         CN(1)
      *
     C                   Z-ADD     1             XN                3 0
     C     SVNVCNK       SETLL     SVNVCN
     C     SVNVCNK       READE     SVNVCN                                 33
     C                   DOW       *IN33 = *OFF
     C                   ADD       1             XN                3 0
     C                   MOVE      TVCNR         CN(XN)
     C     SVNVCNK       READE     SVNVCN                                 33
     C  N33              ENDDO
      *
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬tvavd¬ : ¬'+%trim(%editc(TVAVD:'Z'))+'¬, '
          +'¬tvtdn¬ : ¬'+%trim(%editc(TVTDN:'Z'))+'¬, '
          +'¬tvli¬ : ¬'+%trim(%editc(TVLI:'Z'))+'¬, '
          +'¬tvst¬ : ¬'+%trim(TVST)+'¬, '
          +'¬tvstsk¬ : ¬'+%trim(TVSTSK)+'¬, '
          +'¬tvstlk¬ : ¬'+%trim(TVSTLK)+'¬, '
          +'¬tvctl¬ : ¬'+%trim(%editc(TVCTL:'4'))+'¬, '
          +'¬tvflg¬ : ¬'+%trim(%editc(TVFLG:'4'))+'¬, '
          +'¬tvinf1¬ : ¬'+%trim(TVINF1)+'¬, '
          +'¬tvinf2¬ : ¬'+%trim(TVINF2)+'¬, '
          +'¬tvinf3¬ : ¬'+%trim(TVINF3)+'¬, '
          +'¬tvinf4¬ : ¬'+%trim(TVINF4)+'¬, '
          +'¬tvinsk¬ : ¬'+%trim(TVINSK)+'¬, '
          +'¬tvgdt¬ : ¬'+%trim(%editc(TVGDT:'4'))+'¬, '
          +'¬tvgm¬ : ¬'+%trim(TVGM)+'¬, '
          +'¬tvgmsk¬ : ¬'+%trim(TVGMSK)+'¬, '
          +'¬tvgmst¬ : ¬'+%trim(TVGMST)+'¬, '
          +'¬tvgmss¬ : ¬'+%trim(TVGMSS)+'¬, '
          +'¬tvgmlk¬ : ¬'+%trim(TVGMLK)+'¬, '
          +'¬tvdant¬ : ¬'+%trim(%editc(TVDANT:'4'))+'¬, '
          +'¬tvdfkd¬ : ¬'+%trim(TVDFKD)+'¬, '
          +'¬tvdfsk¬ : ¬'+%trim(TVDFSK)+'¬, '
          +'¬tvtaid¬ : ¬'+%trim(TVTAID)+'¬, '
          +'¬tvtask¬ : ¬'+%trim(TVTASK)+'¬, '
          +'¬tvtalk¬ : ¬'+%trim(TVTALK)+'¬, '
          +'¬tvgodt¬ : ¬'+%trim(%editc(TVGODT:'4'))+'¬, '
          +'¬tvom¬ : ¬'+%trim(TVOM)+'¬, '
          +'¬tvomsk¬ : ¬'+%trim(TVOMSK)+'¬, '
          +'¬tvomst¬ : ¬'+%trim(TVOMST)+'¬, '
          +'¬tvomss¬ : ¬'+%trim(TVOMSS)+'¬, '
          +'¬tvomlk¬ : ¬'+%trim(TVOMLK)+'¬, '
          +'¬tvcnr¬ : ¬'+%trim(TVCNR1)+'¬, '
          +'¬tvcnr2¬ : ¬'+%trim(TVCNR2)+'¬, '
          +'¬tvcnr3¬ : ¬'+%trim(TVCNR3)+'¬, '
          +'¬tvcnr4¬ : ¬'+%trim(TVCNR4)+'¬, '
          +'¬tvcnr5¬ : ¬'+%trim(TVCNR5)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
     C     SVNVkey       READE     SVNV                                   55
     C                   ENDDO
     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     SVNV
     C  N50              CLOSE     SVNVCN

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      TVAVD_A = zhbgetvar('AVD')
     C                   EVAL      TVAVD   = c2n2(TVAVD_A)
     C                   EVAL      TVTDN_A = zhbgetvar('OPD')
     C                   EVAL      TVTDN   = c2n2(TVTDN_A)
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end
      *
     C     SVNVkey       klist
     C                   kfld                    TVAVD
     C                   kfld                    TVTDN
     C     SVNVCNK       klist
     C                   kfld                    TVAVD
     C                   kfld                    TVTDN
     C                   kfld                    TVLI
      *
     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      SVNV
     C  N50              OPEN      SVNVCN

     c                   endsr
      *
