      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TNOG005R MODULE(*LIBL/TNOG005R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FKODTSA    IF   E           K DISK    USROPN
     FKODTSB    IF   E           K DISK    USROPN
     FKODTSC    IF   E           K DISK    USROPN
     FKODTSD    IF   E           K DISK    USROPN
     FKODTSE    IF   E           K DISK    USROPN
     FKODTS1    IF   E           K DISK    USROPN
     FKODTS2    IF   E           K DISK    USROPN
     FKODTS3    IF   E           K DISK    USROPN
     FKODTS4    IF   E           K DISK    USROPN
     FKODTS5    IF   E           K DISK    USROPN
     FKODTS6    IF   E           K DISK    USROPN
     FKODTS7    IF   E           K DISK    USROPN
     FKODTS8    IF   E           K DISK    USROPN
     FKODTS9    IF   E           K DISK    USROPN
     FKODTLB    IF   E           K DISK    USROPN
     FKODTVA    IF   E           K DISK    USROPN
     FKODTTST   IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D JSONstring      s          32000
     D Error           S            150
     D Wtyp            S              2
     D*Wkode           S              3
     D*Wkode4          S              4
     D*ZKOD            S              3
     D*ZKOD4           S              4
     D ZSKV            S              3
     D ZTXT            S             60
     D AntLest         S              9  0
     D ZB              S              1    DIM(20)
     D                 DS
     D  Wkode                  1      3
     D  Wkode4                 1      4
     D  Wkode4x                4      4
     D                 DS
     D  Zkod                   1      3
     D  Zkod4                  1      4
     D  Zkod4x                 4      4

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬typ¬ : ¬'+%trim(WTYP)+'¬, '
        +'¬kode¬ : ¬'+%trim(WKODE4)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"kodlista" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
     c     Error         ifeq      *blanks
     C                   EXSR      RID
     C                   ENDIF
     C     *IN55         DOWEQ     *OFF
     C     WKODE4X       IFNE      *BLANKS
     C     WKODE4        IFNE      ZKOD4
     C                   GOTO      NEXT
     C                   ENDIF
     C                   ELSE
     C     WKODE         IFNE      *BLANKS
     C     WKODE         IFNE      ZKOD
     C                   GOTO      NEXT
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬zkod¬ : ¬'+%trim(ZKOD4)+'¬, '
          +'¬zskv¬ : ¬'+%trim(ZSKV)+'¬, '
          +'¬ztxt¬ : ¬'+%trim(ZTXT)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
     C     NEXT          TAG
     C                   EXSR      RID
     C                   ENDDO
     C     UTLES         TAG
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     c  N50              CLOSE     KODTSA
     c  N50              CLOSE     KODTSB
     c  N50              CLOSE     KODTSC
     c  N50              CLOSE     KODTSD
     c  N50              CLOSE     KODTSE
     c  N50              CLOSE     KODTS1
     c  N50              CLOSE     KODTS2
     c  N50              CLOSE     KODTS3
     c  N50              CLOSE     KODTS4
     c  N50              CLOSE     KODTS5
     c  N50              CLOSE     KODTS6
     c  N50              CLOSE     KODTS7
     c  N50              CLOSE     KODTS8
     c  N50              CLOSE     KODTS9
     c  N50              CLOSE     KODTLB
     c  N50              CLOSE     KODTVA
     c  N50              CLOSE     KODTTST
      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      WTYP    = zhbgetvar('TYP')
     C                   EVAL      WKODE4 = zhbgetvar('KODE')
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end
      *
     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      KODTSA
     c  N50              OPEN      KODTSB
     c  N50              OPEN      KODTSC
     c  N50              OPEN      KODTSD
     c  N50              OPEN      KODTSE
     c  N50              OPEN      KODTS1
     c  N50              OPEN      KODTS2
     c  N50              OPEN      KODTS3
     c  N50              OPEN      KODTS4
     c  N50              OPEN      KODTS5
     c  N50              OPEN      KODTS6
     c  N50              OPEN      KODTS7
     c  N50              OPEN      KODTS8
     c  N50              OPEN      KODTS9
     c  N50              OPEN      KODTLB
     c  N50              OPEN      KODTVA
     c  N50              OPEN      KODTTST

     c                   endsr
      *
      *********************************************************
     C     RID           Begsr
      *********************************************************
     C                   MOVE      *BLANKS       ZKOD4
     C                   MOVE      *BLANKS       ZTXT
     C                   SELECT
     C     WTYP          WHENEQ    'A'
     C                   READ      KODTSA                                 55
     C  N55              MOVEL     KSAKD         ZKOD
     C  N55              MOVEL     KSAFT         ZTXT
     C     WTYP          WHENEQ    'B'
     C                   READ      KODTSB                                 55
     C  N55              MOVEL     KSBKD         ZKOD
     C  N55              MOVEL     KSBFT         ZTXT
     C     WTYP          WHENEQ    'C'
     C                   READ      KODTSC                                 55
     C  N55              MOVEL     KSCKD         ZKOD
     C  N55              MOVEL     KSCFT         ZTXT
     C     WTYP          WHENEQ    'D'
     C                   READ      KODTSD                                 55
     C  N55              MOVEL     KSDLS         ZKOD
     C  N55              MOVEL     KSDTXT        ZTXT
     C     WTYP          WHENEQ    'E'
     C                   READ      KODTSE                                 55
     C  N55              MOVEL     KSEFYL        ZKOD
     C  N55              MOVEL     KSETXT        ZTXT
     C     WTYP          WHENEQ    'L'
     C                   READ      KODTLB                                 55
     C  N55              MOVEL     KLBKOD        ZKOD
     C  N55              MOVEL     KLBNAV        ZTXT
     C     WTYP          WHENEQ    'V'

     C     VTAG          TAG
     C                   READ      KODTVA                                 55
     C                   IF        *IN55 = *OFF
     C                   IF        KVAKOD=DUPKOD
     C                   GOTO      VTAG
     C                   ENDIF
     C                   MOVEL     KVAKOD        ZKOD
     C                   MOVEL     KVAXXX        ZTXT
     C                   MOVEL     KVAKOD        DUPKOD            3
     C                   ENDIF

     C     WTYP          WHENEQ    '1'
     C                   READ      KODTS1                                 55
     C  N55              MOVEL     KS1TYP        ZKOD
     C  N55              MOVEL     KS1FTX        ZTXT
     C     WTYP          WHENEQ    '2'
     C                   READ      KODTS2                                 55
     C  N55              MOVEL     KS2LK         ZKOD
     C  N55              MOVEL     KS2FTX        ZTXT
     C     WTYP          WHENEQ    '3'
     C                   READ      KODTS3                                 55
     C  N55              MOVEL     KS3TRT        ZKOD
     C  N55              MOVEL     KS3FTX        ZTXT
     C     WTYP          WHENEQ    '4'
     C                   READ      KODTS4                                 55
     C  N55              MOVEL     KS4TRM        ZKOD
     C  N55              MOVEL     KS4FTX        ZTXT
     C     WTYP          WHENEQ    '5'
     C                   READ      KODTS5                                 55
     C  N55              MOVEL     KS5TLN        ZKOD
     C  N55              MOVEL     KS5FTX        ZTXT
     C     WTYP          WHENEQ    '6'
     C                   READ      KODTS6                                 55
     C  N55              MOVEL     KS6PRE        ZKOD
     C  N55              MOVEL     KS6FTX        ZTXT
     C     WTYP          WHENEQ    '7'
     C                   READ      KODTS7                                 55
     C  N55              MOVEL     KS7VF         ZKOD
     C  N55              MOVEL     KS7FTX        ZTXT

     C     WTYP          WHENEQ    '8'
     C     TAG8          TAG
     C                   READ      KODTS8                                 55
     C     *IN55         IFEQ      *OFF
     C     KS8SKV        ANDEQ     *BLANKS
     C                   MOVEL     KS8AVG        ZKOD
     C                   MOVEL     KS8FTX        ZTXT
     C                   ELSE
     C  N55              GOTO      TAG8
     C                   ENDIF
     C     WTYP          WHENEQ    '8B'
     C     TAG8B         TAG
     C                   READ      KODTS8                                 55
     C     *IN55         IFEQ      *OFF
     C     KS8SKV        ANDNE     *BLANKS
     C                   MOVEL     KS8AVG        ZKOD
     C                   MOVEL     KS8SKV        ZSKV
     C                   MOVEL     KS8FTX        ZTXT
     C                   ELSE
     C  N55              GOTO      TAG8B
     C                   ENDIF
     C     WTYP          WHENEQ    'FF'
     C     TAG8C         TAG
     C                   READ      KODTS8                                 55
     C     *IN55         IFEQ      *OFF
     C     KS8SKV        ANDNE     *BLANKS
     C     KS8AVG        ANDEQ     'FF'
     C                   MOVEL     KS8AVG        ZKOD
     C                   MOVEL     KS8SKV        ZSKV
     C                   MOVEL     KS8FTX        ZTXT
     C                   ELSE
     C  N55              GOTO      TAG8C
     C                   ENDIF
     C     WTYP          WHENEQ    '9'
     C                   READ      KODTS9                                 55
     C  N55              MOVEL     KS9TYP        ZKOD
     C  N55              MOVEL     KS9FTX        ZTXT
     C     WTYP          WHENEQ    'HA'
     C                   READ      KODTTST                                55
     C  N55              MOVEL     KTSPNR        ZKOD4
     C  N55              MOVEL     KTSNAV        ZTXT
     C                   ENDSL
     c                   endsr
