      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TNOI014R MODULE(*LIBL/TNOI014R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FBRPARF    IF   E           K DISK    USROPN
     FKODTP     IF   E           K DISK    USROPN
     FSADH      UF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D AVD             S              4
     D AVDA            S              4
     D AVDN            S              4  0
     D OPD             S              7
     D OPDA            S              7
     D OPDN            S              7  0
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     d wpabrid         s                   like(pabrid)
     d wpakunr         s                   like(pakunr)
     d wpasort         s                   like(pasort)
     D                 DS
     D  DTWS                   1     10
     D  DTUSER                11     20
     D  DTIN39                21     21
     D  DTPRT1                22     31
     D  DTPRT2                32     41
     D  DTPRT3                42     51
     D  DTDTA                  1    128

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      * Skriv ut
     C                   EXSR      SRTE
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬avd¬ : ¬'+%trim(%editc(AVDN:'Z'))+'¬, '
        +'¬opd¬ : ¬'+%trim(%editc(OPDN:'Z'))+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     C                   eval      JSONstring ='"utskrift" : ['
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
     c                   eval      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     BRPARF
     C  N50              CLOSE     KODTP
     C  N50              CLOSE     SADH

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      AVD     = zhbgetvar('AVD')
     C                   eval      AVDN    = c2n2(AVD)
     C                   MOVE      AVDN          AVDA
     C                   EVAL      OPD     = zhbgetvar('OPD')
     C                   eval      OPDN    = c2n2(OPD)
     C                   MOVE      OPDN          OPDA
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C   50              eval      Error = 'Invalid userID'
     C  N50              OPEN      BRPARF
     C  N50              OPEN      KODTP
     C  N50              OPEN      SADH

     C     *LIKE         DEFINE    KOPUNI        WKOPUNI
     C     *LIKE         DEFINE    KOPAVD        WKOPAVD
     C     *LIKE         DEFINE    KOPLNR        WKOPLNR
     C     SADHKey       klist
     C                   kfld                    SIAVD
     C                   kfld                    SITDN
     C     KODTPK        KLIST
     C                   KFLD                    WKOPUNI
     C                   KFLD                    WKOPAVD
     C                   KFLD                    WKOPLNR
     C                   EVAL      WKOPUNI='P'
     C                   EVAL      WKOPAVD=AVDN

      /free
        if *in50 = *off;
           wpabrid=wsuser;
           wpakunr=0;
           wpasort=0;
           chain (WPABRID: WPAKUNR: 'ASUSR': WPASORT) BRPARF;
        endif;
      /end-free

     c                   endsr
      *___________________________________________
      * Skriv ut                              SRTE
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRTE          BEGSR
     C                   Z-ADD     81            WKOPLNR
     C     KODTPK        CHAIN     KODTP                              33
     C                   MOVEL     KOPNVN        DTPRT1
     C                   Z-ADD     82            WKOPLNR
     C     KODTPK        CHAIN     KODTP                              33
     C                   MOVEL     KOPNVN        DTPRT2
     C                   Z-ADD     83            WKOPLNR
     C     KODTPK        CHAIN     KODTP                              33
     C                   MOVEL     KOPNVN        DTPRT3

     C                   MOVE      *BLANKS       DTPRT1
     C                   MOVEL     'EPOSTSND'    DTPRT1
     C                   MOVEL     'EPOSTSND'    DTPRT2
     C                   MOVEL     'EPOSTSND'    DTPRT3
     C                   EVAL      DTWS=PAVRDA
     C                   EVAL      DTUSER=PAVRDA
     C                   EVAL      DTIN39='0'

     C                   EVAL      SIAVD=AVDN
     C                   EVAL      SITDN=OPDN

     C     SADHKEY       CHAIN     SADH                               33
     C                   IF        *IN33=*OFF
     C                   EVAL      SIST='K'
     C                   EVAL      SIWS=DTWS
     C                   MOVE      'J'           SIPKL
     C                   UPDATE    SADHR
     C                   ENDIF

      * Send utskrift via dataq
     C                   CALL      'QSNDDTAQ'
     C                   PARM      'SAD61PQ   '  QTNAME           10
     C                   PARM      '*LIBL     '  QTLIB            10
     C                   PARM      128           QTLEN             5 0
     C                   PARM      DTDTA         QTFIEL          128

     C                   ENDSR
