     FTRKODF    UP   E           K DISK
     FTRKODLNY  IF   E           K DISK    PREFIX(NY_)
     F                                     RENAME(TRKODFR:TRKODFRNY)
      *
     C                   IF        XINIT <> 'J'
     C     TRKODLNYK     KLIST
     C                   KFLD                    TKUNIK
     C                   KFLD                    TKKODE
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   IF        TKUNIK = '106'
     C     TRKODLNYK     CHAIN     TRKODLNY                           33
     C                   IF        *IN33 = *OFF
     C                   MOVE      NY_TKAVG      TKAVG
     C                   MOVE      NY_TKANK      TKANK
     C                   MOVE      NY_TKTRS      TKTRS
     C                   END
     C                   END
     C                   UPDATE    TRKODFR
      *
