     FTRKODL01  UF   E           K DISK
     D TABELL          S              1    DIM(26) CTDATA PERRCD(1) ASCEND
     D TABTXT          S              1    DIM(26) ALT(TABELL)
     D                 DS
     D  TXT1                   1     35
     D  TXT2                   1     35    DIM(35)
      *
     C                   MOVE      '106'         XKUNIK            3
     C     XKUNIK        SETLL     TRKODL01
     C     XKUNIK        READE     TRKODL01                               33
     C     *IN33         DOWEQ     '0'
     C                   MOVEL     TKTXTN        TXT1
     C     1             DO        35            XNR               3 0
     C                   MOVE      TXT2(XNR)     XTEGN             1
     C     XTEGN         LOOKUP    TABELL        TABTXT                   33
     C                   IF        *IN33 = *ON
     C                   MOVE      TABTXT        TXT2(XNR)
     C                   END
     C                   ENDDO
     C                   MOVEL     TXT1          TKTXTN
     C                   MOVEL     TKTXTE        TXT1
     C     1             DO        35            XNR               3 0
     C                   MOVE      TXT2(XNR)     XTEGN             1
     C     XTEGN         LOOKUP    TABELL        TABTXT                   33
     C                   IF        *IN33 = *ON
     C                   MOVE      TABTXT        TXT2(XNR)
     C                   END
     C                   ENDDO
     C                   MOVEL     TXT1          TKTXTE
     C                   UPDATE    TRKODFR
     C     XKUNIK        READE     TRKODL01                               33
     C  N33              ENDDO
      *
     C                   SETON                                        LR
     C                   RETURN
      *
**
aA
bB
cC
dD
eE
fF
gG
hH
iI
jJ
kK
lL
mM
nN
oO
pP
qQ
rR
sS
tT
uU
vV
wW
xX
yY
zZ
