********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10017 * 01 YBC PTF10 SKILLE TET-EKSPORT OG FORHÅNDSVARSLING IMPORT
10XXX * 02 YBC PTF10 KANSELLERING ÅPNES VED MOTTAK AV IE29
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11128 * 03 YBC PTF11 VEKT ER ENDRET FRA 9.0 TIL 11.3
********************************************************************
      ***********************************************************
      * PROGRAM SKAL BE OM UTSKRIFT (EL. TRANSITTERING)       ***
      * INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER      ***
      * LEDIGE INDIKATORER 01 02 05-07 09 11 13-16 18-26      ***
      * LEDIGE INDIKATORER 29 30 35-96                        ***
      ***********************************************************
     FTRUH      UF   E           K DISK
N01  FTRUHFV    IF   E           K DISK
     FTRUHK     UF A E           K DISK
     FTRKODL01  IF   E           K DISK
     FEDIM1     UF A E           K DISK
     FEDIM2     IF   E           K DISK
     F                                     RENAME(EDIMR:EDIMR2)
     FEDIM4     IF   E           K DISK
     F                                     RENAME(EDIMR:EDIMR4)
     FEDIC      UF   E             DISK
     FTVIND     UF A E           K DISK
     FTRUSTD    IF   E           K DISK
     FTR013D    CF   E             WORKSTN USROPN
     D                 DS
     D  THAVD                  1      4  0
     D  THTDN                  5     11  0
     D  THSG                  12     14
     D  X14S                   1     14
     D                 DS
     D  X0068Æ                 1      8
     D  X0068A                 9     16  0
     D  X0068B                17     22  0
     D  X0068Å                 1     22
     D                 DS
     D  UAVD                   1      4  0
     D  UTDN                   5     11  0
     D  UWS                   13     22
     D  UTVIN                 23     23
      *** UIN34 = '1' -> SENDES PÅ TVINN
     D  UIN34                 25     25
S03  D* U1N07                 36     38
N03  D  U1N07                 38     40
      * OBS! HUSK INITIERE ALLE FELTER PÅ TR011R
     D  UPARM2                 1    128
      *
     C                   OPEN      TR013D
     C                   EXSR      INIT
      *
      *=========================================
      *
     C   34              DO
     C                   EXSR      TSTMTY
     C     START2        TAG
     C                   EXFMT     TR013D01
     C                   MOVEA     '00'          *IN(97)
      *
     C   12              GOTO      START3
     C     *IN04         IFEQ      '1'
     C                   MOVE      '012'         UUNIK             3
     C                   MOVE      *BLANKS       UKODE            10
     C                   MOVEL     WSSK          UKODE
     C                   CALL      'TR002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2            3
     C                   MOVEL     UKODE         WSSK
     C                   GOTO      START2
     C                   END
     C     *IN27         IFEQ      '1'
     C     WSFT1         COMP      *BLANKS                                98
     C     WSSK          IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSSK          YKODE
     C     TRK01K        CHAIN     TRKODL01                           97
     C                   END
     C                   END
     C   99
     COR 98
     COR 97              GOTO      START2
      *
     C                   EXSR      OPDFIL
      *
     C                   END
      *
     C     START3        TAG
     C     TRHKEY        CHAIN     TRUH                               33
     C  N12*IN34         IFEQ      '0'
     C                   MOVE      ' '           THST
     C                   MOVE      *BLANKS       THWS
     C                   ELSE
     C                   MOVE      'Q'           THST
     C                   MOVE      *BLANKS       THWS
     C                   END
     C   12THST          IFEQ      'E'                                           2<-B
     C                   MOVE      ' '           THST
     C                   END                                                     2<-E
      *
      *** OPPDATER KOMMUNIKASJONDATA PÅ SAD-REGISTER
     C  N12              MOVE      UTVIN         THPKL
     C   12              MOVE      'N'           THPKL
     C                   UPDATE    TRUHR
      *
      *
     C  N12
     CAN 34              EXSR      KOMLIN
     C                   MOVE      'J'           XWIN              1
      *
     C     SLUTT         TAG
     C                   CLOSE     TR013D
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
      ***********************************************
     C     TSTMTY        BEGSR
      ***********************************************
     C     M2KDCK        SETLL     EDIM2                              33
     C     STTSTM        TAG
     C     M2KD2K        READPE    EDIM2                                  33
     C     *IN33         IFEQ      '0'
     C                   SELECT
      * BRUKER VIL KANSELLERE TRANSITTERING
     C     W1N07         WHENEQ    '014'
     C                   SELECT
     C     M1001         WHENNE    'TET'
     C                   GOTO      STTSTM
     C     M1N07         WHENEQ    '029'
S02  C*                  MOVE      '1'           *INLR
S02  C*                  RETURN
     C     M1N07         WHENEQ    '028'
     C     THENKL        ANDEQ     'N'
      * FRIGIVELSE FOR TRANSITTERING --> OK FOR KANSELLERING
     C     TRHKEY        CHAIN(N)  TRUHK                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      TKFT1         WSFT1
     C                   MOVE      TKFT2         WSFT2
     C                   MOVE      TKFT3         WSFT3
     C                   MOVE      TKFT4         WSFT4
     C                   MOVE      TKFT5         WSFT5
     C                   MOVE      TKSK          WSSK
     C                   END
     C                   GOTO      SLTSTM
     C     M1N07         WHENEQ    '009'                                        BESLUTTET OM KANSELL
     C     TH0035        IFEQ      '1'                                          AKSEPTERT KANSELLERI
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   END
     C     M1N07         WHENEQ    '015'                                        SENDT TRANSITTERING
     C     M1N07         OREQ      '016'                                        TRANSITTERING ER AVV
     C     M1N07         OREQ      '028'                                        TRANSITTERINGNR TILD
     C     M1N07         OREQ      '051'                                        INGEN FRIGIVELSE
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C                   OTHER
     C                   GOTO      STTSTM
     C                   ENDSL
      *
      * BRUKER VIL SENDE TRANSITTERING
     C     W1N07         WHENEQ    '015'
     C                   SELECT
     C     M1001         WHENNE    'TET'
     C                   GOTO      STTSTM
     C     M1N07         WHENEQ    '009'                                        BESLUTTET OM KANSELL
      * TIDLIGERE TRANSITTERING ER KANSELLERT --> OK Å SENDE PÅ NYTT
     C     M1N07         OREQ      '016'                                        TRANSITTERING ER AVV
      * TIDLIGERE TRANSITTERING ER AVVIST --> OK Å SENDE PÅ NYTT
     C     M1N07         OREQ      '051'                                        INGEN FRIGIVELSE
      * TIDLIGERE TRANSITTERING FIRGIS IKKE --> OK Å SENDE PÅ NYTT
     C     M1N07         OREQ      '062'                                        AVVIST OM FRIGIVELSE
      * TIDLIGERE TRANSITTERING ER AVVIST FOR FRIGIVELSE --> OK Å SENDE PÅ NYTT
     C                   GOTO      SLTSTM
     C     M1N07         WHENEQ    '014'                                        ALLEREDE SENDT KANSE
     C     M1N07         OREQ      '028'                                        TRANSITTERINGNR TILD
     C     M1N07         OREQ      '029'                                        FRIGIVELSE
     C                   MOVE      '1'           *IN99
     C                   GOTO      SLTSTM
     C                   OTHER
     C                   GOTO      STTSTM
     C                   ENDSL
      *
      * BRUKER BER OM FRIGIVELSE
     C                   ENDSL
      *
     C                   END
      *
     C     SLTSTM        ENDSR
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C                   SELECT
     C     W1N07         WHENEQ    '014'
      * OPPDATER KANSELLERINGSGRUNNLAG
     C     WSFT1         COMP      *BLANKS                                98
     C   98              GOTO      START2
     C     TRHKEY        CHAIN     TRUHK                              33
     C                   MOVE      WSFT1         TKFT1
     C                   MOVE      WSFT2         TKFT2
     C                   MOVE      WSFT3         TKFT3
     C                   MOVE      WSFT4         TKFT4
     C                   MOVE      WSFT5         TKFT5
     C                   MOVE      WSSK          TKSK
     C     *IN33         IFEQ      '1'
     C                   MOVE      THAVD         TKAVD
     C                   MOVE      THTDN         TKTDN
     C                   WRITE     TRUHKR
     C                   ELSE
     C                   UPDATE    TRUHKR
     C                   END
      *
     C                   ENDSL
      *
     C                   ENDSR
      *
      ***********************************************
     C     KOMLIN        BEGSR
      ***********************************************
     C     W1N07         IFEQ      '015'
     C                   MOVE      '1'           *IN31
     C                   GOTO      STKL2
     C                   END
      *
      * HENT SISTE DATO/SEKVENSNR.
      *   1. HVIS DET FINNES OG IKKE ER 'CTL'
      *   2. HVIS DET IKKE PKT.1, HENTER NY DATO/SEKV.NR.
     C     MAKDCK        SETLL     EDIM4                              31
      * FOR Å FÅ UNIK NUMMERERING PÅ ALLE TVINNSAKER SKAL VERSJ.NR ØKER
      * ALLTID (OGSÅ VED FEIL I INP.KTR.!!! - NÅR NY SAK I TVINN (ELLER
      * BARE DFI HITTIL SKAL NY DATO/SEKV.NR. ALLTID TILDELES))
     C     STKL          TAG
     C     MAKD2K        READPE    EDIM4                                  31
     C  N31M0065         IFNE      'CUSDEC'                                     1<-B
     C     M0065         ANDNE     'CUSRES'
     C                   GOTO      STKL
     C                   END                                                    1<-E
     C  N31MST           IFEQ      'D'                                          1<-B
     C     M1001         ORNE      'TET'
     C                   GOTO      STKL
     C                   END                                                    1<-E
     C  N31M1N07         IFEQ      'CTL'                                        1<-B
     C                   GOTO      STKL
     C                   END                                                    1<-E
      *
      *** DET FINNES IKKE TAD-SVAR DATO/SEKVENS/VERSJON MÅ KONSTRUERES
      *** ORDNE DEKLARANTENS DATO
     C     STKL2         TAG
     C   31              DO
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVEL     WDT           M0068A
      *** HENT SEKVENSNR.
     C     TVINDK        CHAIN     TVIND                              32
     C   32              Z-ADD     M0068A        D0068A
     C   32              Z-ADD     0             D0068B
     C                   ADD       1             D0068B
     C   32              WRITE     TVINDF
     C  N32              UPDATE    TVINDF
     C                   MOVE      D0068B        M0068B
     C                   END
      *
      *** HENTE MELDINGSNR
     C     1             CHAIN     EDIC                               32
     C                   ADD       1             CMN
     C                   UPDATE    EDICR
      *
     C                   EXSR      MOVKD1
     C     TVIM1K        SETLL     EDIM1                              32
     C     STKL3         TAG
     C     TVIM1K        READE     EDIM1                                  32
     C  N32M0065         IFEQ      'CUSDEC'
     C     M1001         ANDEQ     'TET'
     C                   DELETE    EDIMR
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   GOTO      STKL3
     C                   END
     C                   EXSR      MOVKD2
     C                   WRITE     EDIMR
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVKD1        BEGSR
      ***********************************************
     C                   MOVE      M0068A        X0068A
     C                   MOVE      M0068B        X0068B
      *
     C                   ENDSR
      *
      ***********************************************
     C     MOVKD2        BEGSR
      ***********************************************
     C                   MOVE      X0004         M0004
     C                   MOVE      X0010         M0010
     C                   MOVE      W0035         M0035
     C                   MOVE      *BLANKS       M0062
     C                   MOVEL     X14S          M0062
     C                   MOVE      'CUSDEC'      M0065
     C                   MOVE      X0068A        M0068A
     C                   MOVE      X0068B        M0068B
     C                   MOVE      *ZEROS        M0068C
     C                   MOVE      *BLANKS       M0068
     C                   MOVEL     X0004         X0068Æ
     C                   MOVEL     X0068Å        M0068
     C                   MOVE      *ZEROS        M0068D
     C                   MOVE      *ZEROS        M0068E
     C                   MOVE      *ZEROS        M0068F
     C                   MOVE      'TET'         M1001
     C                   MOVE      *BLANKS       M1004
     C                   MOVE      W1N07         M1225
     C                   MOVE      *ZEROS        M2005B
     C                   MOVE      *ZEROS        M3039D
     C                   MOVE      *ZEROS        M3039E
     C                   MOVE      *ZEROS        M5004D
     C                   MOVE      W1N07         M1N07
     C                   MOVE      *BLANKS       M1N08
      *
     C                   MOVE      *ZEROS        MSN
     C                   Z-ADD     CMN           MMN
     C                   MOVE      'S'           MSR
     C                   MOVE      *BLANKS       MST
     C                   MOVE      *ZEROS        MDT
     C                   MOVE      *ZEROS        MTM
     C                   MOVE      THAVD         MAVD
     C                   MOVE      THTDN         MTDN
     C                   MOVE      *ZEROS        MFFBNR
     C                   MOVE      WVEN          MVEN
      *
     C                   ENDSR
      *
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *LIKE         DEFINE    MSR           XSR1
     C     *LIKE         DEFINE    MSR           X1STA
     C     *LIKE         DEFINE    M0068A        MAX0B
     C     *LIKE         DEFINE    M0068B        MAX0C
     C     *LIKE         DEFINE    M0068C        MAX0D
     C     *LIKE         DEFINE    S0004         X0004
     C     *LIKE         DEFINE    S0010         X0010
     C     TRHKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C     TRK01K        KLIST
     C                   KFLD                    YUNIK             3
     C                   KFLD                    YKODE            10
     C     MAKDCK        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    MAX0B
     C                   KFLD                    MAX0C
     C                   KFLD                    MAX0D
     C     MAKD2K        KLIST
     C                   KFLD                    XSR1
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C     M2KDCK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    MAX0B
     C                   KFLD                    MAX0C
     C                   KFLD                    MAX0D
     C     M2KD2K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C     TVIM1K        KLIST
     C                   KFLD                    X1STA
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
     C     TVINDK        KLIST
     C                   KFLD                    M0068A
      *
     C     *ENTRY        PLIST
     C     UPARM2        PARM                    UPARM1          128
     C                   PARM                    UFLAGG            1 0
      *
     C                   MOVE      UIN34         *IN34
     C                   MOVE      U1N07         W1N07
     C     U1N07         COMP      '014'                                  27
      *
     C                   MOVE      'R'           XSR1
     C                   MOVE      *ZEROS        M0068A
     C                   MOVE      '99999999'    MAX0B
     C                   MOVE      '999999'      MAX0C
     C                   MOVE      '99'          MAX0D
      *
     C     UAVD          CHAIN     TRUSTD                             33
     C                   MOVE      S0035         W0035
     C                   MOVE      S0004         X0004
     C                   MOVE      S0010         X0010
     C                   MOVE      *BLANKS       WVEN
     C     TRHKEY        CHAIN(N)  TRUH                               33
N01  C     TRHKEY        CHAIN     TRUHFV                             33
N01  C  N33              EVAL      *IN28 = *ON
      *
     C                   MOVE      '0'           *IN12
      *
     C                   ENDSR
      *
