      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED VAREVERDI                  ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 05 07-11 13-24
      *** LEDIGE INDIKATORER 27 29 31 32 34-88 95-97
      ***********************************************************
      *
     FKODTVAL2  IF   E           K DISK
     FTR026D    CF   E             WORKSTN SFILE(SUBFIL:ZRECNO)
     F                                     INFDS(FBAREA)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *
     C                   IF        UBL <> 0
     C                   MOVE      '1'           *IN28
     C                   MOVE      UBL           WSBL
     C                   MOVE      UVAL          WSVAL
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
      *
     C     ZRECNO        IFEQ      0
     C                   Z-ADD     4             LINNBR
     C                   ELSE
     C                   Z-ADD     5             LINNBR
     C                   END
     C                   Z-ADD     2             POSNBR
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   MOVE      '0'           *IN28
     C                   MOVE      '1'           *IN94
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C                   MOVE      '0'           *IN90
      *
     C   03              DO
     C                   EXSR      OPPDAT
     C                   Z-ADD     3             UFLAGG
     C                   GOTO      SLUTT
     C                   END
      *
     C   12              Z-ADD     1             UFLAGG
     C   12              GOTO      SLUTT
      *
     C   06              DO
     C                   EXSR      CRTVV
     C                   GOTO      START3
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              MOVE      '0'           *IN98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       5             LINNBR
     C                   MVR                     XLIN              2 0
     C     XLIN          IFEQ      0
     C                   Z-ADD     5             LINNBR
     C                   ELSE
     C                   Z-ADD     XLIN          LINNBR
     C                   END
     C  N98WSNR          IFEQ      '2'
     C     WSVAL         COMP      '*DL'                                  98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGVV
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     WSVAL         COMP      '*DL'                                  98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTVV
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C                   ADD       3             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     CRTVV         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        W2BL
     C                   MOVE      *BLANKS       W2VAL
     C                   Z-ADD     9             LINNBR
     C                   Z-ADD     13            POSNBR
      *
     C     STCRT         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00'          *IN(89)
     C                   MOVE      '0'           *IN30
      *
     C   12              GOTO      SLCRT
     C   04              DO
     C                   CALL      'SAD061F'
     C                   PARM                    W2VAL
     C                   PARM                    XDT
     C                   GOTO      STCRT
     C                   END
      *
     C                   IF        W2BL = 0
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN90
     C                   MOVE      'SPB0007'     MSGNR
     C                   GOTO      STCRT
     C                   END
     C     W2VAL         CHAIN     KODTVAL2                           89
     C                   IF        *IN89
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPV0001'     MSGNR
     C                   GOTO      STCRT
     C                   END
      *
     C                   ADD       1             YRECNO
     C                   MOVE      YRECNO        ZRECNO
     C                   MOVE      W2BL          WSBL
     C                   MOVE      W2VAL         WSVAL
     C                   WRITE     SUBFIL
     C                   WRITE     SUBCTL
      *
     C     SLCRT         TAG
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C                   ENDSR
      *
     C***********************************************
     C     CHGVV         BEGSR
     C***********************************************
     C                   MOVE      WSBL          W2BL
     C                   MOVE      WSVAL         W2VAL
     C                   MOVE      ' '           WSNR
      *
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00'          *IN(89)
     C                   MOVE      '0'           *IN30
      *
     C   12              GOTO      SLCHG
     C   04              DO
     C                   CALL      'SAD061F'
     C                   PARM                    W2VAL
     C                   PARM                    XDT
     C                   GOTO      STCHG
     C                   END
      *
     C                   IF        W2BL = 0
     C                   MOVE      '1'           *IN30
     C                   MOVE      '1'           *IN90
     C                   MOVE      'SPB0007'     MSGNR
     C                   GOTO      STCHG
     C                   END
     C     W2VAL         CHAIN     KODTVAL2                           89
     C                   IF        W2BL = 0
     C                   MOVE      '1'           *IN30
     C                   MOVE      'SPV0001'     MSGNR
     C                   GOTO      STCHG
     C                   END
      *
     C                   MOVE      W2BL          WSBL
     C                   MOVE      W2VAL         WSVAL
      *
     C     SLCHG         TAG
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     DLTVV         BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        WSBL
     C                   MOVE      '*DL'         WSVAL
     C                   MOVE      *BLANKS       WSNR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     OPPDAT        BEGSR
     C***********************************************
     C                   MOVE      *ZEROS        UBL
     C     1             DO        YRECNO        ZRECNO
     C     ZRECNO        CHAIN     SUBFIL                             33
     C                   IF        WSVAL <> '*DL'
     C                   IF        WSVAL <> UVAL
     C     KODTVAL2K1    SETLL     KODTVAL2
     C     WSVAL         READPE    KODTVAL2                               33
     C     WSBL          MULT      KVAKRS        XWORK            15 5
     C     XWORK         DIV(H)    KVAOMR        WSBL
     C                   IF        UFIVAL <> UVAL
     C     KODTVAL2K2    SETLL     KODTVAL2
     C     UVAL          READPE    KODTVAL2                               33
     C     WSBL          DIV(H)    KVAKRS        XWORK            15 5
     C     XWORK         MULT(H)   KVAOMR        WSBL
     C                   END
     C                   END
     C                   ADD       WSBL          UBL
     C                   END
     C                   ENDDO
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KODTVAL2K1    KLIST
     C                   KFLD                    WSVAL
     C                   KFLD                    XDT
     C     KODTVAL2K2    KLIST
     C                   KFLD                    UVAL
     C                   KFLD                    XDT
      *
     C     *ENTRY        PLIST
     C                   PARM                    UBL              11 0
     C                   PARM                    UVAL              3
     C                   PARM                    UFIVAL            3
     C                   PARM                    UFLAGG            1 0
      *
     C                   WRITE     WINDOWSZ
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           XDT               8 0
      *
     C                   ENDSR
      *
