      *
      ***********************************************************
      *** PROGRAM SKAL ARBEIDE MED VAREBEKSRIVELSE            ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      *** LEDIGE INDIKATORER 01 02 06-11 13-24
      *** LEDIGE INDIKATORER 28 29 31 32 34-88 95-97
      ***********************************************************
      *
     FTRUVVT    UF A E           K DISK
     FTRKODL01  IF   E           K DISK
     FTR024D    CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
      *
     C                   EXSR      INIT
      *
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C     UVT           IFNE      *BLANKS
     C                   MOVE      UVT           TVVT
     C                   MOVE      UVTSK         TVVTSK
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C                   END
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     TRVVTK        SETLL     TRUVVT
     C     TRVVTK        READE(N)  TRUVVT                                 94
      *
     C     *IN94         DOWEQ     '0'
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     TRVVTK        READE(N)  TRUVVT                                 94
     C  N94              END
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     ZRECNO        IFGT      0
     C                   Z-ADD     1             ZRECNO
     C                   END
     C                   Z-ADD     4             LINNBR
     C                   Z-ADD     2             POSNBR
      *
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
      *
     C                   SETOFF                                       9830
     C                   MOVE      '0'           *IN90
     C   03
     COR 12              GOTO      SLUTT
      *
     C   04              DO
     C                   MOVE      '012'         UUNIK             3
     C                   MOVE      *BLANKS       UKODE            10
     C                   MOVEL     W2VTSK        UKODE
     C                   CALL      'TR002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2            3
     C                   MOVEL     UKODE         W2VTSK
     C                   GOTO      START3
     C                   END
      *** FRISK OPP
     C   05              DO
     C  N27              EXSR      OPDFIL
     C                   GOTO      START
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C                   EXSR      CRTVT
     C                   GOTO      START3
     C                   END
      *
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C                   END
     C                   GOTO      START3
      *
     C     SLUTT         TAG
     C  N27              EXSR      OPDFIL
     C                   SETON                                        LR
     C                   RETURN
      *
     C***********************************************
     C     OPDFIL        BEGSR
     C***********************************************
     C     TRVVTK        SETLL     TRUVVT
     C     TRVVTK        READE     TRUVVT                                 33
     C     *IN33         DOWEQ     '0'
     C                   DELETE    TRUVVTR
     C     TRVVTK        READE     TRUVVT                                 33
     C  N33              ENDDO
      *
     C                   MOVE      *BLANKS       UVT
     C                   MOVE      *BLANKS       UVTSK
     C     YRECNO        IFGT      0
     C     1             CHAIN     SUBFIL                             33
     C     TVVT          IFNE      '*DELETE'
     C                   MOVE      TVVT          UVT
     C                   MOVE      TVVTSK        UVTSK
     C                   END
     C     2             DO        YRECNO        ZRECNO
     C     ZRECNO        CHAIN     SUBFIL                             33
     C     TVVT          IFNE      '*DELETE'
     C     UVT           IFEQ      *BLANKS
     C                   MOVE      TVVT          UVT
     C                   MOVE      TVVTSK        UVTSK
     C                   ELSE
     C                   WRITE     TRUVVTR
     C                   END
     C                   END
     C                   ENDDO
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   MOVEA     '00'          *IN(98)
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              MOVE      '0'           *IN98
     C                   GOTO      SLHENT
     C                   END
     C  N98WSNR          IFEQ      '2'
     C     TVVT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      CHGVT
     C                   END
     C  N98WSNR          IFEQ      '4'
     C     TVVT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C                   EXSR      DLTVT
     C                   END
     C                   END
      *
     C     SLHENT        TAG
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     CRTVT         BEGSR
     C***********************************************
     C     W2VT          COMP      *BLANKS                                90
     C     *IN90         IFEQ      '1'
     C                   MOVE      'YBC0826'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLCRT
     C                   END
      *
     C     W2VTSK        IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     W2VTSK        YKODE
     C     TRK01K        CHAIN     TRKODL01                           89
     C     *IN89         IFEQ      '1'
     C                   MOVE      'YBC0810'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      SLCRT
     C                   END
     C                   END
      *
     C                   MOVE      W2VT          TVVT
     C                   MOVE      W2VTSK        TVVTSK
     C                   ADD       1             YRECNO
     C                   MOVE      YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   MOVE      *BLANKS       W2NR
     C                   MOVE      *BLANKS       W2VT
     C                   MOVE      *BLANKS       W2VTSK
      *
     C     SLCRT         ENDSR
      *
     C***********************************************
     C     CHGVT         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   MOVE      TVVT          WSVT
     C                   MOVE      TVVTSK        WSVTSK
      *
     C     STCHG         TAG
     C                   EXFMT     VARELI
     C                   MOVEA     '00'          *IN(89)
     C                   MOVE      '0'           *IN30
      *
     C   04              DO
     C                   MOVE      '012'         UUNIK
     C                   MOVE      *BLANKS       UKODE
     C                   MOVEL     WSVTSK        UKODE
     C                   CALL      'TR002R'
     C                   PARM                    UUNIK
     C                   PARM                    UKODE
     C                   PARM                    UTYPE2            3
     C                   MOVEL     UKODE         WSVTSK
     C                   GOTO      STCHG
     C                   END
     C   12              GOTO      SLCHG
      *
     C     WSVT          COMP      *BLANKS                                90
     C     *IN90         IFEQ      '1'
     C                   MOVE      'YBC0826'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      STCHG
     C                   END
      *
     C     WSVTSK        IFNE      *BLANKS
     C                   MOVE      '012'         YUNIK
     C                   MOVE      *BLANKS       YKODE
     C                   MOVEL     WSVTSK        YKODE
     C     TRK01K        CHAIN     TRKODL01                           89
     C     *IN89         IFEQ      '1'
     C                   MOVE      'YBC0810'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      STCHG
     C                   END
     C                   END
      *
     C                   MOVE      WSVT          TVVT
     C                   MOVE      WSVTSK        TVVTSK
      *
     C     SLCHG         TAG
     C                   MOVE      *BLANKS       WSNR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     DLTVT         BEGSR
     C***********************************************
     C                   MOVE      '1'           *IN99
     C                   MOVE      *BLANKS       TVVT
     C                   MOVEL     '*DELETE'     TVVT
     C                   MOVE      *BLANKS       TVVTSK
     C                   MOVE      *BLANKS       WSNR
     C                   UPDATE    SUBFIL
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     TRVVTK        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    ULI
     C     TRK01K        KLIST
     C                   KFLD                    YUNIK             3
     C                   KFLD                    YKODE            10
      *
     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              7 0
     C                   PARM                    ULI               5 0
     C                   PARM                    UVT              48
     C                   PARM                    UVTSK             2
     C     *IN27         PARM      *IN27         UIN27             1
      *
     C                   WRITE     WINDOWSZ
     C                   MOVE      UAVD          TVAVD
     C                   MOVE      UTDN          TVTDN
     C                   MOVE      ULI           TVLI
      *
     C                   ENDSR
      *
