     FTRUH06    IF   E           K DISK
     FTRUSTD    IF   E           K DISK
     FKODTP     IF   E           K DISK
      * Nøkler
     C     TRSTDK        KLIST
     C                   KFLD                    THAVD
     C     TRH06K        KLIST
     C                   KFLD                    WWS
     C                   KFLD                    WST
     C     KODKEY        KLIST
     C                   KFLD                    WOPUNI
     C                   KFLD                    WOPAVD
     C                   KFLD                    WOPLNR
      * Parameterlist
     C     *ENTRY        PLIST
     C                   PARM      UAVD          UAVD              4 0
     C                   PARM      UMRKP         UMRKP            10
     C     UWS           PARM                    UWS              10
     C                   PARM      UOK           UOK               1
     C                   PARM      UOKPRT        UOKPRT            1
      * Work fields
     C     *LIKE         DEFINE    THWS          WWS
     C     *LIKE         DEFINE    THST          WST
     C                   MOVE      UWS           WWS
     C     *LIKE         DEFINE    KOPAVD        WOPAVD
     C     *LIKE         DEFINE    KOPUNI        WOPUNI
     C     *LIKE         DEFINE    KOPLNR        WOPLNR
     C                   Z-ADD     0             WOPAVD
     C                   MOVE      'P'           WOPUNI
     C                   Z-ADD     0             WOPLNR
      * LES FØRSTE GJYLDIGE OPPDRAG
     C                   MOVE      'L'           WST
     C     TRH06K        CHAIN     TRUH06                             51
     C   51              MOVE      'Å'           WST
     C   51TRH06K        CHAIN     TRUH06                             51
      * HENTE AVDELINGSPARAMETRAR
     C  N51TRSTDK        CHAIN     TRUSTD                             51
     C     *IN51         IFEQ      '0'
     C                   Z-ADD     THAVD         UAVD
     C                   Z-ADD     THAVD         WOPAVD
     C                   Z-ADD     97            WOPLNR
     C     KODKEY        CHAIN     KODTP                              33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KOPNVN        UMRKP
     C                   ENDIF
     C                   MOVE      'J'           UOK
     C                   MOVE      'J'           UOKPRT
     C                   ELSE
     C                   MOVE      'N'           UOK
     C                   MOVE      'N'           UOKPRT
     C                   END
      *
     C                   MOVE      '1'           *INLR
