     FEDIMA     IF   E           K DISK
     F                                     RENAME(EDIMR:EDIMRA)
     FEDIM      UF   E           K DISK
     FTRIH      UF   E           K DISK
     FEDIS5     IF   E           K DISK
     FEDII      IF   E           K DISK
     D                 DS
     D  SMBR                   1     10
     D  SMBR1                  1      1
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    MSR           WSR
     C     *LIKE         DEFINE    MST           WST
     C     *LIKE         DEFINE    SST           WST2
     C     *LIKE         DEFINE    SST           WST2A
     C     *LIKE         DEFINE    SST           WST2B
     C     *LIKE         DEFINE    *IN20         WIN20
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSR
     C                   KFLD                    WST
     C     KEYB          KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C     KEYC          KLIST
     C                   KFLD                    M0004
     C                   KFLD                    M0010
     C                   KFLD                    WSR
     C                   KFLD                    WST2
     C     KEYCA         KLIST
     C                   KFLD                    M0004
     C                   KFLD                    M0010
     C                   KFLD                    WSR
     C                   KFLD                    WST2A
     C     KEYCB         KLIST
     C                   KFLD                    M0004
     C                   KFLD                    M0010
     C                   KFLD                    WSR
     C                   KFLD                    WST2B
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM      *IN20         WIN20
      *_____________
      * Init av felt
      *"""""""""""""
     C                   MOVE      'S'           WSR
     C                   MOVE      *BLANKS       WST
     C                   MOVE      *BLANKS       WST2
     C                   MOVE      'A'           WST2A
     C                   MOVE      'B'           WST2B
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      WDT           WDT8              8 0
     C                   MOVE      WTM           WTM6              6 0
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Bearbeide Formater                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *________________________________
      * Oppdatere status i meldingslogg
      *""""""""""""""""""""""""""""""""
     C     KEYA          SETLL     EDIMA
     C     KEYA          READE     EDIMA                                  51
     C     *IN51         DOWEQ     '0'                                          1<-B
      *
     C     MMN           CHAIN     EDIM                               5530
     C     *IN55         CABEQ     *ON           STSRB4
     C     *IN30         CABEQ     *ON           STSRB4
      *
     C     MVEN          IFEQ      *BLANKS                                       2<-B
     C     M0065         ANDEQ     'CUSDEC'
     C     M1001         ANDEQ     'TEI'
     C     M1N07         IFEQ      '007'
     C     M1N07         OREQ      '044'
     C     MDT           CABGT     WDT8          STSRB4
     C     MDT           IFEQ      WDT8
     C     MTM           CABGT     WTM6          STSRB4
     C                   END
      *
     C     KEYC          SETLL     EDIS5                              52
     C     STSRB1        TAG
     C     KEYC          READE     EDIS5                                  52
     C  N52SMBR1         IFNE      'E'
     C                   GOTO      STSRB1
     C                   END
      *
     C   52              DO
     C     KEYCA         SETLL     EDIS5                              53
     C     STSRB2        TAG
     C     KEYCA         READE     EDIS5                                  53
     C  N53SMBR1         IFNE      'E'
     C                   GOTO      STSRB2
     C                   END
     C                   END
      *
     C   52
     CAN 53              DO
     C     KEYCB         SETLL     EDIS5                              54
     C     STSRB3        TAG
     C     KEYCB         READE     EDIS5                                  54
     C  N54SMBR1         IFNE      'E'
     C                   GOTO      STSRB3
     C                   END
     C                   END
      *
     C     *IN52         IFEQ      '1'
     C     *IN53         ANDEQ     '1'
     C     *IN54         ANDEQ     '1'
     C     M0004         SETLL     EDII                                   57
     C     M0010         SETLL     EDII                                   58
     C     KEYB          CHAIN     TRIH                               33
     C  N33              MOVE      '+'           TIST
     C  N33
     CANN57              MOVE      'E'           TIST
     C  N33
     CANN58              MOVE      'E'           TIST
     C  N33              UPDATE    TRIHR
     C  N33              MOVE      '+'           MST
     C  N33
     CANN57              MOVE      'E'           MST
     C  N33
     CANN58              MOVE      'E'           MST
     C                   MOVE      '1'           *IN20
     C                   ENDIF
     C                   ENDIF                                                     3<-E
     C                   ENDIF                                                   2<-E
      *
     C                   UPDATE    EDIMR                                30
     C     STSRB4        TAG
     C     KEYA          READE     EDIMA                                  51
     C  N51              ENDDO                                                  1<-E
     C                   ENDSR
