********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 VAREBESKRIVELSE ER ENDRET
10XXX * 02 YBC PTF10 FEILRETTING PÅ GIR-SEGMENT
10XXX * 03 YBC PTF10 HEL MANGO IKKE SENDER T? PÅ LINJE
10XXX * 04 YBC PTF10 INNGÅENDE DOKUMENT KAN MANGLE DOK.REF.
10XXX * 05 YBC PTF10 IKKE SEND T1/T2 VED HELMANKO
10XXX * 06 YBC PTF10 IKKE SEND + VED MANGLE DOK.REF. RETTELSE PÅ ENDRING 4
10XXX * 07 YBC PTF10 IKKE SEND "+++++T1" ved MERKENAD
10XXX * 08 YBC PTF10 FEILRETTING PÅ DOC37
10XXX * 09 YBC PTF10 SEND LIKE ANTALL SIFRE TARIFFNR SOM INNGÅENDE
      *              SISTE SIFRE I TVVNT = ANTALL INNGÅENDE SIFRE
10026 * 10 YBC PTF10 ORGINAL LENGDE PÅ EN DEL FELTER
10043 * 11 YBC PTF10 SEND STYKK VED ENHETKODE = 'NF'
10160 * 12 YBC PTF10 IKKE SEND NETTOVEKT HVIS NETTOVEKT ER 0.
10189 * 13 YBC PTF10 IKKE SEND BRUTTOVEKT HVIS BRUTTOVEKT ER 0.
10250 * 14 YBC PTF10 DOKUMENTKODE ER ENDRET FRA 3A TIL 4A
10253 * 15 YBC PTF10 NY PAKKETYPE VS, BEHANLES SAMME SOM VR
10XXX * 16 YBC PTF10 SEND BESKRIVELSE AV AVVIK PÅ LINJE
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 17 YBC PTF11 SEND DOKUEMNTKODE SELV OM DOKUMENTREF. IKKE FINNES
11XXX * 18 YBC PTF11 IKKE SEND DOC+916:: VED INGEN DOKUMENT
11XXX * 19 YBC PTF11 VED KOLLI=0, TEST VEKT OM DET ER HEL MANKO PÅ LINJE
********************************************************************
     FEDIS      UF   E           K DISK
     FEDIMC     UF   E           K DISK
     FTRIH      UF   E           K DISK
     FTRIHFS    IF   E           K DISK
     FTRIHPK    IF   E           K DISK
     FTRIV      IF   E           K DISK
     FTRIVCN    IF   E           K DISK
     FTRIVFS    IF   E           K DISK
     FTRIL03    IF   E           K DISK
     FTRILCN    IF   E           K DISK
     FTRILKL    IF   E           K DISK
     FTRILMN    IF   E           K DISK
     FTRILPK    IF   E           K DISK
     FTRILDK    IF   E           K DISK
N01  FTRILVT    IF   E           K DISK
     FEDIJ2     IF   E           K DISK
     FFIRM      IF   E           K DISK
     FEDISE     O  A E             DISK
     D TS              S              8    DIM(8)                               Transit tollsted
     D FT              S             70    DIM(5)                               Kanselleringsgrunnla
      *____________________
      * DS for input string
      *""""""""""""""""""""
     D                 DS
     D  A                      1     70
     D                                     DIM(70)                              Input string
     D  ADS                    1     70
      *_____________________
      * DS for output string
      *"""""""""""""""""""""
     D                 DS
     D  B                      1     80
     D                                     DIM(80)                              Output string
     D  SDATA                  1     80
      *________________________________________
      * DS for å venstrestille numeriske felter
      *""""""""""""""""""""""""""""""""""""""""
     D                 DS
     D  ØN163                  1     16  3
     D  ØA163H                 1     13
     D  ØA163X                 5     13
     D  ØA163D                14     16
     D                 DS
     D  ØA13                   1     13
     D  Ø13                    1     13
     D                                     DIM(13)                              Num edit
S01  D*                DS
S01  D* TVVT                   1    140
S01  D* TVVT01                 1     70
S01  D* TVVT02                71    140
S01  D* TVVT03                71     71
N09  D                 DS
N09  D  TVVNT                  1      8  0
N09  D  TVVNT1                 1      7  0
N09  D  TVVNT2                 8      8  0
      *//////////////
      *  Hodelogikk /
      *//////////////
      * Initiering av variabler og nøkler
     C                   EXSR      SRA
      * Initiering av sendingsutgang (IBM/NIT)
     C                   EXSR      SRB
      * Plukk SAD og send til Tollvesenet
     C                   EXSR      SRC
      * Avsluttning av sending
     C                   EXSR      SRD
     C                   MOVE      '1'           *INLR
      *
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    SSN           WSN
     C     *LIKE         DEFINE    S0036         W0036
     C     *LIKE         DEFINE    JCLFE         WCLFE
     C     *LIKE         DEFINE    MST           WST
     C     *LIKE         DEFINE    MVEN          WVEN
      *
     C                   MOVE      '+'           WST
     C                   MOVE      *BLANKS       WVEN
     C                   MOVE      *BLANKS       WCLFE
     C                   Z-ADD     0             ØX                2 0
     C                   MOVE      *BLANKS       ØAN              13
     C                   Z-ADD     0             W0074             7 0
     C                   Z-ADD     0             WORK             15 5
     C                   MOVEL     *BLANKS       UWS              10
     C                   MOVEL     'TVINN'       UWS
     C                   MOVE      *BLANKS       XTAR              3
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WSN
     C     KEYB          KLIST
     C                   KFLD                    SSR
     C                   KFLD                    WST
     C                   KFLD                    WVEN
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    S0035
     C     KEYC          KLIST
     C                   KFLD                    S0004
     C                   KFLD                    S0010
     C                   KFLD                    WCLFE
     C     KEYD          KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C     KEYE          KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C                   KFLD                    TVLI
     C     KEYF          KLIST
     C                   KFLD                    MAVD
     C                   KFLD                    MTDN
     C                   KFLD                    TVLI
     C                   KFLD                    TVLI2
     C     TRIVK         KLIST
     C                   KFLD                    TIAVD
     C                   KFLD                    TITDN
     C                   KFLD                    TVLI
      *_____________
      * Init av felt
      *"""""""""""""
      * Hente dagens dato og klokkeslett.
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
      * Workfields for Array's
     C                   Z-ADD     0             AX                2 0          Index for A
     C                   Z-ADD     1             BX                2 0          Index for B
     C                   Z-ADD     0             AXV               2 0          Leftindx A
     C                   Z-ADD     0             AXH               2 0          Rightindx A
     C                   MOVE      'R'           WDIR              1            Search direction
     C                   MOVE      *BLANKS       WCHAR             1            Test character
     C                   MOVE      'Y'           WCHART            1            Test character
     C                   MOVE      *BLANKS       WCONT             5            Continues
      * Workfields for separation character  '
     C                   BITON     '123457'      WAPSTR            1
     C                   BITOFF    '06'          WAPSTR
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WSN           PARM                    WSN
     C                   PARM                    WNETW             1
      *__________________
      * Output parametrer
      *""""""""""""""""""
     C     PLISTA        PLIST
     C                   PARM      S0004         S0004
     C                   PARM      S0010         S0010
      *
     C     *LOVAL        SETLL     FIRM
     C                   READ      FIRM                                   33
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start av file                                        SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
      *_____________________________
      * Hente data fra sendningslogg
      *"""""""""""""""""""""""""""""
     C     KEYA          CHAIN     EDIS                               81
     C                   MOVEL     SMBR          SEMBR
     C                   Z-ADD     0             W0036
      *_______________________________________________
      * Legg in JCL i starten av filen for Kommunedata
      *"""""""""""""""""""""""""""""""""""""""""""""""
     C                   SELECT
     C     WNETW         WHENEQ    '1'
      *
     C                   MOVE      'F'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   ENDSL
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Les meldinger                                        SRC /
      *////////////////////////////////////////////////////////////
     C     SRC           BEGSR
      *_____________________________
      * Legg in UNB-segment (Sendningsstart)
      *_____________________________
     C                   EXSR      UNB00
      *
     C     KEYB          CHAIN     EDIMC                              8182
     C     *IN81         DOWEQ     '0'
     C  N82M0065         IFEQ      'CUSDEC'
     C     M1001         ANDEQ     'TEI'
     C     M1N07         IFEQ      '007'
     C     M1N07         OREQ      '044'
     C     KEYD          CHAIN     TRIH                               82
     C     *IN82         IFEQ      '0'
     C                   MOVE      'A'           TIST
     C                   UPDATE    TRIHR
     C                   Z-ADD     SSN           MSN
     C                   MOVE      'A'           MST
     C                   MOVEL     WDT           MDT
     C                   MOVEL     WTM           MTM
     C                   UPDATE    EDIMR
     C                   SELECT
     C     M1N07         WHENEQ    '007'
     C                   EXSR      ANKOM
     C     M1N07         WHENEQ    '044'
     C                   EXSR      MERKN
     C                   ENDSL
     C                   MOVEA     '00'          *IN(81)
     C                   GOTO      SLSRC
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C     KEYB          READE     EDIMC                                8281
     C  N81              END
      *_____________________________
      * Legg in UNZ (Slutt sendning)
      *"""""""""""""""""""""""""""""
     C     SLSRC         TAG
     C                   EXSR      UNZ00
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Slutt på file                                        SRD /
      *////////////////////////////////////////////////////////////
     C     SRD           BEGSR
      *________________________
      * Oppdatere sendningslogg
      *""""""""""""""""""""""""
     C                   MOVE      'A'           SST
     C                   Z-ADD     W0036         S0036
     C                   UPDATE    EDISR
      *_______________________________________________
      * Legg in JCL i slutten av filen for Kommunedata
      *"""""""""""""""""""""""""""""""""""""""""""""""
     C     WNETW         IFEQ      '1'
     C                   MOVE      'E'           WCLFE
     C     KEYC          CHAIN     EDIJ2                              81
     C     *IN81         DOWEQ     '0'
     C                   MOVE      JCLC          SDATA
     C                   WRITE     EDISER
     C     KEYC          READE     EDIJ2                                  81
     C  N81              END
     C                   END
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Lage EDI-fact for ankomstmelding                           /
      */////////////////////////////////////////////////////////////
     C     ANKOM         BEGSR
      *
     C                   EXSR      UNH00
     C                   EXSR      BGM00
     C                   EXSR      LOC00
     C                   EXSR      DTM00
     C                   EXSR      GIS00
     C                   EXSR      FTX00
     C     KEYD          SETLL     TRIV
     C     KEYD          READE     TRIV                                   33
     C     *IN33         DOWEQ     '0'
     C                   EXSR      RFF01
     C     KEYD          READE     TRIV                                   33
     C  N33              ENDDO
     C                   EXSR      NAD06
     C                   EXSR      UNS00A
     C                   EXSR      UNS00B
     C                   EXSR      UNT00
      *
     C                   ENDSR
      */////////////////////////////////////////////////////////////
      * Lage EDI-fact for merknader                                /
      */////////////////////////////////////////////////////////////
     C     MERKN         BEGSR
      *
     C                   EXSR      UNH00
     C                   EXSR      BGM00
     C                   EXSR      LOC00
     C                   EXSR      MEA00
     C                   EXSR      SEL00
     C                   EXSR      FTX00
     C                   EXSR      TDT04
     C                   EXSR      NAD06
     C                   EXSR      TOD07
     C                   EXSR      UNS00A
     C                   EXSR      CST30
     C                   EXSR      UNS00B
     C                   EXSR      CNT00
     C                   EXSR      UNT00
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Sendningsstart                                     UNB00 /
      *////////////////////////////////////////////////////////////
     C     UNB00         BEGSR
      *______________
      * START SEGMENT
      *""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNB+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *______________________
      * SYNTAX IDENTIFIKASJON
      *""""""""""""""""""""""
      * Identifikasjon og versjon
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNOC:3+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________________
      * OVERFØRINGSAVSENDER
      *""""""""""""""""""""
      * Identifikasjon
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     S0004         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________________
      * OVERFØRINGSMOTTAKER
      *""""""""""""""""""""
      * Identifikasjon og Qualifier
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     S0010         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________________________________________
      * DATO/TID FOR FREMSTILLING AV OVERFØRINGEN
      *""""""""""""""""""""""""""""""""""""""""""
      * Dato
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     SDT           ADS
     C                   Z-ADD     3             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Tid
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     STM           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *________________________
      * OVERFØRINGENS REFERANSE
      *""""""""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     S0020         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   EXSR      SRÅ
      *______________________________________________
      * APPLIKASJONSREFERANSE (Kun hvis nettverk=IBM)
      *""""""""""""""""""""""""""""""""""""""""""""""
     C     WNETW         IFEQ      '2'                                          <----------I
      *                                                               I
     C                   MOVE      *BLANKS       ADS                                       I
     C                   MOVEL     '++'          ADS                                       I
     C                   Z-ADD     1             AXV                                       I
     C                   Z-ADD     2             AXH                                       I
     C                   MOVE      'N'           WCHART                                    I
     C                   EXSR      SRÅ                                                     I
      *                                                               I
     C                   MOVE      *BLANKS       ADS                                       I
     C                   MOVEL     S0026         ADS                                       I
     C                   Z-ADD     1             AXV                                       I
     C                   Z-ADD     14            AXH                                       I
     C                   EXSR      SRÅ                                                     I
      *                                                               I
     C                   END                                                    <----------I
      *______________
      * TESTINDIKATOR
      *""""""""""""""
     C     S0035         IFGT      '0'                                          <----------I
     C                   MOVE      *BLANKS       ADS                                       I
     C                   SELECT
     C     WNETW         WHENEQ    '1'                                           <--------II
     C                   MOVEL     '++++++'      ADS                                      II
     C                   Z-ADD     1             AXV                                      II
     C                   Z-ADD     6             AXH                                      II
     C     WNETW         WHENEQ    '2'                                           <--------II
     C                   MOVEL     '++++'        ADS                                      II
     C                   Z-ADD     1             AXV                                      II
     C                   Z-ADD     4             AXH                                      II
     C                   OTHER                                                   <--------II
     C                   MOVEL     '++++++'      ADS                                      II
     C                   Z-ADD     1             AXV                                      II
     C                   Z-ADD     6             AXH                                      II
     C                   ENDSL                                                   <--------II
     C                   MOVE      'N'           WCHART                                    I
     C                   EXSR      SRÅ                                                     I
      *                                                               I
     C                   MOVE      *BLANKS       ADS                                       I
     C                   MOVEL     S0035         ADS                                       I
     C                   Z-ADD     1             AXV                                       I
     C                   Z-ADD     1             AXH                                       I
     C                   EXSR      SRÅ                                                     I
     C                   END                                                    <----------I
      *______________
      * SLUTT SEGMENT
      *""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Meldingsstart                                      UNH00 /
      *////////////////////////////////////////////////////////////
     C     UNH00         BEGSR
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   Z-ADD     1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNH+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Meldingsreferanse
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     M0062         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Meldingstype  (= CUSDEC)
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     M0065         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':D:96B:U'    ADS
     C                   SELECT
     C     M1N07         WHENEQ    '007'
     C                   MOVEA     'N:CC007A'    A(9)
     C     M1N07         WHENEQ    '044'
     C                   MOVEA     'N:CC044A'    A(9)
     C                   ENDSL
     C                   Z-ADD     1             AXV
     C                   Z-ADD     16            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Start på melding                                   BGM00 /
      *////////////////////////////////////////////////////////////
     C     BGM00         BEGSR
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'BGM++'       ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
      * MRN-nr
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITRNR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     18            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Stedsangivelse                                     LOC00 /
      *////////////////////////////////////////////////////////////
     C     LOC00         BEGSR
     C     M1N07         CABEQ     '044'         STLOC
      *___________
      * Godsnummer
      *"""""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'LOC+60+:'    ADS
     C                   MOVEA     '::'          A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIGN          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+++'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIGNSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *______________________________
      * Kode for avtalt lageringssted
      *""""""""""""""""""""""""""""""
      * Segmentnavn
     C     TIENKL        IFEQ      'N'
     C     TIALSK        ANDNE     *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'LOC+20+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIALSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
      *
     C     TIALS         IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':::'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIALS         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C     TIALSS        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+++'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIALSS        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *______________________
      * Godkjent lagringssted
      *""""""""""""""""""""""
      * Segmentnavn
     C     TIENKL        IFEQ      'J'
     C     TIGLSK        ANDNE     *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'LOC+84+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIGLSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *____________________
      * Avtalt kontrollsted
      *""""""""""""""""""""
     C     TIENKL        IFEQ      'N'
     C     TIACTS        ANDNE     *BLANKS
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'LOC+26+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIACTS        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *______________________
      * Fremleggelsestollsted
      *""""""""""""""""""""""
      * Segmentnavn
     C     STLOC         TAG
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'LOC+22+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITSB         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Dato                                               DTM00 /
      *////////////////////////////////////////////////////////////
     C     DTM00         BEGSR
      *_________________
      * Deklarasjonsdato
      *"""""""""""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'DTM+132:'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WDT           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Generell indikator                                 GIS00 /
      *////////////////////////////////////////////////////////////
     C     GIS00         BEGSR
      * Segmentnavn
      * W0074  --->  Teller for antall segment
      * Normal eller forenklet prosedyre
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'GIS+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     TIENKL        IFEQ      'J'
     C                   MOVEL     '1'           ADS
     C                   ELSE
     C                   MOVEL     '0'           ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':119'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Mål                                                MEA00 /
      *////////////////////////////////////////////////////////////
     C     MEA00         BEGSR
      *_________________
      * Total Bruttovekt
      *"""""""""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'MEA+WT+A'    ADS
     C                   MOVEA     'AD+KGM:'     A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Bruttovekt
     C                   MOVE      *BLANKS       ADS
     C                   Z-ADD     TIVKB         ØN163
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Forsegling                                         SEL00 /
      *////////////////////////////////////////////////////////////
     C     SEL00         BEGSR
      *
     C     NIDANT        IFGT      0
     C     KEYD          SETLL     TRIHFS
     C                   MOVE      '0'           *IN33
     C     SEL01T        TAG
      *___________
      * Forsegling
      *"""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'SEL+0+::'    ADS
     C                   MOVE      ':'           A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     NIDFKD        IFEQ      *BLANKS
     C                   MOVEL     TIDFKD        ADS
     C                   ELSE
     C                   MOVEL     NIDFKD        ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     20            AXH
     C                   EXSR      SRÅ
      *
     C     NIDFSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIDFSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C  N33KEYD          READE     TRIHFS                                 33
     C  N33              GOTO      SEL01T
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Fritekster                                         FTX00 /
      *////////////////////////////////////////////////////////////
     C     FTX00         BEGSR
      *_____________________
      * Språkkode for dialog
      *"""""""""""""""""""""
     C     M1N07         IFEQ      '007'
     C     TISKB         ANDNE     *BLANKS
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ACB+'    ADS
     C                   MOVEA     '+++'         A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     11            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TISKB         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *__________________
      * Kontroll resultat
      *""""""""""""""""""
     C     M1N07         IFEQ      '044'
     C     NIKONF        ANDEQ     0
      * OT = ANDRE TING
      * W0074  --->  Teller for antall segment
     C     NICTB         IFNE      *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+'           A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *___________________
      * Kontroll indikator
      *"""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'OT'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________
      * Beskrivelse
      *""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTB         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
      *
     C     NICTSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________
      * Srpåkkode
      *""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
      * DI = ENDRING (I VAREPOST)
     C     NIVPOS        IFNE      0
     C     NIVPOS        ANDNE     TIVPOS
     C     NIVPOS        OREQ      -1
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+DI+5:::'    A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     16            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_________
      * Ny verdi
      *"""""""""
     C                   MOVE      *BLANKS       ADS
     C     NIVPOS        IFEQ      -1
     C                   MOVEL     '0'           ADS
     C                   ELSE
     C                   Z-ADD     NIVPOS        ØN163
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      * DI = ENDRING (I KOLLI)
     C     NINTK         IFNE      0
     C     NINTK         ANDNE     TINTK
     C     TINTK         ANDGT     0
     C     NIVKB         OREQ      -1
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+DI+6:::'    A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     16            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_________
      * Ny verdi
      *"""""""""
     C                   MOVE      *BLANKS       ADS
     C     NIVKB         IFEQ      -1
     C                   MOVEL     '0'           ADS
     C                   ELSE
     C                   Z-ADD     NINTK         ØN163
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      * DI = ENDRING (I VEKT)
     C     NIVKB         IFNE      0
     C     NIVKB         ANDNE     TIVKB
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+DI+35::'    A(9)
     C                   MOVEA     ':'           A(17)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_________
      * Ny verdi
      *"""""""""
     C                   MOVE      *BLANKS       ADS
     C     NIVKB         IFEQ      -1
     C                   MOVEL     '0'           ADS
     C                   ELSE
     C                   Z-ADD     NIVKB         ØN163
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      * DI = ENDRING (ANDRE)
     C     NICTB2        IFNE      *BLANKS
     C     NICTP         ORNE      *BLANKS
     C     KEYD          SETLL     TRIHPK
     C                   MOVE      '0'           *IN33
     C     FTX01T        TAG
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+'           A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *___________________
      * Kontroll indikator
      *"""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'DI'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________________
      * Peker til attributt
      *""""""""""""""""""""
     C     NICTP         IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTP         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________
      * Beskrivelse
      *""""""""""""
     C     NICTB2        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTB2        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
     C                   MOVEL     *BLANKS       NICTB2
     C                   END
      *
     C     NICTNV        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '::'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_________
      * Ny verdi
      *"""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTNV        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C     NICTSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________
      * Srpåkkode
      *""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NICTSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C  N33KEYD          READE     TRIHPK                                 33
     C  N33              GOTO      FTX01T
     C                   END
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Referanser                                         RFF01 /
      *////////////////////////////////////////////////////////////
     C     RFF01         BEGSR
      *__________________
      * Sted for hendelse
      *""""""""""""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'RFF+AIV:'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVST          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *
     C     TVSTSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVSTSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      DTM01
     C                   EXSR      PAC02
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  CTL Kontroll                                       DTM01 /
      *////////////////////////////////////////////////////////////
     C     DTM01         BEGSR
      *_____________
      * CTL Kontroll
      *"""""""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'DTM+311:'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVCTL         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Hendelser underveis                                PAC02 /
      *////////////////////////////////////////////////////////////
     C     PAC02         BEGSR
      *__________________
      * Land for hendelse
      *""""""""""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PAC+2+++'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVSTLK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *___________________
      * Flagg for hendelse
      *"""""""""""""""""""
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PAC+3+'      ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVFLG         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVFLG         IFEQ      1
     C                   EXSR      PCI031
     C                   END
      *___________
      * Forsegling
      *"""""""""""
     C     TVDANT        IFNE      0
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PAC+4+++'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVDANT        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      PCI032
     C     TRIVK         SETLL     TRIVFS
     C     TRIVK         READE     TRIVFS                                 34
     C     *IN34         DOWEQ     '0'
     C                   EXSR      PCI032
     C     TRIVK         READE     TRIVFS                                 34
     C  N34              ENDDO
     C                   END
      *__________
      * Omlasting
      *""""""""""
     C     TVTAID        IFNE      *BLANKS
     C     TVCNR         ORNE      *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PAC+5++:'    ADS
     C                   MOVEA     '::'          A(9)
     C                   Z-ADD     1             AXV
     C     TVTAID        IFEQ      *BLANKS
     C                   Z-ADD     5             AXH
     C                   ELSE
     C                   Z-ADD     10            AXH
     C                   END
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVTAID        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVTALK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVTAID        IFNE      *BLANKS
     C     TVCNR         ORNE      *BLANKS
     C     TVGODT        ANDNE     0
     C                   EXSR      PCI033
     C                   END
      *
     C     TVCNR         IFNE      *BLANKS
     C                   EXSR      PCI034
     C     TRIVK         SETLL     TRIVCN
     C     TRIVK         READE     TRIVCN                                 34
     C     *IN34         DOWEQ     '0'
     C                   EXSR      PCI034
     C     TRIVK         READE     TRIVCN                                 34
     C  N34              ENDDO
     C                   END
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Hendelse                                          PCI031 /
      *////////////////////////////////////////////////////////////
     C     PCI031        BEGSR
      *
     C     TVINF1        IFNE      *BLANKS
     C     TVGDT         ORNE      0
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PCI+18+'     ADS
     C                   Z-ADD     1             AXV
     C     TVGDT         IFEQ      0
     C                   Z-ADD     6             AXH
     C                   ELSE
     C                   Z-ADD     7             AXH
     C                   END
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVGDT         IFNE      0
      *_________________
      * Godkjenningsdato
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGDT         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *_______________________
      * Godkjennings myndighet
      *"""""""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGM          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *_____________________________
      * Godkjennings myndighet språk
      *"""""""""""""""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVGMSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGMSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      *_________________
      * Godkjenningssted
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGMST        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      *_______________________
      * Godkjenningssted språk
      *"""""""""""""""""""""""
     C     TVGMSS        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGMSS        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      *__________________________
      * Godkjenningssted landkode
      *""""""""""""""""""""""""""
     C     TVGMLK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '::'          ADS
     C                   Z-ADD     1             AXV
     C     TVGMSS        IFEQ      *BLANKS
     C                   Z-ADD     2             AXH
     C                   ELSE
     C                   Z-ADD     1             AXH
     C                   END
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGMLK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      FTX021
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Informasjon om hendelse                           FTX021 /
      *////////////////////////////////////////////////////////////
     C     FTX021        BEGSR
      *_________________________
      * Informasjon om hendelser
      *"""""""""""""""""""""""""
     C     TVINF1        IFNE      *BLANKS
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABM+'    ADS
     C                   MOVEA     '++'          A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVINF1        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
      *
     C     TVINF2        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVINF2        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C     TVINF3        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVINF3        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C     TVINF4        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVINF4        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Forsegling                                        PCI032 /
      *////////////////////////////////////////////////////////////
     C     PCI032        BEGSR
      *
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PCI+21+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *________________
      * Forseglingskode
      *""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVDFKD        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     20            AXH
     C                   EXSR      SRÅ
      *_________________
      * Forsegling språk
      *"""""""""""""""""
     C     TVDFSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVDFSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Omlasting                                         PCI033 /
      *////////////////////////////////////////////////////////////
     C     PCI033        BEGSR
      *
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PCI+23+'     ADS
     C                   Z-ADD     1             AXV
     C     TVGODT        IFEQ      0
     C                   Z-ADD     6             AXH
     C                   ELSE
     C                   Z-ADD     7             AXH
     C                   END
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVGODT        IFNE      0                                            1<-B
      *_________________
      * Godkjenningsdato
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVGODT        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      *_______________________
      * Godkjennings myndighet
      *"""""""""""""""""""""""
     C     TVOM          IFNE      *BLANKS                                       2<-B
     C     TVOMSK        ORNE      *BLANKS
     C     TVOMST        ORNE      *BLANKS
     C     TVOMSS        ORNE      *BLANKS
     C     TVOMLK        ORNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVOM          IFNE      *BLANKS                                        3<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVOM          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
     C                   END                                                      3<-E
      *_____________________________
      * Godkjennings myndighet språk
      *"""""""""""""""""""""""""""""
     C     TVOMSK        IFNE      *BLANKS                                        3<-B
     C     TVOMST        ORNE      *BLANKS
     C     TVOMSS        ORNE      *BLANKS
     C     TVOMLK        ORNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVOMSK        IFNE      *BLANKS                                         4<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVOMSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END                                                       4<-E
      *_________________
      * Godkjenningssted
      *"""""""""""""""""
     C     TVOMST        IFNE      *BLANKS                                         4<-B
     C     TVOMSS        ORNE      *BLANKS
     C     TVOMLK        ORNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVOMST        IFNE      *BLANKS                                          5<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVOMST        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
     C                   END                                                        5<-E
      *_______________________
      * Godkjenningssted språk
      *"""""""""""""""""""""""
     C     TVOMSS        IFNE      *BLANKS                                          5<-B
     C     TVOMLK        ORNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVOMSS        IFNE      *BLANKS                                           6<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVOMSS        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END                                                         6<-E
      *
     C     TVOMLK        IFNE      *BLANKS                                           6<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVOMLK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END                                                         6<-E
      *
     C                   END                                                        5<-E
     C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      FTX023
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Nytt transportmiddels identitet                   FTX023 /
      *////////////////////////////////////////////////////////////
     C     FTX023        BEGSR
      *________________________________
      * Nytt transportmiddels identitet
      *""""""""""""""""""""""""""""""""
     C     TVTAID        IFNE      *BLANKS
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+TRA+'    ADS
     C                   MOVEA     '++'          A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVTAID        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     27            AXH
     C                   EXSR      SRÅ
      *
     C     TVTASK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVTASK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Container                                         PCI034 /
      *////////////////////////////////////////////////////////////
     C     PCI034        BEGSR
      *
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PCI+30+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________
      * Container
      *""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVCNR         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Transportmiddel                                    TDT04 /
      *////////////////////////////////////////////////////////////
     C     TDT04         BEGSR
      *___________________
      * Transportmiddel-id
      *"""""""""""""""""""
      * Segmentnavn
     C     TITAID        IFNE      *BLANKS
     C     TITALK        ORNE      *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'TDT+12++'    ADS
     C                   MOVEA     '+++++:::'    A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     16            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITAID        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     27            AXH
     C                   EXSR      SRÅ
      *
      *______________________________
      * Transportmiddels nasjonalitet
      *""""""""""""""""""""""""""""""
     C     TITALK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITALK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      TPL04
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Språkkode til transportmiddel                      TPL04 /
      *////////////////////////////////////////////////////////////
     C     TPL04         BEGSR
      *___________
      * Språkkkode
      *"""""""""""
      * Segmentnavn
     C     TITASK        IFNE      *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'TPL+::::'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITASK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Navn og adresser                                   NAD06 /
      *////////////////////////////////////////////////////////////
     C     NAD06         BEGSR
      *___________
      * Næringsliv
      *"""""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'NAD+CPD+'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TITIN         IFNE      *BLANKS                                      1<-B
     C                   MOVEL     TITIN         XAN02             2
     C                   IF        XAN02 <> 'NO'
     C                   EVAL      ADS = 'NO' + %TRIM(TITIN)
     C                   ELSE
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TITIN         ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
     C                   END                                                    1<-E
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '++'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TINA          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIAD1         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIPS          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     24            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TISK          IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TISK          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIPN          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     TILK          IFEQ      *BLANKS
     C                   MOVEL     'NO'          ADS
     C                   ELSE
     C                   MOVEL     TILK          ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Konform og lossing fullført                        TOD07 /
      *////////////////////////////////////////////////////////////
     C     TOD07         BEGSR
      *________
      * Konform
      *""""""""
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'TOD+5+'      ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIKONF        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_________________
      * Lossing fullført
      *"""""""""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIFULF        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':::'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *__________
      * Lossedato
      *""""""""""
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIDTL         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      FTX07
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Lossemerknader og forsegling                       FTX07 /
      *////////////////////////////////////////////////////////////
     C     FTX07         BEGSR
      *
     C     NIMN1         IFNE      *BLANKS
     C     NIDFST        ORNE      *BLANKS
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+CLR+'    ADS
     C                   MOVE      '+'           A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *___________
      * Fordegling
      *"""""""""""
     C     NIDFST        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIDFST        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   EXSR      SRÅ
     C                   END
      *_______________
      * Lossemerknader
      *"""""""""""""""
     C     NIMN1         IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIMN1         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
      *
     C     NIMN2         IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIMN2         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Seksjonskille                                     UNS00A /
      *////////////////////////////////////////////////////////////
     C     UNS00A        BEGSR
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNS+D'       ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Varelinjer                                         CST30 /
      *////////////////////////////////////////////////////////////
     C     CST30         BEGSR
     C                   MOVE      TIVPOS        XLI               5 0
     C     KEYD          SETLL     TRIL03
     C     KEYD          READE     TRIL03                                 33
     C     *IN33         DOWEQ     '0'                                          1<-B
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C     TVVKTB        IFNE      0                                             2<-B
     C     TVVKTN        ORNE      0
     C     TVNT          ORNE      0
     C     TVNTEH        ORNE      0
     C                   MOVE      'J'           XORI              1
      * Sende orginal først
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'CST+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   Z-ADD     TVLI          ØN163
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   EXSR      SRÅ
      *
S09  C*    TVVNT         IFNE      0                                              3<-B
N09  C     TVVNT1        IFNE      0                                              3<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Varenr
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVVNT         ADS
     C                   Z-ADD     1             AXV
N09  C                   IF        TVVNT2 = 0
     C                   Z-ADD     6             AXH
N09  C                   ELSE
N09  C                   Z-ADD     TVVNT2        AXH
N09  C                   END
     C                   EXSR      SRÅ
     C                   ELSE                                                     3
S05  C*                  IF        TVDK <> *BLANKS                                 4<-B
N05  C                   IF        ((TVDK <> *BLANKS) AND (NIVKB <> -1))           4<-B
N07  C                   IF        TIDK <> 'T-'                                     5<-B
     C                   EVAL      ADS = '+'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N07  C                   END                                                        5<-E
     C                   END                                                       4<-E
     C                   END                                                      3<-E
      *
S05  C*                  IF        TVDK <> *BLANKS                                3<-B
N05  C                   IF        ((TVDK <> *BLANKS) AND (NIVKB <> -1))          3<-B
N07  C                   IF        TIDK <> 'T-'                                    4<-B
     C                   EVAL      ADS = '++++'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * TRANSITT TYPE
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVDK          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   EXSR      SRÅ
N07  C                   END                                                       4<-E
     C                   END                                                      3<-E
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      TVCNR         X1CNR            17
     C                   MOVE      NVCNR         X2CNR            17
S14  C*                  MOVE      TVDTY         X1DTY             3
S14  C*                  MOVE      NVDTY         X2DTY             3
N14  C                   MOVE      TVDTY         X1DTY             4
N14  C                   MOVE      NVDTY         X2DTY             4
     C                   MOVE      TVDREF        X1DREF           35
     C                   MOVE      NVDREF        X2DREF           35
     C                   MOVE      TVDSK         X1DSK             2
     C                   MOVE      NVDSK         X2DSK             2
     C                   MOVE      TVDO          X1DO             26
     C                   MOVE      NVDO          X2DO             26
     C                   MOVE      TVDOSK        X1DOSK            2
     C                   MOVE      NVDOSK        X2DOSK            2
     C                   MOVE      TVEH          X1EH              2
     C                   MOVE      TVNT          X1NT              5 0
     C                   MOVE      TVNTEH        X1NTEH            5 0
     C                   MOVE      NVEH          X2EH              2
     C                   MOVE      NVNT          X2NT              5 0
     C                   MOVE      NVNTEH        X2NTEH            5 0
     C                   MOVE      TVMN          X1MN             42
     C                   MOVE      TVMNSK        X1MNSK            2
     C                   MOVE      NVMN          X2MN             42
     C                   MOVE      NVMNSK        X2MNSK            2
     C                   MOVE      TVVT          X1VT             70
     C                   MOVE      NVVT          X2VT             70
     C                   EXSR      FTX30
     C                   EXSR      MEA30
     C                   EXSR      NAD30
     C                   EXSR      PAC31
     C                   EXSR      RFF35
     C                   EXSR      DOC37
     C                   EXSR      GIR44
     C                   MOVE      X1CNR         TVCNR
     C                   MOVE      X2CNR         NVCNR
     C                   MOVE      X1DTY         TVDTY
     C                   MOVE      X2DTY         NVDTY
     C                   MOVE      X1DREF        TVDREF
     C                   MOVE      X2DREF        NVDREF
     C                   MOVE      X1DSK         TVDSK
     C                   MOVE      X2DSK         NVDSK
     C                   MOVE      X1DO          TVDO
     C                   MOVE      X2DO          NVDO
     C                   MOVE      X1DOSK        TVDOSK
     C                   MOVE      X2DOSK        NVDOSK
     C                   MOVE      X1EH          TVEH
     C                   MOVE      X1NT          TVNT
     C                   MOVE      X1NTEH        TVNTEH
     C                   MOVE      X2EH          NVEH
     C                   MOVE      X2NT          NVNT
     C                   MOVE      X2NTEH        NVNTEH
     C                   MOVE      X1MN          TVMN
     C                   MOVE      X1MNSK        TVMNSK
     C                   MOVE      X2MN          NVMN
     C                   MOVE      X2MNSK        NVMNSK
     C                   MOVE      X1VT          TVVT
     C                   MOVE      X2VT          NVVT
     C                   MOVE      *ZEROS        TVLI2
     C                   ELSE                                                    2
     C                   MOVE      'N'           XHELMANKO         1
     C                   END                                                     2<-E
      *
      * Sende endret verdi
     C                   MOVE      'N'           XORI              1
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'CST+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     TVLI          IFGT      XLI
     C                   ADD       1             XLI
     C                   Z-ADD     XLI           ØN163
     C                   ELSE
     C                   Z-ADD     TVLI          ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   EXSR      SRÅ
      *
     C     NVVNT         IFNE      0                                             2<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Varenr
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NVVNT         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   EXSR      SRÅ
     C                   ELSE                                                    2
S05  C*                  IF        TVDK <> *BLANKS                                3<-B
N05  C                   IF        ((TVDK <> *BLANKS) AND (NIVKB <> -1))          3<-B
N07  C                   IF        TIDK <> 'T-'                                    4<-B
     C                   EVAL      ADS = '+'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N07  C                   END                                                       4<-E
     C                   END                                                      3<-E
     C                   END                                                     2<-E
      *
S05  C*                  IF        TVDK <> *BLANKS                               2<-B
N05  C                   IF        ((TVDK <> *BLANKS) AND (NIVKB <> -1))         2<-B
N07  C                   IF        TIDK <> 'T-'                                   3<-B
     C                   EVAL      ADS = '++++'
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * TRANSITT TYPE
N03   * NVVT=BLANK, NVVKTB=0 OG NVNT=0 BETYR HEL MANGO -> IKKE SENDE T?
N03  C                   IF        (((NVVT <> *BLANKS) OR
N03  C                               (NVVKTB <> 0)) OR
N03  C                               (NVNT <> 0))
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVDK          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   EXSR      SRÅ
N03  C                   END
N07  C                   END                                                      3<-E
     C                   END                                                     2<-E
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   EXSR      FTX30
     C     XHELMANKO     IFEQ      'N'
     C                   EXSR      MEA30
     C                   EXSR      NAD30
     C                   EXSR      PAC31
     C                   EXSR      RFF35
     C                   END
      *
     C     XHELMANKO     IFEQ      'N'
     C     NVCTP         OREQ      *BLANKS
     C                   EXSR      DOC37
     C                   EXSR      GIR44
     C                   END
      *
     C     KEYD          READE     TRIL03                                 33
     C  N33              ENDDO
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Varebeskrivelse                                    FTX30 /
      *////////////////////////////////////////////////////////////
     C     FTX30         BEGSR
      *
     C     XORI          IFEQ      'N'
     C     XHELMANKO     ANDEQ     'J'
     C                   GOTO      FTX30T1
     C                   END
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+AAA+'    ADS
     C                   MOVEA     '++'          A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVVT          ADS
N10  C                   Z-ADD     TVVTL         XLENGDE           3 0
     C                   ELSE
     C                   MOVEL     NVVT          ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
S01  C*                  IF        (((TVVT02 <> *BLANKS) AND
S01  C*                              (TVVT03 = ' ')) AND
S01  C*                              (XORI = 'J'))
S01  C*                  MOVE      'NEI'         XKUTTB            3
S01  C*                  END
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
S01  C*                  MOVE      *BLANKS       XKUTTB
      *
S01  C*                  IF        ((XORI = 'J') AND (TVVT02 <> *BLANKS))
N01  C     KEYE          SETLL     TRILVT
N01  C     KEYE          READE     TRILVT                                 33
N01  C                   Z-ADD     1             XANTVT            3 0
N01  C                   DOW       *IN33 = *OFF
N01  C                   IF        (((XORI = 'J') AND (TVVT <> *BLANKS)) OR
N01  C                              ((XORI <> 'J') AND (NVVT <> *BLANKS)))
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   MOVE      *BLANKS       ADS
S01  C*                  MOVEL     TVVT02        ADS
N01  C                   IF        XORI = 'J'
N01  C                   MOVEL     TVVT          ADS
N10  C                   Z-ADD     TVVTL         XLENGDE           3 0
N01  C                   ELSE
N01  C                   MOVEL     NVVT          ADS
N01  C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
N01  C                   ADD       1             XANTVT
N01  C                   IF        XANTVT = 5
N01  C                   LEAVE
N01  C                   END
N01  C                   END
N01  C     KEYE          READE     TRILVT                                 33
N01  C                   ENDDO
S01  C*                  END
      *
     C     TVVTSK        IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVVTSK        ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVVTSK        ADS
     C                   ELSE
     C                   MOVEL     NVVTSK        ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     XORI          IFEQ      'J'
     C     NVCT          OREQ      'OT'
     C     NVCT          OREQ      'NE'
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+'           A(9)
     C     XORI          IFEQ      'J'
     C                   MOVEA     'OR'          A(10)
     C                   ELSE
     C                   MOVEA     NVCT          A(10)
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     11            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     XORI          IFEQ      'N'
     C     NVCT          ANDEQ     'OT'
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NVCTB         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     70            AXH
     C                   EXSR      SRÅ
      *
     C     NVCTSK        IFNE      *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NVCTSK        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
     C     FTX30T1       TAG
      *
     C     XORI          IFEQ      'N'
     C     NVCT          ANDEQ     'DI'
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+DI'         A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     11            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N16   *
N16  C                   IF        NVCTB <> *BLANKS
N16  C                   EVAL      ADS = '+:'
N16  C                   Z-ADD     1             AXV
N16  C                   Z-ADD     2             AXH
N16  C                   MOVE      'N'           WCHART
N16  C                   EXSR      SRÅ
N16   *
N16  C                   EVAL      ADS = NVCTB
N16  C                   Z-ADD     1             AXV
N16  C                   Z-ADD     70            AXH
N16  C                   EXSR      SRÅ
N16   *
N16  C                   IF        NVCTSK <> *BLANKS
N16  C                   EVAL      ADS = '+'
N16  C                   Z-ADD     1             AXV
N16  C                   Z-ADD     1             AXH
N16  C                   MOVE      'N'           WCHART
N16  C                   EXSR      SRÅ
N16   *
N16  C                   EVAL      ADS = NVCTSK
N16  C                   Z-ADD     1             AXV
N16  C                   Z-ADD     2             AXH
N16  C                   EXSR      SRÅ
N16  C                   END
N16   *
N16  C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
      *
     C     XORI          IFEQ      'N'
E14  C                   MOVE      TVDTY         X1DTY
E14  C                   MOVE      NVDTY         X2DTY
     C                   MOVE      TVDREF        X1DREF
     C                   MOVE      NVDREF        X2DREF
     C                   MOVE      TVDSK         X1DSK             2
     C                   MOVE      NVDSK         X2DSK             2
     C                   MOVE      TVDO          X1DO             26
     C                   MOVE      NVDO          X2DO             26
     C                   MOVE      TVDOSK        X1DOSK            2
     C                   MOVE      NVDOSK        X2DOSK            2
     C                   MOVE      *ZEROS        XNR02             2 0
     C     KEYE          SETLL     TRILDK
     C                   MOVE      '0'           *IN33
     C     FTX30T        TAG
     C                   ADD       1             XNR02
      *
     C     NVDREF        IFEQ      *BLANKS
     C     TVDREF        ANDNE     *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'FTX+ABV+'    ADS
     C                   MOVEA     '+NP+'        A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '44#'         ADS
     C                   MOVE      XNR02         XAN02             2
     C                   CAT       XAN02:0       ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C  N33KEYE          READE     TRILDK                                 33
     C  N33              GOTO      FTX30T
     C                   MOVE      X1DTY         TVDTY
     C                   MOVE      X2DTY         NVDTY
     C                   MOVE      X1DREF        TVDREF
     C                   MOVE      X2DREF        NVDREF
     C                   MOVE      X1DSK         TVDSK
     C                   MOVE      X2DSK         NVDSK
     C                   MOVE      X1DO          TVDO
     C                   MOVE      X2DO          NVDO
     C                   MOVE      X1DOSK        TVDOSK
     C                   MOVE      X2DOSK        NVDOSK
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Mål                                                MEA30 /
      *////////////////////////////////////////////////////////////
     C     MEA30         BEGSR
      *___________
      * Bruttovekt
      *"""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
N13  C                   IF        (XORI = 'J' AND TVVKTB <> 0) OR
N13  C                             (XORI <> 'J' AND NVVKTB <> 0)
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'MEA+WT+A'    ADS
     C                   MOVEA     'AB+KGM:'     A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   Z-ADD     TVVKTB        ØN163
     C                   ELSE
     C                   Z-ADD     NVVKTB        ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N13  C                   END
      *
      *__________
      * Nettovekt
      *""""""""""
N12  C                   IF        (XORI = 'J' AND TVVKTN <> 0) OR
N12  C                             (XORI <> 'J' AND NVVKTN <> 0)
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'MEA+WT+A'    ADS
     C                   MOVEA     'AA+KGM:'     A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   Z-ADD     TVVKTN        ØN163
     C                   ELSE
     C                   Z-ADD     NVVKTN        ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     15            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N12  C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Navn og adresser                                   NAD30 /
      *////////////////////////////////////////////////////////////
     C     NAD30         BEGSR
      *_________
      * Avsender
      *"""""""""
      * Segmentnavn
     C                   IF        TVNAS <> *BLANKS                             1<-B
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'NAD+CZ+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '++'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVNAS         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVADS1        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVPSS         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     24            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        TVSKS <> *BLANKS                              2<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVSKS         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END                                                     2<-E
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVPNS         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     TVLKS         IFEQ      *BLANKS                                       2<-B
     C                   MOVEL     'NO'          ADS
     C                   ELSE                                                    2
     C                   MOVEL     TVLKS         ADS
     C                   END                                                     2<-E
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END                                                    1<-E
      *_________
      * Mottaker
      *"""""""""
      * Segmentnavn
     C                   IF        TVNAK <> *BLANKS                             1<-B
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'NAD+CN+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '++'          ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVNAK         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVADK1        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     30            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVPSK         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     24            AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   IF        TVSKK <> *BLANKS                              2<-B
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVSKK         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END                                                     2<-E
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TVPNK         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     9             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     TVLKK         IFEQ      *BLANKS                                       2<-B
     C                   MOVEL     'NO'          ADS
     C                   ELSE                                                    2
     C                   MOVEL     TVLKK         ADS
     C                   END                                                     2<-E
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END                                                    1<-E
      *
     C                   ENDSR
      *
      *////////////////////////////////////////////////////////////
      *  Pakkning                                           PAC31 /
      *////////////////////////////////////////////////////////////
     C     PAC31         BEGSR
     C                   MOVE      *ZEROS        TVLI2
     C     KEYE          SETLL     TRILKL
     C     XORI          IFEQ      'J'
     C     NVNT          IFEQ      0
     C     NVNTEH        ANDEQ     0
N19  C     TVNT          ANDNE     0
N19  C     NVNT          OREQ      0
N19  C     NVNTEH        ANDEQ     0
N19  C     TVNTEH        ANDNE     0
N19  C     NVNT          OREQ      0
N19  C     NVNTEH        ANDEQ     0
N19  C     NVVKTB        ANDEQ     0
N19  C     NVVKTN        ANDEQ     0
     C                   MOVE      'J'           XHELMANKO         1
     C                   ELSE
     C                   MOVE      'N'           XHELMANKO
     C                   END
     C                   END
     C                   MOVEA     '00'          *IN(33)
     C     PAC31A        TAG
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PAC+6+++'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *____________
      * Pakktype
      *""""""""""""
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVEH          ADS
     C                   ELSE
     C                   MOVEL     NVEH          ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
     C     TVEH          IFNE      'VQ'
     C     TVEH          ANDNE     'VG'
     C     TVEH          ANDNE     'VL'
     C     TVEH          ANDNE     'VY'
     C     TVEH          ANDNE     'VR'
N15  C     TVEH          ANDNE     'VS'
     C     TVEH          ANDNE     'VO'
     C     TVEH          ANDNE     'NE'
N11  C     TVEH          ANDNE     'NF'
     C     XORI          ANDEQ     'J'
     C     NVEH          ORNE      'VQ'
     C     NVEH          ANDNE     'VG'
     C     NVEH          ANDNE     'VL'
     C     NVEH          ANDNE     'VY'
     C     NVEH          ANDNE     'VR'
N15  C     NVEH          ANDNE     'VS'
     C     NVEH          ANDNE     'VO'
     C     NVEH          ANDNE     'NE'
N11  C     NVEH          ANDNE     'NF'
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   Z-ADD     TVNT          ØN163
     C                   ELSE
     C                   Z-ADD     NVNT          ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   EXSR      SRÅ
     C                   END
      *
     C     TVEH          IFEQ      'NE'
     C     XORI          ANDEQ     'J'
N11  C     TVEH          OREQ      'NF'
N11  C     XORI          ANDEQ     'J'
     C     NVEH          OREQ      'NE'
     C     XORI          ANDEQ     'N'
N11  C     NVEH          OREQ      'NF'
N11  C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':::'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   Z-ADD     TVNTEH        ØN163
     C                   ELSE
     C                   Z-ADD     NVNTEH        ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     KEYF          SETLL     TRILMN
     C                   EVAL      *IN34 = *OFF
     C     TVLI2         IFEQ      0
     C                   EXSR      PCI32
     C                   END
     C  N34KEYF          READE     TRILMN                                 34
     C     *IN34         DOWEQ     '0'
     C                   EXSR      PCI32
     C  N34KEYF          READE     TRILMN                                 34
     C  N34              ENDDO
      *
     C  N33KEYE          READE     TRILKL                                 33
     C  N33XORI          IFEQ      'J'
     C     XHELMANKO     ANDEQ     'J'
     C     NVNT          ANDNE     0
     C                   MOVE      'N'           XHELMANKO
     C                   END
     C  N33              GOTO      PAC31A
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Forpakningsidentifikasjon                          PCI32 /
      *////////////////////////////////////////////////////////////
     C     PCI32         BEGSR
      *
     C     XORI          IFEQ      'J'
     C     TVMN          CABNE     *BLANKS       PCI32A
     C                   ELSE
     C     NVMN          CABNE     *BLANKS       PCI32A
     C                   END
     C                   GOTO      PCI32C
     C     PCI32A        TAG
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'PCI+28+'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C     NVMN          OREQ      *BLANKS
     C     NVMNSK        ANDEQ     *BLANKS
     C                   MOVEL     TVMN          ADS
     C                   MOVE      TVMN          XAN07             7
N10  C                   Z-ADD     TVMNL         XLENGDE           3 0
     C                   ELSE
     C                   MOVEL     NVMN          ADS
     C                   MOVE      NVMN          XAN07
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
      *
     C                   IF        XAN07 <> *BLANKS
     C                   EVAL      ADS = ':' + XAN07
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   ELSE
     C  N34KEYF          READE     TRILMN                                 34
     C                   IF        *IN34 = *OFF
     C     XORI          IFEQ      'J'
     C     NVMN          OREQ      *BLANKS
     C     NVMNSK        ANDEQ     *BLANKS
     C                   EVAL      ADS = ':' + TVMN
N10  C                   EVAL      XLENGDE = TVMNL + 1
     C                   ELSE
     C                   EVAL      ADS = ':' + NVMN
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     36            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
     C                   END
     C                   END
      *
     C     TVMNSK        IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVMNSK        ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVMNSK        ADS
     C                   ELSE
     C                   MOVEL     NVMNSK        ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     PCI32C        ENDSR
      *////////////////////////////////////////////////////////////
      *  Referanser                                         RFF35 /
      *////////////////////////////////////////////////////////////
     C     RFF35         BEGSR
      *
     C     TVCNR         IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVCNR         ORNE      *BLANKS
     C     NVCT          ANDNE     *BLANKS
     C     XORI          ANDEQ     'N'
      *____________
      * Containernr
      *""""""""""""
     C     KEYE          SETLL     TRILCN
     C                   MOVE      '0'           *IN33
     C     RFF35A        TAG
      * Segmentnavn
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'RFF+AAQ:'    ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     8             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVCNR         ADS
     C                   ELSE
     C                   MOVEL     NVCNR         ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     17            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C  N33KEYE          READE     TRILCN                                 33
     C  N33              GOTO      RFF35A
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Dokumenter                                         DOC37 /
      *////////////////////////////////////////////////////////////
     C     DOC37         BEGSR
      *___________________
      * Dokument referanse
      *"""""""""""""""""""
     C     TVDTY         IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     XORI          OREQ      'N'
N18  C     NVDTY         ANDNE     *BLANKS
      * Segmentnavn
     C     KEYE          SETLL     TRILDK
     C                   MOVE      '0'           *IN33
     C     DOC37A        TAG
     C     XORI          IFEQ      'J'
N04  C     XORI          OREQ      'N'
N04  C     NVDTY         ANDNE     *BLANKS
     C     XORI          OREQ      'N'
S17  C*    NVDREF        ANDNE     *BLANKS
N17  C     NVDO          ANDEQ     *BLANKS
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'DOC+916:'    ADS
     C                   MOVEA     '::'          A(9)
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVDTY         ADS
     C                   ELSE
     C                   MOVEL     NVDTY         ADS
     C                   END
     C                   Z-ADD     1             AXV
S14  C*                  Z-ADD     3             AXH
N14  C                   Z-ADD     4             AXH
     C                   EXSR      SRÅ
N06   *
N06  C     TVDREF        IFEQ      *BLANKS
N06  C     TVDO          ANDEQ     *BLANKS
N06  C     TVDSK         ANDEQ     *BLANKS
N06  C     XORI          ANDEQ     'J'
N06  C     NVDREF        OREQ      *BLANKS
S08  C*    NVDO          OREQ      *BLANKS
N08  C     NVDO          ANDEQ     *BLANKS
N06  C     NVDSK         ANDEQ     *BLANKS
N06  C     XORI          ANDEQ     'N'
N06  C                   GOTO      DOC37B
N06  C                   END
      *
S06  C*    XORI          IFEQ      'J'
S06  C*    TVDREF        ANDNE     *BLANKS
S06  C*    XORI          OREQ      'N'
S06  C*    NVDREF        ANDNE     *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
S06  C*                  END
      *
     C     TVDREF        IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDREF        ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVDREF        ADS
N10  C                   Z-ADD     TVDREFL       XLENGDE           3 0
     C                   ELSE
     C                   MOVEL     NVDREF        ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     35            AXH
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
     C                   END
      *
     C     TVDO          IFEQ      *BLANKS
     C     TVDSK         ANDEQ     *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDO          OREQ      *BLANKS
     C     NVDSK         ANDEQ     *BLANKS
     C     XORI          ANDEQ     'N'
     C                   GOTO      DOC37B
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVDO          IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDO          ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C     TVDOSK        IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDOSK        ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVDOSK        ADS
     C                   ELSE
     C                   MOVEL     NVDOSK        ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
     C                   END
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVDO          IFNE      *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDO          ORNE      *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVDO          ADS
N10  C                   Z-ADD     TVDOL         XLENGDE           3 0
     C                   ELSE
     C                   MOVEL     NVDO          ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     26            AXH
     C                   EXSR      SRÅ
N10  C                   MOVE      *ZEROS        XLENGDE
     C                   END
      *
     C     XORI          IFEQ      'J'
     C     TVDSK         ANDNE     *BLANKS
     C     XORI          ORNE      'J'
     C     NVDSK         ANDNE     *BLANKS
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C     TVDREF        IFNE      *BLANKS
     C     TVDSK         ANDNE     *BLANKS
     C     XORI          ANDEQ     'J'
     C     NVDREF        ORNE      *BLANKS
     C     NVDSK         ANDNE     *BLANKS
     C     XORI          ANDEQ     'N'
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVDSK         ADS
     C                   ELSE
     C                   MOVEL     NVDSK         ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
     C                   END
     C                   END
      * Slutt segment
     C     DOC37B        TAG
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C  N33KEYE          READE     TRILDK                                 33
     C  N33              GOTO      DOC37A
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Følsomme varer                                     GIR44 /
      *////////////////////////////////////////////////////////////
     C     GIR44         BEGSR
      *
     C     TVFVNT        IFGT      0
     C     XORI          ANDEQ     'J'
     C     NVFVNT        ORGT      0
     C     XORI          ANDEQ     'N'
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'GIR+3+'      ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   Z-ADD     TVFVNT        ØN163
     C                   ELSE
     C                   Z-ADD     NVFVNT        ØN163
     C                   END
     C                   EXSR      SRNE
     C                   MOVEL     ØAN           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     12            AXH
     C                   EXSR      SRÅ
      *
N02  C                   IF        (((XORI = 'J') AND (TVFV <> *BLANKS)) OR
N02  C                              ((XORI <> 'J') AND (NVFV <> *BLANKS)))
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':AP+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C     XORI          IFEQ      'J'
     C                   MOVEL     TVFV          ADS
     C                   ELSE
     C                   MOVEL     NVFV          ADS
     C                   END
     C                   Z-ADD     1             AXV
     C                   Z-ADD     2             AXH
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ':AP'         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     3             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
N02  C                   END
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Seksjonskille                                     UNS00B /
      *////////////////////////////////////////////////////////////
     C     UNS00B        BEGSR
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNS+S'       ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Kontrolltotaler                                    CNT00 /
      *////////////////////////////////////////////////////////////
     C     CNT00         BEGSR
      *__________________
      * Antall varelinjer
      *""""""""""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'CNT+5:'      ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     6             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TIVPOS        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     5             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *_____________
      * Antall kolli
      *"""""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C     TINTK         IFGT      0
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'CNT+11:'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     TINTK         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *__________________
      * Antall forsegling
      *""""""""""""""""""
      * Segmentnavn
      * W0074  --->  Teller for antall segment
     C     NIDANT        IFGT      0
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'CNT+16:'     ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     NIDANT        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Meldingsslutt                                      UNT00 /
      *////////////////////////////////////////////////////////////
     C     UNT00         BEGSR
      * Segmentnavn
     C                   ADD       1             W0036
     C                   ADD       1             W0074
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNT+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Antall segmenter i meldingen (inkludert UNH og UNT)
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     W0074         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Meldingsreferanse
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     M0062         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     14            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Sendningsslutt                                     UNZ00 /
      *////////////////////////////////////////////////////////////
     C     UNZ00         BEGSR
      * Start segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     'UNZ+'        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     W0036         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     7             AXH
     C                   MOVE      'L'           WDIR
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     '+'           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      *
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     S0020         ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     10            AXH
     C                   EXSR      SRÅ
      * Slutt segment
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     WAPSTR        ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     4             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
      * Legg in 3 blanke i slutten for IBM IN
     C     WNETW         IFEQ      '2'
     C     1             DO        3
     C                   MOVE      *BLANKS       ADS
     C                   MOVEL     ' '           ADS
     C                   Z-ADD     1             AXV
     C                   Z-ADD     1             AXH
     C                   MOVE      'N'           WCHART
     C                   EXSR      SRÅ
     C                   ENDDO
     C                   ENDIF
      *
     C     BX            IFGT      1
     C                   WRITE     EDISER
     C                   END
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for output string, read input from left              SRÅ
      *////////////////////////////////////////////////////////////
     C     SRÅ           BEGSR
      *_______________
      * Find positions
      *""""""""""""""""
      * Find first non-0 position
     C     WDIR          IFEQ      'L'                                          <-------------I
     C     AXV           DO        AXH           AXV                             <-----------II
     C     A(AXV)        COMP      '0'                                  8383                 II
     C   83              END                                                     <-----------II
      * Find last non-blank position                                     I
     C                   ELSE                                                   <-------------I
      *                                                                  I
     C     SRÅ01         TAG                                                                  I
      *                                                                  I
     C     AXH           IFGT      AXV                                           <-----------II
S01  C*    XKUTTB        ANDNE     'NEI'
     C     A(AXH)        IFEQ      *BLANKS                                        <---------III
N10  C     XLENGDE       ANDLT     AXH                                            <---------III
     C                   SUB       1             AXH                                        III
     C                   GOTO      SRÅ01                                                    III
     C                   END                                                      <---------III
     C                   END                                                     <-----------II
     C                   END                                                    <-------------I
     C                   MOVE      'R'           WDIR
      *________________________________________________
      * Read input string and place it in output string
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     AXV           DO        AXH           AXV                            <-------------I
     C                   MOVE      A(AXV)        WCHAR                                        I
      * If invalid character (' + : ?) then replace with 'Ø'             I
     C     WCHART        IFEQ      'Y'                                           <-----------II
     C     WDIR          IFEQ      'R'                                            <---------III
     C     WCHAR         COMP      WAPSTR                                 83                III
     C  N83WCHAR         COMP      '+'                                    83                III
     C  N83WCHAR         COMP      ':'                                    83                III
     C  N83WCHAR         COMP      '?'                                    83                III
     C   83              EXSR      SRÅA                                                     III
     C                   END                                                      <---------III
     C                   END                                                     <-----------II
      * Move to output string                                            I
     C                   MOVE      WCHAR         B(BX)                                        I
     C                   ADD       1             BX                                           I
      * If arrayindex for output array is over 80 Then add a record      I
     C     BX            IFGT      80                                            <-----------II
     C                   WRITE     EDISER                                                    II
     C                   Z-ADD     1             BX                                          II
     C                   MOVE      *BLANKS       SDATA                                       II
     C                   END                                                     <-----------II
      *                                                                  I
     C                   END                                                    <-------------I
      *
     C                   MOVE      'Y'           WCHART
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      * SR for replace control characters                      SRÅA
      *////////////////////////////////////////////////////////////
     C     SRÅA          BEGSR
      * Move '?' before the character
     C                   MOVE      '?'           B(BX)
     C                   ADD       1             BX
     C     BX            IFGT      80                                           <-------------I
     C                   WRITE     EDISER                                                     I
     C                   Z-ADD     1             BX                                           I
     C                   MOVE      *BLANKS       SDATA                                        I
     C                   END                                                    <-------------I
      *
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Venstrestill numeriske verdier                      SRNE /
      *////////////////////////////////////////////////////////////
     C     SRNE          BEGSR
      * Flytte in rett verdi i Alfa 13-felt
     C                   MOVE      *ZEROS        ØA13
     C     ØA163D        IFEQ      '000'                                        <-------------I
     C                   MOVE      ØA163H        ØA13                                         I
     C                   ELSE                                                   <-------------I
     C                   MOVEL     ØA163X        ØA13                                         I
     C                   MOVE      '.   '        ØA13                                         I
     C                   MOVE      ØA163D        ØA13                                         I
     C     Ø13(13)       IFEQ      '0'
     C                   MOVE      ' '           Ø13(13)
     C     Ø13(12)       IFEQ      '0'
     C                   MOVE      ' '           Ø13(12)
     C                   END
     C                   END
     C                   END                                                    <-------------I
      * lete fra venstre og finn foerste siffer over 0
     C     1             DO        12            ØX                             <-------------I
     C     Ø13(ØX)       IFNE      '0'                                           <-----------II
     C                   GOTO      SRNE1                                                     II
     C                   END                                                     <-----------II
     C                   END                                                    <-------------I
     C     SRNE1         TAG
      * Venstrestill til et nytt felt
     C                   MOVE      *BLANKS       ØAN
     C     Ø13(ØX)       IFEQ      '.'
     C                   SUB       1             ØX
     C                   END
     C                   MOVEA     Ø13(ØX)       ØAN
      *
     C                   ENDSR
