     F* SADREOR1 - Provide command line - Called by SADREOC1
     FTR200D    CF   E             WORKSTN
     F                                     SFILE(MSGSFL:RCDNBR)
     C     *ENTRY        PLIST                                                  Parm list
     C                   PARM                    ACTION            8            Action
     C                   PARM                    RCDNBR            4 0          Rel rcd nbr
     C                   PARM                    KEYVAR            4            Msg key
     C     ACTION        IFEQ      'WRTSFL  '                                   If WRTSFL
     C                   MOVEL     'TR200C'      PGMNAM                         Set pgmq
     C                   WRITE     MSGSFL                                       Write SFL
     C                   RETURN                                                 Return
     C                   END                                                    If WRTSFL
     C     ACTION        IFEQ      'ENDPGM  '                                   If ENDPGM
     C                   SETON                                        LR        Set LR
     C                   RETURN                                                 Return
     C                   END                                                    If ENDPGM
     C* Dummy read statement required to compile, but not executed
     C                   READ      MSGCTL                                 20
