     FEDIM2     UF   E           K DISK
     FEDIS      UF   E           K DISK
     FTRUH09    UF   E           K DISK
     FTRUHFR    UF   E           K DISK
     FTRUHFS    UF   E           K DISK
     FTRUHGB    UF   E           K DISK
     FTRUHGN    UF   E           K DISK
     FTRUHK     UF   E           K DISK
     FTRUHL     UF   E           K DISK
     FTRUV      UF   E           K DISK
     FTRUVAM    UF   E           K DISK
     FTRUVCN    UF   E           K DISK
     FTRUVDK    UF   E           K DISK
     FTRUVFS    UF   E           K DISK
     FTRUVMN    UF   E           K DISK
     FTRUVTD    UF   E           K DISK
     FTRUVVT    UF   E           K DISK
     FTRUERR    UF   E           K DISK
     FTRUHCMP   O    E           K DISK
     FTVINF     UF   E           K DISK
     D                 DS
     D  XDT2                   1      6  0
     D  XD                     1      2  0
     D  XM                     3      4  0
     D  XÅ                     5      6  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
      *___________
      * KEY FIELDS
      *"""""""""""
     C     TRUH09K       KLIST
     C                   KFLD                    THAVD
     C                   KFLD                    THTDN
      *____________
      * WORK FIELDS
      *""""""""""""
     C     *LIKE         DEFINE    THAVD         XAVD
     C     *LIKE         DEFINE    XDT2          XDT
      *_______________
      * PARAMETER LIST
      *"""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    XAVD
     C     XDT2          PARM                    XDT
     C                   PARM                    XDLT              1
      *__________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SADHD
      *""""""""""""""""""""""""""""""""""""""""""
     C                   Z-ADD     XÅ            WÅ
     C                   Z-ADD     XM            WM
     C                   Z-ADD     XD            WD
     C     XÅ            IFGT      50
     C                   MOVEL     '19'          WÅ
     C                   ELSE
     C                   MOVEL     '20'          WÅ
     C                   END
      *
     C     THDT          SETLL     TRUH09
     C                   READ      TRUH09                                 51
     C  N51THDT          COMP      WDT                                51
     C     *IN51         DOWEQ     '0'                                          <----------I
     C     XAVD          IFEQ      THAVD                                         <--------II
     C     XAVD          OREQ      0
     C                   EXSR      SRA                                          SADV
     C                   EXSR      SRB                                          SADF
     C                   EXSR      SRC                                          SADW
     C     XDLT          IFEQ      'J'
     C                   EXSR      SRD                                          EDIM2/EDIS/TVINF
     C                   END
     C                   WRITE     TRUHRCMP
     C                   DELETE    TRUHR
     C                   END                                                     <--------II
     C                   READ      TRUH09                                 51
     C  N51THDT          COMP      WDT                                51
     C  N51              END                                                    <----------I
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRUH??
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
      * TRUHFR
     C     TRUH09K       SETLL     TRUHFR
     C     TRUH09K       READE     TRUHFR                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHFRR
     C     TRUH09K       READE     TRUHFR                                 52
     C                   ENDDO
      * TRUHFS
     C     TRUH09K       SETLL     TRUHFS
     C     TRUH09K       READE     TRUHFS                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHFSR
     C     TRUH09K       READE     TRUHFS                                 52
     C                   ENDDO
      * TRUHGB
     C     TRUH09K       SETLL     TRUHGB
     C     TRUH09K       READE     TRUHGB                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHGBR
     C     TRUH09K       READE     TRUHGB                                 52
     C                   ENDDO
      * TRUHGN
     C     TRUH09K       SETLL     TRUHGN
     C     TRUH09K       READE     TRUHGN                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHGNR
     C     TRUH09K       READE     TRUHGN                                 52
     C                   ENDDO
      * TRUHK
     C     TRUH09K       SETLL     TRUHK
     C     TRUH09K       READE     TRUHK                                  52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHKR
     C     TRUH09K       READE     TRUHK                                  52
     C                   ENDDO
      * TRUHL
     C     TRUH09K       SETLL     TRUHL
     C     TRUH09K       READE     TRUHL                                  52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUHLR
     C     TRUH09K       READE     TRUHL                                  52
     C                   ENDDO
      *
     C                   ENDSR
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRUV??
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRB           BEGSR
      * TRUVAM
     C     TRUH09K       SETLL     TRUVAM
     C     TRUH09K       READE     TRUVAM                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVAMR
     C     TRUH09K       READE     TRUVAM                                 52
     C                   ENDDO
      * TRUVCN
     C     TRUH09K       SETLL     TRUVCN
     C     TRUH09K       READE     TRUVCN                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVCNR
     C     TRUH09K       READE     TRUVCN                                 52
     C                   ENDDO
      * TRUVDK
     C     TRUH09K       SETLL     TRUVDK
     C     TRUH09K       READE     TRUVDK                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVDKR
     C     TRUH09K       READE     TRUVDK                                 52
     C                   ENDDO
      * TRUVFS
     C     TRUH09K       SETLL     TRUVFS
     C     TRUH09K       READE     TRUVFS                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVFSR
     C     TRUH09K       READE     TRUVFS                                 52
     C                   ENDDO
      * TRUVMN
     C     TRUH09K       SETLL     TRUVMN
     C     TRUH09K       READE     TRUVMN                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVMNR
     C     TRUH09K       READE     TRUVMN                                 52
     C                   ENDDO
      * TRUVTD
     C     TRUH09K       SETLL     TRUVTD
     C     TRUH09K       READE     TRUVTD                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVTDR
     C     TRUH09K       READE     TRUVTD                                 52
     C                   ENDDO
      * TRUVVT
     C     TRUH09K       SETLL     TRUVVT
     C     TRUH09K       READE     TRUVVT                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVVTR
     C     TRUH09K       READE     TRUVVT                                 52
     C                   ENDDO
      * TRUV
     C     TRUH09K       SETLL     TRUV
     C     TRUH09K       READE     TRUV                                   52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUVR
     C     TRUH09K       READE     TRUV                                   52
     C                   ENDDO
      *
     C                   ENDSR
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRUERR
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRC           BEGSR
     C     'O'           SETLL     TRUERR
     C     'O'           READE     TRUERR                                 52
     C                   DOW       *IN52 = *OFF
     C                   DELETE    TRUERRR
     C     'O'           READE     TRUERR                                 52
     C                   END
      *
     C                   ENDSR
      *_____________________________________________________
      * SETLL, READ AND DELETE RECORDS FROM EDIM2/EDIS/TVINF
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRD           BEGSR
     C                   MOVE      '0'           *IN52
     C     TRUH09K       SETLL     EDIM2
     C     TRUH09K       READE     EDIM2                                  52
      *
     C     *IN52         DOWEQ     '0'                                          <----------I
     C     M1001         IFEQ      'TET'                                         <--------II
     C     MMN           SETLL     TVINF                                                  II
     C     MMN           READE     TVINF                                  53              II
     C     *IN53         DOWEQ     '0'                                            <------III
     C                   DELETE    TVINFF                                                III
     C     MMN           READE     TVINF                                  53             III
     C  N53              END                                                      <------III
     C     MSN           CHAIN     EDIS                               53                  II
     C  N53              DELETE    EDISR                                                  II
     C                   DELETE    EDIMR                                                  II
     C                   ELSE                                                             II
     C                   UPDATE    EDIMR                                                  II
     C                   END                                                     <--------II
     C     TRUH09K       READE     EDIM2                                  52
     C  N52              END                                                    <----------I
     C                   ENDSR
