********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 VAREBESKRIVELSE ER ENDRET
********************************************************************
     FEDIM2     UF   E           K DISK
     FEDIS      UF   E           K DISK
     FTRIH09    UF   E           K DISK
     FTRIHFS    UF   E           K DISK
     FTRIHPK    UF   E           K DISK
     FTRIL      UF   E           K DISK
     FTRILCN    UF   E           K DISK
     FTRILDK    UF   E           K DISK
     FTRILKL    UF   E           K DISK
     FTRILMN    UF   E           K DISK
     FTRILPK    UF   E           K DISK
N01  FTRILVT    UF   E           K DISK
     FTRIV      UF   E           K DISK
     FTRIVCN    UF   E           K DISK
     FTRIVFS    UF   E           K DISK
     FTVINF     UF   E           K DISK
      *
     FEDIMOLD   O    E             DISK    RENAME(EDIMR:EDIMRO)
     FEDISOLD   O    E             DISK    RENAME(EDISR:EDISRO)
     FTRIHOLD   O    E             DISK    RENAME(TRIHR:TRIHRO)
     FTRIHFSOLD O    E             DISK    RENAME(TRIHFSR:TRIHFSRO)
     FTRIHPKOLD O    E             DISK    RENAME(TRIHPKR:TRIHPKRO)
     FTRILOLD   O    E             DISK    RENAME(TRILR:TRILRO)
     FTRILCNOLD O    E             DISK    RENAME(TRILCNR:TRILCNRO)
     FTRILDKOLD O    E             DISK    RENAME(TRILDKR:TRILDKRO)
     FTRILKLOLD O    E             DISK    RENAME(TRILKLR:TRILKLRO)
     FTRILMNOLD O    E             DISK    RENAME(TRILMNR:TRILMNRO)
     FTRILPKOLD O    E             DISK    RENAME(TRILPKR:TRILPKRO)
N01  FTRILVTOLD O    E             DISK    RENAME(TRILVTR:TRILVTRO)
     FTRIVOLD   O    E             DISK    RENAME(TRIVR:TRIVRO)
     FTRIVCNOLD O    E             DISK    RENAME(TRIVCNR:TRIVCNRO)
     FTRIVFSOLD O    E             DISK    RENAME(TRIVFSR:TRIVFSRO)
      *
     D                 DS
     D  XDT2                   1      6  0
     D  XD                     1      2  0
     D  XM                     3      4  0
     D  XÅ                     5      6  0
     D                 DS
     D  WDT                    1      8  0
     D  WÅ                     1      4  0
     D  WM                     5      6  0
     D  WD                     7      8  0
      *
     C                   EXSR      INIT
      *
      *__________________________________________
      * SETLL, READ AND DELETE RECORDS FROM SADHD
      *""""""""""""""""""""""""""""""""""""""""""
     C     TIDT          SETLL     TRIH09
     C                   READ      TRIH09                                 51
     C  N51TIDT          COMP      WDT                                51
     C                   DOW       *IN51 = *OFF
     C                   IF        ((XAVD = 0) OR (TIAVD = XAVD))
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   EXSR      SRC
     C                   EXSR      SRD
     C                   WRITE     TRIHRO
     C                   DELETE    TRIHR
     C                   END
     C                   READ      TRIH09                                 51
     C  N51TIDT          COMP      WDT                                51
     C  N51              END
      *
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
      *
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRIH??
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRA           BEGSR
      * TRIHFS
     C     TRIH09K       SETLL     TRIHFS
     C     TRIH09K       READE     TRIHFS                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRIHFSRO
     C                   DELETE    TRIHFSR
     C     TRIH09K       READE     TRIHFS                                 52
     C                   ENDDO
      * TRIHPK
     C     TRIH09K       SETLL     TRIHPK
     C     TRIH09K       READE     TRIHPK                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRIHPKRO
     C                   DELETE    TRIHPKR
     C     TRIH09K       READE     TRIHPK                                 52
     C                   ENDDO
      *
     C                   ENDSR
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRIL??
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRB           BEGSR
      * TRILCN
     C     TRIH09K       SETLL     TRILCN
     C     TRIH09K       READE     TRILCN                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRILCNRO
     C                   DELETE    TRILCNR
     C     TRIH09K       READE     TRILCN                                 52
     C                   ENDDO
      * TRILDK
     C     TRIH09K       SETLL     TRILDK
     C     TRIH09K       READE     TRILDK                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRILDKRO
     C                   DELETE    TRILDKR
     C     TRIH09K       READE     TRILDK                                 52
     C                   ENDDO
      * TRILKL
     C     TRIH09K       SETLL     TRILKL
     C     TRIH09K       READE     TRILKL                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRILKLRO
     C                   DELETE    TRILKLR
     C     TRIH09K       READE     TRILKL                                 52
     C                   ENDDO
      * TRILMN
     C     TRIH09K       SETLL     TRILMN
     C     TRIH09K       READE     TRILMN                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRILMNRO
     C                   DELETE    TRILMNR
     C     TRIH09K       READE     TRILMN                                 52
     C                   ENDDO
      * TRILPK
     C     TRIH09K       SETLL     TRILPK
     C     TRIH09K       READE     TRILPK                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRILPKRO
     C                   DELETE    TRILPKR
     C     TRIH09K       READE     TRILPK                                 52
     C                   ENDDO
N01   * TRILVT
N01  C     TRIH09K       SETLL     TRILVT
N01  C     TRIH09K       READE     TRILVT                                 52
N01  C                   DOW       *IN52 = *OFF
N01  C                   WRITE     TRILVTRO
N01  C                   DELETE    TRILVTR
N01  C     TRIH09K       READE     TRILVT                                 52
N01  C                   ENDDO
      *
     C                   ENDSR
      *___________________________________________
      * SETLL, READ AND DELETE RECORDS FROM TRIV??
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRC           BEGSR
      * TRIVCN
     C     TRIH09K       SETLL     TRIVCN
     C     TRIH09K       READE     TRIVCN                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRIVCNRO
     C                   DELETE    TRIVCNR
     C     TRIH09K       READE     TRIVCN                                 52
     C                   ENDDO
      * TRIVFS
     C     TRIH09K       SETLL     TRIVFS
     C     TRIH09K       READE     TRIVFS                                 52
     C                   DOW       *IN52 = *OFF
     C                   WRITE     TRIVFSRO
     C                   DELETE    TRIVFSR
     C     TRIH09K       READE     TRIVFS                                 52
     C                   ENDDO
      *
     C                   ENDSR
      *_____________________________________________________
      * SETLL, READ AND DELETE RECORDS FROM EDIM2/EDIS/TVINF
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""
     C     SRD           BEGSR
      *
     C     TRIH09K       SETLL     EDIM2
     C     TRIH09K       READE     EDIM2                                  52
     C                   DOW       *IN52 = *OFF
     C                   IF        M1001 = 'TEI'
     C     MMN           SETLL     TVINF
     C     MMN           READE     TVINF                                  53
     C                   DOW       *IN53 = *OFF
     C                   DELETE    TVINFF
     C     MMN           READE     TVINF                                  53
     C                   END
     C     MSN           CHAIN     EDIS                               53
     C  N53              WRITE     EDISRO
     C  N53              DELETE    EDISR
     C                   WRITE     EDIMRO
     C                   DELETE    EDIMR
     C                   ELSE
     C                   UPDATE    EDIMR
     C                   END
     C     TRIH09K       READE     EDIM2                                  52
     C                   END
      *
     C                   ENDSR
      *
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     TRIH09K       KLIST
     C                   KFLD                    TIAVD
     C                   KFLD                    TITDN
      *_______________
      * PARAMETER LIST
      *"""""""""""""""
     C     *ENTRY        PLIST
     C                   PARM                    XAVD
     C     XDT2          PARM                    XDT
      *____________
      * WORK FIELDS
      *""""""""""""
     C     *LIKE         DEFINE    TIAVD         XAVD
     C     *LIKE         DEFINE    XDT2          XDT
      *____________
      * INIT FIELDS
      *""""""""""""
     C                   Z-ADD     XÅ            WÅ
     C                   Z-ADD     XM            WM
     C                   Z-ADD     XD            WD
     C                   IF        XÅ > 50
     C                   MOVEL     '19'          WÅ
     C                   ELSE
     C                   MOVEL     '20'          WÅ
     C                   ENDIF
      *
     C                   ENDSR
      *
