      * KALKULATOR ANTALL,VEKT,M3,LM, ULIK PLASSERING INNLAND/FULL
N52  C     INNLAN        IFEQ      'N'
N52  C     INFULL        OREQ      'J'
N52  C* KALKULATOR ANTALL
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     25
N52  C     POSNBR        ANDLE     31
N52  C                   Z-ADD     WSNT          UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSNT
N52  C                   Z-ADD     33            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C* KALKULATOR BRUTTOVEKT
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     60
N52  C     POSNBR        ANDLE     68
N52  C                   Z-ADD     WSVKT         UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSVKT
N52  C                   Z-ADD     72            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C* KALKULATOR KUBIKK
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     72
N52  C     POSNBR        ANDLE     79
N52  C                   Z-ADD     WSM3          UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSM3
N52  C                   Z-ADD     17            LINNBR
N52  C                   Z-ADD     9             POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C* KALKULATOR LASTEMETER
N52  C     LINNBR        IFEQ      17
N52  C     POSNBR        ANDGE     74
N52  C     POSNBR        ANDLE     78
N52  C                   Z-ADD     WSLM          UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSLM
N52  C                   Z-ADD     18            LINNBR
N52  C                   Z-ADD     9             POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C* KALKULATOR VAREVERDI
N52  C     LINNBR        IFEQ      19
N52  C     POSNBR        ANDGE     13
N52  C     POSNBR        ANDLE     26
N52  C                   Z-ADD     WSVERB        UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSVERB
N52  C                   Z-ADD     30            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C* KALKULATOR FRAKTBELØP
N52  C     LINNBR        IFEQ      19
N52  C     POSNBR        ANDGE     61
N52  C     POSNBR        ANDLE     74
N52  C                   Z-ADD     WSFRAB        UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C     WSFRAB        IFNE      UNU132
N52  C                   MOVE      'A'           WSFRAK
N52  C                   END
N52  C                   Z-ADD     UNU132        WSFRAB
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C                   ELSE
N52   * INNLANDSBILDE
N52  C* KALKULATOR ANTALL
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     10
N52  C     POSNBR        ANDLE     14
N52  C                   Z-ADD     WSNTWS        UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSNTWS
N52  C                   Z-ADD     16            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C* KALKULATOR BRUTTOVEKT
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     43
N52  C     POSNBR        ANDLE     51
N52  C                   Z-ADD     WSVKT         UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSVKT
N52  C                   Z-ADD     53            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C* KALKULATOR KUBIKK
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     53
N52  C     POSNBR        ANDLE     60
N52  C                   Z-ADD     WSM3          UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSM3
N52  C                   Z-ADD     62            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52  C* KALKULATOR LASTEMETER
N52  C     LINNBR        IFEQ      16
N52  C     POSNBR        ANDGE     62
N52  C     POSNBR        ANDLE     66
N52  C                   Z-ADD     WSLM          UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C                   Z-ADD     UNU132        WSLM
N52  C                   Z-ADD     79            POSNBR
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C* KALKULATOR FRAKTBELØP
N52  C     LINNBR        IFEQ      19
N52  C     POSNBR        ANDGE     64
N52  C     POSNBR        ANDLE     71
N52  C                   Z-ADD     WSFRAF        UNU132           13 2
N52  C                   CALL      'SYGE11'
N52  C                   PARM                    UNU132
N52  C     WSFRAF        IFNE      UNU132
N52  C                   MOVE      'A'           WSFRAK
N52  C                   END
N52  C                   Z-ADD     UNU132        WSFRAF
N52  C                   GOTO      SLSØK
N52  C                   END
N52  C*
N52   *
N52  C                   END
