NEXJOC                   movel     'XXXXPDAzzzz' TUSJN1           70
NEXJO * (men IKKE hvis sjåf.navn inneholder "PDA" - da er det TKsign )
NEXJOC     'PDA'         SCAN      TUSJN1                                 72
NEXJOC   72              MOVE      'J'           TKSIGN            1
     c                   seton                                        lr
     c                   return
