     FEDIRE     IF   E             DISK
     FQSYSPRT   O    F  132        PRINTER
     C                   READ      EDIRE                                  51
     C     *IN51         DOWEQ     '0'
      *
     C                   MOVEL     'UNOC'        TABLE            10
     C                   MOVEL     'SYENDRE'     LIB              10
     C                   Z-ADD     80            LEN               5 0
     C                   MOVEL     RDATA         STRING           80                        ing
     C                   CALL      'QDCXLATE'
     C                   PARM                    LEN
     C                   PARM                    STRING
     C                   PARM                    TABLE
     C                   PARM                    LIB
      *
     C                   EXCEPT    OUT
      *
     C                   READ      EDIRE                                  51
     C  N51              ENDDO
      *
     C                   MOVE      '1'           *INLR
     OQSYSPRT   E            OUT
     O                       STRING              80
