      /copy SYCGIS/qrpgsrccpy,hspecs
      /copy SYCGIS/qrpgsrccpy,prototypeb
     D TSTRAND         s             15
     C                   eval      TSTRAND =
     C                             RandomString(15:'*UpperLetter':'*UpperDigit')
     C                   return
