     D CINT1           C                   CONST('JANOTTAR@SYSTEMA.NO')
     D CINT2           C                   CONST('                   ')
     D CINT3           C                   CONST('                   ')
     D CINT4           C                   CONST('                   ')
     D CINT5           C                   CONST('                   ')
     D CAVS            C                   CONST('BEAM NORGE AS')
     D CSNR            C                   CONST('4017070123450001233')
     D CNAV            C                   CONST('PER & HANS RENGJØR.')
     D CADR            C                   CONST('VOLLAVEIEN 15 B')
     D CADR2           C                   CONST('3014 DRAMMEN ')
     D CFIRM           C                   CONST('SYSTEMA AS     ')
     D CSIGN           C                   CONST('PER HANSEN   ')
     C                   MOVEL     CAVS          AVS              30
     C                   MOVEL     CSNR          SNR              20
     C                   MOVEL     CNAV          NAV              30
     C                   MOVEL     CADR          ADR              30
     C                   MOVEL     CADR2         ADR2             30
     C                   MOVE      '3'           MANKO             3
     C                   MOVE      '7'           TOTAL             3
     C                   MOVEL     CFIRM         FIRM             30
     C                   MOVEL     CSIGN         SIGN             30
     C                   MOVEL     'KSENTER'     AVID             10
     C                   MOVEL     'NO542SYS'    AVADR            10
     C                   MOVEL     CINT1         INT1             70
     C                   MOVEL     CINT2         INT2             70
     C                   MOVEL     CINT3         INT3             70
     C                   MOVEL     CINT4         INT4             70
     C                   MOVEL     CINT5         INT5             70
     C*
     C                   CALL      'STS13CM'
     C                   PARM                    AVS
     C                   PARM                    SNR
     C                   PARM                    NAV
     C                   PARM                    ADR
     C                   PARM                    ADR2
     C                   PARM                    MANKO
     C                   PARM                    TOTAL
     C                   PARM                    FIRM
     C                   PARM                    SIGN
     C                   PARM                    AVID
     C                   PARM                    AVADR
     C                   PARM                    INT1
     C                   PARM                    INT2
     C                   PARM                    INT3
     C                   PARM                    INT4
     C                   PARM                    INT5
     C*
     C                   MOVE      '1'           *INLR
