     FTSTOCRP   O    E             PRINTER
     D TXT             S             20    DIM(4) CTDATA PERRCD(1)
     C                   MOVEL     TXT(1)        KID
     C                   MOVEL     TXT(2)        KRONE2
     C                   MOVEL     TXT(3)        ORER2
     C                   MOVEL     TXT(4)        FBANK2
     C                   WRITE     A
     C                   WRITE     B
     C*                    WRITED
     C*                    WRITEE
     C                   MOVE      '1'           *INLR
** TEKST
 00112233445566778899     KUNDEID
 7654321                  KRONER
 00                       ØRE
 1234567890123            BANKGIRO
