      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for demonstrating countp subprocedure
     D BRUKERID        S             10
      * User space variables
     D UsrSpcName      s             10
     D UsrSpcLib       c                   'SYCGIUSP'
      * State related variables
     D State           ds                  based(StateP)
     D  UBRID                        10
     D  UINNDT                        8
     D  UINNTM                        6
      * Message ID for CrtUsrSpc
     D MsgId           s              7
      *
     c                   eval      BRUKERID = 'JOVO '
     C                   eval      UsrSpcName= CrtUsrSpc(
     C*                              UsrSpcLib : StateP : MsgID)
     C                               UsrSpcLib : StateP : MsgID : '*ALL')
      *
     C                   CALL      'SYGE15C'
     C                   PARM                    UINNDT
     C                   PARM                    UINNTM
     C                   MOVEL     BRUKERID      UBRID
      *
     C                   MOVE      *ON           *INLR
     C                   return
