      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVE042R MODULE(*LIBL/TSVE042R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
     ‚*  Prototype for 'JSONFIX'
     d jsonfix         pr                  extpgm('JSONFIX')
     d jsonstring_                         like(jsonstring)
     ‚*  Prototype for 'INCGI'
     d incgi           pr                  extproc('INCGI')
     d bistdl_                             like(bistdl)
     ‚*  Prototype for variabel program
     D Varpgm          Pr                  ExtPgm(BILIBL)
      * Varible for
     D WSUSER          S             10
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     d myrows          s             10i 0
     d  X              S              5  0
     d  WERR           S              1
     d  W              S             20
     d  SVEW_KNNR      s              8S 0
     d  SVEW_KNSO      s             35
     d  SVEW_KOTA      s              5S 0
     d  SVEW_KOSL      s              4
     d  SVEW_VASL      s             70
     d  SVEW_GODM      s             42
     d  SVEW_VATA      s              8
     d  SVEW_ULKD      s              2
     d  SVEW_BRUT      s             14S 3
     d  SVEW_EUP1      s              4
     d  SVEW_NETO      s             14S 3
     d  SVEW_KONO      s              3
     d  SVEW_ANKV      s             10S 0
     d  SVEW_SUKO      s              5
     d  SVEW_SUTX      s             70
     d  SVEW_ATIN      s              3
     d  SVEW_FABL      s             11S 3
     d  SVEW_BETK      s              1
     d  SVEW_KOMR      s             70
     d  SVEW_FNKD      s              4
     d  SVEW_BIT1      s              4
     d  SVEW_BII1      s             35
     d  SVEW_CALL      s              2

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3
        /free

        // Parse input
         exsr Parse;
        // Open files etc
         exsr Init;

       gethtmlifs(
       '/syspeddev/html/JSON.html':
       '/CGITAG/');
       wrtsection('top');

       //...........................................................................................
       //skriv JSON-Object start (alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
       //...........................................................................................

        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';

       //JSONfix escaper " i tekst,  for deretter å bytte ¬->"

       jsonfix ( jsonstring );

       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       //...........................................................................................
       // Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
       //..........................................................................................
       jsonstring ='"kundvaradd" : [';

       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       if error = *blanks;
         // Hæmta til array
         exsr sradd;
         // Avsluta
         exsr avslut;
       endif;
       // ..........................................................................................
       // Skriv JSON-Liste/Array  Avslutning
       // ..........................................................................................
       jsonstring =']';
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');
       // ..........................................................................................
       // Skriv JSON-string Avsluttning
       // ..........................................................................................
       jsonstring ='}';
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       // Quit
       exsr exit;

       //=====================================================================
       // Close output html and quit
       //=====================================================================
       begsr exit;
         // Lukk fil
         close bridf;

         // Do not delete the call to wrtsection with section name *fini.  It is needed
         // to ensure that all output html that has been buffered gets output.
         wrtsection('*fini');
         // Quit
         *inlr = *on;
         return;
       endsr;
       //********************************************************
       begsr parse;
       //********************************************************
       // Get input
         wsuser    = zhbgetvar('USER');
         w         = zhbgetvar('SVEW_KNNR');
         SVEW_KNNR = c2n2(w);
         SVEW_KNSO = zhbgetvar('SVEW_KNSO');
         w         = zhbgetvar('SVEW_KOTA');
         SVEW_KOTA = c2n2(w);
         SVEW_KOSL = zhbgetvar('SVEW_KOSL');
         SVEW_VASL = zhbgetvar('SVEW_VASL');
         SVEW_GODM = zhbgetvar('SVEW_GODM');
         SVEW_VATA = zhbgetvar('SVEW_VATA');
         SVEW_ULKD = zhbgetvar('SVEW_ULKD');
         w         = zhbgetvar('SVEW_BRUT');
         SVEW_BRUT = c2n2(w);
         SVEW_EUP1 = zhbgetvar('SVEW_EUP1');
         w         = zhbgetvar('SVEW_NETO');
         SVEW_NETO = c2n2(w);
         SVEW_KONO = zhbgetvar('SVEW_KONO');
         w         = zhbgetvar('SVEW_ANKV');
         SVEW_ANKV = c2n2(w);
         SVEW_SUKO = zhbgetvar('SVEW_SUKO');
         SVEW_SUTX = zhbgetvar('SVEW_SUTX');
         SVEW_ATIN = zhbgetvar('SVEW_ATIN');
         w         = zhbgetvar('SVEW_FABL');
         SVEW_FABL = c2n2(w);
         SVEW_BETK = zhbgetvar('SVEW_BETK');
         SVEW_KOMR = zhbgetvar('SVEW_KOMR');
         SVEW_FNKD = zhbgetvar('SVEW_FNKD');
         SVEW_BIT1 = zhbgetvar('SVEW_BIT1');
         SVEW_BII1 = zhbgetvar('SVEW_BII1');
         SVEW_CALL = zhbgetvar('SVEW_CALL');

       endsr;
       //********************************************************
       begsr init;
       //********************************************************
         open bridf;
         // Test innlogging
         chain wsuser bridf;
         *in50 = not %found;

         if *in50 = *off;
           if bilibl = *blanks;
             incgi ( bistdl );
           else;

             Monitor;
                   Varpgm();
                 On-Error;
                   //
                 EndMon;

           endif;
         else;

           error = 'Invalid userID';
         endif;

       endsr;
        // __________________________________________________
        // Addera post till fil                         SRADD
        // """"""""""""""""""""""""""""""""""""""""""""""""""
           begsr sradd;

          exec sql

          INSERT INTO SVEW
          (SVEW_KNNR, SVEW_KNSO, SVEW_KOTA, SVEW_KOSL, SVEW_VASL, SVEW_GODM,
          SVEW_VATA, SVEW_ULKD, SVEW_BRUT, SVEW_EUP1, SVEW_NETO, SVEW_KONO,
          SVEW_ANKV, SVEW_SUKO, SVEW_SUTX, SVEW_ATIN, SVEW_FABL, SVEW_BETK,
          SVEW_KOMR, SVEW_FNKD, SVEW_BIT1, SVEW_BII1, SVEW_CALL)
          VALUES(:SVEW_KNNR, :SVEW_KNSO, :SVEW_KOTA, :SVEW_KOSL, :SVEW_VASL,
          :SVEW_GODM, :SVEW_VATA, :SVEW_ULKD, :SVEW_BRUT, :SVEW_EUP1,
          :SVEW_NETO, :SVEW_KONO, :SVEW_ANKV, :SVEW_SUKO, :SVEW_SUTX,
          :SVEW_ATIN, :SVEW_FABL, :SVEW_BETK, :SVEW_KOMR, :SVEW_FNKD,
          :SVEW_BIT1, :SVEW_BII1, :SVEW_CALL);

       endsr;
        // __________________________________________________
        // Avsluta                                     AVSLUT
        // """"""""""""""""""""""""""""""""""""""""""""""""""
           begsr avslut;
          JSONstring=*blanks;
       JSONstring=%trim(JSONstring)+'{'
          +'¬result¬ : ¬'+ 'ok' + '¬}';
         jsonfix (JSONstring);
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
         wrtsection ('JSONlin');

       endsr;
      /end-free
