      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVG014R MODULE(*LIBL/TSVG014R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     UF   E           K DISK    USROPN
     FSVIH      UF   E           K DISK    USROPN
     FSVEH      UF   E           K DISK    USROPN
     FSVNH      UF   E           K DISK    USROPN
     FSVXH      UF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D AVD             S              4
     D AVDA            S              4
     D AVDN            S              4  0
     D OPD             S              7
     D OPDA            S              7
     D OPDN            S              7  0
     D URSP            S              2
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      * återkalla respektive
     C     URSP          CASEQ     'TI'          SRTI
     C                   END
     C     URSP          CASEQ     'TE'          SRTE
     C                   END
     C     URSP          CASEQ     'NI'          SRNI
     C                   END
     C     URSP          CASEQ     'NE'          SRNE
     C                   END
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬ursp¬ : ¬'+%trim(URSP)+'¬, '
        +'¬avd¬ : ¬'+%trim(%editc(AVDN:'Z'))+'¬, '
        +'¬opd¬ : ¬'+%trim(%editc(OPDN:'Z'))+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     C                   eval      JSONstring ='"aterkall" : ['
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
     c                   eval      JSONstring =']'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   CALLP     updHTMLvar2('JSONstring'
     C                                         :%addr(JSONstring)
     C                                         :%len(JSONstring))
     C                   callp     wrtsection('JSONlin')
      *
      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     SVIH
     C  N50              CLOSE     SVEH
     C  N50              CLOSE     SVNH
     C  N50              CLOSE     SVXH

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('USER')
     C                   EVAL      AVD     = zhbgetvar('AVD')
     C                   eval      AVDN    = c2n2(AVD)
     C                   MOVE      AVDN          AVDA
     C                   EVAL      OPD     = zhbgetvar('OPD')
     C                   eval      OPDN    = c2n2(OPD)
     C                   MOVE      OPDN          OPDA
     C                   EVAL      URSP    = zhbgetvar('ursp')
     c                   endsr
      *
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end
      *
     C     SvKey         klist
     C                   kfld                    AVDN
     C                   kfld                    OPDN
      *
     C   50              eval      Error = 'Invalid userID'
     C                   IF        *IN50 = *OFF
     C                   OPEN      SVIH
     C                   OPEN      SVEH
     C                   OPEN      SVNH
     C                   OPEN      SVXH
     C                   ENDIF

     c                   endsr
      *
      *___________________________________________
      * Signera TDS Import                    SRTI
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRTI          BEGSR
      *_____________
      * Ændra status
      *"""""""""""""
     C     SVKEY         CHAIN     SVIH                               52
     C                   EVAL      SVIH_SYST=' '
     C                   UPDATE    SVIHR
     C                   ENDSR
      *___________________________________________
      * Signera TDS Export                    SRTE
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRTE          BEGSR
      *_____________
      * Ændra status
      *"""""""""""""
     C     SVKEY         CHAIN     SVEH                               52
     C                   EVAL      SVEH_SYST=' '
     C                   UPDATE    SVEHR
     C                   ENDSR
      *___________________________________________
      * Signera NCTS Import                   SRNI
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRNI          BEGSR
      *_____________
      * Ændra status
      *"""""""""""""
     C     SVKEY         CHAIN     SVNH                               52
     C                   EVAL      TIST=' '
     C                   UPDATE    SVNHR
     C                   ENDSR
      *___________________________________________
      * Signera NCTS Export                   SRNE
      *"""""""""""""""""""""""""""""""""""""""""""
     C     SRNE          BEGSR
      *_____________
      * Ændra status
      *"""""""""""""
     C     SVKEY         CHAIN     SVXH                               52
     C                   EVAL      THST=' '
     C                   UPDATE    SVXHR
     C                   ENDSR
