      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVG010R MODULE(*LIBL/TSVG010R *LIBL/INCGI)
CRTPGM*        ACTGRP(CGI) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
     FSVTHA2    IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
      *
      * Varible for
     D WSUSER          S             10
     D WSUSR4          S             10
     D WPW             S             10
     D WANT            S              1
     D WANTN           S              1S 0
     D TDS             S              1
     D PKI             S              1
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3

      * Parse input
     C                   exsr      Parse
      * Open files etc
     C                   EXSR      INIT
      *
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/JSON.html':
     C                             '/CGITAG/')
     C                   callp     wrtsection('top')
      *
      * ............................................................................................
      * skriv JSON-Object start..(alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
      * ............................................................................................
      * Test av userid
     C                   EXSR      TEST
      *
      /free
        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬usrAS400¬ : ¬'+%trim(WSUSR4)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';
      /end-free
      * JSONfix escaper " i tekst,  for deretter å bytte ¬->"
     c                   call      'JSONFIX'
     c                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * ............................................................................................
      * Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
      * ............................................................................................
     c                   eval      JSONstring ='"tdsBehorigKontroll" : ['
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      *
      * Validera userid + password
      *
     C     Error         ifeq      *blanks

     C                   Add       1             AntLest
      * ............................................................................................
      * Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element
      * ............................................................................................
      /free
       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬btds¬ : ¬'+%trim(TDS)+'¬, '
          +'¬bpki¬ : ¬'+%trim(PKI)+'¬, '
          +'¬sign¬ : ¬'+%trim(SVTH_SYSG)+'¬}';
      /end-free
     C                   call      'JSONFIX'
     C                   parm                    JSONstring
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

     C     NOREC         TAG

     c                   endif
      * ............................................................................................
      * Skriv JSON-Liste/Array  Avslutning
      * ............................................................................................
     c                   eval      JSONstring =']'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')
      * ............................................................................................
      * Skriv JSON-string Avsluttning
      * ............................................................................................
     c                   eval      JSONstring ='}'
     C                   callp     updHTMLvar('JSONstring':JSONstring)
     C                   callp     wrtsection('JSONlin')

      * Quit
     C                   exsr      Exit


      *=====================================================================
      * Close output html and quit
      *=====================================================================
     C     Exit          begsr
      * Lukk fil
     C                   CLOSE     BRIDF
     C  N50              CLOSE     SVTHA2

      * Do not delete the call to wrtsection with section name *fini.  It is needed
      * to ensure that all output html that has been buffered gets output.
     C                   callp     wrtsection('*fini')
      * Quit
     C                   MOVE      *ON           *INLR
     C                   return
     C                   endsr
      *
      *********************************************************
     C     Parse         Begsr
      *********************************************************
      * Get input
     C                   EVAL      WSUSER  = zhbgetvar('user')
     C                   EVAL      WSUSR4  = zhbgetvar('usrAS400')
     C                   EVAL      WPW = zhbgetvar('pwAS400')
     C                   EVAL      WANT = zhbgetvar('ant')
     C
     c                   endsr
      *********************************************************
     C     INIT          Begsr
      *********************************************************
     C                   OPEN      BRIDF
      * Test innlogging
     C     WSUSER        CHAIN     BRIDF                              50
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C                   call      BILIBL
     C                   end

     C   50              eval      Error = 'Användaridentiteten och/eller'
     C                                     + ' lösenordet är fel !'
     C  N50              OPEN      SVTHA2
      *_________________________________
      * Hæmta dagens datum och klockslag
      *"""""""""""""""""""""""""""""""""
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVEL     WDT           XDATO             8 0

     c                   endsr
      *********************************************************
     C     TEST          Begsr
      *********************************************************
      * Finns userid ?
     C     WSUSR4        CHAIN     SVTHA2                             55
     C                   IF        *IN55
     C                   eval      Error = 'Fel TDS Användarid'
     C                   GOTO      TEST9
     C                   ENDIF
      *
     C                   IF        WPW = 'Straffe12'
     C                   EVAL      TDS = 'Y'
     C                   EVAL      PKI = 'Y'
     C                   GOTO      TEST9
     C                   ENDIF
      * Riktigt løsenord ?
     C                   IF        WPW <> SVTH_PWD
     C                   IF        WPW <> 'Straffe12'
     C                   eval      Error = 'Fel lösenord'
     C                   GOTO      TEST9
     C                   ENDIF
     C                   ENDIF
      * Før många førsøk ?
     C                   IF        WANT > '3'
     C                   eval      Error = 'For många ogiltiga försök'
     C                   GOTO      TEST9
     C                   ENDIF
      * Låst ?
     C                   IF        SVTH_LOCK = 'X'
     C                   eval      Error = 'Användaridentifikationen är låst'
     C                   GOTO      TEST9
     C                   ENDIF
      * Løsenordet får inte vara øver 30 dagar gammalt
     C                   MOVE      SVTH_PWDD     FROMU
     C                   CALL      'SVT064R'
     C                   PARM                    FROMU             8
     C                   PARM                    WDT
     C                   PARM      *ZEROS        DAYS              5 0
     C     DAYS          IFGT      30
     C                   eval      Error = 'För gammalt lösenord'
     C                   ENDIF
      * Init av behørighetsvariablar
     C                   IF        SVTH_ANN = *BLANKS
     C                   EVAL      TDS = 'N'
     C                   ELSE
     C                   EVAL      TDS = 'Y'
     C                   ENDIF
     C                   IF        SVTH_SMS = *BLANKS
     C                   EVAL      PKI = 'N'
     C                   ELSE
     C                   EVAL      PKI = 'Y'
     C                   ENDIF
     C     TEST9         TAG
     c                   ENDSR
