      *********************************************************************
      *
CRTPG+*  CRTPGM SYSPED/TSVI041R MODULE(*LIBL/TSVI041R *LIBL/INCGI)
CRTPGM*        ACTGRP(*NEW) AUT(*USE)
      *
      *********************************************************************
      /copy SYSPEDS/qrpgsrcpy,hspecs
      /copy SYSPEDS/qrpgsrcpy,hspecsbnd
      *********************************************************************
     FBRIDF     IF   E           K DISK    USROPN
      *--------------------------------------------------------------------
      * Variables common to all CGIs
      *--------------------------------------------------------------------
      /copy SYSPEDS/qrpgsrcpy,prototypeb
      /copy SYSPEDS/qrpgsrcpy,usec
      /copy SYSPEDS/qrpgsrcpy,variables3
     ‚*  Prototype for 'JSONFIX'
     d jsonfix         pr                  extpgm('JSONFIX')
     d jsonstring_                         like(jsonstring)
     ‚*  Prototype for 'INCGI'
     d incgi           pr                  extproc('INCGI')
     d bistdl_                             like(bistdl)
     ‚*  Prototype for variabel program
     D Varpgm          Pr                  ExtPgm(BILIBL)
      * Varible for
     D WSUSER          S             10
     D WLEVA           S              8
     D WLEVN           S              8S 0
     D JSONstring      s          32000
     D Error           S            150
     D AntLest         S              9  0
     d myrows          s             10i 0
     d  X              S              5  0
     d  WERR           S              1
     d MyPoDS          ds                  Qualified  dim(10000)
     d  sviw_KNSO                    35
     d  sviw_KOTA                     5S 0
     d  sviw_KOSL                     4
     d  sviw_VASL                    70
     d  sviw_GODM                    42
     d  sviw_VATA                     8
     d  sviw_ULKD                     2
     d  sviw_BRUT                    14S 3
     d  sviw_FOKD                     4
     d  sviw_EUP1                     4
     d  sviw_NETO                    14S 3
     d  sviw_KONO                     3
     d  sviw_ANKV                    10S 0
     d  sviw_SUKO                     5
     d  sviw_SUTX                    70
     d  sviw_ATIN                     3
     d  sviw_FABL                    11S 3
     d  sviw_BETK                     1
     d  sviw_KOMR                    70
     d  sviw_FNKD                     4
     d  sviw_BIT1                     4
     d  sviw_BII1                    35
     d  sviw_CALL                     2

      *get input-string
      /copy syspeds/qrpgsrcpy,prolog3
        /free

        // Parse input
         exsr Parse;
        // Open files etc
         exsr Init;

       gethtmlifs(
       '/syspeddev/html/JSON.html':
       '/CGITAG/');
       wrtsection('top');

       //...........................................................................................
       //skriv JSON-Object start (alltid '{' + x ant param. m/komma mellom (IKKE komma etter siste))
       //...........................................................................................

        JSONstring='{'
        +'¬user¬ : ¬'+%trim(WSUSER)+'¬, '
        +'¬levenr¬ : ¬'+%trim(WLEVA)+'¬, '
        +'¬errMsg¬ : ¬'+%trim(Error)+'¬, ';

       //JSONfix escaper " i tekst,  for deretter å bytte ¬->"

       jsonfix ( jsonstring );

       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       //...........................................................................................
       // Skriv JSON-LISTE Start (en liste er EN parameter(fra [ til   )
       //..........................................................................................
       jsonstring ='"kundvarlist" : [';

       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       if error = *blanks;
         // Hæmta til array
         exsr sok;
         // Les array
         exsr lesarr;
       endif;
       // ..........................................................................................
       // Skriv JSON-Liste/Array  Avslutning
       // ..........................................................................................
       jsonstring =']';
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');
       // ..........................................................................................
       // Skriv JSON-string Avsluttning
       // ..........................................................................................
       jsonstring ='}';
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
       wrtsection('JSONlin');

       // Quit
       exsr exit;

       //=====================================================================
       // Close output html and quit
       //=====================================================================
       begsr exit;
         // Lukk fil
         close bridf;

         // Do not delete the call to wrtsection with section name *fini.  It is needed
         // to ensure that all output html that has been buffered gets output.
         wrtsection('*fini');
         // Quit
         *inlr = *on;
         return;
       endsr;
       //********************************************************
       begsr parse;
       //********************************************************
       // Get input
         wsuser  = zhbgetvar('USER');
         wleva = zhbgetvar('LEVENR');
         wlevn = c2n2(wleva);

       endsr;
       //********************************************************
       begsr init;
       //********************************************************
         open bridf;
         // Test innlogging
         chain wsuser bridf;
         *in50 = not %found;

         if *in50 = *off;
           if bilibl = *blanks;
             incgi ( bistdl );
           else;

             Monitor;
                   Varpgm();
                 On-Error;
                   //
                 EndMon;

           endif;
         else;

           error = 'Invalid userID';
         endif;

       endsr;
        // __________________________________________________
        // Kør SQL in i array                             SOK
        // """"""""""""""""""""""""""""""""""""""""""""""""""
           begsr sok;

          exec sql declare  A33  cursor for

          SELECT sviw_KNSO, sviw_KOTA, sviw_KOSL, sviw_VASL, sviw_GODM,
          sviw_VATA, sviw_ULKD, sviw_BRUT, sviw_FOKD, sviw_EUP1, sviw_NETO,
          sviw_KONO, sviw_ANKV, sviw_SUKO, sviw_SUTX, sviw_ATIN, sviw_FABL,
          sviw_BIT1, sviw_BII1, sviw_CALL
          FROM sviw
          WHERE sviw_KNNR = :WLEVN
          FOR READ ONLY;

          exec sql open A33 ;

         Myrows = %elem(MyPoDS);
         exec sql FETCH A33   for :MyRows rows
                  INTO :MyPoDs;
       endsr;
        // __________________________________________________
        // Læs array                                   LESARR
        // """"""""""""""""""""""""""""""""""""""""""""""""""
           begsr lesarr;

               werr='X';

       for x = 1 to myrows;


             if %found;

             if mypods(x).sviw_knso <> ' ';

        // Lægg ut Json stræng
           AntLest = AntLest + 1;

        // Skriv en JSON-Array-linje pr menypunkt - komma før hvert nytt element

       if AntLest=1;
          JSONstring=*blanks;
          else;
          JSONstring=', ';
          endif;
       JSONstring=%trim(JSONstring)+'{'
          +'¬sviw_knso¬ : ¬'+%trim(mypods(x).sviw_KNSO)+'¬, '
          +'¬sviw_kota¬ : ¬'+%trim(%editc(mypods(x).sviw_KOTA:'4'))+'¬, '
          +'¬sviw_kosl¬ : ¬'+%trim(mypods(x).sviw_KOSL)+'¬, '
          +'¬sviw_vasl¬ : ¬'+%trim(mypods(x).sviw_VASL)+'¬, '
          +'¬sviw_godm¬ : ¬'+%trim(mypods(x).sviw_GODM)+'¬, '
          +'¬sviw_vata¬ : ¬'+%trim(mypods(x).sviw_VATA)+'¬, '
          +'¬sviw_ulkd¬ : ¬'+%trim(mypods(x).sviw_ULKD)+'¬, '
          +'¬sviw_brut¬ : ¬'+%trim(%editc(mypods(x).sviw_BRUT:'4'))+'¬, '
          +'¬sviw_fokd¬ : ¬'+%trim(mypods(x).sviw_FOKD)+'¬, '
          +'¬sviw_eup1¬ : ¬'+%trim(mypods(x).sviw_EUP1)+'¬, '
          +'¬sviw_neto¬ : ¬'+%trim(%editc(mypods(x).sviw_NETO:'4'))+'¬, '
          +'¬sviw_kono¬ : ¬'+%trim(mypods(x).sviw_KONO)+'¬, '
          +'¬sviw_ankv¬ : ¬'+%trim(%editc(mypods(x).sviw_ANKV:'4'))+'¬, '
          +'¬sviw_suko¬ : ¬'+%trim(mypods(x).sviw_SUKO)+'¬, '
          +'¬sviw_sutx¬ : ¬'+%trim(mypods(x).sviw_SUTX)+'¬, '
          +'¬sviw_atin¬ : ¬'+%trim(mypods(x).sviw_ATIN)+'¬, '
          +'¬sviw_fabl¬ : ¬'+%trim(%editc(mypods(x).sviw_FABL:'4'))+'¬, '
          +'¬sviw_betk¬ : ¬'+%trim(mypods(x).sviw_BETK)+'¬, '
          +'¬sviw_komr¬ : ¬'+%trim(mypods(x).sviw_KOMR)+'¬, '
          +'¬sviw_fnkd¬ : ¬'+%trim(mypods(x).sviw_FNKD)+'¬, '
          +'¬sviw_bit1¬ : ¬'+%trim(mypods(x).sviw_BIT1)+'¬, '
          +'¬sviw_bii1¬ : ¬'+%trim(mypods(x).sviw_BII1)+'¬, '
          +'¬sviw_call¬ : ¬'+%trim(mypods(x).sviw_CALL)+'¬}';
        //end-free
        //free
         jsonfix (JSONstring);
        //end-free
       updhtmlvar2('JSONstring'
                  :%addr(jsonstring)
                  :%len(jsonstring));
         wrtsection ('JSONlin');

             endif;
             endif;
        endfor;

       endsr;
      /end-free
