********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 skriv eksternref
10006 * 02 sh  PTF10 *cr  går til *CE for eksport
10XXX * 03 YBC PTF10 IKKE BLANK INNSTIKK MERKE VED INNSTIKK
********************************************************************
n01  FFRISOK    IF   E           K DISK
     FKODTP     IF   E           K DISK
     FKODTFM    IF   E           K DISK
     FSAEH      UF   E           K DISK
     FSAEH7     IF   E           K DISK
     F                                     RENAME(SAEHR:SAEH7R)
     FSAEV      IF   E           K DISK
     FEDIM4     IF   E           K DISK
     FTVINF     IF   E           K DISK
     FTVINUAE   O    E             PRINTER OFLIND(*IN51)
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRHOVE
     C                   SETON                                        LR
      *
      *
      *////////////////////////////////////////////////////////////
      *  Initiering                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     UAVD          PARM                    UAVD              4 0
     C     UWS           PARM                    UWS              10
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
n01  C     FRIKEY        KLIST
n01  C                   KFLD                    SEAVD
n01  C                   KFLD                    SETDN
n01  C                   KFLD                    WSKODE
s02  C*                  move      '*CR'         WSKODE            3
n02  C                   move      '*CE'         WSKODE            3
     C     KEYSH         KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    SETDN
     C     KEYSH7        KLIST
     C                   KFLD                    UWS
     C                   KFLD                    WST               1
     C     KEYTM4        KLIST
     C                   KFLD                    WSR               1
     C                   KFLD                    WAVD              4 0
     C                   KFLD                    WTDN              7 0
     C                   KFLD                    W0068A            8 0
     C     KTM42         KLIST
     C                   KFLD                    WSR               1
     C                   KFLD                    WAVD              4 0
     C                   KFLD                    WTDN              7 0
     C     KEYTF         KLIST
     C                   KFLD                    MMN
     C     KODTPK        KLIST
     C                   KFLD                    KOPUNI
     C                   KFLD                    UAVD
     C                   KFLD                    KOPLNR
     C                   MOVE      'P'           KOPUNI
     C                   Z-ADD     96            KOPLNR
      *___________________
      * Initiere faste nøkkelfelt
      *_________________
     C                   MOVE      'R'           WSR
     C                   MOVE      UAVD          WAVD
     C                   MOVE      99999999      W0068A
     C                   MOVE      'L'           WST
     C     KODTPK        CHAIN     KOPR                               33
     C  N33KOPFM         IFNE      *BLANKS
     C     KOPFM         SETLL     KODTFM
     C     KOPFM         READE     KODTFM                                 33
     C                   END
      *_____________
      * Sett nøkkel for å hente alle UA ('EDIRE     B')
      *"""""""""""""
     C     KEYSH7        SETLL     SAEH7
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Behandl alle B-oppdrag,                           SRHOVE /
      *////////////////////////////////////////////////////////////
     C     SRHOVE        BEGSR
      *___________________
      * Hent alle SAD- med EDIRE/B. finn siste Recievemelding
      * via meldingsnr skriv  FRITEKST/ oppdater status i sadh
      *"""""""""""""""""
     C                   SETOFF                                           33
     C     FLERSH        TAG
     C     KEYSH7        READE     SAEH7                                  33
     C  N33              DO
     C     UAVD          CABNE     SEAVD         FLERSH
     C                   MOVE      SETDN         WTDN
     C                   SETOFF                                           34
     C     KEYTM4        SETLL     EDIM4
     C     FLEREM        TAG
     C     KTM42         READPE    EDIM4                                  34
     C  N34M0065         IFNE      'CUSRES'
     C     M0065         ANDNE     'CUSDEC'
     C                   GOTO      FLEREM
     C                   END
     C  N34M1001         IFNE      '830'
     C     M1N07         ORNE      'DUA'
     C                   GOTO      FLEREM
     C                   END
     C  N34              EXSR      SRSKRI
     C                   GOTO      FLERSH
     C                   END
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Skriv en melding (en post i TVINF)                SRSKRI /
      *////////////////////////////////////////////////////////////
     C     SRSKRI        BEGSR
n01  C                   MOVE      *BLANKS       FSSOK
N01  C     FRIKEY        CHAIN     FRISOK                             20
      * Oppdatere tolldeklarasjon med ny status (Behold C ved DMK)
     C     KEYSH         CHAIN     SAEH                               20
     C     SEKTC         IFEQ      ' '                                          1<-B
     C     SEKTA         IFNE      0                                             2<-B
     C                   MOVE      ' '           SEKDDK
     C                   ELSE                                                    2
     C     SETST         IFEQ      0                                              3<-B
     C                   MOVE      ' '           SEKDDK
     C                   ELSE                                                     3
     C                   MOVE      'D'           SEKDDK
     C                   END                                                      3<-E
     C                   END                                                     2<-E
     C                   END                                                    1<-E
     C     SEKDDK        IFEQ      'D'
N03  C     SEMI          ANDNE     'I'
     C     KEYSH         SETLL     SAEV                               33
     C     KEYSH         READE     SAEV                                   33
     C  N33              MOVE      'P'           SEST
     C  N33              MOVE      ' '           SEMI
     C   33              MOVE      'U'           SEST
     C                   ELSE
     C                   MOVE      'U'           SEST
     C                   END
     C  N20              EXCEPT    SAEHNY
     C     SEKTC         IFEQ      ' '
     C     SEKDDK        COMP      'D'                                    01
     C     SEKDDK        COMP      'K'                                    02
     C                   ELSE
     C                   MOVEA     '00'          *IN(01)
     C                   END
      * Les alle på samme meldingsnr
     C                   WRITE     TVINUAEA
     C     KEYTF         SETLL     TVINF
     C     FLEREF        TAG
     C     KEYTF         READE     TVINF                                  35
      * Skriv ut melding.
     C  N35              WRITE     TVINUAEB
     C  N35
     CAN 51              DO                                                     OVERFLOW
     C                   WRITE     TVINUAEA
     C                   SETOFF                                       51
     C                   END
     C  N35              GOTO      FLEREF
      *
     C                   ENDSR
     OSAEHR     E            SAEHNY
     O                       SEST
     O                       SEMI
