     H DECEDIT('0,') DATEDIT(*DMY.)
     FHEADF     IF   E           K DISK
     FSADH8     IF   E           K DISK
     F                                     RENAME(SADHR:SADH8R)
     FTVINIT    O    F  132        PRINTER OFLIND(*IN51)
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRHOVE
     C                   SETON                                        LR
      *
      *
      *////////////////////////////////////////////////////////////
      *  Initiering                                        SRINIT /
      *////////////////////////////////////////////////////////////
     C     SRINIT        BEGSR
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     UAVD          PARM                    UAVD              4 0
     C     UWS           PARM                    UWS              10
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYHEA        KLIST
     C                   KFLD                    SIAVD
     C                   KFLD                    SITDN
     C     KEYSH8        KLIST
     C                   KFLD                    UWS
     C                   KFLD                    WST               1
     C                   MOVE      'K'           WST
      *_____________
      * Sett nøkkel for å hente alle TK ('TVINR     A')
      *"""""""""""""
     C     KEYSH8        SETLL     SADH8
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Behandl alle A-oppdrag,                           SRHOVE /
      *////////////////////////////////////////////////////////////
     C     SRHOVE        BEGSR
     C                   SETOFF                                       3334
     C     FLERSH        TAG
     C     KEYSH8        READE     SADH8                                  33
     C  N33              DO
     C     SIAVD         IFEQ      UAVD
     C     SIFRBN        COMP      *ZEROS                             9797
     C     KEYHEA        CHAIN     HEADF                              34
     C   34              DO
     C                   MOVE      *BLANKS       HEOT
     C                   MOVE      *BLANKS       HEFR
     C                   MOVE      *BLANKS       HENAK
     C                   MOVE      *BLANKS       HEADK1
     C                   MOVE      *BLANKS       HEADK2
     C                   MOVE      *BLANKS       HEADK3
     C                   MOVE      *BLANKS       HEVS1
     C                   MOVE      *BLANKS       HEVS2
     C                   MOVE      *BLANKS       HEGM1
     C                   MOVE      *BLANKS       HEGM2
     C                   MOVE      *BLANKS       HESDL
     C                   MOVE      *ZEROS        HEM3
     C                   MOVE      *ZEROS        HELM
     C                   MOVE      *ZEROS        HENT
     C                   MOVE      *ZEROS        HEVKT
     C                   MOVE      *ZEROS        HEFBV
     C                   END
     C                   EXCEPT    DEL1
     C                   ELSE
     C                   GOTO      END
     C                   END
     C                   GOTO      FLERSH
     C                   END
     C     END           ENDSR
     OTVINIT    E            DEL1             02
     O                       SINAD               32
     O                       UDATE               78 '  .  .  '
     O          E            DEL1             05
     O                                           40 'INTERN TOLLATTEST'
     O                                           52 '(Innførsel)'
     O          E            DEL1             06
     O                                           41 '******************'
     O                                           52 '***********'
     O          E            DEL1             10
     O                                           26 'Referanse:     /       / '
     O                       SIAVD               16
     O                       SITDN               24
     O                       SISG                28
     O               97                          42 '(       /   )'
     O               97      SIOPD         Z     37
     O               97      SIFRBN        Z     41
     O                                           62 'Linjedeklarert'
     O          E            DEL1             15
     O                                           19 'Godkjennelsedato:'
     O                       SIDTG               31
     O          E            DEL1             16
     O                                           18 'Løpenr./eksp.nr:'
     O                       SITLL               23
     O                                           24 '/'
     O                       SITLE               29
     O          E            DEL1             19
     O                                           10 'Opd.type'
     O                       HEOT                17
     O          E            DEL1             19
     O                                           10 '________'
     O          E            DEL1             22
     O                                           10 'Frankat.'
     O                       HEFR                18
     O                                           40 'Lagr.st.'
     O                       SILS                60
     O          E            DEL1             22
     O                                           10 '________'
     O                                           40 '________'
     O          E            DEL1             25
     O                                           10 'Avsender'
     O                       SINAS               45
     O                       SIADS1              78
     O          E            DEL1             25
     O                                           10 '________'
     O          E            DEL1             27
     O                       SIADS2              45
     O                       SIADS3              78
     O          E            DEL1             30
     O                                           10 'Mottaker'
     O                       SINAK               45
     O                       SIADK1              78
     O          E            DEL1             30
     O                                           10 '________'
     O          E            DEL1             32
     O                       SIADK2              45
     O                       SIADK3              78
     O          E            DEL1             35
     O                                           10 'Lev.adr:'
     O          E            DEL1             35
     O                                           10 '________'
     O          E            DEL1             36
     O                       HENAK               45
     O                       HEADK1              78
     O          E            DEL1             38
     O                       HEADK2              45
     O                       HEADK3              78
     O          E            DEL1             41
     O                                           11 'Lossested'
     O                       HESDL               35
     O          E            DEL1             41
     O                                           11 '_________'
     O          E            DEL1             45
     O                                            9 'Godsnr:'
     O                       SIGN                25
     O                                           26 '/'
     O                       SIPOS               35
     O          E            DEL1             47
     O                                           48 '                 Vekt   '
     O          E            DEL1             48
     O                                           24 ' Antall Vareslag        '
     O                                           48 '              Fr.Vekt   '
     O                                           72 '   M3     LM     Godsmer'
     O                                           80 'king    '
     O          E            DEL1             48
     O                                           24 ' _______________________'
     O                                           48 '________________________'
     O                                           72 '________________________'
     O                                           80 '________'
     O          E            DEL1             50
     O                       HENT          Z      7
     O                       HEVS1               33
     O                       HEVKT         Z     45
     O                       HEM3                55 '    ,   '
     O                       HELM                61 '  ,  '
     O                       HEGM1               80
     O          E            DEL1             51
     O                       HEVS2               33
     O                       HEFBV         Z     45
     O                       HEGM2               80
     O          E            DEL1             57
     O                                           17 'Signatur sjåfor'
     O                                           40 'Dato'
     O                                           75 'Signatur varemottaker'
     O          E            DEL1             60
     O                                           26 '________________________'
     O                       UDATE               44 '  .  .  '
     O                                           74 '________________________'
