********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 SH  PTF11 brukeroversyring av printfil
********************************************************************
      *
     FFRISOK    IF   E           K DISK
     FKODTP     IF   E           K DISK
N01  FKODTPUSR  IF   E           K DISK
     FKODTFM    IF   E           K DISK
     FSADH      UF   E           K DISK
     FSADH8     IF   E           K DISK
     F                                     RENAME(SADHR:SADH8R)
     FEDIM4     IF   E           K DISK
     F*VINF   IF  E           K        DISK
     FTVINF     UF   E           K DISK
     FTVINME    O    E             PRINTER OFLIND(*IN51)
N01  F                                     USROPN
N01  D XCMD11          C                   CONST('OVRPRTF -
N01  D                                     FILE(TVINME) -
N01  D                                     OUTQ(')
N01  D XCMD21          C                   CONST('PAGESIZE(70 80) -
N01  D                                     CPI(10) -
N01  D                                     OVRSCOPE(*JOB) -
N01  D                                     OVRFLW(70)')
N01  D UCMD            DS          1024
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRINIT
     C                   EXSR      SRHOVE
N01  C                   CLOSE     TVINME
     C                   SETON                                        LR
      *
      *
      **********************************************************************
     C     SRINIT        BEGSR
      **********************************************************************
      *  Initiering                                        SRINIT /
      *
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     UAVD          PARM                    UAVD              4 0
     C     UWS           PARM                    UWS              10
      *
N01  C                   OPEN      TVINME
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYSH         KLIST
     C                   KFLD                    SIAVD
     C                   KFLD                    SITDN
     C     FRIKEY        KLIST
     C                   KFLD                    SIAVD
     C                   KFLD                    SITDN
     C                   KFLD                    WSKODE
     C                   move      '*CR'         WSKODE            3
     C     KEYSH8        KLIST
     C                   KFLD                    UWS
     C                   KFLD                    WST               1
     C     KEYTM4        KLIST
     C                   KFLD                    WSR               1
     C                   KFLD                    WAVD              4 0
     C                   KFLD                    WTDN              7 0
     C                   KFLD                    W0068A            8 0
     C     KEYTF         KLIST
     C                   KFLD                    MMN
     C     KODTPK        KLIST
     C                   KFLD                    KOPUNI
     C                   KFLD                    UAVD
     C                   KFLD                    KOPLNR
     C                   MOVE      'P'           KOPUNI
     C                   Z-ADD     87            KOPLNR
N01  C     KEYUSER       KLIST
N01  C                   KFLD                    SISG
N01  C                   KFLD                    KOPLNR
      *___________________
      * Initiere faste nøkkelfelt
      *_________________
     C                   MOVE      'R'           WSR
     C                   MOVE      UAVD          WAVD
     C                   MOVE      99999999      W0068A
     C                   MOVE      'Å'           WST
     C                   MOVEA     '00'          *IN(38)
     C     KODTPK        CHAIN     KOPR                               33
     C  N33KOPFM         IFNE      *BLANKS
     C     KOPFM         SETLL     KODTFM
     C     KOPFM         READE     KODTFM                                 33
     C                   END
      *_____________
      * Sett nøkkel for å hente alle ME ('EDIRE     Å')
      *"""""""""""""
     C     KEYSH8        SETLL     SADH8
     C                   ENDSR
      *************************************************************************
     C     SRHOVE        BEGSR
      *************************************************************************
      *  Behandl alle Å-oppdrag,                           SRHOVE /
      *___________________
      * Hent alle SAD- med EDIRE/Å. finn siste Recievemelding
      * via meldingsnr skriv  FRITEKST/ oppdater status i sadh
      *"""""""""""""""""
     C                   SETOFF                                           33
     C     FLERSH        TAG
     C     KEYSH8        READE     SADH8                                  33
     C  N33              DO
N01  C     KEYUSER       CHAIN     KODTPUSR                           44
N01  C  N44              EXSR      OVR
     C     SIAVD         CABNE     UAVD          FLERSH
     C                   MOVE      SITDN         WTDN
     C                   SETOFF                                           34
     C                   MOVE      '1'           *IN51
     C                   MOVE      '1'           *IN52
     C     KEYTM4        SETLL     EDIM4
     C     FLEREM        TAG
     C                   READP     EDIM4                                  34
     C  N34SIAVD         COMP      MAVD                               3434
     C  N34SITDN         COMP      MTDN                               3434
     C  N34M1001         IFNE      '929'
     C                   GOTO      FLEREM
     C                   END
     C  N34              EXSR      SRSKRI
     C  N34              GOTO      FLEREM
     C  N52              WRITE     TVINMEØ
     C                   GOTO      FLERSH
     C                   END
     C                   ENDSR
      *******************************************************************
     C     SRSKRI        BEGSR
      *******************************************************************
      *  Skriv en melding (en post i TVINF)                SRSKRI /
     C                   MOVE      '0'           *IN52
      * Oppdatere tolldeklarasjon med ny status (Behold C ved DMK)
     C                   MOVE      *BLANKS       FSSOK
     C     FRIKEY        CHAIN     FRISOK                             20
     C     KEYSH         CHAIN     SADH                               20
     C     SIST          IFEQ      'Å'
     C     SI0035        IFEQ      '6'                                          DOK.KONTROLL
     C                   MOVE      'D'           SIST
     C                   ELSE
     C     SI0035        IFEQ      '5'                                          VAREKONTROLL
     C                   MOVE      'V'           SIST
     C                   ELSE
     C     SI0035        IFEQ      '9'                                          TVINN INFO.
     C                   MOVE      'T'           SIST
     C                   ELSE
     C                   MOVE      'M'           SIST
     C                   END
     C                   END
     C                   END
     C                   END
     C                   MOVE      ' '           SI0035
     C                   UPDATE    SADHR
      * Les alle på samme meldingsnr
     C     KEYTF         SETLL     TVINF
     C     FLEREF        TAG
     C     KEYTF         READE     TVINF                                  35
     C  N35F4815         IFEQ      'JA'
      * Skriv ut melding.
     C  N35
     CAN 51              DO                                                     OVERFLOW
     C                   WRITE     TVINMEA
     C                   SETOFF                                       51
     C                   END
     C     F0078B        COMP      *BLANKS                                41
     C     F0078C        COMP      *BLANKS                                42
     C     F0078D        COMP      *BLANKS                                43
     C     F0078E        COMP      *BLANKS                                44
     C                   WRITE     TVINMEB
     C                   MOVE      'PP'          F4815
     C                   END
     C  N35              UPDATE    TVINFF
     C  N35              GOTO      FLEREF
      *
     C                   ENDSR
N01   **********************************************************************************
N01  c     ovr           begsr
N01   **********************************************************************************
N01  C                   CLOSE     TVINME
N01  C                   Z-ADD     1024          UCMDL            15 5
N01  C                   MOVE      *BLANKS       UCMD
N01  C     XCMD11        CAT       KOPNVN:0      UCMD
N01  C                   CAT       ')':0         UCMD
N01  C                   CAT       XCMD21:1      UCMD
N01  C                   CALL      'QCMDEXC'                            33
N01  C                   PARM                    UCMD
N01  C                   PARM                    UCMDL
N01  C                   OPEN      TVINME
N01  C                   ENDSR
