     FTVI68D    CF   E             WORKSTN
     F                                     SFILE(TVI68DA:ZRECNO)
     FTVINF     IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    FMN           WMN
     C     *LIKE         DEFINE    FLN           WLN
     C     *LIKE         DEFINE    *IN03         WIN03
     C                   MOVE      *ZEROS        WLN
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WMN
     C                   KFLD                    WLN
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WMN           PARM                    WMN
     C     ZAVD          PARM                    ZAVD
     C     ZTDN          PARM                    ZTDN
     C     Z0068A        PARM                    Z0068A
     C     Z0068B        PARM                    Z0068B
     C     Z0068C        PARM                    Z0068C
     C                   PARM      *IN03         WIN03
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Vise feilmeldinger                                   SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C     SRB1          TAG
     C                   MOVE      '1'           *IN30
      *______________
      * Tømme Subfile
      *""""""""""""""
     C                   MOVE      '1'           *IN93
     C                   WRITE     TVI68DB
     C                   MOVEA     '000'         *IN(93)
     C                   Z-ADD     *ZERO         ZRECNO
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     KEYA          SETLL     TVINF
     C     WMN           READE     TVINF                                  94
      *
     C     *IN94         DOWEQ     '0'
     C     FMN           ANDEQ     WMN
     C                   MOVE      '0'           *IN30
     C                   ADD       1             ZRECNO
     C                   WRITE     TVI68DA
     C     WMN           READE     TVINF                                  94
     C  N94              END
     C                   Z-ADD     1             ZRECNO
      *_______________
      * Ingen poster ?
      *"""""""""""""""
     C     *IN30         CABEQ     '1'           SRB9
      *_______________
      * Behandle bilde
      *"""""""""""""""
     C                   MOVEA     '11'          *IN(91)
     C                   MOVE      'SY00000'     ZMSGNO
     C                   WRITE     TVI68DØ
     C                   WRITE     TVI68DC
     C                   EXFMT     TVI68DB
     C     *IN05         CABEQ     '1'           SRB1
      *
     C     SRB9          ENDSR
