     FTVI67D    CF   E             WORKSTN
     FEDIM      IF   E           K DISK
      *//////////////
      *  Hodelogikk /
      *//////////////
     C                   EXSR      SRA
     C                   EXSR      SRB
     C                   MOVE      '1'           *INLR
      *////////////////////////////////////////////////////////////
      *  Initiering                                           SRA /
      *////////////////////////////////////////////////////////////
     C     SRA           BEGSR
      *___________________
      * Definiere Workfelt
      *"""""""""""""""""""
     C     *LIKE         DEFINE    MSN           WSN
     C     *LIKE         DEFINE    MMN           WMN
     C     *LIKE         DEFINE    *IN03         WIN03
      *__________________
      * Definiere Nøkkler
      *""""""""""""""""""
     C     KEYA          KLIST
     C                   KFLD                    WMN
      *_________________
      * Input parametrer
      *"""""""""""""""""
     C     *ENTRY        PLIST
     C     WMN           PARM                    WMN
     C                   PARM      *IN03         WIN03
     C                   ENDSR
      *////////////////////////////////////////////////////////////
      *  Vise hele meldingsloggen.                            SRB /
      *////////////////////////////////////////////////////////////
     C     SRB           BEGSR
     C                   MOVE      '0'           *IN28
     C                   MOVE      'SY00000'     ZMSGNO
     C     M1001         IFEQ      '929'
     C                   MOVE      'TVIN-I'      WSIMEX
     C                   ELSE
     C     M1001         IFEQ      '830'
     C                   MOVE      'TVIN-E'      WSIMEX
     C                   ELSE
     C                   MOVE      *BLANKS       WSIMEX
     C                   END
     C                   END
     C                   WRITE     TVI67DØ
     C     KEYA          CHAIN     EDIM                               51
     C     MSR           IFEQ      'R'
     C                   MOVE      '1'           *IN50
     C                   MOVE      M3039D        X3039D
     C                   ELSE
     C                   MOVE      '0'           *IN50
     C                   END
     C     SRB1          TAG
     C                   MOVEA     '00'          *IN(25)
     C  N28              EXFMT     TVI67DA
     C   28              EXFMT     TVI67DB
     C     *IN25         IFEQ      '1'
     C                   MOVE      '1'           *IN28
     C                   GOTO      SRB1
     C                   END
     C     *IN26         IFEQ      '1'
     C                   MOVE      '0'           *IN28
     C                   GOTO      SRB1
     C                   END
      *
     C     SRB9          ENDSR
