     FARKIVP    O  A E             DISK
     C     *ENTRY        PLIST
     C                   PARM                    UARAVD            4
     C                   PARM                    UAROPD            7
     C                   PARM                    UARLINK1         40
     C                   PARM                    UARLINK2         40
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   CLEAR                   ARKIVR
     C                   EVAL      ARSTAT='A'
     C                   EVAL      ARTYPE='si'
     C                   EVAL      ARFIRM='SY'
     C                   MOVE      UARAVD        ARAVD
     C                   MOVE      UAROPD        AROPD
     C                   EVAL      ARUSER='SY400USR'
     C                   MOVEL     WDT           ARDATE
     C                   MOVEL     WTM           ARTIME
     C                   EVAL      ARKUND=1
     C                   EVAL      ARLINK=UARLINK1
     C                   WRITE     ARKIVR
     C                   EVAL      ARTYPE='sk'
     C                   EVAL      ARLINK=UARLINK2
     C                   WRITE     ARKIVR
     C                   EVAL      *INLR=*ON
