     FARKIVL03  UF A E           K DISK
     FTRAVH6    IF   E           K DISK
     D                 DS
     D  ARUNDE                 1     10
     D  AR7                    7      7
     D  AR16                   1      6
     D  ar8                    8      8
     D  FADG                   7      8
     C     KEY           KLIST
     C                   KFLD                    type
     c                   move      'ta'          type              2
      *
     c     key           setll     ARKIVL03
     c     *in33         doweq     '0'
     c     key           reade     ARKIVL03                               33
     c     *in33         ifeq      '0'
     C     ar7           andeq     ' '
     C                   move      AR16          ar17              7
     c                   movel     '0'           ar17
     c                   movel     ar17          arunde
     c                   update    arkivr
     c                   end
     C                   enddo
      *
      *
     c     key           setll     ARKIVL03
     c     *in34         doweq     '0'
     c     key           reade     ARKIVL03                               34
     c     *in34         ifeq      '0'
     c     ar8           andeq     ' '                                        NG)
     c                   movel     arunde        thfakt
     c                   setoff                                       35
     c     thfakt        setll     travh6
     C     *in35         doweq     '0'
     c     thfakt        reade     travh6                                 35
     c     *in35         ifeq      '0'
     c     thtunr        andne     0
     c                   movel     'T:'          arunde
     c                   move      thtunr        arunde
     c                   write     arkivr
     c                   end
     C                   enddo
      *
     c                   end
     C                   enddo                                                NG)
      *
     c                   seton                                        lr
     c                   return
