     FV10FNF    UP   E             DISK
      *
     C                   MOVE      'N'           FNST
     C                   MOVE      'N'           FNHST
     C                   UPDATE    V10FNFR
      *
