     FFIRM      if   E           k DISK
     FKUNDL01   if   E           k DISK
     FCUNDL01   uf   E           k DISK    RENAME(KUNDR:CUNDR)
     FV10FNF    UF   E           K DISK
     D                UDS
     D  UDRIFT               301    301
      *
     ICUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
      *
     C                   EXSR      INIT
      *
     C                   SETOFF                                       33
     C     KEY           SETLL     KUNDL01
     C     *IN33         DOWEQ     '0'
     C     KEY           READE     KUNDL01                                33
     C     *IN33         IFEQ      '0'
     C                   MOVE      KUNDGR        KUNDG2            2
     C                   MOVE      PNPBKU        PNPBK2           10
     C                   MOVE      RNRAKU        RNRAK2           20
     c     key2          chain     cundl01                            34
     C                   MOVE      KUNDG2        KUNDGR
     C                   MOVE      PNPBK2        PNPBKU
     C                   MOVE      RNRAK2        RNRAKU
     C  N34              update    cundr
     C                   ENDIF
     C                   ENDDO
      *
     C                   EXSR      OPDFIL
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      *****************************************************
     C     INIT          BEGSR
      *****************************************************
     C                   READ      FIRM                                   33
     C     KEY           KLIST
     C                   KFLD                    FIFIRM
     C     KEY2          KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    KUNDNR
      *
     C                   EVAL      FNFN = 'CUNDF'
     C     FNFN          CHAIN(N)  V10FNF                             33
     C                   IF        UDRIFT = 'J'
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   ELSE
     C                   IF        FNHST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   END
      *
     c                   endsr
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V10FNF                             33
     C  N33              IF        UDRIFT = 'J'
     C                   MOVE      'J'           FNST
     C                   ELSE
     C                   MOVE      'N'           FNHST
     C                   END
     C  N33              UPDATE    V10FNFR
      *
     C                   ENDSR
      *
