     FKOSTB     UP   E             DISK
     FV10FNF    UF   E           K DISK
     D                UDS
     D  UDRIFT               301    301
     D                 DS
     D  KBKKEY                 1     15
     D  KBKKEY1                1      5
     D  KBKKEY2                6      6
     D  KBKKEY3                9      9
     D  KBKKEY4                7      8
     D  KBKKEY5               10     15
     D                 DS
     D  XXKKEY                 1     15
     D  XXKKEY1                1      2
     D  XXKKEY2                3      7
     D  XXKKEY3                8      9
     D  XXKKEY4               10     15
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'KOSTB'
     C     FNFN          CHAIN(N)  V10FNF                             33
     C                   IF        UDRIFT = 'J'
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   ELSE
     C                   IF        FNHST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   END
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   IF        (((KBKKEY1 <> *BLANKS) AND
     C                               (KBKKEY2 = *BLANKS)) AND
     C                               (KBKKEY3 = *BLANKS))
     C                   MOVE      '00'          XXKKEY1
     C                   MOVE      KBKKEY1       XXKKEY2
     C                   MOVE      KBKKEY4       XXKKEY3
     C                   MOVE      KBKKEY5       XXKKEY4
     C                   MOVE      XXKKEY        KBKKEY
     C                   END
     C                   UPDATE    KOSTBR
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V10FNF                             33
     C  N33              IF        UDRIFT = 'J'
     C                   MOVE      'J'           FNST
     C                   ELSE
     C                   MOVE      'N'           FNHST
     C                   END
     C  N33              UPDATE    V10FNFR
      *
     C                   ENDSR
      *
