     FESPXREF   IF A E           K DISK
     FESPXREFNY IP   E           K DISK    RENAME(ESPXREFR:ESPXREFRNY)
     FV10FNF    UF   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'ESPXREF'
     C     FNFN          CHAIN(N)  V10FNF                             33
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   MOVE      'J'           XINIT             1
     C     ESPXREFK      KLIST
     C                   KFLD                    ESKODE
     C                   KFLD                    ESPROD
     C                   END
      *
     C                   MOVEL     ESKODE        XAN01             1
     C                   IF        XAN01 <> 'Z'
     C     ESPXREFK      CHAIN     ESPXREF                            33
     C   33              WRITE     ESPXREFR
     C                   END
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V10FNF                             33
     C  N33              MOVE      'J'           FNST
     C  N33              UPDATE    V10FNFR
      *
     C                   ENDSR
      *
