     FDOKUF     UP   E             DISK
     FV10FNF    UF   E           K DISK
     FKODTTSL2  IF   E           K DISK
     D                 DS
     D  DFBREF2                1     17
     D  DFBRTX2                1      5
     D  DFBRAV2                6      9
     D  DFBRST2               10     10
     D  DFBROP2               11     17
     D                 DS
     D  DFBREF                 1     17
     D  DFBRTX                 1      7
     D  DFBRAV                 8     11
     D  DFBRST                12     12
     D  DFBROP                13     17
     D                UDS
     D  UDRIFT               301    301
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'DOKUF'
     C     FNFN          CHAIN(N)  V10FNF                             33
     C                   IF        UDRIFT = 'J'
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   ELSE
     C                   IF        FNHST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   END
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   IF        DFBRTX = 'Utk.op:'
     C                   EVAL      DFBRTX2 = 'U.op:'
     C                   EVAL      DFBRAV2 = DFBRAV
     C                   EVAL      DFBRST2 = DFBRST
     C                   EVAL      DFBROP2 = '00' + DFBROP
     C                   EVAL      DFBREF  = DFBREF2
     C                   END
      *
     C                   IF        ((DFTOLL < 100) AND (DFTOLL > 0))
     C                   MOVE      DFTOLL        XDFTOLL           2 0
     C     XDFTOLL       CHAIN     KODTTSL2                           33
     C  N33              MOVE      KTSPNR        DFTOLL
     C                   END
      *
     C                   UPDATE    DOKUFR
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V10FNF                             33
     C  N33              IF        UDRIFT = 'J'
     C                   MOVE      'J'           FNST
     C                   ELSE
     C                   MOVE      'N'           FNHST
     C                   END
     C  N33              UPDATE    V10FNFR
      *
     C                   ENDSR
      *
