     FTRILGM    UP   E             DISK    PREFIX(GM_)
     FTRILVT    O  A E             DISK
     D                 DS
     D  GM_TVVT                1    140
     D  GM_TVVT1               1     70
     D  GM_TVVT2              71    140
      *
     C                   IF        GM_TVVT2 <> *BLANKS
     C                   EVAL      TVAVD = GM_TVAVD
     C                   EVAL      TVTDN = GM_TVTDN
     C                   EVAL      TVLI  = GM_TVLI
     C                   EVAL      TVVT  = GM_TVVT
     C                   WRITE     TRILVTR
     C                   END
