     FKUFAST    IF A E           K DISK
      *
     C     KUFASTK       KLIST
     C                   KFLD                    KFTYP
     C                   KFLD                    KFKOD
      *
     C                   EVAL      KFTYP  = 'PRODTYPE'
     C                   EVAL      KFKOD  = ' DEFN'
     C     KUFASTK       CHAIN     KUFAST                             33
     C                   IF        *IN33
     C                   EVAL      KFTXT  = 'Produkttype for postal'
     C                   EVAL      KFTXTE = 'Products type for postal'
     C                   WRITE     KOFASTR
     C                   END
      *
     C                   EVAL      KFKOD  = *BLANKS
     C     KUFASTK       CHAIN     KUFAST                             33
     C                   IF        *IN33
     C                   EVAL      KFTXT  = 'Normalfrakt'
     C                   EVAL      KFTXTE = 'Normal freight'
     C                   WRITE     KOFASTR
     C                   END
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
