     FSADH      UF   E           K DISK
     FSAEH      UF   E           K DISK
     FSTANDI    UF   E           K DISK
     FSTANDE    UF   E           K DISK
     FKODTTSL2  IF   E           K DISK
      *
     C     *LOVAL        SETLL     SADH
     C                   READ      SADH                                   33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((SIKDH > 0) AND (SIKDH < 100))
     C                   MOVE      SIKDH         XSIKDH            2 0
     C     XSIKDH        CHAIN     KODTTSL2                           33
     C  N33              MOVE      KTSPNR        SIKDH
     C                   END
     C                   UPDATE    SADHR
     C                   READ      SADH                                   33
     C                   ENDDO
      *
     C     *LOVAL        SETLL     SAEH
     C                   READ      SAEH                                   33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((SEKDH > 0) AND (SEKDH < 100))
     C                   MOVE      SEKDH         XSEKDH            2 0
     C     XSEKDH        CHAIN     KODTTSL2                           33
     C  N33              MOVE      KTSPNR        SEKDH
     C                   END
     C                   UPDATE    SAEHR
     C                   READ      SAEH                                   33
     C                   ENDDO
      *
     C     *LOVAL        SETLL     STANDI
     C                   READ      STANDI                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((SIKDH > 0) AND (SIKDH < 100))
     C                   MOVE      SIKDH         XSIKDH            2 0
     C     XSIKDH        CHAIN     KODTTSL2                           33
     C  N33              MOVE      KTSPNR        SIKDH
     C                   END
     C                   UPDATE    STANDIR
     C                   READ      STANDI                                 33
     C                   ENDDO
      *
     C     *LOVAL        SETLL     STANDE
     C                   READ      STANDE                                 33
     C                   DOW       *IN33 = *OFF
     C                   IF        ((SEKDH > 0) AND (SEKDH < 100))
     C                   MOVE      SEKDH         XSEKDH            2 0
     C     XSEKDH        CHAIN     KODTTSL2                           33
     C  N33              MOVE      KTSPNR        SEKDH
     C                   END
     C                   UPDATE    STANDER
     C                   READ      STANDE                                 33
     C                   ENDDO
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
