     FGSSBIF    UP   E             DISK
      *
     C                   IF        BIPRTP = *BLANKS
     C                   EVAL      BIPRTP = BIPRT
     C                   END
     C                   IF        BIPRTI = *BLANKS
     C                   EVAL      BIPRTI = BIPRT
     C                   END
     C                   UPDATE    GSSBIFR
      *
