     FKODTP     IF A E           K DISK
     FUTSKRS    IF A E           K DISK
     FUTSKRSNY  IP   E           K DISK    RENAME(UTSR:UTSRNY)
     FV10FNF    UF   E           K DISK
      *
     D                UDS
     D  UDRIFT               301    301
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'KODTP'
     C     FNFN          CHAIN(N)  V10FNF                             33
     C                   IF        UDRIFT = 'J'
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   ELSE
     C                   IF        FNHST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   END
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C     UTPNR         CHAIN     UTSKRS                             33
     C                   IF        *IN33
     C                   WRITE     UTSR
     C                   MOVE      *ZEROS        XAVD              4 0
     C     *LOVAL        SETLL     KODTP
     C                   READ      KODTP                                  33
     C                   DOW       *IN33 = *OFF
     C                   IF        KOPAVD <> XAVD
     C                   EVAL      KOPLNR = UTPNR
     C                   EVAL      KOPNVN = '*JOB'
     C                   EVAL      KOPTY  = UTPTY
     C                   EVAL      KOPHEA = *BLANKS
     C                   EVAL      KOPFM  = *BLANKS
     C                   EVAL      KOPLAS = *BLANKS
     C                   EVAL      KOPLPP = 0
     C                   EVAL      KOPLPI = 0
     C                   EVAL      KOPCPL = 0
     C                   EVAL      KOPCPI = 0
     C                   IF        KOPLNR = 73
     C                   EVAL      KOPLAS = 'A'
     C                   EVAL      KOPLPI = 8
     C                   END
     C                   WRITE     KOPR
     C                   MOVE      KOPAVD        XAVD              4 0
     C                   END
     C                   READ      KODTP                                  33
     C                   ENDDO
     C                   END
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V10FNF                             33
     C  N33              IF        UDRIFT = 'J'
     C                   MOVE      'J'           FNST
     C                   ELSE
     C                   MOVE      'N'           FNHST
     C                   END
     C  N33              UPDATE    V10FNFR
      *
     C                   ENDSR
      *
