     FARKIVP    UF   E             DISK
     D                 DS
     D  ARUNDE                 1     10
     D  ARUNDE3                1      3
     D  ARUNDE7                4     10
     C                   READ      ARKIVP                                 51
     C     *IN51         DOWEQ     *OFF
     C     ARUNDE3       IFEQ      'SI:'
     C     AROPD         ANDEQ     *ZEROS
     C                   MOVE      ARUNDE7       AROPD
     C                   UPDATE    ARKIVR
     C                   ENDIF
     C                   READ      ARKIVP                                 51
     C                   ENDDO

     C                   EVAL      *INLR=*ON
