     FEDISX     UP   E             DISK
     C                   if        SXPRODM <> *blanks
     C                   eval      SXPRODM = %subst(SXPRODM:1:1)
     C                             +'00'+ %subst(SXPRODM:2:7)
     C                   UPDATE    EDISXR
     c                   endif
