     FARKTXT    IF A E           K DISK
     FARKTXTNY  IP   E           K DISK    RENAME(ARKTXTR:ARKTXTRNY)
     FV11FNF    UF   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   EVAL      FNFN = 'ARKTXT'
     C     FNFN          CHAIN(N)  V11FNF                             33
     C                   IF        FNST = 'J'
     C                   EVAL      *INLR = *ON
     C                   RETURN
     C                   END
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   IF        %SUBST(ARTYPE:1:1) <> 'Z'
     C     ARTYPE        CHAIN     ARKTXT                             33
     C   33              WRITE     ARKTXTR
     C                   END
      *
     CLR                 EXSR      OPDFIL
      *
      ***********************************************
     C     OPDFIL        BEGSR
      ***********************************************
     C     FNFN          CHAIN     V11FNF                             33
     C  N33              MOVE      'J'           FNST
     C  N33              UPDATE    V11FNFR
      *
     C                   ENDSR
      *
