     FTARI      UP   E             DISK
     FTARIPVA   IF   E           K DISK    PREFIX(P_)
     C     TARIPVAK      KLIST
     C                   KFLD                    TATANR
     C                   KFLD                    TADATO
     C     TARIPVAK      CHAIN     TARIPVA                            33
     C                   IF        *IN33 = *OFF
     C                   EVAL      TAEØSK = P_TAEØSK
     C                   EVAL      TATSJK = P_TATSJK
     C                   EVAL      TATYRK = P_TATYRK
     C                   EVAL      TAISRK = P_TAISRK
     C                   EVAL      TAELLK = P_TAELLK
     C                   EVAL      TABULK = P_TABULK
     C                   EVAL      TAPOLK = P_TAPOLK
     C                   EVAL      TAROMK = P_TAROMK
     C                   EVAL      TAUNGK = P_TAUNGK
     C                   EVAL      TASLOK = P_TASLOK
     C                   EVAL      TAMULK = P_TAMULK
     C                   EVAL      TAOULK = P_TAOULK
     C                   EVAL      TAGRLK = P_TAGRLK
     C                   EVAL      TAFÆRK = P_TAFÆRK
     C                   EVAL      TAISTK = P_TAISTK
     C                   EVAL      TAMARK = P_TAMARK
     C                   EVAL      TAMEXK = P_TAMEXK
     C                   EVAL      TAVGAK = P_TAVGAK
     C                   EVAL      TAN01K = P_TAN01K
     C                   EVAL      TAN02K = P_TAN02K
     C                   EVAL      TAN03K = P_TAN03K
     C                   EVAL      TAN04K = P_TAN04K
     C                   EVAL      TAN05K = P_TAN05K
     C                   EVAL      TAN06K = P_TAN06K
     C                   EVAL      TAN07K = P_TAN07K
     C                   EVAL      TAN08K = P_TAN08K
     C                   EVAL      TAN09K = P_TAN09K
     C                   EVAL      TAN10K = P_TAN10K
     C                   END
     C                   UPDATE    TARIR
