     FCUNDC     UP   E           K DISK
     c                   movel     ctype         ctyp1             1
     C     ccompn        ifeq      0
     c     cemail        andeq     *blanks
     c     ctyp1         andeq     '*'
     c                   eval      cemail='@user'
     C                   UPDATE    cundcr
     c                   end
      *
