     FCUNDC     UP   E             DISK
     C     cavd          ifeq      *blanks
     C                   MOVE      *ZEROS        CAVD
     C                   UPDATE    CUNDCR
     c                   end
