     Ftrackf    UP   E             DISK
     c     TTTEXL        IFEQ      *blanks
     c                   MOVE      TTTEXT        TTTEXL
     c                   update    trackfr
     c                   end
