      * setter om epostkunde eller ikke I FERDF
      *
     FSYPARF    UP   E           K DISK
     FTELLGE    UF   E           K DISK
     C     key           KLIST
     C                   KFLD                    UNIK              8
     c                   movel     'SYPAR'       UNIK
     C     syrecn        ifeq      0
     C     key           chain     tellge                             33
     c     *in33         ifeq      '0'
     C                   MOVE      GENO          SYRECN
     C                   ADD       1             GENO
     C                   UPDATE    TELLGER
     C                   UPDATE    syparfr
     C                   END
     C                   END
