     FTRUV      UP   E             DISK
     D XAN04           S              4
      *
     C                   IF        %SUBST(TVDTY:1:1) = 'Y' AND
     C                             %SUBST(TVDTY:2:1) <> '0'
     C                   EVAL      XAN04 = 'Y0' + %SUBST(TVDTY:2:2)
     C                   EVAL      TVDTY = XAN04
     C                   END
     C                   UPDATE    TRUVR
