     FPRIK      UP   E           K DISK
     FPRJOIN    IF   E           K DISK
      *
     C     PRJOIK        KLIST
     C                   KFLD                    PKKNR
     C                   KFLD                    PKAVTN
     C                   KFLD                    PKLNR
     C     PRJOIK        CHAIN     PRJOIN                             80
     C                   MOVE      PKLSIO        PKL2IO
     C                   MOVE      PKLS01        PKL201
     C                   MOVE      PKLS02        PKL202
     C                   MOVE      PKLS03        PKL203
     C                   MOVE      PKLS04        PKL204
     C                   MOVE      PKLS05        PKL205
     c                   update    prikr
     c                   clear                   prikr
