     FSADV      IF   E           K DISK
      *
     C     *ENTRY        PLIST
     C                   PARM                    SVAVD
     C                   PARM                    SVTDN
     C                   PARM                    X_SVLI
      *
     C     *LIKE         DEFINE    SVLI          X_SVLI
     C     *LIKE         DEFINE    SVLI          X_SVLI_MAX
     C     SADVK1        KLIST
     C                   KFLD                    SVAVD
     C                   KFLD                    SVTDN
     C                   KFLD                    X_SVLI_MAX
     C     SADVK2        KLIST
     C                   KFLD                    SVAVD
     C                   KFLD                    SVTDN
      *
     C                   EVAL      X_SVLI_MAX = 99999
      *
     C     SADVK1        SETLL     SADV
     C     SADVK2        READPE    SADV                                   33
     C                   IF        *IN33
     C                   Z-ADD     1             X_SVLI
     C                   ELSE
     C                   EVAL      X_SVLI = SVLI + 1
     C                   END
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
