     FCUNDF     UP   E           K DISK
      *
     C                   IF        SYRG<>*BLANKS AND %SUBST(SYRG:10:2)=*BLANKS
     C                   EVAL      SYMVJN = 'J'
     C                   EVAL      SYMVSP = 'J'
     C                   END
      *
     C                   UPDATE    KUNDR
      *
