     FCDERFGM   IP   F   37        DISK
     FCDERFNY   O    F   39        DISK
     ICDERFGM   AA  01
     I                                  1   19  DATA01
     I                                 20   25 0DATA02
     I                                 26   37  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OCDERFNY   E            NY
     O                       DATA01              19
     O                       XDAT02              27
     O                       DATA03              39
