     FSTATLOGF  UP   E             DISK
      *
     C                   MOVE      19            SLDTC
     C                   MOVE      19            SLDTCG
     C                   MOVE      19            SLDTCN
     C                   MOVEL     19            SLDT
     C                   EXCEPT    NY
      *
     OSTLOGFR   E            NY
     O                       SLDTC
     O                       SLDTCG
     O                       SLDTCN
     O                       SLDT
