     FSTANDIGM  IP   F 1313        DISK
     FSTANDINY  O    F 1319        DISK
     ISTANDIGM  AA  01
     I                                  1  433  DATA01
     I                                434  439 0DATA02
     I                                440  725  DATA03
     I                                726  731 0DATA04
     I                                732  807  DATA05
     I                                808  813 0DATA06
     I                                814 1313  DATA07
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C                   MOVE      DATA04        XNR021            2 0
     C                   MOVEL     DATA04        XNR022            2 0
     C                   MOVEL     XNR021        DATA04
     C                   MOVE      XNR022        DATA04
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA06        IFEQ      0
     C                   MOVE      *ZEROS        XDAT06            8 0
     C                   ELSE
     C     DATA06        ADD       19000000      XDAT06
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OSTANDINY  E            NY
     O                       DATA01             433
     O                       XDAT02             441
     O                       DATA03             727
     O                       XDAT04             735
     O                       DATA05             811
     O                       XDAT06             819
     O                       DATA07            1319
