     FKOSBUGM   IP   F  136        DISK
     FKOSBUNY   O    F  140        DISK
     IKOSBUGM   AA  01
     I                                  1    8  DATA01
     I                                  9  107  DATA02
     I                                108  113 0DATA03
     I                                114  136  DATA04
      *
     C     *IN01         IFEQ      '1'
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            8 0
     C                   ELSE
     C     DATA03        ADD       19000000      XDAT03
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OKOSBUNY   E            NY
     O                       DATA01               8
     O                                           10 '19'
     O                       DATA02             109
     O                       XDAT03             117
     O                       DATA04             140
