     FHEADFGM   IP   F 1077        DISK
     FHEADFNY   O    F 1093        DISK
     IHEADFGM   AA  01
     I                                  1   14  DATA01
     I                                 15   16 0DATA2A
     I                                 17   18 0DATA2B
     I                                 19   20 0DATA2C
     I                                 21   26 0DATA03
     I                                 27  720  DATA04
     I                                721  722 0DATA5A
     I                                723  724 0DATA5B
     I                                725  820  DATA06
     I                                821  954  DATA07
     I                                955  960 0DATA08
     I                                961  964  DATA09
     I                                965  970 0DATA10
     I                                971  974  DATA11
     I                                975  980 0DATA12
     I                                981  984  DATA13
     I                                985  990 0DATA14
     I                                991 1077  DATA15
      *
     C     *IN01         IFEQ      '1'
     C     DATA2A        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            2 0
     C                   ELSE
     C                   MOVE      19            XDAT02
     C                   END
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            8 0
     C                   ELSE
     C     DATA03        ADD       19000000      XDAT03
     C                   END
     C     DATA5A        IFEQ      0
     C                   MOVE      *ZEROS        XDAT05            2 0
     C                   ELSE
     C                   MOVE      19            XDAT05
     C                   END
     C     DATA08        IFEQ      0
     C                   MOVE      *ZEROS        XDAT08            8 0
     C                   ELSE
     C     DATA08        ADD       19000000      XDAT08
     C                   END
     C     DATA10        IFEQ      0
     C                   MOVE      *ZEROS        XDAT10            8 0
     C                   ELSE
     C     DATA10        ADD       19000000      XDAT10
     C                   END
     C     DATA12        IFEQ      0
     C                   MOVE      *ZEROS        XDAT12            8 0
     C                   ELSE
     C     DATA12        ADD       19000000      XDAT12
     C                   END
     C     DATA14        IFEQ      0
     C                   MOVE      *ZEROS        XDAT14            8 0
     C                   ELSE
     C     DATA14        ADD       19000000      XDAT14
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OHEADFNY   E            NY
     O                       DATA01              14
     O                       XDAT02              16
     O                       DATA2C              18
     O                       DATA2B              20
     O                       DATA2A              22
     O                       XDAT03              30
     O                       DATA04             724
     O                       XDAT05             726
     O                       DATA5B             728
     O                       DATA5A             730
     O                       DATA06             826
     O                       DATA07             962
     O                       XDAT08             970
     O                       DATA09             974
     O                       XDAT10             982
     O                       DATA11             986
     O                       XDAT12             994
     O                       DATA13             998
     O                       XDAT14            1006
     O                       DATA15            1093
