     FUTSKRSGM  IP   E           K DISK
     F                                     RENAME(UTSR:UTSRGM)
     FUTSKRSNY  IF A E           K DISK
      *
     C     UTPNR         CHAIN     UTSKRSNY                           33
     C     *IN33         IFEQ      '1'
     C                   WRITE     UTSR
     C                   END
      *
