     FTILLGM    IP   F   40        DISK
     FTILLNY    O    F   42        DISK
     ITILLGM    AA  01
     I                                  1   34  DATA01
     I                                 35   40 0DATA02
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTILLNY    E            NY
     O                       DATA01              34
     O                       XDAT02              42
