     FINFOGM    IP   F   91        DISK
     FINFONY    O    F   93        DISK
     IINFOGM    AA  01
     I                                  1   18  DATA01
     I                                 19   24 0DATA02
     I                                 25   91  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OINFONY    E            NY
     O                       DATA01              18
     O                       XDAT02              26
     O                       DATA03              93
