     FSAMLAGM   IP   F  133        DISK
     FSAMLANY   O    F  135        DISK
     ISAMLAGM   AA  01
     I                                  1    7  DATA01
     I                                  8   13 0DATA02
     I                                 14  133  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OSAMLANY   E            NY
     O                       DATA01               7
     O                       XDAT02              15
     O                       DATA03             135
