     FCDBLF2GM  IP   F  241        DISK
     FCDBLF2NY  O    F  242        DISK
     ICDBLF2GM  AA  01
     I                                  1  240  DATA01
     I                                241  241  DATA02
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFNE      ' '
     C                   MOVEL     '0'           XDAT02            2
     C                   MOVE      DATA02        XDAT02
     C                   ELSE
     C                   MOVE      *BLANKS       XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OCDBLF2NY  E            NY
     O                       DATA01             240
     O                       XDAT02             242
