     FBOOKGM    IP   F 1298        DISK
     FBOOKNY    O    F 1372        DISK
     IBOOKGM    AA  01
     I                                  1   27  DATA01
     I                                 28   33 0DATA02
     I                             P   34   35 0DATA03
     I                                 36  216  DATA04
     I                             P  217  220 0DATA05
     I                                221  260  DATA06
     I                             P  261  264 0DATA07
     I                                265  383  DATA08
     I                             P  384  387 0DATA09
     I                                388  734  DATA10
     I                             P  735  738 0DATA11
     I                                739  833  DATA12
     I                             P  834  837 0DATA13
     I                                838  937  DATA14
     I                             P  938  941 0DATA15
     I*                                     9421168 DATA16
     I                                942 1152  DAT16A
     I                               1153 1168  DAT16B
     I                             P 1169 1172 0DATA17
     I                               1173 1192  DATA18
     I                             P 1193 1196 0DATA19
     I                               1197 1216  DATA20
     I                             P 1217 1220 0DATA21
     I                               1221 1240  DATA22
     I                             P 1241 1244 0DATA23
     I                               1245 1264  DATA24
     I                             P 1265 1268 0DATA25
     I                               1269 1272  DATA26
     I                             P 1273 1276 0DATA27
     I                             P 1277 1280 0DATA28
     I                             P 1281 1284 0DATA29
     I                               1285 1290  DATA30
     I                             P 1291 1294 0DATA31
     I                               1295 1298  DATA32
      *
     C     *IN01         IFEQ      '1'
     C                   MOVE      *ZEROS        XDT               8 0
     C                   MOVE      *ZEROS        XBL               7 0
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            2 0
     C                   ELSE
     C                   MOVE      19            XDAT03
     C                   END
     C     DATA05        IFEQ      0
     C                   MOVE      *ZEROS        XDAT05            8 0
     C                   ELSE
     C     DATA05        ADD       19000000      XDAT05
     C                   END
     C     DATA07        IFEQ      0
     C                   MOVE      *ZEROS        XDAT07            8 0
     C                   ELSE
     C     DATA07        ADD       19000000      XDAT07
     C                   END
     C     DATA09        IFEQ      0
     C                   MOVE      *ZEROS        XDAT09            8 0
     C                   ELSE
     C     DATA09        ADD       19000000      XDAT09
     C                   END
     C     DATA11        IFEQ      0
     C                   MOVE      *ZEROS        XDAT11            8 0
     C                   ELSE
     C     DATA11        ADD       19000000      XDAT11
     C                   END
     C     DATA13        IFEQ      0
     C                   MOVE      *ZEROS        XDAT13            8 0
     C                   ELSE
     C     DATA13        ADD       19000000      XDAT13
     C                   END
     C     DATA15        IFEQ      0
     C                   MOVE      *ZEROS        XDAT15            8 0
     C                   ELSE
     C     DATA15        ADD       19000000      XDAT15
     C                   END
     C     DATA17        IFEQ      0
     C                   MOVE      *ZEROS        XDAT17            8 0
     C                   ELSE
     C     DATA17        ADD       19000000      XDAT17
     C                   END
     C     DATA19        IFEQ      0
     C                   MOVE      *ZEROS        XDAT19            8 0
     C                   ELSE
     C     DATA19        ADD       19000000      XDAT19
     C                   END
     C     DATA21        IFEQ      0
     C                   MOVE      *ZEROS        XDAT21            8 0
     C                   ELSE
     C     DATA21        ADD       19000000      XDAT21
     C                   END
     C     DATA23        IFEQ      0
     C                   MOVE      *ZEROS        XDAT23            8 0
     C                   ELSE
     C     DATA23        ADD       19000000      XDAT23
     C                   END
     C     DATA25        IFEQ      0
     C                   MOVE      *ZEROS        XDAT25            8 0
     C                   ELSE
     C     DATA25        ADD       19000000      XDAT25
     C                   END
     C     DATA27        IFEQ      0
     C                   MOVE      *ZEROS        XDAT27            8 0
     C                   ELSE
     C     DATA27        ADD       19000000      XDAT27
     C                   END
     C     DATA28        IFEQ      0
     C                   MOVE      *ZEROS        XDAT28            8 0
     C                   ELSE
     C     DATA28        ADD       19000000      XDAT28
     C                   END
     C     DATA29        IFEQ      0
     C                   MOVE      *ZEROS        XDAT29            8 0
     C                   ELSE
     C     DATA29        ADD       19000000      XDAT29
     C                   END
     C     DATA31        IFEQ      0
     C                   MOVE      *ZEROS        XDAT31            8 0
     C                   ELSE
     C     DATA31        ADD       19000000      XDAT31
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OBOOKNY    E            NY
     O                       DATA01              27
     O                       XDAT02              35
     O                       XDAT03              37P
     O                       DATA03              39P
     O                       DATA04             220
     O                       XDAT05             225P
     O                       DATA06             265
     O                       XDAT07             270P
     O                       DATA08             389
     O                       XDAT09             394P
     O                       DATA10             741
     O                       XDAT11             746P
     O                       DATA12             841
     O                       XDAT13             846P
     O                       DATA14             946
     O                       XDAT15             951P
     O*                        DATA16  1178
     O                       DAT16A            1162
     O                       XDT               1172P
     O                       XDT               1182P
     O                       XDT               1187P
     O                       XBL               1209P
     O                       XBL               1213P
     O                       XBL               1217P
     O                       DAT16B            1233
     O                       XDAT17            1238P
     O                       DATA18            1248
     O                       XDAT19            1253P
     O                       DATA20            1273
     O                       XDAT21            1278P
     O                       DATA22            1298
     O                       XDAT23            1313P
     O                       DATA24            1333
     O                       XDAT25            1338P
     O                       DATA26            1342
     O                       XDAT27            1347P
     O                       XDAT28            1352P
     O                       XDAT29            1357P
     O                       DATA30            1363
     O                       XDAT31            1368P
     O                       DATA32            1372
