     FSTANDTGM  IP   F  945        DISK
     FSTANDTNY  O    F  951        DISK
     ISTANDTGM  AA  01
     I                                  1  355  DATA01
     I                                356  361 0DATA02
     I                                362  805  DATA03
     I                                806  811 0DATA04
     I                                812  869  DATA05
     I                                870  875 0DATA06
     I                                876  945  DATA07
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C                   MOVE      DATA02        XNR021            2 0
     C                   MOVEL     DATA02        XNR022            2 0
     C                   MOVEL     XNR021        DATA02
     C                   MOVE      XNR022        DATA02
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA06        IFEQ      0
     C                   MOVE      *ZEROS        XDAT06            8 0
     C                   ELSE
     C     DATA06        ADD       19000000      XDAT06
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OSTANDTNY  E            NY
     O                       DATA01             355
     O                       XDAT02             363
     O                       DATA03             807
     O                       XDAT04             815
     O                       DATA05             873
     O                       XDAT06             881
     O                       DATA07             951
