     FSADTRHGM  IP   F  954        DISK
     FSADTRHNY  O    F  960        DISK
     ISADTRHGM  AA  01
     I                                  1  356  DATA01
     I                                357  362 0DATA02
     I                                363  814  DATA03
     I                                815  820 0DATA04
     I                                821  878  DATA05
     I                                879  884 0DATA06
     I                                885  954  DATA07
      *
     C     *IN01         IFEQ      '1'
     C                   SELECT
     C     DATA02        WHENEQ    0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C     DATA02        WHENEQ    999999
     C                   MOVE      99999999      XDAT02
     C                   OTHER
     C     DATA02        ADD       19000000      XDAT02
     C                   ENDSL
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA06        IFEQ      0
     C                   MOVE      *ZEROS        XDAT06            8 0
     C                   ELSE
     C     DATA06        ADD       19000000      XDAT06
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OSADTRHNY  E            NY
     O                       DATA01             356
     O                       XDAT02             364
     O                       DATA03             816
     O                       XDAT04             824
     O                       DATA05             882
     O                       XDAT06             890
     O                       DATA07             960
