     FSTATREK   UP   E             DISK
      *
     C                   MOVE      STRDT         XDT6              6 0
     C                   MOVE      XDT6          XNR021            2 0
     C                   MOVEL     XDT6          XNR022            4 0
     C                   MOVEL     XNR021        XDT6
     C                   MOVE      XNR022        XDT6
     C     XDT6          ADD       19000000      STRDT
     C                   EXCEPT    NY
      *
     OSTATREKR  E            NY
     O                       STRDT
