     FTRABGM    IP   F   44        DISK
     FTRABNY    O    F   46        DISK
     ITRABGM    AA  01
     I                                  1   33  DATA01
     I                                 34   39 0DATA02
     I                                 40   44  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTRABNY    E            NY
     O                       DATA01              33
     O                       XDAT02              41
     O                       DATA03              46
