     FBLSTDGM   IP   F  480        DISK
     FBLSTDNY   O    F  481        DISK
     IBLSTDGM   AA  01
     I                                  1  476  DATA01
     I                             P  477  480 0DATA02
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OBLSTDNY   E            NY
     O                       DATA01             476
     O                       XDAT02             481P
