     FTURERGM   IP   F  523        DISK
     FTURERNY   O    F  529        DISK
     ITURERGM   AA  01
     I                                  1   13  DATA01
     I                                 14   19 0DATA02
     I                                 20  275  DATA03
     I                                276  277 0DATA04
     I                                278  279 0DATA05
     I                                280  435  DATA06
     I                                436  441 0DATA07
     I                                442  523  DATA08
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            2 0
     C                   ELSE
     C                   MOVE      19            XDAT04
     C                   END
     C     DATA07        IFEQ      0
     C                   MOVE      *ZEROS        XDAT07            8 0
     C                   ELSE
     C     DATA07        ADD       19000000      XDAT07
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTURERNY   E            NY
     O                       DATA01              13
     O                       XDAT02              21
     O                       DATA03             277
     O                       XDAT04             279
     O                       DATA05             281
     O                       DATA04             283
     O                       DATA06             439
     O                       XDAT07             447
     O                       DATA08             529
