     FGODSJFGM  IP   F  240        DISK
     FGODSJFNY  O    F  246        DISK
     IGODSJFGM  AA  01
     I                                  1    2 0DATA01
     I                                  3   80  DATA02
     I                                 81   86 0DATA03
     I                                 87  186  DATA04
     I                             P  187  190 0DATA05
     I                                191  213  DATA06
     I                             P  214  217 0DATA07
     I                                218  240  DATA08
      *
     C     *IN01         IFEQ      '1'
     C     DATA01        IFEQ      0
     C                   MOVE      *ZEROS        XDAT01            2 0
     C                   ELSE
     C                   MOVE      19            XDAT01
     C                   END
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            8 0
     C                   ELSE
     C     DATA03        ADD       19000000      XDAT03
     C                   END
     C     DATA05        IFEQ      0
     C                   MOVE      *ZEROS        XDAT05            8 0
     C                   ELSE
     C                   MOVE      DATA05        XNR02             2 0
     C                   MOVEL     DATA05        XNR03             3 0
     C                   MOVE      XNR03         XNR032            2 0
     C                   MOVE      XNR02         XNR031            3 0
     C                   MOVEL     XNR031        DATA05
     C                   MOVE      XNR032        DATA05
     C     DATA05        ADD       19000000      XDAT05
     C                   END
     C     DATA07        IFEQ      0
     C                   MOVE      *ZEROS        XDAT07            8 0
     C                   ELSE
     C                   MOVE      DATA07        XNR02             2 0
     C                   MOVEL     DATA07        XNR03             3 0
     C                   MOVE      XNR03         XNR032            2 0
     C                   MOVE      XNR02         XNR031            3 0
     C                   MOVEL     XNR031        DATA07
     C                   MOVE      XNR032        DATA07
     C     DATA07        ADD       19000000      XDAT07
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OGODSJFNY  E            NY
     O                       XDAT01               2
     O                       DATA01               4
     O                       DATA02              82
     O                       XDAT03              90
     O                       DATA04             190
     O                       XDAT05             195P
     O                       DATA06             218
     O                       XDAT07             223P
     O                       DATA08             246
