     FKODTVAGM  IP   F   64        DISK
     FKODTVANY  O    F   77        DISK
     D TAB1            S              3    DIM(44) CTDATA PERRCD(1)
     D TAB2            S             27    DIM(44) ALT(TAB1)
     D TAB3            S              3    DIM(27) CTDATA PERRCD(1)
     D TAB4            S             11    DIM(27) ALT(TAB3)
     IKODTVAGM  AA  01
     I                                  1   20  DATA01
     I                                  4    6  DATA02
     I                                 21   22 0DATA03
     I                                 23   24 0DATA04
     I                                 25   26 0DATA05
     I                                 27   64  DATA06
     I                                 38   64  DATA07
      *
     C     *IN01         IFEQ      '1'
     C     DATA07        IFEQ      *BLANKS
     C     DATA02        LOOKUP    TAB1          TAB2                     33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TAB2          DATA06
     C                   ELSE
     C                   MOVEL     '9'           XAN04             4
     C                   MOVE      DATA02        XAN04
     C                   MOVEL     XAN04         DATA07
     C                   MOVE      DATA07        DATA06
     C                   END
     C                   END
     C     DATA02        LOOKUP    TAB3          TAB4                     33
     C     *IN33         IFEQ      '1'
     C                   MOVE      TAB4          DATA08           11 0
     C                   ELSE
     C                   MOVE      *ZEROS        DATA08
     C                   END
     C                   EXCEPT    NYKODT
     C                   END
      *
     OKODTVANY  E            NYKODT
     O                       DATA01              20
     O                                           22 '19'
     O                       DATA05              24
     O                       DATA04              26
     O                       DATA03              28
     O                       DATA06              66
     O                       DATA08              77
**
AUDAUSTRALIA
BEFBELGIA
BGLBULGARIA
CADCANADA
DKKDANMARK
EEKESTLAND
AEDDE FORENTE ARAB. EMIRATER
FIMFINLAND
DEMFORBUNDSREPULIKKEN TYSKLAND
FRFFRANKRIKE
GRDHELLAS
HKDHONG KONG
INRINDIA
IEPIRLAND (EIRE)
ISKISLAND
ITLITALIA
JPYJAPAN
CNYKINA
MYRMALAYSIA
LVLLATVIA
LITLITAUEN
LUFLUXEMBOURG
NLGNEDERLAND
NZDNEW ZEALAND
NOKNORGE
PKRPAKISTAN
PLZPOLAND
PTEPORTUGAL
ROLROMANIA
SGDSINGAPORE
ESPSPANIA
GBPSTORBRITANNIA
CHFSVEITS
SEKSVERIGE
ZARSØR-AFRIKA
SKKSLOVAKIA
SITSLOVENIA
TWDTAIWAN
THBTHAILAND
CZKTSJEKKIA
HUFUNGARN
USDU.S.A
ATSØSTERRIKE
ECUEU
**
BEF00000243000
BGL00001755000
EEK00000090000
DKK00000045600
FIM00000037600
DEM00000011800
FRF00000039900
GRD00001819000
IEP00000004720
ISK00000510000
ILS00000023269
ITL00011500000
LVL00000004140
LIT00000030200
LUF00000243000
NLG00000013300
NOK00000050000
PTE00001180000
SKK00000240000
SIT00001026000
ESP00000970000
GBP00000004830
CHF00000010300
SEK00000055000
CZK00000210000
ATS00000084000
ECU00000006000
