     FTVINDGM   IP   F   12        DISK
     FTVINDNY   O    F   14        DISK
     ITVINDGM   AA  01
     I                                  1   12  DATA01
      *
     C     *IN01         IFEQ      '1'
     C                   EXCEPT    NY
     C                   END
      *
     OTVINDNY   E            NY
     O                                            2 '19'
     O                       DATA01              14
