     FTFAVHGM   IP   F   75        DISK
     FTFAVHNY   O    F   77        DISK
     ITFAVHGM   AA  01
     I                                  1    9  DATA01
     I                                 10   11 0DATA02
     I                                 12   75  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            2 0
     C                   ELSE
     C                   MOVE      19            XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTFAVHNY   E            NY
     O                       DATA01               9
     O                       XDAT02              11
     O                       DATA02              13
     O                       DATA03              77
