     FFRMDOCGM  IP   F  118        DISK
     FFRMDOCNY  O    F  120        DISK
     IFRMDOCGM  AA  01
     I                                  1   49  DATA01
     I                                 50   55 0DATA02
     I                                 56  118  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OFRMDOCNY  E            NY
     O                       DATA01              49
     O                       XDAT02              57
     O                       DATA03             120
