     FFERJGM    IP   F  128        DISK
     FFERJNY    O    F  130        DISK
     IFERJGM    AA  01
     I                                  1  105  DATA01
     I                                106  111 0DATA02
     I                                112  128  DATA03
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OFERJNY    E            NY
     O                       DATA01             105
     O                       XDAT02             113
     O                       DATA03             130
