     FTRAVHGM   IP   F  131        DISK
     FTRAVHNY   O    F  137        DISK
     ITRAVHGM   AA  01
     I                                  1  114  DATA01
     I                                115  116 0DATA02
     I                                117  118  DATA03
     I                                119  124 0DATA04
     I                                125  130 0DATA05
     I                                131  131  DATA06
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            2 0
     C                   ELSE
     C                   MOVE      19            XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA05        IFEQ      0
     C                   MOVE      *ZEROS        XDAT05            8 0
     C                   ELSE
     C                   MOVE      DATA05        XNR021            2 0
     C                   MOVEL     DATA05        XNR022            2 0
     C                   MOVEL     XNR021        DATA05
     C                   MOVE      XNR022        DATA05
     C     DATA05        ADD       19000000      XDAT05
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTRAVHNY   E            NY
     O                       DATA01             114
     O                       XDAT02             116
     O                       DATA02             118
     O                       DATA03             120
     O                       XDAT04             128
     O                       XDAT05             136
     O                       DATA06             137
