     FKOSBPGM   IP   F   37        DISK
     FKOSBPNY   O    F   39        DISK
     IKOSBPGM   AA  01
     I                                  1   17  DATA01
     I                                 18   37  DATA02
      *
     C     *IN01         IFEQ      '1'
     C                   EXCEPT    NY
     C                   END
      *
     OKOSBPNY   E            NY
     O                       DATA01              17
     O                                           19 '19'
     O                       DATA02              39
