     FLOGUFGM   IP   F   43        DISK
     FLOGUFNY   O    F   47        DISK
     ILOGUFGM   AA  01
     I                                  1   20  DATA01
     I                                 21   26 0DATA02
     I                                 27   32 0DATA03
     I                                 33   43  DATA04
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            8 0
     C                   ELSE
     C     DATA03        ADD       19000000      XDAT03
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OLOGUFNY   E            NY
     O                       DATA01              20
     O                       XDAT02              28
     O                       XDAT03              36
     O                       DATA04              47
