     FTUFEGM    IP   F  130        DISK
     FTUFENY    O    F  140        DISK
     ITUFEGM    AA  01
     I                                  1   21  DATA01
     I                                 22   27 0DATA02
     I                                 28   75  DATA03
     I                                 76   81 0DATA04
     I                                 82  104  DATA05
     I                                105  106 0DATA06
     I                                107  108  DATA07
     I                                109  114 0DATA08
     I                                115  120 0DATA09
     I                                121  130  DATA10
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA06        IFEQ      0
     C                   MOVE      *ZEROS        XDAT06            2 0
     C                   ELSE
     C                   MOVE      19            XDAT06
     C                   END
     C     DATA08        IFEQ      0
     C                   MOVE      *ZEROS        XDAT08            8 0
     C                   ELSE
     C     DATA08        ADD       19000000      XDAT08
     C                   END
     C     DATA09        IFEQ      0
     C                   MOVE      *ZEROS        XDAT09            8 0
     C                   ELSE
     C                   MOVE      DATA09        XNR021            2 0
     C                   MOVEL     DATA09        XNR022            2 0
     C                   MOVEL     XNR021        DATA09
     C                   MOVE      XNR022        DATA09
     C     DATA09        ADD       19000000      XDAT09
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTUFENY    E            NY
     O                       DATA01              21
     O                       XDAT02              29
     O                       DATA03              77
     O                       XDAT04              85
     O                       DATA05             108
     O                       XDAT06             110
     O                       DATA06             112
     O                       DATA07             114
     O                       XDAT08             122
     O                       XDAT09             130
     O                       DATA10             140
