     FTRANGM    IP   F  240        DISK
     FTRANNY    O    F  247        DISK
     ITRANGM    AA  01
     I                                  1  174  DATA01
     I                                175  180 0DATA02
     I                                181  240  DATA03
      *
     C     *IN01         IFEQ      '1'
     C                   MOVE      *ZEROS        XDAT04            2 0
     C                   MOVE      *ZEROS        XDAT05            5 0
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C                   ELSE
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OTRANNY    E            NY
     O                       DATA01             174
     O                       XDAT02             182
     O                       DATA03             242
     O                       XDAT04             244P
     O                       XDAT05             247P
