     FAVFRHGM   IP   F  202        DISK
     FAVFRHNY   O    F  206        DISK
     IAVFRHGM   AA  01
     I                                  1  134  DATA01
     I                                135  140 0DATA02
     I                                141  146 0DATA03
     I                                147  202  DATA04
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            2 0
     C                   ELSE
     C                   MOVE      19            XDAT02
     C                   END
     C     DATA03        IFEQ      0
     C                   MOVE      *ZEROS        XDAT03            2 0
     C                   ELSE
     C                   MOVE      19            XDAT03
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OAVFRHNY   E            NY
     O                       DATA01             134
     O                       XDAT02             136
     O                       DATA02             142
     O                       XDAT03             144
     O                       DATA03             150
     O                       DATA04             206
