     FFIRMGM    IP   F  160        DISK
     FFIRMNY    O    F  162        DISK
     IFIRMGM    AA  01
     I                                  1  133  DATA01
     I                                134  139 0DATA02
     I                                141  160  DATA03
      *
     C     *IN01         IFEQ      '1'
     C                   Z-ADD     19950101      XDAT02            8 0
     C                   EXCEPT    NY
     C                   END
      *
     OFIRMNY    E            NY
     O                       DATA01             133
     O                       XDAT02             141
     O                       DATA03             162
