     FFAKTGM    IP   F  183        DISK
     FFAKTNY    O    F  189        DISK
     IFAKTGM    AA  01
     I                                  1   87  DATA01
     I                                 88   89 0DATA02
     I                                 90   94  DATA03
     I                                 95  100 0DATA04
     I                                101  102 0DATA5A
     I                                103  104 0DATA5B
     I                                105  106 0DATA5C
     I                                107  183  DATA06
      *
     C     *IN01         IFEQ      '1'
     C     DATA02        IFEQ      0
     C                   MOVE      *ZEROS        XDAT02            2 0
     C                   ELSE
     C                   MOVE      19            XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA5A        IFEQ      0
     C                   MOVE      *ZEROS        XDAT05            2 0
     C                   ELSE
     C                   MOVE      19            XDAT05
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OFAKTNY    E            NY
     O                       DATA01              87
     O                       XDAT02              89
     O                       DATA02              91
     O                       DATA03              96
     O                       XDAT04             104
     O                       XDAT05             106
     O                       DATA5C             108
     O                       DATA5B             110
     O                       DATA5A             112
     O                       DATA06             189
