     FZADHGM    IP   F  916        DISK
     FZADHNY    O    F  924        DISK
     IZADHGM    AA  01
     I                                  1  434  DATA01
     I                                435  440 0DATA02
     I                                441  726  DATA03
     I                                727  732 0DATA04
     I                                733  808  DATA05
     I                                809  814 0DATA06
     I                                815  888  DATA07
     I                                889  894 0DATA08
     I                                895  916  DATA09
      *
     C     *IN01         IFEQ      '1'
     C                   SELECT
     C     DATA02        WHENEQ    0
     C                   MOVE      *ZEROS        XDAT02            8 0
     C     DATA02        WHENEQ    999999
     C                   MOVE      99999999      XDAT02
     C                   OTHER
     C     DATA02        ADD       19000000      XDAT02
     C                   END
     C     DATA04        IFEQ      0
     C                   MOVE      *ZEROS        XDAT04            8 0
     C                   ELSE
     C     DATA04        ADD       19000000      XDAT04
     C                   END
     C     DATA06        IFEQ      0
     C                   MOVE      *ZEROS        XDAT06            8 0
     C                   ELSE
     C     DATA06        ADD       19000000      XDAT06
     C                   END
     C     DATA08        IFEQ      0
     C                   MOVE      *ZEROS        XDAT08            8 0
     C                   ELSE
     C     DATA08        ADD       19000000      XDAT08
     C                   END
     C                   EXCEPT    NY
     C                   END
      *
     OZADHNY    E            NY
     O                       DATA01             434
     O                       XDAT02             442
     O                       DATA03             728
     O                       XDAT04             736
     O                       DATA05             812
     O                       XDAT06             820
     O                       DATA07             894
     O                       XDAT08             902
     O                       DATA09             924
