     FKODTS8    UP   E             DISK
      *
     C     KS8AVG        IFEQ      'RR'
     C     KS8AVG        OREQ      'RH'
     C     KS8AVG        OREQ      'RL'
     C     KS8AVG        OREQ      'BO'
     C     KS8AVG        OREQ      'BG'
     C                   MOVE      'J'           KS8FTX
     C                   ELSE
     C                   MOVE      ' '           KS8FTX
     C                   END
     C                   UPDATE    KOS8R
      *
