     FKOSTBGM   IP   E             DISK
     F                                     RENAME(KOSTBR:KOSBRGM)
     FKOSTB     O  A E             DISK
     FHEADF     IF   E           K DISK
     D                 DS
     D  KBTUNR                 1      8  0
     D  KBGEBY                 7      7  0
     D  KBNØKK                 8      8  0
      *
     C     HEADFK        KLIST
     C                   KFLD                    KBAVD
     C                   KFLD                    KBOPD
      *
     C                   MOVE      *ZEROS        KBKAVD
     C                   MOVE      *BLANKS       KBKKEY
     C                   SELECT
     C     KBNØKK        WHENEQ    0
     C     KBOPD         ANDNE     0
     C                   MOVE      KBAVD         KBKAVD
     C                   MOVEL     KBOPD         KBKKEY
     C                   MOVE      KBKN          KBKKEY
     C     KBNØKK        WHENEQ    1
     C                   MOVE      KBAVD         KBKAVD
     C                   MOVEL     KBOPD         KBKKEY
     C     KBNØKK        WHENEQ    2
     C     HEADFK        CHAIN     HEADF                              33
     C     *IN33         IFEQ      '0'
     C                   MOVEL     HEPRO         KBKKEY
     C                   ELSE
     C                   MOVEL     '99999999'    KBKKEY
     C                   END
     C     KBNØKK        WHENEQ    3
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      KBAVD         KBKAVD
     C     *IN33         IFEQ      '0'
     C                   MOVEL     HEGN          KBKKEY
     C                   ELSE
     C                   MOVEL     '99999999'    KBKKEY
     C                   MOVE      '9999999'     KBKKEY
     C                   END
     C     KBNØKK        WHENEQ    4
     C     HEADFK        CHAIN     HEADF                              33
     C                   MOVE      KBAVD         KBKAVD
     C     *IN33         IFEQ      '0'
     C                   MOVEL     HERFA         KBKKEY
     C                   ELSE
     C                   MOVEL     'ZZZZZZZZ'    KBKKEY
     C                   MOVE      'ZZZZZZZ'     KBKKEY
     C                   END
     C                   OTHER
     C                   ENDSL
     C                   WRITE     KOSTBR
