     FSADV      UP   E             DISK
      *
     C     SVMFR         IFEQ      ' '
     C                   MOVE      '1'           SVMFR
     C                   END
     C                   UPDATE    SADVR
      *
