     FTRAVV5    IP   E             DISK
     FFAKT      UF   E           K DISK
     C     KEY           KLIST
     C                   KFLD                    TVOAVD
     C                   KFLD                    TVOPD
     C     TVTYP         IFEQ      'B'
     C     KEY           SETLL     FAKT
     C     KEY           READE     FAKT                                   33
     C     *IN33         DOWEQ     '0'
     C     FAKDA         IFNE      'K'
     C                   MOVEL     'X'           FACD21
     C                   END
     C                   UPDATE    FAKTR
     C     KEY           READE     FAKT                                   33
     C                   END
     C                   END
