     FGODSJL01  IP   E           K DISK
     FGODSGF    O  A E             DISK
     C     XSTART        IFEQ      ' '
     C                   MOVE      'J'           XSTART            1
     C                   MOVEL     GOGN          XGN12
     C                   END
     C                   MOVEL     GOGN          XGN122           12
     C     XGN12         IFNE      XGN122
     C                   ADD       1             XGN03
     C                   MOVE      XGN03         GGGN2
     C                   MOVE      XGN12         GGGN1
     C                   WRITE     GODSGFR
     C                   END
     C                   MOVEL     GOGN          XGN12            12
     C                   MOVE      GOGN          XGN03             3 0
     CLR                 ADD       1             XGN03
     CLR                 MOVE      XGN03         GGGN2
     CLR                 MOVE      XGN12         GGGN1
     CLR                 WRITE     GODSGFR
