     FSADHG     IP   F  894        DISK
     FSADH      O  A F  900        DISK
     ISADHG     AA  01
      *
     I                                  1  166  DATA01
     I                             P  167  171 0DATA02
     I                                172  400  DATA03
     I                                401  600  DATA04
     I                                601  800  DATA05
     I                                801  894  DATA06
      *
     C     DATA02        IFEQ      0
     C                   MOVE      *BLANKS       DATA12           11
     C                   ELSE
     C                   MOVEL     DATA02        DATA12
     C                   END
     C                   EXCEPT    NY
      *
     OSADH      EADD         NY
     O                       DATA01             166
     O                       DATA12             177
     O                       DATA03             406
     O                       DATA04             606
     O                       DATA05             806
     O                       DATA06             900
