     FSADAVGE   UP   E             DISK
     C                   MOVE      19900101      AGDTF
     C                   MOVE      99999999      AGDTT
     C                   UPDATE    SADAVGER
