     FSAEHG     IP   F  860        DISK
     FSAEH      O  A F  866        DISK
     ISAEHG     AA  01
      *
     I                                  1  164  DATA01
     I                             P  165  169 0DATA02
     I                                170  400  DATA03
     I                                401  600  DATA04
     I                                601  800  DATA05
     I                                801  860  DATA06
      *
     C     DATA02        IFEQ      0
     C                   MOVE      *BLANKS       DATA12           11
     C                   ELSE
     C                   MOVEL     DATA02        DATA12           11
     C                   END
     C                   EXCEPT    NY
      *
     OSAEH      EADD         NY
     O                       DATA01             164
     O                       DATA12             175
     O                       DATA03             406
     O                       DATA04             606
     O                       DATA05             806
     O                       DATA06             866
