     FSAEHCMPG  IP   F  205        DISK
     FSAEHCMP   O  A F  211        DISK
     ISAEHCMPG  AA  01
      *
     I                                  1   63  DATA01
     I                             P   64   68 0DATA02
     I                                 69  205  DATA03
      *
     C     DATA02        IFEQ      0
     C                   MOVE      *BLANKS       DATA12           11
     C                   ELSE
     C                   MOVEL     DATA02        DATA12           11
     C                   END
     C                   EXCEPT    NY
      *
     OSAEHCMP   EADD         NY
     O                       DATA01              63
     O                       DATA12              74
     O                       DATA03             211
